{
    "poll_list": [
        {
            "title": "Increase the MIP65 (RWA007-A) Debt Ceiling - March 13, 2023",
            "index": "20119",
            "option": "Yes",
            "supporting_mkr": "76,936",
            "highest_fraction": 0.77
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/request-to-poll-increase-debt-ceiling-for-mip65-by-750m-to-1-250m/20119",
            "title": "[Request to Poll] Increase Debt Ceiling for MIP65 by 750M to 1,250M ",
            "index": 20119,
            "category": [
                "Governance"
            ],
            "tags": [
                "impact-:-high",
                "mip65"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#1",
                    "likes": "3",
                    "time": "10/03/2023-22:14:36",
                    "content": " Summary Requesting DAO sentiment regarding the proposal to increase the DC for MIP65 by 750M to 1,250M to deploy into a 6 month US Treasury ladder strategy with bi-weekly roll-over.  Key Details from the aforementioned proposal:  Legal Structure The debt ceiling increase amount will be deployed under the same terms and transaction mechanisms as set out and approved in MIP65. A structure based upon MIP65 will be setup to hold assets under this debt ceiling increase to mitigate any single entity exposure concerns.  Strategy’s Execution and Adjustment Mechanics   With the 750M, US Treasuries will be purchased with maturities equally split over 6 months such that, bi-weekly, a similar amount of US Treasuries mature (i.e. 12 “slots” over 6 months - i.e. 750M/12 = 62.5M per slot).   As US Treasuries mature every 2nd week, the following steps are taken: a. Net yield is calculated as any net amount above the original “slot” investment. This Net Yield amount is transmitted to the Surplus Buffer. b. The MIP105 Asset Allocation Number for Viridian is calculated and if total actual assets held under MIP65 are more than 50M USD above this number, Assets are immediately paid into the MIP65 Vault (and thus USDC returned into the PSM) such that the actual assets in MIP65 match the max MIP105 Asset Allocation Number for Viridian. c. Should the MIP105 Asset Allocation Number for Viridian show that the total actual assets held under MIP65 are more than 50M below this number and the MIP65 Debt Ceiling not fully utilised, then a draw on the Debt Ceiling will be made such that the actual assets in MIP65 again match the max MIP105 Asset Allocation Number for Viridian. d. After the b. adjustments any amounts left for investment are used to acquire US Treasuries with maturity 6 months ahead (to continue the ladder). e. After the c. adjustments any new investment amounts are used to acquire US Treasuries proportionally along the bi-weekly, 6 months ladder.    Emergency liquidation Should the inherent liqudity in the ladder strategy not be sufficient, then the portfolio can we liquidated within 1 to 2 days using a MakerDAO Resolution Instruction Set.  Asset Strategy Implementation Partner: Sygnum Bank   The Asset Strategy will be implemented by Sygnum Bank under an Execution Mandate set out in a MakerDAO Resolution Instruction.  Poll 1 - Increase the DC for MIP65 by 750M to 1,250M to deploy into a 6 month US Treasury ladder strategy with bi-weekly roll-over.  Yes No Abstain   Poll 2 - Remove the current DC-IAM for MIP65 to enable the DAO to deploy into the strategy more quickly.  Yes No Abstain  ",
                    "links": [
                        "https://www.sygnum.com/",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/43",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/67",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806/67",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/52",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/128",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/106",
                        "https://forum.makerdao.com/t/coldiron-eth-delegate-platform/11193/172",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/49",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/23"
                    ],
                    "GPT-summary": "The author of the post is requesting feedback from the DAO regarding the proposal to increase the debt ceiling for MIP65 by 750M to 1,250M to deploy into a 6 month US Treasury ladder strategy with bi-weekly roll-over. The post provides key details of the proposal, including legal structure, strategy execution and adjustment mechanics, and emergency liquidation. The post also includes two polls for the DAO to vote on.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None"
                    ],
                    "Sentiment": 5.2828335879806465
                },
                {
                    "author_link": "https://forum.makerdao.com/u/welsh",
                    "index": "#2",
                    "likes": "1",
                    "time": "13/03/2023-16:47:53",
                    "content": "I would encourage all @Recognized-Delegates to abstain or vote against this poll until we get an answer to questions raised over a week ago by @GFXlabs here: Proposal to increase Debt ceiling for MIP65 by 750M to 1250M - #8 by GFXlabs and here: Real-World Asset Report - 2023-01 - #2 by GFXlabs which seem to be being ignored by @Allan_Pedersen and @steakhouse ",
                    "links": [
                        "https://forum.makerdao.com/t/real-world-asset-report-2023-01/19934/2"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#3",
                    "likes": "0",
                    "time": "13/03/2023-17:00:26",
                    "content": "    Aes:  Poll 2 - Remove the current DC-IAM for MIP65 to enable the DAO to deploy into the strategy more quickly.   Can you elaborate on the reason to this second poll?. The first poll (DC increase) is a risk parameter change well argumented. I don’t see the reasoning for the DCIAM parameter change explained to the community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.319444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/roo",
                    "index": "#4",
                    "likes": "2",
                    "time": "13/03/2023-17:19:42",
                    "content": "All the information Steakhouse has regarding MIP65 and its expenses is included in our latest Real-World Asset Report. We are not a party to these fee calculations, so additional information for these specific transactions will need to be provided by Monetalis ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#5",
                    "likes": "1",
                    "time": "13/03/2023-17:27:43",
                    "content": "There is a significant opportunity cost to leaving the existing DC-IAM parameters in place and given what took place over this prior weekend, I think it is in the DAO’s best interest to have more flexibility and be enabled to move quickly should they so desire. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 7.208333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#6",
                    "likes": "0",
                    "time": "13/03/2023-17:37:59",
                    "content": "Given the volatility we’re seeing in the bond market with wild swings in the front end of the curve, removing the DC-IAM seems like the wrong move, since it removes the likelihood of DCAing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#7",
                    "likes": "0",
                    "time": "13/03/2023-18:48:49",
                    "content": "The Monetalis expenses, dated Dec 1 2022, with the total sum of $425k are as follows;  Two Quarterly Payments of 15bps ( Q422 and Q123 ): $375k Legal setup fees becoming due in Q123: $50k  We confirm that Monetalis will not be paid outside of the constraints of MIP65. The agreement with the Trustee will not allow it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#8",
                    "likes": "2",
                    "time": "13/03/2023-19:24:45",
                    "content": "Why is Monetalis charging Maker 15 basis points on the full 500 million (15bps * 500M / 4 = 187.5 thousand) for the fourth quarter when the average assets under management for the fourth quarter was much lower? Ramp up started in November…… Wait also, also charging for two quarters? Q123 has not even ended  image1170×1263 52.3 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#9",
                    "likes": "0",
                    "time": "13/03/2023-20:17:59",
                    "content": "    Allan_Pedersen:  Two Quarterly Payments of 15bps ( Q422 and Q123 ): $375k   Can you please elaborate upon how Monetalis was authorized to pay itself these sums on this date?  The full 500m DAI had not even been deployed on Dec 1. Dec 1 is also not the end of the quarter, and the time-weighted average of AUM would not have been for the full $187,500 for Q4. Why was Monetalis drawing payment on Dec 1 for AUM in Q1 2023? You didn’t know for sure what AUM would be. Can you produce documentation that is required for outgoing currency transactions of $20,000 or more under the Sygnum restriction letter?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.708333333333333
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/proposal-to-increase-debt-ceiling-for-mip65-by-750m-to-1250m/20060",
            "title": "Proposal to increase Debt ceiling for MIP65 by 750M to 1250M ",
            "index": 20060,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "mip65"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#1",
                    "likes": "7",
                    "time": "04/03/2023-22:06:00",
                    "content": " References  MIP65 MIP65 Documentation HQ MIP65 General FAQ MIP65 Report MIP105 RWA Scope Framework   Summary We propose a debt ceiling increase for MIP65 of 750M for the purpose of deploying this amount into a 6 month US Treasury ladder strategy with bi-weekly roll-over.  Motivation Allow Maker to take advantage of the current yield environment, and generate further revenue on Maker’s PSM Assets, in a flexible, liquid, manner that can accommodate material adjustments and upgrades as may be required under prevailing, relevant Maker RWA related policies.  Key Details  Legal Structure The debt ceiling increase amount will be deployed under the same terms and transaction mechanisms as set out and approved in MIP65. A structure based upon MIP65 will be setup to hold assets under this debt ceiling increase to mitigate any single entity exposure concerns.  MIP105-based Viridian Asset Allocation Calculation for DC To determine a Max Debt Ceiling for MIP65, we have used the following calcuation conforming to the MIP105 calculation for RWA allocation towards the Viridian Cluster (MIP105 6.3.1):  Our assumption is the following list of Legacy Assets and Amounts (from makerburn)  I.e. we are proposing to increase MIP65 Debt Ceiling to 90% of what is max DC for the Viridian Cluster under MIP105. You will see in the Strategy Execution and Adjustment Mechanics section that we will calculate this on a bi-weekly basis and adjust accordingly to ensure we are inline with MIP105 allocations. We expect very shortly to see the Spring Cluster with BlockTower proposing similar sized allocations for an equally MIP105 conforming portfolio strategy - and as such providing the intended balance proposed in MIP105 The fact that we request this allocation immediately is purely because Monetalis is ready to deliver this strategy and believe it is to Maker’s benefit to take immediate advantage of the current yield environment as much as it can.  Asset Strategy After review of various highly liquid money market options, we found that the simple solution of laddering US Treasuries over a 6 month period with bi-weekly maturities present a strong, flexible and effective solution for Maker:  Low cost (trading, custody etc.) Tax efficiency (incl no stamp duty) Inherent liqudity in strategy as US treasuries mature on the ladder Large liquid market allowing for large scale quick and low cost exit/entry of capital Strong yield characteristics with highest possible credit rating Simple mechanics of strategy Transparent asset holdings Can be moved to more complex (or different ladder) strategy should it be required over time as yield curve changes or other considerations dictate such changes.   Strategy’s Execution and Adjustment Mechanics   With the 750M, US Treasuries will be purchased with maturities equally split over 6 months such that, bi-weekly, a similar amount of US Treasuries mature (i.e. 12 “slots” over 6 months - i.e. 750M/12 = 62.5M per slot).   As US Treasuries mature every 2nd week, the following steps are taken: a. Net yield is calculated as any net amount above the original “slot” investment. This Net Yield amount is transmitted to the Surplus Buffer. b. The MIP105 Asset Allocation Number for Viridian is calculated and if total actual assets held under MIP65 are more than 50M USD above this number, Assets are immediately paid into the MIP65 Vault (and thus USDC returned into the PSM) such that the actual assets in MIP65 match the max MIP105 Asset Allocation Number for Viridian. c. Should the MIP105 Asset Allocation Number for Viridian show that the total actual assets held under MIP65 are more than 50M below this number and the MIP65 Debt Ceiling not fully utilised, then a draw on the Debt Ceiling will be made such that the actual assets in MIP65 again match the max MIP105 Asset Allocation Number for Viridian. d. After the b. adjustments any amounts left for investment are used to acquire US Treasuries with maturity 6 months ahead (to continue the ladder). e. After the c. adjustments any new investment amounts are used to acquire US Treasuries proportionally along the bi-weekly, 6 months ladder.    Strategy Model & Economics A ladder over the next 6 months has been constructed as an example:  1308×368 91.8 KB  The strategy delivers a net annualised yield of 4.6% to 4.5% after custody and expected trading cost. This means every biweek this strategy accrues (roughly) yield of 750M x 4.5% x 2/52 = 1.3M to Maker given continued roll-over. On a “Cash to Surplus Buffer” basis, this ladder will deliver an increasing amount of Cash Yield every second week as the ladder matures over the 6 months. To illustrate with rough numbers:  The first 62.5M slot maturing in 2 weeks delivers 62.5M x 4.5% x 2/52 = 108K in Cash Yield The slot maturing in 3 months delivers 62.5M x 4.5% x 3/12 = 703K in Cash Yield The slot maturing in 6 months delivers 62.5M x 4.5% x 6/12 = 1.4M in Cash Yield   Emergency liquidation Should the inherent liqudity in the ladder strategy not be sufficient, then the portfolio can we liquidated within 1 to 2 days using a MakerDAO Resolution Instruction Set.  Asset Strategy Implementation Partner: Sygnum Bank  The Asset Strategy will be implemented by Sygnum Bank under an Execution Mandate set out in a MakerDAO Resolution Instruction. it is important to note that Monetalis does NOT act as asset manager or investment advisor - or have any influence on the purchase of any individual US Treasury instruments  MakerDAO Resolution Instruction Sets The set of MakerDAO resolution instructions required to implement the specific deployment will be released shortly ahead of a Debt Ceiling Increase Poll - and will be accompanied by an assessment by a relevant member with legal credentials in the Maker Community. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-documentation-hq/17923",
                        "https://forum.makerdao.com/t/mip65-general-faq/19754",
                        "https://dune.com/SebVentures/makerdao-mip65",
                        "https://forum.makerdao.com/t/mip105-the-real-world-asset-collateral-scope-framework/19688",
                        "https://www.sygnum.com/",
                        "https://forum.makerdao.com/t/request-to-poll-increase-debt-ceiling-for-mip65-by-750m-to-1-250m/20119",
                        "https://forum.makerdao.com/t/governance-and-risk-call-230-thursday-march-16-2023-17-00-utc/20199"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Law and regulations",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416739753752741
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#2",
                    "likes": "2",
                    "time": "04/03/2023-22:30:35",
                    "content": "TLDR  Government MMF weighted average return is comparable to the proposed 6 month ladder but with considerably less operational burden, liquidity risk and trading costs (gas fees)  It is good to see further investment opportunities. Quick question: why not place the funds in government money market funds (MMFs), which invest in those same treasuries but provide daily liquidity? This is especially pertinent as DAI’s liability maturity profile is shorter than the proposed three-month duration (six-month ladder). This method would create additional investment oversight and operational requirements, as the ladder maturities need to be rolled over based on DAI’s changing supply and demand. However, if we had term or notice DAI, I would understand why this method is beneficial if we wanted to extend duration to one to three year investing in treasuries. Nevertheless, the proposed three-month duration is in line with the 60-90-day weighted average life of investments in money market funds. Therefore, the net yield we get is comparable. Eg as of 3/2 SGPXX has a 7 day yield of ~4.50%  image1170×2532 336 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.283333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#3",
                    "likes": "4",
                    "time": "04/03/2023-23:00:25",
                    "content": "    Allan_Pedersen:  implemented by Sygnum Bank   Has there ever been a solution for reducing the 30 bps impact of each movement of funds through Sygnum. On the proposed 750,000,000 DAI, that would result in more than 2,000,000 DAI lost to taxes just to move the funds. Then the funds coming back would presumably be subject to the same tax under Swiss laws? What can you do to lessen this impact, since it results in considerable sums at this scale?     Allan_Pedersen:  a Debt Ceiling Increase Poll   We recommend this poll be after the first payment made on the existing 500,000,000 DAI loan. That would still be on or around March 31st? Governance should make sure funds can safely return before even considering more than doubling the existing debt ceiling, on the off chance they somehow get stuck or incur unexpected expense. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.141666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#4",
                    "likes": "1",
                    "time": "05/03/2023-10:20:17",
                    "content": "Hi @GFXlabs a) This allocation and strategy is designed to not incur any stamp duty. b) I think I have a solution - but let me get back to you on that ASAP. Thx, Allan ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#5",
                    "likes": "1",
                    "time": "05/03/2023-10:42:59",
                    "content": "Hi @TRUEMAKER A MMF (say a CNAV) would also be a great solution for Maker’s needs as you suggest and we certainly did consider it - however  - due to limitations on structure, jurisdiction, financial market access and tax - this strategy comes out as the best practical solution at this particular point in time to address Maker’s needs for immediate deployment and net yield generation. In practice, the operational burden and associated costs are kept quite limited due to the Sygnum Execution Mandate and the simplicity of the strategy. The strategy is deliberately designed to be flexible enough to allow for allocation movements should these underlying conditions change and new allocation options become feasible. Crypto’s/DAO’s practical access to capital markets is a rather fluid and fast changing situation we try to keep on top of and adjust for. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.962816944959802
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#6",
                    "likes": "1",
                    "time": "06/03/2023-03:26:52",
                    "content": "    Allan_Pedersen:  a) This allocation and strategy is designed to not incur any stamp duty.   That’s fantastic news. Next request: Can you make sure any formal text for a proposal allows for using USDP as well? It pays no yield and does not meaningfully support the fixed exchange rate of $1 per DAI, but represents an existential risk counterparty. Shortening that list by one name would be a value add. Unsure how hard it is to redeem USDP vs USDC, but keeping the option open seems like it could only be useful. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.421296296296296
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#7",
                    "likes": "1",
                    "time": "06/03/2023-15:32:24",
                    "content": "Thanks, Allan. I agree that it would achieve similar results. To maximize yield, it would be beneficial to analyze trends in MMFs WAL and WAM, indicating portfolio managers’ yield curve expectation of whether to extend or reduce investments duration. This could feed the ladder strategy (stay the same, go longer or shorter). As market conditions change, i would love if this was part of the on going investment process. Eg treasuries mmfs (green line) WAL has been consistently reducing, from 100 days to 60 days, as the current expectations are that short-term rates will continue to rise over the next 6-12 months.  image928×776 144 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#8",
                    "likes": "7",
                    "time": "08/03/2023-13:46:40",
                    "content": "Looking more closely at this, we request some additional information:   What are these two expenses, dated Dec 1, 2022, that total $460,000? They are labelled “Monetalis Expenses.”   Are there any authorized payments to Monetalis beyond “A Monetalis fee of 0.15% of AuM deployed p.a. paid quarterly” under MIP65 and a one-time reimbursement for legal setups? If so, can you please point us at the documentation to support that?   ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP65#specification-proposal-details",
                        "https://gateway.pinata.cloud/ipfs/QmZeCuuKw774Vzr76HFU6Jw1ZPyz44zeCoq35YNeJ5vUMW",
                        "https://forum.makerdao.com/t/request-to-poll-increase-debt-ceiling-for-mip65-by-750m-to-1-250m/20119/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#9",
                    "likes": "0",
                    "time": "12/03/2023-21:03:51",
                    "content": "Looking at recent events I think this proposal is more prudent that in a long time. Considering the questions being raised by @GFXlabs and others I do think there are refinements that can be made. In particular I think it’s important to establish a cash flow back to the protocol in line with this proposal. Those concerns aside I think the most important factors at this time is time, exposure and revenue. MIP-65 provides a proven solution to diversify Maker’s PSM holdings that is close to immediately available. While I’d ideally would like to see parallel as well as alternative solutions (money market funds) developed these will necessarily take time to establish, test and deploy. I think Maker is better served utilizing MIP-65 to capacity while we await those processes to finish. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.363095238095237
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#10",
                    "likes": "0",
                    "time": "12/03/2023-21:06:37",
                    "content": "Has there been an explanation yet on the expenses @GFXlabs has highlighted? The poll is coming up soon and I would like to understand them better before voting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#11",
                    "likes": "1",
                    "time": "14/03/2023-21:17:21",
                    "content": " MIP65 & Fees We appreciate the feedback we have received and recognise that communication regarding  the fee structure for MIP65 could have been better. We acknowledge the confusion and concern that this has brought to some community members and so we wish to take this opportunity to rectify the situation. At implementation of MIP65 we adopted a simple interpretation of fees that allowed Monetalis a DC x 15bps on a prepayment format mostly because we just went with the simplest model, knowing that the Arranger model was in its infancy and that further changes were expected to be incorporated. With hindsight we could also have applied various Maker tools for financing expenses such as SPF’s etc to communicate these items better. With the proposed DC Increase, we now get a chance to focus on revising the status quo of the structure and fees. We are, in fact, in the midst of creating new instruction sets and revision to key agreements to implement the DC Increase. We have learned quite a lot over the past months and, as a result, believe we have been able to implement strong improvements in several key documents such as the trust deed polls. The document that controls the MIP65 fee structure is the Reporting Agreement between the Trustee and Monetalis. Upon consideration, we have come to realise that we shouldn’t now try to develop a new clever interpretation of MIP65’s definition of Arranger Fees, because the detailed, crystal clear, long-term, generalised Arranger Fee and Compensation Structure will be stated within the MIP105 Scope Framework as determined by the RWA Council, given the passing of the Endgame proposals. And that would dictate how Monetalis is compensated in the long-term under MIP65 as Arranger. We also acknowledge that this Scope Framework clarity on Arranger compensation is probably not going to come before in some months time (again given a positive vote on the Endgame proposal). So what do we do in the interim? Because we remain convinced that it is in Maker’s interest to pursue, immediately, the DC increase to lock in yields in the short US treasury markets - and in fact put more in after the recent increase in stablecoins with the protocol. We are ultimately in this Arranger relationship with Maker for the long-term and to demonstrate our commitment and even further simplify the fee structure, we will accept the following simple, reduced, fixed fee structure until the MIP105 RWA Scope Framework (again if Endgame is approved) dictates a clear Arranger fee structure - i.e independent of DC or AuM:  Quarterly fixed fee: USD 250K (i.e. 8bps p.a. @ 1250K) Paid first upon deployment of DC Increase amount and thereafter every third month until MIP105 RWA Scope Framework supersedes it.  We hope that the revised fee structure provides the community with comfort that we have reviewed the concerns raised and implemented meaningful changes - here we have incorporated a formula easier to understand even though it results in a lower interim fee for Monetalis. We have put this fee structure into the new Reporting Agreement and share a draft copy of the agreement which remains subject to final review by legal counsel. This new Reporting Agreement will become in-force with a potential DC Increase Executive vote as part of the DC Increase Ratification Instruction set. We note also that this Reporting Agreement has no allowances for legal or other fee reimbursements as we have come to believe this type of expenses are better directly acknowledged and integrated into the MakerDAO Resolution Instruction sets for clarity and transparency. We hope this puts the Community members at ease, and we can stay on course to aid Maker maintaining and scaling a healthy yield bringing RWA side for the long-term value of Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.682723978919631
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#12",
                    "likes": "1",
                    "time": "14/03/2023-21:49:38",
                    "content": "Given that Monetalis has received compensation for services rendered in Q1, could you clarify how this interacts with point 2.3? “The Trustee shall pay to the Reporting Agent the first Quarterly Fixed Arrangement Fee within 3 business days of the Trustee completing all of the actions stated under the MakerDAO Resolution Instruction set named “Deployment of US Treasury Ladder”. . Thereafter, the Quarterly Fixed Arrangement Fee shall be paid every 90 calendar days.” The bolded part seems to indicate another payout will occur within Q1. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#13",
                    "likes": "11",
                    "time": "14/03/2023-22:22:58",
                    "content": "    Allan_Pedersen:  At implementation of MIP65 we adopted a simple interpretation of fees that allowed Monetalis a DC x 15bps on a prepayment format mostly because we just went with the simplest model   This interpretation meant that Monetalis was paid for two quarters and Maker has not yet received any payment from the first half billion DAI. Perhaps reasonable minds disagree, but the text of MIP65 implies that both parties should be paid on the same schedule:  Screen Shot 2023-03-14 at 5.56.58 PM1660×138 48.8 KB  This would be just a hiccup – similar to the unanticipated Swiss tax – were it not for several actions that are downright alarming. GFX Labs repeatedly asked what these two payment expenses were, both in the forum and on Discord.  We asked on the RWA report on March 5. You were personally tagged to draw your attention. We asked on the MIP65 channel in the MakerDAO discord on March 7. We asked about this expense on this thread on March 8. We tagged you in the MIP65 channel in discord to draw your attention to the question on March 8. We recommended in the MIP65 channel on March 12 that you reply here on the forum.  Only yesterday did you respond. It’s difficult to ignore that it did not come until multiple delegates and community members also asked on the forum and discord. It’s also difficult to ignore that your response did not come until after two polls went up to grant Monetalis a larger debt ceiling. Somewhat surprisingly, one of those polls is to remove the DC-IAM. For those unfamiliar, the DC-IAM would limit Monetalis to draw 100,000,000 DAI per week, more or less. It’s not clear why three quarters of a billion DAI need to be accessible all at once. This leaves us with the unfortunate impression that Monetalis drew payments that were not authorized by MakerDAO, then chose not to reveal that fact for more than a week when asked about those payments. And now Monetalis is requesting access to another 750,000,000 DAI and also the removal of a standard guardrail that would prevent pulling the entire funding in a single transaction. And there’s only 3 days to vote upon the issue. This, quite frankly, makes us alarmed. It feels off. These are not small sums being discussed, and this is obviously a deficient structure if Monetalis has this much influence over what the trustee does. The trustee should answer to Maker governance, not Monetalis. The opportunity cost of slowing down, taking a week or two to understand the MIP65 vehicle better and avoid further deviation from its intended purpose, is low. ",
                    "links": [
                        "https://discord.com/channels/893112320329396265/1027577309722587156/1082663431599038546",
                        "https://forum.makerdao.com/t/proposal-to-increase-debt-ceiling-for-mip65-by-750m-to-1250m/20060/8",
                        "https://discord.com/channels/893112320329396265/1027577309722587156/1083010757702193193",
                        "https://discord.com/channels/893112320329396265/1027577309722587156/1084526748206645288"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.187830687830688
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HuldrychZ",
                    "index": "#14",
                    "likes": "0",
                    "time": "14/03/2023-23:46:55",
                    "content": "    Allan_Pedersen:  We have learned quite a lot over the past months and, as a result, believe we have been able to implement strong improvements in several key documents such as the trust deed polls.   This says that legal documents can be changed without the MakerDAO. Do the community want this? Also, what is the answer please to the question before on the Bank Sygnum authorisations. Where are these? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.630952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#15",
                    "likes": "0",
                    "time": "15/03/2023-06:41:25",
                    "content": "HI @JustinCase I believe in practice we’d be very close to 1st of April when the transaction in completely deployed, but I am very happy to add to the agreement (I have to let the legal design the final language) : “…The first day of payment shall be no earlier than 1st of april 2023”. I will make sure the adjust the agreement later today with that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#16",
                    "likes": "0",
                    "time": "15/03/2023-06:43:40",
                    "content": "hi @HuldrychZ The documents are published for the Community beforehand for all to see - and are reviewed by an appropriate legal qualified member of the Maker community in a separate post. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#17",
                    "likes": "8",
                    "time": "15/03/2023-09:23:52",
                    "content": "  Expenses were identified here   As per above post, we accept we could have defined fees better, which is why we are making appropriate adjustments to move forward in the right way.   This is the most financially transparent of any current RWA allocation in Maker.   Money is being sent back from MIP65 given the proposal to do so gets voted in. With some patience, you would see in our list of MakerDAO Resolutions that we have put in a circuit-breaker on the DC Increase. To paraphrase the instructions: Money is first returned before DC Increase deployment is executed. In the exceptionally unlikely case this doesn’t work, we do not move on to execute any DC Increase before this “money return process” is solved satisfactorily.   All counterparties in the setup - Bank, Trustee, Administrator, Off/on-ramp have all acted as set out in all agreements and documents and no more. They have been a massive help to Maker. Today Maker via MIP65 has access to the two largest Swiss crypto-friendly banks: Sygnum Bank & SEBA. It has on/off-ramp access to high quality CeFi platforms: Coinbase, Gemini (and hopefully soon Circle). It is also quite far with on-boarding with a global tier 1 bank, which will allow Maker to consider new sets of possible money market instruments and investments. There appears to be a fundamental lack of understanding about the efforts it requires to actually achieve onboarding with large financial providers when you have a DAO ultimately on the other end of the structure. The parties in the structure have actually done a tremendous job. If Maker had to make a quick move from crypto to cash/rwa in a stablecoin melt-down - this structure is highly likely Maker’s best bet of achieving it with any kind of speed. That is a pretty strong achievement.   We do not have control over the Trustee - as per mentioned here   Your motivations are unclear, but you appear to have been on some sort of smear campaign on anything we do or say for as long as can be remembered. Everything we say or do, is generally twisted and turned to suit some sort of FUD around Monetalis and MIP65. We have not seen you engage in collaborative problem solving - there seems to be mainly a focus on trying to catch somebody out and say “aha you did xyz wrong! And that proves you are, of course, wholesale incompetent! And we must immediately lynch you!”.  Relentlessly second-guessing people who are on the front-line and actually doing good work to build revenue and profit for Maker is immensely demoralising - there is no motivation for anybody to take initiative (be that partners or CU’s for that matter): if you do well almost nobody seems to care, but if you make a any kind of mistake you get lynched rather than engaged in collaborative problem solving. The result is innovation and growth stagnation - and the best people and counterparties ultimately leave.   Case in point: MIP65 has had ZERO exposure to any fallen crypto services/exchanges or banks. No Silvergate, no Signature, no SVB, no FTX, etc. That is pretty darn cool and helps Maker’s reputation as a safe port. This would usually be cause for some material confidence in the counterparties involved in building this.   MIP65 is the first large structure that moved Maker into principally holding TradFi financial instruments rather than providing a loan to a counterparty. Achieving this has not been immaterial in defining Maker’s strategy going forward.   I encourage people to see through the noise and see MIP65 for what it is: a pretty remarkable platform, and open source blueprint, Maker can build a lot on. Improvements can be made, but there always is when building something as radically new as this, and they have continually been corrected with prudent care and attention - and the people and counterparties involved in this building have acted as trustworthy Maker partners and for the long term benefit of Maker.   ",
                    "links": [
                        "https://forum.makerdao.com/t/mip65-general-faq/19754/5"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.756185616081449
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#18",
                    "likes": "7",
                    "time": "15/03/2023-10:21:02",
                    "content": "Hey Allen. Two things can be true: What Monetalis is building is remarkable. Communication about expenses and fees and overall transparency can be a lot better. So: Kudos for being on the frontlines! Let’s get crystal clear about expenses in the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#19",
                    "likes": "4",
                    "time": "15/03/2023-11:00:24",
                    "content": "Thank you Allan, for your swift reply. It’s appreciated. We dispute that the expenses were in line with the intent of MIP65, both in amount and in when they were paid. That being said, the discrepancy is not material to the larger MIP65 structure. We recommend not focusing too much on the dollar amount. The problem is that you were able to convince the trustee that “A Monetalis fee of 0.15% of AuM deployed p.a. paid quarterly” meant Monetalis was to be paid for 15bps * 500m at a time when 500m had not even been deployed, and that they could be pre-paid for the following quarter. The trustee should never have been able to accept such an interpretation from Monetalis. The trustee needs better instructions, perhaps, since it has direct access to an account with half a billion dollars in it. We do not support increasing allocations to this structure until that deficiency has been remedied. This is a fixable problem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#20",
                    "likes": "2",
                    "time": "15/03/2023-11:39:01",
                    "content": "    Allan_Pedersen:  Your motivations are unclear, but you appear to have been on some sort of smear campaign on anything we do or say for as long as can be remembered. Everything we say or do, is generally twisted and turned to suit some sort of FUD around Monetalis and MIP65. We have not seen you engage in collaborative problem solving - there seems to be mainly a focus on trying to catch somebody out and say “aha you did xyz wrong! And that proves you are, of course, wholesale incompetent! And we must immediately lynch you!”. Relentlessly second-guessing people who are on the front-line and actually doing good work to build revenue and profit for Maker is immensely demoralising - there is no motivation for anybody to take initiative (be that partners or CU’s for that matter): if you do well almost nobody seems to care, but if you make a any kind of mistake you get lynched rather than engaged in collaborative problem solving. The result is innovation and growth stagnation - and the best people and counterparties ultimately leave.   No offense but you are expected to perform with that kind of remuneration. please dont play victim in this kind of scenarios, total unprofessional. We are all concerned about any mishandling of funds and we have every right to do so. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.654307208994709
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HuldrychZ",
                    "index": "#21",
                    "likes": "0",
                    "time": "15/03/2023-13:57:13",
                    "content": "Hi @Allan_Pedersen Where to find these posts with documents and with legal review? Can you show the link for these please? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#22",
                    "likes": "2",
                    "time": "15/03/2023-13:58:50",
                    "content": "    fumoffuXx:  No offense but you are expected to perform with that kind of remuneration. please dont play victim in this kind of scenarios, total unprofessional. We are all concerned about any mishandling of funds and we have every right to do so.   What’s unprofessional is toxicity. Not being a toxic jerk is one of the most basic lessons in leadership and professionalism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.131696428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#23",
                    "likes": "4",
                    "time": "15/03/2023-14:12:31",
                    "content": "    Allan_Pedersen:  Today Maker via MIP65 has access to the two largest Swiss crypto-friendly banks: Sygnum Bank & SEBA. It has on/off-ramp access to high quality CeFi platforms: Coinbase, Gemini (and hopefully soon Circle). It is also quite far with on-boarding with a global tier 1 bank, which will allow Maker to consider new sets of possible money market instruments and investments.   Our focus right now is here. There is an emergency situation occurring globally continuing from last week’s bank failures in the U.S. Can someone discuss in more detail what is planned to address systemic risk for MakerDAO and how they view approval of the debt ceiling as a necessary part of that plan? The case needs to be made explicitly at this point and with a lot more disclosure about what has apparently being activated (or been prepared for) by the current state of on-boardings. Intentions, plans, processes and achievements need to be MUCH BETTER communicated, more often and in a more direct and straightforward manner with these amounts and concentration of DAO assets on the line through a single structure and group of participants. The delays, silence and experience we perceive of the Monetalis team being unwilling to speak or introduce themselves on calls (for example when we discussed the Viridian Cluster legal review withdrawal on the G&R) contributes significantly to general unease and mistrust of what is really going on. The transparency initiated with this post is very welcome (thank you very much!) and we are confident that from this point everyone can get to a place of comfort. Our comfort in how we can move forward on solid ground is squarely derived from the Endgame Constitution organizational changes. We intend to vote yes on the MIP Set. The Scope Frameworks iteration process during the pregame will give us all powerful new alignment and processes to materially fix the negative contributing factors in this situation (which bear responsibility on ALL sides and the organizational defects of MakerDAO as a whole). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.041168831168831
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#24",
                    "likes": "0",
                    "time": "15/03/2023-14:13:00",
                    "content": "I am sorry if you view this as toxicity, this is how tradfi is. If he had to face clients with 500m worth of assets under hes management, this would have been a pinch to the arm. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#25",
                    "likes": "0",
                    "time": "15/03/2023-15:41:19",
                    "content": "HI @HuldrychZ Sorry I did not make this clear. They are not ready yet, but are being developed - they will be delivered in advance of an executive vote for community review. That would be a number of improved agreements, trust deed polls and the MakerDAO Resolution instruction sets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#26",
                    "likes": "5",
                    "time": "15/03/2023-16:07:26",
                    "content": "@Allan_Pedersen I’m having trouble reconciling this from MIP65:     GFXlabs:  The problem is that you were able to convince the trustee that “A Monetalis fee of 0.15% of AuM deployed p.a. paid quarterly”  meant Monetalis was to be paid for 15bps * 500m at a time when 500m had not even been deployed, and that they could be pre-paid for the following quarter.   with your clarification above:     Allan_Pedersen:  At implementation of MIP65 we adopted a simple interpretation of fees that allowed Monetalis a DC x 15bps on a prepayment format mostly because we just went with the simplest model, knowing that the Arranger model was in its infancy and that further changes were expected to be incorporated.   Can you help me understand how one led to the other? The text in MIP65 seems to be focused on AuM, not the DC, while your interpretation and subsequent implementation were focused on the DC. I’m assuming the DC was taken to make calculations of AuM averages easier, but I hope you understand, this is the maximum beneficial interpretation to you possible. Good work should get rewarded, I’m always for paying top dollar for top services. But these kinds of charges should get agreed upon up-front, I feel. Hoping you can clarify this matter satisfactory. Thanks a lot ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/welsh",
                    "index": "#27",
                    "likes": "2",
                    "time": "15/03/2023-16:28:09",
                    "content": "First, thanks to all parties for getting us to this point of transparency and clarity.  To expand on @rspa’s question I think a key question that still needs to be answered is how the legal/trust structure allowed Monetalis’ (unilateral?) interpretation of MIP65 to be executed.  Who/What other parties signed off on it and as @GFXlabs has already requested can you please share any documents/communications that led to its execution? It is critical that we fully examine and root out any flaws these structures for both the safeguarding of these large sums as well as for future RWA investments. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.024553571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HuldrychZ",
                    "index": "#28",
                    "likes": "1",
                    "time": "15/03/2023-16:34:37",
                    "content": "There remains also this question never answered.  Screenshot 2023-03-15 at 5.33.40 PM1450×146 17.7 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#29",
                    "likes": "0",
                    "time": "16/03/2023-20:14:43",
                    "content": "Could you link or post the sections of the agreement(s) that cover fees and payment? That would be very helpful for those of us who are not experts on trusts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#30",
                    "likes": "2",
                    "time": "16/03/2023-22:49:52",
                    "content": "Update: I was able to clear some things up with Allen. For those of us who are less familiar with it, the relevant documentation is the Instruction Sets. The original instruction sets didn’t specify when or how much to pay Monetalis. So as I understand, this needs a new instruction set to clarify payment amounts and schedules, which Monetalis intends to put forward soon. ",
                    "links": [
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806/68"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.199810606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#31",
                    "likes": "11",
                    "time": "17/03/2023-14:08:54",
                    "content": "At risk of becoming involved in something I don’t want to be involved in… I had an idea that might help resolve some of the issues around trust and transparency with regards to this. @Allan_Pedersen described MIP65 as: “a pretty remarkable platform, and open source blueprint, Maker can build a lot on”. From what I understand about the complexities involved, this is true. The reference to open source gave me a thought though. What if we approach this as if it were a technical issue, and Monetalis writes a postmortem in the same fashion as a we have for smart contract issues in the past? I believe this could help resolve some of the issues we’ve seen in this thread:  Information has been scattered through various responses, made by parties on both sides. Collating this into a single post would aid communication and understanding of the issues. Postmortems downplay the question of fault and blame, instead focusing on details of the problem, and the planned mitigations, both short-term and long-term. Done well, it would show opponents that Monetalis fully understands the perceived issues raised by the community, and has a clear plan to mitigate them. Hopefully restoring some trust between both sides. It would be more efficient for Monetalis to just refer commenters to well-written responses to their concerns, rather than have to rewrite answers when the same questions pop up or been seen to ignore community concerns. It would separate the discussion of the issues with the structure from the discussion around the debt ceiling increase. Done well, it would give a more clear explanation of the planned mitigations, and what the community should be expecting in terms of timeline. Clearly communicating expectations here could prevent strife caused by misunderstandings in the future.  I think there are a number of examples on the forum of what this sort of construction should look like. I imagine there are also guides and such on the wider internet. I imagine if you asked politely, someone from the protocol engineering team could give a brief run-through of how they approach such documents. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.680194805194805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HuldrychZ",
                    "index": "#32",
                    "likes": "1",
                    "time": "17/03/2023-18:58:33",
                    "content": "    CodeKnight:  The original instruction sets didn’t specify when or how much to pay Monetalis.    Screenshot 2023-03-17 at 7.57.03 PM1872×298 27.6 KB  How to reconcile these statements? If trustee does not get instruction, why did it act at all. Based on second statement, trustee should not act without this, but it did. It made payments even.         ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#33",
                    "likes": "1",
                    "time": "17/03/2023-23:38:12",
                    "content": "My understanding is that Instruction set 3 step 11 does instruct the trustee to pay invoices.  image738×137 7.2 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HuldrychZ",
                    "index": "#34",
                    "likes": "1",
                    "time": "18/03/2023-00:37:05",
                    "content": "I see this also. But I do not see Governance Poll approving these instruction sets. Do you know where is this please? Also, if Trustee pay invoices without restriction I think has quite large amount of discretion. So maybe not correct to say no discretion? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#35",
                    "likes": "0",
                    "time": "18/03/2023-01:37:03",
                    "content": "According to the thread, all of these were approved as signal requests. I believe there is a restriction here(the amount in that Expense account), but yes it did seem to give the trustee some discretion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HuldrychZ",
                    "index": "#36",
                    "likes": "2",
                    "time": "18/03/2023-13:38:15",
                    "content": "I am here just a small time so maybe I do not understand. I do not find these signal request. Trustee must need some evidence of the vote. What was given to him please? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                }
            ]
        }
    ],
    "group_index": "2240"
}