{
    "poll_list": [
        {
            "title": "Inclusion Poll for MIP12c2-SP3: Domain Work Requirements for the Onboarding of MANA - July 13, 2020",
            "index": "3139",
            "option": "Yes",
            "supporting_mkr": "6,467",
            "highest_fraction": 0.92
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip12c2-sp3-domain-work-requirements-for-the-onboarding-of-mana/3139",
            "title": "MIP12c2-SP3: Domain Work Requirements for the Onboarding of MANA ",
            "index": 3139,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Mariano_Conti",
                    "index": "#1",
                    "likes": "3",
                    "time": "08/07/2020-21:51:50",
                    "content": "MIP12c2-SP3: Domain Work Requirements for the Onboarding of MANA Preamble MIP12c2-SP: 3 Title: Domain work requirements for onboarding the MANA collateral type Author(s): Cyrus Younessi (@DonutJr), Niklas Kunkel (@NiklasKunkel), Mariano Conti (@nanexcool) Contributors: Charles St.Louis (@CPSTL) Status: Formal Submission (FS) Date Proposed: 2020-07-08 Date ratified: <yyyy-mm-dd>  Specification Summary This proposal defines the documentation and work requirements for the onboarding of the MANA collateral type to the Maker Protocol, explicitly highlighting the domain teams’ objectives and work requirements needed to get it implemented to the Maker Protocol. Proposal Details This subproposal contains the domain work products required for the MANA collateral asset to be added to the Maker Protocol. More specifically, it includes the risk parameters/risk evaluation, oracle solutions, and necessarily smart contracts needed for the successful onboarding of MANA.   Risk Domain Work: The risk domain team’s work contains the following risk construct/risk evaluation for the MANA collateral type:  [MANA] Collateral Onboarding Risk Evaluation    Smart Contracts Domain Work: The smart contracts domain team’s work required to get MANA added to the Maker Protocol includes an assessment of the collateral type-token contracts, work products for the operational collateral adapter, medianizer, oracle security module, and information regarding the deploying the executive vote code (spell). More specifically:  [MANA] ERC20 Token Smart Contract Domain Team Assessment    Oracles Domain Work: The oracles domain team’s work required to get MANA added to the Maker Protocol, includes making sure the oracle price feeds to support the new collateral type are prepared. More specifically, this includes:  [MANA] Oracle Domain Team Assesment    Motivation The goal of this proposal is to provide transparency to the Maker Community as to what the domain teams’ (Risk, Smart Contracts, and Oracles) work consists of in order to add the MANA collateral type to the Maker Protocol. Relevant Information  MIP6 MCD Application: Decentraland [MANA] Collateral Status Index  Relevant Definitions:   Spell: A spell is an un-owned object that performs one action or a series of atomic actions (multiple transactions) one time only to the Maker protocol.  OSM: ensures that new price values propagated from the Oracles are not taken up by the system until a specified delay has passed (OSM Documentation).  Median: provides Maker’s trusted reference price. In short, it works by taking the median of a set of price updates posted by governance appointed Feeds. (Median Documentation).   ",
                    "links": [
                        "https://forum.makerdao.com/t/mana-mip12c2-sp2-collateral-onboarding-risk-evaluation/3128",
                        "https://forum.makerdao.com/t/mana-erc20-token-smart-contract-domain-team-assessment/3095",
                        "https://forum.makerdao.com/t/mip10c3-sp3-proposal-manausd-oracle-collateral-onboarding/3133",
                        "https://forum.makerdao.com/t/mana-mcd-application-by-decentraland/2320",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://docs.makerdao.com/smart-contract-modules/oracle-module/oracle-security-module-osm-detailed-documentation",
                        "https://docs.makerdao.com/smart-contract-modules/oracle-module/median-detailed-documentation",
                        "https://forum.makerdao.com/t/maker-relay-ep-5/3406",
                        "https://forum.makerdao.com/t/weekly-mips-update-9/3269",
                        "https://forum.makerdao.com/t/maker-relay-episode-3/3199",
                        "https://forum.makerdao.com/t/weekly-mips-update-8/3189",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-100-thursday-july-9-9am-pst-4-00-pm-utc/3023/4",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-101-thursday-july-16-9am-pst-4-00-pm-utc/3145/2"
                    ],
                    "GPT-summary": "The proposal MIP12c2-SP3 outlines the work requirements for onboarding the MANA collateral type to the Maker Protocol. The proposal defines the documentation and work requirements for the risk, smart contracts, and oracles domain teams. The proposal aims to provide transparency to the Maker Community about the work required to add the MANA collateral type to the Maker Protocol.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Interoperability and Scalability",
                        "Token economics",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.705251270468662
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "14/07/2020-13:49:51",
                    "content": "Question for everyone arising out of chat with @Davidutro in rocket chat. What does everyone think will happen if this subproposal passes the inclusion poll and is included in the monthly governance cycle? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#3",
                    "likes": "0",
                    "time": "14/07/2020-14:42:05",
                    "content": "I thought the domain team had the latitude to do the work that was needed to onboard collateral. I thought this notification was just out of abundance of transparency.  I wouldn’t have thought their work would require ‘congressional’ approval. If it doesn’t pass is MANA RIP? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "2480"
}