{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/gusd-makerdao-partnership-update/19428",
            "title": "GUSD & MakerDAO Partnership Update ",
            "index": 19428,
            "category": [
                "Governance"
            ],
            "tags": [
                "gusd",
                "psm-gusd-a"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/tylerwinklevoss",
                    "index": "#1",
                    "likes": "22",
                    "time": "16/01/2023-07:07:32",
                    "content": "// Maker community, We are deeply grateful for the ongoing partnership of this community and thankful for the opportunity to address any and all of your concerns. No doubt, the past few months have been some of the most challenging for our industry and for Gemini specifically with respect to the Earn program. I’d like to be clear up front, however, that the issues related to Earn do not impact any other Gemini products or services, including GUSD. MakerDao’s counterparty risk to Gemini is and has always been limited to GUSD. The risks associated with GUSD can be bucketed into three general categories:   Is GUSD’s smart contract implementation secure?   Are there enough dollars backing GUSD in circulation?   Are the dollars backing GUSD held safely and soundly?   Our answers to all of these questions are not only best-in-class (if not the best) for any centrally-issued stablecoin, they are the same today as they were prior to both FTX’s collapse and any issues related to Earn. I’ll go into more detail later on in this post, but here are the headlines to the questions posed above:   Yes. GUSD has been operating successfully in the wild with no issues since 2018. Its smart contract has been audited and you can review its source code for yourself.   Yes. GUSD reserves are attested to on a monthly basis by an independent registered accounting firm. Attestations can be found here. GUSD is also regulated by the New York Department of Financial Services and falls directly under its oversight, another assurance that GUSD is backed 1:1.   Yes. GUSD reserves are held in a) U.S. FDIC-insured banks, b) Money market funds, invested only in U.S. Treasury obligations, and c) U.S. Treasury obligations. This breakdown is confirmed and verified by the monthly GUSD attestations.   As I have outlined above, MakerDAO’s exposure to Gemini is isolated to GUSD, which remains wholly unaffected by the turmoil in crypto markets and any issues related to Earn. I totally appreciate that there is a lot of FUD swirling around out there, but I would respectfully submit that it is our duty as a community and an industry to be fair and rational with respect to where FUD is due and where it is not due, especially during trying times. Acting otherwise is counterproductive to the values and long-term goals that we all share. We look forward to continuing this dialogue and to answering additional questions from this community as they arise. We are also happy to consider implementing additional processes for increased transparency (e.g., regular meetings with core teams, joining community calls, and other mechanisms to promote transparency and provide needed information) if the community would find it valuable. Most importantly, Gemini looks forward to continuing to work with the MakerDAO community to help unlock the next era of financial freedom. Onward and upward! Tyler // REGARDING POTENTIAL INSOLVENCY RISK OF GEMINI DUE TO EARN As an initial matter, while Gemini Trust Company, LLC (“Gemini”), as the agent for Earn users, is working tirelessly on their behalf to return assets that those users lent to Genesis, the applicable governing agreements provide that Earn users have principal risk directly against Genesis, and, as a result, the approximately $900 million outstanding to Earn users are owed by Genesis, not Gemini. Gemini did not borrow or use any of the Earn users’ assets. With regards to bankruptcy risk, the assets forming the GUSD reserve are not “property” of Gemini (i.e., Gemini does not take ownership of the GUSD reserves). Gemini is required by the New York Department of Financial Services (“NYDFS”) to comply with the requirements of the NYDFS industry letter, dated June 8, 2022, Guidance on the Issuance of U.S. Dollar Backed Stablecoins (“NYDFS Stablecoin Guidance”) [1]. Item 2(a) under the NYDFS Stablecoin Guidance requires that the reserves backing any NYDFS regulated stablecoin be segregated from the proprietary assets of the issuing entity (e.g., Gemini) and that such reserve assets are held at depository institutions or custodians for the benefit of the holders of the stablecoin. Accordingly, GUSD reserves are held in accounts that are separate from Gemini’s business, operating, and other customer omnibus accounts [2]. In the unlikely event Gemini faces an insolvency scenario, these facts will determine that GUSD reserves do not form a part of Gemini’s “bankruptcy estate” (i.e., the pool of assets that a bankruptcy trustee and/or court will use to distribute to Gemini creditors). In addition, it is important to note that Gemini is a limited purpose trust company subject to the New York Banking Law (“NYBL”) and supervised by the NYDFS. This means that in the event of a bankruptcy, the NYDFS would be the trustee of Gemini’s bankruptcy estate and have certain powers when it comes to the administration of such a bankruptcy proceeding [3]. The provisions of the NYBL will apply and govern the administration of such a proceeding. Moreover, Gemini has structured all of our products, including GUSD, in compliance with the NYBL and with oversight from the NYDFS [4]. Given the fact that the NYBL will govern any bankruptcy of a New York limited purpose trust company, including Gemini, and the fact that we have received prior approval from the NYDFS prior to launching GUSD, we would expect the NYDFS to support Gemini’s characterization of our contractual relationship regarding GUSD – and have GUSD holder interests as a paramount consideration when acting in that capacity. Lastly, as a New York limited purpose trust company, we are required by the NYBL and the NYDFS to be a full-reserve exchange and custodian [5]. This means that all customer funds held on Gemini are held 1:1. When we say customer funds are held 1:1, we mean that once a customer deposits funds with Gemini, we hold those funds and do not do anything with those funds without specific customer authorization [6]. The funds are also segregated from Gemini’s own funds, and held in separate accounts. Therefore, customer funds are always available for withdrawal. In addition, the NYDFS imposes certain excess capital requirements and compliance standards for all assets held on Gemini [7]. At any given time, Gemini is required to hold capital in excess of customer deposits and must report any material changes in meeting this capital requirement to the NYDFS [8]. We highlight this because even in the unlikely event of a bankruptcy, Gemini will already have all of our customer funds in reserve in addition to excess capital reserve requirements–both of which are regularly examined and audited by the NYDFS [9]. All of this is subject to the NYDFS oversight and supervision. Specifically, the NYDFS requires limited purpose trust chartered companies engaged in virtual currency business activity like Gemini to comply with all of the requirements set forth in the NYDFS’ Virtual Currency (“Bitlicense”) regulations [10]. The NYDFS has again reminded the public that all regulated entities “as a matter of safety and soundness. . .are expected to seek approval from the [NYDFS] before engaging in new or significantly different virtual currency-related activity [11].” Gemini also provides regular reporting to, and is subject to periodic examination by, the NYDFS. As part of the NYDFS’ examination process, the NYDFS has the authority to examine all Gemini documents, processes, controls, and measures, including those pertaining to GUSD [12]. Additionally, the NYDFS prescribes requirements of USD-backed stablecoins issued under NYDFS oversight, and Gemini provides regular reporting to the NYDFS on its compliance with these backing and redeemability, reserve, and monthly and annual attestation requirements [13]. FOOTNOTES [1] See, e.g., NYDFS “Guidance on the Issuance of U.S. Dollar-Backed Stablecoins” (June 8, 2022), available at https://www.dfs.ny.gov/industry_guidance/industry_letters/il20220608_issuance_stablecoins#ftn5 (“NYDFS Stablecoin Guidance”). [2] See Gemini, User Agreement, User Agreement | Gemini (providing that all accounts for GUSD are “separate from our business, operating, and reserve bank accounts”). [3] See NYBL §102-a (providing that New York Banking Law shall govern the winding up of the affairs of a New York trust company and the distribution of assets). [4] See 23 NYCRR § 200.10. (requiring all licensed virtual currency businesses to obtain NYDFS approval prior to offering any materially new products or services). NYDFS imposes strict requirements related to NYDFS-supervised entities’ issuance of dollar-backed stablecoins. See, e.g., NYDFS “Guidance on the Issuance of U.S. Dollar-Backed Stablecoins” (June 8, 2022), available at https://www.dfs.ny.gov/industry_guidance/industry_letters/il20220608_issuance_stablecoins#ftn5 (“NYDFS Stablecoin Guidance”). Gemini adheres to these reserve, redeemability, and attestation requirements, as detailed in our User Agreement. [5] See NYBL §107 (prescribing reserve requirements of NY banks and trust companies). [6] See, e.g., 23 NYCRR § 200.9. [7] See 23 NYCRR § 200.8 (capital reserve requirements). [8] See NYBL §125 (requiring certain reporting to NYDFS by regulated entities). [9] See 23 NYCRR § 200.13 (giving the NYDFS authority to examine a licensed entity’s books, records, and other information at any time). [10] See, e.g., NYDFS Grants Charter to “Gemini” Bitcoin Exchange Founded by Cameron and Tyler Winklevoss (Oct. 5, 2015), https://www.dfs.ny.gov/reports_and_publications/press_releases/pr1510051 (Virtual currency exchanges chartered as LPTCs “are also expected to meet the full requirements of the NYDFS BitLicense regulatory framework (23 NYCRR § 200) – which was finalized in June 2015 – as a condition of licensure.”). [11] See https://www.dfs.ny.gov/system/files/documents/2022/12/il20221215_prior_approval.pdf. [12] See 23 NYCRR § 200.13. [13] See NYDFS Stablecoin Guidance. // LEGAL & COMPLIANCE FAQ  What future enhancements should MakerDAO require in order to protect its interests?  While we appreciate that there may be additional opportunities for increased transparency going forward, as a first step we would propose regularly scheduled meetings between representatives of the MakerDAO and Gemini staff regarding GUSD. These meetings would include, among other things, discussion of published attestations as well as certain information related to accounts that hold GUSD reserves, such as the makeup of the GUSD reserves, in addition to other risk relevant items.  What is the source of the initial GUSD in the PSM?  Gemini engaged with third-party market participants to assist in filling the PSM. Per internal controls, we don’t comment publicly on counterparties of this nature.  What is the incentive for Gemini to fill the PSM?  We designed this partnership to be mutually beneficial to provide liquidity for DAI via a PSM and increase the on-chain usage of GUSD. OPERATIONAL FAQ  How can MakerDAO operationally redeem GUSD should it need to?  Gemini is currently working with MakerDAO arranger Monetalis to onboard James Asset (PTC) Limited and create an account on the Gemini exchange to manage redemptions.  How quickly can Gemini process GUSD redemptions & withdrawals?  GUSD can be redeemed 1:1 with no fees at any time on the Gemini exchange. Most redemptions are processed instantly in the normal course of business. In cases in which instant processing is not possible, we strive to fulfill redemptions within one business day in accordance with our User Agreement. FINANCIAL FAQ  Is all of the USD backing GUSD that is held at Silvergate protected by FDIC insurance? Are any cash deposits at risk or uninsured?  The cash portion of the GUSD reserves, which may be held at State Street Bank and Trust Company, Signature Bank, or Silvergate Bank, may be eligible for FDIC “pass-through” insurance for Gemini customers in the event that the bank holding such U.S. dollar cash deposits becomes subject to resolution or similar proceedings by the FDIC.  Is Gemini open to or exploring ways to reduce their (possibly unsecured) exposure to crypto-focused banks like Silvergate and Signature and shift more of their reserves into treasury bills, government money funds or other government guaranteed assets?  We have a defined Investment Policy that outlines target and maximum exposure to specific instruments and counterparties. We are continuously rebalancing reserves in response to market events and assessed risk, including reducing exposure to specific counterparties where appropriate.  Does Gemini segregate yield earned from public attestation reports?  Gemini holds GUSD reserves across multiple FDIC-insured banks as well as money market funds and US Treasuries. Some of these accounts direct interest yield payments to separate Gemini-owned accounts. The requirement to hold reserves that are at least equal to the nominal value of outstanding GUSD is always met.  What is the specific composition of assets that make up GUSD reserves?  As of Jan 12 2023, GUSD reserves are composed of the below assets. We are working on ways to provide this information in a more regular, public manner. In the meantime, we do provide our monthly attestations on the GUSD product page and show a breakdown of live assets on our newly published Trust Center page.     CUSIP/SYMBOL DESCRIPTION CURRENCY AMOUNT     CASH USD HELD AT BANKS USD 267,899,676   FTIXX GS FIN SQ TREASURY INST FUND INST USD 10,000,000   262006208 DREYFUS GVT CSH MGT INST USD 44,291,555   912796S34 UNITEDUNITED STATES TREASURY USD 25,000,000   912796T33 UNITEDUNITED STATES TREASURY USD 20,000,000   912796XS3 UNITEDUNITED STATES TREASURY USD 20,000,000   912796Y78 UNITEDUNITED STATES TREASURY USD 20,000,000   912796Y78 UNITEDUNITED STATES TREASURY USD 20,000,000   912796Y86 UNITEDUNITED STATES TREASURY USD 20,000,000   912796YB9 UNITEDUNITED STATES TREASURY USD 20,000,000   912796Z85 UNITEDUNITED STATES TREASURY USD 25,000,000   912796ZM4 UNITEDUNITED STATES TREASURY USD 15,000,000   912796ZT9 UNITEDUNITED STATES TREASURY USD 10,000,000   912796YK9 UNITEDUNITED STATES TREASURY USD 30,000,000   912796Z69 UNITEDUNITED STATES TREASURY USD 30,000,000      577,191,231     Can you provide full-year and interim financial statements for Gemini?  Gemini is privately held and does not distribute financial statements. Gemini files quarterly financial statements with its primary regulator, the NYDFS, in accordance with its confidential Supervisory Agreement. Gemini is audited on an annual basis by Deloitte. We also undergo yearly SOC 1 Type 2 and SOC 2 Type 2 exams by Deloitte. // CLOSING REMARKS We look forward to continuing this partnership with the Maker community and welcome any feedback and questions that the community has. REFERENCES  Gemini Trust Center - Gemini Trust Center  Website - Gemini dollar (GUSD)  Whitepaper - https://www.gemini.com/static/dollar/gemini-dollar-whitepaper.pdf  Source Code - GitHub - gemini/dollar  Trail of Bits Audit - https://www.gemini.com/static/dollar/gemini-dollar-trailofbits-audit.pdf  Independent Auditor Reports - Gemini dollar (GUSD)  Token Contract - Gemini dollar (GUSD) Token Tracker | Etherscan  Twitter - https://twitter.com/Gemini   ",
                    "links": [
                        "https://github.com/gemini/dollar",
                        "https://www.gemini.com/dollar",
                        "https://www.dfs.ny.gov/industry_guidance/industry_letters/il20220608_issuance_stablecoins#ftn5",
                        "https://www.gemini.com/legal/user-agreement#section-gemini-dollar",
                        "https://www.dfs.ny.gov/industry_guidance/industry_letters/il20220608_issuance_stablecoins#ftn5",
                        "https://www.dfs.ny.gov/reports_and_publications/press_releases/pr1510051",
                        "https://www.dfs.ny.gov/system/files/documents/2022/12/il20221215_prior_approval.pdf",
                        "https://www.gemini.com/dollar",
                        "https://www.gemini.com/trust-center",
                        "https://www.gemini.com/trust-center",
                        "https://www.gemini.com/dollar",
                        "https://www.gemini.com/static/dollar/gemini-dollar-whitepaper.pdf",
                        "https://github.com/gemini/dollar",
                        "https://www.gemini.com/static/dollar/gemini-dollar-trailofbits-audit.pdf",
                        "https://www.gemini.com/dollar#reports",
                        "https://etherscan.io/token/0x056fd409e1d7a124bd7017459dfea2f387b6d5cd",
                        "https://twitter.com/Gemini",
                        "https://forum.makerdao.com/t/request-to-poll-psm-gusd-a-parameters/19416/3",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/145",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/90"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.465152200120555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#2",
                    "likes": "10",
                    "time": "17/01/2023-12:21:58",
                    "content": " Updating GUSD Rewards Rates Background There is an ongoing vote on whether Maker should disengage from its recent increase in GUSD holdings. This comes as a variety of MakerDAO community members have expressed unease or questions about Gemini, its exposure to Genesis through the Gemini Earn program, regulatory enforcement actions, and the safety and soundness of GUSD reserves. Comments on the governance forum and Discord server focus on the risk-reward calculus. GFX Labs has been an early supporter for the addition of a GUSD-PSM, and authored the initial increase in debt ceiling proposal for that same PSM. With that being said, two Federal Reserve meetings have passed since the initial offering of GUSD rewards to MakerDAO. This has added 125 basis points to the Federal Reserve Funds Rate, which strongly influences the yield on the underlying assets of GUSD. It seems appropriate to increase the rewards rate in this environment, and the relevant question is “By how much?” Proposal To Gemini GFX Labs believes that there is promise for a long-term partnership between MakerDAO and Gemini that can prevent sudden votes like this in the future by setting predictable expectations around the GUSD rewards program that Gemini has so generously created. We propose that a temporary, informal working group be established to make expected rewards adjust upwards and downwards with the yield on the underlying portfolio of cash, US Treasury securities, and US Treasury securities-based money market funds that back GUSD. In order to foster a closer relationship between MakerDAO and Gemini, we propose that such a working group should consist (on MakerDAO’s side) of @GFXlabs, @rspa, @justincase, @twblack88, and some additional representatives drawn from core units. Gemini should appoint their own representatives to the working group. This working group would have a narrow focus and limited tenure, but would also give Gemini additional direct lines of communication to MakerDAO stakeholders for any future discussions. Together, MakerDAO and Gemini can agree on an increase from current rewards rates while simultaneously ensuring a consistent treatment through periods of high rates and low. This will set the stage for a long-term relationship between Gemini and the leading decentralized finance protocol. This working group’s first meeting should occur no later than February 1, 2023. A formula that makes GUSD rewards rates predictable to the community should target being made public by February 28, 2023. Ideally, a representative from Gemini should publicly respond to this offer on this forum prior to the close of the current GUSD polls to avoid disruption or delays. Unfortunately, the voting schedule makes is relatively rushed in this instance. CC: @tylerwinklevoss @marty_stenson @beardmars ",
                    "links": [
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/115",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/134",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/135",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/146",
                        "https://www.coindesk.com/business/2023/01/10/gemini-terminates-its-crypto-yield-product-amping-up-battle-with-genesis/",
                        "https://www.cnbc.com/2023/01/12/sec-charges-genesis-and-gemini-with-selling-unregistered-securities.html",
                        "https://vote.makerdao.com/polling/QmayeEjz#vote-breakdown",
                        "https://forum.makerdao.com/t/signal-request-raise-gemini-dollar-gusd-psm-debt-ceiling-to-60-million-dai/12961",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140",
                        "https://forum.makerdao.com/t/paxos-makerdao-partnership-usdp-psm/19469/10"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.385574229691876
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#3",
                    "likes": "5",
                    "time": "17/01/2023-14:56:25",
                    "content": "Thanks for the update. Regarding potential Gemini BK risk to Maker’s GUSD assets, can you provide a Non-consolidation Opinion by a leading law firm that addresses this key risk directly? Your current explanation has some ‘should’ statements that doesnt give high confidence of non-consolidation risk in a Gemini BK. Only an in depth legal analysis by a leading law firm will properly address this risk… The fact that Circle and others have not provided such an in depth legal analysis and opinion suggests that credible law firms may not be willing to not give a non-consolidation opinion, as they view the consolidation risk in BK too unknown/high to issue an opinion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.37
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#4",
                    "likes": "1",
                    "time": "17/01/2023-16:01:08",
                    "content": "    tylerwinklevoss:  Gemini engaged with third-party market participants to assist in filling the PSM. Per internal controls, we don’t comment publicly on counterparties of this nature.   Thank you for confirming that Gemini was the one to hire a third party market participant to fill the PSM. Although Gemini doesn’t comment publicly on the counterparty, I think it is important information for MakerDAO, given the very public pushback to such a simple question. This pushback mainly and oddly came from MakerDAO team itself. I did some analysis of the counterparty’s wallet, and I have found out some info that would be revelant to MakerDAO’s decision making.  All connections to GUSD Market Maker Plus mystery BB110E wallet (1)1778×954 186 KB  Txns made by the GUSD PSM Market Maker  Has sent money to Genesis Trading The market maker wallet has strong connections to a secondary wallet. The market maker wallet is likely a hot wallet used by the secondary wallet to carry out the GUSD PSM contract, along with other activities. The secondary wallet, has numerous deposits & withdrawals with Genesis Trading. The secondary wallet is connected to the major market makers: Wintermute, Cumberland, and GSR markets Both the main & secondary wallet have txns with Parafi Capital  What can we ascertain from the above information? Genesis Trading connection. This should be of great concern to MakerDAO, as Genesis Trading is the entity facing potential insolvency. If they were associated with filling the GUSD PSM, I would recommend MakerDAO look very carefully at these funds to ensure there is no unknown risk associated with the GUSD PSM deal. Wintermute, Cumberland, and GSR Markets I would expect to see these entities associated with a Market Maker wallet. A seperate question is why are Market Makers not using individual wallets for business activities? That may be a question for the larger crypto industry, as seperate businesses shouldn’t really have funds held together IMO. Although, perhaps these are for market maker partnerships? No accussations, purely observations. Parafi Capital This is an interesting entity. Out of nowhere, an individual commented on my twitter thread about the GUSD PSM stating: “I know who did it and this is accurate” (referring to the GUSD PSM market maker)  twitter.com    KYB @kyedidbotton  @karl_0x I know who did it and this is accurate: twitter.com/cryptohippo65/…   Cryptohippo @cryptohippo65  Can anyone tell me what he meant by that statement?  \"a market maker is moving USDC to GUSD by redeeming for the underlying USD\"  GUSD was moved from Gemini to MakerDAO, DAI was redeemed, moved to 3 new wallets, converted to USDC, and then redeemed for fiat USD via circle.    6:02 AM - 3 Jan 2023           2            His profile states he is a fan of Parafi Capital. Had he not reached out, I would have not spotted the Parafi Capital connection to the market maker wallet so I appreciate his input. His profile strikes me as odd, because it was created in 2015, but his first tweets were just this month in relation to the GUSD PSM discussions. He also said it wasn’t his place to state who the market maker was. I reached out to him privately, but he has gone radio silent since his abrupt entry into the discussion. I suspect Parafi Capital was also associated with providing capital for the GUSD PSM funding, but obviously only Gemini & the market maker can confirm this. Conclusion The previously undisclosed connection of Genesis Trading to the GUSD PSM Market Maker should be thoroughly reviewed by MakerDAO. ",
                    "links": [
                        "https://twitter.com/kyedidbotton/status/1610154693149487104",
                        "https://twitter.com/kyedidbotton/status/1610154693149487104",
                        "https://twitter.com/karl_0x",
                        "https://twitter.com/cryptohippo65/status/1600534190088278016",
                        "https://twitter.com/cryptohippo65/status/1600534190088278016",
                        "https://twitter.com/kyedidbotton/status/1610154693149487104",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/147"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.289751820149547
                },
                {
                    "author_link": "https://forum.makerdao.com/u/beardmars",
                    "index": "#5",
                    "likes": "5",
                    "time": "17/01/2023-16:55:50",
                    "content": "Hi GFXlabs team, appreciate your response and ongoing support. We are more than happy to create a working group to discuss the marketing incentive that we can track together and work closely on, and we are amenable to increases (and potential decreases as appropriate) that support the partnership. If you don’t have access to my contact info you can DM me on twitter @beardmars and we can start to set this up as soon as possible. Thank you, ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tylerwinklevoss",
                    "index": "#6",
                    "likes": "1",
                    "time": "17/01/2023-22:20:29",
                    "content": "Thank you for your question. Gemini offers protection in a way that very few crypto firms can (i.e., we hold customer assets bankruptcy remote). As I explained in my response, this is because we are a New York limited purpose trust company — this means that we are not only regulated by the NYDFS but subject to the New York Banking Law (NYBL). The NYBL provides that a New York trust company would not go through customary bankruptcy procedures like other crypto companies who have recently failed. Instead, the NYBL will govern and the Superintendent of NYDFS would return assets held by Gemini to the rightful parties, as reflected on our books and records. Again, GUSD reserves are held in accounts that are separate from Gemini’s business, operating, and other customer omnibus accounts. Gemini and GUSD would be treated the same in such a scenario as any other NYDFS-regulated stablecoins that have a PSM, and therefore, should not be held to a double-standard. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.761248647186147
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#7",
                    "likes": "1",
                    "time": "17/01/2023-22:36:48",
                    "content": "So what you’re saying is that MakerDAO doesn’t need to trust Gemini at all. It just needs to trust the corrupt NYDFS. The same NYDFS that changed all of its previous rules by inventing the BitLicense out of thin air in 2014. Placing the entire fate of the DAI ecosystem into the hands of NYDFS, an organization which has proven repeatedly that it hates innovation in this space, is not advice that anyone here should take seriously. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.8333333333333335
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#8",
                    "likes": "0",
                    "time": "18/01/2023-00:18:14",
                    "content": "    tylerwinklevoss:   Independent Auditor Reports - Gemini dollar (GUSD)      Just FYI since it seems you don’t have much background on Parafi. They have historically supported the project and have been active participants in governance, with good/great suggestions to boot. From my perspective, they are a well-functioning and well-respected ecosystem member. Tosh ",
                    "links": [
                        "https://www.wsj.com/articles/venture-funds-invest-in-makerdao-stablecoin-system-11584044527",
                        "https://forum.makerdao.com/t/steth-mip6-collateral-onboarding/5762"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#9",
                    "likes": "3",
                    "time": "18/01/2023-05:49:26",
                    "content": "Thanks for the additional background on Parafi capital. My goal was to highlight all entities that had strong associations with the market maker. If MakerDAO considers Parafi well respected, then that is good. The really concerning connection to the market maker is Genesis Trading. If Genesis Trading potentially played a role with the GUSD PSM proposal, this should ring alarm bells. MakerDAO should be aware that executives of Genesis trading were trying to raise $500M just one month prior to the GUSD proposal.   The Block    Top execs from Genesis and Galaxy are raising a $500 million fund Top trading executives from Genesis and Galaxy are set to raise a $500 million fund, according to an SEC filing.      Then a business partner of Genesis (aka Gemini) announced a $500M GUSD proposal. The GUSD PSM was filled out by a wallet that has transaction history connecting it back to Genesis Trading. There are a lot of strange coincidences with the GUSD PSM deal, and members of MakerDAO need to be aware of this, in order to make a fully informed decision. ",
                    "links": [
                        "https://www.theblock.co/post/166463/top-execs-from-genesis-and-galaxy-are-raising-a-500-million-fund",
                        "https://forum.makerdao.com/t/request-to-poll-psm-gusd-a-parameters/19416/4"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1726190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ap_UC",
                    "index": "#10",
                    "likes": "2",
                    "time": "18/01/2023-23:28:47",
                    "content": "Understand your points regarding the GUSD proposal, though looking into the $500M raise and the article you linked, these are all ex-execs from Genesis and Galaxy, and the reason for the August raise is now clearer, as they’ve all left their previous roles to start a new fund that seems to be unaffiliated with the team’s previous employers. Here’s more in terms of filings: DBA Crypto Fund I, LP Form D Filed 2022-08-26 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.303030303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#11",
                    "likes": "0",
                    "time": "27/01/2023-01:28:07",
                    "content": "While I will respect the decision of the vote, I would like to draw attention to additional info I have learned since the vote, which I have posted on the main GUSD thread.     GUSD & MakerDAO Partnership Announcement Integrations       A few things don’t sit right with me about the Gemini deal.  The vote was scheduled so that it would the EXACT same date that Genesis declared chapter 11 bankruptcy. This information would have had a significant impact on the vote IMO.  Although I will respect the decision of the vote, I find this timing incredibly suspicious.  It has also come to my attention that just a month before the updated GUSD proposal was suggested, on 15AUG2022 Gemini Earn requested $465M collateral from Genesis.  Can …     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.269557823129252
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaveringtonPLLC",
                    "index": "#12",
                    "likes": "4",
                    "time": "30/01/2023-13:59:12",
                    "content": "Axios claims in a report this morning that the NYDFS is investigating Gemini. The article, quoted and linked below, discusses GUSD customer marketing and communications at length. It is a helpful read for illustrating how the Earn program issues might be relevant to our assessment of GUSD risk to MakerDAO.   Its Earn product resembled a savings account. Investors put in funds — either their own cryptocurrency or they paid dollars for Gemini’s stablecoin, GUSD — and were told they’d make as much as 8% APY. Gemini didn’t say explicitly that its Earn program, or GUSD, is directly FDIC insured. Instead, on its website in a section called “FDIC Insurance,” Gemini says that GUSD is at least in part backed by dollars that may be held in FDIC “eligible” accounts at three banks: State Street, Signature and Silvergate. (None of those banks provided Axios with more details.)   I regularly share news on Twitter about the challenges facing Silvergate and Signature for anyone looking to get a bunch of references on that quickly. I won’t clutter this comment with those details, but certainly it matters the extent to which USD backing GUSD is in accounts at those institutions and whether accounts hold amounts above FDIC insurance thresholds. We also should consider whether MakerDAO desires to bear the full brunt of the testing of this entire architecture of counterparty risk, customer losses, government enforcement and bankruptcy court proceedings. It would be great to have a response to these allegations here on the Forum @tylerwinklevoss @beardmars. Thank you.    Axios – 30 Jan 23    As crypto cratered, Gemini talked to customers about FDIC insurance Customers say that led them to believe their accounts were insured by the agency. They weren’t.      ",
                    "links": [
                        "https://www.gemini.com/dollar",
                        "https://www.axios.com/2023/01/30/as-crypto-cratered-gemini-talked-to-customers-about-fdic-insurance",
                        "https://www.axios.com/2023/01/30/as-crypto-cratered-gemini-talked-to-customers-about-fdic-insurance",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/93"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.22985347985348
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#13",
                    "likes": "3",
                    "time": "03/02/2023-22:18:58",
                    "content": "I think these are great questions being asked by Daverington. Gemini declined to comment when asked for a response, according to this article. Maker deserves a response to these questions as they are in a large business partnership. I would like to add an additional question: How much of GUSD’s reserves are held at Gemini’s listed banking partners? Based on the latest GUSD attestation, $272M is held at 3 banks:  State Street Bank and Trust Company Signature Bank Silvergate Bank  This represents aprox 47% of the cash reserves for GUSD. The attestation doesn’t provide a breakdown of how much is held at each of these banks. Notably, Silvergate was only added to the attestation for September 2022, the exact same time as the latest GUSD PSM proposal was announced. Silvergate is now facing a DOJ investigation, and there are legitimate concerns that they could face the possibility of bankruptcy. In addition, new information is coming to light that suggests legal and regulatory problems loom for Signature Bank.  MakerDAO should be insisting on a complete breakdown of how much of GUSD reserves are held at these banks, so that Maker can update it’s level of risk related to these banking partners.  FDIC insurance covers only $250,000 per depositor, per insured bank, for each account ownership category. The FDIC provides separate coverage for deposits held in different account ownership categories. Silvergate, and now likely Signature Bank, will be facing regulatory concerns relating to their crypto activities. Were these banks to declare bankruptcy, FDIC insurance would not cover anywhere close $272M losses. The fact that Silvergate was only recently added as a banking partner, my personal concern is that a large amount of Gemini’s GUSD reserves are now held at this bank, which is facing the real risk of bankruptcy. ",
                    "links": [
                        "https://assets.ctfassets.net/jg6lo9a2ukvr/25U6PLpkinOkZVgPq2vOko/46d913e92ca9a63ae04da9eef08c7501/Gemini_Trust_Company_LLC_9-30-22.pdf",
                        "https://www.bloomberg.com/news/articles/2023-02-02/silvergate-faces-doj-fraud-probe-over-ftx-and-alameda-dealings",
                        "https://dirtybubblemedia.substack.com/p/signs-of-trouble-at-signature-bank",
                        "https://www.fdic.gov/resources/deposit-insurance/brochures/deposits-at-a-glance/#:~:text=The%20standard%20insurance%20amount%20is,in%20different%20account%20ownership%20categories."
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.961444805194805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#14",
                    "likes": "10",
                    "time": "23/02/2023-02:57:27",
                    "content": "    GFXlabs:  We propose that a temporary, informal working group be established to make expected rewards adjust upwards and downwards with the yield on the underlying portfolio of cash, US Treasury securities, and US Treasury securities-based money market funds that back GUSD.   We are happy to announce that @GFXlabs @rspa, @justincase, @twblack88, @ultraschuppi, and incoming representative facilitator of the Risk team, @monet-supply, have secured a commitment from Gemini to increase the marketing incentives to a 2% annualized rate beginning in the next quarter. We have also secured a commitment for that rate to be re-evaluated every quarter. This is a good example of your delegates and core units rolling up their sleeves and finding a compromise where everyone is better off than before. If you hold a little MKR, be sure to tell one of those other delegates you appreciate their work. The Gemini team has also worked hard to provide additional transparency, but will let them detail the progress on that in a more complete post to follow in the coming days. In the end, we feel this updated arrangement leaves all parties in a better position than they were a month ago, and look forward to continued improvements when it is refreshed each quarter. GFX Labs wants to thank delegates, Risk Core Unit, and the Gemini representatives for making such quick, tangible progress in finding a way for the Maker protocol and GUSD to collaborate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.071614583333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#15",
                    "likes": "2",
                    "time": "23/02/2023-08:50:35",
                    "content": "Onwards and upwards. Especially happy about the added transparency. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#16",
                    "likes": "2",
                    "time": "23/02/2023-10:10:01",
                    "content": "Are you planning to propose changes to the GUSD DC (which is planned to go to 0 in the current scope draft) and to change the tin/tout which currently express a will to drain the liquidity out? And yes, @adcv is hammering Gemini for more transparency   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#17",
                    "likes": "1",
                    "time": "23/02/2023-14:03:05",
                    "content": "    GFXlabs:  We are happy to announce that @GFXlabs @rspa, @justincase, @twblack88, @ultraschuppi, and incoming representative facilitator of the Risk team, @monet-supply, have secured a commitment from Gemini to increase the marketing incentives to a 2% annualized rate beginning in the next quarter. We have also secured a commitment for that rate to be re-evaluated every quarter.   This reads like great news. To the unexpert reader, a lot of context is missing. Some of the potential questions to evaluate the deal: 1.- Has the interest rate changed on the market? (It could be that underlying assets are paying them now 15% and our share didn’t go up as much?) 2.- Is the risk on the asset higher? Has it changed? 3.- Has the overall risk of Maker and its balance sheet changed? 4.- Is this the most efficient use of time of all the experts you mentioned? How will it work when we scale 100x? I’m assuming that it’s good since I’ve known most of the actors for a while, and I do think they have the best intentions. What’s more, I’m glad that the Community has started working towards getting the frameworks done. Frameworks working on each questions: 1.- MIP103 & MIP105 2.- MIP105 3.- MIP103 4.- MIP106 To everyone interested, please join the calls and give feedback. It’s really important to get Maker to a point where it’s sustainable. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip105-the-real-world-asset-collateral-scope-framework/19688",
                        "https://forum.makerdao.com/t/mip105-the-real-world-asset-collateral-scope-framework/19688",
                        "https://forum.makerdao.com/t/mip103-the-stability-and-liquidity-scope-framework/19675",
                        "https://forum.makerdao.com/t/mip106-the-ecosystem-scope-framework/19691"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#18",
                    "likes": "3",
                    "time": "23/02/2023-16:38:17",
                    "content": "Your proposal to keep the GUSD passed by a just 50.85% in favour. As I’ve stated, I will respect the decision of the vote, but as the favourhood of this proposal has dropped from the original 99%, to essentially a 50/50 split, the least you could do is address the ongoing concerns that have been raised in this forum. I’m glad to hear that the team will bring in an additional 2%. (Reward) However, please address the ongoing risks that have been raised in this forum (Risks). @DaveringtonPLLC has raised legitimate concerns (along with myself), and they have been ignored. GUSD continues to rank in the top 3 for lowest volume cryptocurrency, based on 24 hour vol and even when normalized based on Mcap size. GUSD is one of the least popular cryptocurrencies in the industry based on the publically available metrics. MakerDAO now represents just under 90% of all GUSD in existence, with only 6.6% of the supply held in private wallets. Gemini Earn customers still have not been made whole by Gemini in relation to their halted GUSD withdrawals, while MakerDAO continues to profit off the situation via the GUSD PSM.  This deal is morally wrong, and goes against everything crypto was meant to stand for. MakerDAO has the ability to use its large market position to stand up for the little guy, and has instead chosen to support a massive corporation in order to profit. The reputational damage to MakerDAO is not worth the short term profit.   vol 24hr1558×260 36.6 KB   vol per mcap1569×307 49.7 KB   GUSD-reserves-Google-Sheets1080×668 27.7 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.153273809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaveringtonPLLC",
                    "index": "#19",
                    "likes": "2",
                    "time": "23/02/2023-16:44:38",
                    "content": "No one wants me in those private meetings bringing the fire of hard questions!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.725694444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#20",
                    "likes": "7",
                    "time": "23/02/2023-22:19:17",
                    "content": "    juan:  1.- Has the interest rate changed on the market? (It could be that underlying assets are paying them now 15% and our share didn’t go up as much?)   Per Gemini’s trust center, GUSD is invested in cash and cash equivalents (short term treasury bills, bank deposits, money market funds investing solely in short term treasury bills). The short end of the treasury yield curve gives a pretty decent estimate of top end of what Gemini might be earning on GUSD reserves.  Suffice it to say, would be fairly certain their weighted average return is no higher than ~5%, and likely significantly less because banks typically pay less than 100% of treasury rate on deposits, money market funds charge fees, etc.     juan:  2.- Is the risk on the asset higher? Has it changed?   Will defer to Gemini on this I guess, but based on trust center disclosures it seems not.     juan:  3.- Has the overall risk of Maker and its balance sheet changed?   PSM balances are fairly steady over the past few months. I don’t think Maker’s positioning has significantly changed.     Cryptohippo65:  GUSD continues to rank in the top 3 for lowest volume cryptocurrency, based on 24 hour vol and even when normalized based on Mcap size.   Would obviously prefer if on-chain usage was higher than it is. But the primary source of liquidity for GUSD is creation/redemption via Gemini (exchanging GUSD for USD), which is not reflected in volume metrics.     Cryptohippo65:  Gemini Earn customers still have not been made whole by Gemini in relation to their halted GUSD withdrawals, while MakerDAO continues to profit off the situation via the GUSD PSM.   Gemini Earn and GUSD are separate. Saying Maker “continues to profit off the situation” (referring to Gemini Earn being frozen) is not accurate - Maker does not earn anything at the expense of Earn users. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-february-2023/20011"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.257936507936508
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#21",
                    "likes": "0",
                    "time": "24/02/2023-20:20:33",
                    "content": "First off, thank you @monet-supply for responding as it’s been radio silence since the vote. Only a few items were addressed, so I will first discuss those and then circle back to the even more pressing questions. Part 1: Responses     monet-supply:  Would obviously prefer if on-chain usage was higher than it is. But the primary source of liquidity for GUSD is creation/redemption via Gemini (exchanging GUSD for USD), which is not reflected in volume metrics.   The creation/redemption data is easily available, and since GUSD was added to the Maker PSM, it has flatlined. Well actually, its marketcap plummetted after the deal, and left Maker holding 90% of all GUSD in circulation. Since then, the creation/redemption liquidity is now practically dead since October (around 4 months of practically no market interest in GUSD. Why is MakerDAO the only party that is interested?)     monet-supply:  Gemini Earn and GUSD are separate. Saying Maker “continues to profit off the situation” (referring to Gemini Earn being frozen) is not accurate - Maker does not earn anything at the expense of Earn users.   Gemini Earn and GUSD are both owned by Gemini. As Gemini continues to pay interest to MakerDAO, it still has not compensated Gemini Earn customers. MakerDAO is making profit from Gemini, who has frozen withdrawals of $900M to Gemini Earn customers. You’re burying your head in the sand if you honestly believe that’s not the situation. The reputational damage to MakerDAO from this deal will be hard to recover from. People don’t easily forget in crypto. Part 2: Important Questions yet to be answered: @DaveringtonPLLC is still awaiting a response to her questions regarding the NYDFS investigation, and the issues regarding Silvergate and Signature.     GUSD & MakerDAO Partnership Update Governance       Axios claims in a report this morning that the NYDFS is investigating Gemini. The article, quoted and linked below, discusses GUSD customer marketing and communications at length. It is a helpful read for illustrating how the Earn program issues might be relevant to our assessment of GUSD risk to MakerDAO.    Its Earn product resembled a savings account. Investors put in funds — either their own cryptocurrency or they paid dollars for Gemini’s stablecoin, GUSD — and were told they’d make as much…     I have also raised important due diligence questions regarding Gemini’s current banking situation with Silvergate and Signature Bank that are also still waiting on a response:     GUSD & MakerDAO Partnership Update Governance       I think these are great questions being asked by Daverington. Gemini declined to comment when asked for a response, according to this article. Maker deserves a response to these questions as they are in a large business partnership.  I would like to add an additional question:  How much of GUSD’s reserves are held at Gemini’s listed banking partners?  Based on the latest GUSD attestation, $272M is held at 3 banks:   State Street Bank and Trust Company Signature Bank Silvergate Bank  This represe…     Please bear in mind that all these tough questions are being asked to protect MakerDAO. It sometimes feel like I’m speaking to Gemini representatives, rather than MakerDAO members who should be most concerned with protecting MakerDAO. I’ll remind you that the vote was essentially split 50/50 on whether to keep the GUSD, so please recognize that there is a now verified split over the GUSD situation. The GUSD conversation now appears to be happening over two threads, so I’ll also link to points I’ve outlined showing some very concerning elements around the GUSD vote that I find incredibly suspect:     GUSD & MakerDAO Partnership Announcement Integrations       A few things don’t sit right with me about the Gemini deal.  The vote was conveniently scheduled so that it would end the EXACT same date that Genesis declared chapter 11 bankruptcy. This information would have had a significant impact on the vote IMO.  Although I will respect the decision of the vote, I find this timing incredibly suspicious.  It has also come to my attention that just a month before the updated GUSD proposal was suggested, on 15AUG2022 Gemini Earn requested $465M collateral fr…     ",
                    "links": [
                        "https://www.dfs.ny.gov/",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-update/19428/13",
                        "https://assets.ctfassets.net/jg6lo9a2ukvr/YuFTqx62uNJ9xztY68GKb/22228546a397e4a403e36c486bc8e09e/Gemini_Dollar_Examination_Report_12-30-22.pdf",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/149"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.081597222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#22",
                    "likes": "2",
                    "time": "24/02/2023-20:46:16",
                    "content": "    Cryptohippo65:  Gemini Earn and GUSD are both owned by Gemini. As Gemini continues to pay interest to MakerDAO, it still has not compensated Gemini Earn customers. MakerDAO is making profit from Gemini, who has frozen withdrawals of $900M to Gemini Earn customers. You’re burying your head in the sand if you honestly believe that’s not the situation. The reputational damage to MakerDAO from this deal will be hard to recover from. People don’t easily forget in crypto.   Gemini pays out less to Maker on GUSD than they earn from managing the reserves. So if anything, the GUSD PSM may actually improve their financial capacity to manage any Gemini Earn related obligations. It is definitely not creating a situation where Gemini Earn users are worse off than they otherwise would be. Anyone taking shots at Maker’s reputation based on an argument that it is harming Earn users is misinformed. With respect to transparency and open questions, I’ll let gemini speak for themselves. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#23",
                    "likes": "0",
                    "time": "24/02/2023-21:40:45",
                    "content": "We’ll agree to disagree on this point, as the financial questions that have been asked and are still awaiting responses, are ones that will have definitive answers that will move the discussion forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/beardmars",
                    "index": "#24",
                    "likes": "7",
                    "time": "28/02/2023-15:29:17",
                    "content": "Hey everyone – glad to see the continued discussion here. We wanted to follow-up with an update on how we are improving the risk / reward calculus for the GUSD PSM:  As GFX already mentioned, we are committing to increasing the marketing fee to 2% annualized rate beginning next quarter. This fee will be revisited on a quarterly basis. We are working to publish details of our investment portfolio (CUSIPs, balances, maturities, etc.) to increase transparency of holdings. We are exploring solutions to provide on-chain transparency to the underlying asset reserves and making that even more real-time than our monthly attestation process. We updated the GUSD website to provide more clarity on how BPM LLP conducts attestation examinations on one randomly-selected business day each month in addition to their end of month attestations.  To respond to a few points also flagged by the community: Re: how this relates to Earn     tylerwinklevoss:   As an initial matter, while Gemini Trust Company, LLC (“Gemini”), as the agent for Earn users, is working tirelessly on their behalf to return assets that those users lent to Genesis, the applicable governing agreements provide that Earn users have principal risk directly against Genesis, and, as a result, the approximately $900 million outstanding to Earn users are owed by Genesis, not Gemini. Gemini did not borrow or use any of the Earn users’ assets.     Gemini is not legally permitted to disclose any specific discussions with the NYDFS. What we can share is that as a NYDFS regulated limited purpose trust company, we are always in regular communications with the NYDFS. For example, Gemini is subject to regular comprehensive examinations by the NYDFS–this is a requirement for any NYDFS trust company. These examinations cover a wide array of issues and controls, including those related to finance, compliance, cybersecurity, and many others. This serves as additional proof that Gemini has always prioritized regulatory compliance and close partnership with all of our regulators, including the NYDFS. While we are not currently able to publish cash holdings at each of our banking partners, we are working to publish details of our investment portfolio (CUSIPs, balances, etc.) and our total cash allocation such that GUSD’s reporting standards are in-line with other market-leading stablecoins.  We’re looking forward to continuing the partnership with Maker and want to reiterate our thanks to every stakeholder who has worked with us to advance the partnership. Onwards and upwards, Marshall ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.301501035196687
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#25",
                    "likes": "1",
                    "time": "28/02/2023-19:52:36",
                    "content": "10% of the concerns have been responded to. 90% of the concerns have yet to be addressed that were raised almost a month ago. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#26",
                    "likes": "0",
                    "time": "02/03/2023-04:12:27",
                    "content": "Okay things are starting to get serious, and we’re not getting any answers. “Crypto Bank Silvergate Plunges After It Says Examining Viability, Delays Annual Report” https://www.bloomberg.com/news/articles/2023-03-01/silvergate-says-annual-filing-delayed-as-it-reviews-controls Gemini’s reserves are held at Silvergate (along with Signature Bank & others), and yet we still have no answer on how much of GUSD’s funds are held at Silvergate. How much of GUSD’s reserves are held at Silvergate? I almost forgot to add a crucial point:   Silvergate missed their annual report.   Gemini holds unknown amount of GUSD reserves at Silvergate.   Gemini has just missed their GUSD monthly attestation for the first time.   Is this not a cause for concern? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.447916666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#27",
                    "likes": "0",
                    "time": "02/03/2023-14:00:45",
                    "content": "Thanks for keeping us on our toes! The Endgame Constitution and pregrame plan, a significant organizational restructuring, will be placed before MKR holders to approve or reject this month: MIP101-114. The MIP set contains new parameters that will modify policy on GUSD and other centralized stablecoins. The specifics are somewhat hard to parse, but we believe the relevant sections are contained in the Stability and Liquidity Scope Framework (see 3.2: ALM Rules for Stability Collateral) and Real World Asset Collateral Framework (see 5.2.3: Incubated Stablecoin Implementation). ",
                    "links": [
                        "https://forum.makerdao.com/t/mip103-the-stability-and-liquidity-scope-framework/19675/1",
                        "https://forum.makerdao.com/t/mip105-the-real-world-asset-collateral-scope-framework/19688/1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.67478354978355
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#28",
                    "likes": "0",
                    "time": "02/03/2023-21:32:17",
                    "content": "    Cryptohippo65:  How much of GUSD’s reserves are held at Silvergate?   Glad to here to MakerDAO is making progress towards that plan. However in the meantime, a simple due diligence questions remain unanswered by MakerDAO. The team responsible for risk management need to start doing their job or be replaced. They are putting MakerDAO at risk for no reason, by not obtaining the answers to the following questions: 1. How much of GUSD’s reserves are held at Silvergate? Signature Bank will be next, so I will also throw in: 2. How much of GUSD’s reserves are held at Signature Bank? Also, 3. why has Gemini still not released it’s monthly attestation for GUSD? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#29",
                    "likes": "0",
                    "time": "02/03/2023-22:46:00",
                    "content": "Teams are doing a great job. Comments on discussions and information obtained cannot always be posted real time with every headline, so communication may be lagging on replies to questions in the forum. But better to have Core Units in the trenches right now - of which there are many. This Tweet give us some update from Gemini   twitter.com    Gemini @Gemini  1/ We are actively monitoring the situation with Silvergate Bank. We currently have zero customer funds and zero GUSD funds held at Silvergate.   5:29 PM - 2 Mar 2023           120                20            ",
                    "links": [
                        "https://twitter.com/Gemini/status/1631346061942857728?s=20",
                        "https://twitter.com/Gemini/status/1631346061942857728?s=20",
                        "https://twitter.com/Gemini/status/1631346061942857728?s=20"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.537414965986395
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#30",
                    "likes": "1",
                    "time": "03/03/2023-00:56:36",
                    "content": "Risk Management Team Respectfully, I have to disagree that the team is doing a great job. They have failed to do the most basic and fundemental risk assessment, aka what are the risks to the GUSD reserves. I raised the question about how much of GUSD reserves are held at Silvergate almost a month ago, and they still have no answer. Now Silvergate is falling apart. MakerDAO was given a month’s head start to perform adequate risk management duties, and the team has failed in this regard. Failing to obtain this info was/is a dereliction of duty, there is no other way to put this. Gemini Tweet Wow, this is the most concerning statement I have yet to see being released by Gemini. Silvergate has been specifically listed as one of the banks were GUSD funds are stored on their monthly attestations. Their most recent monthly attestation has been missed/delayed, so their is zero ways to confirm if this statement is true. Any reasonable person would notice that Gemini’s missed attestation coincides exactly with when Silvergate missed their annual report, and see that this is a major read flag. Had they actually gotten their GUSD funds out in time, they would have released their monthly attestation showing that Silvergate is no longer used to store GUSD funds. This should be a red alert for MakerDAO, as you are now at Defcon 2 for the $500M GUSD ticking time bomb. Defcon 1 will be reached once Signature Bank is the next in line to face the music. All I have ever done is tried to protect MakerDAO. My concerns about Silvergate were ignored. I strongly urge all members to take these concerns seriously. UPDATE: They’ve just released their latest monthly attestation, and Silvergate was listed as one of the banks were they stored GUSD funds. Gemini didn’t say that they were able to safely remove all funds from Silvergate, they simply stated that they currently hold no funds there, even though the attestation signed on 28FEB2023 for the month of Jan2023, they had held funds there. When were the funds removed, and how much GUSD funds were held there? Why is MakerDAO doing business with an entity that won’t answer even the most basic questions about how much money is being held at each bank? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.94489247311828
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#31",
                    "likes": "1",
                    "time": "03/03/2023-04:24:48",
                    "content": "    Cryptohippo65:  what are the risks to the GUSD reserves.   Let’s acknowledge that everything in life is risky except shitposting as an anon. I think I posted somewhere that stablecoin using too much banks account are not great. Which is why I like(d) BUSD. Why is Gemini relying so much on bank account I don’t know but I assume is to get a sufficient liquidity. While I don’t agree, I understand as crypto people can’t wait T+2.     Cryptohippo65:  Their most recent monthly attestation has been missed/delayed, so their is zero ways to confirm if this statement is true.   Well what do you mean by missed? It is live now. If I recall correctly October was delayed as well with delayed being after 1 month. USDC attestation is still not out. It’s a bigger exposure for MakerDAO. Are you complaining about USDC? Strangly no. And USDC is still, using latest attestation, exposed to Silvergate. Now, as the money is already gone invested in a VC fund by ex-Genesis people and was lost refunding Genesis. So it’s lost already twice according to your speculations. What the point of still complaining? What is lost is lost. I agree that the space could do better and we are pushing for better even if we not agree on the method. I respect that you are doing your best to help. Thank you for that. ",
                    "links": [
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/149"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.220716783216783
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#32",
                    "likes": "2",
                    "time": "03/03/2023-08:56:10",
                    "content": "    SebVentures:  I respect that you are doing your best to help. Thank you for that.   To be honest this statement feels ridiculous after the earlier:     SebVentures:  Let’s acknowledge that everything in life is risky except shitposting as an anon.   I think @Cryptohippo65 raised valid questions in a polite way. And being an anon or not, should have no impact whatsoever on how seriously the questions are taken and answered.     SebVentures:  Are you complaining about USDC? Strangly no.   How is this relevant? With that “strangely” you are basically insinuating something in a passive aggressive way. He’s asking about GUSD because this thread is devoted to that. And He’s free to focus his (unpaid) attention on GUSD and not on USDC for reasons that we should not care about. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.046296296296296
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#33",
                    "likes": "0",
                    "time": "03/03/2023-09:51:42",
                    "content": "I am not sure who exactly you are addressing with the Risk Management Team, but wanted to point out that Risk CU has nothing to do with analysing risks which you are describing. We do not do any kind of legal/regulatory/counterparty assessments. We only do assessments and recommendations based on on-chain collateral and data which is available to everyone. Historically, our recommendation on the topic of PSM reserves was that we should never increase exposure post 50% of supply of any stablecoin, this is true for all on-chain collateral assets and that adding GUSD and USDP does not decrease risk due to diversification, and that we would likely be better off dealing only with USDC for peg management. GUSD and USDP don’t do anything in regards to peg management, because they are illiquid on-chain. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.784090909090908
                },
                {
                    "author_link": "https://forum.makerdao.com/u/C_Siefken",
                    "index": "#34",
                    "likes": "0",
                    "time": "03/03/2023-12:17:52",
                    "content": "This post was flagged by the community and is temporarily hidden. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaveringtonPLLC",
                    "index": "#35",
                    "likes": "4",
                    "time": "03/03/2023-14:12:16",
                    "content": "    rema:  I am not sure who exactly you are addressing with the Risk Management Team, but wanted to point out that Risk CU has nothing to do with analysing risks which you are describing. We do not do any kind of legal/regulatory/counterparty assessments. We only do assessments and recommendations based on on-chain collateral and data which is available to everyone.    Extremely important point for everyone to understand, and exactly why the passage of the Endgame Consitution and pregame MIP set is vitally important to happen with a massive show of YES support from ALL large MKR holders. I want to personally chime in here @Cryptohippo65 because you are CORRECT to raise all the issues you have, and I have done similarly in various comments here, on my personal Twitter and in my role supporting Delegate services with @ACREinvest. There is a structural problem at MakerDAO that prevents the kind of risk management ideally suited in this case. The Core Unit teams are not the management of MakerDAO - there is no management like we’d see at a centralized business with appropriately experienced legal, credit and risk divisions specific to the “Real World” aspects of the situation. Instead there are conflicting interests of large MKR holders expressed in ways both public (such as the dramatic GUSD vote in January recently) and private (such as through certain delegates holding closed meetings with Gemini), all of which puts the Core Unit workforce in a terrible position. They do not have the mandate nor (in many cases) the specific expertise on staff to address and advise on the substance of all the issues you and I and a few others have been banging the drum about since as far back as November/December 2022. My own view is that the substantive changes in the Endgame Constitution Scope Framework MIPs in addition to the Ecosystem-wide restructuring will vastly improve the risk management situation at hand, and the ability of the project as a whole to do a host of things better in the future. The status quo is totally unsustainable, especially concerning the security and stability of the full-time work force who have been tossed to and fro over the past year in the most untenable ways by financial interests NOT aligned with what’s best for their individual quality of life and professional integrity. ",
                    "links": [
                        "https://twitter.com/labsGFX/status/1629132283125923841?s=20"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.74578373015873
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#36",
                    "likes": "0",
                    "time": "04/03/2023-16:01:34",
                    "content": "In the Endgame, rather than CUs having to listen to the collective and pass resolutions based on meaningful conversations, subdao actors, upon approval, will have the autonomy to make decisions. Curious to hear why you think this solves the issue of risk management? It would be no different than how a regular corporation operates, we have gone full circle… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaveringtonPLLC",
                    "index": "#37",
                    "likes": "1",
                    "time": "05/03/2023-15:42:16",
                    "content": "    TRUEMAKER:  It would be no different than how a regular corporation operates, we have gone full circle…   It’s exactly the opposite of full circle. If MakerDAO today is a dot, Endgame MakerDAO is a hypercube. We all have to lean into VISION here in order to succeed, plus add not a little dash of FAITH in what we can do together. The details in the weeds rightfully can be endlessly picked apart and criticized for their flaws. It may be that the Endgame is massively UNlikely to succeed. But if the plan is decent enough at this stage, I am actually encouraged that a lot of people do not like it and that it is very hard to fully understand today how it will work. Because, if you think about it, the literal “endgame” we are aiming for is even more impossible to achieve, so it logically would require a (nearly) impossible plan. Another way to visualize the Endgame Era would be with a Star Wars theme. Today we have MakerDAO, a planet. Tomorrow we have MakerDAO, a galaxy. Screen shot from the excellent talk given by @Retro at ETHDenver. Highly recommended watch!  Screen Shot 2023-03-05 at 9.56.54 AM1920×1156 88.3 KB  The Core of MakerDAO is actually simplifying in the Endgame in all the ways everyone wants it to. The envisioned structure takes us to a model of human organization and coordination that has never existed on planet earth, but is now possible because of public blockchain technologies (combined with competing generative AI applications). Such an ecosystem… or galaxy… approach has hardly been contemplated yet for a DAO and certainly no one is able to attempt it except the MakerDAO community. It’s the ultimate regulatory and legal risk strategy IMO, because if it can work, it can work within the substantive boxes our current legal systems while introducing something truly new that cannot be addressed by the tradfi financial markets compliance superstructure. To date in the “crypto” industry we have had a lot of calling things new that are not new, so there are very legitimate enforcement actions occurring right now. Do not believe those who are claiming there is NO clarity. Doing the same thing a new way does not mean one can avoid the consequences of laws that are flexible enough to provide for old dogs doing new tricks. So, I’m excited about Endgame because ON THE MERITS I’m seeing a structure that can comply with laws today, embody the spirit of laws AND push the world forward in designing NEW legal and compliance systems that are more appropriate for the future we want to inhabit. With that said, hopefully it becomes clear how risk management can occur effectively closer to where the risks are held out in the galaxy, away from Maker Core. This includes expertise in Real World Asset risk management, expansion of product offerings, last mile use-cases, Venture Philanthropy… all the things you can think of other than how the Core protocol essential smart contracts operate, upgrade and are maintained permissionlessly for all time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.47754329004329
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#38",
                    "likes": "1",
                    "time": "06/03/2023-19:04:48",
                    "content": "Thank you @iammeeoh for voicing what I felt regarding @Sebventures response. I no longer believe Seb is discussing the GUSD risk in good faith, and is instead trying to distract from the topic at hand. However, I will address two points by Seb.     SebVentures:  USDC attestation is still not out. It’s a bigger exposure for MakerDAO. Are you complaining about USDC? Strangly no.   If you want USDC reduced in MakerDAO’s reserves then please go ahead. I don’t disagree with your concerns there. That concern can be raised in the appropriate forum.     SebVentures:  Now, as the money is already gone invested in a VC fund by ex-Genesis people and was lost refunding Genesis. So it’s lost already twice according to your speculations. What the point of still complaining? What is lost is lost.   This is the most financial reckless statement I have heard from a member of MakerDAO. What is lost is lost??? MakeDAO still has aprox $500M GUSD in the PSM. MakerDAO could easily redeem the GUSD, and reduce it’s exposure to zero. Nothing is lost yet, but it’s almost as if Seb has accepted the fact that the $500M GUSD is already gone. This logic is mindbogglingly, and I strongly recommend that Seb be kept away from any financial decisions for MakerDAO going forward. No one with an attitude this reckless towards half a billion dollars should be anywhere near the financial decisions of MakerDAO. This is the road towards bankruptcy. Risk Management Concerns @rema and @DaveringtonPLLC  have brought to my attention points that I was not aware of regarding the risk management team:     rema:  We do not do any kind of legal/regulatory/counterparty assessments.       DaveringtonPLLC:  The Core Unit teams are not the management of MakerDAO - there is no management like we’d see at a centralized business with appropriately experienced legal, credit and risk divisions specific to the “Real World” aspects of the situation.   As the Risk Management team were not assigned to perform the required risk assessment for real world assets, I retract my statement that it was a dereliction of duty by them. I’m sorry for that statement, as it’s now clear you were only doing what you were instructed/permitted to do. Instead, whoever was in charge of assigning the duties to the risk management team is the party to blame. Whoever was/is in charge of this has completely failed in their role. IMO, there is no room for error in financial decisions of this scale, and there should be drastic consequences for a failure of this magnitude. Experienced adults need to be running MakerDAO. Egos need to be left at the door.     rema:  Historically, our recommendation on the topic of PSM reserves was that we should never increase exposure post 50% of supply of any stablecoin, this is true for all on-chain collateral assets and that adding GUSD and USDP does not decrease risk due to diversification, and that we would likely be better off dealing only with USDC for peg management. GUSD and USDP don’t do anything in regards to peg management, because they are illiquid on-chain.   GUSD exposure if hovering around 90% of the supply. It has gone well above the recommended levels, and should at the very least be brought back in line to this recommendation and reduced to $250M.  What is the purpose of the risk management team’s recommendations if they’re are disregarded?  Rema has also highlighted the fact that GUSD doesn’t do anything in regards to peg management.  Why is MakerDAO taking on this unnecessary risk, if GUSD isn’t even servering the purpose of the PSM?  Words fail me at how illogical  the GUSD deal is, and how it fails on every criteria it should be meeting. Signature Bank I will finish by highlighting that the Signature Bank risk is still present, and it would be ridiculous for us to be discussing later in the year that MakerDAO has lost $500M to GUSD. Signature Bank has even declared that the majority of their funds are not FDIC insured. What more does MakerDAO need to here before these concerns are acted upon? \"Given our business model, our depositor base is more heavily weighted to larger uninsured deposits than many other banks. As of Dec. 31 2022 approximately 89.7% of our total deposits of $88.59 billion were not FDIC-insured.\" (Credit to Cryptadamist for drawing attention to this issue: https://twitter.com/Cryptadamist/status/1631147958572929029/photo/1  signature bank1858×1046 183 KB  ",
                    "links": [
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/149",
                        "https://twitter.com/Cryptadamist/status/1631147958572929029/photo/1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2535
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#39",
                    "likes": "0",
                    "time": "06/03/2023-19:31:15",
                    "content": "I get the concerns but I dont really understand their magnitude, eg All of DAIs deposits are FDIC-uninsured yet that does not mean that DAI will fail. Furthermore, deposits at banks can be transferred to others banks immediately via wires and with a one or two day lag with ACH. Gemini has multiple bank accounts, so if a bank gets downgraded, they can just transfer funds to a more solvent bank. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.35625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#40",
                    "likes": "0",
                    "time": "06/03/2023-20:07:10",
                    "content": "Truemaker continues to ask the same questions about not understanding the issues at hand. His questions have been answered on numerous occasions by different individuals, rebutting his claims that FDIC will offer protection for the full $500M GUSD. And yet he continues to ask the same question over and over.     GUSD & MakerDAO Partnership Announcement Integrations       Even though Silvergate Bank’s credit rating is BB, it is still an FDIC-insured bank, meaning deposits up to $250,000 per depositor are insured. According to Gemini’s response, the PSM was filled by Gemini holders, not just a handful of investors. If that is the case, the majority of deposits would be insured.  I am not saying the above risks should not be considered, but we should also be realistic about them.         GUSD & MakerDAO Partnership Announcement Integrations       That is not how it works.  Gemini’s accounts at FDIC-insured banks are called FBO accounts. This means that Gemini deposits funds For Benefit Of (FBO) its GUSD holders. In the case of a FDIC-insured bank going bankrupt, the FDIC would take over the bankrupt bank’s accounts and request Gemini to provide a list of the clients that make up the deposit of their account at the bankrupt bank in order to determine FDIC eligibility. Thus, Gemini depositors are insured by the FDIC up to a limit of $250,…         GUSD & MakerDAO Partnership Announcement Integrations       A simple google search or search in the fdic website will show that Silvergate Bank is an FDIC insured bank…  Silvergate Bank (FDIC Certificate  #27330)   [Screenshot_20221222_084551]       GUSD & MakerDAO Partnership Announcement Integrations       Its in your comment. I dont understand your argument. Gemini has accounts at an fdic insured bank and the fdic provides pass through insurance to Gemini’s customers.         GUSD & MakerDAO Partnership Announcement Integrations       It says maybe because they only insure up to 250k per depositor. Stop changing your argument to spread FUD in an already volatile market         GUSD & MakerDAO Partnership Announcement Integrations       The interest is kept by Gemini, so it would go to a separate account to avoid cummingling of funds.  Can you please explain how the below would happen?  MMFs trade at Constant NAV (Government Funds), therefore even if Gemini is forced to sell all of its shares to cover withdrawals, they would receive 100% of the principal.         GUSD & MakerDAO Partnership Announcement Integrations       Yes, that is correct. Gemini has four participating banks, so they can split deposits into 250K chunks to receive up to one million in insurance per depositor. However, I agree that we should inquire about the insured/uninsured distribution of deposits as that is the main risk if any of those banks become insolvent.         GUSD & MakerDAO Partnership Announcement Integrations       The collateral for GUSD, are deposits of equal value at a few banks. Can you please explain how those are at risk?     ",
                    "links": [
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/112",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/116",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/118",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/120",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/122",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/125",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/144"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.194444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#41",
                    "likes": "0",
                    "time": "06/03/2023-21:45:27",
                    "content": "Have you provided an explanation as to why you believe FDIC uninsured deposits are at risk? Once I have received your response, I will stop asking… Less than 1.35% of all US bank deposits are insured by FDIC The increase in assessment rate schedules is intended to increase the likelihood that the reserve ratio of the Deposit Insurance Fund (DIF) reaches the statutory minimum of 1.35 percent by the statutory deadline of September 30, 2028. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#43",
                    "likes": "0",
                    "time": "06/03/2023-22:18:20",
                    "content": "Hypothetical future situation  Signature Bank collapses (all signs point in the direction of regulators cracking down on SBNY) All GUSD funds aren’t FDIC insured in event of bankruptcy (SBNY has stated this) Gemini fails to pull their reserves from Signature Bank in time. (100% trust in Gemini required) GUSD reserves are gone. MakerDAO is left holding a $500M deficit Seb will say “What’s lost is lost”  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.180555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#44",
                    "likes": "0",
                    "time": "06/03/2023-22:22:14",
                    "content": "Got it. So you think Gemini is not pulling funds from SBNY to other banking relationships (which they have) based on the downgrades, news, etc and instead is WAITING for SGNY to fail… Instead you are assuming Gemini has all of the GUSD collateral deposits with SGNY and does not know they could fail… Very rational ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#45",
                    "likes": "0",
                    "time": "06/03/2023-22:44:17",
                    "content": "I have zero interest in assumptions, which is exactly what you’re doing. You’re assuming Gemini has pulled their funds from SBNY. I actually read Gemini’s monthly attestations, something I would recommend all MakerDAO members to do. If you actually read my comments, you would see that I have been pressing for Gemini to reveal how much GUSD funds were held at both Silvergate and Signature Bank. Before I could get an answer, all their funds were removed from Silvergate. Based on their latest attestation (signed 28FEB23, for the month of Jan2023), GUSD funds were held at: The Gemini dollar reserves are held and maitained as cash depoists at:  Silvergate (now removed, based on their statement alone) Signature Bank State Street Bank & Trust Company  While you busy yourself with making assumptions, I’m actually trying to protect MakerDAO’s financial situation by trying to get the answers to Gemini’s financial situation. Playing defense for Gemini, only shows you more likely align with Gemini’s best interests, rather than that of MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.980769230769231
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#46",
                    "likes": "0",
                    "time": "06/03/2023-22:57:23",
                    "content": "Maybe ask Rating Agencies  to refresh their assessment of SGNY deposits risk. Seems you know more than they do SGNY Deposit Ratings ( Ratings updated as of January 23, 2023) Moodys P-1 - Issuers rated Prime-1 have a superior ability to repay short-term debt obligations . Fitch F2: Good short-term credit quality. Good intrinsic capacity for timely payment of financial commitments. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.6
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#47",
                    "likes": "0",
                    "time": "06/03/2023-23:30:15",
                    "content": "Silvergates ratings were good, until they weren’t. Due diligence is more than just reading their Deposit Ratings. I think I’ve outlined my concerns well, and proven myself as a useful voice in these forum, by highlighting well in advance my concerns about Silvergate, which have now materialized. I will leave my current concern outstanding, and MakerDAO can choose whether to perform the financial risk assessment or not. To the 50% who voted to end the GUSD PSM, I highly recommend you all to push for answers regarding Signature Bank:  Find out how much of the GUSD reserves are held at Signature Bank, before they are the next bank to suffer the same fate as Silvergate.  I’ll leave it at that for now, as TrueMaker & Seb seem more interested in squashing descent, rather than working towards a solution. I wish MakerDAO the best of luck, and I’ll make sure to continue to update this forum with any relevant new info to the GUSD PSM that comes up, in order to help the more rational voices on here to make informed decisions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.533712121212122
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#48",
                    "likes": "3",
                    "time": "08/03/2023-18:54:04",
                    "content": "New relevant info, so posting for all members to be aware of: “JP Morgan is cutting ties with Gemini exchange” I will add that their source is “a person familiar with the matter” so this story should be taken with a pinch of salt until there is official comfirmation.    coindesk.com – 8 Mar 23    JPMorgan Is Cutting Ties With Crypto Exchange Gemini: Source Coinbase said its banking relationship with JPMorgan remains intact.      UPDATE: Gemini has released a statement saying that it’s not true. Based on Coindesks questionable source, I would lean towards Gemini’s statement. Although I’m sure we’ll get the full picture one way or another later this week, as Coindesk will have damaged their own reputation if they don’t follow up with any evidence.   twitter.com    Gemini @Gemini  Despite reporting to the contrary, Gemini's banking relationship remains intact with JPMorgan.   7:08 PM - 8 Mar 2023           780                180            Update 2: This story was released by Ian Allison, the reporter who won an award for exposing FTX. I think Gemini have just gotten themselve caught in a lie. If their relationship with JP Morgan has ended, this will be a case of them having been caught in an outright lie. If this turns out to be the case, then Gemini has lost all reputational trust. Lets see how this story unfolds. ",
                    "links": [
                        "https://www.coindesk.com/business/2023/03/08/jpmorgan-is-cutting-ties-with-crypto-exchange-gemini-source/",
                        "https://twitter.com/Gemini/status/1633545195613462530",
                        "https://twitter.com/Gemini/status/1633545195613462530",
                        "https://twitter.com/Gemini/status/1633545195613462530",
                        "https://twitter.com/Gemini/status/1633545195613462530"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.306818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#49",
                    "likes": "2",
                    "time": "10/03/2023-18:03:14",
                    "content": "Events are developing quickly! Signature Bank’s stock price plummeted 25% today, and was so severe, that they halted trading. Signature Bank is being sued because of facilating FTX. I will add this is just the first of many issues to come out regarding Signature Bank. They have been banking incredibly shady customers, and their days are numbers.    WSJ    First Republic, Signature Bank, Other Regional Bank Stocks Halted Amid Selloff Several regional bank stocks were halted Friday morning amid a market selloff led by SVB Financial Group, owner of startup-focused Silicon Valley Bank. First Republic Bank, PacWest Bancorp, Western Alliance Bancorp and Signature Bank were all halted...         coindesk.com – 7 Feb 23    Signature Bank Sued for 'Substantially Facilitating' FTX Comingling Signature \"knew of and permitted the commingling of  FTX customer funds within its proprietary, blockchain-based payments network, Signet,\" according to a court filing.      Are you starting to realize that once Signature Bank follows Silvergate, that Gemini will have lost it’s two major crypto friendly banks? The regulators are working hard to debank crypto companies. (Also, to appease @SebVentures , USDC also suffered a blow today as one of its banks Silicon Valley Bank shutdown)    CNBC – 10 Mar 23    Silicon Valley Bank is shut down by regulators in biggest bank failure since... The tech-focused bank was closed by regulators on Friday after attempts to raise more capital failed.      Remember, if Gemini declares bankruptcy (realistically where are future profits going to come from after the Gemini Earn fiasco?), FDIC insurance will not cover the $500M GUSD. MakerDAO will be left with a half a billion hole in its treasury! Update 3: GUSD has now depegged $0.96, which is now seen on Etherscan. It appears someone has beaten Gemini to the punch, and has started removing GUSD from the PSM. I understand that Maker is likely on red alert with USDC as it’s the biggest problem right now. But the GUSD is also an issue if the team has time to address this.  -0-96-Gemini-dollar-GUSD-Token-Tracker-Etherscan1157×582 46 KB  Final Update 4: And now Signature Bank is also finished.   twitter.com    db @tier10k  [DB] US Says Signature Bank Closed Today by State Authority: BBG   10:15 PM - 12 Mar 2023           780                180            ",
                    "links": [
                        "https://www.wsj.com/livecoverage/stock-market-news-today-03-10-2023/card/bank-stocks-halted-amid-selloff-0hEyaXecb4xJQJl3rPpP",
                        "https://www.coindesk.com/business/2023/02/07/signature-bank-sued-for-substantially-facilitating-ftx-comingling/",
                        "https://www.coindesk.com/business/2023/02/07/signature-bank-sued-for-substantially-facilitating-ftx-comingling/",
                        "https://www.cnbc.com/2023/03/10/silicon-valley-bank-is-shut-down-by-regulators-fdic-to-protect-insured-deposits.html",
                        "https://www.cnbc.com/2023/03/10/silicon-valley-bank-is-shut-down-by-regulators-fdic-to-protect-insured-deposits.html",
                        "https://twitter.com/tier10k/status/1635041897365250049",
                        "https://twitter.com/tier10k/status/1635041897365250049",
                        "https://twitter.com/tier10k/status/1635041897365250049",
                        "https://twitter.com/tier10k/status/1635041897365250049"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.156047912992357
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#50",
                    "likes": "3",
                    "time": "13/03/2023-13:56:44",
                    "content": "Gemini disclosed where their funds are: State Street Bank, Goldman Sachs, and Fidelity.   twitter.com    Gemini @Gemini  3/ All GUSD reserves are held at State Street Bank, Goldman Sachs, and Fidelity.   1:32 PM - 13 Mar 2023           35                3            Gemini redeemed $150M during the WE according to on-chain data. ",
                    "links": [
                        "https://twitter.com/Gemini/status/1635272602980859906",
                        "https://twitter.com/Gemini/status/1635272602980859906",
                        "https://twitter.com/Gemini/status/1635272602980859906"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#51",
                    "likes": "0",
                    "time": "13/03/2023-17:11:09",
                    "content": "We’ve been warning for months about Silvergate and Signature Bank. Now that both banks have collapsed, are you willing to start taking on board the concerns about the GUSD deal, and stop labelling the critical thinkers doing risk assessment as FUD? This question also applies to @TRUEMAKER who just 7 days ago brushed off my latest warning regarding Signature Bank:     TRUEMAKER:  Maybe ask Rating Agencies to refresh their assessment of SGNY deposits risk . Seems you know more than they do SGNY Deposit Ratings ( Ratings updated as of January 23, 2023) Moodys P-1 - Issuers rated Prime-1 have a superior ability to repay short-term debt obligations . Fitch F2: Good short-term credit quality. Good intrinsic capacity for timely payment of financial commitments.   And I’m not looking to gloat. I’m looking for real change in those who have repeatedly dismissed legitimate concerns and labelled them as FUD (@SebVentures & @TRUEMAKER are the primary culprits). Leave your egos at the door, and start acting like professionals. This is about improving MakerDAO. Gemini’s latest statement Please note: Gemini had some notice about the issues regarding Silvergate in the news, so I can accept that they could have pulled funds from there in time. However, there was zero notice about Signature Banks shutdown. Even USDC got caught out by Silicon Valley Bank, and yet somehow Gemini has been able to miraculously pull their funds from Signature Bank in time. (Unless Gemini has actually been listening to the warnings in here that have been labelled FUD) Also, why is Gemini the ones pulling GUSD from the PSM, unless they were urgently in dire need of cash? Surely the members of this forum can see how suspicious this is? They literally depegged their own stablecoin over the weekend to get a hold of cash!     Cryptohippo65:   -0-96-Gemini-dollar-GUSD-Token-Tracker-Etherscan1157×582 46 KB   @tylerwinklevoss doesn’t repond to any critical questions in here, but I’ll ask anyway. Why did you pull $150M GUSD from your own GUSD PSM deal? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7894736842105265
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#52",
                    "likes": "1",
                    "time": "13/03/2023-17:55:28",
                    "content": " image1170×1143 182 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#53",
                    "likes": "6",
                    "time": "13/03/2023-18:20:38",
                    "content": "Man, you’ve got to chill. Every time you pull this scattershot approach, you make it that much more likely that everyone is going to keep ignoring you.     Cryptohippo65:  Even USDC got caught out by Silicon Valley Bank, and yet somehow Gemini has been able to miraculously pull their funds from Signature Bank in time. (Unless Gemini has actually been listening to the warnings in here that have been labelled FUD)   Even I was aware Signature was in a similar boat to Silvergate. For the past few weeks one has scarcely been brought up without the other. Is it so difficult to believe that Gemini wasn’t also aware of the potential issues, and acted accordingly?      Cryptohippo65:  Also, why is Gemini the ones pulling GUSD from the PSM, unless they were urgently in dire need of cash? Surely the members of this forum can see how suspicious this is?   There was an arbitrage opportunity because DAI depegged from $1, this is the reason the USDP drained out of the USDP PSM, because for a brief period you could purchase DAI for less than $1, and exchange it for 1 USDP (still worth a dollar.) The same was true for GUSD. We did see less of the arbitrage behaviour on GUSD, which is a little odd, but is likely not some hugely significant observation, and just down to which market makers were active and which arbitrage loop was quicker and easier. If Gemini or their agents were the source of these transactions, it is vastly more likely that it was to take advantage of this arbitrage opportunity, which could have netted millions of dollars. This is a really obvious possible explanation which you’ve completely disregarded.      Cryptohippo65:  They literally depegged their own stablecoin over the weekend to get a hold of cash!   Etherscan is not a reliable source of price data. That number on there comes from the uniswap V2 market, which has close to zero liquidity. The 150M could not have moved through that market, meaning the depeg there is likely completely unrelated to the large movement out of the PSM.  If you actually intend to convince people, you need to find arguments that are well-supported by reality, rather than guesswork and assumption. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.376842403628118
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#54",
                    "likes": "1",
                    "time": "13/03/2023-19:16:12",
                    "content": "Addressing another bad faith individual (Please skip to the end if you want to continue the relevant discusion)     LongForWisdom:  Man, you’ve got to chill. Every time you pull this scattershot approach, you make it that much more likely that everyone is going to keep ignoring you   I’ve been an active contibutor to this discussion, and at least half of the DAO agrees with my position. Again, stop trying to belittle those you disagree with. There are so many people in MakerDAO with an attitude problem. Hold yourself in a professional manner.     LongForWisdom:  Even I was aware Signature was in a similar boat to Silvergate   Interesting you only chime in now after the fact, saying all this was so obvious, and yet you’ve actually contributed nothing to the thread prior to this.     LongForWisdom:  Etherscan is not a reliable source of price data.   GUSD was depegged over the weekend, which was verifiable over multiple sources. Any source I choose, the likes of you will continue to say that “X isn’t a reliable source”.     LongForWisdom:  If you actually intend to convince people, you need to find arguments that are well-supported by reality, rather than guesswork and assumption.   I’ve literally been providing sources throughout this thread, both from the media and onchain. This quote below was your only piece of good faith discussion so I will address this below:     LongForWisdom:  There was an arbitrage opportunity because DAI depegged from $1, this is the reason the USDP drained out of the USDP PSM   Gemini inacted the GUSD PSM, with the specific usecase of increasing the usage of GUSD. Taking a short term arbitrage profit goes completely against what they sought to achieve with the deal. If Gemini don’t believe in increasing their own stablecoin’s marketcap, then this suggests they don’t even believe in its own viability, in which case end this GUSD once and for all. However, this is only LongForWisdoms suggestion, which would be an illogical business move. But we don’t even need to guess. Lets actually let Gemini answer for themselves. My question still stands to @tylerwinklevoss,     Cryptohippo65:  Why did you pull $150M GUSD from your own GUSD PSM deal?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.612068965517242
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#55",
                    "likes": "3",
                    "time": "13/03/2023-19:17:07",
                    "content": "    Cryptohippo65:  We’ve been warning for months about Silvergate and Signature Bank. Now that both banks have collapsed, are you willing to start taking on board the concerns about the GUSD deal, and stop labelling the critical thinkers doing risk assessment as FUD?   I regret to say it but I have generally stopped taking your allegations seriously because they lack intellectual rigor. I and strategic finance team members have been deeply reviewing stablecoins all weekend, including analysis of balance sheet of underlying banks where they hold deposits and other operational considerations. I believe Maker must make decisions based on facts to ensure DAI is exposed to the least amount of risk possible. Contrary to what you may think, GUSD seems to be one of the stronger stablecoin options we can hold reserves in at this time (quite likely stronger than either USDC or USDP).     Cryptohippo65:  Why did you pull $150M GUSD from your own GUSD PSM deal?       Cryptohippo65:  They literally depegged their own stablecoin over the weekend to get a hold of cash!   To reiterate long’s point above, it is much more likely that third party users removed GUSD to be able to deposit to Gemini over the weekend and take advantage of arbitrage opportunities between Gemini and other exchanges / other stablecoins. Just because funds were deposited to Gemini does not indicate the transactions were undertaken by Gemini. And the alegation itself does not make sense, as the GUSD can only been withdrawn by supplying DAI in exchange - even if Gemini were in need of funds this operation would not have helped them in any way ($1 in, $1 out). If you have credible well researched information to share with respect to GUSD then please bring it forward. But your participation after the first few posts has unfortunately shown a lack of understanding, bordering on lack of good faith. Positive sum participation requires a willingness to consider that you may have been wrong or misunderstood how certain things work. Maker will continue to closely monitor risks from stablecoins like GUSD based on facts and sound analysis. Being unduly swayed by unsubstantiated or even easily refutable allegations and innuendo would seriously undermine trust of DAI holders. @Cryptohippo65 I ask you to take a deep breath, and consider that other community members may be more informed on this matter and are faithfully doing what they believe to be in the best interest of the protocol and DAI holders, without fear or favor with respect to GUSD/Gemini. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.605309042809043
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#56",
                    "likes": "0",
                    "time": "13/03/2023-19:38:22",
                    "content": "    monet-supply:  I regret to say it but I have generally stopped taking your allegations seriously because they lack intellectual rigor.   If referencing all my sources, and showing onchain analysis is lacking intellectuall rigor, then I guess we technically agree on this point.     monet-supply:  I and strategic finance team members have been deeply reviewing stablecoins all weekend, including analysis of balance sheet of underlying banks where they hold deposits and other operational considerations.   This should have been done months ago, not the weekend when the banks are already collapsing!     monet-supply:  I ask you to take a deep breath, and consider that other community members may be more informed on this matter   The risk management team literally confirmed that analysis of the banking risk was never a part of their list of duties. Its actually quite dumbfounding that even though I warned about the risks of Silvergate and Signature Bank months ago, and I recommended too do a banking risk assessment, that you have the gall to come on here and try act like you didn’t fail in your duty. I know that these individuals are likely scared that they’re going not have jobs when the dust settles, so I can understand why you’re trying to discredit me. Again, to the 50% of individuals who voted in agreement with me, please do your utmost to rid MakerDAO of these unprofessional individuals before they do irreparable damage to MakerDAO. Goodbye For Now I have been offering my assistance completely voluntary and unpaid, but I will reluctantly be taking my assistance to other areas of crypto where there is still hope for reform. Should the above individuals be removed from their positions, I would gladly resume assisting MakerDAO with proper due diligence. Until that date, I wish MakerDAO all the best and goodbye! It has been a pleasure to discuss this with the positive individuals in here  PS: Don’t let Gemini off the hook with the most important question:  Why did Gemini remove $150M GUSD from the PSM?  (Don’t accept anything less than a response from Gemini, as you can see the others in here will simply play defense for Gemini, rather than asking the tough questions.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.417987747848859
                }
            ]
        }
    ]
}