{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-transaction-level-accounting-dashboard/19143",
            "title": "Maker Transaction Level Accounting Dashboard ",
            "index": 19143,
            "category": [
                "Core Units",
                "Strategic Finance"
            ],
            "tags": [
                "financial-report",
                "sf-001",
                "strategic-finance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#1",
                    "likes": "25",
                    "time": "12/12/2022-22:18:00",
                    "content": " Maker Transaction Level Accounting Dashboard  Executive Summary Background  Methodology  MKR token rewards Display token    Aggregated reports  Balance Sheet Statement of changes in Protocol Surplus   Next Steps   Executive Summary The Strategic Finance Core Unit has built a transaction-level dual-entry accounting ledger on the back of its experience diving into MakerDAO’s protocol-level financial data. Each of these reports is auditable down to the transaction level and can be cross-checked independently for consistency and correctness. We are aiming to make a significant contribution to advancing the state of on-chain accounting, by providing tools that will take the ecosystem a step closer to a gold standard for DAOs:  Real-time Independently verifiable and auditable Open-sourced categorization choices   Background On-chain protocols iterate and improve over intermediated financial services through full transparency into accounting movements. However, on-chain protocols have no conventional or established framework for accounting choices, leaving significant room for interpretation. MakerDAO has had, since March 2021 at least, published regular monthly reports that aim to interpret on-chain activity in an easily-digestible convention for token holders who are used to balance-sheet driven financial statements. These reports are all produced with on-chain data, with aggregation at the query level in order to facilitate processing time. We take a principles-based approach to our choice of accounting standards. This means these reports will not reconcile to US GAAP or IFRS, nor should they aim to. We are focused on finding adequate representations of the underlying economic reality of an on-chain protocol, with adaptations to the choices we make for representing smart contracts. In our view, the direction of motion for on-chain accounting will be along principles vs rules, providing guidelines to identify the ‘function’ of a smart contract call and show the recommended ‘mappings’ for recognition in an accounting perspective, rather than try to write or fit rules that won’t necessarily suit every possible smart contract. This probably means that future comparability may be limited by the specific choices different financial statement views of on-chain protocols make, but will be broadly recognizable.  Methodology We have extended this work by creating a data set over 2m rows long containing every single transaction in MCD since launch. Each transaction is then categorized into two matching accounts according to the following chart. . ├── Assets/ │   ├── Collateralized Lending/ │   │   ├── Crypto-Loans/ │   │   │   ├── BTC/ │   │   │   │   └── BTC │   │   │   ├── ETH/ │   │   │   │   └── ETH │   │   │   ├── Liquidity Pool/ │   │   │   │   ├── Stable LP │   │   │   │   └── Volatile LP │   │   │   ├── Other/ │   │   │   │   └── Other │   │   │   └── stETH/ │   │   │       └── stETH │   │   ├── Legacy/ │   │   │   └── Stablecoins/ │   │   │       └── Stablecoins │   │   └── Money Market/ │   │       └── Money Market/ │   │           └── D3M │   ├── Liquidity Pool/ │   │   └── PSM/ │   │       └── PSM/ │   │           ├── Non-Yielding Stablecoin │   │           └── Yielding Stablecoin │   ├── Real-World Lending/ │   │   └── RWA/ │   │       ├── Private Credit RWA/ │   │       │   ├── Off-Chain Private Credit/ │   │       │   │   └── (Most our RWA vaults atm) │   │       │   └── On-Chain Private Credit │   │       └── Public Credit RWA/ │   │           ├── On-Chain Public Credit │   │           └── Off-Chain Public Credit / │   │               └── (MIP65) │   └── Proprietary Treasury/ │       └── (ENS, stkAAVE, COMP and whatever Messari sends us) ├── Equity/ │   ├── Protocol Surplus (MakerDAO Surplus Buffer)/ │   │   └── Gross Interest Revenues │   │   └── Liquidation Revenues │   │   └── Trading Revenues │   │   └── MKR Mints Burns │   │   └── Sin │   │   └── Direct Expenses │   │   └── Indirect Expenses │   └── Proprietary Treasury/ │   │   └── (ENS, stkAAVE, COMP and whatever Messari sends us) │   └── Reserved MKR Surplus/ │       └── MKR Token Expenses │       │   └── Direct MKR Token Expenses │       │   └── Vested MKR Token Expenses │       └── MKR Contra Equity └── Liabilities/     ├── Circulating Dai/     │   ├── Interest Bearing/     │   │   └── Dai/     │   │       └── (DSR)     │   └── Non-Interest Bearing/     │       └── Dai/     │           └── (Regular Dai)     └── Locked Dai/         └── (one day meb)  Part of this forum post is to ask for the community’s feedback on our choice of accounts as we can iterate on these progressively to improve over time. For on-chain accounting, on-chain transactions are the relevant source of truth and pro-forma statements such as this one are a choice of convention. An individual row in this data set would therefore look as follows:     label hierarchy timestamp hash value base_token descriptor ilk dai_value eth_value     xyz soon 0x… 10000 DAI DSR Flows  10000 1    This data set is created in Dune Analytics, using an open source query that extends our previous queries and lists individual transactions before classifying them. This dataset now lives in a dune table called maker_ethereum.accounting. The logic used to create this dataset is open source and found here. We integrated this data set into a Snowflake instance. All aggregation is done after the fact in a PowerBI report. The benefit of this is that the dashboard allows one to dig into specific transactions (at the hash level) that make up any figure on the MakerDAO balance sheet. Planned future improvements:  Add teleport revenue Consider alternative approaches for RWA revenue Automate the backend data pipeline to enable potentially updating more frequently Alter the dune table slightly to add a unique key so that data refreshes can be incremental and thus more frequent  We have included MKR token rewards and display token toggles (between DAI and ETH) in the latest implementation of the dashboard! Details can be found below  MKR Token rewards On token rewards specifically: On the balance sheet, we balance them with contra equity so that they do not affect the protocol surplus, and on the statement of changes, we put MKR expenses into their own section so that they may be considered or not at the discretion of the user. MKR expenses are accounted for in 3 accounts (Vested MKR Expenses, Direct MKR Expenses, and MKR Contra Equity), and the pathway depends on whether a vesting contract was used or not. Here are examples of how events show up in these accounts: MKR token reward DSS Vest stream is opened i.e. a DSS Vest stream is opened     Account Credit Debit     Direct MKR Expenses  1   Vested MKR Expenses 1     MKR token reward DSS Vest stream is claimed i.e. a DSS Vest stream is claimed     Account Credit Debit     Vested MKR Expenses  1   MKR Contra Equity 1     MKR token reward sent directly to recipient i.e. a MKR token is sent to a contributor without a vesting contract     Account Credit Debit     Direct MKR Expenses  1   MKR Contra Equity 1     With this setup, MKR Contra Equity is a stub account that effectively tracks (by counterbalancing) all issued tokens that have left the pause proxy, and Vested MKR Expenses is an account that can track MKR currently in Vest contracts. Also very noteworthy, when a DSS Vest stream is opened or yanked and tokens move between the Direct MKR Expenses and Vested MKR expenses accounts, we do not assign a monetary value to these transactions. We only assign a monetary value once they leave the Pause Proxy, via a vest contract or not.  Display token We have enabled functionality of 2 display tokens, DAI and ETH. To do this, we assign a DAI value and an ETH value to every transaction to yield the following structure:     labels timestamp hash value base_token descriptor ilk dai_value eth_value    This allows us to output the report in DAI and in ETH, for both balance sheet views and statement of changes views. A button can be found at the bottom of the report to toggle between these presentation tokens. If we simply converted each base token value to the presentation token value at the time of the transaction, the cumulative result in the end would be a balance sheet that is worth an amount different from what our balance sheet is worth. For example, if we got an airdrop of $ENS worth $2m at the time but $500k today, simply converting to DAI value at the time of the transaction would lead us to believe we have 2M of ENS today. We would need a -1.5m cumulative line item to balance this. This is precisely what we’ve done. For every base token, every primary label (assets, liabilities, equity), and every day, we have added a line item that represents the value of this type of currency translation, specifically how this value has changed from the prior day. To do this, we had to work backwards:  For every given day, we calculated how much the cumulative amount (one cumulative amount per primary label - assets, liabilities, equity) of base token would be worth at the end of the day. We subtracted the cumulative of instantaneously converted values from this value to produce a cumulative daily version of the desired line item. We took the delta from the previous day to “uncumulative” this figure, so that it can be aggregated at any length of time that is desired (at minimum daily though).  The output of these conversions can be directly seen in views of the report, labeled as “Currency Translation to Presentation Token”. The result in the balance sheet view, which is cumulative, is fairly intuitive. It is worthwhile to mention some nuance in the statement of changes view: while every other line item in that view represents activity in the time period being viewed, this line item represents the currency translations within the period of base token activity within the time period and of the base balance accumulated prior. For instance, if we have earned some AAVE prior to March that is worth 1000 DAI at the beginning of March and 1200 DAI at the end, this 200 DAI would be represented in this line item along with any currency translations of AAVE accumulated within March. Another important callout is that we do not do these cumulative currency translation corrections for MKR expenses - these are treated independently (also counter-balanced to 0) and solely converted to the display token value instantaneously, as it does not make much sense to show how the value of spent MKR would have changed if we hadn’t spent the same MKR amount until today.  Aggregated reports The main reports are denominated in DAI or ETH only and include the Governance-controlled assets (stAAVE, ENS and COMP) on the DS Pause Proxy. MKR in the DS Pause Proxy is always excluded, as in our view it represents authorized but unissued tokens for the protocol. Counting them would be falling into the same trap that any system which counts endogenous collateral as part of its assets falls into. MKR expenses are accounted for but either counter-balanced (in the balance sheet view) or placed into an independent category (in the statement of changes view), so that the end user can include or exclude at their discretion. We take a simplified cash-based view for on-chain protocol accounting. In this instance, there is only a balance sheet at given periods that count stock (Balance Sheet) and a reconciliation bridge between two periods that counts flow (Statement of Changes in Protocol Surplus). Therefore there is no ‘third’ statement of Token-Flows, as they are all effectively token flows. At any point, to see all of the transaction-level data that makes up a cell, right click the sell and “drill through” to the Full Table. To toggle between DAI and ETH presentation token, click the button on the bottom left.  Balance Sheet Following is a cumulative view of MakerDAO assets, liabilities, and equity, at various levels of aggregation. Feel free to click through these levels of aggregation or to dive into the months of a particular year by right clicking the year and selecting “drill down”. To toggle between DAI and ETH presentation token, click the button on the bottom left. It is noteworthy to mention that, while traditionally in accounting, liabilities and equity are negative, we have made the choice to not follow this convention to make the numbers more intuitive (accounting minds can mentally multiply every figure in these categories by -1 to produce the convention they are accustomed to). This would make calculating the check easier (Asset = Liabilities + Equity), but would show negative revenues which is unintuitive.   Statement of Changes in Protocol Surplus Following is a statement of changes to protocol surplus made from the same source data. This is a reconciliation of changes from period to period for the balance sheet above. These changes can be summarized as changes from net protocol income along with changes in token holdings. To toggle between DAI and ETH presentation token, click the button on the bottom left.  This dashboard can also be found, similarly embedded, at this link.  Next Steps  We invite the community to provide their views on the above work We look forward to a lively discussion over the choices we made We will be as reactive as we can to adapt any prevailing consensus different to our own choices, with the aim to make it maximally useful to the community We have open sourced the query we used to produce this data set and welcome constructive feedback  If there are third-parties who will be leveraging this data or a fork thereof, especially for commercial distribution (gm Messari), we request you to:  Cite the source of data appropriately Make a (voluntary) community contribution to the protocol through an ETH or ERC-20 transfer to the governance-controlled Pause Proxy address: 0xBE8E3e3618f7474F8cB1d074A26afFef007E98FB    Overview of Market Sentiment  937×640 435 KB  ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-transaction-level-accounting-dashboard/19143#background-3",
                        "https://forum.makerdao.com/t/maker-transaction-level-accounting-dashboard/19143#methodology-4",
                        "https://forum.makerdao.com/t/maker-transaction-level-accounting-dashboard/19143#mkr-token-rewards-5",
                        "https://forum.makerdao.com/t/maker-transaction-level-accounting-dashboard/19143#display-token-6",
                        "https://forum.makerdao.com/t/maker-transaction-level-accounting-dashboard/19143#aggregated-reports-7",
                        "https://forum.makerdao.com/t/maker-transaction-level-accounting-dashboard/19143#balance-sheet-8",
                        "https://forum.makerdao.com/t/maker-transaction-level-accounting-dashboard/19143#statement-of-changes-in-protocol-surplus-9",
                        "https://forum.makerdao.com/t/maker-transaction-level-accounting-dashboard/19143#next-steps-10",
                        "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4200414",
                        "https://forum.makerdao.com/t/financial-report-2021-03/7286",
                        "https://github.com/duneanalytics/spellbook/blob/main/models/maker/ethereum/maker_ethereum_accounting.sql",
                        "https://steakhouse.financial/makerdao-ledger",
                        "https://forum.makerdao.com/t/makerdao-2022-financial-results-and-retrospective/19636",
                        "https://forum.makerdao.com/t/mip13c3-sp13-declaration-of-intent-to-develop-a-comprehensive-on-chain-monitoring-solution-for-rwa-vaults/19095",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/36",
                        "https://forum.makerdao.com/t/governance-and-risk-219-thursday-december-15-at-17-00-utc/19174"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.401875901875902
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bob",
                    "index": "#2",
                    "likes": "1",
                    "time": "13/01/2023-13:46:36",
                    "content": "Thank you for sharing this. We are keen to contribute to this emergent subject and the wider FinRep, RiskRep and RegTech subjects. Right now we’ve just a couple of questions.  You say that comparability between entities may be limited due to the adoption of a principles based-approach rather than a ‘rules-based’ approach.  Is this principles-based approach a stop-gap before something along the lines envisaged in the “DAO Accounting” paper cited can be realised? How concerned are you that a principles based approach might create somewhat of a handbrake on on-chain reporting standardization and on its benefits to the development of on-chain business?  Does the ‘reserved protocol surplus’ have any purpose other than to record token rewards?  Thanks Bob (Debt DAO) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9980158730158735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#3",
                    "likes": "3",
                    "time": "14/01/2023-16:52:30",
                    "content": "Appreciate these questions, thank you. On 1): I don’t necessarily agree that rules-based is strictly better. IFRS for eg follows a more principles-based approach vs US GAAP which allows for a bit more flexibility–sure, at the expense of comparability, but you could argue a stricter rules-based approach can also be too coercive and force reporting choices that don’t necessarily reflect the economic reality. Our view is that for on-chain protocols, a more flexible approach is the right choice. Firstly, crypto protocols are meaningfully different amongst themselves as to make line by line comparability difficult to begin with. Secondly, this won’t change by sticking to a strict set of rules. Set by whom? Why? How would they change? These are pointless questions imo–the important truth to get to is more like: what is the underlying economic reality? What is the closest equivalent from conventional accounting language that could model that reality? Thirdly, an analyst can anyway always make the adjustments they feel necessary to spread comps. In this regard, crypto accounting is a strict improvement on something like EDGAR reporting, provided all the transactions are public and available in near real-time. I see the distinction as something like one of open-source principles and rules vs bureaucracy. Of course I’d love to hear the counter view, I could be wrong. On 2), basically yes, this was a sketch of an idea we had to record token rewards but we are iterating on an alternative that functions quite similarly. Hopefully we can update this thread with the changes to ask for opinions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.688571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#4",
                    "likes": "2",
                    "time": "14/01/2023-19:01:18",
                    "content": "Good progress Will Maker start getting regular pricing for its illiquid positions, particularly RWA?  Probably monthly This is a key financial discipline, particularly for leveraged financial balance sheets.  Its financial risk management 101! There are good pricing agents who could to a decent job on this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/drtechpunk",
                    "index": "#5",
                    "likes": "1",
                    "time": "29/01/2023-01:33:47",
                    "content": "Everything looks quite impressive.  I was curious whether you think it would add value to include a brief narrative explaining for each account (or each material account) what is the nature of the activity and what policies have we applied to calculate balances. You are touching on this in the post, but I think it is always useful to support reports with systematically structured comments to enable a better understanding of what is being presented. Would it make sense to discuss specifically what can be the alternative treatment for each type of transaction if relevant? Another suggestion - I think it may be helpful to show the split of assets and flows by units (e.g. Core Unit, Audit Wallets, Pause Proxy, etc.). It would bring much additional context that may be useful for users.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.722222222222223
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#6",
                    "likes": "1",
                    "time": "30/01/2023-19:26:28",
                    "content": "1). This could add value! Thanks for the suggestion 2). Not sure what you mean by alternative treatment 3). I don’t see the value in doing so tbh. Most transactions are loan modifications (borrow/repay) and interest accruals & would not need any such classification ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#7",
                    "likes": "6",
                    "time": "23/02/2023-17:41:55",
                    "content": "We are excited to announce an update to this accounting dashboard and to MakerGAAP! This is the first example ever of a pure crypto protocol’s dual entry accounting journal and an exciting demonstration of the power of transparent blockchain data as an improvement on regular quarterly financial reporting. This continues to be a substantial accounting undertaking by members of our CU and Steakhouse Financial, so logically this approach to crypto-accounting should go by Steakhouse Accounting and Financial Undertaking (SAFU). I’m sure this is a brand new acronym not in use in any other context, so it’s probably fine. The main post has been updated, but for your convenience, the changes are laid out here:  Transaction descriptor and ilk fields were added to the dataset. Ilk is now in all aggregated report tables as the final step of the label hierarchy. Note that these changes were done in between the intial release and this update but not yet communicated. The underlying dataset was updated to include the compound D3M and yield accruals for the yielding GUSD PSM. Note that these changes were done in between the intial release and this update but not yet communicated. MKR expenses were added. Consult the main post for details Reports were updated to have unified presentation tokens (DAI or ETH) that can be toggled between & currency conversion line items were added to fill any gaps. Details can be found in the main post! Old views that kept everything in their base currencies and filtered for DAI vs nonDAI were deleted. Our new presentation token functionality allows us consolidate DAI and nonDAI base tokens into unified views.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.378356266749123
                },
                {
                    "author_link": "https://forum.makerdao.com/u/drtechpunk",
                    "index": "#8",
                    "likes": "0",
                    "time": "24/02/2023-01:15:57",
                    "content": "Thank you so much for adding this information! It looks amazing. I remember mentioning presenting  Aave financials in the native tokens discussing the same question with Llama in October 2022. One question that we didn’t discuss though and I don’t really see anything that specifically addresses this question here - what is the approach to unavoidable under this approach translation variances and how exactly are exchange rates are being calculated in different scenarios? Minor differences in approaches to this question often result in enormous differences in numbers, so it would be great to understand this approach. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.138888888888889
                }
            ]
        }
    ]
}