{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/collateral-onboarding-call-26-reinno-wednesday-february-3-18-00-utc/6242",
            "title": "Collateral Onboarding Call #26: Reinno - Wednesday, February 3 18:00 UTC ",
            "index": 6242,
            "category": [
                "Collateral Onboarding",
                "Collateral Meetings"
            ],
            "tags": [
                "public-call",
                "pubcall-:-collateral"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "2",
                    "time": "27/01/2021-23:42:35",
                    "content": "Collateral Onboarding Call #26: REINNO - Wednesday, February 3 18:00 UTC 1280×720 52.6 KB Time in your local-timezone format: 2021-02-03T18:00:00Z Dial In Details Zoom call Passcode: RWA-WG Intro An open discussion where we discuss projects and potential assets for MCD, open for anyone to join. If you’d like to present, check out this thread. Agenda Intro by @JuanJuan  REINNO - https://reinno.io/  MIP6: [REINNO] MIP6 Collateral Onboarding Application - NEW “REINNO is a financial technology company offering a new solution for lending and real estate tokenization with a focus on providing liquidity. Our services cover the technology, corporate structure, legal compliance and marketability of tokenized real estate assets. We are positioned to be the first company to accept tokenized real estate as loan collateral. Lending using tokenized real estate as collateral provides much higher flexibility, simplifies the application process and reduces costs for end customers.”  Attn: @amyjung, @juan, @SebVentures, @viktor_REINNO, @Hristo_Piyankov, @planet_x, @longforwisdom, @flipflopflapdelegate, @mrabino1, @_LS, @spin, @williamr ",
                    "links": [
                        "https://forum.makerdao.com/t/collateral-calls-calling-all-projects/3715/",
                        "https://forum.makerdao.com/u/juanjuan",
                        "https://reinno.io/",
                        "https://forum.makerdao.com/t/reinno-mip6-collateral-onboarding-application-new/6218",
                        "https://forum.makerdao.com/t/reinno-mip6-collateral-onboarding-application-new/6218/4",
                        "https://forum.makerdao.com/t/maker-relay-ep-30/6303",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/13",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-126-thursday-january-28-17-00-utc/6149/5",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-126-thursday-january-28-17-00-utc/6149/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-30-en-espanol/6360",
                        "https://forum.makerdao.com/t/mip13c3-sp10-a-real-estate-stablecoin-as-the-next-big-move-for-defi-joint-venture-with-reinno/6257"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.319602272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#2",
                    "likes": "1",
                    "time": "27/01/2021-23:42:58",
                    "content": "Collateral Call Summary - Episode #26  February 3rd, 2021 Agenda   00:00: Intro with Juan Guillén  01:05: REINNO with Natalia Shirshova, Viktor Viktorov, Kristiyan Lozanov and Hristo Piyankov  12:50: Q&A and Discussion about REINNO  Video https://youtu.be/8Ir31vGllm8 Introduction Juan Guillén Agenda and Preamble 00:00  Welcome to another MakerDAO Collateral Call. My name is Juan and I’m joined by a bunch of Maker enthusiasts to speak about real-world assets — or real-world finance, as our working group has renamed itself not long ago. Natalia from REINNO, thank you for being here. Discussions about collateral happen in the Forum.   REINNO  [REINNO] MIP6 Collateral Onboarding Application - NEW  Natalia Shirsova, Viktor Viktorov, Kristiyan Lozanov and Hristo Piyankov Presentation 01:05 Collateral onboarding call1920×1080 103 KB Current problems1920×1080 115 KB Timeline1920×1080 95.2 KB Flowchart1920×1080 108 KB Liquidation1920×1080 108 KB Price discovery1920×1080 127 KB Discussion  12:50 — Juan Guillén: Why is there another stablecoin? Why is that needed?   16:03 — LongForWisdom: What was the thinking behind making REINNO a stablecoin rather than just an unstable pool of those assets?   17:15 — Juan Guillén: In which situations do you expect liquidations?   17:48 — Frank Cruz: About the real estate being tokenized, where does that get recorded? In some state registry or is it in its own entity and then you’re tokenizing the equity of that entity? How is the title traversed?   19:01 — Sébastien Derivaux: Let’s say I have some CRE tokens and I want to borrow something. You give me some REINNO tokens, which is a stablecoin. I assume at some point there is an interest rate I have to pay. So the debt accrues in my wallet in the REINNO protocol. When I deposit REINNO in Maker to get Dai, do you expect there is also some kind of interest rate?   20:30 — LongForWisdom: You mentioned the first step of minting the REINNO stablecoin and you said you aimed to have liquidity pools for REINNO to keep it stable. What do you actually need Maker for in that situation?   23:37 — Sébastien Derivaux: I see an issue here because you want a vault to bootstrap the liquidity, which makes a lot of sense, but at the same time we usually need liquidity to be able to make the liquidation on our side. There is some kind of circularity.   25:17 — Payton Rose: I’m still not comprehending the CRE tokens themselves. Are those just a claim on the cashflow of a particular commercial project? What do those represent essentially for someone who initially holds them?   33:09 — Frank Cruz: Who actually owns the real estate? Not from the perspective of the county where the dirt is located. It’s owned by an entity or a person. Who owns the entity? If it’s an LLC, who owns the LLC?   41:12 Frank Cruz: Just out of curiosity, have you evaluated this with council about what would happen during the course of a bankruptcy proceeding?   43:05 LongForWisdom: Have you given any kind of thought about how to mantaing REINNO’s peg to US$1?   44:55 — LongForWisdom: What is preventing it from going — I mean, even a bit lower like 0.99 or 0.98   47:24 — Juan Guillén: Hristo, potentially the opposite is true: The smaller the market cap is, the easier it is for one single player to move the price by a lot. I can imagine that the euro or the dollar requiere much larger capital to sway than Dai or any small stablecoin   49:58 — LongForWisdom: You mentioned that if the REINNO token increases in price, that’s not much of a problem. The way other assets work on Maker, if the price of the collateral token goes up, that means there is more room for users to mint Dai from that token, right? So, if the price of the REINNO stablecoin goes up to, say, 1.1, that means that everyone can mint maybe 8% more Dai — and that’s fine until it goes down again back to 1, at which point they are going to get liquidated. From the Maker perspective, we want it to be as stable as possible…   53:54 — Frank Cruz: Now I understand more: Your assets are owned by an LLC; you’re tokenizing the membership interests of the LLC. Is that like a Reg D offering that you’re doing?  Closing Comment Juan Guillén Outro 56:13  Thank you, Natalia, Viktor and Hristo for coming and presenting. It was really nice having you. And for those who are regulars in this type of calls, next week we’ll have KYM #05, so we’ll skip the week on the collateral types and we’ll have Lev explaining MIP43.  Credits   @blimpa produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/8Ir31vGllm8?t=65",
                        "https://youtu.be/8Ir31vGllm8?t=770",
                        "https://youtu.be/8Ir31vGllm8",
                        "https://youtu.be/8Ir31vGllm8&t=0",
                        "https://forum.makerdao.com/c/risk/collateral-meetings/23",
                        "https://forum.makerdao.com/t/reinno-mip6-collateral-onboarding-application-new/6218",
                        "https://youtu.be/8Ir31vGllm8?t=65",
                        "https://youtu.be/8Ir31vGllm8?t=770",
                        "https://youtu.be/8Ir31vGllm8?t=963",
                        "https://youtu.be/8Ir31vGllm8?t=1035",
                        "https://youtu.be/8Ir31vGllm8?t=1068",
                        "https://youtu.be/8Ir31vGllm8?t=1141",
                        "https://youtu.be/8Ir31vGllm8?t=1230",
                        "https://youtu.be/8Ir31vGllm8?t=1417",
                        "https://youtu.be/8Ir31vGllm8?t=1516",
                        "https://youtu.be/8Ir31vGllm8?t=1989",
                        "https://youtu.be/8Ir31vGllm8?t=2472",
                        "https://youtu.be/8Ir31vGllm8?t=2585",
                        "https://youtu.be/8Ir31vGllm8?t=2695",
                        "https://youtu.be/8Ir31vGllm8?t=2844",
                        "https://youtu.be/8Ir31vGllm8?t=2998",
                        "https://youtu.be/8Ir31vGllm8?t=3213",
                        "https://youtu.be/8Ir31vGllm8?t=3373",
                        "https://forum.makerdao.com/t/know-your-mip-05-term-lending-module-wednesday-february-10th-18-00-utc/6297",
                        "https://forum.makerdao.com/t/collateral-onboarding-calls-listing-2021-edition/6566",
                        "https://forum.makerdao.com/t/collateral-status-index/2231"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.805467515288943
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "1",
                    "time": "03/02/2021-18:03:29",
                    "content": "Starting now! Come join us! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "06/05/2021-00:03:35",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}