{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-and-risk-199-thursday-july-14-at-17-00-utc/16575",
            "title": "Governance and Risk #199 - Thursday, July 14 at 17:00 UTC ",
            "index": 16575,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "3",
                    "time": "13/07/2022-17:41:11",
                    "content": " 199 f1920×442 27.8 KB   Disclaimer This communication is provided for information purposes only. The views and opinions expressed in this meeting are those of people involved and do not reflect the official policy or position of MakerDAO or any of its contributors, Core Units, or affiliates. This communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only and should not be relied upon as legal, business, investment, financial, or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only and do not constitute any recommendation for any action or an offer to provide investment, financial, or other advisory services.  Call Recording       Call Information The zoom waiting room will be on, and a password is set to: 748478; please ping us in the Maker Discord’s #governance channel if you aren’t let in from the waiting room. 2021-07-14T17:00:00Z  Video/Voice  Dial-in  Calls Calendar  Slides - updated before the call  Introduction   @GovAlpha-Core-Unit - Hosting, Introduction, Agenda.  @gov-comms-core-unit - Slides   Governance Round-Up   @GovAlpha-Core-Unit - Votes Recap  @MIP-Editors - MIPs Recap  @Artem_Gordon - Forum Recap   Initiative Updates  June Financials - @strat-fin-core-unit Delegate Migration - @dux-core-unit Oracles did one on Tuesday - See Link   Selected Discussions   Active Core Unit Offboarding Proposals Strategic Happiness - Budget, Facilitator Immunifi Security - Budget, Facilitator Events - Budget, Facilitator General Q&A Ask us stuff  Anonymous question box   @Recognized-Delegates @Core-Facilitators ",
                    "links": [
                        "https://discord.gg/5uAJtzkK",
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://docs.google.com/presentation/d/13PxofaGHyYErRLbrBATM5vqAAe5svLqToAqrBtcDZf8/edit#slide=id.g127c42ff1aa_0_0",
                        "https://youtu.be/DEAk4VPZfeI",
                        "https://forum.makerdao.com/t/mip40c3-sp76-modify-strategic-happiness-core-unit-budget-sh-001/16438",
                        "https://forum.makerdao.com/t/mip41c5-sp9-facilitator-offboarding-sh-001/16439",
                        "https://forum.makerdao.com/t/mip40c3-sp77-modify-immunefi-security-budget-is-001/16436",
                        "https://forum.makerdao.com/t/mip41c5-sp10-facilitator-offboarding-is-001/16437",
                        "https://forum.makerdao.com/t/mip40c3-sp73-modify-core-unit-budget-events-001/15991",
                        "https://forum.makerdao.com/t/mip41c5-sp8-facilitator-offboarding-events-001/15992",
                        "https://app.suggestionox.com/r/GovCallQs"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.535256410256411
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#2",
                    "likes": "1",
                    "time": "14/07/2022-02:40:09",
                    "content": " Episode #199: July 14th, 2022 | Editorial Summary  Agenda   00:00: Introduction  02:55: Votes and Polls  04:00: MIPs Update  07:52: Weekly Forum Recap  14:40: Initiatives Update: Delegate Contract Migration  18:25: Initiatives Update: June Financials  52:42: Discussion: Active Core Unit Offboarding Proposals  1:25:17: Conclusion   Video Link  General Updates  Votes  Payton Rose 2:55  1320×742 58.1 KB   Polls: – 02:58 Executive Votes: – 03:20   MIPs  Gala 4:00 Weekly MIPs Update #96   960×540 13.3 KB     July’s Formal Submissions – 04:24   Proposals in RFC – 4:39   Special Purpose Fund – 05:08   Core Unit Budgets – 05:28   Core Unit Offboarding – 05:55   Facilitator Onboarding– 06:15   Amendments – 06:34      The last day to include modifications for proposals aiming to enter the August Governance Cycle will be on July, Wednesday 27th, by the end of the day.   Weekly Forum Recap  Artem Gordon 7:52 Post: Weekly Forum Recap: July 7th - 13th, 2022   News & Announcements:  Delegate Migration DAO Resilience Improvement Initiative – Status Update  Delegate Office Hours – Includes poll for discussion topic  MIP41c5-SP9: Facilitator Offboarding (SH-001) MIP41c5-SP10: Facilitator Offboarding (IS-001)      Discussions:  [Informal Poll] Voluntary Budget Adjustment in exchange for 1 Year Guaranteed Budget Should governance polls include a Gantt chart? [Informal Poll] Restructuring Incentives for Recognized Delegate Compensation [Informal Poll] Transcriptions and Editorials for Publicly Recorded Calls    Signal Requests:  Reset delegation metrics for Hasu     Initiatives Update  Delegate Contract Migration   DUX CU 14:59 Forum Post – Announcement: Delegate Migration  1420×797 86.3 KB    Delegate contracts expire after one year. Expiration dates can be found in the Portal. Recognized Delegates will be able to migrate their contracts. Delegators should migrate their MKR to the new Delegate contracts as well.    Initiatives Update  June Financials   Adrian 16:52  1116×742 183 KB     Disclaimer – 18:33   Agenda – 18:49   Executive Summary – 19:00   Overview of Monthly Results – 20:28   Reconciliation of Monthly and Quarterly Results – 20:56   Monthly Income Statement – 21:41   Interest Income Decomposition – 22:04   Interest Income Decomposition -  23:08   Overview of Expense Rationalization Approaches – 23:54   Oracle Expenses by Collateral Type – 24:49   Cumulative Contributed Profit by Collateral Type – 25:18   Illustrative Financial Framework for Collateral Profitability – 26:09   Overview of DAI Utilization – 27:10   Overview of ETH Market Share – 27:52   Overview of WBTC Market Share – 28:19   Key Strategic decisions – 28:31     Q&A  29:43   Adrian: I just wanted to underline the introduction of the Backed Finance MIP6, which will go to Greenlight next week and is one part of what should be a multi-part approach to monetizing the PSM.  30:13   Q - Frank: Will Strategic Finance be able to do forecasting in the near future?  32:14   Q - Frank: If you had the information needed to do such a forecast, do you believe you could give an outlook for Q3 or Q4 and inform us about the negative–or positive–sides of it?  33:59   Q - MakerMan: Talking about forecasting: markets and crypto are cyclical. I would like to see estimates not only for Super Bear and Bear markets; I want a midline track followed by the high mark–which you have already addressed–. Nonetheless, I am not sure we have an accurate representation of the midline. Given the cyclical character of these variables, how do you think you will solve this issue? What numbers would you use to feed into such a model?  37:14   Q - MakerMan: Maker’s expenses are around 30M, 35M a year; our revenues are floating down to 10M; we have 15M still unreturned by CUs, and we are working the math for these numbers. Assuming nothing will change in the foreseeable future, as long as we can keep this revenue, our expenditures do not go over 40M, and we have 15M in the bank, we should be in the 60M range on the stability Surplus Buffer in a year.  39:30   Q - MakerMan: Now that we are coming back down to earth, people under-appreciate how well Maker has done in the past two years. I want to let CUs, and everyone, know that you did a fabulous job. Congratulations are for everybody working here, and I want to quote Vitalik: “Our job is not to out-compete. Our job is to outlast”.   44:17   Q - Person 1: Mark just mentioned trying to smooth revenue opportunities over the next six months, waiting for the crypto native land to pick back up again. I think it is a strong claim for RWA. Of course, there is a whole litany of discussions about which assets and how we should move on.  46:06   Q - Person 1: I am curious about everyone’s perspective on strategic opportunity, which seemed to be in line with Strategic Finance since your CU does not provide direction, but an idea of what would be best. Thus, allowing RWA to execute based on those parameters.  48:32   Q - Frank: There was an interesting comment on the chat about crypto collaterals, and the CES–Collateral Engineering–CU mentioned that, for MakerDAO, onboarding should be at least 30M minimum debt ceiling for the Protocol to achieve optimal stability fees. As Mark said: there is a competitive market in RWA.  51:01   Q - Frank: I know that RWA is not the most innovative topic to discuss, but regarding Mark’s comment on MakerDAO’s stance in the RWA space, there are partnerships and third-party applications that could help. Centrifuge or Maple, for example. We should explore that. As Nick stated: we need to get at least a few collaterals that will give us a million on stability fees.   Discussion  Active CU Offboarding Proposals  Thomas Flitter 52:42 Events Core Unit 53:38  2584×1148 155 KB  Immunefi Security Core Unit 54:55  2052×1102 140 KB  Strategic Happiness Core Unit 55:49  2408×1102 150 KB  Core Unit Offboarding issues in question: 57:10  1740×988 161 KB  57:51  Thomas opens the floor for open discussion and Q&A on active Core Unit offboarding proposals.  1:01:10  Andrew Burban talks about Strategic Happiness Offboarding.  1:02:24   Andrew Burban: I proposed it as if everyone is so dissatisfied with everything after some time, then sure, I am willing to step back if I fumble this entire attempt to whatever it is. It is only about two months into it. We have all these discussions of cutting back expenses but no onboarding proposal. Maybe nobody wants any more spikes. I have money just sitting, having cleaned all the vessels and stuff. I did take a little bit of some of the salary compensation and just some other expenses so far, to keep myself afloat. I have not touched the majority of this budget; it is all still sitting in the multisig.  1:05:31   Q: David Utrobin: Why should your CU not be a part of the Growth Core Unit?  Andrew Burban: It could be in principle, I think, while there is uncertainty in the entire space, I want to give an honest attempt at trying to do it on my own, if I decided, or everyone, after we go half a year, says okay, this was a waste entirely, then sure, I should be part of the growth team. Of course, it could be part of the growth team, but not just off the bat album. Can I do the same job as part of the growth team possibly? Something to sit down with growth and discuss. There has not been much bandwidth on any means of time to sit down and see how to restructure things.    1:08:14   Joshua: talks on Immunefi Security Core Unit offboarding.  1:12:39   Thomas: Was Immunefi Security work handled by protocol engineering in the past?  1:16:11   Andrew Burban: Is there an actual desire for Maker to have swag? If I was to create a drop shipping system - I want to post it. I was going to make a post at some point if there is a desire to have efficient merchandise for Maker. Then it could be done. Until some details with financing are worked out, I do not want to post how it would be structured. If I implement this thing, would be a massive reduction in overhead because it would not be me carrying things on planes and all that stuff. It would just be shipped out around the world like they are a drop shipper, which is way better than taking things on an airplane. When I started this, I had no experience in shipping or anything like that. I bought my swag and sent it out, and we are scaling up. I have been looking at a way to make it much more efficient. If I set up a store, it would just be a substantial reduction in costs overall or around. Do people even want this at all?  1:19:08   Jon Perry: I am the facilitator of the event team. Essentially, our focus is on helping in-person events to do with Maker branding and promotion. Essentially, it is a component of experiential marketing, which, on the full side of experiential marketing, you deal with tradeshow boost to light in-person campaigns. We have decided to focus on the event sides and mainly to host; some people like to call parties to do for the industry at conferences. We were just onboarded on May 1. We have been onboarded and vigorously reducing our budget. Because yes, we do realize there is a bit of a bear in mind I keep going on. We should be conserving funds. A couple of ways we have done this is by selling the sponsorship slot to these events. For example, Divinity in Paris, we are splitting that cost with one inch perpetual, Trufi and Oasis makers covering half the cost, and while the others are coming the other half, kind of the strategy there so that Maker still has the most leverage for getting our brand new out there for advertising and ticketing. We can get protocols; we want their VCs and industry partners at these events. There is a bit more of a complete explanation about the financials buried now within our events, offboarding about how much we are reducing our budget this year, and steps we can further take to reduce it—also dealing with some offboarding costs. Right now, we are running around 35% under our original budget.  1:21:14   Katie: Does the Growth Core Unit has a budget for an Events Core Unit?   Conclusion  Payton Rose 1:25:17 Suggestion Box  Credits   @Sol_Invictus produced this summary.  @andrea Andrea produced this summary. Artem Gordon produced this summary. Everyone who spoke and presented on the call.  ",
                    "links": [
                        "https://www.youtube.com/watch?v=yekcB68XALc&t=175s",
                        "https://www.youtube.com/watch?v=yekcB68XALc&t=240s",
                        "https://www.youtube.com/watch?v=yekcB68XALc&t=472s",
                        "https://www.youtube.com/watch?v=yekcB68XALc&t=880s",
                        "https://www.youtube.com/watch?v=yekcB68XALc&t=1105s",
                        "https://youtu.be/yekcB68XALc?t=3162",
                        "https://youtu.be/yekcB68XALc?t=5117",
                        "https://www.youtube.com/watch?v=yekcB68XALc",
                        "https://www.youtube.com/watch?v=yekcB68XALc&t=175s",
                        "https://youtu.be/yekcB68XALc?t=178",
                        "https://youtu.be/yekcB68XALc?t=200",
                        "https://www.youtube.com/watch?v=yekcB68XALc&t=240s",
                        "https://forum.makerdao.com/t/weekly-mips-update-96/16688",
                        "https://youtu.be/yekcB68XALc?t=264",
                        "https://youtu.be/yekcB68XALc?t=279",
                        "https://youtu.be/yekcB68XALc?t=308",
                        "https://youtu.be/yekcB68XALc?t=328",
                        "https://youtu.be/yekcB68XALc?t=355",
                        "https://youtu.be/yekcB68XALc?t=375",
                        "https://youtu.be/yekcB68XALc?t=394",
                        "https://www.youtube.com/watch?v=yekcB68XALc&t=472s",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/5",
                        "https://forum.makerdao.com/t/announcement-delegate-migration/16603",
                        "https://forum.makerdao.com/t/dao-resilience-improvement-initiative-status-update/16413",
                        "https://forum.makerdao.com/t/delegate-office-hours-includes-poll-for-discussion-topic/16571",
                        "https://forum.makerdao.com/t/mip41c5-sp9-facilitator-offboarding-sh-001/16439",
                        "https://forum.makerdao.com/t/mip41c5-sp10-facilitator-offboarding-is-001/16437",
                        "https://forum.makerdao.com/t/informal-poll-voluntary-budget-adjustment-in-exchange-for-1-year-guaranteed-budget/16445",
                        "https://forum.makerdao.com/t/should-governance-polls-include-a-gantt-chart/16510",
                        "https://forum.makerdao.com/t/informal-poll-restructuring-incentives-for-recognized-delegate-compensation/16469",
                        "https://forum.makerdao.com/t/informal-poll-transcriptions-and-editorials-for-publicly-recorded-calls/16427",
                        "https://forum.makerdao.com/t/signal-request-reset-delegation-metrics-for-hasu/16533",
                        "https://www.youtube.com/watch?v=yekcB68XALc&t=880s",
                        "https://youtu.be/yekcB68XALc?t=899",
                        "https://forum.makerdao.com/t/announcement-delegate-migration/16603",
                        "https://www.youtube.com/watch?v=yekcB68XALc&t=1105s",
                        "https://youtu.be/yekcB68XALc?t=1012",
                        "https://youtu.be/yekcB68XALc?t=1113",
                        "https://youtu.be/yekcB68XALc?t=1129",
                        "https://youtu.be/yekcB68XALc?t=1140",
                        "https://youtu.be/yekcB68XALc?t=1228",
                        "https://youtu.be/yekcB68XALc?t=1256",
                        "https://youtu.be/yekcB68XALc?t=1301",
                        "https://youtu.be/yekcB68XALc?t=1324",
                        "https://youtu.be/yekcB68XALc?t=1388",
                        "https://youtu.be/yekcB68XALc?t=1434",
                        "https://youtu.be/yekcB68XALc?t=1489",
                        "https://youtu.be/yekcB68XALc?t=1518",
                        "https://youtu.be/yekcB68XALc?t=1569",
                        "https://youtu.be/yekcB68XALc?t=1630",
                        "https://youtu.be/yekcB68XALc?t=1672",
                        "https://youtu.be/yekcB68XALc?t=1699",
                        "https://youtu.be/yekcB68XALc?t=1711",
                        "https://youtu.be/yekcB68XALc?t=1759",
                        "https://youtu.be/yekcB68XALc?t=1783",
                        "https://forum.makerdao.com/t/mip-6-declaration-of-intent-invest-in-short-term-bonds-proposal-for-implementation/16185",
                        "https://vote.makerdao.com/polling/QmbDbzqW#poll-detail",
                        "https://youtu.be/yekcB68XALc?t=1813",
                        "https://youtu.be/yekcB68XALc?t=1934",
                        "https://youtu.be/yekcB68XALc?t=2039",
                        "https://youtu.be/yekcB68XALc?t=2234",
                        "https://youtu.be/yekcB68XALc?t=2370",
                        "https://youtu.be/yekcB68XALc?t=2657",
                        "https://youtu.be/yekcB68XALc?t=2766",
                        "https://youtu.be/yekcB68XALc?t=2912",
                        "https://youtu.be/yekcB68XALc?t=3065",
                        "https://youtu.be/yekcB68XALc?t=3162",
                        "https://youtu.be/yekcB68XALc?t=3218",
                        "https://youtu.be/yekcB68XALc?t=3295",
                        "https://youtu.be/yekcB68XALc?t=3349",
                        "https://youtu.be/yekcB68XALc?t=3430",
                        "https://youtu.be/yekcB68XALc?t=3471",
                        "https://youtu.be/yekcB68XALc?t=3670",
                        "https://youtu.be/yekcB68XALc?t=3744",
                        "https://youtu.be/yekcB68XALc?t=3931",
                        "https://youtu.be/yekcB68XALc?t=4098",
                        "https://youtu.be/yekcB68XALc?t=4359",
                        "https://youtu.be/yekcB68XALc?t=4571",
                        "https://youtu.be/yekcB68XALc?t=4748",
                        "https://youtu.be/yekcB68XALc?t=4874",
                        "https://youtu.be/yekcB68XALc?t=5117",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-july-2022/17038"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.633887526872221
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/governance-and-risk-198-thursday-july-07-at-17-00-utc/16370",
            "title": "Governance and Risk #198 - Thursday, July 07 at 17:00 UTC ",
            "index": 16370,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "6",
                    "time": "06/07/2022-14:37:51",
                    "content": " 198 f1920×442 24.5 KB   Disclaimer This communication is provided for information purposes only. The views and opinions expressed in this meeting are those of people involved and do not reflect the official policy or position of MakerDAO or any of its contributors, Core Units, or affiliates. This communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only and should not be relied upon as legal, business, investment, financial, or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only and do not constitute any recommendation for any action or an offer to provide investment, financial, or other advisory services.  Call Recording       Call Information The zoom waiting room will be on, and a password is set to: 748478; please ping us in the Maker Discord’s #governance channel if you aren’t let in from the waiting room. 2021-07-07T17:00:00Z  Video/Voice  Dial-in  Calls Calendar  Slides - updated before the call  Introduction   @GovAlpha-Core-Unit - Hosting, Introduction, Agenda.  @gov-comms-core-unit - Slides   Governance Round-Up   @GovAlpha-Core-Unit - Votes Recap  @MIP-Editors - MIPs Recap  @Artem_Gordon - Forum Recap   Initiative Updates  None this week.   Selected Discussions   Revisiting PSM Fees Were 0 fees a mistake? Is it a problem that vault holders no longer have an arb opportunity on Dai? How would the reintroduction of a fee impact the Dai peg? Should we increase the fee-in? Related Thread - Rethinking PSM Fees Overflow Topic - MakerDAO Constitution What are the benefits to creating a constitution? What would the ideal constitution look like? Can we use the whitepaper as a constitution? Who should lead its’ creation? General Q&A Ask us stuff  Anonymous question box   @Recognized-Delegates @Core-Facilitators ",
                    "links": [
                        "https://discord.gg/5uAJtzkK",
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://docs.google.com/presentation/d/1DXHm85FNqAVyDn3gZtP2daznSRxWKQYXFHZUG2uskKo/edit?usp=sharing",
                        "https://forum.makerdao.com/t/rethinking-psm-fees/16168",
                        "https://app.suggestionox.com/r/GovCallQs"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.663461538461538
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#3",
                    "likes": "2",
                    "time": "07/07/2022-14:24:58",
                    "content": " Episode 198 | July 7, 2022 | Semi-transcription Summary  Agenda   00:00: Introduction  02:24: Votes and Polls  04:55: MIPs Update  08:46: Forum at a Glance  13:57: Discussion: Rethinking PSM Fees  1:08:53: Discussion: MakerDAO Constitution  01:23:59: Conclusion   Video Link  Introduction  Agenda and Preamble  Payton Rose 00:00  Hello, everyone, and welcome. We are up to the 198th Scientific Governance and Risk meeting here at MakerDAO. My name is Payton Rose; I go by Prose11 online. I am a Governance Facilitator at the DAO. A group of wonderful people that care about, work for, and are interested in the Maker Protocol are joining us today. Whatever camp you fall into, we are glad to have you here. In pursuit of having an effective meeting, I would like to read down a few ground rules before we begin.  This meeting is being recorded. Hello, if you are watching us at a future date. Let us try not to talk over one another. That is annoying, and it ruins the recording. If someone else is speaking, let them finish. There are a few tools you can use to let me, as the host, know that you have something you would like to add to the conversation.  You can use the raise hand feature if you desire to join the proverbial speakers’ list. You will find it located under reactions in Zoom. I will be happy to call on people as they raise their hands. If you are unable or unwilling to hop on the mic, you can drop your comments or questions in chat, and we will address them when conversationally appropriate.   This is an open meeting. We encourage and appreciate your feedback and presence here. If there is something, you would like to add, please feel free to voice it. We try to make the process as simple and inclusive as possible.   That, more or less, covers who we are and what we are doing here, so I might as well get started.   General Updates  Votes  Payton Rose Polls:  3 Concluded Weekly Polls   Add RWA-009 (HVBank) as a new Vault Type – Passed   PPG - Open Market Committee Proposal – Passed   Select a Target Level of rNPI Profitability to Guide Budget Cuts – Winning option: Break-even (Plus-minus 5%)    2 Concluded Prioritization Polls   Prioritization Sentiment - Technical Resource Deployment – Winning option: Compound D3M, with 72,753 MKR Voting (53.94%)   Prioritization Sentiment - Collateral Class – Winning option: Core Crypto Collateral, with 69,030 MKR Voting (51.16%)  Conclusions from the first run  Reflection post on process to come Looking to release v2 shortly, potentially ultilizing new options from DUX      Executive:   Yesterday’s Executive – At the moment of writing this summary: Passed on July 06, 2022, 23:32 UTC. Executed on July 08, 2022, 23:38 UTC.  Payments and Streams for Keeper Networks, Recognized Delegates and Growth, and Strategic Finance CUs   Next week’s Executive  Implementation of Keep3r DssVest Stream MOMC Parameter recommendations     MIPs  Pablo 04:55 Weekly MIPs Update #94  Calendar1036×592 30.4 KB   July’s format submission window closed yesterday, and we have had only one submission for this Governance Cycle.   Core Unit Facilitator Onboardings:  MIP41c4-SP37: Governance Facilitator Onboarding (GOV-001)  Summary “This sub proposal onboards @Patrick_J as a Facilitator for the GovAlpha (GOV-001) Core Unit.”   Ratification Poll for Governance Facilitator Onboarding GOV-001 (MIP41c4-SP37) - Leading option: Yes, with 58,187 MKR supporting.  Posted on July 11, 2022, 16:00 UTC - Ends on July 25, 2022, 16:00 UTC.       Proposals in RFC:   Top-Level MIPs:  MIP76: Makershire Redux  Summary “The Maker Protocol holds approximately $5.2B in stablecoins, effectively earning zero yields. Multiple efforts are underway (off-chain and on-chain short-term bonds) to invest the majority of stablecoin exposure. Makershire Redux will be a 10M pool allocated across Liquidity Pools to support DAI liquidity/utility and earn yield.”  MIP76 was formally introduced as an SPF and was rejected. It is currently being reworked into a top-level MIP that addresses some of its previous iteration’s concerns.    MIP72: Delegated Collateral Attachment - RWA Arranger Application - 6s Capital   Summary “MIP72 formalizes the use of revolving credit agreements by 6s Capital and Wilmington Savings Fund Society (“WSFS”), in its capacity as trustee (the “Trustee”) of the RWA Senior Lending Trust, a Delaware Statutory Trust, and its independent trust sponsor to cause a delegated authorization for collateral attachment and credit for real-world onboarding collateral to meet the Clean Money Initiative 2, sets forth the scope of lending activity as further outlined herein and names 6s Capital as a Real World Asset Arranger for MakerDAO.”    SPF:  MIP55c3-SP5: Interim Chief Legal Officer  Summary “The MakerDAO Interim Chief Legal Officer Special Purpose Fund will pay legal fees and expenses to retain Kianga Daverington, Esq. through @DaveringtonPLLC as full-time Interim Chief Legal Officer of MakerDAO for a period of six months.”    Core Unit Budgets:   These budgets are being submitted outside of the budget windows that were introduced with the recent MIP40 amendment. This falls under the transitional grace period.  MIP40c3-SP73: Modify Dai Foundation Cure Unit Budget (DAIF-001)  Summary “This Budget Proposal for DAI expenses aims to fund the activities of the DAIF-001 Core Unit as described in MIP39c2-SP17 adds Core Unit DAIF-001: Dai Foundation. This budget is necessary to fund DAIF-001 activities in its second budget year.”   MIP40c3-SP75: Modify Oracle Core Unit Budget (ORA-001)  Summary “MIP40c3-SP75 renews the Oracle Core Unit (ORA-001) budget from July 01, 2022, through June 30, 2023.”    Core Unit Facilitator Onboarding:  MIP41c4-SP38: Immunefi Security Core Unit Facilitator Onboarding (IS-001)  Summary “I have worked as Deputy Facilitator for Immunefi Security since its inception on Dec 2021 and, during part of its incubation period under SES, two months prior (Oct and Nov 2021). I have taken charge of the accounting, written status updates, and contributed to our core unit’s goals. Our current Facilitator, @travinimmunefi, continues to lead with long-term strategic planning but is stretched thin by his many other responsibilities. When Travin has scheduling conflicts, I am asked to attend the weekly Mandated Actor’s meeting in his place. This MIP formalizes what is essentially already the status quo.”    Core Unit Offboarding:   We have two proposals aiming to offboard the Events Core Unit. These proposals are to be considered a unity, and if formally submitted, they will bundle into a single ratification poll since these are the two components needed to offboard any given Core Unit.  MIP40c3-SP73: Modify Core Unit Budget (EVENTS-001)  Summary “MIP40c3-SP73 removes all and any active budgets for the Events Core Unit—Dai or MKR.”   MIP41c5-SP8: Facilitator Offboarding (EVENTS-001)  Summary “I’m sure these are nice people, but this core unit is not needed, and severance has been proposed.” – @Ippy    Amendments:  MIP4c2-SP23: MIP50 Direct Deposit Module Amendment  Summary “MIP50 was too specific to lending protocols. I’ve updated it for the V2 rewrite, which covers all external protocols that allow users to deposit / withdraw DAI. I’ve updated the MIP to remove details of the targeting mechanism as that is no longer important.”   MIP4c2-SP21: Add Retrospection Process to prune unused MIPs  Summary “Bureaucracy tends to grow without active pruning. The Retrospection Process aims to surface a process to help prune unused or low-utility MIPs. This process also helps introduce and familiarize the broader community with MIPs that continue to be used. This change makes MIP0 depend on MIP4 for the removal process.”   MIP4c2-SP15: Core Unit Offboarding Process Amendments  Summary “The original motivation for this amendment was to simplify and clarify the Core Unit offboarding process. Recent examples (see MKT-001 offboarding: 1 3, 2 1, 3 1) have demonstrated several gaps in this process. Ratifying simple changes started small, and along the way, the ambitions grew into revisions for much of the Core Unit MIP Set. Thanks to generous contributions from GovAlpha, we now have a cohesive MIP Set. The aim is to reduce harm to the DAO and community during Core Unit disruptions.”    Forum at a Glance  Artem Gordon Post: Forum at a Glance: June 30 - July 6, 2022 Video: Forum at a Glance   News & Announcements:  Meet the Dai Foundation Board during EthCC Announcing Maker Risk Dashboard v3 MakerDAO Actual Expenses vs Budget - May 2022    Discussions:  [Informal poll] Disable the Emergency Shutdown Module  End-Game Summary - Part 3 & Part 4  [Vault-Discussion] NonSC Crypto-Backed Loan Optionality     Discussion  Rethinking PSM Fees  Thomas Flitter 13:57  Our discussion topic today is Rethinking PSM Fees.  Tim Schuppener–Schuppi–posted this thread on the forum several days ago, sparking a lively discussion. Thus, we asked him and others to talk about his post today. Tim, if you would, talk to us about this post and your thoughts on the zero PSM Fees.    Tim: As a brief introduction, the PSM is a module that permits anyone to provide USDC and get DAI or any other stablecoin for which we have a PSM, and vice-versa.  From the beginning, we designed the PSM with a fee, both for the in and the out transaction. Half a year ago, we decided to lower the fees to zero, essentially allowing swaps for free. By that time, the main reason was not the lack of revenue but about being able to enforce something akin to a hard peg for DAI.  Two years ago, we had the issue of DAI not keeping its peg, and since we had a lot more demand than supply of DAI, if we did not utilize a PSM, DAI would have traded above one US Dollar at all times. Thus, the PSM was a powerful tool for enforcing a hard peg, which was not the original design since Dai was a soft-pegged stablecoin since conception.   The issue we are currently facing is that, over the last few months, the amount of DAI generated by classic vaults–people locking up collateral and then minting DAI–diminished to less than 20%. Ergo, 80% of the DAI in circulation is not backed by any crypto collateral but by people swapping USDC into the PSM and then minting DAI.  We are in a questionable situation. We have a lethal amount of USDC in our books. If something catastrophic were to happen–which we cannot predict–, such as black-listing or de-pegging of USDC, we would be doomed. We turned our backs on the original users of the Maker Protocol: the people locking up collateral in a vault to generate DAI.   There are two cases where you would choose to use classic vaults.  One is leveraging: you bet something you are going to buy with DAI will explode in price, and then you make a profit. On the other hand, once DAI trades north of the peg, you could arbitrage with what you are minting out of the vaults. We are in a Bear Market; nobody has an appetite for leverage anymore; nobody uses vaults. And since it is virtually free to swap USDC for DAI and vice-versa, the other reason you would lock up collateral in a vault, arbitraging the de-pegging, is gone. It becomes unreasonable to lock up any collateral or to create DAI to arbitrage in the peg.      18:32  I have discussed this with a few people, especially with Brian from Protocol Engineering: I have been thinking that maybe we should recreate the incentive for arbitrages by increasing the PSM fee once more.  I did not come up with any specific value yet. I am focused on revisiting the idea of providing an incentive for arbitraging with crypto collateral again. That, more or less, sums up my motivation. That is why I was proposing to discuss this. I understand that this comes with a series of side effects, and I do not know if we even know all of them.  There are side effects for people who want to do large transactions swapping DAI against USDC since they would not have the guarantee anymore to have a hard peg using the PSM. Or even for people who are using GUNI–was this renamed?–providing liquidity to Uniswap with a 50x leverage. They would probably be affected by that.   The idea of this post was to find out the sentiment and to identify the missing pieces.  The ultimate goal was to start a Signal Request and go through the appropriate Governance circuits to raise the tin or get this rejected on-chain.      Thomas: Thank you, Tim. Does anyone want to respond to that opening?  Payton: I noticed this comment about RWA and large borrowers caring deeply about the one-to-one peg.  One objection to adding fees to the PSM is that, as Schuppi was demonstrating, this means no hard peg. That would be harsh for borrowers who could not depend on a one-to-one peg and would have to do some currency hedging, in addition to whatever setup they create to convert DAI to hard money or spending money. That is one for the Cons list.    22:21   Person 1: I would like to comment on this topic. If the only argument for increasing tin  is the incentive for crypto vaults to mint more DAI, I think we should evaluate the fact that there is a high chance that they might be indifferent to this change.  During the last year, we tried, with different initiatives, to lower USDC reserves. To my understanding, this was one of the main goals of the whole DAO.  One of those initiatives was to lower stability fees on the vaults, hoping that more demand would arise with a lower price. But, to my knowledge, and from the testimony of the people I talk to, the stability fee has a slim effect on actual demand for leverage. Going from there, I doubt that a slight premium will have a higher impact than the stability fee has.   We introduced the PSM for two reasons: the first being that the traditional soft-peg mechanisms to maintain the peg do not work during large market drawdowns, and there are several reasons why they do not work.  When you have a 40% drop on Bitcoin or ETH, there will not be many people jumping on the train to mint depth and build leverage in such a stage.   The other reason we introduced the PSM is that the vision was that we would grow based on real-world assets because the hard peg is much more relevant for RWA than it is for general crypto back loans. Then, for one year or even more, we tried to lower USDC reserves or diversify them.  Most of these initiatives failed; the philosophy shifted toward achieving returns on our reserves instead of getting rid of them. If I understand this new philosophy correctly, the strategy is to have as much research as possible.   I think the whole DAO needs to decide on its strategy and only then tweak the PSM and reformulate the mechanisms of DAI as a pegged currency.   Going back to the PSM, I have been thinking that something that might work would be introducing tin at a higher level. Let us say three-ish percent.  The PSM would only serve as a hard-peg vehicle in the case of large market drawdowns. In stable market scenarios, the traditional soft peg mechanisms would arbitrage this slight back. We need to understand that these soft mechanisms will never fixate hard-pegged DAI to one, but with the PSM and high fees, we will still ensure the maximum possible premium.  We could have the security that DAI will not deviate enormously from the peg, and at the same time, we can reintroduce traditional MakerDAO soft peg mechanisms, which many participants have enjoyed in the past.      27:41   Person 2:  I have heard that Genesis can only do 25 million DAI at a clip. Why would a whale want to use DAI when transferring 100 million or 200 million?  On whale alert, you see BTC and ETH transfers of nine digits. If Genesis could only handle 25,000 DAI, why would anyone want to use it? I think that is the bigger question. Personally, if I had nine figures ready to move, I would rather do it in DAI than BTC or ETH. Some people might shoot me for saying that, but it is what it is.  That, to me, is the bigger question: how are we affecting the confidence of how to get out? As someone who earns nine figures in DAI, or BTC, maybe I want to go out there and buy myself an American football team, or I might be bored of being in DeFi. If I wanted out and Genesis could only take 25 at a clip, why would I use DAI?      Payton: I suspect this might not be an easy question to answer, and maybe I should not ask it, but I am curious: in terms of actual revenue impact estimates as well as usage impact, has anyone looked into how the fees might affect either of those? Of course, we can expect less useful when it’s being charged.   Tim: I do not have the numbers, but I would not expect any direct effects on the PSM and the fees: we have plenty of liquidity on Curve and Uniswap. This will be cheaper than exchanging within the PSM, and it would get absorbed earlier.  Although I think this will, to some extent, have a trickle-down effect, I believe that if we were to turn up the tin right now, that would not happen immediately.    Person 1: I agree with Schuppi: if we increase tin, nothing will happen. The back will slightly change. But we will not reduce reserves whatsoever.    31:18   Nadia: Why did you think we have to re-evaluate the PSM fees? Is it because you believe we have accumulated too much USDC? Is it because you think we need to get revenue from said USDC? I want to define the problem to think about the solutions.   Tim: My intention is not about the amount of USDC we have right now. Other people are more concerned about this. I am not part of this party. At least not vocal. My concern is that I do not want the product of Maker, or the pegging of DAI, to be WUSDC with T-bills on top. That is not how I think this should run.  Either we have RWA or a rising amount of DAI created by vaults. It could be institutional vaults or any other type. I do not care. I want DAI to be backed by vaults and not a PSM. That is my main concern. We have been lowering the stability fees for quite some time. And with every passing month, I feel we are only turning knobs. And it does not have any effect. That is just sad.   I would like to encourage people to use our main product again, vaults, following the be your bank narrative–which I like–. That was what brought me to Maker. Does that help?  Nadia: Yes. We should consider the problem before analyzing a solution: there might be other alternatives.  If you do not want Maker to invest the PSM on T-bills–I believe Maker holders do want that; I don’t know if that passed–, we have to point in that direction.    Tim: This is not a black and white thing. I dislike the idea of having T-bills, but it is inevitable. We need to do that to survive. It is the proper way of dealing with the current situation, but in an ideal scenario, we would not need to do that. If all the PSMs drain, there would be no plan for investing in T-bills.  I put up this post to discuss what is happening. If somebody has a better idea than raising that, I am happy to hear it. I do not want to complain about “Oh, we have too much USDC in the PSM, yadda yadda, yadda.” You need to come up with a proposal to do something, even if it is not the best.    Person 2: If you want to attract DAI-vault users, go out there and get them. You got to get out there, close deals, and attract new users. There is no other way around it.  Increasing the tin 10, 20, or 30 basis points will not get you more users. The only way to get users is to go out there, be innovative, bring institutional vaults, etcetera. That is the drill. There is only one way to grow a protocol: you need to nurture the network effect that will build it. Again: it is not by increasing 10, 20, or 30 basis points and being here, arguing until we are blue in the face about USDC and too much in the PSM, etcetera. That is my opinion. That is how things get done: you close deals.    Tim: Sorry, I cannot do that.    35:33   Brian: The point of a permissionless system is not to have to close deals; it is to provide the right solutions so that people will want to use our product. I am going to quote Thomas Sowell and say that “Many of today’s problems are a result of yesterday’s solutions”.  85% of DAI backing being USDC is a problem. Typically, we have this trifecta where we can optimize for DAI users, MKR holders, or vault holders.  Throughout this process, we have been optimizing for DAI users and neglecting vault holders. We are also adding this fourth leg to the problem, where we are optimizing for RWA, which we do not have many of, and all our revenue comes from vaults. As a vault holder, if I want to generate DAI from a vault, I would put my collateral in and pull the DAI out. And I am, at this point, effectively losing money on DAI because I have to pay gas fees, etcetera. We have stripped every incentive for a vault holder to take DAI against their collateral by not allowing it to float in the market.  I am not sold on the fact that vault holders are concerned about a strict one-to-one peg because I know I am not, and I am not even sure why RWA holders would be even if there is a 1% tin on the PSM. That does not mean that DAI is equal to a Dollar one. It can trade between a Dollar and a Dollar in other markets.  We have Uniswap, Curve, and other places where we have rugged all of that range for trading. We have stunted liquidity pool growth and the ability for vault holders to at least recoup some of their gas costs on DAI generation, and we have eaten the whole market for DAI trade. That is long-term harmful to DAI.     I want to make that point: we talk about how vault holders do not wish DAI to be off-peg, but I do not see how that does not come out as a wash in the end.  If you borrow 100 million DAI and you can sell them on the market, maybe not through the PSM, but on the open market for a Dollar one, and then you have to buy them for a Dollar one when you come back to repay your vault, it is a net wash. We are trying to optimize for something that does not seem to be an issue. Setting the fees to zero was the no pain option: no pain, no gain.  We have eaten the entire market, and that causes predictable downstream problems that we are dealing with now, to the point where we are talking about off-chain assets, which is entirely antithetical to the spirit of DeFi.        39:20  Nadia Alvarez: We have two different problems or challenges. One is that I advocate maintaining Dai at one dollar because this is not just an RWAs problem. It is a real-world problem. If people think they are getting the stablecoin pegged to the dollar, they expect one Dai to be one dollar. They do not understand what a decentralized stablecoin is. It will be way harder to explain what is a soft peg stablecoin. Probably if they can understand that, they will prefer another stablecoin better than Dai because they never know what will happen with Dai. It will be unpredictable. If Dai is not at one, it will affect only those RWA and any Dai user. I wrote that in the post. I tried to pay any service provider in Dai because it is easy for me to demonstrate that one Dai is one dollar. If exchanges on/off-ramps want to have Dai on their inventory, they must buy large amounts of Dai. And if it increases in value to the exchanges, they will increase the value to retail. It will not just affect RWA or big borrowers. It will affect retail. Maybe we will go back to the vault users, but we will forget about the Dai users. And we have to maintain a middle ground between both.  41:25  Brian McMichael: I think that was my point. We have got that trifecta. And we have been over-optimizing for Dai holders for way too long. So Dai has value because vault holders are over-collateralized. At some point, they want to buy back Dai to repay their vaults to recover their over-collateralized assets. Dai has its demand built-in with the (41:50)(x?)(center instruction) system. We are in the market trying to further incentivize Dai beyond that. But we are not doing anything to stimulate supply. And in fact, I would argue that the PSM being at zero is discouraging additional supply for this pain-free option of not trying to induce vault generation of Dai.  42:13  Nadia Alvarez: Do you think that it is possible to think of other options to incentivize vault usage? For example, if we think about a vault where you lock Eth, you can use that Eth to do something else. Maybe that is not technically possible. But maybe that is a feature that will be interesting to people. Perhaps we are focusing the conversation on the PSM, but the real problem is how we can incentivize the usage of the vault. So one thing that I agree with Monet is that vault users love predictability. If we can tell them okay, we will keep these fees until the end of the year. That is something for them. That is a lot for them. They will appreciate that even more than maybe if Dai will go to 1.01 or maybe not, you do not know. You will have to be prepared, just in case. Predictability is gold for people wanting to open a vault. It would be great if we could think of different solutions to incentivize the Maker vaults’ usage and analyze all the solutions from a technical perspective. And also, what will be the impact on Dai users and vault users. And stop thinking just about the PSM? Think about more ideas.  43:53  Brian McMichael: In an ideal situation, we would have some asset inversely correlated to Ethereum or Bitcoin that people could speculate on the short side. We do not have that, though. We just have the stables, which are the intermediate play. I want to get back to the point that if we raise the PSM fees, even 1%, that is not saying that Dai will be a dollar one in the market. It opens the window so that the market can trade between the dollar and the dollar. It means that vault holders may have to go out and sell their Dai on an open market to get a rate they like. But it also means that we would be guaranteeing that in a Dai liquidity crisis, if the markets are collapsing and vault holders need to repay their Dai, we can guarantee a dollar one. But for anything outside that, we would let the market take care of it instead of trying to be the market for them.  Someone x?: Do you think Dai could function without PSM?   Brian McMichael: Dai functioned without the PSM. Side functioned its entire lifecycle without a PSM and traded under peg the whole time. Dai did not start trading above peg until the bull market. We have internal debates on whether this actual market cycle is over. But at some point, Dai will start trading under-market as people are exiting crypto, trying to get back to dollars in their Trefi accounts. Because that happens, it is titled. In that case, Dai will be under all of these plans to take this USDC off-chain and put them in bonds will be dashed because we will have to pull them back on-chain to pay these redemptions out. We should encourage vault demand as sticky users generate revenue for the protocol because we have taken this easy route of just hard-locking through the PSM. And we have got this huge supply, which is a great vanity metric. But it is going to disappear. And we will not have anything to show for it when it is all over.  46:25  Nadia Alvarez: Based on the experience of the major whales using the protocol, they will use the PSM. For them, it is important that one to one between Dai.  Brian McMichael: That is the point. Why aren’t they using vaults? How do we get them to use vaults?   Nadia Alvarez: I mean, the whales using Maker vaults. So the main ones using it are the ETH and WBTC vaults. After they get Dai, they convert it to USDC.  Brian McMichael: There is a little disconnect here between saying that one-to-one is necessary, but how strict does this one-to-one be? Let us say the third place after the comma shifts a little or the second even? How are you seeing this affecting the demand for Dai? Is this like a no go? How tight does the peg have to be, in your opinion? Is it okay if the second point after the comma shifts by one or two? Or do you think this will already scare people away? How tight does it have to be?    48:02  Someone: In my opinion, a 3% deviation is completely okay, especially if you consider that the majority of the world is who not domestically using USD is using USD crypto. For example, I am European and am okay with the dollar deviating from Euro. So I am not that hurt if my stablecoin will slightly deviate also.  Payton Rose: It also probably matters what your view is and when your projected use for Dai is. Bourbon and all of us are asking about the basis points fee for flash minting. It all depends on the use case you see and what you add in. But ultimately, 100 basis points, which would be two decimal points over, is a lot—even 50 basis points. If you start to do larger transactions, it creates quite a bit of a fee and friction. So it all depends.   Someone: We cannot decide if we do not have strong models about how this affects the whole system. We could run this experiment, right? It would be okay to say we are introducing that for a month or a week. And then see what happens. And maybe, as Schuppi said, nothing happens, and it is okay.  50:06  Nadia Alvarez: I want to answer one of the things that Chris said growth is incentivized to keep a hard peg. We are not. I am telling all of you the consequences of having a soft peg. This will affect on/off ramps. This will affect retail people buying Dai because they consider it a stablecoin. This will affect the whales opening Maker vaults because they get Dai and convert it to USDC. If we want to go in the direction of Dai soft peg because the white paper stated that we could go there, and we, growth, will support that. But we must all be aware that it will not be a stablecoin. It will be something else. Because for people’s mindset, stablecoin equals something that is a hard peg. You can explain to them, but they will always prefer a stablecoin that is a hard peg, that is, high liquidity, that they can convert into fiat. If we change the direction, growth will change the audience, the message, and all of that. We are not incentivized to go in that direction, but we must tell the community about the consequences and what will happen if we decide to do that.  Chris Blec: Of course, growth is incentivized to keep the hard peg, as is RWA and some other CUs. I am not saying that as an aspersion. I am saying that as a fact of the way the organization is built. We need to recognize that each team has incentives that it is driven toward because each team wants to be successful. That is not a bad thing. That is why we have the CUs. It is to separate our responsibilities and goals, and objectives. Everybody wants Maker to succeed. But everybody also wants to be successful. And if there is not a hard peg, growth becomes harder. It becomes harder to grow. We might even shrink. The growth team does not want us to shrink. The growth team wants us to grow. I am not saying that the growth team should advocate for a soft peg and hope we do not grow. That is not the role of growth. It is important in these conversations to recognize each team’s objectives and how they are incentivized. It is not a bad thing. Do not take it as bad as in aspersion. It is just the way the organization should be set up. That is what I mean when I am talking about incentives. Payton Rose: It is valuable to reflect on incentives. It is also something Nadia said that if the CU’s mandate is to promote what the protocol goes with. And if the protocol decides they do not want to value a peg, then the CU would be shifting as well. There is some interesting side-chat going on about flexibility. Chris chimed in and said 3% is not that bad. I do not know if there are more combos that we could be having there. I am noticing much chat about how necessary one-to-one is.    54:57  Brian McMichael: I want to point out that Dai has no value other than what someone will pay for it. And the reason that someone pays for it is to unlock the collateral in their vaults. RWA, their net sellers, until such point, want to rebuy and repay Dai, that is over a longer period. They are not incentivized to repay in a downturn. It is quite possible that they can set limit orders to rebuy from other RW buyers in the future and get that $1 price. We are over-optimizing for a thing that we should not be over-optimizing for and losing all of our revenue because of it.  ElPro: Let us not forget that some more RWA platforms are looking to get some of the RWA collateral types on-chain. Let us give them a little bit of credit. In my opinion, without MakerDAO, RWAs will get on chain. It is a matter of whether we want it. How badly do we want it? And if we want to make it happen. Let’s opt out if we do not want to make it happen. But to Nick’s point on the chat, we spent many years, many resources, or much money to try to get there. It will happen    56:43  Max: I joined this conversation late. I am trying to make sense of why the RWA lending is seen as not profitable. Or why is RWA controversial as it relates to this peg conversation? Brian McMichael: With the collateral vaults, I put in $150 worth of ETH, and I can take out $100 worth of Dai. At some point, I will want my ETH back because the ETH price is falling, and I want to stop the hemorrhaging. Or, because the ETH price has gone up, I want to repay and unlock that $150 worth of collateral at the time. Like with current schemes, RWA providers are setting a two-year interest rate buffer on those. So these RWA providers do not even have a Dai demand for another two years. Even then, I am not convinced that we have got enforcement of these repayment schemes worked out to such a point that they will create enough Dai demand to keep the peg from going low. Someone: Let me talk about enforcement schemes. In the proposed Huntingdon Valley Bank deal, which is up for vote right now, a Delaware Statutory Trust funded by a vault set up by Maker would then purchase assets. These loans would then be in custody at the Delaware trust, and they would have a duration of fewer than five years, and over the course of those five years, they would pay that principal and interest. If that makes sense. And then the principal and interest. The principal is the principal, and interest is floating at a rate above benchmarks, so probably four and a half percent right now. Net.  59:17  Payton Rose: Correct me if I am wrong, but the fear and the criticism are not so much like, what if there are no assets, right? The question is, what are those assets doing to the peg? And do they encourage Dai to be bought back?  Brian McMichael: An arbitrageur can play both sides. They can effectively market-make as long as a market is to be made. But we do not have that. So we are on the market with a PSM fee of zero. We tamped down one ecosystem component, the arbitrage market, by setting the PSM fees to zero. As you mentioned, the point about the RWA is that these repayment schemes are not set to happen for another couple of years. In the meantime, we still need to spark Dai demand so that we can keep taking on these RWA deals and let them continue to sell their Dai for some USDC dollars, equivalent to the nominal value of the Dai they take out. But we can only do that for so long until there is no more demand for Dai. With the normal collateral vaults, the arbitragers would pick that up and add to or repay vaults as the price fluctuates. But because we are the whole market for that. I should point out that we are not making any money by being that market Maker. It is unclear that we have been cultivating the arbitrage ecosystem that would manage the peg over the long term without the demand to repay. Someone: What I see is that, in the PSM, Maker is holding many billions of USDC. I do not know if it is five billion or something. And that is effectively five billion of the runway, where you can increase the supply of Dai through the RWA program. And the broker-dealer who will swap that Dai for dollars is probably going to route through the PSM, swap Dai for USDC through the PSM reduce and draw down the USDC in the PSM, which is good for MakerDAO. Then whatever window at Circle is used to swap USDC for dollars will do that and then fund the trust. So it not only generates a yield for Maker but also addresses another problem in this system: concentration and collateralization with zero yield stablecoins like USDC. Brian McMichael: To be clear, when an RWA provider takes a 500 million Dai loan and they push it into the PSM, they are burning Dai to decrease the supply. Chris: Brian, quick question for you. If the PSM was never implemented back in, I think it was 2020. How much Dai outstanding do we have right now without the PSM? Brian McMichael: The quote-unquote scale is not what I am concerned about. I am concerned about the stability of the system. And the long-term sustainable growth and security of the system. We have this existential 85% USDC right now, which is not sustainable. It is a vanity metric that will disappear if Dai demand starts to dry up. I hear many comparisons to Rai, and we will be like Rai. I like Rai. It has got its problems, though. Namely, it is a fork. The founders are a little bit different. It has got a weird peg mechanism. They are just things that you cannot compare to Dai. Someone: If during the RWA process, the broker-dealer gets Dai from the vaults, from the MIP 21, sends it to the PSM, and effectively burns Dai but gets back USDC, drawing it out of Maker and using it to create new collateral that is going to back MakerDAO. How is that not a great flow and beneficial? I am asking because I want to understand where the challenge is here. And again, I entered the conversation late. Brian McMichael: It works until it does not. Many people in this chat had come in since 2020 when Dai started trading above peg, and they did not see the process that the DAO went through before that, just trying to keep the peg up. At one point, we had 20% stability fees on collateral vaults to try and hold that peg up. And we will be back to that, and all of that USDC in the PSM will be gone, but we will be dealing with a completely different problem that could be solved by encouraging vault holders.    1:05:21  Eric Rapp: It is an interesting conversation. One point I want to make is that at this point, there are about five times as much as canonical Dai as crypto Dai. So it is about five billion versus one billion. Right now, canonical Dai is making no money, but it is starting to get put into treasury assets, where you would hope you could, on aggregate, 1% on that five billion. Assuming you get this up and going, it will probably make more money than the crypto Dai. I like crypto Dai. But let us be honest, folks, the rates have come way down. It is a pretty commoditized product, just lending. There is no moat there. In the long term, I look at canonical Dai and think this is the North Star. This has network effects. You can build payment rails. You can have massive integrations in the real world. People in Argentina with inflation want to use it. And then I look at crypto Dai. I like it, but it is kind of low. It is a relatively low volume, low margin business, and we should always have it there. But I do not see it as a North Star. People race to scale it is just another product among many. As opposed to having a stablecoin that lots of folks want to use at scale is something else entirely, something more special. When I look at canonical Dai, I say: “That is something special. That scales”. And that can have much more impact on the 400 trillion dollars RWA. Eric Rapp: I would follow up. Again, suppose folks tend to agree that canonical Dai is an important part of our ecosystem. In that case, we need to think more carefully about what the canonical Dai holders want and their interests? To their five billion out there, they deserve weighting in our considerations around fees, asset stability, and peg stability. That is our biggest product user. And I feel we do not give them enough weight and enough seriousness. And hopefully, by doing this right, in a couple of years, it could be 50 billion, but you got to take those guys very seriously and meet their needs.  1:08:55  Kianga Daverington: Maybe if we have time to talk about the Constitution, I am curious what people are thinking about that. And to Eric’s point about taking the views of other stakeholders in the whole ecosystem, this was a great conversation. What should be our takeaway from this, to act on what we discussed? We have raised some new angles to consider very urgently. Is the Constitution a process that can help this community sort through where we land on this or not? That would be my question, if it is okay to segue to that topic, not to cut off this conversation.  Payton Rose: This has come up in several long virgin proposals. It is something that when we talk about having a vision, organizational goals, or anything that you would think of as commonly agreed upon; the only way you can do that in a DAO is to have a document or something that you agree on and agree not to change it or only to change it if a very strict consensus is reached. The question is, with the Maker Constitution, is this something we could see helpful for settling ideological debates like this? Is this practical for a DAO that can have many different parties with different motivations. That is what a Constitution is. And, is it something that can be useful for us? It is the exploration question. Someone: I would encourage anybody interested in this to check out the MakerDAO White Paper. Because if you want a Constitution, it seems like a great place to start. I know that is why I am here. And I know why a lot of early investors are here. If we want to change that, that should be a DAO-wide conversation.    1:12:07  Payton Rose: Certainly, anyone could vote for a MIP that is the MakerDAO Constitution. Procedurally, it would not be too hard to do but is that a worthwhile endeavor to take on? And even the white paper, if you take the view that that was the Constitution, how many things from the white paper are no longer true and are no longer in our business model? Is that something that should be revisited and revamped? Is it worth releasing a white paper 2.0?  Someone: First, my slight comment is that tackling the white paper or the constitution is a very valid thing to do because it is the root of all these discussions and questions we have at the moment. Do we focus on RWA? Do we not? How much on-chain versus off-chain should we be? How much of an investment vehicle credit facility are we? Where do we sit on this scale on the table? It is very difficult to answer. But we have to answer that otherwise, we will be in this perpetual: how much should we be leaning in this direction or not? We have to accept which way we are going. Much of that comes from a document, a vision, a mission; what is it we are here to do, type of thing, which seems to be where this constitution discussion is going. So it is a discussion to have, and hopefully, that will help answer where we need to focus, which feels like a lot of the challenges we are focusing on that we are talking through at the moment. The question is, how, if we do want to do it, the white paper is a great starting point for that discussion because it is what we have now. It is why we started on this journey. How much does it change? Who changes it? How is the discussion? What is the process for having that conversation? We must arrive at a group with those decisions to facilitate the discussion. Not quite sure how we go about it, but there has to be again some owner or someone to pick up the reins and at least put it forward to the community for discussion and debate, which is where we are now, but it does not have an owner or someone to hold the reins. And we have seen different groups. We had the growth group. We had Rune’s group. We are all trying to get to the same place in the end. We do not quite know the journey there—just some thoughts. Someone: From a political perspective, a constitution exists within a democratic system to define some processes and protect minority rights. And, as Ben Franklin said, democracy is two wolves and a sheep deciding what to have for dinner. The constitution is what would protect minority stakeholders from plans that would fleece them effectively. And if you want a robust community, you need to be able to protect those smallholders. Otherwise, it will just be the plutocrats running the show. Give the little guy something to grab on to. And if you do not want to do that, that is fine, too. Just vote on it. And we can all move on to something else.    1:16:14  Payton Rose: Noting the time here. This is obviously like a broader conversation. I think we had it as a backup. We were not sure how much the first one would go. But yeah, this is a common problem now. And naming matters a lot. Whether you call it a constitution, vision statement, or something else, you do not mean to imply that constitution is more necessary than any other.  1:17:48   Bourbon: There have been many talks about the ESM. And this sort of a minority thing. Does anyone know what its original intent was? We have two people involved in building it, but we have been moving it out of the way. I believe it was not put there by accident. If we are going to remove it or not, what is in place of it, I really would like to because I do not know in which case it might get triggered. I do not see it as an attack vector. There are edge cases where it could be exploited; borrowing Maker, maybe shorting Dai. It was put there for a reason, but I do not fully understand which case it might ever be triggered. And before we rush to get rid of that, that is the minority holder protection that we had. Does anyone truly understand what purpose it was there for and what its original intent was?   Someone: From what I have heard from many discussions, especially Rune, he was very concerned about corruption and collusion. And the idea was what would happen if, for example, significant Maker holders got it together. And basically, they can do what they want, and the status quo does not change. His idea was that there should be a way for even minority holders to challenge the protocol and rechange that. Realistically, we have realized that even if they tried to burn it and trigger it, the majority can just say it is new and inappropriate for no cost. At least in terms of philosophy, that was the thinking. But others can chip in their versions.   Bourbon: Was it the ESM Rune’s or Nikolai’s idea? I do not remember whose idea it was. If it concerns corruption, and minority holders having a chance to shut down the protocol, it is still necessary. If enough holders gain control, I do not know. I struggled to see who would voluntarily torch their Maker rather than sell it just for the system’s good. I still struggle to see it as an attack vector. It is an obscure one. It should be higher than any one person in some drunken state can trigger on their own. But purely as they borrow the Maker and shorted attack. That one is quite hard to execute. If you can predict which way the peg will go and short that, then, as Bourbon said, you can profit quite well. But you are not with certainty. You are spending much capital to execute this attack, and you are not 100% sure Dai will break the peg in the direction you want it to, probably down. If we get targeted by a state actor at this point, I do not think we stand a chance anywhere. Right? But whether the ESM in its current implementation is the right forum, but some sort of thing like that.  Payton Rose: We have a few ESM threads going on the forum. I would encourage you to continue the conversation there. Noting the time here. I want to be respectful of everyone. We should think about wrapping it up. Are there any last questions or comments we wanted to include in this call? All right, cool.     Conclusion  Payton Rose  I appreciate the discussion. It is nice to get so many different voices weighing in. Hopefully, we will have more issue discussion calls and other things we can use to funnel these specific conversations and debates. We appreciate all the ground we covered today. We will be back same time, the same place next week. See you in the forums. Have a good one, everyone.  Suggestion Box  Credits  Constanza produced this summary. Kunfu Po produced this summary. Larry Wu produced this summary. Everyone who spoke and presented on the call.​  ",
                    "links": [
                        "https://youtu.be/EdmJ1onA-20?t=144",
                        "https://youtu.be/EdmJ1onA-20?t=295",
                        "https://youtu.be/EdmJ1onA-20?t=526",
                        "https://youtu.be/EdmJ1onA-20?t=837",
                        "https://youtu.be/EdmJ1onA-20?t=4133",
                        "https://youtu.be/EdmJ1onA-20?t=5039",
                        "https://youtu.be/EdmJ1onA-20",
                        "https://youtu.be/EdmJ1onA-20",
                        "https://vote.makerdao.com/polling/QmQMDasC",
                        "https://vote.makerdao.com/polling/QmefrhsE",
                        "https://vote.makerdao.com/polling/Qmasg6zr",
                        "https://vote.makerdao.com/polling/QmYqBhDx#vote-breakdown",
                        "https://vote.makerdao.com/polling/QmdZezCr",
                        "https://vote.makerdao.com/executive/template-executive-vote-core-unit-distributions-recognized-delegate-compensation-keeper-network-stream-setup-july-06-2022",
                        "https://youtu.be/EdmJ1onA-20?t=295",
                        "https://forum.makerdao.com/t/weekly-mips-update-94/16330",
                        "https://youtu.be/EdmJ1onA-20?t=319",
                        "https://forum.makerdao.com/t/mip41c4-sp37-governance-facilitator-onboarding-gov-001/15284",
                        "https://forum.makerdao.com/u/patrick_j",
                        "https://vote.makerdao.com/polling/QmY3xqFQ#vote-breakdown",
                        "https://youtu.be/EdmJ1onA-20?t=330",
                        "https://youtu.be/EdmJ1onA-20?t=337",
                        "https://forum.makerdao.com/t/mip76-makershire-redux/16400/32",
                        "https://forum.makerdao.com/t/mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14482",
                        "https://forum.makerdao.com/t/the-case-for-clean-money/10684",
                        "https://youtu.be/EdmJ1onA-20?t=371",
                        "https://forum.makerdao.com/t/mip55c3-sp5-interim-chief-legal-officer/15981",
                        "https://forum.makerdao.com/u/daveringtonpllc",
                        "https://youtu.be/EdmJ1onA-20?t=395",
                        "https://forum.makerdao.com/t/amended-mip40-important-information-for-core-units/15450",
                        "https://forum.makerdao.com/t/mip40c3-sp74-modify-dai-foundation-core-unit-budget-daif-001/16379/4",
                        "https://forum.makerdao.com/t/mip39c2-sp17-adds-core-unit-daif-001-dai-foundation/9239",
                        "https://forum.makerdao.com/t/mip40c3-sp75-modify-oracles-core-unit-budget-ora-001/16397",
                        "https://youtu.be/EdmJ1onA-20?t=424",
                        "https://forum.makerdao.com/t/mip41c4-sp38-immunefi-security-core-unit-facilitator-onboarding-is-001/16348",
                        "https://forum.makerdao.com/u/travinimmunefi",
                        "https://youtu.be/EdmJ1onA-20?t=444",
                        "https://forum.makerdao.com/t/mip40c3-sp73-modify-core-unit-budget-events-001/15991",
                        "https://forum.makerdao.com/t/mip41c5-sp8-facilitator-offboarding-events-001/15992",
                        "https://forum.makerdao.com/t/mip40c3-spxx-modify-core-unit-budget-for-events-001/15991",
                        "https://youtu.be/EdmJ1onA-20?t=465",
                        "https://forum.makerdao.com/t/mip4c2-sp23-mip50-direct-deposit-module-amendment/16387",
                        "https://forum.makerdao.com/t/mip4c2-sp21-add-retrospection-process-to-prune-unused-mips/15142",
                        "https://forum.makerdao.com/t/new-mip4c2-sp15-core-unit-offboarding-process-amendments/15291",
                        "https://forum.makerdao.com/t/mip40c3-sp49-modify-core-unit-budget-mkt-001/12059/12",
                        "https://forum.makerdao.com/t/mip41c5-sp3-facilitator-offboarding-mkt-001/12058/11",
                        "https://forum.makerdao.com/t/content-production-core-unit-offboarding-post-mortem/13756",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/4",
                        "https://www.youtube.com/watch?v=EdmJ1onA-20&t=526s",
                        "https://youtu.be/EdmJ1onA-20?t=563",
                        "https://forum.makerdao.com/t/meet-the-dai-foundation-board-during-ethcc-5/16290",
                        "https://forum.makerdao.com/t/announcing-maker-risk-dashboard-v3/16335",
                        "https://forum.makerdao.com/t/makerdao-actual-expenses-vs-budget-may-2022/16365",
                        "https://youtu.be/EdmJ1onA-20?t=661",
                        "https://forum.makerdao.com/t/informal-poll-disable-the-emergency-shutdown-module/16292",
                        "https://forum.makerdao.com/t/end-game-summary-part-3/16245",
                        "https://forum.makerdao.com/t/end-game-summary-part-4/16416",
                        "https://forum.makerdao.com/t/vault-discussion-nonsc-crypto-backed-loan-optionality/16312",
                        "https://youtu.be/EdmJ1onA-20?t=837",
                        "https://forum.makerdao.com/t/rethinking-psm-fees/16168",
                        "https://makerdao.world/en/learn/governance/module-psm/",
                        "https://youtu.be/EdmJ1onA-20?t=1112",
                        "https://youtu.be/EdmJ1onA-20?t=1341",
                        "https://youtu.be/EdmJ1onA-20?t=1661",
                        "https://youtu.be/EdmJ1onA-20?t=1878",
                        "https://youtu.be/EdmJ1onA-20?t=2133",
                        "https://youtu.be/EdmJ1onA-20?t=2360",
                        "https://youtu.be/EdmJ1onA-20?t=2485",
                        "https://youtu.be/EdmJ1onA-20?t=2533",
                        "https://youtu.be/EdmJ1onA-20?t=2633",
                        "https://youtu.be/EdmJ1onA-20?t=2785",
                        "https://youtu.be/EdmJ1onA-20?t=2882",
                        "https://youtu.be/EdmJ1onA-20?t=3006",
                        "https://youtu.be/EdmJ1onA-20?t=3297",
                        "https://youtu.be/EdmJ1onA-20?t=3403",
                        "https://youtu.be/EdmJ1onA-20?t=3557",
                        "https://youtu.be/EdmJ1onA-20?t=3921",
                        "https://youtu.be/EdmJ1onA-20?t=4135",
                        "https://youtu.be/EdmJ1onA-20?t=4327",
                        "https://youtu.be/EdmJ1onA-20?t=4574",
                        "https://youtu.be/EdmJ1onA-20?t=4668",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-july-2022/17038"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.640893658443932
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/governance-and-risk-200-thursday-july-21-at-17-00-utc/16736",
            "title": "Governance and Risk #200 - Thursday, July 21 at 17:00 UTC ",
            "index": 16736,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "2",
                    "time": "21/07/2022-12:34:35",
                    "content": " 200 f1920×442 28.6 KB   Disclaimer This communication is provided for information purposes only. The views and opinions expressed in this meeting are those of people involved and do not reflect the official policy or position of MakerDAO or any of its contributors, Core Units, or affiliates. This communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only and should not be relied upon as legal, business, investment, financial, or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only and do not constitute any recommendation for any action or an offer to provide investment, financial, or other advisory services.  Call Recording       Call Information The zoom waiting room will be on, and a password is set to: 748478; please ping us in the Maker Discord’s #governance channel if you aren’t let in from the waiting room. 2021-07-21T17:00:00Z  Video/Voice  Dial-in  Calls Calendar  Slides - updated before the call  Introduction   @GovAlpha-Core-Unit - Hosting, Introduction, Agenda.  @gov-comms-core-unit - Slides   Governance Round-Up   @GovAlpha-Core-Unit - Votes Recap  @MIP-Editors - MIPs Recap  @Artem_Gordon - Forum Recap   Initiative Updates  None Scheduled   Selected Discussions   AAVE Stablecoin GHO Implications What is the GHO stablecoin? Does this affect Maker? MKR Token Decentralization Views Forum Thread Ask us stuff  Anonymous question box   @Recognized-Delegates @Core-Facilitators ",
                    "links": [
                        "https://discord.gg/5uAJtzkK",
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://docs.google.com/presentation/d/1BU9Z_vzN-W7s-nU0iK1M-GZeehoL8rNBf2cdmHXEl8Q/edit?usp=sharing",
                        "https://governance.aave.com/t/introducing-gho/8730",
                        "https://forum.makerdao.com/t/mkr-token-decentralization-views/16617",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/6",
                        "https://forum.makerdao.com/t/relay-semanal-19-25-de-julio-del-2022/16925"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.387499999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#3",
                    "likes": "0",
                    "time": "22/07/2022-15:20:54",
                    "content": " Episode #200: July 21st, 2022 | Editorial Summary  Agenda   00:02: Introduction  03:06: Votes and Polls  04:11: MIPs Update  8:30: Weekly Forum Recap  13:00: Discussion: AAVE Stablecoin GHO Implications  43:03: Discussion: MKR Token Decentralization Views  1:22:47: Conclusion   Video Link  General Updates  Votes  Payton Rose  Polls: – 3:13 Executive Votes: – 3:37   MIPs  Pablo 4:10 Weekly MIPs Update #97  1208×813 35.6 KB     July’s Formal Submissions – 4:36   Proposals in RFC – 4:52   Special Purpose Fund – 5:31   Core Unit Budgets – 5:47   Core Unit Offboarding – 6:19   Facilitator Onboarding–6:58   Amendments – 7:10      Ratification Polls 2nd week is drawing close. Four days until they close on Monday, July 25st.   Weekly Forum Recap  Artem Gordon 8:30 Post: Weekly Forum Recap July 14st - 20st, 2022   News & Announcements:  Delegate Migration Call for Grant Applications    Signal Requests:  Reset Delegation Metrics for Hasu     Discussion  AAVE Stablecoin GHO Implications  Payton Rose 13:00   Payton: AAVE will launch its stablecoin, which could be a competitor to Dai. Their setup is going to be different with designated mentors they call facilitators. It won’t be as permissionless as the Maker system. However, there are several scenarios with similarities.  14:30   Raphael: I reached out to the guy who wrote the proposal at AAVE and asked them to present because they want to do a lot of bridge building with Maker. He said the relationship developer would come but turned in sick. He’s waiting to come on for another week if we still want that.  16:08   monet-supply: AAVE is the clear leader in liquidity markets across, not just in Ethereum but in most of the other EVM chains. Depending on how they set up their parameters, they could favor their stablecoin versus others. Dai has great support from AAVE right now, which has been helpful in Dai’s adoption across all these chains. We will need to consider the options if Dai starts to get iced out.  17:55   Tim: AAVE is committed to using Chainlink as their main Oracle. It’s one of the most compelling reasons I would not touch GHO, as opposed to Dai, which I use.   UltraSchuppi: We should all relax. USDC announced it launched at Consensus New York in 2018. At first, I was scared. However, if USDC did not launch, we would have difficulty defending the software or the hardware. We benefited from that centralized stablecoin. GHO will either be irrelevant or grow alongside us. We are not in a consolidation phase for stablecoins yet. This will take a couple of years until we will have real competition on that end. We should not be fearful.    21:19   Kianga: From a narrative standpoint, some people are reading this as maybe a weakness of MakerDAO. Other parties may see an opportunity to take market share or dominate. I have seen some sentiment on Twitter and indirect conversations that just the optics of it feel like a challenge. Does it reflect us losing our footing or struggling in certain areas that have been well publicized?   David: This is the business world; people are out for our market share. Dai is our core product. The level of alertness coming from the community is not overstated. The cross-chain L2 future that Maker and AAVE are pointing towards already operates on certain other layer twos and side chains. The GHO token could very easily be integrated into all their cross-chain activities. It can end up leading the way where Dai might not be leading.    25:00   Payton: How does Dai’s scaling tend to go with or against the general stablecoin market?..  27:56   Lucas: The main advantages I’ve seen in terms of how GHO can get market share are…  37:20   David: Back in the Foundation, the use case for Dai was manifesting well in South American markets. People liked using Dai when it was relatively cheaper to transact on layer one. People liked using it because it was a currency their government couldn’t arbitrarily just shut down. They were a little bit more sovereign. They could access financial services, like collateralized borrowing at a “risk-free rate” in the form of the DSR, on their smartphone. Then, the vision was to get people globally to financial tools digitally. Once L1 fees started going up, the entire retail market got priced out on both the usage and borrower side. Our product was completely blown up by layer one gas costs; that is why there’s such a huge emphasis on the multi-chain world. One of the truest uses for Dai lies within retail, emerging markets, and access to financial services that normally require an intermediary. Until we see a popular layer two networks emerge with much retail and organic user growth,  we should be heads down building.   Discussion  MKR Token Decentralization Views   Lyt 43:24  960×540 36.4 KB     MKR Token Decentralization: Wallets – 44:42   MKR Token Decentralization: Token Distribution – 58:41  Forum Post – MKR Token Decentralization Views    Q&A 45:59   Payton: Given the number of wallets comprising the top 20% of MKR tokens, it seems like without convincing a portion of the big holders to sell, it would be hard to get this number to increase. How do we impact this number?  47:21   Kianga: Did you analyze where all the supply is? Large holders might want to keep their MKR in a custodian instead of what is required to vote. Do we know what percentage is held by third-party custodians–such as Coinbase, that requires a technical fix in terms of participation–? Do we have the big picture of this subset relevant to the whole ecosystem of wallets held in institutions?  48:30   Kianga: Someone commented on the Forum or Discord that Coinbase said that by Q4, they would start working towards enabling custody MKR to participate in governance. Has anyone on this call been part of those conversations? Can anyone comment on the details?  1:00:42  Slide – MKR Token Distribution  960×540 91.4 KB     Kianga: Can anybody else share how they are interpreting this data and its significance? I look at this, and I can see what it is saying to me, but I am trying to make an association with what it means.    Kianga previously referred–57:37–to the reading of data and the importance of the spoken word when understanding the nuances of these graphic charts.   1:02:03   Raphael:  Voter behavior is more interesting to me, and I did not see it addressed in this analysis. There will always be power laws in everything that can be traded financially; that is unavoidable, but how does it affect governance? In terms of decentralization, that is where the rubber meets the road.  1:03:47   Kianga: We keep ruminating on the same questions: How do we get more governance participation? In what ways? What are the limitations of that, and how can we address them? Analyzing the data is key, as well as defining our limit.  1:07:13   Raphael: There is no easy answer to this, but the fundamental question is: how do you incentivize participation? Maybe you have to pay for voting, but that patch could open up a new world of problems. I think it is something that we definitely should think about and experiment with. Also: I believe the way we do things at the moment is not set in stone.  1:12:00   Speakers: Continue to talk about different approaches to incentivizing participation.   1:14:27   Chris: There seems to be a pattern with the G&R Calls: at the time of Episode 100th, we struggled with this insatiable DAI demand. We did not have a PSM yet, or any way of dealing with this. At the end of that call, I said: “This is a great problem to have. Many startups would die to have this level of demand. This is an opportunity or a problem that is an opportunity”. And now we are in the same situation, only a 100 episodes later, two years after.  1:17:18   Chris: Continues to talk about the crisis in governance and the future of MakerDAO in the next two years.   1:21:41   MakerMan: Continues to talk about the crisis in governance and the future of MakerDAO in the next two years.    Conclusion  Payton Rose 1:22:47  Happy 200th G&R Meeting, everyone, and happy birthday, @MakerMan!   Suggestion Box  Credits   @Sol_Invictus produced this summary.  @Larryag produced this summary. Artem Gordon produced this summary. Everyone who spoke and presented on the call.  ",
                    "links": [
                        "https://youtu.be/3f4CghsTxOE?t=186",
                        "https://youtu.be/3f4CghsTxOE?t=251",
                        "https://youtu.be/3f4CghsTxOE?t=510",
                        "https://youtu.be/3f4CghsTxOE?t=780",
                        "https://youtu.be/3f4CghsTxOE?t=2584",
                        "https://youtu.be/3f4CghsTxOE?t=4967",
                        "https://www.youtube.com/watch?v=3f4CghsTxOE&t=3s",
                        "https://youtu.be/3f4CghsTxOE?t=193",
                        "https://youtu.be/3f4CghsTxOE?t=217",
                        "https://youtu.be/3f4CghsTxOE?t=250",
                        "https://forum.makerdao.com/t/weekly-mips-update-97/16816",
                        "https://youtu.be/3f4CghsTxOE?t=276",
                        "https://youtu.be/3f4CghsTxOE?t=292",
                        "https://youtu.be/3f4CghsTxOE?t=331",
                        "https://youtu.be/3f4CghsTxOE?t=347",
                        "https://youtu.be/3f4CghsTxOE?t=379",
                        "https://youtu.be/3f4CghsTxOE?t=418",
                        "https://youtu.be/3f4CghsTxOE?t=430",
                        "https://youtu.be/3f4CghsTxOE?t=509",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/6",
                        "https://forum.makerdao.com/t/announcement-delegate-migration/16603",
                        "https://forum.makerdao.com/t/call-for-grant-applications-the-relationship-between-daos-and-their-intangible-assets-and-ip/16709",
                        "https://forum.makerdao.com/t/signal-request-reset-delegation-metrics-for-hasu/16533",
                        "https://youtu.be/3f4CghsTxOE?t=780",
                        "https://youtu.be/3f4CghsTxOE?t=870",
                        "https://youtu.be/3f4CghsTxOE?t=968",
                        "https://youtu.be/3f4CghsTxOE?t=1075",
                        "https://youtu.be/3f4CghsTxOE?t=1279",
                        "https://youtu.be/3f4CghsTxOE?t=1500",
                        "https://youtu.be/3f4CghsTxOE?t=1676",
                        "https://youtu.be/3f4CghsTxOE?t=2240",
                        "https://youtu.be/3f4CghsTxOE?t=2584",
                        "https://youtu.be/3f4CghsTxOE?t=2604",
                        "https://youtu.be/3f4CghsTxOE?t=2682",
                        "https://youtu.be/3f4CghsTxOE?t=3521",
                        "https://forum.makerdao.com/t/mkr-token-decentralization-views/16617",
                        "https://youtu.be/3f4CghsTxOE?t=2759",
                        "https://youtu.be/3f4CghsTxOE?t=2841",
                        "https://youtu.be/3f4CghsTxOE?t=2910",
                        "https://youtu.be/3f4CghsTxOE?t=3602",
                        "https://youtu.be/3f4CghsTxOE?t=3457",
                        "https://youtu.be/3f4CghsTxOE?t=3723",
                        "https://youtu.be/3f4CghsTxOE?t=3827",
                        "https://youtu.be/3f4CghsTxOE?t=4033",
                        "https://youtu.be/3f4CghsTxOE?t=4320",
                        "https://youtu.be/3f4CghsTxOE?t=4467",
                        "https://youtu.be/3f4CghsTxOE?t=4638",
                        "https://youtu.be/3f4CghsTxOE?t=4901",
                        "https://youtu.be/3f4CghsTxOE?t=4967",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-july-2022/17038"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.746678816075368
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/governance-and-risk-201-thursday-july-28-at-17-00-utc/16859",
            "title": "Governance and Risk #201 - Thursday, July 28 at 17:00 UTC ",
            "index": 16859,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "1",
                    "time": "27/07/2022-18:44:05",
                    "content": " gr-meeting-purp1920×442 24.2 KB   Disclaimer This communication is provided for information purposes only. The views and opinions expressed in this meeting are those of people involved and do not reflect the official policy or position of MakerDAO or any of its contributors, Core Units, or affiliates. This communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only and should not be relied upon as legal, business, investment, financial, or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only and do not constitute any recommendation for any action or an offer to provide investment, financial, or other advisory services.  Call Recording       Call Information The zoom waiting room will be on, and a password is set to: 748478; please ping us in the Maker Discord’s #governance channel if you aren’t let in from the waiting room. 2021-07-28T17:00:00Z  Video/Voice  Dial-in  Calls Calendar  Slides - updated before the call  Introduction   @GovAlpha-Core-Unit - Hosting, Introduction, Agenda.  @gov-comms-core-unit - Slides   Governance Round-Up   @GovAlpha-Core-Unit - Votes Recap  @MIP-Editors - MIPs Recap  @Artem_Gordon - Forum Recap   Initiative Updates  No live updates Below are published updates from this week RWF Short Update - All work for onboarding of SocGen/OFH and HVBank is completed. Maker Brand Update - June + July 2022 MakerDAO Blog Update & Discussion Growth Update: North America   Selected Discussions   [SIGNAL REQUEST] Budget Re-allocation & Core Unit Accountability Framework Should the DAO use a broad-based cut or tactical reallocation process to adjust budgets? Ask us stuff  Anonymous question box   @Recognized-Delegates @Core-Facilitators ",
                    "links": [
                        "https://discord.gg/5uAJtzkK",
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://docs.google.com/presentation/d/1NDpDQgyGPJoAcLGOaNkM9FDdrwBOko40KJdMhJdxQrM/edit?usp=sharing",
                        "https://forum.makerdao.com/t/short-take-exciting-news-and-opportunity-for-rwa-teams/16849",
                        "https://forum.makerdao.com/t/maker-brand-update-june-july-2022/16858",
                        "https://forum.makerdao.com/t/makerdao-blog-update-discussion/16829",
                        "https://forum.makerdao.com/t/growth-update-north-america/16702/2",
                        "https://forum.makerdao.com/t/signal-request-budget-re-allocation-core-unit-accountability-framework/16788/8",
                        "https://app.suggestionox.com/r/GovCallQs"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.294507575757575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/07/2022-14:24:31",
                    "content": " Episode #201: July 28th, 2022 | Editorial Summary  Agenda   00:00: Introduction  02:32: Votes and Polls  04:29: MIPs Update  08:48: Weekly Forum Recap  13:33: Discussion: Budget Re-allocation & Core Unit Accountability Framework  27:06: Discussion: Q&A  1:05:35: Conclusion   Video Link  General Updates  Votes  Payton Rose  Polls: – 2:32 Executive Votes: – 3:05   MIPs  Pablo 4:29 Weekly MIPs Update #97  1208×813 35.6 KB    July’s Formal Submissions – 4:34   Proposals in RFC – 4:53   Core Unit Budgets – 5:44   Core Unit Offboarding – 6:21   Facilitator Onboarding – 6:45   Amendments – 7:09   Special Purpose Fund – 7:49      Important Dates:  The August FSW opens on Monday 1. August Ratification Polls will go up on Monday 8.    Weekly Forum Recap  Artem Gordon 8:48 Post: Weekly Forum Recap July 21st - 27th, 2022   News & Announcements:  Codeknight Delegate Platform Short take: Exciting news and opportunity for RWA teams  Short take: return of excess funds (~2M DAI)]    Signal Requests:  [SIGNAL REQUEST] Budget Re-allocation & Core Unit Accountability Framework     Discussion  Budget Re-allocation & Core Unit Accountability Framework  Thomas Flitter 13:33  Budget Re-allocation &amp; Core Unit Accountability Framework1920×1069 103 KB   Our discussion segment today will be on the Signal Request for the Budget Re-allocation & Core Unit Accountability Framework. Our special guest is Pipco with the Strategic Finance Core Unit, and he will present their information.  14:08   Pipko: This is an update to the presentation we gave last week on the Signal Request, about Core Unit accountability, etc.   Legal Disclaimer &amp; Preliminary Notes1920×1071 321 KB   Agenda1920×1068 117 KB   Today&#39;s Financial Position1920×1069 190 KB   Paths forward to meet MKR holder expectations1920×1070 233 KB   Option 2: Recommended Action Plan1920×1061 302 KB   Option 2: Benefits of Proposed Budget Allocation Process1920×1064 315 KB   Option 2: Concerns and Mitigants to Proposed Process1920×1063 242 KB   Proposed Budgeting Process1920×1060 289 KB   Key Performance Indicators (KPIs) for Core Units1920×1061 212 KB   Example: Budget Ask &amp; KPI Proposal1920×1062 299 KB   Example: KPI Evaluation &amp; Attainment1920×1061 217 KB   Discussion  Q&A 27:06   David Utrobin: If this were to pass and this framework was to be adopted, does that mean that it would be one ultimate budget proposal at the end, and the delegates would take the individual for a unit proposal? And combine them all into one big proposal? And then also, with 20 core units, like the way that the framework is proposed, it seems very heavy because those 24 units have to put up their budgets. Then, they have to get a response from the SF delegates and whoever is working on the counter budget proposals, and there are supposed to be multiple counter budget proposals for each team. Some comments on whether I understand that would be great.  32:28   Eric: I think it is an excellent set of KPI initiatives. You need to set the KPIs realistically or sensibly to get the behavior you want. You want to try to focus on things under your control, and the KPI is that you want to look at perverse behavior. However, when you are doing KPIs, which will be a challenge, they need to be considered carefully. What do people control? Moreover, what are the adverse side effects you could get from them? This would require expertise in ensuring these KPIs are what Maker wants; I think they are great, but it is hard to do this well, particularly in the centralized world.  35:29   Someone: Typically, KPIs get assessed on maybe a monthly or quarterly basis. How would we envision doing it? Do we set the KPIs in August or October? Do we have a meeting monthly or two to discuss where everyone is at on their KPIs? How is that going envisioned?  38:21   Sebastien Deveraux: What I liked is that it puts you under pressure. We deliver something, though; the fact of not achieving it is not the end of the day. In the end, people can say well; you did not achieve it; you should be fired. At least you have something to discuss. Otherwise, I have no idea what people are forecasting to do. Achieving to do, and so there is no discussion. I think it should be with a social wrapper to say, well, we have numbers but numbers on KPIs and not representing everything now just in basis for discussion, because I am not sure that are linked to many implications for cabinet. No one is fired because you are below 20% or something like that.  40:44   ElPro: If you think about what had been KPI is for every single DeFi platform, protocol. Has it been TVL? That is pretty much it. TVL and how much Dai is outstanding? How much fracks is exceptional? How many wallets are holding Dai? I think it is less than a million. How many stablecoins are being held by wallets? There are things I agree with and don’t agree with, but I think web3 needs this, and I think Maker DAO is the leading governance platform that can bring this into the Defi into the ecosystem. We should at least give it a shot; if it does not work out, then let us automate it down the road. We are writing the playbook here of governance.  48:15   CodeKnight: Could you share the overarching KPIs?  51:23   CodeKnight: Is there a path you see where maybe there is a hybrid approach, like you either choose some straight percentage cut to your CU? Or do you follow this KPI model? Do we see a hybrid approach here that is viable?  54:24   Robert: When I look at the effectiveness of a proposed solution, we are walking into this with three areas: what we know, and this is what I will call the agreeable truth. Then we also look at the alignment that we have. Not necessarily agreement, but alignment on, more of strategic goals, objectives, all of that.   Conclusion  Payton Rose 1:05:35 … 1:06:34   MakerMan: My point is pretty simple, you will do all these KPIs; it will cost effort, and you have to add for every effort that you do, you have to look at some return. Many people judge that monetarily; you can judge it maybe as a long term, you can judge it as an efficiency thing, which will hit the bottom line. You ask a basic question; we will make a move; how much is it going to cost us? What do we expect as a return? How are we going to measure it? I always return to that every time and do not see answers; here are many of them.  Suggestion Box  Credits  Kunfu-po produced this summary. Andrea Suarez produced this summary. Everyone who spoke and presented on the call.  ",
                    "links": [
                        "https://youtu.be/ADYHWUbFUKw?t=152",
                        "https://youtu.be/ADYHWUbFUKw?t=269",
                        "https://youtu.be/ADYHWUbFUKw?t=528",
                        "https://youtu.be/ADYHWUbFUKw?t=1626",
                        "https://youtu.be/ADYHWUbFUKw?t=3935",
                        "https://youtu.be/ADYHWUbFUKw",
                        "https://youtu.be/ADYHWUbFUKw?t=152",
                        "https://youtu.be/ADYHWUbFUKw?t=185",
                        "https://youtu.be/ADYHWUbFUKw?t=269",
                        "https://forum.makerdao.com/t/weekly-mips-update-97/16816",
                        "https://youtu.be/ADYHWUbFUKw?t=274",
                        "https://youtu.be/ADYHWUbFUKw?t=293",
                        "https://youtu.be/ADYHWUbFUKw?t=344",
                        "https://youtu.be/ADYHWUbFUKw?t=381",
                        "https://youtu.be/ADYHWUbFUKw?t=405",
                        "https://youtu.be/ADYHWUbFUKw?t=429",
                        "https://youtu.be/ADYHWUbFUKw?t=469",
                        "https://youtu.be/ADYHWUbFUKw?t=528",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247",
                        "https://youtu.be/ADYHWUbFUKw?t=574",
                        "https://youtu.be/ADYHWUbFUKw?t=618",
                        "https://youtu.be/ADYHWUbFUKw?t=651",
                        "https://youtu.be/ADYHWUbFUKw?t=670",
                        "https://youtu.be/ADYHWUbFUKw?t=813",
                        "https://youtu.be/ADYHWUbFUKw?t=848",
                        "https://youtu.be/ADYHWUbFUKw?t=1626",
                        "https://youtu.be/ADYHWUbFUKw?t=1948",
                        "https://youtu.be/ADYHWUbFUKw?t=2129",
                        "https://youtu.be/ADYHWUbFUKw?t=2301",
                        "https://youtu.be/ADYHWUbFUKw?t=2444",
                        "https://youtu.be/ADYHWUbFUKw?t=2895",
                        "https://youtu.be/ADYHWUbFUKw?t=3083",
                        "https://youtu.be/ADYHWUbFUKw?t=3264",
                        "https://youtu.be/ADYHWUbFUKw?t=3935",
                        "https://youtu.be/ADYHWUbFUKw?t=3991",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-july-2022/17038"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.780730021893815
                }
            ]
        }
    ],
    "group_index": "1375"
}