{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/why-is-dgd-a-potential-collateral-type-instead-of-dgx/170",
            "title": "Why is DGD a potential collateral type instead of DGX? ",
            "index": 170,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "collateral-onboard"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MicahZoltu",
                    "index": "#1",
                    "likes": "2",
                    "time": "24/07/2019-05:53:44",
                    "content": "DGD is a governance token, which IMO has little to no intrinsic value.  DGX is a custodial gold IOU, which should be valued at the price of gold * risk of centralized default/seizure/theft.  DGD makes a terrible collateral type IMO while DGX at least has an argument that it is valuable (though, I am dubious on the risk profile being worth it). ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.515625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kwadrax",
                    "index": "#2",
                    "likes": "3",
                    "time": "24/07/2019-10:16:58",
                    "content": "DGX is apparently one of the technically more challenging tokens to incorporate. @rune talked about it on chat recently: https://chat.makerdao.com/channel/general?msg=8tHSH32t43Fm35DAD  Also something that’s important to keep in mind is that the test collaterals that are available as candidates for launch collateral, were chosen mainly with technical considerations in mind   the big issue with DGX is that it is an incredibly complicated token, and while it will be up to MKR governance to decide how to prioritize collateral inclusion post-launch, the fact that DGX will take as much time as many other more standard tokens needs to be considered. Same goes for tokens like USDC with backdoors. As always, all legit and non-scam tokens should eventually be included in the collateral portfolio since that is the best outcome for diversification and dai stability. It’s a matter of when it gets included and which risk parameters it gets by the risk framework, not whether it will be included at all  Digix confirmed, can’t find the link anywhere now, they are working with Maker to get DGX in MCD eventually. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.108796296296296
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kwadrax",
                    "index": "#3",
                    "likes": "2",
                    "time": "27/07/2019-18:21:58",
                    "content": "Additional comment from Wouter:     Meta: Coordinating Collateral Due Diligence Collateral Discussion       This has probably been mentioned elsewhere, but there are two reasons for the initial token selection:    The list has been compiled quite some time ago mostly on a strictly technical basis, as in: which tokens play well with the MCD collateral assumptions from a strict software-technical point of view? For example: does the token contract implement standard ERC20 behavior? From this perspective, DGX is a complicated contract that requires significant technical analysis, DGD is not. To further n…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.138888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aviv_Milner",
                    "index": "#4",
                    "likes": "1",
                    "time": "28/07/2019-20:06:32",
                    "content": "I agree with you entirely @MicahZoltu - having DGX (a gold backed token) at least makes some sense. Using the governance token that allegedly backs the gold token does not make a lot of sense to me. My largest concerns:  A DAO token might need to move to another token (example old vs new MKR token) and this would create additional risks. Any token that is used for voting presents a risk to the DAO itself. DGD is currently sitting at 40 million USD market cap - which means even if a crazy 10% of all DGD tokens were locked in MKR, this would do nearly nothing for the market cap of Dai. DGD has lost 96% of it’s value against Bitcoin in the past 16 months. It has lost a similar amount against ETH  In summary - DGD is not liquid, not stable, not likely to grow in value and remain successful, not large enough (by market cap) and not worth the complex risks for the tiny reward. I am strongly against adding this token, and I would recommend that we wait and see if the Digix DAO is still active and safe and well managed before we add it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.019805194805195
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MicahZoltu",
                    "index": "#5",
                    "likes": "1",
                    "time": "29/07/2019-05:15:25",
                    "content": "While I’m against useless/governance tokens as collateral generally speaking (like DGD), I do think it is important to keep in mind that collateral tokens do not need to increase in value to be useful as a collateral token.  Really they just need to not flash crash (faster than liquidations can happen). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1875
                }
            ]
        }
    ]
}