{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-internal-process-changes/15975",
            "title": "GovAlpha Internal Process Changes ",
            "index": 15975,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "meta-governance",
                "gov-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "7",
                    "time": "22/06/2022-14:25:39",
                    "content": "Following criticism of recent decisions made by the GovAlpha Core Unit, we have internally reviewed how we will approach communication moving forward. While we disagree with some of the individual points raised, we accept that there was some confusion around recent simultaneous votes in the weekly and monthly cycles. We are also aware of general governance fatigue and forum overload. Please bear in mind that ultimately the governance process is in the control of MKR holders. As per MIP0c10 and our mandate, GovAlpha will apply Governance Processes as ratified by MKR holders. If new processes or changes are voted through the MIP process, we will apply them too. Unfortunately, it is impossible to satisfy everyone all the time, and not everyone will agree with the processes we are compelled to apply. If there is a process you don’t like or something new you would like to see, it is most productive to approach us on Discord or the Forum to ask about alternative options. We will be happy to advise the best way to go about making changes or proposals. We will make the following changes to our workflows, which will increase the workload of the Core Unit, but we hope it will make things more transparent for Governance participants:  We will continue to allow SRs as trials of yet-to-be approved MIPs. We believe this is a valuable tool for MIP Authors and Governance when assessing MIPs that can identify edge-cases, see Delegate Compensation and its iterations before MIP submission (1, 2, 3, 4). However, to avoid confusion, we will no longer allow trials due to Signal Requests and top-level MIPs to be polled simultaneously. This may result in us delaying the ratification of a top-level MIP until the following month’s governance cycle, in communication with the proposal’s author(s). Under every post that will lead to an on-chain governance action (Signal Request/MIP/PPG proposal/Facilitator proposal, etc.), GovAlpha will post a summary of our interpretation of its effects. Example here. As per our mandate, this will remain neutral where necessary but will explain steps relating to the Governance process.  Note, as per our mandate, GovAlpha will continue to voice opinions on proposals that seek to change Governance processes or structures.   We will dedicate resources to developing an automated opt-in notification system for posts/proposals that are given High and Medium Impact tags on the forum. We have already reached out to Recognized Delegates regarding this, but any solution(s) will be open to the Community to utilize.  In the meantime, please be aware there are already several tools that can assist in navigating the governance forum and processes at MakerDAO, including:   GovAlpha Office Hours every Monday at 17:00 UTC - Zoom link here, come and ask us about governance processes or any other questions you may have.  The Forum Explorer - introduced here, accessed here - allows customisable filter views of forum topics for easier reading. If you need help setting up specific views, please contact us in the #govalpha-public discord channel.  Example filter that displays all posts in the Signal Requests, MIP RFC, and MIP Formal Submission categories here     The Governance Tracker - spreadsheet here, dashboard here - tracks ongoing and pending on-chain and off-chain votes, executive proposals, informal polls, MIPs, discussions, and more.  Category-based notifications - you can set alerts to get notifications of new posts in forum categories or sub-categories by clicking the notification icon - screenshot below. Similarly, you can mute categories, which will no longer appear in your ‘Latest’ feed.  1431×515 50.1 KB    Topic-based notifications - you can set alerts to get notifications of new replies within a topic of interest by clicking the notification icon - screenshot below    ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP39c2SP3",
                        "https://vote.makerdao.com/polling/QmNf5pe9",
                        "https://vote.makerdao.com/polling/QmbKaHAv",
                        "https://vote.makerdao.com/polling/QmbvuhYH",
                        "https://vote.makerdao.com/polling/QmPCbBu3",
                        "https://forum.makerdao.com/t/signal-request-repeal-poll-id-827-deployment-of-a-permissionless-open-market-operation-trial/15945/2",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/82603350722?pwd%3DRThleVo5QlBRT1FuOWxiRCs3K0k2Zz09&sa=D&source=calendar&usd=2&usg=AOvVaw12bIz32M-F-z3SWroHngF4",
                        "https://forum.makerdao.com/t/introducing-forum-explorer/14384",
                        "https://forum.makerdao.com/explorer",
                        "https://forum.makerdao.com/explorer?category=15%2C16%2C25&tags=",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://www.makerdao-governance-dashboard.com/",
                        "https://forum.makerdao.com/t/signal-request-weather-proofing-existing-rwa-vaults-against-market-conditions/15859/13",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-16-22-2022/15999",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-16-22-de-junio-del-2022/16204"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6836754643206255
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#2",
                    "likes": "1",
                    "time": "23/06/2022-03:59:29",
                    "content": "    Patrick_J:  However, to avoid confusion, we will no longer allow trials due to Signal Requests and top-level MIPs to be polled simultaneously. This may result in us delaying the ratification of a top-level MIP until the following month’s governance cycle, in communication with the proposal’s author(s).   Why delay the MIP and not the trial? I guess trials are assumed to be more time sensitive? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.59375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#3",
                    "likes": "0",
                    "time": "23/06/2022-09:18:04",
                    "content": "Good question. The use of the word “may” was doing the heavy work here but this could have been clearer. Logically, if someone wants to trial their MIP, it makes sense for them to submit the trial first and delay the MIP so that they may incorporate feedback in the MIP itself. Equally, there’s nothing stopping them from opting to go ahead with the MIP and scrapping the plans for a trial. However, delaying the trial to allow the MIP to go to voting would not be productive, as the MIP would already be passed in that instance, so a trial would have limited value in terms of providing feedback on the proposal or on informing voters. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8061224489795915
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "3",
                    "time": "23/06/2022-10:47:28",
                    "content": "    Patrick_J:  Topic-based notifications - you can set alerts to get notifications of new replies within a topic of interest by clicking the notification icon - screenshot below   Sidenote, discourse supports rss feeds on basically any URL. If you want to receive updates via rss for a category, thread or topic, you can do so by appending .rss to the URL like so: GovAlpha Internal Process Changes ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "21/09/2022-10:48:26",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}