{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/transparency-makerdao-validator-of-xdai-blockchain/4659",
            "title": "Transparency - MakerDAO Validator of xDai Blockchain ",
            "index": 4659,
            "category": [
                "Governance"
            ],
            "tags": [
                "xdai"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#1",
                    "likes": "15",
                    "time": "08/10/2020-19:59:25",
                    "content": "Quick infos about xDAI: The xDai blockchain, which I am experimenting a bit with recently, is basically like Ethereum but with:  PoS (Proof of Stake) instead of PoW xDAI instead of ETH as native gas-currency.  More informations here: https://www.xdaichain.com/ Currently, the Validators (the actors participating in the Proof of Stake) are the 12 entities listed here: https://validators.poa.network/poa-dapps-validators  Fact: MakerDAO is a Validator. I have some questions: Question 1) Mariano Conti was the responsible of MakerDAO’s validator. However he has now left. Who is the new responsible now? Question 2) As a validator, MakerDAO currently has 20.000 STAKE tokens (current market value of ~200k usd). Are these tokens property of MakerDAO or of The Foundation? Question 3) As in PoS, the validators will be compensated for blocks creation. Are the profits going to MakerDAO or The Foundation? Question 4) If (as I hope) the answers to (2,3) abovre were “MakerDAO”, what is the current infrastructure cost? I guess the governance should discuss if they want to devote part of the SF to maintain it, etc. Question (4) above is of interests to all the xDAI delegators (stakers that decide to put their stake on some validator) interesting in staking MakerDAO’s validator. They are incentivised to bet on well-kept validators (~99.99% uptime, etc). More generally, I think with all DeFi project spawning here and there, it might well be the case that MakerDAO has or will have Tokens/Assets/‘Stake in the game’ of other projects. Quesiton 5) How can we manage these assets in the most efficient and transparent way? Something like an Aragon DAO? It’s a pretty interesting topic. ",
                    "links": [
                        "https://validators.poa.network/poa-dapps-validators",
                        "https://forum.makerdao.com/t/discussion-how-to-reduce-fees-in-mcd/5863/6"
                    ],
                    "GPT-summary": "The post is asking questions about MakerDAO's role as a validator on the xDai blockchain, including who is responsible for MakerDAO's validator, who owns the STAKE tokens, who receives the profits from block creation, and how to manage assets in the most efficient and transparent way. The post also discusses the importance of well-kept validators for xDAI delegators.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.786174242424242
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#2",
                    "likes": "1",
                    "time": "13/10/2020-07:26:37",
                    "content": "UP for visibility. UP again. If you know somebody who could answer the questions, please let them know about this thread. Thanks. UP again again. Remark: This post has been upvoted by several people and still is unanswered. Looking at MakerDAO as a young Startup, 2 weeks (and still waiting) seems a bit of a long time to receive answers to some ‘administrative’ questions. What can we do to improve this level of inefficiency? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.15
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#3",
                    "likes": "1",
                    "time": "22/10/2020-10:22:45",
                    "content": "Hi, @iammeeoh. I think this is an interesting topic indeed. Just to add some nuances to your comments, especially:     iammeeoh:  Looking at MakerDAO as a young Startup, 2 weeks (and still waiting) seems a bit of a long time to receive answers to some ‘administrative’ questions. What can we do to improve this level of inefficiency?   MakerDAO is gradually decentralizing, so it’s important to differentiate between topics or projects that were fully driven by the Maker Foundation to the transition to the DAO. Going back to your thread, I think that there are different topics that are packed into the same post and this might be diluting its message (and hindering people from finding it and reacting to it). MakerDAO’s validator: is Mariano still it? If I were you, I would reach out to him directly. He’s quite nice and usually happy to help / direct you towards the right people. cc: @Mariano_Conti ; @nanexcool  (not sure if he’s still active in this forum, but you won’t have trouble finding him on the major platforms). xDai Chain: I’m experimenting with it, and I was curious about the costs/benefits/etc. I’m not sure who could be of help regarding that. But a more general statement might improve the reach? If the DAO holds different assets, how can we manage these in a more efficient and transparent way? An interesting topic to discuss. I would love to see that smart people in this forum react to that. Hope it helps, and that you don’t compare the DAO to a startup with a bunch of CSRs running to answer all the forum threads. ; ) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.829475308641976
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#4",
                    "likes": "1",
                    "time": "22/10/2020-11:31:00",
                    "content": "Thanks for your answer! Regarding some of your points: (Point 1)     juan:  MakerDAO is gradually decentralizing, so it’s important to differentiate between topics or projects that were fully driven by the Maker Foundation to the transition to the DAO.   Absolutely right. At the same time there has been, from the very beginning, a misuse of the “MakerDAO” word by the Foundation. So we have a number of projects labeled as MakerDAO on which the DAO currently has no role/responsibility/control/etc. This xDAI Validator is one example. So perhaps, in due time and without any rush, we can improve on that with the help of everybody. (Point 2)  If I were you, I would reach out to him directly. He’s quite nice and usually happy to help / direct you towards the right people. cc: @Mariano_Conti ; @nanexcool  I did write in the official chat in the #dev channel, and @Mariano_Conti kindly answered with: mariano.conti October 8, 2020 9:57 PM. Yeah I pushed for running a validator right around devcon4 but didn’t provide more infos. In any case I left there the link (for everybody to read) to this forum post. So Mariano should be able to reach this thread, if/when He has time to do so. At the same time, I am interested in the answers but I also want to keep the discussion public, for the whole DAO members to read, so I like more a transparent discussion on the Forum. (Point 3)  xDai Chain: I’m experimenting with it, and I was curious about the costs/benefits/etc. I’m not sure who could be of help regarding that. But a more general statement might improve the reach?  I am not sure I understand this specific suggestion. I just wrote: I’m experimenting with it, and this was just a fact, not a question. But I agree that this post has a lot of questions/infos, so it might be not the easiest to read/intervene to, as you suggested. Thanks for your remark. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.855357142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#5",
                    "likes": "4",
                    "time": "22/10/2020-16:08:05",
                    "content": "Hi @iammeeoh Thank you for posting, and for your interest in the xDai chain. I will try to clarify a few points. Mariano was originally running the validator, but transferred the responsibility to the Maker Foundation’s tech ops team. So to answer your first question, that team has run an xDai chain validator, and has been doing so since early on to support bootstrapping the xDai network. Therefore the validator should be reported on as being run by the Maker Foundation rather than MakerDAO to make that delineation more clear. I have reached out to the xDai chain team to change this in their documentation. The xDai chain has over the years gone through a few upgrades, and some of the planned ones for the future, as you note, relates to the change of consensus mechanism, which is being rolled out through multiple phases. However as stated in the documentation here the initial validators, which includes the Maker Foundation, cannot withdraw their allocated STAKE. The allocation of the 20.000 STAKE for 13 validators (260.000 STAKE) was sent to the 0x0 address upon the network upgrade as seen here, so it is effectively burned, and can never be retrieved. So to answer your second question, the Maker Foundation does not have access to 20.000 STAKE. So the TL;DR is: The Maker Foundation is running the xDai validator, but cannot withdraw 20k STAKE - it has been burned upon inception. ",
                    "links": [
                        "https://etherscan.io/tx/0x3f2d3f6e0aa85b5023a550b50d527e068fdf0c9a0a73d6379fd3d29e2e9395a6"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving informative response to proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.635416666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#6",
                    "likes": "0",
                    "time": "22/10/2020-16:34:21",
                    "content": "Thanks a loto @lollike for the answer! There are a couple of questions/curiosities from my original post, namely Question 3:  As in PoS, the validators will be compensated for blocks creation. Are the  profits going to MakerDAO or The Foundation?  and Question 4. Furthermore, from the link you provided (xDAI documentation) I read:  However, an original validator may negotiate to sell their spot to a new validator, and that new validator will then inherit the original 20K staking allotment.  So I guess the question that naturally emerges is the following: Q: does the Foundation eventually plan to give (for the lack of a better word) the operation of the Validator to MakerDAO? If xDAI grows exponentially, having a validator might become an interesting source of revenue for MakerDAO.  And similarly, the “validator role”, than can be sold, might accrue a serious value. Thanks again! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.024766899766901
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#7",
                    "likes": "0",
                    "time": "23/10/2020-14:57:57",
                    "content": "XDAI looks very interesting! I think it is great that they are using DAI as the native gas-currency.  I created an account over there when they first started up and haven’t really used it much since, but if Ethereum gas fees get out of hand again or the XDAI ecosystem develops into a larger playground I would surely be back.  Happy to hear that MakerDAO is still supporting this and that the tech-ops team is now in charge of the validator over there.  Good to show support to communities embracing DAI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.0062500000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#8",
                    "likes": "0",
                    "time": "04/11/2020-14:23:43",
                    "content": "UP.  Some questions still open. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nanexcool",
                    "index": "#9",
                    "likes": "12",
                    "time": "16/11/2020-05:13:23",
                    "content": "Hi everyone! Mariano here. I’d like to take over (or back) the xDai Validator and run it officially. Back in late 2018 during Devcon 4 in Prague, I chased Igor Barinov all over the conference to have Maker Foundation run a validator for xDai. I knew back then that the idea and tech were great. I discussed internally with some folks from the Foundation but there was not a lot of interest. So I said I would run it myself with the hopes that more people would see the use later on. Initially I ran it for months, having done the key ceremony and being accepted as a validator. I believe I was the 4th or 5th validator added. Once xDai started getting traction, it was agreed internally within the Foundation that this had been a good idea! Now, juggling my work as Head of Smart Contracts and running the validator was not impossible, but given that the Foundation had a DevOps team, I decided to turn over the task to them. So I handed over the keys and AWS instance and they’ve been running it since. I believe I’m properly fit to continue running it and again putting myself forward for the task. Open to any questions anyone has. Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.8820684523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#10",
                    "likes": "4",
                    "time": "16/11/2020-08:56:40",
                    "content": "Hi Mariano,     nanexcool:  Once xDai started getting traction, it was agreed internally within the Foundation that this had been a good idea!   thanks for telling us this story. It was a good idea indeed, congratulations!      nanexcool:  I believe I’m properly fit to continue running it and again putting myself forward for the task. Open to any questions anyone has.   Yes, I personally think this would be a good idea! Perhaps even better would be to form a new xDAI working group of which, to begin with, you could be one of the few or the only member. (Perhaps in the future, further dynamics between MakerDAO and xDAI could emerge). The Governance has been recently discussing a lot on how to reward people/working Groups, etc. and we have a MIP ready for this. So we might be able to provide money for the expenses (e.g., AWS server that you mentioned). I have some questions: Q1) Continuing on the line of the initial questions of this thread: I understand correctly from your post that the validator node and its rewards can be considered property of MakerDAO, as opposed of the Foundation? Q2) How do you plan to decentralise (from you) as much as possible the Maker validator node? For example, how do you plan to deal with the rewards/tokens received from the Network, Staking etc? What about the management of the private keys? What if other people join the “xDAI working group” and need to share with you these secrets? Etc. The question of course also includes things like transparency (towards the MakerDAO governance), etc. Q3) due to Ethereum fees, the minimum dust/vault-size is currently set to 100usd and it could increase over time. Do you think xDAI-Network could provide some useful options for providing MakerDAO services to the less rich? In other words [and more generally]: do you see the possibility of bridging some of the functionalities of MakerDAO to xDAI as a concrete possibility? EDIT: if the reactions to the creation of a “xDAI working group” here are positive, I could try (if nobody else wants to, of course) to run the Governance procedure to create it  I might be a bit  since I haven’t pushed any proposals so far. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.866965105601469
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "2",
                    "time": "16/11/2020-10:47:05",
                    "content": "Hey Mariano, appreciate the history, that clears up many of my questions. Having you once again run the validator seems like a good idea, but as @iammeeoh mentioned, I think it’s important that we clarify intent and ownership going forwards. Do you intend to run the validator as an individual (which would be completely fair, imo, given that you ran it yourself prior to the Foundation being interested,) or do you intend to run it on behalf of MakerDAO? I think @iammeeoh is correct in that if you’re running it on behalf of the DAO, we need to figure out answers to some of the questions he posed. Namely:  How to decentralize this function? What happens with the validator rewards? How to ensure resiliency + uptime?  The idea of a working group is a good one, I think. As far as I’m aware, developers within the Foundation are not currently prioritising L2 solutions. Maybe if we’re creating a working group we should make it L2 focused generally, rather than specifically focused on xDAI? I know @bit was commenting on the lack of movement on L2 solutions the other day. Perhaps that’s a way you could contribute more positively, @bit? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.417424242424242
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#12",
                    "likes": "0",
                    "time": "16/11/2020-15:21:07",
                    "content": "    LongForWisdom:  Maybe if we’re creating a working group we should make it L2 focused generally, rather than specifically focused on xDAI?   Oh! That would be a really interesting working group I think. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.40625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#13",
                    "likes": "0",
                    "time": "17/11/2020-03:39:25",
                    "content": "I completely agree that Maker DAO should implement a working group for L2/xDAI to be at the forefront of scaling DeFi. I personally used PERP’s xDAI trading protocol and it was a much better user experience than ETH. Trades were executed within 5 seconds and no gas costs needed to be calculated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#14",
                    "likes": "1",
                    "time": "05/12/2020-19:07:23",
                    "content": "update. @nanexcool 20 days have passed since your last post, do you have any update? The xDAI-Network is growing very fast. See, e.g., this recent data: https://twitter.com/xdaichain/status/1333868636633751555 It would be nice to be well positioned in this space, especially regarding STAKE-ing profits for MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.859999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#15",
                    "likes": "0",
                    "time": "05/12/2020-22:41:37",
                    "content": "I would love to see MakerDAO explore using xDAI if only as an experiment for possibly scaling in the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nanexcool",
                    "index": "#16",
                    "likes": "2",
                    "time": "08/12/2020-16:23:26",
                    "content": "hey @iammeeoh, sorry had to coordinate with some people. see xDai Validator (again) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#17",
                    "likes": "0",
                    "time": "09/03/2021-22:23:32",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}