{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/why-cant-we-vote-for-the-debt-ceiling-amount/1157",
            "title": "Why can't we vote for the debt ceiling amount? ",
            "index": 1157,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "debt-ceiling",
                "mcd-migration"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#1",
                    "likes": "3",
                    "time": "21/01/2020-08:07:16",
                    "content": "It seems that someone at MakerDAO decided that the next DC should be 125M and now we vote yes/no. Why can’t MKR holders decide what the appropriate amount is? If we vote about DSR/SF (mostly having no idea what the next value should be), we can vote about almost all other system parameters? ",
                    "links": [],
                    "GPT-summary": "The author of the post is asking a question about the MakerDAO system and why MKR holders cannot vote on the appropriate amount for the debt ceiling. The post is an inquiry and explanation of the MakerDAO system.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#2",
                    "likes": "6",
                    "time": "21/01/2020-10:27:22",
                    "content": "Hi @bit, In November we held a poll, called Poll: Migration Risk Construct Proposal which outlined the debt ceiling buffers for SAI and DAI, specifically: “We recommend a continuous 10-20 million Sai buffer.” and “For the MCD Eth debt ceiling, we propose 50 million, to be raised when needed. As the Sai supply migrates, the SCD outstanding supply is reduced. The debt ceiling should then be lowered to allow for simultaneous increases in the MCD debt ceiling. However, a minimum supply of Sai as a liquidity buffer for market makers should be kept intact, even as the maximum Sai debt ceiling goes down.” Our weekly Risk and Governance calls always touch on the topic of Debt Ceiling changes by our risk team, and so far I think the community have been satisfied with the bounds we have introduced - for example this week we are polling for a 25M increase to Dai and a 25M decrease to Sai Debt Ceilings. My personal perspective is that plus/minus 25M bounds are sufficient without the need for calling out specific values due to the fluctuation in liquidity, not to mention the overhead of additional polls/executive votes. If you have an alternative view regarding Debt Ceilings values, please do feel free to share, thanks! ",
                    "links": [
                        "https://community-development.makerdao.com/governance/governance-and-risk-meetings",
                        "https://vote.makerdao.com/polling-proposal/qmwspnkrb8tbvbmehmwrsjadexv9zbezxjqfjcstrd8jfc"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.015625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "1",
                    "time": "21/01/2020-13:22:32",
                    "content": "I think the current plan is good enough. I don’t think it’s worth the time and effort to try to negotiation something different. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "21/01/2020-14:29:55",
                    "content": "We can, we have in the past. As Derek said though, the interim risk team has implicit authority over changing the debt ceiling, and personally I think Cyrus is doing a fine job of keeping an eye on it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#5",
                    "likes": "0",
                    "time": "21/01/2020-18:37:32",
                    "content": "I have been thinking whether we should vote the DC increases in chunks of percent of outstanding. 10-20M are different percents at 100, 200, 500M. I have been wondering if this liquidity attack cyrus spoke of is a fixed number or a percentage and how the risk analysis teams look at this issue.   I think it would help us decide the step sizes on the DC’s both up and down. Generally I’m going to go with what the risk teams come up with.   I will add my .02DAI in chat with cyrus and leave it at that.    It is only if I disagree with direction of something I will speak out but havn’t seen too much issues.  $125 vs 120 sounds fine.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.694444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#6",
                    "likes": "3",
                    "time": "21/01/2020-18:49:16",
                    "content": "I think we have to vote again because:  the last vote (10-20M buffer) was about SAI and now we have DAI which is bigger and growing faster (100M already) we don’t respect the mentioned decision anyway (right now there is <4M buffer) the new vote will make less overhead/require less votes if we set higher buffer  I suggest we put a vote for the increase of the DC as soon as the buffer is <20%. The increase should accomodate growth for next 3-6 months. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.211715367965368
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aaron_sinek",
                    "index": "#7",
                    "likes": "0",
                    "time": "20/02/2020-06:11:31",
                    "content": "Debt is mostly bad. Most people go into debt to buy a car or tv etc. These debt make people poorer. On the other hand if you go into debt to buy a house and rent it and the rent amount is greater than your monthly EMI, then it’s a good debt and it will make you richer. There are other good debt like IVA debt which we use to make save our business and make it grow. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None",
                        "None",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.035714285714286
                }
            ]
        }
    ]
}