{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/product-discussion-curve-pool-collaterals/11980",
            "title": "Product Discussion: Curve Pool Collaterals ",
            "index": 11980,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "curve-lp"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "7",
                    "time": "02/12/2021-22:09:26",
                    "content": "So far, MakerDAO hasn’t accepted Curve LP tokens as collateral for minting DAI. While Maker is planning to onboard the stETH/ETH Curve LP in the near future, other pool types including USD or BTC denominated pools have not been considered in depth. This post goes over options for onboarding Curve LPs as collateral, including information about user demand, competition, and risk.  Yield Aggregators There are several yield aggregator protocols that work on top of Curve LP pools. These include Yearn, Convex, and StakeDAO. BadgerDAO also offers a BTC focused selection of Curve pools. Each of these protocols controls a portion of veCRV (vote locked CRV tokens) or CVX which grants a bonus on liquidity incentives for their users’ deposits. They may also offer additional token incentives on top, and have infrastructure for automatically claiming and reinvesting rewards. MakerDAO could deposit funds into Curve directly, deposit LP tokens into a yield aggregator on the back end, or accept a specific yield aggregator’s deposit token as collateral. Working with an aggregator requires accepting their technical and custody risks, but may offer improved yield and convenience for the end user. Also noteworthy, curve gauges and yield aggregator platforms involve high gas costs for withdrawals or other interactions. This would impact liquidation costs, and would likely require very high dust limits for these collaterals. Factors to consider about aggregators:  Net yield after including fees and boost Supplemental liquidity incentives or fee rebates Admin and governance risks Technical risks Gas efficiency (for deposit/withdrawal)  TL;DR - Convex generally offers the best yield, but Yearn offers more convenience and gas efficiency through automatic compounding, and may be competitive when factoring in fee rebates.  Yearn Additional incentives: None Fees: 2% annual fee on assets, plus 20% of net gains (up to 50% of fees shared back as referral bonus) Yearn fully reinvests all rewards back into the primary LP token, making for a simple ownership and integration experience. They tend to have the highest fees for Curve aggregators. In many cases they will deposit funds through Convex to earn additional CVX rewards. Yearn has an integration rebate program, where protocols directing business to Yearn products can receive up to 50% of user fees depending on total volume. Maker could potentially receive some of these fees back by integrating with Yearn vault collaterals, which could be held or returned to vault users.  Convex Additional incentives: Yes, CVX tokens allocated by governance Fees: 17% of net gains Convex reinvests CRV and third party token rewards back into the base LP asset, but also offers an additional layer of CVX rewards on top which are not automatically compounded. They have lower fees relative to Yearn, particularly for lower yielding pools such as BTC pools. Convex also has the highest share of veCRV holdings which allows them to boost depositor returns.  StakeDAO Additional incentives: For select pools Fees: 15% of net gains, plus 0.5% withdrawal fee StakeDAO has relatively lower TVL and veCRV holding versus Convex and Yearn, which puts them at a slight disadvantage with Curve LP farming. SDT incentives are offered for a select set of pools, which pushes return in those LPs higher than the competition.  BadgerDAO Additional incentives: Yes, but only if holding BADGER native tokens Fees: 20% of net gains, plus 0.1% withdrawal fee BadgerDAO offers Curve automation specifically for BTC based sets, including BTC stable pools and tricrypto pools. Additional incentives are offered on top, but they depend heavily on staking BADGER to increase boost levels (up to 2000x) and are insignificant without boosting. Note that Badger recently experienced a front end approval exploit, and while this would not affect direct integrators like MakerDAO it may impact Badger’s business continuity and overall solvency.  Depositing Directly to Curve Gauge This would generally put vault users at a disadvantage versus competitors, as Maker does not have any locked veCRV available to boost yields. Maker would need to petition Curve governance for permission to lock veCRV in governance, and would then need to accumulate significant holdings to be competitive with existing aggregators. Note that this doesn’t present an issue for our stETH pool integration because the majority of rewards are in LDO tokens which are not impacted by veCRV boosting. On the other hand, directly depositing to gauges presents lower technical and admin/governance risks versus aggregators.  USD Stablecoin Pools Curve’s base USD metapool is the Curve 3pool, including DAI, USDC, and USDT in equal weights. Maker has historically been reluctant to take on USDT risk, but this would be unavoidable for onboarding Curve’s existing USD pools. Maker may also generally avoid lending based pools (eg Compound and Aave Curve pools) due to additional solvency risks and potential competition with Maker’s main vaults and D3M module(s). The 3pool is currently earning 7% yield on Convex with fluctuation between 4% to 8%, and Abracadabra has seen over $700 million in minting against this asset. With the 1% origination fee and 1.5% borrowing rate included, total costs on Abra are: 13.5% over 1 month, 4.5% over 3 months, and 2.5% over 1 year. Considering the 92% collateral factor (roughly 108.7% liquidation ratio), users can lever the position up to 12.5x, for a yield of up to 50% (depending on holding period). Maker could offer a competitive vault for the 3pool as long as 3-4% stability fees are estimated to adequately cover risk at a similar liquidation ratio. In addition to the 3pool, Maker could onboard the GUSD and PAXv2 pools without accepting any additional unsupported stablecoins (besides USDT) or lending integrations. Maker could also onboard the TUSD metapool if TUSD was accepted as a base stablecoin. In the future it may be possible to petition Curve governance for a USD pool and gauge that does not include USDT or other non-Maker supported stablecoins. This may allow for more competitive risk parameters and borrowing costs versus existing Curve pools that include USDT. Assuming oracle costs of $500,000 per year for the LP plus $300,000 per year for the USDT oracle (total of $800,000 per year), and a 3% stability fee, Maker would need roughly 30 million DAI minted to reach breakeven. Any additional minting volume or stability fee increases above this would help compensate for collateral risk.  BTC Pools Curve’s primary BTC metapool is the sBTC pool. This includes WBTC, renBTC, and sBTC as components. Including sBTC gives exposure to Synthetix solvency risk, which may make linked LPs less appealing from a risk adjusted return perspective. Bitcoin LPs not including sBTC include the renBTC and HBTC pools.  Source: Curve The renBTC pool includes WBTC and renBTC. Both assets are already accepted at Maker and have decent liquidity, so this may be relatively smooth to accept as collateral. A collateral application has already been submitted, so it would just need to be prioritized by core unit teams and have relevant reviews and integration work completed. Currently there is roughly $900 million in deposits in the pool, and Abracadabra has also seen over $50 million in stablecoins minted against this collateral type (specifically cvxrenCRV).  1194×404 23.5 KB  Source: Abracadabra Abracadabra charges 0.5% interest rate but also includes a 0.5% origination fee, so the effective cost of borrowing over 3 months is 2% (6.5% over 1 month, 1% over 1 year). Generally these borrowing costs are on par with Maker’s BTC collateralized vaults. The ren pool is currently earning roughly 1.3% yield on Convex, which would counterbalance up to 5% in borrowing costs assuming 300% vault collateralization. The HBTC pool features WBTC and HBTC (Huobi custodied BTC token). Maker has received a collateral application for HBTC but it has not progressed, and Maker would need to consider this asset’s risk before onboarding the HBTC pool LP. The HBTC pool is earning roughly 7% via Convex, and does not currently have lending and collateral support on any platforms. Assuming $500,000 per year in LP oracle costs and 4% stability fee (matching current WBTC rate), Maker would need roughly 15 million DAI minted to break even. This target would vary based on ETH and gas prices, and stability fee charged.  Tricrypto Pools Curve v2 features pools including non-stable assets. The initial iteration is the Tricrypto2 pool, which features USDT, WBTC, and ETH in equal proportions. Curve uses a responsive mechanism to adjust liquidity concentration and fees based on market conditions. This is intended to provide best trading execution while managing divergence loss for LPs. The current tricrypto pool features USDT as the base USD asset. This presents complications for Maker, as we tend to discount USDT substantially based on risk levels. Maker could onboard tricrypto pool with loss provisions and rates set based on USDT inclusion. Or alternatively with Curve governance and team support, Maker may be able to lobby for a DAI based tricrypto pool which would allow for more favorable collateral risk parameters.  1204×402 25 KB  Source: Abracadabra The tricrypto2 pool is currently earning roughly 17% yield on Convex, with nearly $1 billion deposited. Abracadabra has seen over $350 million in minting against this collateral, showing strong borrowing demand. Including the 0.5% origination fee, Abra’s borrowing costs are: 9.5% over 1 month, 5% over 3 months, and 4% over 1 year.  Review As shown by Abracadabra, there is strong demand to borrow against Curve LP collateral including USD, BTC, and tricrypto pools. With current pool compositions, Maker would need to accept a certain degree of USDT solvency risk to onboard USD or tricrypto pool tokens, and would also need to fund continuing support for USDT price oracle. The 3pool, USD metapools, and tricrypto pool may offer high enough yield to allow for adequate risk compensation for USDT exposure. The decision to pursue this depends on community risk appetite. It may also be possible to lobby Curve governance for new pools and gauges that exclude USDT to support better borrowing conditions, but this would likely be a long term process and may require other concessions to Curve. The simplest near term integration target is the renbtcCrv pool - Maker could onboard this pool without accepting any new base collaterals and with only one additional oracle. Abracadabra has seen over $50 million in minting and Maker could likewise see significant usage with enough revenue to compensate for risk and operating costs. Breakeven versus oracle costs would require roughly 10-20 million DAI generated depending on stability fee.  Next Steps Review strategies for renbtcCrv pool  Which protocol/aggregator offers best all-in yield? (including rebates) Technical, governance, and admin risks for each aggregator Evaluate if revenues can reach breakeven with oracle costs - can we realistically get to 20 million+ in net new DAI generated?  Assess possibility of Curve adding non-USDT tricrypto and USD pools  Can these pools be created through Curve factory? How can we get CRV governance support for gauges and new pools?  Review risks and gauge community risk tolerance to USDT exposure ",
                    "links": [
                        "https://curve.fi/steth",
                        "https://yearn.finance/vaults",
                        "https://www.convexfinance.com/stake",
                        "https://stakedao.org/",
                        "https://badger.com/",
                        "https://abracadabra.money/stand",
                        "https://curve.fi/sbtc",
                        "https://synthetix.io/",
                        "https://curve.fi/pools?",
                        "https://curve.fi/ren",
                        "https://abracadabra.money/stand",
                        "https://forum.makerdao.com/t/hbtc-mip6-collateral-onboarding-application/3336",
                        "https://abracadabra.money/stand",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-december-2021/12436",
                        "https://forum.makerdao.com/t/forum-at-a-glance-december-2-9-2021/12119",
                        "https://forum.makerdao.com/t/maker-relay-ep-74-en-espanol/12071",
                        "https://forum.makerdao.com/t/maker-relay-ep-74/12035",
                        "https://forum.makerdao.com/t/monetsupply-delegate-platform/9545/25",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-march-2022/14424"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.475439319301389
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "3",
                    "time": "02/12/2021-22:57:34",
                    "content": "    monet-supply:  MakerDAO could deposit funds into Curve directly, deposit LP tokens into a yield aggregator on the back end, or accept a specific yield aggregator’s deposit token as collateral. Working with an aggregator requires accepting their technical and custody risks, but may offer improved yield and convenience for the end user.   This is interesting–what steps would the DAO have to take if there was a gigantic drop in the Markets, and how fast would the tokens be up for liquidation? I guess you would need to liquidate the deposit token, correct?     monet-supply:  Also noteworthy, curve gauges and yield aggregator platforms involve high gas costs for withdrawals or other interactions. This would impact liquidation costs, and would likely require very high dust limits for these collaterals.   Can you please describe the other interactions–I would imaging claiming rewards, re-investing, etc.     monet-supply:  Note that Badger recently experienced a front end approval exploit, and while this would not affect direct integrators like MakerDAO it may impact Badger’s business continuity and overall solvency.   Maybe this should be in Bold Text  And last but not least, in your opinion what CU/team should orchestrate this strategy? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.562916666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#3",
                    "likes": "1",
                    "time": "02/12/2021-23:37:00",
                    "content": "    flipflopflapdelegate:  This is interesting–what steps would the DAO have to take if there was a gigantic drop in the Markets, and how fast would the tokens be up for liquidation? I guess you would need to liquidate the deposit token, correct?   It would work very similarly to our existing liquidation system, the main difference is that liquidators would need to take the extra step of unstaking funds from the deposit token to get it back into DAI which would cost significantly more gas. So for example if we accepted cvx3pool tokens (Convex Finance staked 3pool) as collateral, liquidators would need to (1) bid on collateral (2) unstake from Convex, (3) withdraw stablecoins from Curve, and (4) sell the USDT and USDC portions of LP for DAI. Guessing this would cost as much as $1000 or more during periods of high gas prices, so we’d need to set higher dust limits to compensate for this.     flipflopflapdelegate:  Can you please describe the other interactions–I would imaging claiming rewards, re-investing, etc.   This depends on a case-by-case basis. For example if we use Yearn, they automate all of the claiming and reinvestment transactions and include the gas costs for this inside of their regular fees (2% of AUM per year + 20% of gains). So the only added costs would be for withdrawals during liquidation. Convex on the other hand doesn’t auto-reinvest, so most likely Maker would force users to claim accrued rewards for the entire collateral adapter each time they deposit or withdraw collateral. This wouldn’t have too much extra impact on liquidation costs, but would significantly increase cost for users opening and maintaining a vault.     flipflopflapdelegate:  And last but not least, in your opinion what CU/team should orchestrate this strategy?   I think risk, PE, oracles, and growth would have the most direct involvement. Probably risk and/or growth will be involved first to determine if there’s really enough borrowing demand for these assets to make it worthwhile. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.810632183908045
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#4",
                    "likes": "1",
                    "time": "03/12/2021-15:22:33",
                    "content": "This was a really interesting read. The cvx tricrypto pool is an intriguing one. At 3.5% interest with 370 million MIM generated it’s making abracadabra 13 million DAI/year 1:1 that would make it our third highest generating collateral type after ETH-A and WBTC-A. Even 10% of the size would make it our fifth highest. It’s important to look at what competitors are doing and see what we can adapt for ourselves to generate more funds for MakerDAO. Edit: I understand the concerns about tether but there must be a profit level where the benefits begin to compensate for the risks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7
                }
            ]
        }
    ]
}