{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/announcing-governance-dashboard-v2/17159",
            "title": "Announcing Governance Dashboard v2 ",
            "index": 17159,
            "category": [
                "Resources",
                "Dashboards"
            ],
            "tags": [
                "meta-governance",
                "gov-001",
                "dashboard"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hernandoagf",
                    "index": "#1",
                    "likes": "14",
                    "time": "10/08/2022-19:09:06",
                    "content": "A new version of GovAlpha’s Governance Dashboard is live! This one features improvements to the Stats section and a new Delegates section.  New features  Stats section   A new Sankey Diagram to visualize the current MKR delegation flow from the main delegators to delegates, which supports focusing on a delegator or a delegate by clicking on their nodes.  740×419 120 KB    Support for fullscreen charts. You can now expand any of the charts in the Stats section into fullscreen to see the data in more detail by clicking the fullscreen button on the top-right corner of the chart.  742×128 18.8 KB    Support for delegate contracts expiration. You can now toggle between showing or hiding expired delegates on the top-right settings, after that the delegate tables and data counters will update accordingly.  768×147 15.7 KB    UI and UX improvements:  Site performance was improved and transitions should now be smoother. Charts rearrangement.     Delegates section A new delegates section was added with the objective of making it easier to keep track of delegates’ opinions and comments on on-chain polls and executive votes, it fetches and displays on-chain comments as well as forum delegate platforms in a unified UI. Future iterations of this section may include tools that will help with the decision-making process for delegators when choosing whom to delegate their MKR.  1919×957 99.3 KB   1361×197 17.7 KB   1353×137 12 KB   Feedback Feel free to leave any comments, suggestions, ideas or opinions about this or future releases as they will be much appreciated. Also, feel free to share the dashboard with anyone you think may find it useful. ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-and-risk-205-thursday-august-25-at-17-00-utc/17437/2",
                        "https://forum.makerdao.com/t/governance-and-risk-203-thursday-august-11-at-17-00-utc/17157/2",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-04-10-de-agosto-del-2022/17250",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-august-2022/16955",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/10"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8809185606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "11/08/2022-04:59:20",
                    "content": "Nice work! Thank you. Haven’t had a chance to see it on desktop but on mobile it doesn’t format well. But it could be my mobile. Thanks again. Also, did you get help from Data Insights on this, or you did it on your own? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pipko",
                    "index": "#3",
                    "likes": "0",
                    "time": "11/08/2022-15:15:32",
                    "content": "This is amazing work! The sankey diagram is very informative. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.375
                }
            ]
        }
    ]
}