{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/serie-makerdao-a-fondo-en-youtube/5553",
            "title": "Serie MakerDAO a fondo en Youtube ",
            "index": 5553,
            "category": [
                "Latin America"
            ],
            "tags": [
                "community",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#1",
                    "likes": "7",
                    "time": "08/12/2020-14:46:58",
                    "content": "¡ Hola a todos ! Desde el equipo de embajadores de MakerDAO en Venezuela hemos creado una miniserie titulada MakerDAO a fondo en nuestro canal de Youtube, la serie se enfoca en explicar de una forma sencilla y concisa (vídeos de menos de 15 minutos) el Protocolo Maker. La idea de esta serie es tener en formato audiovisual información como la que está propuesta en el portal de desarrollo comunitario, esperamos que la serie tenga de momento 3 capítulos pero puede extenderse dependiendo del feedback de la comunidad, si desean conocer otras cosas que no mencionamos o simplemente faltan más temas por cubrir (que de seguro puede ser así). Por el momento contamos con dos vídeos:  MakerDAO a fondo Pt. 1: la Gobernanza Maker MakerDAO a fondo Pt. 2: los Parámetros del Protocolo Maker  Además contamos con un vídeo introductorio hablando sobre qué es Dai para los miembros más nuevos. Esperamos de los miembros de habla hispana del foro todo el feedback posible y que temas les gustaría tratemos en vídeos futuros, ya que, nuestra misión es dejar la mayor cantidad de contenido posible sobre MakerDAO, Dai y DeFi en nuestro canal. ¡ Saludos ! ",
                    "links": [
                        "https://www.youtube.com/watch?v=DtsSL_foBVM",
                        "https://www.youtube.com/watch?v=Nno4F3TfohM"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Poch0x0000",
                    "index": "#2",
                    "likes": "1",
                    "time": "08/12/2020-23:11:31",
                    "content": "Excelentes videos Luis, se agradece todo el contenido que publicas! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#3",
                    "likes": "1",
                    "time": "29/01/2021-14:50:39",
                    "content": "Actualización: MakerDAO a fondo parte 2: Parámetros del Protocolo Maker, acá se habla principalmente de parámetros como Tarifas de Estabilidad, Techos de Deuda, etc. MakerDAO a fondo parte 3: Liquidaciones y Subastas, en este vídeo hablamos de forma sencilla sobre las liquidaciones y subastas que tienen lugar cuando se liquidan los Vaults. MakerDAO a fondo parte 4: Oráculos y Seguridad del Protocolo, en este último describimos la tarea de los Oráculos dentro de MakerDAO y como funciona el Apagado de Emergencia del Protocolo Maker. ¡Pronto vendrán más! Cortesía del Dai Action Group de Venezuela . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                }
            ]
        }
    ]
}