{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/collateral-onboarding-call-mips-6-12-discussion-and-review-of-collateral-onboarding-process/2008",
            "title": "Collateral Onboarding Call (MIPs #6-12): Discussion and Review of Collateral Onboarding Process ",
            "index": 2008,
            "category": [
                "Collateral Onboarding",
                "Collateral Meetings"
            ],
            "tags": [
                "collateral-onboard",
                "mips",
                "public-call",
                "pubcall-:-collateral"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#1",
                    "likes": "11",
                    "time": "17/04/2020-13:58:56",
                    "content": "Hello everyone, we’ve been reading and reviewing the different MIPs put forward by the Maker Foundation and are excited about the future process for collateral onboarding that is outlined in MIP6 through MIP12. I think they are a great start and fully support ratifying them on April 27th! Centrifuge is looking forward to using them with our assets that we can bring to the ecosystem. But there I have to say there are also a few things I’m wondering about. As ratifying this gives the Maker community a first process to follow, I think it would be great to have an informal discussion round on the MIPs going through them, coming up with clarifying questions and maybe create some ideas for improvements or sub-proposals. Is anyone interested in joining a Zoom meeting next week to study them together and discuss them? What things can we talk about:  How would a practical implementation of the process look like? What is not clear in the MIPs? What sup-proposals should be added? Who’s interested in taking part of the process in the community?  The call is happening Wednesday at 10:30am PST/17:30 UTC the 22nd of April. Zoom Meeting: https://zoom.us/j/99780944477 ",
                    "links": [
                        "https://forum.makerdao.com/t/pc-drop-mip6-application-paperchain-drop-tokenized-music-streaming-invoices/2215",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-tuesday-april-21-10am-pst-5-00-pm-utc/2111/2",
                        "https://forum.makerdao.com/t/centrifuge-onboarding-rwa-backed-collateral-to-mcd/2721",
                        "https://forum.makerdao.com/t/cf-drop-mip6-application-consolfreight-drop-tokenized-freight-shipping-invoices/2214"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.03125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "17/04/2020-17:25:59",
                    "content": "Hi Lucas–I’m all in–very interested in a Zoom meeting–please post the credentials and I’ll help in asking Community members who have not seen your post to join the Zoom meeting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#3",
                    "likes": "0",
                    "time": "17/04/2020-18:03:11",
                    "content": "probably wont be able to attend, but would love it if you guys recorded and posted the call online. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chris",
                    "index": "#4",
                    "likes": "1",
                    "time": "17/04/2020-22:28:16",
                    "content": "would like to join! From casually skimming the MIPs, one of the things that kind of stands out to me in this collateral onboarding process that has seen scant discussion is dealing with conflicts of interest and the lack of diversity in governance frontends. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.249999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#5",
                    "likes": "0",
                    "time": "18/04/2020-11:15:48",
                    "content": "Cool, I’ve just created a zoom meeting open for anyone to join on Tuesday:    Zoom Video    Join our Cloud HD Video Meeting now Zoom is the leader in modern enterprise video communications, with an easy, reliable cloud platform for video and audio conferencing, chat, and webinars across mobile, desktop, and room systems. Zoom Rooms is the original software-based conference...       Are there any topics of interest from anyone else that you think we should look into? One question I was wondering is how domain teams start looking at new assets and how they prioritize different assets. MIP8 discusses that domain teams give green light but what if there is a flood of collateral, how would the individual teams pick which assets to look into first? It seems like this is still a process that needs to be added. ",
                    "links": [
                        "https://zoom.us/j/99780944477"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.883953168044077
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#6",
                    "likes": "0",
                    "time": "18/04/2020-13:26:45",
                    "content": "    spin:  MIP8 discusses that domain teams give green light but what if there is a flood of collateral, how would the individual teams pick which assets to look into first?   In the original document Collateral Onboarding Process (v1) this is intentionally left to the domain teams to decide. The community signals their preferences via Community Greenlight, the domain teams signal their opinion on what is workable and then they work on whatever they want to. Because the community eventually needs to ratify the collateral types the domain teams propose, it is expected that the domain teams will largely follow community preference, however the loose brief allows them room to prioritise assets that they are well-versed in or believe strongly in. On a more human note, you get the best work out of people when they have agency. This setup gives the domain teams agency but also provides them with direction. The setup may change when domain teams are directly paid by the protocol, but for now it seemed like a good way to work. I fully admit that all of the above is not made clear in the current MIP-Set though. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.906211843711844
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#7",
                    "likes": "0",
                    "time": "18/04/2020-13:28:49",
                    "content": "Is the community green light process discussed anywhere in the MIPs? I think that part is missing from MIP6 and 7? Right? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/_LS",
                    "index": "#8",
                    "likes": "1",
                    "time": "21/04/2020-09:34:23",
                    "content": "There’s the mid-week governance call happening today at 5PM UTC ([Agenda/Discussion] Scientific Governance and Risk - Tuesday, April 21 10AM PST (5:00 PM UTC)) We’ll move this round to tomorrow, 22nd ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "0",
                    "time": "22/04/2020-10:30:31",
                    "content": "Note that some changes were made to MIP8 yesterday in an attempt to clarify some things around Domain Greenlight. It can be found here: https://github.com/makerdao/mips/blob/master/MIP8/mip8.md ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#10",
                    "likes": "1",
                    "time": "22/04/2020-16:34:43",
                    "content": "Thanks for the update LFW. I’ve had a look at the changes already. Looking forward to the call which is happening in a little bit short of an hour from now! The zoom call to join is: https://zoom.us/j/99780944477 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.020833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#11",
                    "likes": "4",
                    "time": "23/04/2020-14:19:03",
                    "content": "Here are my notes on yesterday’s call around the MIPs process with a focus on collateral onboarding. We’ve uploaded a recording of the call on youtube as well. The call started off with a discussion around the governance cadence and how these new MIPs will fit into the weekly cycle that governance has. @rune shared details on the schedule proposal: The plan is to have these run in parallel as they have mostly separate concerns (weekly GnR call is to tune system parameters, the MIP6-12 processes is for onboarding collateral). As they are being ratified and become active on May 4th, there will be additional on chain governance polls for MIP8 and MIP12 that will fit into the schedule. Come to think of it, laying out what this looks like on a calendar would be great (I might try to do that this weekend). MIPs are still in request for comments, there have been changes to some of them. @charlesstlouis  is saying: “We made changes to improve clarity, readability; e.g. MIP0, MIP8. We will update changes in the forum threads but hasn’t gotten to all of them yet; Most updated version on GitHub, but we will change organization on the forums a bit.” On MIP7 there was a change to add the active domain teams and who the people on them are. Timeline for ratification:  27th timing vote: Proceed with MIPs or delay Governance Ratification Voting Period May 1st - May 4th 1st Governance Cycle with begin on May 4th  The goal for mid May should be to have a number of MIP6 proposals published both in the Maker forum and on Github. In an ideal scenario, these proposals cover all major tokens available on SET protocol and Uniswap. Also, applications for real-world assets would be great to add as a signal to startups and other companies that now there is a formalized governance process in place and that there will be a direct response to their application (as opposed to how it took place in the past). To keep things going, people expressed interest in doing another one of these calls perhaps even on a regular cadence to organize around collateral onboarding. It is important to note that this call should not be any sort of gatekeeper and that the MIPs process via posting on the forum will be the way to submit these proposals. Topics to discuss on the call are more around coordination, collaboration of editing the MIPs/discussing process improvements and sharing learnings. I will tentatively put the first of this call on Wednesday the 13th of May at 10:30am PST/17:30 UTC, one week into the ratification of the process and will post on the forums coming up to the date with an invite and a zoom link. Please point out any omissions/corrections to this summary and I’ll adjust it. Call Recording: https://www.youtube.com/watch?v=336RkUuI6hA ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25163567493113
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#12",
                    "likes": "1",
                    "time": "23/04/2020-14:24:58",
                    "content": "Quick correction, the Governance ratification vote is May1st - May 4th. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#13",
                    "likes": "2",
                    "time": "29/04/2020-19:28:10",
                    "content": "Hello everyone! A few things have been moving on collateral onboarding in the last two weeks and I propose we put together another call. Are there any particular topics you want to discuss? Feel free to respond to this thread and we can put together an agenda. Here a few highlights that we can talk about:   @LongForWisdom has put together the Collateral Status Index with 4 MIP6 applications so far  [WBTC] - WBTC Collateral Request For Comment WBTC is going through the onboarding process, though a slightly abbreviated version because of the current urgency and a lot of working having been started pre MIP ratification. By the time the call will happen, the signaling poll has ended and we will know whether the initial MIPs have been ratified or not (if not there is a one month delay to work out counter proposals). The vote is here: https://vote.makerdao.com/polling-proposal/qmyqqe9guqfld2ge9rskly9jxycctgua8j6kevf5dhlnta (Current result: Yes with 18,231.54 MKR (80.39%))  Let’s do the call next week on Wednesday May 6th 10:30am PST/17:30 UTC/19:30 CEST! Join Zoom Meeting Meeting ID: 813 3347 0929 Password: IJD9u1dqQC ",
                    "links": [
                        "https://forum.makerdao.com/t/wbtc-wbtc-collateral-request-for-comment/2135/31",
                        "https://vote.makerdao.com/polling-proposal/qmyqqe9guqfld2ge9rskly9jxycctgua8j6kevf5dhlnta",
                        "https://us02web.zoom.us/j/81333470929?pwd=cmdqR2xVemh0L3NQbW1CbnlFaXlEQT09"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.045454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "1",
                    "time": "04/05/2020-11:19:45",
                    "content": "Just reminding people of the above! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/_LS",
                    "index": "#15",
                    "likes": "8",
                    "time": "11/05/2020-15:56:38",
                    "content": "Here’s the recording from last week’s Collateral Meeting (May 6th). https://www.youtube.com/watch?v=3WyBwisQggk&t=3s We talked through the following MIP6 applications:  [tBTC] [UNI-V1-DAI] And started talking about [CF-DROP] and [PC-DROP]   If there is interest in continuing these calls we will schedule the next one for May 20th, 10:30am PST/17:30 UTC ",
                    "links": [
                        "https://forum.makerdao.com/t/tbtc-proposal-for-collateral-onboarding-tbtc/2328",
                        "https://forum.makerdao.com/t/uni-v1-dai-uniswap-dai-liquidity-token-collateral-application/1966/23",
                        "https://forum.makerdao.com/t/cf-drop-mip6-application-consolfreight-drop-tokenized-freight-shipping-invoices/2214/4",
                        "https://forum.makerdao.com/t/pc-drop-mip6-application-paperchain-drop-tokenized-music-streaming-invoices/2215/3",
                        "https://forum.makerdao.com/t/pc-drop-mip6-application-paperchain-drop-tokenized-music-streaming-invoices/2215/21"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/_LS",
                    "index": "#16",
                    "likes": "2",
                    "time": "19/05/2020-17:32:50",
                    "content": "Next Collateral Onboarding Meeting happening tomorrow, May 20th, 10:30am PST/17:30 UTC https://zoom.us/j/99780944477 Rough agenda:   Continue the discussion that started on last week’s Risk and Governance Call on the [PC-DROP] and [CF-DROP] application   Go through other applications (such as [FIAT]) that are awaiting Domain Team Greenlight   ",
                    "links": [
                        "https://www.youtube.com/watch?v=jkVNeI3-rWs"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#17",
                    "likes": "5",
                    "time": "21/05/2020-16:50:09",
                    "content": "Here is the recording of yesterday’s call, it was a great discussion, thanks everyone for joining and drilling us with questions! https://www.youtube.com/watch?v=PmUd5Ua6UJ4 Most of the discussion was around how MCD could be used to as directly as possible be used to originate loans backed by some real world collateral and how we’ve built Tinlake to make this work for MCD as well as the originators that want to use it to give DAI to borrowers. I’m going to be following up with a summary on the call that will probably turn into a new forum thread discussing collateral governance and risk for illiquid assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.347402597402597
                },
                {
                    "author_link": "https://forum.makerdao.com/u/_LS",
                    "index": "#18",
                    "likes": "0",
                    "time": "02/06/2020-21:19:52",
                    "content": "Reminder for * tomorrow’s Collateral Onboarding Call * - same time 10:30am PST/17:30 UTC, same zoom: https://zoom.us/j/99780944477 (or via https://calendar.google.com/calendar/[email protected].google.com&ctz=America/Los_Angeles); we’ll continue where we left things off in the last onboarding call! ",
                    "links": [
                        "https://calendar.google.com/calendar/embed?src=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com&ctz=America%2FLos_Angeles",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-bi-weekly-on-wednesday-at-17-00-utc-19-00-cet-10am-pst/3614"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#19",
                    "likes": "0",
                    "time": "02/06/2020-22:56:13",
                    "content": "I’d love to talk a little bit about Centrifuge’s assets in general, working more on what we started getting into in the last call. I’ve put up a forum thread talking about Centrifuge assets in general and summarized what we’ve discussed so far: Centrifuge: Onboarding RWA Backed Collateral to MCD ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.723214285714286
                }
            ]
        }
    ]
}