{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/propuesta-de-cambios-de-parametros-inmediatos-y-de-corto-plazo-para-crvv1ethsteth-a-incremento-de-dc-y-gap/14618",
            "title": "Propuesta de Cambios de Par\\xc3\\xa1metros Inmediatos y de Corto Plazo para CRVV1ETHSTETH-A - Incremento de DC y Gap ",
            "index": 14618,
            "category": [
                "Latin America"
            ],
            "tags": [
                "votaci\\xc3\\xb3n"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/0xRami",
                    "index": "#1",
                    "likes": "4",
                    "time": "14/04/2022-05:34:51",
                    "content": "Esta publicación incluye dos instancias de cambios de parámetros para CRVV1ETHSTETH-A. 1) El Inmediato, que irá a la votación ejecutiva de esta semana y 2) El Corto plazo, que irá a la encuesta en cadena de la próxima semana.  La línea Inmediata DC-IAM (DC) cambia de 3M a 5M DAI  En la evaluación de riesgos inicial en octubre de 2021, propusimos 5M DC, que luego se redujo a 3M en marzo de 2022 debido a preocupaciones técnicas de otras CU. El 5M DC ya fue aprobado por Maker Governance en esta poll on-chain. Ahora se disipan las preocupaciones, lo que nos permite aumentar de inmediato el DC para los 2 millones restantes, a 5 millones, en la próxima votación ejecutiva este viernes 8 de abril.  La propuesta de cambios de parámetros a corto plazo  El token CRVV1ETHSTETH-A, o Curve Lido stETH-ETH LP, se incorporó a mediados de marzo y recientemente utilizó casi por completo el DC disponible de 3M DAI, que se estableció como parte de la recomendación de parámetros colaterales actualizados. El DC inicial siempre es fijado por debajo del requerido para permitir la observación de su desempeño en la práctica por parte de diferentes UC. Como se mencionó anteriormente, ahora hay menos preocupaciones técnicas con respecto a CRVV1ETHSTETH-A. Además, luego de evaluar el desempeño de la bóveda, no existe un riesgo financiero claro que inhiba aún más el aumento del techo de la deuda. Por ello, el Núcleo de Riesgos propone un aumento adicional del techo de endeudamiento y del gap DC-IAM. El tipo de bóveda consta actualmente de 17 bóvedas activas individuales con un índice de garantía ponderado de deuda del 276,5 % y el usuario más grande representa ~36 % de la deuda total. La pool de stETH-ETH de Curve Lido es uno de los mercados más grandes en Ethereum, actualmente se ubica en $ 5.53B o 1588K stETH + ETH (igualmente ponderado). Desde la perspectiva de la liquidez, el CD podría ser potencialmente relativamente alto en comparación con otros activos colaterales, pero aún queremos mantener una exposición controlada a los riesgos específicos de Lido, que se comparten con otros productos expuestos, como las bóvedas wstETH y Aave D3M a algunos más pequeños. medida. Suponiendo que se apruebe la última propuesta de parámetros de MOMC, la tarifa de estabilidad CRVV1ETHSTETH-A se reducirá en un 1,25 %, del 3,5 % al 2,25 %, lo que aumentará la rentabilidad potencial de las posiciones de la bóveda y aumentará la demanda. Cambios de parámetros propuestos para CRVV1ETHSTETH-A;  Aumentar la línea DC-IAM (DC) a 50M Aumente la brecha DC-IAM a 10M  Suponiendo que no haya objeciones, nos gustaría continuar con los parámetros propuestos desde el punto 2) hasta la encuesta en cadena el próximo lunes 11 de abril.  Esto es una traducción del tópico original de dicha propuesta de votación.   Poll de votación aquí  ",
                    "links": [
                        "https://forum.makerdao.com/t/curvelp-steth-eth-parameters-adjustment/13767",
                        "https://vote.makerdao.com/polling/Qmek9vzo",
                        "https://vote.makerdao.com/executive/template-executive-vote-curve-steth-eth-onboarding-rate-limited-flapper-immunefi-bug-bounty-payouts-march-11-2022#proposal-detail",
                        "https://forum.makerdao.com/t/curvelp-steth-eth-parameters-adjustment/13767",
                        "https://maker.blockanalitica.com/vaults/CRVV1ETHSTETH-A/",
                        "https://etherscan.io/address/0xDC24316b9AE028F1497c275EB9192a3Ea0f67022",
                        "https://maker.blockanalitica.com/assets/STETH/",
                        "https://vote.makerdao.com/polling/QmdS8mCx#vote-breakdown",
                        "https://forum.makerdao.com/t/immediate-short-term-parameter-changes-proposal-for-crvv1ethsteth-a-dc-and-gap-increase/14476",
                        "https://vote.makerdao.com/polling/QmeTfgKP"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "4",
                    "time": "14/04/2022-14:32:34",
                    "content": "Me gusta esto de la misma comunidad traduciendo cosas, me encanta, grande @0xRami ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xRami",
                    "index": "#3",
                    "likes": "2",
                    "time": "14/04/2022-18:03:35",
                    "content": "Gracias Diego, es un placer compartir contenido interesante para la comunidad! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#4",
                    "likes": "2",
                    "time": "16/04/2022-16:58:58",
                    "content": "Que genialidad! Se empieza a activar la comunidad latam, gracias por el translate querido! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}