{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/the-maker-foundation-s-vision-of-a-self-sustaining-makerdao-initiation-of-maker-improvement-proposals-mips-framework/1882",
            "title": "The Maker Foundation\\xe2\\x80\\x99s Vision of a Self-sustaining MakerDAO: Initiation of Maker Improvement Proposals (MIPs) Framework ",
            "index": 1882,
            "category": [
                "Governance"
            ],
            "tags": [
                "mips"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#1",
                    "likes": "8",
                    "time": "03/04/2020-20:03:55",
                    "content": "As a follow up to Wednesday’s forum post and Maker blog post announcing the Kickstart of the Self-Sustaining MakerDAO Initiative, and to Rune’s presentation during yesterday’s Governance and Risk Call, this post further details the Maker Foundation’s vision for the Self-Sustaining MakerDAO Initiative, as well as the launch details of the Maker Improvement Proposals (MIPs) Framework. As previously noted, the Maker Foundation will, over time, be dissolved, and the community will govern all aspects of the Maker Protocol. For the Protocol to continue to function effectively in the future, the community must be well-informed and equipped with clearly-defined governance processes. This requires a system for creating new processes, sharing knowledge, building off the current governance system, and building new technology when needed. Defining clear processes and gaining practical experience will be particularly important when the community takes full control of systems that underpin governance and maintain the security of the Protocol. Over the next few months, the community will focus on three elements of a self-sustaining DAO:   Elected Paid Contributors (EPCs) and Domain Teams: MakerDAO requires a decentralized workforce in order to effectively grow and maintain the Maker Protocol. EPCs and Domain Teams will work for the DAO, be onboarded through governance, and be paid by the Protocol. More specifically, EPCs are individuals that perform defined duties for the DAO. Domain teams are a subset of EPCs that are given special authority through governance to oversee critical processes and mitigate risk.   The Maker Improvement Proposals (MIPs): MIPs will provide a mechanism for any community member to define key issues and suggest changes and additions to the system. MIPs will allow for a high level of transparency, rigor, and community input in order to minimize undesirable results from the process. In most cases, MIPs will be arranged in sets (multiple MIPs that are interdependent but together solve a single problem, risk, or opportunity through one or more processes).   Vote Delegates: Delegates will act as representatives for MKR holders who choose not to vote directly. Notably, all MKR holders, regardless of whether they delegate, will have access to all the essential information needed to continue governing the Protocol.   The above elements will assist the Maker community in putting the first Governance Paradigm in place. A first Governance Paradigm, as Rune mentioned in his presentation to the community on Thursday, will be a grouping of the first MIPs and EPC roles proposed and drafted by the Maker Foundation with input from the community. Aimed at ensuring all critical elements are covered before the Foundation is dissolved, the Paradigm will help the DAO function properly, maintain security, and grow exponentially in the future. Community members and Delegates can experiment with all the tools noted in the Governance Paradigm to gain practical experience and valuable communication skills that they will need to effectively manage the DAO. The concept of Domain Teams is not new to the Maker community. Over the course of 2019, the Maker community elected multiple domain teams and an individual contributor to help support and operate the Maker Protocol: an Interim Governance Facilitator, Interim Risk Team, and Interim Oracle Team. Over the course of the next two years, EPCs and Domain teams will be voted in order to meet the needs of the Protocol’s growth and maintenance. Additionally, over the course of the month of April, the Maker Foundation will release the first set of MIPs to help bootstrap the MIPs Framework and ultimately bring Maker Governance into a new and more active phase. The MIPs suggested by the Maker Foundation will be proposed through a process called “MIPs Under Review.” Defined in the Core Governance Framework MIP Set, MIPs Under Review are placeholder proposals that enable the governance community to begin earning practical experience operating the DAO through a formalized framework; they are not intended to be the final, long-term solutions. The expectation is that members of the community will gain practical experience from the processes defined in the MIPs released by the Foundation, and continue to draw on those experiences for the long term. Process MIPs and Sub Proposals Two of the many important concepts that the MIPs Framework will introduce are Process MIPs and Sub Proposals (SPs). Process MIPs are used to create and define a specific recurring process that the Maker Protocol or Governance will employ. For example, a Process MIP could be created for collateral onboarding or the election of EPCs and Domain Teams. Once ratified through governance, Process MIPs can interact with Sub Proposals. Sub Proposals behave similarly to MIPs but will not have to go through the full governance process. Therefore, the implementation will be quicker. The first two sub proposals will be recommended by the Maker Foundation before April 15. On Monday, April 6, the Maker Foundation will release the first 13 MIPs, grouped into MIP0 and two MIP Sets. MIP0 (Maker Improvement Proposals Framework). At its core, the MIPs Framework is the underlying structure of the governance processes that will be used to continuously effect change and maintain the Maker Protocol in a standardized manner. It provides the necessary tools, and resources for the community to have a simple, standard approach to proposing new improvements, specifications, or process changes to the Maker Protocol and Governance system. The framework is a first step in enabling organic growth that will bring MakerDAO closer to self-sustainability. The first MIP Set is the Core Governance Framework , which defines the key governance structures, laying the backbone of long-term governance processes, such as how to organize executive votes. A key concept of this first MIP Set is the monthly Governance Cycle, which proposes a new, longer process that will exist in addition to the current weekly cycle, and will be optimized for important decision making, secure collateral onboarding at scale and providing the community with a more accessible overview of what decisions are being made. The second MIP Set is the Collateral Onboarding Framework . This Framework is based on the independently community-created collateral onboarding document and will provide an end-to-end framework for scalable collateral onboarding that interoperates with the Governance Cycle and the existing Domain Teams. The Maker Foundation expects the rollout of all of the MIP Sets covering the initial Governance Paradigm to occur over the course of 1-2 years. During this time, the timeline and plan itself will be actively reviewed and revised by the Maker community in order to ensure maximum flexibility for the needs and circumstances the Protocol finds itself in. The 13 initial MIPs will be published in a new category on the Maker Forum titled “MIPs.” The MIPs category will have subcategories in order to help manage the conversation and filter the MIPs process going forward. On April 27, just 21 days after publication of the first MIPs, a special governance poll, called a timing poll, will occur. The timing poll will have two options:  Proceed with the ratification vote of the 13 proposed MIPs immediately, or; Delay the ratification for one month, and then institute a period of time to allow competing proposals to be submitted by the community.  If the timing poll resolves in delaying ratification one month, the competition process would begin immediately. The competition process is a MIPs proposal process, where multiple versions of MIPs are presented as choices to the community. For example, there could be several versions of MIP3, which describes the Governance Cycle. The community would vote for the version they want to be included in the final MIP Set and put up for the ratification vote. If the vote decided to delay ratification for one month, the deadline for submitting competing MIPs proposals would be May 20th. Once the deadline has been reached, a vote will be proposed, where the community would select the final individual MIPs to create bespoke MIP Sets. This vote would happen from May 23 to 26. Lastly, the final ratification vote would begin May 27 and end on May 30, ultimately resulting in the initial MIPs becoming ratified and the first Governance Cycle beginning June 1st. If, on the other hand, the timing poll resolves to proceed with the ratification vote of the MIPs immediately, that vote will occur over four days, May 1-4. If the ratification vote resolves to yes, the first Governance Cycle would begin on May 4.  A Preview of the Initial 13 MIPs  The MIPs Framework MIP0 (The Maker Improvement Proposals Framework): MIP0 outlines the framework and process for improving both Maker Governance and the Maker Protocol. Through an open and documented proposal process, community feedback will be collected to reach the broadest possible consensus on how the Maker Protocol should evolve.  Core Foundational MIPs Set MIP1 (Maker Governance Paradigms): A Governance Paradigm is a complete and specific group of MIP Sets that solve an entire “problem space”—a list of problems that must be addressed in order for the Maker Protocol to be able to sustain itself and grow into the future Maker governance. MIP2 (Governance Launch Period): The Governance Launch Period ensures that the process of implementing or altering critical governance process logic is done at a pace that gives the community enough time to scrutinize and understand specific ideas. MIP3 (Governance Cycle): The Governance Cycle provides a predictable framework for Maker Governance decisions. The Governance Cycle provides participants (MKR holders) with a monthly overview of the decisions that are to be made, allowing participation despite time constraints. MIP4 (MIP Amendment and Removal Process): The process for making very small and relatively superficial changes to existing MIPs. MIPs that require large changes will be replaced with new MIPs. Changing small details to MIPs should not require the original MIP to become obsolete. Therefore, this process is needed to define and outline the way to make changes to MIPs once they have already been ratified and implemented. MIP5 (Emergency Voting System): Emergency Votes are Executive Votes that can be initiated by any community member in order to overcome the limits of the Governance Cycle (MIP3) in special situations where timing is critical.  Collateral Onboarding MIPs Set MIP6 (Collateral Onboarding Form/Forum Template): standardized collateral onboarding form/forum template will help community members and third-party projects begin the process of getting their collateral approved to be onboarded to the Maker Protocol. MIP7 (Collateral Onboarding Domain Teams): In order to build a decentralized workforce to help with the security, maintenance, and long-run development of the Maker Protocol, we need a defined process for onboarding and offboarding domain teams that required for the collateral onboarding process. MIP8 (Domain Greenlight): Domain Greenlight is the process where at least one team from each domain (Risk, Integration, Smart Contracts, Oracles, Legal, etc) “Greenlights” the collateral type (based on research) in order for the collateral onboarding process to proceed. MIP9 (Community Greenlight): Community Greenlight is the process through which MKR token Holders inform the Domain Teams of their preferences for collateral types that have been proposed through MIP6 and passed MIP8. Their preferences are expressed via an on-chain governance poll that will run for a period of two weeks. MIP10 (Oracle Requirements for Collateral Onboarding): In the Maker Protocol, every collateral type has a corresponding Oracle that publishes a reference price based on external price feeds. Therefore, the Oracle requirements must be defined in the collateral onboarding process. MIP11 (Collateral Onboarding Risk Models): Risk models are crucial to the health and growth of the Maker Protocol. The purpose of this proposal is to create a defined and formalized process for Risk Team’s to easily onboard their models to the Protocol. MIP12 (Collateral Onboarding and Risk Parameter Adjustment Process Documentation Requirements): This proposal defines the overall collateral onboarding process requirements needed from Domain Teams, as well as the collateral onboarding process blueprint for proposing new risk parameters, oracles, and adapters for a new or existing collateral type.  Next Steps Visit the new MIPs category  on the MakerDAO Forums on Monday to review the first 13 MIPs and provide feedback. All community members are urged to participate in the review process. These MIPs will also be published on Maker’s official Github page. Throughout this process, I’ll be available to answer any questions and facilitate discussion on the topic of MIPs and long-run governance here on the forum and in the dedicated #mips channel on MakerDAO’s public Rocket Chat. ",
                    "links": [
                        "https://blog.makerdao.com/beyond-holding-mkr-the-responsibility-of-decentralized-makerdao-governance-voting/",
                        "https://forum.makerdao.com/t/announcement-kickstarting-the-self-sustaining-makerdao-initiative/1864",
                        "https://www.youtube.com/watch?v=vSYO6l0Veq4&feature=youtu.be",
                        "http://www.youtube.com/watch?v=vSYO6l0Veq4&t=66m50s",
                        "https://forum.makerdao.com/t/mandate-interim-governance-facilitators/264",
                        "https://forum.makerdao.com/t/mandate-risk-teams/282",
                        "https://forum.makerdao.com/t/mandate-oracle-teams/443",
                        "https://forum.makerdao.com/t/collateral-onboarding-process-v1/1412",
                        "https://forum.makerdao.com/c/MIPS/14",
                        "https://github.com/makerdao",
                        "https://go.rocket.chat/invite?host=chat.makerdao.com&path=invite/NPEuhW",
                        "https://forum.makerdao.com/t/mips-0-through-12-index/2092/2",
                        "https://forum.makerdao.com/t/mkr-holder-dai-gest-week-14-for-real-2020-today-is-the-first-day-of-the-rest-of-the-dao/1892",
                        "https://forum.makerdao.com/t/mip2-launch-period/1904/8",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-april-9-9am-pst-4-00-pm-utc/1938/3",
                        "https://forum.makerdao.com/t/using-chainlink-oracles-for-link-usd/2670/14",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-june-11-9am-pst-4-00-pm-utc/2742/4",
                        "https://forum.makerdao.com/t/project-compass-conceptual-framework/8845",
                        "https://forum.makerdao.com/t/mip0c12-sp1-subproposal-for-core-personnel-onboarding-mip-editor/2133",
                        "https://forum.makerdao.com/t/the-collateral-dai-lemma-mkr-holder-dai-gest-week-16-2020/2079",
                        "https://forum.makerdao.com/t/the-release-of-the-13-initial-maker-improvement-proposals-mips/1915",
                        "https://forum.makerdao.com/t/changes-to-the-governance-and-risk-call-no-more-general-team-updates/10361",
                        "https://forum.makerdao.com/t/mips-updates-1/2456",
                        "https://forum.makerdao.com/t/maker-governance-review-february-2021/6803",
                        "https://forum.makerdao.com/t/maker-governance-review-january-2021/6296",
                        "https://forum.makerdao.com/t/maker-governance-review-november-2020/5453"
                    ],
                    "GPT-summary": "The Maker Foundation has announced the launch of the Maker Improvement Proposals (MIPs) Framework, which will provide a mechanism for any community member to define key issues and suggest changes and additions to the system. The post details the Maker Foundation’s vision for the Self-Sustaining MakerDAO Initiative, which requires a system for creating new processes, sharing knowledge, building off the current governance system, and building new technology when needed. The Maker community will focus on three elements of a self-sustaining DAO: Elected Paid Contributors (EPCs) and Domain Teams, the Maker Improvement Proposals (MIPs), and Vote Delegates. The post also provides details on the first 13 MIPs that will be released in April.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.605902703853523
                },
                {
                    "author_link": "https://forum.makerdao.com/u/andytudhope",
                    "index": "#2",
                    "likes": "1",
                    "time": "06/04/2020-09:27:34",
                    "content": "Thank you this Charles - it’s a lot to take in and reflect on. Really nice work! My only comment is one small point for clarity. In the “Process MIPs and Sub Proposals” section it is outlined that there is the Core Governance Framework and the Collateral Onboarding Framework. Perfectly sensical so far. However, in the CGF, the example given is this:     charlesstlouis:  secure collateral onboarding at scale and providing the community with a more accessible overview of what decisions are being made   Huh? Why is secure collateral onboarding the example given for CGF, especially when it has its own section? This was cleared up for me when I read Preview section later, but not before then. Might I recommend editing the CGF section to reflect more accurately the examples given in the preview further down? To me, the CGF needs to be about monetary policy, ES, the difference between technical and fiscal fixes, governance cycles and paradigms, etc etc - all the stuff we’ve been dealing with. Best not to mix collateral onboarding in there at all, imo. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5609567901234565
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "1",
                    "time": "06/04/2020-12:00:01",
                    "content": "    charlesstlouis:  I’ll be available to answer any questions and facilitate discussion on the topic of MIPs and long-run governance here on the forum and in the dedicated #mips-ext channel  on MakerDAO’s public Rocket Chat.   This channel has been renamed to #mips. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#4",
                    "likes": "0",
                    "time": "06/04/2020-16:17:00",
                    "content": "Hey @andytudhope, thank you! I agree that the way it reads may be a little misleading. You are correct to say that the CGF focuses on the core of long-term governance. The point was that the CGF MIP Set is critical for getting collateral onboarding up and running as well as positioning the Collateral Onboarding Framework COF to operate smoothly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.354166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sneg55",
                    "index": "#5",
                    "likes": "0",
                    "time": "06/04/2020-19:10:44",
                    "content": "    charlesstlouis:  and be paid by the Protocol.   Can you clarify how it’s going to work? Paid from fees acquired or from MKR inflation/dilution? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#6",
                    "likes": "1",
                    "time": "07/04/2020-15:20:30",
                    "content": "Hey Nick, nice to see you here!  There are no formalized processes in place yet. However, there is an internal working group within the Foundation that is focused on the research and design of it. The results from this working group will ultimately lead to a proposed structure, likely in the form of a MIP within a future MIPs Set for EPCs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#7",
                    "likes": "4",
                    "time": "07/04/2020-16:12:33",
                    "content": "Any reason that work isn’t happening publicly? Alot of us have been wanting/trying to engage on the question of compensation for awhile, with little engagement. I see that as a more critical issue than delegation. The protocol can run without vote delegation, it cannot run without people building/adjusting it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.390625
                }
            ]
        }
    ]
}