{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/vote-for-all-polls-in-one-transaction/3244",
            "title": "Vote for all polls in one transaction ",
            "index": 3244,
            "category": [
                "Governance"
            ],
            "tags": [
                "voting",
                "fees"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#1",
                    "likes": "3",
                    "time": "17/07/2020-08:37:21",
                    "content": "Is it possible to optimize voting so that only one onchain transaction is generated? It would be also great if MakerDAO could sponsor the tx fees for voting. One more thing - the page https://vote.makerdao.com/polling is very slow for me. Is it possible to optimize the loading of that page? ",
                    "links": [],
                    "GPT-summary": "The author of the post is asking for feedback on the possibility of optimizing voting for all polls in one transaction and requesting MakerDAO to sponsor the transaction fees for voting. Additionally, the author is providing constructive criticism by suggesting the optimization of the loading of the polling page. The post also includes a question about the possibility of optimizing the loading of the polling page.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.758333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#2",
                    "likes": "1",
                    "time": "17/07/2020-08:43:02",
                    "content": "Most likely such potential voting improvements would be addressed by or along with a Governance Chief Contract Redesign: A Pre-MIP Discussion ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#3",
                    "likes": "9",
                    "time": "17/07/2020-09:36:26",
                    "content": "Hi @bit Yes! Voting for multiple polls in a single transaction is top of our priority list and something that we are working on right now. Page load time optimisation is also part of the redesign. I’ll share as soon as we settle on the updated UX. This is a separate initiative from the Chief Contract Redesign. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.892857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#4",
                    "likes": "0",
                    "time": "17/07/2020-09:47:04",
                    "content": "Thanks! Do you think we could have the optimized voting in less than 3 months? It’s hard to know what the current Maker developements are. It would be nice to have something like https://cash.coin.dance/development with a list of all projects and progress (“Under Discussion”, “Under Development”, “Completed”…) EDIT: Even if we optimize voting on L1, it will cost > $1 which is not cool. When the price rises to $50 then only whales will vote to push their specific agenda. We have to minimize governance and move to L2. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.135416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#5",
                    "likes": "6",
                    "time": "17/07/2020-12:13:44",
                    "content": "Re: Release timeline for batched transactions Batched transactions is part of a larger release ‘package’ that includes a redesigned Governance front page for easier access to information, as well as optimised polling (more efficient presentation and user interaction with polls) and an executive voting page redesign. Yes, I would expect us to release this within 3 months. Re: Knowing current Maker developments Cool, thanks for sharing that link, I’ll look into how we can better communicate the development pipeline while managing release expectations (which is the really challenging aspect as the ecosystem develops and new initiatives find their way into the roadmap). Re: Layer 1 and Layer 2 solutions Agree! We are at the very early investigative stages of exploring Layer 2 solutions for Polling…which if successful then I imagine we will scale a solution to support executive voting too. So, again, early stages on this but L2 solutions are a prime fit for such a use case. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.38479020979021
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#6",
                    "likes": "4",
                    "time": "17/07/2020-14:36:18",
                    "content": "    Derek:  We are at the very early investigative stages of exploring Layer 2 solutions for Polling      All I can think about when I vote is if ETH ever goes to 10K, all these polls are $40 a pop… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6499999999999995
                }
            ]
        }
    ]
}