{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/soft-locks-and-future-guidance-a-pre-mip-discussion/2875",
            "title": "Soft Locks and Future Guidance: A Pre-MIP Discussion ",
            "index": 2875,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "alignment",
                "signaling",
                "risk-model",
                "idea",
                "rates",
                "mips"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#1",
                    "likes": "5",
                    "time": "18/06/2020-13:58:56",
                    "content": "Economies of scale and network effect stipulate that the growth of Maker ecosystem is mutually beneficial to all its participants. It improves liquidity and increases competitiveness by bringing more players. One of the measures of Maker growth is DAI supply, increasing of which can be achieved by increasing the user base, and one of the ways to increase the user base is to reduce major risks associated with lending and borrowing. For both Dai and Vault users, one of the main risks today is the Base Rate / DSR risk and currently, there are several solutions coming to the market helping to redistribute this risk. Once this risk is dealt with, other risk factors are Spread and RP. It is possible to reduce such risk by entering into soft agreements with users offering predictable rates, and/or future guidance, and/or rules. Of course, MakerDAO should be able to change interest rates to protect itself from risk. MakerDAO cannot be pinned to any parameters. If there are new risks MakerDAO must be able to respond to them. One example outcome is when Maker Governance lists possible situations in which the RP will be changed. Example rules could say that Maker will change the RP if:   The nature of the assets risk profile changes in a material way   There is new news regarding the asset   Maker suffers an unfavourable liquidation event with a related asset   The debt ceiling is raised   5… Etc… (could be a long list of other events) That way Vault owners will understand that they are not being charged additional fees without proper justification and can better assess the risks on their own I encourage Maker governance contributors to comment below on whether or not they would support such a proposal and if so what they would like the future guidance to look like. (i.e. what terms they would like to see) Hopefully, this will eventually turn into a MIP13 Declaration of Intent MIP, where MakerDAO can signal its intent - offering predictability and fairness to users. Disclosure: I am an owner of a company that helps Vault/Dai users hedge BaseRate/DSR. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-june-18-9am-pst-4-00-pm-utc/2814/6",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-june-18-9am-pst-4-00-pm-utc/2814/5",
                        "https://forum.makerdao.com/t/weekly-mips-update-6/2914"
                    ],
                    "GPT-summary": "The author proposes reducing risks associated with lending and borrowing in the Maker ecosystem by entering into soft agreements with users offering predictable rates, future guidance, and rules. MakerDAO should be able to change interest rates to protect itself from risk. The author asks for feedback from Maker governance contributors on whether they would support such a proposal and what terms they would like to see. The author also discloses that they own a company that helps Vault/Dai users hedge BaseRate/DSR.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.966982323232323
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "18/06/2020-14:37:21",
                    "content": "Might be this belongs more in the #MIPs:proposal-ideas category than here. Interesting idea though! I’d be interested to see others thoughts. I’ll also highlight that it’s still not a surety that MIP13 will be ratified. (Minor note, MIP13 is the Declarations of Intent MIP, MIP14 was Protocol DAI Transfer.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.65625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#3",
                    "likes": "1",
                    "time": "18/06/2020-14:56:21",
                    "content": "Ok, I’ve just updated it to say 13 instead of 14 and changed the category. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#4",
                    "likes": "2",
                    "time": "18/06/2020-15:42:53",
                    "content": "A soft locked rate would have to be higher than the volatile base rate. For example, maybe you could lock a long term rate on ethereum for 5% right now. there would need to be some new parameter that represents the spread between the current base rate and the long term stable rate (say 3-5% premium) I would also think a long term rate vault should have a lower debt ceiling than a standard vault. In a lot of ways the existence of a long term rate like this hurts makerdao bc it reduces our capacity to alter supply and demand and so fix the peg. But potentially it could also be a source of greater revenue for mkr holders. Worth exploration for sure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.085024350649351
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#5",
                    "likes": "4",
                    "time": "18/06/2020-17:26:00",
                    "content": "When we’re at the effective lower bound on rates, forward guidance can be extremely helpful for regaining and maintaining the peg. The US Fed has seen good results from forward guidance in meeting their policy objectives (USD stability and economic health), I think Maker could see good results as well for ours (USD peg and supply expansion). An observation made by the Fed was that benchmarking to specific economic outcomes (unemployment rate, inflation rate) was much more effective and credible than timelines. I think it would be best to test this out with commitments relating base rate to DAIUSD price and dsr spread to DAI market cap, something like: base rate < 2% until 1 month avg DAIUSD < 1 and 24 hr avg DAIUSD < 0.995 dsr spread < 2% until DAI market cap = 500,000,000 DSR spread would probably be the least risky param to try this out on. If this was MIPified, it could even be possible to only offer rate options within the agreed range for governance polls (similar to how only ± 4% changes are currently supported). I see this as a solution for maintaining confidence in our monetary policy, rather than specifically helping vaults manage interest rate risk. Derivatives markets will emerge to help borrowers hedge this. I’m not sure how I feel about forward commitments on risk premia until the collateral packages have longer history and governance has had more time to make adjustments. ",
                    "links": [
                        "https://cointelegraph.com/news/delta-cryptocurrency-exchange-launches-interest-rate-swaps"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7440476190476195
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#6",
                    "likes": "2",
                    "time": "18/06/2020-18:55:15",
                    "content": "IMHO forward guidance is not as necessary with DSR/BR. The reason is because it straightforward to hedge. If you own a vault you want to avoid rates going higher, conversely if you own Dai you want to avoid rates going lower. So Dai and Vault holders trading against each other creates an elegant way for them both to be protected from the risks. That could be via Options, Futures, or FRAs. However the slight problem with all the of the hedging solutions to date is that they cannot protect you from RP. Now, as opposed to DSR/BR there does not exist any entities which have the inverse exposure from a Vault holder. If Vault hodlers trade against Dai holders for DSR who do they trade against for RP? So while derivative markets are forming to protect from monetary policy decisions it is extremely difficult if not impossible to create any market of comparable size for RP risks. Of course there can emerge some insurance but the amount of parties willing to provide such insurance is small if anything right now. Compare that to Dai holders who want to be protected which is naturally massive. I agree that forward commitments is an issue but I believe the solution is not to avoid them altogether but rather to create very broad conditions that allow for changes in many scenarios. For example we can have the risk team provide an exhaustive list of scenarios that would require a change. That way MakerDAO still has freedom and Vault holders can still gauge risks and not feel cheated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.804009103641457
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#7",
                    "likes": "4",
                    "time": "18/06/2020-22:48:59",
                    "content": "I really want to consider this more but there are issues with hvaing fixed rates.   The primary one is that from what I can tell SF basically is to manage the DAI PEG.   If there were other liquidity or PEG management mechanisms the SF probably wouldn’t have to change that much.   In the suggestion above literally one is asking the bank to take the risk of the rate lock and basically the bank has to lay off those bets to hedge rate risk or face possible losses.    Normally we DO NOT want the banks to take this risk which is why they have multiple mechanisms to offset this risk that Maker current doesn’t have.    Also banks don’t have to worry about monetary policy where as Maker does. I liken having limitations on SF changes to tying the hands of the FED on monetary policy. It looks like various secondary markets will pop up to provide rate hedging. Yield is one that I also am still trying to digest the implications of.   research.paradigm.xyz    Yield.pdf 271.62 KB      Everyone is looking at a particular ‘issue’ and few people are looking at the larger picture of what all these little innocous looking legos are setting up to build (and likely set up for collapse). My concern here is that this isn’t something Maker should do because there seems to be general thinking that PEG (or monetary policy management) IS more important than rate stability.   I tend to agree with those that hold this view.     My greater concern is rampant and unchecked growth of DAI generally mostly because no-one seems interested in growing DAI in steps.   Example: What happens when we hit DC and stay there for a while (say on ETH or on the total DC).   As far as I know fixing the debt limits and trying to manage the PEG with SF and DSR is probably going to be difficult without secondary liquidity injection/removal mechanisms.   I literally believe that Maker itself could stop a run in collateral prices simply by constricting DC growth during those times but I don’t think anyone would vote to test this theory.   IMO Instead governance will let the bubble grow and then allow it to collapse just like Central Banks are doing now. I literally am less concerned with providing a more stable borrowing rate environment if it is going to hazard monetary policy as I already see secondary markets stepping forward on this issue looking to provide rate arb. Should Maker consider this.   Sure but honestly I don’t see this is some ‘critical issue’ to be solved. If I had a wish list in order of importance.  Fix auction system (being worked on) Provide various Liquidation buffers (either adjusting liquidation fees due to market conditions as well as provide other insurance mechanisms to either give vaults - time - or an improved liquidation buffer).   Reduce the load on the auction system generally in good and bad times. Test the used of the DSR against PEG and liquidity (untested as far as I can tell because too many people are hot on DAI growth here vs. understanding how the system will work by testing, collecting data and applying science to understand how it might work under the varied market conditions we might experience). Build a real surplus in assets other than DAI that should maintain value during both good and particlarly bad times.  Use this surplus as a DAI liquidity injection removal mechanism, as well as an account to cover decentralized Maker expenses (ala MIP13/14 etc.), and a war chest against catastrophic events (tail risks) providing a protection layer against MKR dilution at expense of less MKR repurchasing. Create new DAI deposit facilitie(s) with different effective rates and fixed terms which can be used to provide DAI liquidity to the system for various critical uses (like bonds).   Example1: company bonds which are issued at fixed rates with terms and funds used to improve operations or put in new systems, bring on new assets whatever…   Example2:  To provide liquidation DAI liquidity for a fee which becomes an additional return on the DAI bond.   BTW I expect these kinds of bonds to trade more like company bonds and these could provide the fixed rate vehicle you are talking about…  I do like people bringing up new ideas. If I had questions regarding this idea I would ask:  What is the real goal with your suggestion? Who benefits, why? Where does the risk reward land how? Does Maker have to do this or will secondary markets take care of this by themselves? How does this suggestion improve the entire ecosystem in terms of stability as well as growth?  ",
                    "links": [
                        "https://research.paradigm.xyz/Yield.pdf",
                        "https://research.paradigm.xyz/Yield.pdf",
                        "https://forum.makerdao.com/t/signal-request-adjust-the-wbtc-debt-ceiling-and-risk-premium/2824/25"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.449705387205387
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#8",
                    "likes": "1",
                    "time": "19/06/2020-02:07:24",
                    "content": "    MakerMan:  Create new DAI deposit facilitie(s) with different effective rates and fixed terms which can be used to provide DAI liquidity to the system for various critical uses (like bonds). Example1: company bonds which are issued at fixed rates with terms and funds used to improve operations or put in new systems, bring on new assets whatever… Example2: To provide liquidation DAI liquidity for a fee which becomes an additional return on the DAI bond. BTW I expect these kinds of bonds to trade more like company bonds and these could provide the fixed rate vehicle you are talking about…   I very much agree with this method. I think it will be the most direct and effective way to solve the DAI expansion and pegging the exchange rate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.08969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#9",
                    "likes": "4",
                    "time": "19/06/2020-07:22:06",
                    "content": "In theory the proposal is good, and the above suggested method with a list of events and then simply checking off which events have happened since last time is functional. The method is presently in use for geopolitical and country risk analysis just to mention two examples. The method does however have drawbacks:  It is bureaucratic and time consuming. Elements of subjectivity will always remain. Introducing and impact checking events is both difficult and subjective. The method is not forward looking, but continuously trying to assess whether the present parameters are correct for the present situation.  You state that you run a company that helps Vault/Dai users hedge BaseRate/DSR. Well in that case - in a friendly way I will fire your MIP proposal right back at you. You can develop the above proposal in your own company and then simply sell the results back to Maker. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4869047619047615
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#10",
                    "likes": "0",
                    "time": "19/06/2020-16:38:14",
                    "content": "Thank you all for your responses. I am going to wait for some others to reply and I will submit my thoughts next week. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#11",
                    "likes": "0",
                    "time": "22/06/2020-14:17:26",
                    "content": "To answer your questions @MakerMan  The real goal of this proposal is to combine the power of the forward guidance with pre-existing efforts in interest rate derivatives to allow MakerDAO to compete more aggressively against legacy financial institutions thereby increasing Dai supply Vault owners benefit from more transparency and fairness around what they pay. The reward is in #2, the risk is next to zero, as long as the intent proposal states events in an extremely broad fashion. As a result MakerDAO would have unlimited flexibility with the advantage of increased transparency. As said in my above post, secondary markets will likely not take care of this themselves. What secondary markets will take care of is DSR and BR risk, that is because there will be adequate participation from both sides. Conversely, with RP risk the landscape is more uncertain. This is beneficial for growth as said in #1   Summarizing the responses, we are pleased with the overall thoughtful reaction to this proposal. The nature of the proposal is transparency of the risk premium (RP), and we suggest that it will become a part of the roadmap for the risk team(s) to develop and publicize its guidance as part of any (periodic or continuous) risk assessment. The writeup Mandate: Risk Teams recounts the sources of risk, but RP, as well as emergency DAI supply for undercollateralized vaults, falls into a separate category of risk costs. Both risk sources and risk costs can be part of the future comprehensive (“enterprise-wide”) risk model. Note: Addressing the recurrent comment about the danger of fixed rates affecting the capability of Maker to control the DAI/USD peg, a time-dependent ceiling of fixed-rate borrowing can be incorporated into risk management model (similar to collateral ceilings). We would be glad to collaborate and discuss with the risk teams in the due course. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.671626984126984
                }
            ]
        }
    ]
}