{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/beg-and-chop-adjustments-for-uni-lp-vault-types/6602",
            "title": "'beg' and 'chop' adjustments for UNI LP Vault Types ",
            "index": 6602,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "sig-status-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "6",
                    "time": "16/02/2021-20:45:39",
                    "content": "Hey all, If you read our recent MakerDAO FLIP Auctions report, you might have noticed that one UNI LP auction cleared with only 1 participant bidding and only a fraction of penalty fee collected, which raises concerns around our keeper ecosystem for UNI LP auctions. Before debt ceilings of UNI LP vault types get increased, we need to make sure we have more keepers participating in these auctions. To incentivize more keepers setting up their infrastructure to bid on UNI LP auctions, we might want to increase both ‘beg’ (auction bid increment in %) and ‘chop’ (penalty fee) values. Higher ‘beg’ should make keepers more comfortable bidding since the first bid carries some advantage. Higher ‘chop’ on the other hand should make vaults more cautious not to get liquidated. Current ‘beg’ is 3% and ‘chop’ 13%. We are thinking of increasing both ‘beg’ and ‘chop’ by at least 2% (5% for ‘beg’ and 15% for ‘chop’). These parameter changes would apply for all UNI LP Vault types (both onboarded and pending).    What should be the new ‘beg’ (auction bid increment in %) value for UNI LP vault types?  3% - no change 5% 7% 9% Abstain     0 voters        What should be new ‘chop’ (penalty fee) value for UNI LP vault types?  13% - no change 15% 17% 19% Abstain     0 voters     This poll closes next Thursday 25th February. Winning votes will go into on-chain poll on Monday 1st March. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-129-thursday-february-18-17-00-utc/6506/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-33/6694",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-february-21st-2021/6741",
                        "https://forum.makerdao.com/t/governance-at-a-glance-feb-12-18-2021/6644",
                        "https://forum.makerdao.com/t/uni-v2-dai-usdt-collateral-onboarding-risk-evaluation/6659",
                        "https://forum.makerdao.com/t/flip-auctions-parameter-adjustment-proposal/6732",
                        "https://forum.makerdao.com/t/maker-relay-ep-33-en-espanol/6729"
                    ],
                    "GPT-summary": "The author of the post is explaining a proposal to increase the 'beg' and 'chop' values for UNI LP Vault types to incentivize more keepers to participate in auctions. The post includes a poll asking for feedback on what the new values should be. A third party could give constructive criticism by suggesting alternative values or asking for more information about the potential impact of the proposed changes. They could also ask questions about the current values and how they were determined.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.052033492822967
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#2",
                    "likes": "1",
                    "time": "16/02/2021-21:29:35",
                    "content": "I’m a bit conflicted with this because UNI LP vaults with DAI actually have much less market risk compared to bidding on regular vaults. UNI LP tokens are less volatile than their underlying. The standard beg and chop actually results in a bigger volatility buffer for Keepers and MakerDAO compared to regular vaults. (Though there may be more gas involved for unwrapping UNI LP tokens.) Also a bit of low sample size (and a small debt size to boot). Our sample was one vault that had a debt of $3500 and only 1 bid. Though I’d agree if you think beg should be raised for some of the other vaults too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.919871794871796
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#3",
                    "likes": "3",
                    "time": "16/02/2021-21:31:56",
                    "content": "This was just one - 1 - auction. I don’t want to change any system parameters just because of a single incident. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.642857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#4",
                    "likes": "3",
                    "time": "16/02/2021-21:47:09",
                    "content": "Yes, you both raised very good points. The current ‘beg’ should be already high enough to incentivize keepers to bid compared to other vault types where volatility is higher. Also I agree that sample size is small and this happened earlier at onboarding. But there are other issues as well that we heard of: for instance, keepers might not be properly equipped with how to price UNI LP tokens. UNI LP Vaults might have 100m+ exposure in the near future if we are to raise DC per each over 10m. We really want to make sure there is more than one keeper. Even when comparing ETH-A to other vault auctions you can see less keepers are bidding on other vaults. I imagine it is way worse for UNI LPs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.3429824561403505
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#5",
                    "likes": "1",
                    "time": "16/02/2021-22:28:30",
                    "content": "Isn’t the solution to process liquidation by assets instead of by ilk? By split the UNI poll in two different assets especially dai assets - I am not convinced either to be honest -. But it seems we have the same problem with eth-b. May be I am a bit out of subject. Sorry for that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.944444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#6",
                    "likes": "3",
                    "time": "16/02/2021-23:33:53",
                    "content": "    Planet_X:  This was just one - 1 - auction. I don’t want to change any system parameters just because of a single incident.   I want to echo this.   I also want to emphasize something I have mentioned in the past.   When one has an issue, and wants to address it what exactly is the measurement system you are going to use to measure success?   In this case you have 1 data point and are calling the keeper system bad and want to change system parameters.  You could put those parameters where ever you want and if you don’t even attempt a measurement of keeper participation you will never know whether you changed anything for better or worse until you have a real market event that illustrates yet again the same issues.  network access problems capital cycling or availability issues lack of keeper participation for probably 5-10 different reasons. no ability to actually test the keeper system (I don’t even know if anyone has put thought into how maker could construct such a system test btw) lack of a good liquidation dashboard and liquidation analytics (much less vault analytics to assess risk directly).  Some things are coming around but I still find it difficult to get even basic liquidation data  to understand what is happening in this regard with Maker.  How many keepers participate, how much capital and/or collateral do they have at their disposal, etc.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.21547619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#7",
                    "likes": "3",
                    "time": "17/02/2021-00:14:39",
                    "content": "Changed vote due to small sample size like others have said. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#8",
                    "likes": "3",
                    "time": "17/02/2021-21:53:21",
                    "content": "Two failed UNI LP auctions today, no bids this time. The other one cleared almost successfully. These vaults were just onboarded recently though, but it doesn’t look good. Screenshot 2021-02-17 at 22.46.532254×364 54.7 KB ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#9",
                    "likes": "1",
                    "time": "18/02/2021-00:19:06",
                    "content": "Free money smh… This space has like 100 people and 10k smurf accounts I swear to god. The human power bandwidth is astonishingly low. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#10",
                    "likes": "0",
                    "time": "18/02/2021-00:29:14",
                    "content": "Though you can’t bid on those debt auctions with the defisaver interface yet. At least we didn’t have 0 bids  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#11",
                    "likes": "1",
                    "time": "18/02/2021-00:33:00",
                    "content": "Or if Debt Auctions (Beta) - Maker Auctions was updated. There never was a real effort (it seems) to develop a robust keeper system. To be fair these are small liquidations and gas prices are pretty crazy right now so I can kind of understand in these circumstances. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.846938775510204
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#12",
                    "likes": "1",
                    "time": "18/02/2021-14:36:55",
                    "content": "It seems that the idea with liq2.0 is to have a bot from outside using other exchanges. While I am not sure it is a good idea as it depends from outside, it is probably the simplest/efficient solution. At the end of the day I really like the simplicity of liq1.x. It feels sad that this elegant solution didn’t work. However, I am not sure there were any benefit to have the auction website up for just a couple of months. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.152777777777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#13",
                    "likes": "1",
                    "time": "18/02/2021-17:38:30",
                    "content": "voted for 5% on gap. i guess the additional work needed for recycling the auctioned collateral needs to be worth the effort. we can go back to 3% as soon as we see more participants in the competition imho chop should not be changed. when you open a vault it clearly states that the penalty fee is 13% - we should refrain from changing that ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#14",
                    "likes": "2",
                    "time": "23/02/2021-23:12:47",
                    "content": "I think ‘beg’ should be increased for more vaults. With such high gas prices, some Keepers may be disincentivized from entering into bidding wars for a 3% beg. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#15",
                    "likes": "0",
                    "time": "26/03/2021-09:13:23",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}