{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - SB-LDB (SolidBlock London Digital Bonds) - February 15, 2021",
            "index": "6276",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "32,923",
            "highest_fraction": 0.93
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/sb-ldb-mip6-application-solidblock-democratizes-real-estate-with-london-digital-bonds-a-smart-tradable-property-investment/6276",
            "title": "[SB-LDB] MIP6 Application: SolidBlock Democratizes Real Estate with London Digital Bonds - A Smart & Tradable Property Investment ",
            "index": 6276,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Yael_Tamar",
                    "index": "#1",
                    "likes": "2",
                    "time": "30/01/2021-07:33:44",
                    "content": "London Chelsea Real Estate LLC is a property fund formed to acquire, renovate, manage and sell prime residential real estate throughout in-demand neighborhoods in the city of London. We offer investors the opportunity to purchase London Digital Bonds (LDB) which will receive interest payments of 10% per year and potentially additional interest payments depending upon the success of the Fund. The LDBs have a term of 5 years. The fund is co-managed by London Chelsea Limited (“LCL”), a British company that has several decades’ worth of expertise in London real estate, and SolidBlock Inc. (“Solidblock”), an internationally recognized pioneer in tokenization and the developer of our fully compliant tokenization platform. 1. Who is the interested party for this collateral application? London Chelsea Real Estate LLC, a Delaware limited liability company (The “Company”) jointly owned by SolidBlock Inc. and London Chelsea Limited (LCL) is the interested party for this collateral application. London Chelsea Real Estate LLC (the joint “Company” that is issuing the LDB) is registered with the U.S. Security and Exchange Commission and incorporated in the state of Delaware. For financial reporting, their fiscal year ends on December 31st. This page includes all SEC registration details as well as a list of all documents (S-1, Prospectus, Current Reports, 8-K, 10K, Annual Reports) filed by London Chelsea Real Estate LLC. Source on the SEC website: https://sec.report/CIK/0001842421 Using SolidBlock’s advanced platform on the Ethereum blockchain (the “SolidBlock Platform”) and LCL’s experience in investing in property in London, investors will be able to purchase the product - London Digital Bonds (the “Tokens” or “LDBs”). Main Contacts - SolidBlock: Co-Founder and CMO, Yael Tamar:[email protected]; LCL: Andrew Thompson, CEO: [email protected] 2. Provide a brief high-level overview of the project, with a focus on the applying collateral token The project leverages the experience and abilities of London Chelsea Real Estate in identifying and investing in highly discounted residential properties in London with SolidBlock’s state-of-the-art digital securities platform, which enables fractional ownership of the underlying assets or fractional entitlement to certain rights (revenue or interest) as well as trade of assets via OTC on SolidBlock platform or through partner exchanges. Real estate asset tokenization is an emerging trend representing the convergence of real estate investing and blockchain technology. Tokenization helps asset or fund owners raise capital more efficiently, and gives investors unprecedented access to private real estate investments, transparency, and liquidity.  1a960×1150 233 KB  SolidBlock was a first mover in the industry with the tokenization of the St. Regis Aspen Ski resort (ASPD trading on tZero). The joint venture Company, as delineated in the previous section, is the official issuer of the unique London Digital Bonds (LDB), which, in essence are digital representations of Note Units. Specifically, the LDBs are a new series of Ethereum blockchain-based smart contract digital tokens meeting the ERC-20 standard as modified to meet transfer restriction requirements under applicable U.S. securities laws. Purchases of the LDBs will be paid for in British Pounds, U.S. dollars or Euro. The Company accepts Bitcoin (“BTC”), Ethereum (“ETH”) or other cryptocurrencies as payment for LDBs. The offering price of an LDB is £1.00 (or the equivalent amount in U.S. dollars at the time of payment) and the maximum amount of the Offering (the “Maximum Offering Amount”) is £20,000,000. The minimum investment is set at just £5,000. LDBs can be accessed and transferred (when and to the extent permitted under applicable regulations) through the SolidBlock Platform or held directly in a digital wallet. In addition to offering the LDB to accredited investors, SolidBlock will be able to offer retail investors access to this exciting opportunity. Republic has just approved SolidBlock to list its LDB offering through Republic’s popular crowdfunding platform, giving investors one-click access to the tough-to-crack London & Home Counties residential real estate market for the first time ever. It should be noted that Republic’s strict vetting process only accepts about 3% of applicants The Real Estate Asset: With the proceeds from the sale of the LDBs, the Company will purchase real property in London at a discount to market value. The joint Company (LCL) will identify and purchase discounted housing stock in London and the surrounding Home Counties. LCL will operate an extensive sourcing team to identify properties from distressed and motivated sellers, often prior to the repossession of their home by a lending institution. We anticipate that properties will be approximately 20–30% below the current market value (based on an independent appraisal performed for each property). To summarize, London Digital Bonds (LDB) is a property fund that invests in prime residential real estate, locating deeply discounted properties (20-30% below market value) in prime locations, then refurbishing them with a quick turnaround to realize exceptional growth for investors. This is the first tokenized offering for London single-family residential real estate.  3.PNG780×438 127 KB  Exit Strategy: Following the purchase of a property, the Company will implement one of three exit strategies. 1. Quick Sale Exit Strategy. The Property will be sold at a price higher than the cost of the property. This process typically takes three-months and result in capital gain 2. Refurbish and Sale Exit Strategy. The Property will be refurbished and then sold through a traditional estate agency for the open market value. This strategy normally takes around six months and often yields higher returns than the Quick Sale Exit Strategy. 3. Refurbish and Refinance Exit Strategy. The Property will be refurbished and then refinanced on a buy-to-let mortgage. This strategy is particularly suitable for properties in high-growth areas, where we believe the property will experience a significant growth in price. The property will typically be retained for between two to three years and then sold when it has achieved capital appreciation. These investment strategies have all previously been implemented successfully by the management team of LCL. Expected Revenues: LDBs will bear interest at a per annum rate between 10% and 15%, depending on the Company’s performance. Interest will be payable quarterly and all principal will be repaid on the Maturity Date (5 years). LDB Storage and Transparency: LDBs are held on behalf of investors by SolidBlock in a cold storage wallet, and can be accessed and traded through the SolidBlock Platform. Investors will also have the option to store LDBs in any ERC-20 compatible wallet. It is also important to understand that because they are stored on the blockchain, investors in LDBs can view a record of the LDBs and print copies for their records by visiting each Investor’s individual page on the SolidBlock Platform. The Company will communicate with Investors through the SolidBlock Platform or via electronic mail as to material developments regarding an investment. Investors can review their account statements online and see that they have received payments on the LDBs they own. 3. Provide a brief history of the project The history of the project is embedded in the separate histories of the two entities that formed the Company - London Chelsea Real Estate and SolidBlock as well as their decision to complement one another with regard to each respective company’s unique commercial identity, skills, tools and experience. London Chelsea is a consultancy firm founded nearly a decade ago and serving a wide array of global investors interested in the coveted London real estate market. Moreover, their board members are at the forefront of the London real estate market with experience ranging from 15-25 years. Their expertise includes identifying top-quality, under-valued real estate in one of the world’s most prestigious cities and enabling their investors to obtain optimal profit while benefiting from rich know-how and maximum safety. Similar to global trends, COVID-19 suspended much activity in the London real estate market. However, government policies including a stamp duty freeze (July 2020) positively affected the market and there are indications that international investors are returning with prices expected to rise in 2021.  4a1240×3200 598 KB  SolidBlock is a smart contract development and management platform for tokenized assets. In other words, SolidBlock transforms real estate, a traditionally illiquid asset into tradable security through tokenization. Its claim to fame was the Aspen Coin - the first-ever tokenized commercial real estate project in the world whereby SolidBlock raised $18M in 4 months for the luxurious St. Regis Ski Resort in Aspen Colorado. The Aspen Coin was listed on tZERO in Sep 2020 (amidst the COVID-19 crisis), traded by over 700 customers with over 4-8% of its market cap traded every month. The issuance price was $1 and the current price stands at about $1.30 (30% premium). The SolidBlock team is hustling, simultaneously, working on diverse tokenization projects for residential, commercial, and hospitality-based properties in the United States, Europe, and Asia. Moreover, SolidBlock prides itself on its efforts to advance and facilitate interoperability and regulatory standardization, thus mitigating barricades to digital markets and investing.  6960×540 86.4 KB  Through the leveraging of these two companies’ wealth of experience, the London Digital Bond (LDB) was born. LDB provides an unprecedented opportunity for savvy investors interested in digital securities backed by one of the safest asset classes, namely real estate located in one of the world’s ancient financial and cultural centers. 4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. Link to the London PPM (Private Placement Memorandum or Offering Memorandum - a more comprehensive version of a Whitepaper that is the standard in a securities offering): PPM - London Chelsea - November 16 .docx - Google Docs Link to the Smart Contract: https://etherscan.io/token/0x8d5e4c005d815e2f8bc1bd618443de9a3c58cbe7 The Token Process in Schematic Form:  10a1234×1989 343 KB  5. Link any available audits of the project. Both procedural and smart contract focused audits. We self-audited the smart contract. The PPM (Private Placement Memorandum) has been prepared and reviewed by our legal counsel, Nellis Katz. The LDB smart contract was built based on the original AspenCoin, which was audited by both EY and KPMG. 6. Link to any active communities relating to your project.  https://www.linkedin.com/company/solidblock/ Redirecting... https://twitter.com/SolidBlockCo https://youtube.com/channel/UC84dDl36X0MYEQPnpMXL7zQ Login • Instagram  Please note the London Chelsea has a website but does not maintain social media accounts because their clientele are high net worth individuals and relationships are formed and maintained in alternative ways. In addition, please see the following links to some of our recent accomplishments/activities:    Crowdfund Insider – 30 Dec 20    Solid Block and INX Plan Listing of Real Estate Backed Securities Tokens SolidBlock and INX Ltd. have announced plans to list SolidBlock’s real estate backed security tokens on the INX trading platform. INX is a digital asset trading platform, as well as a token issuer. SolidBlock, based in Tel Aviv and NYC, is a...      7. How is the applying collateral type currently used? The current collateral type uses an asset-backed SPV tokenization structure. The asset(s) are placed in a newly formed entity (the Delaware LLC) and are secured by the title ownership. The token holders hold membership LP interest in the SPV and thereby own equity in the entity which owns the assets. 8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? The SPV for the project is a United States limited liability company formed in Delaware, London Chelsea Real Estate LLC. The SPV will hold assets in London directly. The investors will be protected through the use of 3rd party compliance and audit partners, who will be acting as escrow agents on the funds collected - verifying every transaction of the company and the use of funds. We are raising funds under the Red D 506 C exemption from full prospectus, which allows us to raise in the United States from accredited investors only. In addition, we have applied for Reg CF by submitting the form C in order to raise funds from retail investors through the Republic platform only. Internationally, we are raising under Reg S, a compliant way to raise capital outside the U.S. Reg S investors from outside the US can be of any wealth level. We would like to emphasize that unprecedentedly, most any type of investor - global (including US) accredited and retail through Republic can access the LDB offering. 9. Where does exchange for the asset occur? Exchanges may occur in two distinct ways:  Via trading tokens over the counter on the SolidBlock platform, following a 1-year lockup as per the US regulation. The tokens will also be listed on the INX exchange and possibly other exchanges and ATSs with appropriate level of licenses with whom SolidBlock works (tZero, Archax, Merj, Atlas.one, Texture Capital, Rialto, ADAX, etc.)  10. (Determined by Legal Domain Team) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. We have created an official PPM (linked above) and are raising funds under Reg D 506C, Reg S and Reg CF. Reg D is a Our token is a security token. The project also passed due diligence with Republic, Texture Capital and Atlas.one. As delineated in the previous sections, Republic, for instance, maintains an extremely high level of vetting whereby only 3% of applicants are approved. SolidBlock is proud to be in that exclusive group. 11. (Determined by Legal Domain Team) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. London Chelsea Real Estate LLC (the joint “Company” that is issuing the LDB) is registered with the U.S. Security and Exchange Commission and incorporated in the state of Delaware. For financial reporting, their fiscal year ends on December 31st. This page includes all SEC registration details as well as a list of all documents (S-1, Prospectus, Current Reports, 8-K, 10K, Annual Reports) filed by London Chelsea Real Estate LLC. Source on the SEC website: https://sec.report/CIK/0001842421 We registered the security with the CUSIP Global Services. Legal Entity Name: London Chelsea Real Estate LLC. The GMEI/LEI registration number is 5493009PXGYL90U1CD19  (Optional) List any possible oracle data sources for the proposed Collateral type.  The collateral is real estate owned by the SPV that issues a token. The data source will be the price. In other words, the question we tackle here is price setting mechanism. Initially, there will be an issuance price and thereafter, the price oracle will be the market fee - the price for which people are actually buying and selling. It should be noted that at this point, only the SPV is borrowing against the collateral. 13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type. A default is defined as a missed interest or capital repayment. In the event of a default there is a grace period for the company to remedy the situation without any negative consequences. The Company will appoint a 3rd party Administrator to take over the running of the business in the event of a default that cannot be remedied. The Administrator will assess the business and provide a financial report to the stakeholders (including investors) and provide options to recover the funds and distribute them to the investors. While one of these options may be to appoint a liquidator to sell all the assets, the Administrator may decide that the best thing is to keep the assets, develop them, sell them and generate cash to remedy the investor default. Often companies going into administration sort themselves out over a period of 6-12 months and then exit administration and keep on running. Liquidation is always the last option. If assets are needed to be sold, the administrators will appoint a real estate agency in the UK to manage the process, such as Savills or Knight Frank. ",
                    "links": [
                        "https://www.tzero.com/asset/ASPD",
                        "https://docs.google.com/document/d/1d9EQSWRVjI8GoaZ5S0wnHjRKl6Gkkq15cUMgGQ7jzP4/edit",
                        "https://etherscan.io/token/0x8d5e4c005d815e2f8bc1bd618443de9a3c58cbe7",
                        "https://www.linkedin.com/company/solidblock/",
                        "https://www.facebook.com/solidblock.co",
                        "https://twitter.com/SolidBlockCo",
                        "https://youtube.com/channel/UC84dDl36X0MYEQPnpMXL7zQ",
                        "https://www.instagram.com/solidblockco/",
                        "https://www.crowdfundinsider.com/2020/12/170777-solid-block-and-inx-plan-listing-of-real-estate-backed-securities-tokens/",
                        "https://www.crowdfundinsider.com/2020/12/170777-solid-block-and-inx-plan-listing-of-real-estate-backed-securities-tokens/",
                        "https://sec.report/CIK/0001842421",
                        "https://www.spglobal.com/marketintelligence/en/solutions/data-pages-clientsolutions-cusipglobalservices?utm_source=google&utm_medium=cpc&utm_campaign=CUSIP_Search_Google&utm_term=cusip%20global%20services&utm_content=420899241020&_bt=420899241020&_bk=cusip%20global%20services&_bm=e&_bn=g&_bg=98135833618&gclid=Cj0KCQiA3smABhCjARIsAKtrg6LuHYajhw8B37Hd2CSBJExNtdwc7URQ3u3r0H2jzO74a7DtZ-kXsIsaAiViEALw_wcB",
                        "https://forum.makerdao.com/t/real-world-assets-strategy-for-2021/7570",
                        "https://forum.makerdao.com/t/maker-relay-ep-32-en-espanol/6600",
                        "https://forum.makerdao.com/t/maker-relay-ep-33/6694",
                        "https://forum.makerdao.com/t/maker-relay-ep-33-en-espanol/6729",
                        "https://forum.makerdao.com/t/maker-relay-ep-32/6596",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-30-solidblock-wednesday-april-14-17-00-utc/7052/4",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-30-solidblock-wednesday-april-14-17-00-utc/7052"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.591530612244898
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "01/02/2021-12:42:00",
                    "content": "    Yael_Tamar:  London Chelsea Real Estate LLC   Hello Yael, welcome to the Maker Community and thank you for posting your MIP6 Application for LCRE the Digital Bonds. Just a few follow up questions on my end. I see that you changed your entity name a few times, or are these subsidiaries that managed properties on the behalf of LCL? image997×245 12.5 KB     Yael_Tamar:  London Chelsea Real Estate LLC (the joint “Company” that is issuing the LDB) is registered with the U.S. Security and Exchange Commission and incorporated in the state of Delaware.   I see your Registration is w/the SEC is link to a residential address (729 OCEAN PARKWAYBROOKLYN, NEW YORK 11230) as its HEADQUARTERS. Is this a temporary disclosure because you have yet to establish an “official” home office in the U.S.?     Yael_Tamar:  The minimum investment is set at just £5,000   Some of your previous listings had a minimum of 10,000 Quid–was this an obstacle that led your Team to lower it to 5K?     Yael_Tamar:  Republic has just approved SolidBlock to list its LDB offering through Republic’s popular crowdfunding platform   Can you please share a link to this listing? or, is it pending? Also, what will be the Minimum on the Republic platform? Will it be a 2 to 5 year investment, or longer duration?     Yael_Tamar:  The joint Company (LCL) will identify and purchase discounted housing stock in London and the surrounding Home Counties.   Is the Risk between LCRE and LCL split evenly? Or, are LCRE token holders more liable? Can you please provide a breakdown, or the Risk/Liabilities that are shared/not shared between entities, including but not limited to SolidBlock Inc. And last but not least–how long do you think it will take you to get SEC approval? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.486066017316017
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#3",
                    "likes": "0",
                    "time": "01/02/2021-13:25:43",
                    "content": "I am wondering as the property market especially in the new building is plumbing in London. Is there some sort of risk here? Timing can be an hazard. Also I am not an expert but in general builder pre-sell flat and get they equity from those pre-sell or via state loan at an interesting rate. Am I wrong? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.134469696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Yael_Tamar",
                    "index": "#4",
                    "likes": "2",
                    "time": "02/02/2021-07:18:17",
                    "content": "Hi Alexis, LCRE is a property trading fund that buys properties at low values and sells them for higher values. For example, a property may be listed on the market with a current valuation of £1m.  LCRE will buy this property at a minimum discount of 20% from the current valuation. Option 1 is to sell this property quickly to another investor.  We may buy the property at £800,000 and sell it quickly to another investor for £950,000 and make £150,000 gross profit. Option 2 is to refurbish the property.  We may buy the property for £800,000, spend £40,000 refurbishing it and then sell it for £1.1m making a £260,000 gross profit. When the market falls in London, we generally make bigger profits because we are able to buy the properties with bigger discount. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Yael_Tamar",
                    "index": "#5",
                    "likes": "2",
                    "time": "02/02/2021-08:51:03",
                    "content": "Hi, Thank you for your Interest in LDB. I see that you changed your entity name a few times, or are these subsidiaries that managed properties on the behalf of LCL? These are previous names of London Chelsea, they are not subsidiaries. I see your Registration is w/the SEC is link to a residential address (729 OCEAN PARKWAY BROOKLYN, NEW YORK 11230) as its HEADQUARTERS. Is this a temporary disclosure because you have yet to establish an “official” home office in the U.S.? Correct, registered address is a temporary disclosure (we didn’t open an official home office due to Covid-19 and us working remotely). Some of your previous listings had a minimum of 10,000 Quid–was this an obstacle that led your Team to lower it to 5K? $10K was initially the minimum but we felt we wanted to make it even more accessible. Our goal is to lower the minimum investment as much as possible, as long as it makes sense.  We hope to lower it more in the future. On Crowdfunding platforms the minimum will be lowered to $500 Can you please share a link to this listing? or, is it pending? Also, what will be the Minimum on the Republic platform? Will it be a 2 to 5-year investment, or a longer duration? https://republic.co/real-estate/london-digital-bonds but the campaign page isn’t live yet. The minimum price to invest in the republic platform is $500. The deadline to reach the target offering amount is April 31, 2021.  For now, it will be 2-5 years investment. Is the Risk between LCRE and LCL split evenly? Or, are LCRE token holders more liable? Can you please provide a breakdown of the Risks/Liabilities that are shared/not shared between entities, including but not limited to SolidBlock Inc? SolidBlock and Andrew Thompson are general partners and hold all the membership interest, and liability, in LCRE.  The token holders own a debt instrument and are considered creditors to the new company. And last but not least–how long do you think it will take you to get SEC approval? We are using Reg D 506© offering exemption. We will be filing a Form D and do not require approval for the offering. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.362294372294372
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Yael_Tamar",
                    "index": "#6",
                    "likes": "0",
                    "time": "07/02/2021-13:58:56",
                    "content": "Please see this informative Webinar about LDB featuring Alexander Aronsohn, IVSC Director of Technical Standards at the International Valuation Standards Council, and London Chelsea CEO, Andrew Thompson. The Webinar tackles LDB’s main investment attributes and strategy: •\tHow the properties are located and appraised  •\tHow the team manages the properties and makes decisions to buy and sell •\tHow investor interests are protected   Alexander Aronsohn talks about the London market and why it will continue to dominate the real estate area Pre-COVID-10 London was clearly the place to be with housing in the London area showing continuous upward trends. However, in line with the global situation, COVID-19 suspended much activity in the London real estate market. Nonetheless, government policies including a stamp duty freeze (July 2020) positively affected the market and there are indications that international investors are returning with prices expected to rise in 2021. Furthermore, Putting COVID-19 aside, with Brexit confusion past and England’s economy entering a recovery phase, experts are predicting that this is London’s decade to shine. 40% of companies with global HQs in Europe are located in this iconic city, whose GDP is up 18.9% since 2009. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.44426406926407
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#7",
                    "likes": "1",
                    "time": "02/05/2022-04:48:48",
                    "content": "Dear @Yael_Tamar, The process for MIP6 applications for off-chain collateral, so called real-wold assets, has been under significant review by the teams involved in collateral onboarding (RWF, CES, Growth and incubating LTS and LOVE). See more for collateral onboarding process. The goal of this process update is to provide MKR tokenholders and respective delegates a comprehensive view of MIP6-RWA applications from a credit, legal and technology perspective so tokenholders can make a more informed decision before moving applications through the execution of the onboarding process after greenlight. As part of this review, MIP67 and the underlying Methodology for structured finance transactions were written to provide applicants with a more comprehensive set of guidelines and requirements so MIP6 applications are fit for purpose and closer to a state where they could be executed, if prioritised by tokenholders during polls. MIP67 is now part of the MIP6 process. It is designed to fill the gaps in the MIP6 application for RWAs. Our domain team is aligned to the approved MIP67 process and Methodology. We are asking MIP6-RWA applicants to express whether they will retrofit their MIP6 applications in line with MIP67/Methodology guidelines. We ask applicants to express their intention by Mon 9 May at 12pm UTC. The collateral application template is located here: MIPs Portal. Status of MIP6 applications that do not express their interest by 9 May will be considered “withdrawn” from a MIP6 collateral onboarding point of view by the aforementioned Core Units and reflected in the CSI. We understand that once applicants express their intentions, there will be a period for drafting and updating documentation of the newly proposed MIP6 applications. Our teams will be available to provide guidance to applicants during this time. Kind regards William. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip67-methodology-and-review-process-for-structured-finance-transactions/13737",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://vote.makerdao.com/polling/QmWt5fov#vote-breakdown",
                        "https://mips.makerdao.com/mips/details/MIP6#component-summary",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.713068181818182
                }
            ]
        }
    ],
    "group_index": "3220"
}