{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/endgame-plan-4-understanding-metadaos/15974",
            "title": "Endgame Plan 4: Understanding MetaDAOs ",
            "index": 15974,
            "category": [
                "Governance"
            ],
            "tags": [
                "longform",
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "8",
                    "time": "22/06/2022-14:11:30",
                    "content": " image1688×228 8.85 KB   Part 4: Understanding MetaDAOs  image1920×976 84.7 KB  First some reiteration of prior concepts described in Part 2. A key aspect of MetaDAOs to always keep in mind is that they are very easy and cheap to create, and that they do not have self-sovereign governance. Instead they run entirely on the Governance Infrastructure of Maker, which prevents them from being vulnerable to Governance attacks and gives Maker Governance a way to regulate their behaviour and enforce claims against their collateral. This further makes MetaDAO very safe to launch, since Maker never gives up control.  image3342×1756 409 KB  The MetaDAO tokens of a newly created MetaDAO are distributed using a purely fair launch approach, with no pre-allocated insider distributions or team allocations. Instead the new MetaDAO is born fully decentralized with a community that can start from scratch and try to create something new and unique and onboard Core Units through a decentralized and open process. Clustering can still affect the trajectory and expected outcome of a newly created MetaDAO by trying to identify in advance synergies and opportunities, with Maker in some cases providing specific resources to a MetaDAO that make it able  Value preservation As the yield farming distribution targets are core Maker products, all the value that Maker transfers into MetaDAOs is recaptured by its own ecosystem which preserves value and allows Maker to use powerful tokenomics without taking on significant financial risk. ¨  image3174×1620 347 KB  Lets go over the MetaDAO categories once again. CreatorDAOs are general MetaDAOs that have a very flexible and autonomous scope, making them ideal for innovating new technology or identifying novel growth opportunities. In the Endgame Decentralized Workforce CreatorDAOs can manage and provide results guarantee for Contributing Core units that do work such as development. GovernorDAOs focus on running core governance process and bureaucratic systems as a service for Maker, shielding Maker from the relationship problem and making it possible to enforce decentralization and redundancy of critical core processes. In the Endgame Decentralized Workforce GovernorDAOs manage and provide results guarantees for Supporting Core Units and Administrative Core Units. ReformerDAOs handle everything related to the real world. Most importantly Real World Asset collateral, but also including legal risk and political outreach, and potentially activities that are legal intensive, such as doing real world marketing campaigns or sponsorship deals.  image1920×984 98.5 KB  All MetaDAOs have synergies with Maker that provide them with fundamental profit opportunities uniquely available to MetaDAOs.  Decentralized Frontend Revenue Share The lifeblood of every MetaDAO is its frontend. The MetaDAO frontend is a place to display its branding and metaverse identity and funnel users to its products, community and governance. As their core revenue driver of the frontend, MetaDAOs receive a 20% net revenue share from stability fees earned on Maker Vaults managed through their frontend. This is particularly lucrative to earn from MATH vaults, as they are incentivzed through the MetaDAO token yield farming. This gives MetaDAOs a clear way to monetize and sustain efforts in developing a unique brand, identity and growth tactics that ultimately help grow the Dai economy by either funneling more users as paying customers, or funneling them to become long term governance participants. It also acts as a springboard for the MetaDAOs to grow a sustainable userbase that can later be sold more products and features, such as derivatives, vault services, access to other DeFi protocols, and other DeFi products.  MetaDAO Lending Engine Creator and Reformer MetaDAOs have a specialized Maker Vault Engine that they can use to provide collateralized lending with, similar to Maker Vaults. But unlike Maker, MetaDAOs have the flexibility to offer much more diverse collateral, and can use cheaper oracles. The MetaDAO Lending Engines are capitalized by Maker, through a D3M from the primary Maker Vault Engine. Bad debt from the MetaDAO Lending Engines is backstopped by MetaDAO collateral from the treasury of the MetaDAO, as well as the MetaDAO tokens. This means Maker is well protected as the MetaDAO takes the first loss and is heavily incentivized to keep its governance on guard for bad debt. Should losses happen, Maker only takes a loss if all value in the MetaDAO is entirely wiped out.  Singularity Engine and Elixir Wars integration All MetaDAOs have an instance of the Singularity Engine, providing them with the same advanced governance lock-up rewards features as Maker. Additionally, MetaDAOs integrate into Makers Singularity Engine through the Elixir Wars tokenomics system that deeply connects the value of MetaDAO tokens with the value of MKR, and generate large amounts of captive liquidity for both MKR and MetaDAO tokens.  Manage the Core Unit Ecosystem As explained in Part 3: The Endgame Decentralized Workforce, Governor and Creator MetaDAOs play an important role in managing the Core Unit ecosystem for Maker, ensuring that Maker doesn’t have to deal directly with companies or individual, but instead only deals with other DAOs, in the DAO2DAO paradigm, and these DAOs then guarantee the results and output of the work with their treasury used as collateral. This creates much tighter feedback loops around the performance of the Decentralized Workforce, and allows is to scale to very large levels where it is impossible for Maker Governance to keep up with all developments in real time, since the MetaDAOs absorb the marginal risk.  image1920×1026 82.5 KB  One of the biggest opportunities for Maker is the expansion to L2, which would help make the Maker Protocol accessible to small scale users, and help continue Maker’s role as the foundational building block of DeFi in the multichain future. A big obstacle to realizing this vision is the Maker community’s inability to focus and execute easily on partnerships, without relying on centralization of Core Units. The Maker community itself is simply too slow and preoccupied with too many things to be able to pursue specific partnerships and bootstrapping in new ecosystems. MetaDAOs help solve this problem in a way that gives Maker the best of both worlds - we both get to interact closely and collaborate in uniquely tailored ways with different L2’s and partner projects, while preserving decentralization and not relying on individuals to represent Maker. The cornerstone of the MetaDAO-led multichain strategy is the Homebase System, which gives each CreatorDAO the option to pick a Homebase shard. The homebase shard is an L2 where they have special, exclusive privileges. The main benefit of the Homebase Shard to the CreatorDAO is that they receive a permanent 1% revenue share of all net stability fee income of Maker Sharded Vault Engine on the Homebase Shard. This makes the Homebase System, and the CreatorDAOs that launch during the Endgame Plan Launch phase synergize significantly with the current roadmap of the Protocol Engineering Core Unit, which are developing Sharded Vault Engines on Optimism, Arbitrum and Starknet. The first 3 CreatorDAOs would be able to quickly pick a Homebase Shard that would them with real, permanent income streams. Additional benefits of the Homebase System can include preferential prioritization of collateral onboarding bounties and collateral onboarding temporary revenue share programs for collateral that is specific to the Sharded Vault Engine on the Homebase Shard. Because a CreatorDAO is receiving the permanent income stream of the Maker Sharded Vault Engine on the Homebase Shard, and have other exclusive benefits, the community and decentralized workforce of the CreatorDAO is incentivized to promote and develop a strong long term community and ecosystem on their Homebase Shard. This makes them ideal to interact with and build ties to other communities and the core team and community of the Homebase Shard itself, and potentially develop partnerships and collaborations. Picking the right ecosystem to grow in, and making deep connections early, can be critical for achieving success. As an example, the majority of Aave’s revenue currently comes from Avalanche, and is caused by the the Avalance core team allocating significant yield farming incentives to the Aave protocol deployed on Avalanche due to a partnership. Maker would not be able to tap into partnerships like this without allowing the Decentralized Workforce to centralize and represent Maker externally, which creates long term political risk to Dai stability and decentralization. The Maker Community is simply too slow and too overwhelmed with the task of operating the Maker protocol to interact with other projects directly, especially when all those other projects use centralized and fast moving teams to represent them. MetaDAOs, on the other hand, can be designed from the start to have highly flexible and fast moving governance and community processes that would allow their communities to interact directly with centralized teams and make commitments and partnerships, in the same way they can hire Core Units and engage with other kinds of counterparties.  image1920×1012 150 KB  A cornerstone of the Endgame Plan is the focus on expanding Maker beyond its original 1.0 design and vision, which can be characterized as hyperrationalist and efficiency-maximizing, focusing only on using blockchain to create fundamental value of cash flows and economic strength. The Endgame Plan proposes that this is not enough to achieve global impact, because it assumes global adoption is guaranteed, which it isn’t. Efficiency maximizing-only designs, while able to create significant fundamental value, cannot hope to compete with the fundamental value from economies of scale and regulatory capture that the incumbent financial system has. The efficiency of blockchain is only one half of the equation (and indeed, the less important half during the early phases). The other half is the powerful communities and metaverse UX that can develop around a decentralized network with a membership token, which has potential for enormous intangible value creation. This intangible value, which pays off human attention and emotion, has far more potential in the early stage than the fundamental value that can be created out of the efficiency of blockchain. One only has to look at the top cryptocurrencies to see that intangible value is the dominant force in the blockchain space, with assets such as bitcoin, dogecoin and NFTs relying purely on intangible value for their growth and being orders of magnitude more widely adopted than Maker and other solid DeFi protocols, despite their obviously inferior fundamentals. Maker has not tapped into the power of intangible value due to early designs not prioritizing its potential, even deliberately creating issues such as unit bias on MKR and a “boring” culture unfriendly to newcomers. This was designed for good reasons, including governance integrity that maximizes Dai stability in theory, but in practice it limits Makers growth which makes reaching the scale a decentralized equilibrium required harder and contributes to issues such as voter apathy. The Endgame Plan both aims to increase the intangible value potential of Maker and the MKR token itself, by utilizing cutting edge tools such as advanced tokenomics. But the most powerful source of intangible value are the MetaDAOs, as they provide an opportunity to build entirely new types of decentralized communities around the metaverse paradigm and the importance of intangible value. While Maker focuses on its product and protocol with the DAO taking a backseat, the MetaDAO can be built from the ground up as an end-to-end user experience. The communities have the opportunity to experiment with increasingly blurring the line betweenuser, protocol owner, community member, governance participant or full-time contributor. While the metaverse focus of different MetaDAOs lies on a spectrum, and they can choose to what extent they wish to tap into intangible value over fundamental value, it is likely that they will all benefit from it significantly more than Maker for several reasons. First there is their inherent characteristic of being “born-decentralized” with fair launch, fully decentralized governance and no founding team - which should make it a lot easier to develop a strong community spirit and sense of belonging. Secondly, they are born “metaverse-aware” into an era of the blockchain space when NFTs have penetrated the mainstream significantly more than any other aspect of blockchain, and memecoins continue to dominate efficiency-maximizing DeFi protocols. Third, the MetaDAOs will be defined by the interactions with each other, and the unique ecosystem of aligned, decentralized communities may create unique manifestations of metaverse experiences (See gaming and MetaDAO competitions below).  Experimenting with different points on the “metaverse spectrum” Some MetaDAOs will choose to be “simple” Google/Alphabet style “Alpha Bets” - offshoots of Maker that taps into its ecosystem and talent pool and competes as backend infrastructure or marketing funnels in the classical sense. Even without any kind of metaverse and intangible value angle, this is by itself a valuable proposition and could likely result in many successful projects that Maker would benefit immensely from incubating. Once you add the additional dimensionality of potential for unique value creation that comes from the ability of the MetaDAOs to experiment freely with targeting any point on the spectrum of delivering fundamental vs intangible value to participants (the “metaverse spectrum”) and the value proposition becomes even greater. There is a strong argument for Maker to take advantage of the unique opportunity to become a hub of MetaDAO creation, and that the frontier of value creation is so vast that this can be permanent function of the system that never stops. Each new MetaDAO can fail or succeed, and successive MetaDAOs can learn from all their predecessors to continuously innovate in an evolutionary process.  Community activation A core concept that MetaDAOs are built around, is the idea of explicit community activation. The shared activity and interests of the community should be considered a critical priority of each MetaDAO, and continuously innovated and developed further in to attract as many community members as possible, and keep them engaged deeply in the community. The key is that in all cases, a MetaDAO needs to be about more than just a business because that will be required to keep an engaged and active community around in the long run, especially when going through long bear markets. Some of the tools for community activation can include: Gaming and digital meetups in virtual worlds and metaverse experiences. The MetaDAO can fund private servers and enhanced experiences for its members, as a way to deliver intangible value to its community while activating it. Gaming likely has the potential to be the strongest common thread of community activation and metaverse experience building of all the MetaDAOs, as it is simple and cheap to deliver great shared experiences, and it has the potential for developing interesting storylines and interactions between the MetaDAOs as well (e.g. imagine metaDAOs sharing a minecraft server and each building their own territory, or a counterstrike tournament of teams from each MetaDAO - the MetaDAOs can then even wager assets or something more unique, such as NFTs, in these competitions) Art creation and curation, as a community effort to continuously and organically develop their distinct aesthetic and brand. This can even take the form of NFT curation and acquisition by the MetaDAO. Real life events, and unique presences at ecosystem events such as Devcon or NFT NYC etc. Charity and impact donations or volunteering, as a way to bring the community together around a common purpose that makes involvement in a MetaDAO about more than just holding a financial token.  Hypothetical Metaverse-focused MetaDAO Examples Below is a list of various hypothetical MetaDAO concepts that aim to illustrate the potential of tapping into the power of intangible value and metaverse presence and identity of MetaDAOs. They are of course not representative of any actual MetaDAOs that will ever come to exist, and some of them are exaggarated for effect, in order to more clearly make the case of the potential of Metaverse culture to improve and focus the value creation of a DAO.  image1920×1004 150 KB  The first hypothetical MetaDAO example is the NeonDAO. This is a simplified example of a CreatorDAO with most details and additional revenue streams left out, to better understand the core value proposition. NeonDAO is ultimately a MetaDAO that focuses on developing a unique brand and UX for their decentralized frontend, and attracting users through growth hacking, viral marketing and word of mouth. Its community consists of people who are interested in cyberpunk and sci fi themes and that are motivated by working and created value in a community that genuinely reflects these interests. The main revenue sources for the NeonDAO is the revenue share from offering Maker Vaults in their decentralized frontend, and the spreads earned on vaults that users open through NeonDAOs own MetaDAO Lending Engine, which is funded by Maker through a D3M. The internal resources necessary to maintain these two core products are funded through the income streams of the products, making NeonDAO a self-contained, profitable business. The basic appeal of NeonDAO, and why it benefits Maker, is that it allows for specialization in marketing to a specific demographic of end users, and can build a community that is able to serve the market segment with authenticity. If NeonDAO is successful in attract many users, it may also have the opportunity to convert many of them to more involved community members, or even Core Unit talent. This could allow NeonDAO to evolve and build out more advanced and powerful business models over time, all powered by the simple recipe at its core of being able to serve and attract a specific market segment of DeFi users.  image1920×1025 143 KB  DogeDAO is likely exaggerated from what most real MetaDAOs would actually look like, but hopefully the exaggeration helps understand the kind of unique value that MetaDAOs can inject to the Maker ecosystem. The high level concept of DogeDAO is as a fun community for token holders, growth hackers and developers that provides an interest culture for those that want a casual and different working environment. The top priority of the DogeDAO is marketing and spreading usage of its frontend in order to earn revenue share fees, and to funnel users deeper into its community. It has internal developer capacity that is highly dependable and reliable, because their involvement in the DogeDAO is in large part driven by its unique and fun community. This internal developer capacity is used to develop a native derivatives protocol, mostly copied from other similar successful products in the space. The derivatives product can be delivered through the frontend, providing synergy with the effort to achieve adoption of the frontend. The DogeDAO earns some reliable income from operating oracle nodes for Maker, and managing Contributing Core Units that develop features for the Maker protocol. This synergizes with the internal developer capacity that is used to add features to the decentralized frontend and develop and maintain the derivatives product. In a hypothetical timeline of events the DogeDAO could have started off adopting contributors from legacy Maker Core units that wanted a work environment that was minimally bureaucratic and “corporate”, and the DogeDAO then focused on managing their work for Maker. Then some of the people from this managed Maker Core Unit could then take a leadership role in designing and building an internal technical team that could work on adding features to the frontend and native protocols, leveraging and multiplying the talent pool by using existing talent as leadership for new teams. The DogeDAO has a treasury it uses for actively generating returns, and this might be with thematic activity that the community considers beneficial from an intangible value perspective, such as market making dog coins. It could also be simply profit generating activity such as accumulating MATH. Finally, the DogeDAO distributes value to token holders through the Singularity Engine tokenomics system, but in addition to directly delivering value through yield, the DogeDAO also creates utility for $DAOG holders in the form of a yearly Doge themed event that $DAOG holders get free access to (real world or metaverse). It is in particular the human connection between community members that have a casual and fun approach to everything they do in the context of DeFi that makes DogeDAO unique, and gives it a resilient community of people who would rather study and learn from other projects, and do their work in the DogeDAO, rather than work in some more cutthroat, political or profiteering environment.  image1920×990 140 KB  The hypothetical GovernorDAO example is another exaggerated concept called ArnoldDAO. The concept is to use the “governator” identity and aesthetic to try to make governance and its complicated processes more fun and exciting, while also being able to use the same branding to develop a frontend business. The main income stream for all GovernorDAOs are from managing Supporting and Administrative Core Units for Maker, and this is also the primary focus of ArnoldDAO. The internal staff of ArnoldDAO is primarily MetaDAO Operated Maker Core Unit teams, that operate the Supporting and Administrative Core Units managed and guaranteed by ArnoldDAO. Additionally, ArnoldDAO has a few internal Administrative Core Units and Contributing Core Units that help monitor its risk from results guarantees and maintain its MetaDAO frontend. Beyond this core business, ArnoldDAO maintains a frontend with its own branding just like all other MetaDAOs that earns revenue share on stability fees, and also operates a Singularity Engine for tokenomics. A major revenue source of ArnoldDAO is to attract MKR holders to lockup into the Maker Singularity Engine through ArnoldDAOs frontend, and earn a revenue share of the lockup fee - to support this ArnoldDAO tries to develop new features and helpful solutions that make it easier and more empowering to participate in Maker Governance through ArnoldDAOs frontend. (GovernorDAOs are excluded from running MetaDAO Lending Engines, as the administrative and supporting core units are the ones tasked with advicing Maker governance on which MetaDAO Lending Engines to allocate Dai to). In order to further increase participation in governance, which is important for a MetaDAOs ability to run large amounts of Core Units, ArnoldDAO also focuses on making NFTs and providing them through the Singularity Engine as rewards and viral growth for governance participation.  image1920×1050 136 KB  LifeDAO is an example of a ReformerDAO. It focuses on an identity that aligns with the Clean Money vision and attracting community members that are motivated by making a difference for the environment and public good. In contrast to DogeDAO and ArnoldDAO, this is an example of a more “serious” MetaDAO that uses a different approach and vibe to build a distinct community. LifeDAO operates a Singularity Engine tokenomics system, just like all other MetaDAOs, but beyond that, as a reformerDAO, it almost exclusively focuses its activity on operating multiple MetaDAO Lending Engines. These MetaDAO Lending Engines offer different opportunities for earning a return on depositing Dai, by deploying the deposited Dai into various real world assets through a network of Arrangers. LifeDAO has a relatively large internal headcount, with multiple RWA focused teams including legal and underwriting. They are funded from the significant income potential that operating D3M powered RWA MetaDAO Lending engines offer. LifeDAO may also operate limited Contributing Core Units that focus exclusively on real world advertisement and marketing of Clean Money Dai, which may require legally intensive relationships to execute which ReformerDAOs well positioned to handle, as well as synergizing with the hands on experience that LifeDAO has with the exact Clean Money collateral that it deploys through it’s MetaDAO Lending Engines. High liquidity D3M The high liquidity D3M powered MetaDAO Lending Module is a product that’s very similar to a RWA version of aave or compound, where users can deposit Dai and in return get a low and reliable yield, and also have the ability to withdraw funds at any time in relatively large amounts. The underlying RWA collateral is exclusively government bonds that are highly liquid, so in all cases the return is going to be low risk, and the ability to withdraw very high. The high liquidity D3M generally are for assets that are so safe that no junior capital is required, and they can handle unlimited amount of capital from Maker. Flagship D3M The flagship D3M powered MetaDAO Lending Module is a product that allows maker to deposit long term Dai to the reformerDAO, which will then be used for flagship projects that strengthen the Clean Money characteristics of Dai. As sustainability linked long term investments are relatively illiquid, and have unique risk profiles, it is useful to have a special D3M category for this type of collateral, so it is possible for Maker to carefully allocate how much Dai it is willing to tie up in Clean Money projects. Because the Flagship projects are higher risk and require a lot of specific knowledge and risk taking, having a significant reserve ratio of junior capital is a must, and the extent of the junioer capital buffer determines how much Dai Maker is able allocate to the ReformerDAO without assuming too much risk. ETH D3M Since ReformerDAOs are already specializing in real world activity and crossing the DeFi - legal world divide, LifeDAO is perfectly positioned to also tap into the opportunities offered by unlocking liquidity and DeFI functionality of custodial ETH staking solutions. LifeDAO borrows MATH from Maker, and then lends it to centralized exchange users that pledge their custodially held staked ETH as collateral. This allows the custodial staking users to turn their illiquid custodial assets into liquid and useful MATH. They can then use the MATH as collateral to generate Dai, or convert it to ETH and use it for other things. There’s also the possibility of creating even more specializing MetaDAO Lending Modules. Some may be more focused on attracting a Maker D3M, such as the ones listed above, while others may be entirely or primarily focused on attracting deposits from external users or even other MetaDAOs, and offer unique features such as term deposits.  image3276×1804 360 KB  Coming up is a list of practical MetaDAOs that can actually be created from the complexity that exists in Maker today. These MetaDAO examples focus on concrete business models and potential for Fundamental value creation of the building blocks available in the Maker Ecosystem, and can act as blank canvas for their emergent communities to develop a Metaverse identity and location on the Metaverse spectrum.  The proof of concept phase A key aspect of the Endgame Plan Launch phase is that the first 3 MetaDAOs, M0, M1 and M2 are reversible proof of concept MetaDAOs that are done before the concept of MetaDAOs has even been validated. This means that they are designed in a way that makes it possible to basically cancel the experiment and stop going further down the path towards the MetaDAO paradigm Endgame state, and instead focus on pursuing the Rai+ Endgame state. This also means the first 3 MetaDAOs can be done very quickly alongside each other, as they are all reversible, but once we get to M3, then a much longer period will have had to pass because it starts to incorporate irreversible complexity that is only safe to do if the MetaDAO paradigm has been properly validated and the community has committed to it.  image3272×1736 381 KB  The 3 proof of concept MetaDAOs are launched with clear expectations around what kind of results must delivered for the MetaDAO concept to be validated. If these results aren’t delivered within the time limit of 6 months after the launch of the 3rd proof of concept MetaDAO, then Maker Governance should be expected to reverse the MetaDAOs, claw back their assets, and switch course towards the Rai+ Endgame state of minimal complexity across the board. The validation results are (subject to change): At least 400 million Dai must be generated from MATH vaults incentivized through MetaDAO token yield farming, and at least 25% of the circulating MKR supply must be active in governance. These results must be achieved at the latest 6 months following the launch of M2. By having strict validation results the Endgame Plan guarantees it doesn’t accidentally find itself irreversibly gambling on a path of complexity where the core assumptions dont hold up. If the assumptions and underlying theory of the Endgame Plan is correct, then achieving these results should be easy. Should the outcome be that the results are almost met, then Maker Governance still has the option to commit to the MetaDAO paradigm regardless, but MetaDAO token holders of the proof of concept MetaDAOs shouldn’t expect it to be the case unless the results are met.  image1920×1081 96 KB  M0 is the concept for the very first, low risk, proof of concept MetaDAO. It is a CreatorDAO that focuses on pursuing profit opportunities in and adjacent to the Maker ecosystem, onboarding new users, and that adopting complexity Maker wants to get rid of, such as small vault types. The main goal of M0 is to bootstrap a new community that is powered by the Maker Ecosystem, but can be more fun and inclusive than Maker Governance, while experimenting with new product and growth ideas that aren’t suitable for Maker Governance.  Reversible M0 is carefully crafted to have minimal entanglement with Maker Governance, and ensure that no irreversible complexity is created, so that if the MetaDAO experiment fails to deliver the expected results, it can be reversed. These design considerations will not apply to later MetaDAOs that are launched after the concept has been proven, and M0 will also eventually also shed these constraints and operate as a normal MetaDAO.  Branded frontend with revenue share The main focus of M0 is to develop a brand that can attract users and an organic and vibrant community, and to monetize it through its frontend by earning revenue share on Maker Vault stability fees, or profits from internal products. This frontend product is built from a fork of the Oasis codebase, as this is the most tested and secure frontend available for Maker Vaults and will be a strong basis for the future products of M0. Oasis will be encouraged to support this adoption of their frontend by the possibility of also tapping into a revenue share program similar to the one available to MetaDAOsThe frontend will then be reskinned and adopt the brand of M0  Deco Core Unit and parts of other Maker Core Units provides a well suited fundamental core value of M0 M0 is bootstrapped with the transition of the Deco Core Unit, receiving the budget currently allocated to Deco, and clustering with the Core Unit members. They have the capacity both to maintain a frontend, as well as the unique Deco Core Unit fixed rates DeFi system, that together make M0 have a clear unique value proposition and positions it well as the first MetaDAO. Another example of value that is today clearly identifiable as external to Makers Core are the external risk dashboard tasks that the Risk Core Unit undertaken.  Fixed rates “bonus feature” In addition to the baseline value proposition of providing a new frontend to Maker Vaults and earning revenue share from yield farming users, M0 can offer unique and advanced functionality by tapping into the primary product of the Deco Core Unit which is a tokenized fixed rate product, and this can be integrated directly into the M0 vault frontend, both creating opportunities for additional service fees and further increasing the potential for earning stability fee revenue share.  Oracle profit opportunities Beyond the focus on a revenue share frontend with an integrated fixed rate product as a unique value proposition, M0 will focus on tapping into the other major hidden value proposition of the Maker ecosystem, which are the Maker oracle network. The most basic step will be that M0 “adopts” some of the existing Maker Oracle nodes. Adopting oracle nodes means to collateralize and take responsibility for the performance of the nodes, in return for a significant payment stream from Maker. This payment stream covers both budget that M0 can provide to the oracle nodes for them to upgrade their security processes and provide verification of their security, and also covers a “guarantee premium” that goes directly to M0 as profits. In return for this payment stream, Maker will now have a results claim against M0, and will be able to extract collateral from M0 in the event that there is outage, security issues, technical failure, oracle attacks etc caused by the oracle nodes adopted by M0. Additionally, M0 will be able to tap into a new token for the Maker Node Network, which is an evolution of the Oracle network. This token is meant to be yield farming to MetaDAO token holders, and M0 will be the first MetaDAO that can take advantage of this. The Maker Node Network and $MANO token is explained further below.  Simulated D3M value generation through adopted vaults A key long term value proposition of all CreatorDAOs is that they will run their own “mini-versions” of the Maker Vault Engine that will act as a lending engine for the MetaDAOs, and will be specifically optimized for Maker to tap into through a D3M construct. This way CreatorDAOs can provide a simple and powerful way for Maker to outsource the onboarding of long tail collateral that is not suitable for Maker Core, but is still a good business opportunity. Such a MetaDAO Lending Engine will not be availabe for a long time until the Midgame (explained later), but before it becomes availabe it is still possible to simulate the same interaction through a MIP and governance regulated system whereby the MetaDAO “adopts” vaults in the main Maker Vault Engine. Maker Governance will specify all of the small scale vaults that fall below its minimum criteria for Maker Core vaults. M0 governance will then have the opportunity to adopt any of these vaults that it wants. When M0 adopts a Maker Vault, Maker will only earn a baseline, low stability fee on the vaults, while the MetaDAO earns all stability fees above this baseline (plus any frontend revenue share income, if applicable). However in return the MetaDAO will be collateralizing the risk of these adopted vaults, with maker extracting collateral from the MetaDAO to cover any losses it incurs from the adopted vaults. M0 will also be responsible for all oracle costs related to the adopted vaults. This relationship then simulates the same dynamic that govern a D3M relationship, where Maker specifies a target rate of return and a maximum debt ceiling, and M0 then has complete freedom to adjust risk parameters within those global bounds. M0 will also have the freedom to migrate the vaults to lower cost oracle providers such as chainlink, but assumes all risk of doing so and must do all the work itself, through its internal resources and governance process. If this process is successful for M0 taking over existing small vaults from Maker, then the next step is that M0 can begin to onboard new small collateral to the Maker Core following this approach. One caveat is that there is still significant technical risk incurred from using vault adoption rather than running directly on a MetaDAO Lending Engine, so Maker Governance may limit the extent of this activity once the dynamic has been proven to work and its experimental value starts to drop. The currently contemplated institutional vaults, may be a good fit for complexity that isn’t suitable for the Maker Core, but that M0 could experiment and ensure the momentum already built with interested counteparties is kept alive. Once the MetaDAO Lending Engine technology is ready, all adopted vaults are then transitioned to it to enable the long term, technically derisked and highly scalable relationship to build on top of the momentum created in the adoption/simulation phase.  Develop unique metaverse identity M0 will be the first opportunity for a new, born-decentralized community to develop a completely unique, decentralized identity, that can create additional intangible value for its community members, and also synergize with the frontend product by providing a unique brand that is optimized for attracting users. Once enough tokens have been distributed and the community has started to crystallize, the community can internally organize a process for picking a name, a token ticker and a brand identity and aesthetic.  image1920×1062 99.8 KB  After M0 launches the first MetaDAO proof of concept, Maker can quickly follow up with M1 and M2, the first proof of concept of ReformerDAOs. These are ReformerDAOs that focus on taking over the RWA programmes Maker has been attempting to bootstrap, and build up community and governance culture, and a decentralized workforce that is able to make it work at scale.  Simulated D3M for real world asset management The main tool of M1 and M2 is the simulated D3M approach which allows the ReformerDAOs to use the Maker Vault Engine to onboard Real World Asset deals, without any additional technical complexity, instead using MIPs to simulate the interaction that would occur with a fully functional MetaDAO Lending Engine and a D3M from Maker. Maker provides both of the ReformerDAOs global risk parameters such as target return and maximum debt ceiling, and the ReformerDAOs then adopt RWA vaults from Maker, and begins onboarding new RWA vaults. Something to note is that right from the beginning the ReformerDAOs will have two separate simulated D3Ms that they can use to adopt and onboard Vaults with: A high-liquidity D3M and a flagship D3M, where the High-liquidity D3M is meant for adopting the bond exposure that Maker is aiming to ramp up ASAP  Bootstrapping Core Units and Treasury The ReformerDAOs will need a lot of internal resources to be able to function properly from the start, and would build their teams around, or with support from, members of the relevant legacy Core Units. This will also require significant upfront operational capital to pay expenses and ensure job security as the ReformerDAOs ramp up their operations. In addition to the operational capital, ReformerDAOs require a minimum amount of junior capital to be able to collateralize and credit enhance the RWA deals they pursue. This would be funded from the Maker Surplus buffer when the reformerDAOs launch to ensure they can hit the ground running. Since the M1 & M2 are designed to be reversible, the worst case scenario means Maker can claw back all of the funds as long as no losses have incurred from bad risk management.  Frontend Like all other MetaDAOs, M1 & M2 will be operating a simple copy of the MetaDAO frontend. Initially, these frontends will not be a major focus, and will mostly just be in place to take advantage of revenue share on Maker Vaults and build up a small userbase. Later on, this userbase can synergize much more with the main activity of the reformerDAOs, as the frontend will be an entry point to the various MetaDAO Lending Engines that M1 & M2 will operate, providing them with sources of capital that go beyond Maker D3Ms.  Oracles Like all MetaDAOs, M1 & M2 will also tap into the business of running parts of Makers oracle and node network, earning some decent overhead fees and providing additional diversification security to the network. They will also be able to farm MANO tokens and provide additional utility to their MetaDAO token holders.  Develop unique metaverse identity Like M0, M1 and M2 will be on the frontlines of the opportunity for new models of intangible value creation, and in particular can use the direction of their Metaverse identity to support the challenging task for building a political and governance culture that can handle decentralized. Once enough tokens have been distributed and the community has started to crystallize, the community can internally organize a process for picking a new name and token ticker.  image1920×1089 94.1 KB  M3 is the second CreatorDAO, and the first MetaDAO to be launched following proof of concept success of the MetaDAO paradigm. Like M0 it focuses on its frontend development, growth and technical innovation, but since it is no longer constrained by the MetaDAO proof of concept phase, it begins to tap into deep integration and codependency with Maker by adopting and managing core development resources and responsibility.  Standard CreatorDAO features M3 Will operate a unique frontend, simulate a D3M with vault adoption and adopt Oracle nodes, just like M0. The way M3 approaches this will incorporate as many lessons as possible from M0, but not necessarily copy everything as there may also be opportunities where M3 can pursue an alternative path and experiment with different solutions that may open up new markets and resources.  Contributing Core Units and DAO Quests The main unique focus of M3 will be that it can adopt critical resources from the legacy Core Units and restructure them into Contributing Core Units that are covered by a Results Guarantee from M3 and receive additional M3 MetaDAO Tokens. This will help restructure the Decentralized Workforce towards its endgame state, but also provide a strong starting point for ramping up output via DAO Quests. DAO Quests are explained in further detail later, but the gist is that it is a bounty that applies to a MetaDAO and gives it massive rewards for completing critical tasks that have a long term impact. For M3, the obvious target is a DAO Quest that incentivizes the development of the first version of the Singularity Engine, as this will be a game changer for both Maker and all the MetaDAOs by ramping up the power level of the tokenomics in the ecosystem.  Unique identity Like all other MetaDAOs, M3 will experiment and innovate a new decentralized identity into existence, allowing it build a resilient and genuine community and possibly provide it with unique avenues for attracting and retaining talent.  image1920×1082 109 KB  M4 and M5 are the last of the Endgame Launch phase MetaDAOs, and round off the cohort by filling the last remaining class of MetaDAOs: The Governors. The main focus of these MetaDAOs are to restructure and enhance the administrative and supporting layer of the Decentralized Workforce, providing strong incentives for permanent adherence to best practice and critical principles such as separation of powers.  Decentralized Frontend M4 and M5 will operate decentralized frontends like all other MetaDAOs, and possibly be the first to extend these frontends to also include governance UI. Once the Singularity Engine has been developed by M3, there is a new revenue opportunity in for MetaDAOs to provide best practice-compliant access points to Maker Governance. This creates a reliable incentive for the Governors to be a self-sustainable force for decentralizing access to voting, shutting the door to the hypothetical possibility of governance frontend capture.  Supporting and Administrative Workforce management The primary objective of the two Governors will be to restructure the supporting and administrative layer of the Decentralized Workforce, bringing it to its Endgame State where there is strong incentives for adhering to separation of powers, and where there is guaranteed and provable decentralization and diversification of resources as the responsibilities are split across the two Governors. This will provide a significant and highly reliable source of income for the GovernorDAOs and be their main source of long term value, as the Endgame Decentralized Workforce will always rely heavily on its governance-adjacent layer of Supporting and Administrative Core Units.  Oracles M4 and M5 will also manage Oracle Nodes, and farm MANO tokens like all other MetaDAOs.  No MetaDAO Lending Engine As GovernorDAOs, M4 and M5 will not have the ability to run a MetaDAO Lending Engine, as they are instead tasked with representing Makers interest in allocating capital to the MetaDAO Lending Engines of the other MetaDAOs.  Metaverse Identity The two GovernorDAOs can experiment with identity and culture that helps promote honest participation in governance.  This is a significant challenge as Maker is already struggling with voter apathy, but the GovernorDAOs will have the advantage that their entire identity and fundamental reason for existing are focused on solving this problem and working with governance processes.  image1920×997 114 KB  A unique aspect of MetaDAOs and Maker in the Endgame Plan is their intertwined tokenomics, in a system called the Elixir Wars. The advanced design of the Elixir Wars keeps MetaDAO token holders and MKR holders aligned and creates significant intangible value. It also ensures that MetaDAO tokens are always valuable and liquid, even for brand new MetaDAOs that are just getting started, and that the MKR token is quote currency for MetaDAO token trading. The full scope of the Elixir Wars will not get implemented until the Midgame (detailed in the Endgame Plan Part 6: Midgame and Endgame Products). Instead, during the Endgame Plan Launch Phase a simplified version of the Elixir Wars is implemented, which works by simply having Maker use MKR token emissions to accumulate MDAO/MKR LP tokens using a dss-kiln-like implementation, boosting the liquidity of the MetaDAO tokens and increasing the utility of the MKR token as quote currency for MetaDAO tokens. The LP tokens that are accumulated during the Endgame Plan Launch phase will be kept long term and eventually used in the Singularity Engine in the latest stages of the Endgame Plan. During the proof of concept phase, before commitment and lock in to the MetaDAO Paradigm Endgame state, the MDAO/MKR LP token acquisitions will be funded from the protocol MKR reserves, rather than from token emissions. The permanent token emissions will only be implemented once the validation results have been met and the MetaDAO Paradigm is locked in. ",
                    "links": [
                        "https://forum.makerdao.com/t/endgame-index-list/16021",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-16-22-2022/15999",
                        "https://forum.makerdao.com/t/weekly-relay-june-21-27-2022/16158",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-16-22-de-junio-del-2022/16204",
                        "https://forum.makerdao.com/t/relay-semanal-21-27-de-junio-del-2022/16272",
                        "https://forum.makerdao.com/t/end-game-summary-part-4/16416"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.712766493718701
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "4",
                    "time": "23/06/2022-12:00:48",
                    "content": "    rune:  Instead, during the Endgame Plan Launch Phase a simplified version of the Elixir Wars is implemented, which works by simply having Maker use MKR token emissions to accumulate MDAO/MKR LP tokens using a dss-kiln-like implementation   So approve MIP74! Like you’re literally planning to use functionality that MIP74 defines. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#3",
                    "likes": "1",
                    "time": "23/06/2022-12:13:40",
                    "content": "I will jump on this to add that Makershire also aims to execute some of the new LP positions listed in Rune’s call yesterday, but he is currently rejecting the MIP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "1",
                    "time": "23/06/2022-12:41:49",
                    "content": "@adcv 3F Delegate is currently opposing Makershire as your timing is way off (same as the proposal to buy ETH at $4000 for Eth Gas expenditures), but I am also under the impression that your Core Unit has not decided what LP tokens will be acquired without proper consent from MKR token owners. Can you please clarify your position as to how your making your investment choices? Thanks in advance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#5",
                    "likes": "1",
                    "time": "23/06/2022-13:22:26",
                    "content": "I’m completely in favor of dsskiln, but a critical principle of the Endgame Plan is that all complexity must be tailored to only serve the exact functionality that it’s needed for because we want to maximally freeze or at least slow down any changes to the scope of maker governance over time. So MIP74 is going against this because it’s a subproposal process MIP that encourages open ended use of dss-kiln, when I think what we need to ensure our long decentralization and survival are MIPs that hardcode the specific behaviour that has been decided to the extent possible. It’s really just a governance technicality, as we don’t need MIP74 to do various interim solutions, as already proven by the burn signal request. In general I don’t really see the need for interim solutions either, unless we have some specific case with a really good and easy to understand reason for why we need to run an experiment, i think we just need to decide on the specific processes we want to implement, and then implement them. The Endgame Plan proposes multiple very specific usecases for dsskiln that are as clearly defined as possible (but obviously need further feedback and improvement, as with everything else) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.245555555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#6",
                    "likes": "4",
                    "time": "23/06/2022-13:27:51",
                    "content": "Could you please clarify what you mean by timing? I think it’s a bit disingenuous to cite the ETH SR as buying at 4K, especially since we did not move the proposal forward despite majority support from the polls. In either event, the two market conditions you mention are complete opposites, bullish back then and extremely bearish now. SF thinks in years, not weeks or months and don’t trade markets. As mentioned in our operating guidelines, we are taking community input into how the SPF is managed. As we discussed privately, we will present two options to the community,  a stable LP only pool and a balanced pool with volatile asset exposure and will implement whichever allocation is receives majority support. Lastly I’ll close by saying that I strongly disagree with the timing is not appropriate - our recurring revenue has fallen nearly 90% from peak to ~26.6M annualized as of this morning. The stable LP strategy will likely earn around ~10% yield with no risk of IL, using mostly Maker’s own smart contracts. We do not have the luxury of turning away opportunities to grow revenue, especially those that minimize an already overburdened PE team. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.37062324929972
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "5",
                    "time": "23/06/2022-13:36:50",
                    "content": "    rune:  It’s really just a governance technicality, as we don’t need MIP74 to do various interim solutions, as already proven by the burn signal request.   We don’t need it, but it’s better because it allows for RFC and frozen periods and fits into the monthly cycle - as seen from the fact that the burn signal is being revoked after initially passing. Like, I’ll repeat. Not having the process doesn’t prevent proposals it just moves them to a more-generic process. You’re arguing that this process is too general for your use-case, but there are already way more general processes that will be used in the absence of this MIP. This MIP existing means that you can vote down all such proposals using the heuristic “this is a MIP74 subproposal and I didn’t propose it” versus “Here is a new MIP, let me read it and understand that its proposing market operations” Like it existing saves you and other participants time and provides a tool you can later use to implement parts of the end-game plan, I can’t understand the chain of logic that leads you to conclude that this is worse than the status-quo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.265467171717172
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "1",
                    "time": "23/06/2022-13:42:21",
                    "content": "    Aes:  Could you please clarify what you mean by timing?   Market timing, also know as predictive methods.     Aes:  bullish back then and extremely bearish now   I don’t have all the right answers, but this is how I’m thinking about it. When the proposal was presented, it had a bullish tone to it—if you’re playing a long term game, you should retract the proposal, re-access and present your refined investment strategy. As I mentioned in the 3F Delegate Platform, there’s nothing wrong with reapplying and/or re-designing your proposal. Just my 2-gwei — MKR token owners can choose as they see fit.     Aes:  The stable LP strategy will likely earn around ~10% yield with no risk of IL, using mostly Maker’s own smart contracts.   Can you please provide some back testing/validation of a model that is based on the forecasts you are providing here? Thanks in advance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.270833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#9",
                    "likes": "4",
                    "time": "23/06/2022-13:52:06",
                    "content": "    rune:  I’m completely in favor of dsskiln, but a critical principle of the Endgame Plan is that all complexity must be tailored to only serve the exact functionality that it’s needed for because we want to maximally freeze or at least slow down any changes to the scope of maker governance over time.   waitwhat - if it is not tailored for endgame we shouldn’t do it now? how about we just start with mip74 and tear it down (or replace it) with something that is ready for Endgame or even Certified Endgame Technology? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.799382716049383
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#10",
                    "likes": "0",
                    "time": "23/06/2022-14:01:40",
                    "content": "    Aes:  SF thinks in years, not weeks or months and don’t trade markets   Not to derail the conversation, but if this is the case, why can’t you just make individual recommendations to governance periodically if you think something is a good investment? Or even get pre-approval for specific prices or other conditions? I think a lot of people are turned off by the proliferation of proposals asking for multisigs to control things, which it sounds like you don’t actually need? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#11",
                    "likes": "1",
                    "time": "23/06/2022-14:02:24",
                    "content": "That’s not what I’m saying, I just think that if we want to do experiments, then it is more desirable to use standalone MIPs or SR’s to do so. So basically I disagree with LFW on the point that is i good to have a dedicated process MIP for experiments, unless there is some extremely strong reason to make a huge amount of experiments in some specific area. Because I think that’s how you risk making the temporary ossify as something permanent. I think using ad hoc implementations is better, especially when it is for a type of experiments I don’t think we need to do, meaning I want to discourage it, so signal requests or full MIPs is better than creating a subproposal process MIP that is meant to be replaced later. If we in general plan to make it very difficult, time consuming and cumbersome to propose stand-alone MIPs and SR’s in the long run, then we get the wind down of the hypothetical dss-kiln experiments for free and significantly reduce the risk that they ossify and became a part of the permanent scope of Maker Core governance. This protection wouldn’t exist if they had a dedicated process MIP. Finally, a dedicated process MIP is an invitation. It’s asking people to come up with new ways to use that process, and the more open ended the process, the more open ended are you asking people to think. And in my opinion we want to go in the other direction, we want to invite people to think less open ended over time and instead focus on keeping things the way they are so we maximize reliability of the protocol as bottom layer infrastructure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.83949494949495
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#12",
                    "likes": "3",
                    "time": "23/06/2022-14:58:03",
                    "content": "    flipflopflapdelegate:  Can you please provide some back testing/validation of a model that is based on the forecasts you are providing here? Thanks in advance.   All proposed allocations have multiple public yield sources that validate the conservative estimates I’ve provided. Here are a few resources: https://info.uniswap.org/#/optimism/pools/0x100bdc1431a9b09c61c0efc5776814285f8fb248    coindix.com    Coindix - Today’s best vaults and APY on the DeFi Monitoring +10,000 vaults on 26 chains to find Today’s best vaults on the DeFi. Ethereum - BSC - Solana - Polygon - Terra - Avalanche - Fantom - Fuse - Harmony - Arbitrum - Defichain - Celo - Moonriver - OKex - Heco - Cronos - Waves - Astra - Shiden         dune.com    Dune Blockchain ecosystem analytics by and for the community. Explore and share data from Ethereum, xDai, Polygon, Optimism, BSC and Solana for free.         Metacrypt    Uniswap V3 Calculator & Simulator — Metacrypt Calculate, track and evaluate Uniswap V3 Positions in a simple to use interface with fees, volume, prices, yields, ROI, APY and more.          Ippy:  Not to derail the conversation, but if this is the case, why can’t you just make individual recommendations to governance periodically if you think something is a good investment? Or even get pre-approval for specific prices or other conditions? I think a lot of people are turned off by the proliferation of proposals asking for multisigs to control things, which it sounds like you don’t actually need?   We do make individual recommendations. Our focus is on building a long-term treasury management framework that can be automated over the long-term. As it relates to owning ETH specifically, a portion of our cost base is denominated in ETH, an asset which is likely to have increase in value over the long-term as the industry grows and due to how the supply/demand dynamics will change after the merge in late Q3. I think of ETH as the oil for web3 and the Maker protocol as an airline - while the markets are immature and extremely volatile today, Maker will likely need to build a strategy to hedge and mitigate ETH price increases if we want to maximize our RoE. What makes ETH even more attractive to own are the staking rewards - we could accumulate enough ETH now to fund our oracle costs in perpetuity, feeding the staking rewards directly into the oracle wallets and likely never having to buy ETH on spot again. In terms of where the funds are held, we simply take the advice of members of the PE team. The reason multi-sigs have been recommended is because they require no technical work to implement, enable flexibility, and the requested amounts are small. The biggest bottleneck for launching new products and projects is protocol engineering bandwidth. The more we can do to increase protocol revenue while minimizing engineering bandwidth the better. With that said, if enough people disagree with our smart contract engineers’ recommendations and want to use a safer and more inefficient model, we would work with that. ",
                    "links": [
                        "https://coindix.com/",
                        "https://coindix.com/",
                        "https://dune.com/fb/Yield-with-GUNI-MakerDAO",
                        "https://dune.com/fb/Yield-with-GUNI-MakerDAO",
                        "https://www.metacrypt.org/tools/uniswap-v3-calculator-simulator/?network=ethereum&token0=0xc02aaa39b223fe8d0a0e5c4f27ead9083c756cc2&token1=0x7fc66500c84a76ad7e9c93437bfc5ac33e2ddae9&feeTier=3000",
                        "https://www.metacrypt.org/tools/uniswap-v3-calculator-simulator/?network=ethereum&token0=0xc02aaa39b223fe8d0a0e5c4f27ead9083c756cc2&token1=0x7fc66500c84a76ad7e9c93437bfc5ac33e2ddae9&feeTier=3000",
                        "https://forum.makerdao.com/t/signal-request-lp-our-aave-and-ens-with-eth-on-uniswap-v3/15863",
                        "https://forum.makerdao.com/t/a-balance-sheet-approach-to-executing-an-aggressive-growth-strategy-the-road-to-300m-revenues/14818"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.773736398736399
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "22/09/2022-20:58:16",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}