{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/black-thursday-vault-owners-report-thread/1566",
            "title": "Black Thursday Vault owners report Thread ",
            "index": 1566,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "summary",
                "black-thursday",
                "vault-compensation",
                "covid-crash"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#1",
                    "likes": "4",
                    "time": "16/03/2020-05:31:00",
                    "content": "This thread is for vault owners that want to come - or anyone really and pretty much make entries like Vault NNNNN - Comments  to present their Black Thursday loss post mortem event. This thread is simply about accumulating individual vault data so the full picture can emerge of the event and potentially a claims submission place for individual vault holders. I know that everyone at Maker wants to express sincere apologies for any misunderstandings as well as actual losses during this event, we feel your pain to the tune of ~80% of the total loss and want to do the best we can for the community as a community. With respect to being paid back - this is completely a Maker governance question (I this OP is but one small voice).  But if we can basically tally the cases and data here just as post mortem facts finding thread - particularly by the vault owners themselves I think it gives Maker governance a better look to make the best decision about whether and/or how much to compensate vault owners. So here you go felix - kick it off with Vault 2288 if you’d like or someone else pick a vault (how about the largest one) and give the full post mortem on it. It would be interesting alone to know how many vaults were affected by not just the 0 bid issue (which we have some data on thanks to: https://medium.com/@whiterabbit_hq/black-thursday-for-makerdao-8-32-million-was-liquidated-for-0-dai-36b83cac56b6 but other issues we don’t even know about yet like Vault 2288. ",
                    "links": [
                        "https://forum.makerdao.com/t/covid-crash-situation-room/1711/3",
                        "https://forum.makerdao.com/t/vault-liquidation-compensation-how-much-should-have-been-returned-to-your-vault/3256",
                        "https://forum.makerdao.com/t/polls-to-determine-specific-black-thurs-vault-compensation/2275/28",
                        "https://forum.makerdao.com/t/maker-the-hardest-protocol-in-the-planet-black-thursday-survivors/6971/4",
                        "https://forum.makerdao.com/t/signal-request-vault-compensation-working-group-payment/5562/26",
                        "https://forum.makerdao.com/t/relay-ep-14-en-espanol/4457",
                        "https://forum.makerdao.com/t/maker-relay-ep-13-en-espanol/4313",
                        "https://forum.makerdao.com/t/maker-relay-ep-13/4310",
                        "https://forum.makerdao.com/t/compensating-vault-holders-that-liquidated-at-0-bid/1541/111",
                        "https://forum.makerdao.com/t/mkr-holder-dai-gest-week-19-2020-use-bitcoin-wbtc-to-open-a-vault-on-makerdao/2435",
                        "https://forum.makerdao.com/t/unable-to-withdraw-eth-collateral-from-cdp/1848/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-tuesday-march-24-9am-pst-4-00-pm-utc/1766/3",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0509259259259265
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#2",
                    "likes": "3",
                    "time": "16/03/2020-10:44:50",
                    "content": "Posting as a gist because this website wouldn’t let me post multiple pics or images Full damage report below… this was majority of my savings. You will need to click the following gist link below.   gist.github.com   https://gist.github.com/OperationNine/cdae6635f14e89b16ae0632366d48770 Vault 2288 damage report as a result of 0 bid exploit.md Firstly - thank you for acknowleding my post.  Here is the link to my CDP Vault 2288:  https://defiexplore.com/cdp/2288  After seeing the 0 bid liquidations I realised I had to exit my CDP as the system was under failure.  The long story short is this. The events of the 0 bid liquidations caused me to have to ACT fast in order to avoid being liquidated to 0. I was even told in MakerDAO chat on the day as it was happening. \"Do not get liquidated.\"   This file has been truncated. show original        ",
                    "links": [
                        "https://gist.github.com/OperationNine/cdae6635f14e89b16ae0632366d48770",
                        "https://gist.github.com/OperationNine/cdae6635f14e89b16ae0632366d48770",
                        "https://forum.makerdao.com/t/compensating-vault-holders-that-liquidated-at-0-bid/1541/34",
                        "https://forum.makerdao.com/t/compensating-vault-holders-that-liquidated-at-0-bid/1541/27"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.449074074074074
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mexfogel",
                    "index": "#3",
                    "likes": "2",
                    "time": "16/03/2020-21:20:22",
                    "content": "I’m vault #6709 https://defiexplore.com/cdp/6709 I also got liquidated back in Dec where my vault had 700 ETH and I couldn’t repay mi debt due to lack of sai available and transactions not going trough. After that liquidation I was left with the 175 ETH that got put into this last vault. Now I’m at zero. I can’t find the old vault number since I migrated it to the new system. I already shared my thoughts on how this creates a big trust issue in all future users and what i believe should be done to remedy this: Compensating vault holders that liquidated at 0 bid?! Thanks for listening and creating a conversation about it. ",
                    "links": [
                        "https://forum.makerdao.com/t/compensating-vault-holders-that-liquidated-at-0-bid/1541/33"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.355681818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rovdi",
                    "index": "#4",
                    "likes": "5",
                    "time": "16/03/2020-22:12:05",
                    "content": "First of all Thank you for dooing this. Vault 392  => https://defiexplore.com/cdp/392 During market crash i was trying pay back some DAI, all my tranzaction was failing becouse of network congestion.  My liquidation price was 124$, i had 109ETH in colleteral. i received 0 back. Please. As you can see i am with MakerDao almost from beginning, i was in zoom during MCD migration celebration ( i was the person who played rocky balboa song at background).  I am not a gambler, most of my loans are used for my small GPU-home mining business.   I keept eth for upcoming staking eth2.0 . some ETH wasn’t my own so now i’am in debt + becouse of cryptomarket have crashed my bussiness doesn’t give profit. I would apriciate if fair amount is payed out. Also becouse i am unemployed and bussiness going bad i can put my work to help with some tasks. ( Do meeting, presenting, give support, provide some computtion power) Thank you. [email protected] ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SolKo",
                    "index": "#5",
                    "likes": "1",
                    "time": "16/03/2020-22:41:43",
                    "content": "Vault 4246. Been around for a second/had a SCD CDP in the triple digits. Got liquidated with around 1000 Eth Collateral, got 2.99 eth back. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adrianmcli",
                    "index": "#6",
                    "likes": "2",
                    "time": "16/03/2020-23:00:39",
                    "content": "Vault #3157: https://oasis.app/borrow/3157 I even bought 600 DAI with my fiat at the last moment to push down the liquidation price as you can see from the history. However, this was before the steeper drop that liquidated me as I fell asleep in my timezone. I woke up in horror to see my entire vault gone. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.7407407407407405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/gierre",
                    "index": "#7",
                    "likes": "2",
                    "time": "16/03/2020-23:52:12",
                    "content": "Vault 5931, got liquidated with 21 ETH collateral, got 0.88 ETH back. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nielsd",
                    "index": "#8",
                    "likes": "1",
                    "time": "17/03/2020-07:27:49",
                    "content": "Vault 3882. Got 118 eth colleteral. Get zero back. Tried to save cdp true the day but a person need to sleep and got liquidated while sleeping. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sandhaai",
                    "index": "#9",
                    "likes": "1",
                    "time": "17/03/2020-11:56:14",
                    "content": "Vault #4763. Had 600-odd ETH as collateral and ended with zero balance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/supermisa",
                    "index": "#10",
                    "likes": "3",
                    "time": "17/03/2020-12:24:49",
                    "content": "Hi my Vault#6194 OK lets simple find the whole story, the question here is are you going to do any kind of pay back or not? Had 19 eth after liquidation all what is left is 1.6eth ? What is the  point of setting  Liquidation price if can’t be executed. My liquidation price was 130$ but it was sold on 95$?  After reading all those people who were left with nothing, i should think of myself as lucky one? Please reconsider some kind of payback if still care about your project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2407407407407405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chris_vensand",
                    "index": "#11",
                    "likes": "2",
                    "time": "17/03/2020-23:09:22",
                    "content": "Vault #2282. Had 168 ETH as collateral and ended with a zero balance. The defi explorer shows what happened during liquidation https://defiexplore.com/cdp/2282 which left me with nothing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Claddy",
                    "index": "#12",
                    "likes": "3",
                    "time": "18/03/2020-08:15:31",
                    "content": "Vault #4006 here. Also got liquidated 100% for over 35ETH as can be seen here: https://defiexplore.com/cdp/4006 Curious what MakerDAO is intending to do for compensating the fact that all collateral is gone. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/neece",
                    "index": "#13",
                    "likes": "3",
                    "time": "18/03/2020-15:17:06",
                    "content": "My Vault:  https://defiexplore.com/cdp/3805 Earlier that day i deposited 10 extra eth to bring down the liquidation price. Later that evening my cdp was completely liquidated leaving me with 0 eth. I had 52 eth in there. 32 was going to go towards staking. Im extremely disheartened by this whole thing, i have been trying to get my friends and colleagues to use mkr as it offers something which usually would take a lot of paperwork and time. When i saw my cdp at 0 i knew something was not right, i havent read the fine prints but i think its fair to presume most users would expect that when a liquidation occurs enough eth is sold to cover the debt and the rest is left in the cdp. Im sorry for the loss of all the vault owners including myself and hope that we are compensated for our loss. its only fair. thanks neece ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.45875104427736
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hdh",
                    "index": "#14",
                    "likes": "3",
                    "time": "19/03/2020-08:15:52",
                    "content": "Vault #3834. Lost 105 ETH, nothing left. Tried to repay 1200 DAI with Fiat to stabilize last minute, stayed up all night to monitor but fell asleep during a transaction that took forever and could have saved my savings. Woke up in shock to a liquidated CDP ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fullname",
                    "index": "#15",
                    "likes": "2",
                    "time": "19/03/2020-22:04:13",
                    "content": "Vault #2363 Collateral ~579 ETH  (not sure if it was exactly this) Liquidation price ~178$  (not sure if it was exactly this) ETH returned: 55ETH I SHOULD HAVE RECEIVED: on DefiSaver history, I calculated a minimum of 234ETH, but I’m not sure about the calculation because I don’t have a lot of details in the history. The bids were at 0$ or 120$/ETH (far from the 178$). I added more collateral the day before, and some at 1am, 3 hours before liquidation. It was not working when I wanted to “Repay” more than 5ETH on DefiSaver (I don’t remember the error), so I tried 5ETH and the transaction were very slow as you may know, and it was already too late. Vault #4996 Collateral 262 ETH Liquidation price 173$ ETH returned: 13ETH I SHOULD HAVE RECEIVED: a minimum of 63ETH –> At the time of liquidation, total ETH received back would have been minimum 297, which was ~50kUSD. But I received only 68ETH which was ~11kUSD. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.061538461538461
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#16",
                    "likes": "1",
                    "time": "20/03/2020-02:47:25",
                    "content": "@everyone who has been effected please fill in this sheet with your info and supporting evidence:   docs.google.com    MakerDAO CDP Liquidation Victims / Activists for Justice CDP Victim Report  Viral Campaign to find victims -  Post here after you have contacted someone. Check that their username isn't already logged here first.  (COPY/PASTE the message from the second tab. DIRECT MESSAGE ONLY) so we don't spam,Victims -...      ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1XARFxnWespe4dC7FuPm0cXKN1C0No3UOXdQKKLo5U-o/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1XARFxnWespe4dC7FuPm0cXKN1C0No3UOXdQKKLo5U-o/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#17",
                    "likes": "5",
                    "time": "20/03/2020-11:40:42",
                    "content": "I appreciate the effort here, but I think we’d prefer if liquidation data was scraped directly from the block-chain rather than self-reported. We’ll need to be able to verify everything, and taking the data from the chain will give us a complete list, whereas we may miss people if this is self-reported. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#18",
                    "likes": "2",
                    "time": "20/03/2020-12:47:09",
                    "content": "Yes, we need to have source code that produces the data. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hsingh21",
                    "index": "#19",
                    "likes": "3",
                    "time": "21/03/2020-17:32:33",
                    "content": "Hey All Lucky Liquidator here of Vaults 6211    DeFi Explore    Defi Explore - MakerDAO MCD stats The easy way to check MakerDAO MCD positions and system stats.       5300    DeFi Explore    Defi Explore - MakerDAO MCD stats The easy way to check MakerDAO MCD positions and system stats.       5209    DeFi Explore    Defi Explore - MakerDAO MCD stats The easy way to check MakerDAO MCD positions and system stats.       I would like to also add that i have been a long time user of Marker DAO and a huge advocate of Defi but my confidence in Defi as a whole took a huge hit on that 12th March, i had been saving up this money which is most of my savings and i was in complete shock to see my Vaults go to zero like that. I know there are some good people in this community all i ask is that everyone who lost out to please be considered for compensation, many of us have worked really hard for this money and although yes we knew the risks i myself was always watching my CDP’s like a hawk and doing everything by the book to make sure i didn’t get liquidated. ",
                    "links": [
                        "https://defiexplore.com/cdp/6211",
                        "https://defiexplore.com/cdp/5300",
                        "https://defiexplore.com/cdp/5300",
                        "https://defiexplore.com/cdp/5209",
                        "https://defiexplore.com/cdp/5209"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6398809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hsingh21",
                    "index": "#20",
                    "likes": "2",
                    "time": "21/03/2020-21:16:05",
                    "content": "So for now we don’t have to do anything? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adrianmcli",
                    "index": "#21",
                    "likes": "2",
                    "time": "05/04/2020-23:33:24",
                    "content": "I see that there hasn’t been a message here for 15 days. If you lost your Vault on Black Thursday, PLEASE comment on this thread: On-chain vault compensation poll, draft They are going to poll MKR holders with it, and your input is needed. If it’s worded too harshly against compensating, you will get NOTHING. So please PLEASE go take a look and make sure it is worded fairly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#22",
                    "likes": "2",
                    "time": "09/04/2020-02:26:23",
                    "content": "I posted elsewhere on data finally appearing that should yield to complete Maker auction liquidation analysis.   Hopefully I will have a report for Black Thursday Vault owners that have reported here soon.     Compensating vault holders that liquidated at 0 bid?! Governance       Thanks to the data above from @Bobface of https://maker-auctions.io  and https://defiexplore.com/liquidations  I am able to do a full liquidation analysis spreadsheet on ETH from auction 1 to 4857 (BAT will follow as soon as I flesh out analysis structures within the ETH spreadsheet and then put the data together for a time sequence based analysis)).   I now have two different full data sets with all liquidation data as well as the subsection of this data analyzed by whiter4bbit to look at that …     ",
                    "links": [
                        "https://maker-auctions.io",
                        "https://defiexplore.com/liquidations"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7175925925925934
                },
                {
                    "author_link": "https://forum.makerdao.com/u/energyone",
                    "index": "#23",
                    "likes": "1",
                    "time": "09/04/2020-18:58:14",
                    "content": "Black Thursday victim here, Vault #6616. I had 99ETH as collateral during the crash - tried all day to add ETH (I had 100 more ETH in my Ledger Live wallet) but the transaction sat as “Pending” most of the day. There is no apparent way to add gas using my Nano X/ LedgerLive while using the Oasis App to increase the chances of the transaction going through. Very disappointed that I spent most of the day trying to add collateral to the contract, but the system was overloaded making it impossible. Here are my values on that day: 99 ETH as collateral - I generated 7,000 DAI on March 10th. With ETH value at $200.00 my Collateralization ratio was approx. 280%. On Black Thursday, I tried repeatedly to add ETH to the vault, but due to the falling ETH price, my transactions were stuck as “Pending” transactions and never completed. At today’s ETH price, I have a loss of 88 ETH ( -$14,960) plus the $7000.00 DAI = $7,960.00 LOST. My contract got liquidated and I ended up with only 11.22 ETH being sent back to my vault. My next challenge was withdrawing the 11 ETH, it took days of failed attempts to get the ETH back into my Ledger, and then finally it worked using the exact same procedure, almost as if a bug had been fixed(?) I would encourage the developers of Oasis to add a Gas Slider to the deposit window of the vault. Now that it’s over, I have learned that MetaMask allows for increasing the gas for a deposit, but there is no way to add gas using a Ledger Nano X. I also feel that there is more instructions needed in the Oasis GUI. How about some “?” bubbles that you can click to get more info? https://etherscan.io/address/0x10bbb2a8917a529028b10cf250af467d54c0d3df Thanks to anyone who can help with the loss, for me it is very real. - Earl ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.129272727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#24",
                    "likes": "3",
                    "time": "28/04/2020-21:12:58",
                    "content": "Vault holders.  You have not been forgotten. I finally completed a MCD Ethereum System Liquidation and a Black Thursday Compensation analysis Report available as a PDF in the following thread.     Maker MCD Ethereum System Liquidation report and Black Thursday Compensation Analysis Governance       Greetings Maker community,  At long last the Maker MCD Ethereum Liquidation and Black Thursday Compensation Analysis reports are availble below.    Lets keep discussion on the details of the report, questions, comments, etc. focused in this thread.  Stay tuned for updates on when a conference call on this report will occur.     Maker Governance has decided via on-chain poll its intention to compensate Black Thursday Vault owners but the details of compensation still being discussed. Thank you all for your patience on this.   Hopefully this process will complete and governance will ratify some kind of compensation package.   I know a number of you self liquidated (vault 2288) and have made reports here these all will be considered in due course as this process unfolds. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.107638888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#25",
                    "likes": "1",
                    "time": "29/04/2020-01:26:46",
                    "content": "    energyone:  99 ETH as collateral - I generated 7,000 DAI on March 10th. With ETH value at $200.00 my Collateralization ratio was approx. 280%. On Black Thursday, I tried repeatedly to add ETH to the vault, but due to the falling ETH price, my transactions were stuck as “Pending” transactions and never completed. At today’s ETH price, I have a loss of 88 ETH ( -$14,960) plus the $7000.00 DAI = $7,960.00 LOST.   How did you lose 7,000 Dai – this was value you generated against your vault and that you alone controlled? If you lost those funds, or spent them on whatever, that’s on you and has nothing to do with your vault, the Maker Protocol, MKR Holders or anyone else. Regardless of your (dubious) claim about using the vault, the statement trying to blame anyone but yourself for losing your 7,000 Dai is off the mark. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.347222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/energyone",
                    "index": "#26",
                    "likes": "0",
                    "time": "29/04/2020-01:48:24",
                    "content": "@Tosh9.0 - Sorry if I presented it in a confusing way- I am not saying that I lost the 7,000 DAI, but rather I was trying to show the DAI as a credit, not a debit. When I say “plus the $7,000 DAI” I am trying to show that the DAI was not lost. So, I lost 88 ETH thru liquidation ($17,336 at today’s price) but after taking into consideration the $7,000 DAI that was not lost, I have a loss of $17,336 minus $7,000 for a total loss of $10,336 at today’s price. I hope that is clearer than my first post. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#27",
                    "likes": "2",
                    "time": "05/05/2020-14:52:12",
                    "content": "The following which are not N/A are already in the compensation report ETH totals.   You are already in the Black Thurscay compensation class.   Those marked N/A are not.   2288 I have your data but you formally are the first in the list of people who have provided data but are not part of the Black Thursday liquidation class.    I will be gathering data on those as time permits. Here is the list from the above. vaultid      before              after 392\t        109\t\t        0 6709\t169.5220655\t0 4246\t990.9972269\t2.993506 3157\t104.06880605\t0 5931\t21\t\t       .8881311\t21\t.88 3882\t118.7541052\t0\t\t118\t0 4763\t610.484177\t0\t\t600\t0 6194\t18.9102867\t1.6390755\t19\t1.6 2282\t164.52\t\t0\t\t168\t0 4006\t35.4592031\t0\t\t35\t0 3805\t52.8\t\t        0\t\t52\t0 3834\t100.1\t\t0\t\t105\t 2363\tN/A\t\t\t\t        579\t55 4996\tN/A\t\t\t\t        232\t13 6211\t60.1\t\t        0 5300\t12\t\t        0 5209\t57.2\t\t        0 6616\tN/A\t\t\t                99\t11.22 Sorry for the lack of formatting here will snapshot this later. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.697916666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Peter_Albrecht",
                    "index": "#28",
                    "likes": "1",
                    "time": "05/05/2020-19:42:01",
                    "content": "Hi There, first of all thank you guys for the great work. I have been as well affected by the black friday event: https://defiexplore.com/cdp/6251 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.472222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#29",
                    "likes": "0",
                    "time": "05/05/2020-20:03:57",
                    "content": "6251 you are already in the class presented in the compensation report. 19.3166667932428  returning 1.4060279 ETH. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#30",
                    "likes": "0",
                    "time": "05/05/2020-20:09:41",
                    "content": "post moved to Maker MCD Ethereum System Liquidation report and Black Thursday Compensation Analysis ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fullname",
                    "index": "#31",
                    "likes": "0",
                    "time": "06/05/2020-15:15:37",
                    "content": "    MakerMan:  2363 N/A 579 55 4996 N/A 232 13   Sorry, how my vaults can be N/A? They were liquidated during the night before Black Thursday. My Net Value was ~60KUS just before liquidation, and I got 68ETH in return, which was ~10k. So I got only 8% of my collateral back, it’s a bit far from the optimal number of 24.6%. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.527777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sah",
                    "index": "#32",
                    "likes": "0",
                    "time": "06/05/2020-15:28:57",
                    "content": "Hello, im looking for info on my vault #1000 I don’t see it on the list. Is there a link where I can view information on my vault specifically? https://defiexplore.com/cdp/1000 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#33",
                    "likes": "2",
                    "time": "06/05/2020-19:43:27",
                    "content": "N/A just means they are not in the 0-bid liquidation set over the time chosen.   So you are not in the 0-bid compensation plan proper. I see you basically were liquidated when the Market price to OSM was larger than 20% and the market price was falling while your vault was being liquidated. I will make a note of you when discussing this as you will be one that fell outside the selected time range.   (i.e. there were no 0-bid auctions going on)   What I do see is that market prices at the time were already starting to fall.   Literally OSM was 171 and some markets were at like 135-140 which with the 13% liquidation fee pretty much put you in the no-collateral return level. The only way anyone gets even close to the theoretical collateral return of 24.67% is if the market is either going up after falling and triggering an auction or that the OSM is matching market.   At times the market is > 20% lower than the OSM auctions will be ‘normal’ and ‘efficient’ but simply not return collateral. Like I said I will note you in the list but can already anticipate governance here which will be a possible narrowing of compensation against a market performance filter vs. a tab based on like I chose and I will need a better dataset with prices and timings to even have a hope of applying such a filter. I was there watching these markets on these days (like I normally do) and we were seeing 10% or greater drops in minutes.   No way one could expect anything close to theoretical collateral return in such circumstances.  That is like expecting people to overpay for something from you when they can buy it cheaper elsewhere.   Due to the nature of the auction process it is possible for keepers to basically overbid and then be stuck with a loss on the collateral.   Which is EXACTLY what happened to many keepers during the time you were liquidated.   It is why I think you got some of your collateral back vs. getting none. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.539772727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#34",
                    "likes": "2",
                    "time": "06/05/2020-19:46:28",
                    "content": "@sah I have vault 1000 in the Black Thursday compensation list. BTW:  It is easy for people to see if they are in this list.  Just look up your vault auctions on defisaver and see if your auctions were between auction 762 and 4325. example:  https://defiexplore.com/cdp/2363 ending up at one of his liquidations https://defiexplore.com/liquidation/ETH/724 which 724 being outside of the 762-4325 range. ",
                    "links": [
                        "https://defiexplore.com/liquidation/ETH/724"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.444444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mikaleo",
                    "index": "#35",
                    "likes": "0",
                    "time": "07/05/2020-04:45:33",
                    "content": "Vault 4452, got liquidated with 480 ETH collateral, got 0 ETH back. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#36",
                    "likes": "0",
                    "time": "07/05/2020-06:23:41",
                    "content": "@mikaleo I have you (vault 4452) in the compensation class with 480.6130381ETH deposited  0 collateral returned. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pk7654",
                    "index": "#38",
                    "likes": "0",
                    "time": "10/05/2020-10:19:27",
                    "content": "I’m not fully in the loop since the other topic, but my vault is 4056. I was travelling abroad, without a laptop, talking with a friend about our vaults. He topped up his the night before but couldn’t get it working on mine. Next day mine was empty, his wasn’t. I was quite depressed for a few days. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/make_dao_2020",
                    "index": "#39",
                    "likes": "0",
                    "time": "11/05/2020-00:32:19",
                    "content": "Vault 4514, got liquidated with 1360 ETH and 0 ETH back. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#40",
                    "likes": "0",
                    "time": "11/05/2020-01:21:54",
                    "content": "@make_dao_2020 The average vault collateral returned from liquidations before Black Thursday was 17.7% which would have given you 240.72 ETH back. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.472222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mikaleo",
                    "index": "#41",
                    "likes": "0",
                    "time": "11/05/2020-05:52:03",
                    "content": "only 240.72 eth back？that’s unacceptable ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#42",
                    "likes": "1",
                    "time": "11/05/2020-05:53:32",
                    "content": "I disagree. That’s a fair return based on the historic average. What is unacceptable is 0. And that its been 2 months with no compensation being put together. I would like to hope within the next 2-4 weeks we can move on from this all. We all need to do our part. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/make_dao_2020",
                    "index": "#43",
                    "likes": "0",
                    "time": "11/05/2020-13:10:22",
                    "content": "Thanks for the reply! But are you sure about the number of 17.7% (and 240.72 ETH)? It’s still not finalized, right? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.726190476190475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#44",
                    "likes": "0",
                    "time": "11/05/2020-13:33:16",
                    "content": "@make_dao_2020 No polling or votes have been made so nothing is finalized. I’m just saying that 240.72 is 17.7% of 1360 and that is the average amount of collateral returned to vault holders prior 0 bid auctions happening ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#45",
                    "likes": "1",
                    "time": "11/05/2020-13:45:27",
                    "content": "@pk7654   Vault 4056 liquidated in the Pre-AGC period. Also unless you or I made a mistake I have you with the following: 160ETH total\t\t\t136.408255380826 Liquidated This returned 23.591ETH or  14.74% Auctions 4420 4578 4588 4590 The above vault is not included in the Black Thursday compensation report. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#46",
                    "likes": "2",
                    "time": "11/05/2020-14:01:27",
                    "content": "Vault 4514,  I have you already in the Black Thursday compensation class with 1360.00079ETH returning 0. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pk7654",
                    "index": "#47",
                    "likes": "0",
                    "time": "11/05/2020-14:53:34",
                    "content": "Where can I find more on what’s pre-AGC? I’m not sure if your statement is correct, my vault was empty when I checked it on the morning of March 13 (around 07:00) and still is. There’s no 23.591 ETH back anywhere as far as I know. When I check the actions, this one has 3 bids:  4420  And these have 1 bid:  4578 4588 4590  If I interpret the pages correctly, all auctions closed at a price of around 90 DAI/ETH which doesn’t seem like a 0 bid auction. But then again, where’s the remainder in ETH? And why does the vault overview page list everything twice? Is the different between the two what I should have received in the liquidation? ",
                    "links": [
                        "https://defiexplore.com/liquidation/ETH/4578",
                        "https://defiexplore.com/liquidation/ETH/4588",
                        "https://defiexplore.com/liquidation/ETH/4590",
                        "https://defiexplore.com/cdp/4056"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.107142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#48",
                    "likes": "2",
                    "time": "11/05/2020-18:37:14",
                    "content": "Well then the question is whether you are vault 4056 or whether you slipped a digit. If you want to look yourself…    DeFi Explore    Defi Explore - MakerDAO MCD stats The easy way to check MakerDAO MCD positions and system stats.      They were NOT 0-bid auctions and yes we can have a successful auction that returns 0 collateral and still pays the full tab. In the case of vault 4056 there was 23.591ETH returned as you can see for yourself on defiexplore.com link above. As always I understand this is difficult for everyone it is possible one or more mistakes can be made.   Please do read my Maker ETH Liquidation and Compensation report as the auction #'s 763-4324 (inclusive) are what is included in the Compensation Analysis.     Maker MCD Ethereum System Liquidation report and Black Thursday Compensation Analysis Governance       Greetings Maker community,  At long last the Maker MCD Ethereum Liquidation and Black Thursday Compensation Analysis reports are availble below.    Lets keep discussion on the details of the report, questions, comments, etc. focused in this thread.  Stay tuned for updates on when a conference call on this report will occur.     I encourage people to use defiexplore.com to look at the history of their vault. I am not sure what is up with the data here 4056.   In my data I show you should have gotten collateral back.  Defiexplore.come says same.   I look on https://oasis.app/borrow/4056?network=mainnet I see no collateral, and no withdrawal.   I agree with you something is not consistent with your 4056 vault and apologize if it seemed I was telling you something different than what you appear to be seeing.    We will have to look into this one a bit.    Technically though 4056 auctions fall outside of the Black Thursday compensation analysis though.   That was the main thing I was confirming. Take a look at what defiexplore.com and oasis is telling us on 4056.   I see that collateral should have been returned but I don’t see it. As to why you see things twice I think because you are seeing the tend and dent. From my dataset. 4420|50|3819.6750|4|42.3704840455724| |—|---|—|---| 4478|50|3819.6980|2|42.7444404918473| 4588|50|3819.6980|2|42.7444423695052| 4590|10|763.9390|2|8.54888847390104| 1st number auction, 2nd ETH lot offered, 3rd 1.13*tab to be covered, 4 bids, 5 amount of ETH sold There can be more bids both in tend and dent phases.   My data doesn’t discriminate between bids in tend or dent and just calls them all bids.   I am not sure how defiexplore.com is determining what is a bid or not.   I will have to ask my guy about how number of bids is determined to get a better idea. ",
                    "links": [
                        "https://defiexplore.com/cdp/4056",
                        "http://defiexplore.com",
                        "https://forum.makerdao.com/t/maker-mcd-ethereum-system-liquidation-report-and-black-thursday-compensation-analysis/2243",
                        "http://defiexplore.com",
                        "https://oasis.app/borrow/4056?network=mainnet",
                        "http://defiexplore.com",
                        "http://defiexplore.com"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.305
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pk7654",
                    "index": "#49",
                    "likes": "0",
                    "time": "12/05/2020-08:09:23",
                    "content": "I am 100% sure this is me and I did go through the auctions, for as far as I can understand them. After looking through your report again, time wise I’d say my auctions were in the BT fase, although they weren’t 0 bids.     MakerMan:  In the case of vault 4056 there was 23.591ETH returned as you can see for yourself on defiexplore.com link above.   I don’t see the 23.591 ETH anywhere on that page, could you point this out to me?     MakerMan:  I see no collateral, and no withdrawal. I agree with you something is not consistent with your 4056 vault and apologize if it seemed I was telling you something different than what you appear to be seeing. We will have to look into this one a bit. Technically though 4056 auctions fall outside of the Black Thursday compensation analysis though. That was the main thing I was confirming.   Thanks for confirming that something is amiss here and for looking into it further. I know the focus is for now the 0 bids, but this isn’t correct neither. Would this be part of the BT compensation analysis? Thanks for clearing up the double bids. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#50",
                    "likes": "1",
                    "time": "12/05/2020-14:03:40",
                    "content": "BT compensation analysis runs from auctions 763-4324 which is where the 0-bids happened.  Yours and at least one other fall outside of this group.   As to what happened you can see on defi-explorer the LOT offers and the tend reverse auction bids on the collateral and that is what you are seeing in defiexplore.com the lot offer 50, and the lot sale like 42.33 or whatever.   Which is what I see in my data and why I am confused I saw no ETH returned in that vault. If I can get anyone who has expertise to look into one or more of these auctions we will figure it out. My time is limited somewhat this week. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.788265306122449
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bg1983",
                    "index": "#51",
                    "likes": "0",
                    "time": "12/05/2020-16:13:27",
                    "content": "Hi, Vault 2724 - I had 477.95 ETH collateral that was totally liquidated ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#52",
                    "likes": "1",
                    "time": "12/05/2020-16:53:45",
                    "content": "Vault 2724. I have you in the BT compensation list.    Data I have says. Total offered 477.95627111418ETH Sold 467.913801879264\tETH ETH returned 10.0425ETH % returned 2.1% FYI Looking at one of your auctions. https://defiexplore.com/liquidation/ETH/1245  shows one with dent that should have returned collateral. Here is full list of auctions 1581 1710 1839 2658 2659 2660 2661 1105 1245 1146 You are now second that shows no vault oasis withdrawals and no ETH in vault claiming no ETH returned when the data I have pulled which confirms what defiexplore.com is saying is that you should have SOME collateral left.   I am going to bring this up with foundation devs and see if I can get any clarification as to what is going on here since if my dataset is flawed the whole liquidation and compensation report is flawed. https://oasis.app/borrow/2724?network=mainnet I need someone with experience looking at these auctions to help me figure out where the ETH that was supposed to be returned went - what tx’s we are missing leading to this issue. ",
                    "links": [
                        "http://defiexplore.com",
                        "https://oasis.app/borrow/2724?network=mainnet"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.59375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bg1983",
                    "index": "#53",
                    "likes": "0",
                    "time": "12/05/2020-20:19:24",
                    "content": "Thank you for your response. It looks like 1105,1245, and 1146 should have returned collateral. I guess I’ll wait to hear about what is going on, it is kind of unnerving that none of the Dents were returned. I hope there isn’t an underlying issue. Please keep me updated ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mikaleo",
                    "index": "#54",
                    "likes": "0",
                    "time": "13/05/2020-00:31:14",
                    "content": "    MakerMan:  BT compensation analysis runs from auctions 763-4324 which is where the 0-bids happened.   Is 4452 in the BT compensation？0-bids happened but it’s out of the range. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Poligon_Assets",
                    "index": "#55",
                    "likes": "0",
                    "time": "13/05/2020-00:58:33",
                    "content": "Esta es mi boveda, por si sirve algo https://defiexplore.com/cdp/5582 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Poligon_Assets",
                    "index": "#56",
                    "likes": "0",
                    "time": "13/05/2020-01:00:37",
                    "content": "neither did they give me back what was due ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Poligon_Assets",
                    "index": "#57",
                    "likes": "0",
                    "time": "13/05/2020-01:12:13",
                    "content": "In case the data is useful (I already loaded them in the form), I had 20 eth blocked from collateral, I owed 1880 dai and my settlement price was $ 141.20 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#58",
                    "likes": "0",
                    "time": "13/05/2020-04:20:02",
                    "content": "Poligon, This looks like the auction for collateral in your vault:    DeFi Explore    Defi Explore - MakerDAO MCD stats The easy way to check MakerDAO MCD positions and system stats.      Seems like your vault was liquidated at $102.52 DAI/ETH right in the middle of a black swan event when the price of ETH was dropping to the floor . . . and no “zero bidding” here… ",
                    "links": [
                        "https://defiexplore.com/liquidation/ETH/2879"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.69047619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DoZa",
                    "index": "#59",
                    "likes": "0",
                    "time": "13/05/2020-11:03:28",
                    "content": "Vault 2096 Liquidation 1577     0DAI/ETH TX hash: 0xaf2392e2d1d6be45756ac24fcdb5b94edacdb0df4a9aef3e13e395e42ad8fc8d Liquidation 1688     0DAI/ETH TX hash: 0x8eee8e098d150c3e3c191aa020ccf7110a016b731b7dc239e5eee0da8698554e ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#60",
                    "likes": "1",
                    "time": "13/05/2020-14:58:09",
                    "content": "Vault 2096 welcome to the forums.   As you can see above you are already in the Black Thursday class at least as I have defined it.  auctions 763-4324. I have you with 200ETH total offered, selling 193.57ETH, should have returned 6.43ETH  for collateral return of approx 3.2% ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Poligon_Assets",
                    "index": "#61",
                    "likes": "0",
                    "time": "13/05/2020-23:45:56",
                    "content": "   DeFi Explore    Defi Explore - MakerDAO MCD stats The easy way to check MakerDAO MCD positions and system stats.          DeFi Explore    Defi Explore - MakerDAO MCD stats The easy way to check MakerDAO MCD positions and system stats.      look at how the vault was with the last two movements, also I am sure that the liquidation was at 138 140 ",
                    "links": [
                        "https://defiexplore.com/tx/0x9451281ac569efb68c3a3f70f847f8f8335ee4e9a0a2e01a9400757ad77cb7fa",
                        "https://defiexplore.com/tx/0x0f4842b335202d685faca83a4ff2c008919b3a539a46aaf2c9daa4f011325ae2",
                        "https://defiexplore.com/tx/0x0f4842b335202d685faca83a4ff2c008919b3a539a46aaf2c9daa4f011325ae2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.708333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/execute007",
                    "index": "#62",
                    "likes": "0",
                    "time": "14/05/2020-00:37:43",
                    "content": "    mexfogel:  I also got liquidated back in Dec where my vault had 700 ETH and I couldn’t repay mi debt due to lack of sai available and transactions not going trough. After that liquidation I was left with the 175 ETH that got put into this last vault. Now I’m at zero. I can’t find the old vault number since I migrated it to the new system. I already shared my thoughts on how this creates a big trust issue in all future users and what i believe should be done to remedy this:   I feel your pain on the double down i took all my clients off maker and vault contributions. Also everyone going forward when and if they bring up maker i give them the statement maker put out and the lawsuits against them. Its time for someone to do something other then kick the can down the road. They want to call this finance 2.0 i call it fed 2.0. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.028943278943279
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mdvault5026",
                    "index": "#63",
                    "likes": "0",
                    "time": "14/05/2020-10:39:24",
                    "content": "Our vault #5026 had 100% collateral liquidated (881 ETH) on March 13th.    DeFi Explore    Defi Explore - MakerDAO MCD stats The easy way to check MakerDAO MCD positions and system stats.      ",
                    "links": [
                        "https://defiexplore.com/cdp/5026"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/didi",
                    "index": "#64",
                    "likes": "0",
                    "time": "16/05/2020-09:55:52",
                    "content": "Hi I don’t fully understand what happened to my vault 4692. Can you pls check and comment? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#65",
                    "likes": "2",
                    "time": "29/05/2020-23:46:16",
                    "content": "@bg1983  regarding vault 2724 and @pk7654  regarding vault 4056 After some investigation I am told your collateral is waiting for you to claim.What I am being told is that if you come back to oasis.app with the wallet for those vaults connected to your browser that you should see some sort of banner informing you that there is collateral to be claimed where you can then claim the returned funds from your liquidations. Please take a look again on oasis and see if you get some kind of banner message saying you have collateral to reclaim or not and let us know.  If anyone manages to get this to work please take a screenshot of what it looks like because I think there may be more vaults liquidated that got collateral back but have not claimed it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pk7654",
                    "index": "#66",
                    "likes": "4",
                    "time": "30/05/2020-05:34:41",
                    "content": "It actually is! I reclaimed it and the ETH is now available in my vault again. The banner looks like this: image994×70 5.74 KB You need to confirm the txn in your wallet and in a few secs the ETH is back in your vault. Thanks for your work MakerMan! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hdh",
                    "index": "#67",
                    "likes": "1",
                    "time": "31/05/2020-11:22:48",
                    "content": "Thanks for your work @MakerMan , really appreciated. I’m 3834 and tried to connect my Ledger to Oasis but no banner or no claim button. Am i missing something ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rovdi",
                    "index": "#68",
                    "likes": "0",
                    "time": "31/05/2020-11:38:08",
                    "content": "what about vault 392 ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#69",
                    "likes": "0",
                    "time": "31/05/2020-13:46:13",
                    "content": "@hdh  with 100.1ETH liquidated - no collateral returned @rovdi with 109ETH liquidated - no collateral to returned. You both are in the Black Thursday compensation class. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#70",
                    "likes": "0",
                    "time": "31/05/2020-13:47:37",
                    "content": "I am just happy we found your collateral @pk7654 as it confirms my data is correct. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bg1983",
                    "index": "#71",
                    "likes": "2",
                    "time": "01/06/2020-13:13:59",
                    "content": "Also confirming I was able to claim 10.04 ETH. Thank you for your help @MakerMan ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#73",
                    "likes": "0",
                    "time": "01/06/2020-21:07:48",
                    "content": "@vidalleo I have the following: 39.93\t4269.5780\t3\t34.2903683831207\t1099\t2622  In compensation list   (14% collateral return) here 50\t5683.8530\t1\t50\t\t\t1655\t3917  In compensation list 16.2\t1841.5720\t1\t16.2\t\t\t2054    3917  In compensation list 0% collateral return on 3917 You should have gotten 5.64 ETH back on vault 2622. 3917 basically got nothing back. Both are in the liquidation report and compensation list. Take a look on oasis for 2622 and see if you have any collateral waiting for you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vidalleo",
                    "index": "#75",
                    "likes": "0",
                    "time": "01/06/2020-21:35:15",
                    "content": "ok. Interesting. Thanks, The 5.64ETH was claimed but those were deposited “after” the vault got liquidated. The network was so congested that it took over 12 hours for that deposit to clear - deeming it useless.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#76",
                    "likes": "0",
                    "time": "01/06/2020-22:20:33",
                    "content": "Yeah that sucks.   Sorry man.  Everyone was having a hell of a time clearing anything tx wise during that period.   I get to the point that if I need a tx to clear I just pay the fee at highest level, wait ,if it doesn’t clear pretty quickly I resubmit with higher fee until it does. Ugly painful, expensive and still error prone.   Both vaults are in the liquidation/compensation lists currently.    Not sure this helps but at least you got ‘something’ back.  There are a LOT of people that got nothing, zero, nada.   FYI: on your 3917 vault MKR holders/system ate 9K DAI of losses. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Damas",
                    "index": "#77",
                    "likes": "0",
                    "time": "01/06/2020-22:52:29",
                    "content": "Hello all, My vault (CDP ID 5960, liquidation ID 3576) was part of the group that was liquidated for 0 DAI, yet I don’t see any amount available to claim on the Oasis app after I connect with my Ledger. Please advise on how I should proceed to get the compensation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/openforbusiness",
                    "index": "#78",
                    "likes": "0",
                    "time": "02/06/2020-20:56:51",
                    "content": "I’m curious about vault ETH-A #2813. There was 1.53 ETH to claim, but I can’t seem to work out if it should have received more after liquidation. It seemed a lot lower than expected for the price it was liquidated at. Thank you @MakerMan for all the work you have done so far, it is much appreciated! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6499999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#79",
                    "likes": "0",
                    "time": "02/06/2020-21:55:13",
                    "content": "@Damas I have you in the list and yeah nothing to claim.   System booked 2775DAI losses as your lot (approx 37.99ETH) sold for 2.862DAI ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Damas",
                    "index": "#80",
                    "likes": "0",
                    "time": "02/06/2020-22:10:48",
                    "content": "Can you be more specific, does it mean that I will receive no compensation even though the vault was indeed liquidated at practically 0 DAI per ETH and the community poll decided to compensate this group of vault owners ? Maybe I misunderstood the compensation process, if so please point me to the posts/threads where it is summarized. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#81",
                    "likes": "0",
                    "time": "02/06/2020-22:11:21",
                    "content": "@openforbusiness I see with with liquidation 4471 you got 12.7% collateral back.   Technically I have you just outside the current BT liquidation class (I picked auctions 763-4324). I will be providing another update this evening.   We are discussing how to approach setting the class in terms of time limits as I know out to auction 4700ish Maker was still getting impaired auction performance but ultimately the time frame and conditions for whether a vault meets a compensation standard will be determined by them.   a lot of auctions during your time frame (after 4324 and before say 4700) only netted 10-12% collateral return.   Some of the larger auctions 500ETH netted barely 2-3% for the vault holder.   There still seems to be some debate as to the reason.   whether this an auction time thing or size.   Your auction was rather small so it matched performance of other auctions of your size. Sad welcome to both you @openforbusiness and @Damas as first time posters.  Hopefully we will turn this rock soon here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.080357142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#82",
                    "likes": "0",
                    "time": "02/06/2020-22:13:02",
                    "content": "@Damas you are in the liquidation class as I have defined it by time and auction conditions formally.   So if anyone receives compensation you will.   How much that is a matter for governance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Damas",
                    "index": "#83",
                    "likes": "0",
                    "time": "02/06/2020-22:16:31",
                    "content": "Thanks for the quick feedback and your work on this, very odd that this matter is taking so long when there seems to be a wide community agreement on this. How do you recommend I keep track of the progress regarding this governance process ? This thread or will there be some sort of announcement ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#84",
                    "likes": "1",
                    "time": "02/06/2020-22:42:30",
                    "content": "I try to watch this thread but I have a lot going on.   I guess you just got lucky. Look for updates on status here.     Maker Vault Compensation Updates and Status Governance       Greetings everyone.  I am starting this thread to have a single place for Updates on the above.   I will edit here so people can see the current status and items yet to be worked on.  My time is limited and LongForWisdom is a much better forum organizer so bear with me.  WORKING GROUP consists of @Joshua_Pritikin @LongForWisdom @MakerMan @monet-supply @Vault2288 @befitsandpiper  20200521 Status Update  While working on a comprehensive compensation plan we discovered there are more classes of peo…     I am hoping to get another update out shortly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.661375661375661
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#86",
                    "likes": "0",
                    "time": "08/06/2020-17:19:14",
                    "content": "Folks.   I want to urge again everyone asking. Use defiexplore in conjunction with the Liquidation and Compensation Report posted above to determine if ‘you might be in the class’. When I tell people they are in the class it just means they were one of the vaults that liquidated during the BT time frame chosen (auctions 763-4325).  Ultimately governance via on-chain poll will have to decide what qualifies a vault for possible compensation.   They may change the time frame or conditions to qualify.    The above was simply a report so governance could make these decisions and in the compensation report to attempt to quantify the possible cost involved for some basic scenarios. Example:    DeFi Explore    Defi Explore - MakerDAO MCD stats The easy way to check MakerDAO MCD positions and system stats.       with this auction https://defiexplore.com/liquidation/ETH/1700 is in the BT class as defined in the above report because auction 1700 falls between 763-4325.         ",
                    "links": [
                        "https://defiexplore.com/cdp/2348",
                        "https://defiexplore.com/liquidation/ETH/1700",
                        "https://forum.makerdao.com/t/vault-compensation-plan-proposal/2900"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2407407407407405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Monico",
                    "index": "#87",
                    "likes": "0",
                    "time": "08/06/2020-22:20:36",
                    "content": "Hi Makerman, My Vault was 5423 which can be found here: https://defiexplore.com/cdp/5423. I was liquidated on BT as you can see that its final liquidation was #3787 https://defiexplore.com/liquidation/ETH/3787. Could you please add me to the report? ",
                    "links": [
                        "https://defiexplore.com/liquidation/ETH/3787"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mtwomey",
                    "index": "#88",
                    "likes": "0",
                    "time": "12/06/2020-22:33:21",
                    "content": "Hello my collateral was liquidated in vaults 5173 & 5174 and received 0 ETH back.    DeFi Explore    Defi Explore - MakerDAO MCD stats The easy way to check MakerDAO MCD positions and system stats.          DeFi Explore    Defi Explore - MakerDAO MCD stats The easy way to check MakerDAO MCD positions and system stats.      May I please be added to the report. Tough time for me financially so any compensation would help. Many thanks. ",
                    "links": [
                        "https://defiexplore.com/cdp/5173",
                        "https://defiexplore.com/cdp/5174",
                        "https://defiexplore.com/cdp/5174"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.841269841269842
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vault1202",
                    "index": "#89",
                    "likes": "0",
                    "time": "20/06/2020-12:35:10",
                    "content": "My vault got liquidated with 1090 ETH , all auctions returned 0 back    DeFi Explore    Defi Explore - MakerDAO MCD stats The easy way to check MakerDAO MCD positions and system stats.      ",
                    "links": [
                        "https://defiexplore.com/cdp/1202"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ItsGus",
                    "index": "#90",
                    "likes": "0",
                    "time": "22/06/2020-08:17:40",
                    "content": "Hi all. My CDP was 2380. Would someone kind checking my liquidation status. I am confused by the entries on my defi history. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#91",
                    "likes": "0",
                    "time": "22/06/2020-17:50:15",
                    "content": "It looks like your vault was liquidated on Mar-13-2020 01:08:08 AM, so you would be within time period to be considered for compensation. ",
                    "links": [
                        "https://defiexplore.com/tx/0xaf3709dda97e8e0b0e1a6e0afd834ca5b37496ba7a04ba47caa76071200e9f93"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AmeenSumac",
                    "index": "#92",
                    "likes": "0",
                    "time": "26/06/2020-06:13:12",
                    "content": "Hi folks, My CDP was 4846. Sorry I wasn’t able to find it in the liquidations list. It also doesn’t show a history on defiexplorer. Much appreciated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zao",
                    "index": "#93",
                    "likes": "0",
                    "time": "26/06/2020-17:47:54",
                    "content": "https://defiexplore.com/cdp/6268 the last 1.6 eth was me trying to add funds before the liquidation i was not paid back anything. also my other vault.    DeFi Explore    Defi Explore - MakerDAO MCD stats The easy way to check MakerDAO MCD positions and system stats.      ",
                    "links": [
                        "https://defiexplore.com/cdp/6446",
                        "https://defiexplore.com/cdp/6446"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.385416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#94",
                    "likes": "0",
                    "time": "26/06/2020-18:03:39",
                    "content": "Looks like your vaults were liquidated at Mar-13-2020 03:18:08 AM (6268) and Mar-13-2020 01:12:00 AM (6446), so these would both be within the time period being covered by the compensation plan. The plan as currently written will consider compensation for all vaults between 3/12/2020 12:00 UTC and 3/13/2020 13:40 UTC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#95",
                    "likes": "0",
                    "time": "26/06/2020-18:15:31",
                    "content": "Hm, your vault 4846 is also showing as “unavailable” on Oasis. Not sure why this would be, I’ll ask around and will post here if I learn anything. Where did you set up the vault originally (Oasis, Instadapp, DefiSaver etc)? Not sure if this would make any difference but figure I’d ask. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zao",
                    "index": "#96",
                    "likes": "0",
                    "time": "26/06/2020-19:04:09",
                    "content": "Where can I find out about the compensation plans? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#97",
                    "likes": "0",
                    "time": "26/06/2020-19:07:16",
                    "content": "Compensation plan can be found here: Vault Compensation Plan Proposal Note that it is just a proposal at this point, it has not been accepted by MKR voters yet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AmeenSumac",
                    "index": "#98",
                    "likes": "1",
                    "time": "27/06/2020-02:38:13",
                    "content": "Thanks @monet-supply. It was migrated from SCD to MCD using InstaDapp. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AmeenSumac",
                    "index": "#99",
                    "likes": "0",
                    "time": "01/07/2020-04:52:44",
                    "content": "Hey @monet-supply, any updates on your investigation? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AmeenSumac",
                    "index": "#100",
                    "likes": "1",
                    "time": "13/07/2020-23:11:53",
                    "content": "@monet-supply - Please add vault 4844 (oasis). … as opposed to 4846 (oasis). I requested the Instadapp folks to investigate, see the following investigation thread for details. Summary below: The Instadapp migration process is a bit funky, where it created 4846 then merged it back into 4844. Likely a bug in oasis and defiexplorer UX that doesn’t handle showing this correctly, leading to the missing “merge” activity in both the merged and closed vaults. My liquidated vault is 4844 as a result. ",
                    "links": [
                        "https://oasis.app/borrow/4844",
                        "https://defiexplore.com/cdp/4846",
                        "https://oasis.app/borrow/4846",
                        "https://discuss.instadapp.io/t/maker-vault-emptied-with-no-activity-records/98/4"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hdh",
                    "index": "#101",
                    "likes": "1",
                    "time": "23/07/2020-07:38:51",
                    "content": "   CoinDesk – 22 Jul 20    Mempool Manipulation Enabled Theft of $8M in MakerDAO Collateral on Black... New research suggests March’s “Black Swan” event for Ethereum may have been a sophisticated plan to cash in on a global sell-off.      ",
                    "links": [
                        "https://www.coindesk.com/mempool-manipulation-enabled-theft-of-8m-in-makerdao-collateral-on-black-thursday-report"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.303030303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amosrendao",
                    "index": "#102",
                    "likes": "0",
                    "time": "24/07/2020-01:40:24",
                    "content": "Hey all, vault #3675. I had 413 ETH collateral around $32000 in DAI debt Liquidation at $135 ETH price After the liquidation fee and debt payoff as I understood from reading before using MakerDAO, I should have been left with roughly $20,000 or around 148.15 ETH Thank you so much to those of you helping push this towards a fair resolution. Cheers <3 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.799999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vaultvictim5288",
                    "index": "#103",
                    "likes": "1",
                    "time": "24/07/2020-05:02:57",
                    "content": "Wishing for a fair resolution and closure to this unthinkable event. Vault #5288    DeFi Explore    Defi Explore - MakerDAO MCD stats The easy way to check MakerDAO MCD positions and system stats.      Generated 35,999.91 DAI Collateral 331.00 ETH Liquidation Price $163.14 Vault loss $52,266.96 Hope to hear some positive developments soon and get back more ETH. ETH rocket ain’t waiting for nobody!! Thanks to all for your hard work on compensation proposals and making MKR great. ",
                    "links": [
                        "https://defiexplore.com/cdp/5288"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.555660774410774
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#104",
                    "likes": "1",
                    "time": "24/07/2020-13:50:03",
                    "content": "Original article. Quite an interesting read.    blog.blocknative.com    Evidence of Mempool Manipulation on Black Thursday: Hammerbots, Mempool... Explore findings from Blocknative's Mempool Archive that shed light on the CDP Liquidations of March 12 and 13. Learn about vulnerabilities that every crypto company should plan for.      ",
                    "links": [
                        "https://blog.blocknative.com/blog/mempool-forensics"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.385416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sah",
                    "index": "#105",
                    "likes": "1",
                    "time": "25/07/2020-00:02:46",
                    "content": "Is anything happening next week on the governance call? For compensation? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#106",
                    "likes": "0",
                    "time": "25/07/2020-07:25:54",
                    "content": "Yep looks like it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vault3974",
                    "index": "#107",
                    "likes": "0",
                    "time": "19/09/2020-18:45:37",
                    "content": "vault 3974* - lost 19.11 ETH. Not entirely sure what happened, but I think all or some of my collateral was liquidated at 0. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sepu85",
                    "index": "#108",
                    "likes": "0",
                    "time": "29/09/2020-11:48:44",
                    "content": "yup! there are still some vaults with no compensation available (~2.5 M in total). There might be still a chance to recover those -->     Vault Compensation Plan v3 - A Vault Compensation Support DAO to assure a better MakerDAO Governance Governance       TL;DR: community have proposed a very legit plan for compensation Black-Thursday Vault Victims, it has been passed but, we did not prepare ourselves against not supportive MKR whales. There’s a way to counteract this power, we just need to do an extra effort. Let’s create the incentives to make a new poll pass by the creation of a Vault Compensation Support DAO.  @monet-supply has made a very compelling post-mortem analysis twitter threat that might worth to read in case you are not familiar wit…      ",
                    "links": [
                        "https://twitter.com/MonetSupply/status/1308464483791060993"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.744431818181819
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#109",
                    "likes": "0",
                    "time": "04/10/2020-20:18:45",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}