{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-crank-dc-dc-iam-liquidation-parameters-preparation-parabolic-stage-nfa-second-attempt/11026",
            "title": "[Signal Request] Crank DC, DC-IAM, & Liquidation Parameters [Preparation: Parabolic Stage] [NFA] [Second Attempt] ",
            "index": 11026,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "collateral",
                "signaling",
                "liquidation-system",
                "collateral-onboard",
                "debt-ceiling",
                "liquidations",
                "dc-iam"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#1",
                    "likes": "9",
                    "time": "15/10/2021-04:42:15",
                    "content": " Disclaimer  I’m not particularly familiar with the proper formatting since this is my first Signal Request, but I will try my best! Also, the obvious: None of this is financial advice!     TLDR  Prepare ahead of time for the next leg of this market cycle. Expand access to DAI liquidity and higher leverage. Debt Ceilings should ideally never be hit. Generate more revenue!    Overview This post will echo thoughts I shared earlier today on the governance call. While I don’t know the specific mechanics of what will go on under the hood for these ideas to be implemented (I will leave that for others to discuss), I DO know that these are potentially urgent upgrades we need to get ready ASAP.  The Market Cycle In my opinion, we are entering the final stages of this market cycle. It’s too early to tell how much time is left or how the high prices of everything may go, but that should become clearer over time. My current estimate leaves us about 3-6 months before the cycle top, though it may be as long as 9-15 months. Time will tell. What I am quite certain of, though, is that the market will go parabolic very soon. Of course, it won’t go up in a straight line, but there will be nearly unprecedented volatility as we approach the cycle top.  We need to be ready for this.   Debt Ceiling Issues Hitting the debt ceiling on any collateral type will be catastrophic to our customers and for DAI. It’s even more disastrous when there’s a multi-day governance delay to raise the Debt Ceilings. Sometimes, even waiting for the cool-down on the DC-IAM has negative repercussions for our customers’ strategies.   Proposed Changes Loosely, here is some of what I propose:  Debt Ceilings  Massively Raise Maximum Debt Ceilings (line) across all major collateral types:  ETH-A ETH-B WBTC-A Any others with heavy use.   Increase DC-IAM Target Available Debt (gap) Reduce DC-IAM Ceiling Increase Cooldown (ttl)   Liquidation Penalty  Raise the Liquidation Penalty (chop) to:  20% (A Vaults) 25% (B Vaults)     Exact values can be open to discussion.   New Vault  Introduce WBTC-B Vaults    Concerns | Solutions  DC Raise Some have expressed concern that borrowers can exploit our system during extreme market volatility before a liquidation occurs. Or rather, more generally, that our liquidation system may be put under excessive stress during these periods, putting us at risk of insolvency as DAI becomes under collateralized.  LP Raise (Solution) To address the concerns above, I proposed raising the LP as well. In my opinion, raising the Liquidation Penalty should strongly disincentivize users from allowing their vaults to be liquidated. However, if they do get liquidated, we take a larger cut for the extra risks we’ve taken to keep up with the parabolic market. Ultimately, we should incentivize and push users who wish to take excessively high risks with their vaults towards third-party services that offer liquidation protection, such as DeFi Saver.  DFS automation has an “Emergency Repay” feature.  An ER triggers a massive selloff of a user’s collateral before the next OSM hits (if that OSM would liquidate them). It’s painful for the user, good for us!       WBTC-B Few people seem to like WBTC at all to begin with. It’s not too liquid, has custodial issues, and does anyone even care about Boomer Technology Coin anymore anyway? Well, BTC is still going to go up.  We can grant our degens higher leverage with WBTC-B. We will collect a higher Stability Fee on this vault. Increasing the LP should encourage WBTC-B borrowers to protect their high-risk vaults with automation.   Pros & Cons  Cons  Potentially a lot of overhead to implement on a time crunch. We take on a lot of systemic risk allowing for such a rapid increase in DAI supply.   Pros  Dai supply number go up! Revenue number go up! We accommodate the upcoming parabolic market. We avoid alienating our customer base.  Prolonged periods without access to DAI liquidity leave our users frustrated.   We build upon our reputation by demonstrating to the community that we can adapt to rapidly changing market conditions. We gain more profit from any liquidations that occur (if we raise the LP).   Shall We Crank?      DC-IAM  Yes!  (Crank All DC-IAM Parameters!) Yes, but… (Only Crank Some DC-IAM Parameters) No (Why would you even propose this? ) Abstain     0 voters        Liquidation Penalty  Yes!  (Crank Liquidation Penalty!) No (Why would you even propose this? ) Abstain     0 voters        WBTC-B  Yes!  (Let The Degens Crank BTC!) No (Why would you even propose this? ) Abstain     0 voters      Next Steps Generally, I would like to know how much interest there is in implementing these ideas. No matter how this vote goes, I believe there is much to discuss, but not a lot of time! ",
                    "links": [
                        "https://makerdao.world/en/learn/governance/module-dciam",
                        "https://makerdao.world/en/learn/governance/module-dciam",
                        "https://makerdao.world/en/learn/governance/param-liquidation-penalty",
                        "https://defisaver.com/",
                        "https://forum.makerdao.com/t/wbtc-b-and-wbtc-bprot-a-review-and-plan-of-action/11191",
                        "https://forum.makerdao.com/t/maker-relay-ep-68-en-espanol/11250",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-21st-october-28th/11262",
                        "https://forum.makerdao.com/t/maker-relay-ep-68/11182",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-14th-october-21st/11135",
                        "https://forum.makerdao.com/t/maker-relay-ep-67-en-espanol/11113",
                        "https://forum.makerdao.com/t/maker-relay-ep-67/11076",
                        "https://forum.makerdao.com/t/mid-month-parameter-changes-proposal-ppg-omc-001-2021-10-15/11037"
                    ],
                    "GPT-summary": "The author of the post proposes changes to the Debt Ceilings, DC-IAM, and Liquidation Parameters to prepare for the upcoming parabolic market cycle. The author explains the proposed changes and addresses concerns raised by others. The post includes a poll to gauge interest in implementing the proposed changes and invites further discussion.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.325593543361401
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "2",
                    "time": "15/10/2021-05:18:36",
                    "content": "    aburban90:  Raise the Liquidation Penalty (chop) to:  20% (A Vaults) 25% (B Vaults)    Increasing the liquidation penalty on existing ilks is a no-go imho. Only increasing the liquidation ratio is worse. Let’s not do that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TomDeMichele",
                    "index": "#3",
                    "likes": "2",
                    "time": "15/10/2021-05:56:33",
                    "content": "Won’t comment on every detail, but I generally agree with everything here. All issues that should be addressed, and would love to see WBTC-B option (really personally want this, please).  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#4",
                    "likes": "5",
                    "time": "15/10/2021-06:06:40",
                    "content": " WBTC-B just returned from the archive, there was a SR and an onchain-poll about this - both passed. Cannot really recall what was the outcome of the investigation - do have some faint memories of “let’s wait for some samples from Liq2.0 before going this road”? Totally support this. ETH-B liquidations has been working really nice.  DC-IAM   gap and ttl - I think I was already a bit annoying a couple of times asking for being more liberal on those parameters in the monthly MOMC meetings - so I am happy someone else wants to have them to support hyper growth  But on the other hand we all have been running pretty good with the suggestions from @Risk-Core-Unit - I would like them to weigh in here (not only about gap and ttl but about the whole set of changes in discussion)   line  ETH-A is already having a pretty high line of 15B. Happy to get into an urgent executive for increasing this. No need to touch that. ETH-B: we are at ~33% of the current line - happy to increase that for being prepared ETH-C: imho this could be set to the same value as ETH-A as it feels to me to be the ilk with the fewest risk for the protocol. WBTC-A: there is a running SR on that topic with more concrete options    ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmYsH6ms?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/signal-request-adjust-eth-a-dc-iam-line-2021-05/6688",
                        "https://forum.makerdao.com/t/signal-request-adjust-wbtc-a-dc-iam-line-october-2021/11004"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1154761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "3",
                    "time": "15/10/2021-10:46:20",
                    "content": "    aburban90:  Proposed Changes   We’re lacking specifics on a lot of these @aburban90. Like, if this signal is successful, what are @prose11 and I putting into an on-chain poll?     aburban90:  Cons   Increased severity in the case of oracle timing attack might be worth mentioning here, this is a result of raising the Target Available Debt on vault types. Specifically vaults with lower collateralization ratios (like ETH-B.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.416666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#6",
                    "likes": "0",
                    "time": "15/10/2021-14:00:50",
                    "content": "I may have formatted all of this wrong. Idk But we don’t have weeks…. this is happening now!  DC’s getting gobbled up! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#8",
                    "likes": "0",
                    "time": "15/10/2021-16:58:55",
                    "content": "Early feeler… looks like people here are ready for WBTC-B! That’s great to hear! I think there’s some consensus over cranking the DC-IAM parameters too, which is also great news. This is most important IMO. I’m not sure as to which are best to crank, and by how much, but it’s nice that there is support for this. Looking like raising the LP, no one likes that idea. It was an off-the-cuff “solution” I thought may help push us to encourage vault users to take better precautions with their vaults, but I’m probably totally off on that logic. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#9",
                    "likes": "0",
                    "time": "15/10/2021-17:05:00",
                    "content": "Activate Nitro Boost!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#10",
                    "likes": "5",
                    "time": "16/10/2021-08:09:23",
                    "content": "Few thoughts from our side: Regarding DC-IAM parameters (line, gap, ttl) We had plan to change these parameters on next rates meeting, which would be in 2 week. But as you pointed out, some adjustments were needed more urgently and we moved faster with the proposal so that we can implement changes next week. Regarding Liquidation Penalty: I am on the side where I believe higher liquidation ratios are better for Maker so that we incentivize users to use protection tools that are possible because of the 1h OSM delay. But I am afraid some newly onboarded and less sophisticated users might see the 20% liquidation penalty as very uncompetitive when comparing DeFi lending venues, because the liquidation penalty at Maker is already one of the highest if not the highest in the DeFi space. That being said I’d personally leave it at 13% for the time being. I do though prefer higher liquidation penalties for institutional users which we really want to make sure they use protection tools because of their massive debt exposure that can potentially get liquidated all at once and could have unoptimal outcome in auctions. Regarding WBTC-B: As @ultraschuppi  did some research, we did warn against onboarding low LR vaults in the past, but this was before Liquidations 2.0 implementation. Soon after, vote passed for B Protocol low LR WBTC-B enabled vault but the progress there has been slower than expected. And I think (unless I am mistaken) this vault won’t be enabled very soon because PE and Oracles still need to have a proper look at it and evaluate all the implications. I actually just had a discussion this week with @yaronvel  from B Protocol who wants move forward and maybe he can give us an update. However, keep in mind this vault is meant to have experiential low DC in early stages. Which leaves us at question whether we should simply onboard WBTC-B asap because we can speculate there should be some decent demand for it (we have seen a lot of WBTC debt refinanced from Aave to Maker lately) and later on experiment with B protocol enabled WBTC low LR vault. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3161157024793395
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#11",
                    "likes": "1",
                    "time": "16/10/2021-09:04:14",
                    "content": "    Primoz:  I actually just had a discussion this week with @yaronvel from B Protocol who wants move forward and maybe he can give us an update.   We completed the first iteration of code changes following some notes from the PE team. We plan to put it for a public discussion this week. The design is such that a failure (even due to a smart contract bug) in b.protocol will just revert to the existing liquidation mechanism, so we would argue ti would be beneficial to include it even if there are additional issues that will require changes from our side in the future. I will give more details on Sunday. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.328463203463203
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#12",
                    "likes": "2",
                    "time": "16/10/2021-14:33:06",
                    "content": "I am a no on changing LP for basic users.  13% is already pretty high, 20-25%  come on man! For institutions since they are supposed to be maintaining a high LR I defer to risk.  Honestly what I really want to see is IVs having a sequence of vaults with different LRs so they stagger the liquidation profiles vs. bundling them into one lump. I think this LR clumping in large IV vaults is bad for the system honestly and want to see a mechanic of some kind introduced to spread this out somehow.  The simplest method is to have multiple vaults for IV users and have them split up their collateral between them so the collateral CRs are staggered.  but there may be a better approach. I think we do want to move DCs up but without getting a handle on what CRs are doing here I would want to be judicious in the approach.     Primoz:  We had plan to change these parameters on next rates meeting, which would be in 2 week. But as you pointed out, some adjustments were needed more urgently and we moved faster with the proposal so that we can implement changes next week.   If risk is going to do analysis and suggest multiple changes here and we are moving into a bull then why not look at vault stability fees as well.  I am pretty sure wBTC could be bumped .5%…  If we are going to go whole hog into raising DCs massively to accommodate demand seems prudent to start to move risk premiums closer to where they should be. ",
                    "links": [
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/14"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.970068027210884
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#13",
                    "likes": "0",
                    "time": "16/10/2021-19:00:49",
                    "content": "SF can go up, sure ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chonghe",
                    "index": "#14",
                    "likes": "2",
                    "time": "16/10/2021-23:42:04",
                    "content": "Definitely agree to increase the debt ceiling, we cannot afford to reach the ceiling and people have to wait for hours/days for them to be able to generate DAI. It has happened in the past, it should not happen in the future Do not agree to increase liquidation penalty. Currently at 13% is already the highest among all platforms. Increasing this can push people away from Maker. Penalty should be maintained. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#15",
                    "likes": "2",
                    "time": "28/10/2021-15:38:12",
                    "content": "Wanted to check in on the is Signal @aburban90. I know some DC-IAM changes were added and we’re discussing WBTC-B on the Governance and Risk call today, so might make sense to update the signal after that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#16",
                    "likes": "2",
                    "time": "10/11/2021-15:22:11",
                    "content": "Going to add this to the archive. Feels like everything mentioned here has been covered via other processes, with the exception of wBTC-B, which should be up on-chain soon. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#17",
                    "likes": "0",
                    "time": "11/12/2021-01:23:01",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}