{
    "poll_list": [
        {
            "title": "Decrease the Stablecoin Vault Debt Ceilings - February 22, 2021",
            "index": "6432",
            "option": "No",
            "supporting_mkr": "20,071",
            "highest_fraction": 0.71
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/turn-stablecoins-dc-to-0/6432",
            "title": "Turn stablecoins DC to 0 ",
            "index": 6432,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-rejected"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#1",
                    "likes": "2",
                    "time": "08/02/2021-10:47:17",
                    "content": " Overview Last time we raised the PSM’s DC to 500 MM, now that we are nearly at the 500M limit and the peg is back, it is time to turn the stable coins DC to 0.  Turning the stable coins Debt Ceiling to zero Please vote for all options you would support in an onchain poll     Yes No Only Usdc Just at the debt limit of all stablecoins Abstain     0 voters      Next Steps The Poll will run until February 18th; its outcome will either result in a on-chain-poll assuming the outcome of the poll deems it necessary or its intermediate results are going to be taken to another initiative - another signal (lead by the risk team), onchain-poll or urgency executive. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-increase-psm-dc-and-set-debt-ceiling-for-usdc-a-b-to-0/6692",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-128-thursday-february-11-17-00-utc/6367/2",
                        "https://forum.makerdao.com/t/pax-vault-dc-change/7540/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-31-en-espanol/6455",
                        "https://forum.makerdao.com/t/maker-relay-ep-31/6450",
                        "https://forum.makerdao.com/t/governance-at-a-glance-feb-5-11-2021/6507",
                        "https://forum.makerdao.com/t/maker-relay-ep-33-en-espanol/6729"
                    ],
                    "GPT-summary": "The author of the post is proposing to turn the stable coins DC to 0 and is asking for feedback through an on-chain poll. The post also outlines the next steps and possible outcomes of the poll. A third party could give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "3",
                    "time": "08/02/2021-11:05:02",
                    "content": "Can we have this end on February 18th please? I’d rather give people more than three days to discuss and respond. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#3",
                    "likes": "3",
                    "time": "08/02/2021-13:51:18",
                    "content": "I want a bit more patience. Possibly not strategic patience, just a bit more. Open PSMs for all other stablecoins as well, not only USDC. See that develop, then start raising the stability fees for the stablecoin Vaults to encourage transition. When that is done it is more natural to reduce DC of stablecoins to 0. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.921875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#4",
                    "likes": "1",
                    "time": "08/02/2021-13:57:33",
                    "content": "We have PAX, GUSD and USDC now, but  the PSM only covers USDC at the moment. PAX lately keeps to something like 1.0015PAX -> 1DAI, and it can have bigger swings due to lower liquidity. IMO PAX is a “good” stablecoin, which doesn’t exactly increase our risks due to its lower volume and lower ceiling. I would keep DC !== 0, at least PAX and GUSD until we bring them to the PSM. USDC though, we have already the PSM, and we only want to try that people pays off the debt on the USDC-A vault, I don’t see reason for keeping the debt ceiling greater than 0 for the USDC-A vaults. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.927083333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#5",
                    "likes": "4",
                    "time": "08/02/2021-14:04:18",
                    "content": "I don’t think we will be raising the SF on stablecoin vaults as we already tapped them out last year and should just sweep the coins into the PSM instead. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#6",
                    "likes": "1",
                    "time": "08/02/2021-14:04:53",
                    "content": "Fair point, My idea was to first set them all to zero, then decide the correct amount we want for each of them and use the PSM instead as stable coin vault doesn’t work. But I guess most of the PAX vault are abandoned, especially with the high gas. And by setting them to zero we will see which one is still swimming and which one drown. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.61
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#7",
                    "likes": "0",
                    "time": "08/02/2021-14:06:24",
                    "content": "I believe we just need a flipper with a fix price. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#8",
                    "likes": "1",
                    "time": "08/02/2021-14:15:56",
                    "content": "I don’t think setting to 0 will decrease the amount of each of them. If you look at TUSD after 3 weeks only 10% moved out. I don’t think letting more time before setting the DC to 0 will help to unwind them. At the opposite I think it will sort of let this situation as it and giving a feeling of non-decision which is not good. If vault owners want to exist, it is now and the dai won’t go under 1 before we take action. That the message I think we should pass. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#9",
                    "likes": "0",
                    "time": "10/02/2021-02:07:22",
                    "content": "I voted USDC only and NO.  I’d like to see the vaults swept (USDC in particular) since the mechanic here is the PSM now.   Frankly though I find it an interesting idea to have a form of decentralized USDC that will appear on it’s own if the PEG drops below 1 significantly.   In the loosest sense these vaults can be Maker last bastion of USDC on the books for PEG control.   We also can sweep them at our leisure then. I would prefer to sweep these and have multiple layered PSM tiers with diff DCs and tin/tout settings but barring that it might be a good idea to keep them.  I mean PSM with 500M USDC is actually different than 100M USDC in the PSM and 400M in the USDC vaults as this 400M won’t get accessed unless the PEG does drop dramatically below 1 and the ~100M USDC in PSM is exhausted. Hence I am mixed on what to do here since we probably don’t get anything off the books. How much of these vaults are under the liquidation gun if we were to enforce liquidations?   I feel like we are giving these people a free unexpiring DAI put option and something about me says we should do something about that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7961309523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#10",
                    "likes": "0",
                    "time": "10/02/2021-08:23:25",
                    "content": "Good point the free unexpired dai put is the main problem with the arbitration for free. First, the probably is if we don’t turn off all vaults as there is incentive to use the 0% vault, I am a bit worry that we will see the open vault going up. The option to set the DC to the limit here should actually probably come with the Usdc to 0. One of the issue with the vault is that we actually can’t sweep them at our leisure. Even liq2 will use auction and the results is uncertain. Also I think we should not expect those vaults to get to 0 at all. I would expect in 3 months time we will be at may be 200M or 100M if we are lucky. Also our exposure to Usdc decrease significantly from 60% to 20%, same regarding the percentage of MKR 20%, so I believe we have a bit more room. I agree it is not an ideal but it still better. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.616071428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#11",
                    "likes": "3",
                    "time": "17/02/2021-12:16:23",
                    "content": "I think we should wait and set stablecoin vaults DC to 0 only after we have enough PSM USDC DC buffer available, which should be in about 2 months (assuming 30m DC increase per week and some ongoing utilization). We want to have at least 10-20% of DAI debt in “fast mint capacity” from stablecoins so that we don’t cause DAI liquidity crunch. We saw how one farm could 200m DAI to be pulled of markets in a day alone. And then combine this with prices crashing and vaults deleveraging… Maybe we would want to increase PSM-USDC-A ‘lerp’ to some higher value than 30m per week or just increase DC instantly to 500m or more, so we can safely set DC on USDC-A to 0 and also liquidate it into PSM-USDC-A? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#12",
                    "likes": "1",
                    "time": "17/02/2021-12:59:22",
                    "content": "The PSM hasn’t been ticked for a while now, we will probably be around 200M+ by Monday. I believe the main reason is to avoid free arbitration at 1.01 with the USDC vault or any 0% vault. And starting the long process to unwind the vault instead of increasing it. If the situation is getting that bad with an unknown event, we can eventually increase the USDC vault DC back or increase the PSM as you said. But I doubt that will happen. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.7976190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#13",
                    "likes": "5",
                    "time": "17/02/2021-13:03:00",
                    "content": "It’s maybe worth noting that in a heavy market drop, the demand for DAI will spike, and unless we want to break above peg, we will need a significant amount of room in stablecoin-related vaults (PSM or regular.) The amount of space we’ll need seems likely to increase as the ETH-A debt increases. And the ETH-A debt is increasing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.395833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "3",
                    "time": "25/02/2021-16:54:48",
                    "content": "In the end this signal did not pass it’s on-chain poll. Thanks to all who voted. There is a related poll here by @ultraschuppi that offers a slightly less significant move in this direction, please give it a look if you voted in this one. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-increase-psm-dc-and-set-debt-ceiling-for-usdc-a-b-to-0/6692"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.508333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#15",
                    "likes": "0",
                    "time": "28/03/2021-02:54:49",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "3256"
}