{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip39c3-sp5-desincorporacion-de-la-core-unit-de-finanzas-del-mundo-real-rwf-001-traduccion/18021",
            "title": "MIP39c3-SP5: Desincorporaci\\xc3\\xb3n de la Core Unit de Finanzas del Mundo Real (RWF-001) [Traducci\\xc3\\xb3n] ",
            "index": 18021,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "translate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#1",
                    "likes": "3",
                    "time": "20/09/2022-23:13:44",
                    "content": " MIP39c3-SP5: Desincorporación de la Core Unit de Finanzas del Mundo Real (RWF-001)  Preámbulo MIP39c3-SP#: 5 Autor(es): @rune Colaboradores: @juan, @retro Etiquetas: core unit, RWF-001, cu-offboarding Estado: RFC Fecha de aplicación: 2022-09-07 Fecha de ratificación:  URL del foro: https://forum.makerdao.com/t/mip39c3-spxx-offboarding-the-real-world-finance-core-unit-rwf-001/17753 URL de la encuesta de ratificación:   Sentence Summary Esta subpropuesta se desprende de la Core Unit de Finanzas del Mundo Real (RWF-001).  Especificación  ID de la Core Unit RWF-001  Motivación MakerDAO está reestructurando el trabajo y el personal en toda la DAO de acuerdo con el Endgame Plan. El mandato de la Core Unit de Finanzas del Mundo Real estará mejor alineado dentro de un grupo de una MetaDAO. Como resultado, esta Core Unit debe ser excluida para apoyar la transición.  Continuidad del trabajo de la Core Unit Todas las actividades asociadas con RWF-001 serán apoyadas por SF-001 y la subpropuesta MIP39c2-SP36.  Estatus de Actor Mandatario Al facilitador se le retirará su estatus de actor mandatario.  Golden Parachute  DAI Se proporcionará un pago de Golden Parachute a la Core Unit para el facilitador restante. El importe se basará en el siguiente cálculo:  La compensación para el facilitador no es transparente con los informes actuales, y se utiliza una estimación. Se puede actualizar si @williamr proporciona los datos necesarios.  Estimación de la compensación del facilitador de la Core Unit x 3 = importe del Golden Parachute. 10.000 DAI x 3 meses = 30.000 DAI  MKR Cualquier MKR devengado (devengado o no) en el momento de la ratificación de este MIP será elegible para su pago. Si el Plan de Incentivos MKR tiene un precipicio, se ignorará y permitirá que el importe de MKR se transfiera a la Core Unit.  La estimación del MKR devengado se calcula con los siguientes datos disponibles:  Los datos de las transacciones en cadena de la Cartera Operativa RWF-001 muestran un Pago de Agosto-22 de 80 MKR. El MIP40c3-SP38  aprobado define la media de MKR como 80 MKR / FTE. El Informe de Transparencia RWF-001 muestra que el Facilitador recibe un multiplicador 1x sobre la distribución de MKR promedio anual reportada por la UC. La reciente Solicitud de señal para distribuciones de MKR prorrateadas para la adquisición de derechos de MKR prorrateados transmite que el MKR de agosto-22 es para el facilitador, después de un acantilado de 1 año.    Cálculo del MKR devengado en el momento de la ratificación de la subpropuesta: 2,75 meses * (80 MKR /12 meses) = 18,3 MKR  Ejecución presupuestaria Tras la ratificación de esta propuesta:  Todos los flujos de DssVest de DAI se darán por terminados. Todos los flujos de DssVest de MKR se darán por terminados. Cualquier cantidad de DAI que supere el importe del Golden Parachute en los monederos multisig de la Core Unit se devolverá al protocolo utilizando DssBlow antes de la fecha de la siguiente votación ejecutiva, o el Gobierno retirará los fondos en la votación ejecutiva utilizando el rol de beneficiario MCD_Pause_Proxy en el multisig. Si las cantidades del Golden Parachute son superiores al saldo actual de los monederos multisig de la Core Unit, el siguiente voto ejecutivo distribuirá la diferencia a la Core Unit.   Esta es una traducción libre del topic MIP39c3-SP5: Offboarding the Real-world Finance Core Unit (RWF-001) de @rune Créditos: Traducción @cryptenthusiastic - Revisión @nahueth ",
                    "links": [
                        "https://gnosis-safe.io/app/eth:0xD1505ee500791490DE8642353BA6A5b92e3550F7/transactions/history",
                        "https://forum.makerdao.com/t/mip40c3-sp38-real-world-finance-core-unit-mkr-compensation-rwf-001/10447",
                        "https://github.com/makerdao-rwf001/transparency-reporting/blob/main/monthly-budget-statements/2022-06.md#fte",
                        "https://forum.makerdao.com/t/signal-request-mkr-pro-rata-vesting-community-sentiment-poll/17350",
                        "https://forum.makerdao.com/t/mip39c3-sp5-offboarding-the-real-world-finance-core-unit-rwf-001/17753"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.05
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "2",
                    "time": "21/09/2022-14:50:15",
                    "content": "Little rusty on my Castellano, but isn’t the title here backwards? Something like “eliminación” might be more precise? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "3",
                    "time": "21/09/2022-15:25:22",
                    "content": "Indeed. The title translates to “Incorporation of the Core Unit known as World Finance”  Looks like a good translation for “offboarding” is desvinculación ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#4",
                    "likes": "1",
                    "time": "21/09/2022-15:32:27",
                    "content": "A few other options  gestión de salida de la unidad central eliminacion de la unidad central desprendimiento de la unidad central  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.675000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#5",
                    "likes": "0",
                    "time": "21/09/2022-15:42:57",
                    "content": "    prose11:  eliminación       flipflopflapdelegate:  desvinculación   Nice catch “eliminación/desvinculación” both can be used but “incorporación” changes the meaning of whole title ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#6",
                    "likes": "3",
                    "time": "21/09/2022-20:26:51",
                    "content": "Gracias por avisar el error, ya lo modifiqué  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#7",
                    "likes": "1",
                    "time": "21/09/2022-22:31:21",
                    "content": "Thank you for being attentive  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                }
            ]
        }
    ]
}