{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/why-does-maker-buffer-exist/19567",
            "title": "Why does Maker Buffer exist? ",
            "index": 19567,
            "category": [
                "Core Units",
                "Protocol Engineering"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Akil",
                    "index": "#1",
                    "likes": "0",
                    "time": "27/01/2023-12:49:39",
                    "content": "Hello I am sorry if this is a wrong place to ask this question, and you can direct me to more appropriate place. I am a protocol engineer and researching about DAI. I couldn’t understand 2 related things about DAI and would like to clarify before continuing my research. 1- Why does Maker Buffer even exist? So as far I read and understand, the sole reason there is a Maker Buffer is that if not enough DAI  raised in a liquidation event, Maker buffer is used to cover the remaining value. I think the reason DAI is selected(and not some other stable coin etc.) for the collateral auction is that, in that case protocol debt would just kept increasing the more unsuccessful auction happens. By using DAI for collateral auctions, you get rid of this problem because using DAI for collateral auctions essentially means “minting DAI”. Because all a liquidation event is unlocking the locked collateral without burning the original DAI that this collateral used to mint. Whoever got the collateral can just use it to mint DAI again. So there is 2 or more minting with the same collateral. And if enough DAI is raised, the DAI goes to the Maker buffer directly. Which just means it doesn’t matter enough DAI raised or not, whatever DAI raised all goes to the Maker Buffer. You don’t need to cover deficit in a liquidation event, because you actually just minting DAI to back the already minted DAI. Now, Maker Buffer has a limit and excess DAI burned after the limit through MKR tokens. So what I don’t understand is, if a liquidation event is just minting DAI event and each minted DAI is more liability to the system, why not just burn the whatever DAI raised(minted) instead of keeping a portion of it in a buffer? 2- Why use MKR token to burn/mint DAI to regulate the Maker Buffer? Given that there is a buffer and excess is being burned, Why not just burn DAI itself instead of doing it through MKR token? ",
                    "links": [],
                    "GPT-summary": "The post is a question from a protocol engineer who is researching DAI and wants to clarify the purpose of Maker Buffer and the use of MKR tokens to regulate it. The post does not fit perfectly into any of the listed topics, but it is mainly a question about the proposal and a request for clarification.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.488095238095239
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "0",
                    "time": "27/01/2023-14:46:46",
                    "content": "    Akil:  because using DAI for collateral auctions essentially means “minting DAI”. Because all a liquidation event is unlocking the locked collateral without burning the original DAI that this collateral used to mint.   I think the misunderstanding starts here because when you bid a liquidated collateral using Dai, that Dai is burnt. So in terms of overall supply, that Dai is indeed getting burnt. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akil",
                    "index": "#3",
                    "likes": "0",
                    "time": "28/01/2023-09:34:04",
                    "content": "Hi thanks for the reply, Well, it clearly states here that, Dai proceeds from the Collateral Auction go into the Maker Buffer, which serves as a buffer against an increase of MKR overall supply that could result from future uncovered Collateral Auctions and the accrual of the Dai Savings Rate (discussed in detail below). If Dai proceeds from auctions and Stability Fee payments exceed the Maker Buffer limit (a number set by Maker Governance), they are sold through a Surplus Auction. The way I understand this that DAI collected from auction goes to the Maker Buffer, and it is used to buy MKR tokens(see 2. question) which then burnt if the Maker Buffer limit exceeded. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#4",
                    "likes": "0",
                    "time": "28/01/2023-12:25:27",
                    "content": "no, the maker buffer is not being used to buy MKR tokens. The people here realized its more efficent and profitable to straight up take the money from the Maker buffer so they can buy stuff for themselfs. So there is no burn. The buffer is paying for cars realestate playstations burgers holidays Iphones etc. Its NOT to burn any MKR, this idea was abandoned long ago. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#5",
                    "likes": "0",
                    "time": "28/01/2023-13:29:01",
                    "content": "In the same document it says “The Dai received from the Collateral Auction is used to cover the Vault’s outstanding obligations, including payment of the Liquidation Penalty fee set by MKR voters for that specific Vault collateral type.” And what it means by covering the Vault’s outstanding obligations is it will burn such minted Dai. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#6",
                    "likes": "0",
                    "time": "28/01/2023-13:33:58",
                    "content": "    Ber10:  The buffer is paying for cars realestate playstations burgers holidays Iphones etc.   While we believe in fiscal responsibility and there’s definitely room for both stronger transparency and accountability, I think it’s misleading to think that whole DAO is just here to exploit treasury for DAO contributers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akil",
                    "index": "#7",
                    "likes": "0",
                    "time": "30/01/2023-08:08:05",
                    "content": "oh ok. So, Collateral Auction —> enough DAI → DAI is burnt. Collateral Auction —> not enough DAI → deficit covered by Maker Buffer → DAI is burnt. Collateral Auction → Fees —> Maker Buffer. Maker Buffer —> Limit Exceeds —> surplus is burnt. Maker Buffer —> empty → DAI is minted. For the last 2 Maker Buffer lines, I can’t understand whether @Ber10 is joking or not, minting/burning is still done still through MKR tokens or directly DAI? This also goes into my second question as well. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#8",
                    "likes": "0",
                    "time": "30/01/2023-11:40:34",
                    "content": "    Akil:  Maker Buffer —> Limit Exceeds —> surplus is burnt.   Surplus that exceed the limit is used to buy MKR and burn.     Akil:  Maker Buffer —> empty → DAI is minted.   In case if the buffer doesn’t have enough Dai to cover, MKR is minted and auctioned off to refill it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#9",
                    "likes": "0",
                    "time": "30/01/2023-11:42:40",
                    "content": "    Akil:  joking or not   His comment is regarding the Maker protocol setting the Limit very high that in practice, the burn is not likely to happen soon. But realistically restarting the burn by lowering the limit or using portion of the surplus buffer to burn have been suggested. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5200000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akil",
                    "index": "#10",
                    "likes": "0",
                    "time": "30/01/2023-17:56:47",
                    "content": "Ok thanks. But my 2. question still stands. Why not burn the surplus DAI directly and mint DAI when it is empty instead of burning/minting MKR? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#11",
                    "likes": "0",
                    "time": "30/01/2023-19:00:27",
                    "content": "If you are minting Dai when it’s empty then Dai is no longer fully collateralized. As Dai is over collateralized stablecoin unlike already failed Terra and many others, if the protocol did that, that wouldn’t be stable ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#12",
                    "likes": "0",
                    "time": "30/01/2023-19:05:27",
                    "content": "    Akil:  Why not burn the surplus DAI directly   This will only act to reduce the supply of Dai in thr market and actually pressure the peg upward (remember, each Dai is collateralized) . In addition, it’s part of tokenomics that MKR holders govern the protocol and there can be rewards such as burns. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#13",
                    "likes": "0",
                    "time": "31/01/2023-15:38:28",
                    "content": "Not the whole Dao I bet there is plenty of people that create value. But I cant for the life of me understand where the money is going. Definitely doesnt do anything for DAI supply or marketshare or MKR price. Any metric that counts. There should be one team just concerned with assessing the other teams and see if they are even worth the money and if not fire them. I dont think what we do here is effective in any way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.9750000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#14",
                    "likes": "0",
                    "time": "31/01/2023-15:50:50",
                    "content": "    Ber10:  There should be one team just concerned with assessing the other teams and see if they are even worth the money and if not fire them. I dont think what we do here is effective in any way.   There was a proposal (actually passed) that seek to have OKR and various metrics, but it was not an easy topic as various core units are different as well as their impact to the protocol. Sure, some are technical but some are non technical ones that are crucial for the protocol (or so many can argue). The “compromise” the protocol has right now is at least the community has SF CU and also dashboard to track as much as possible where the expense is going and also sentiment in the Maker governance to vote against large budget increases. Of course, it’s not perfect but it’s an evolving DAO afterall ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.530092592592593
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#15",
                    "likes": "1",
                    "time": "31/01/2023-15:52:24",
                    "content": "    Ber10:  There should be one team just concerned with assessing the other teams and see if they are even worth the money and if not fire them. I dont think what we do here is effective in any way.   I don’t fully disagree with you. One problem is that any oversight powers you give can be a centralization risk. I think a better solution would be to have a unit tasked with oversight that reports regularly and publicly to token holders, that can then choose to act or not act on the provided information. I can’t help you with many of the units, but for what it’s worth, GovAlpha’s expenses are all transparent. There is also an expenses dashboard that is attempting to mitigate the problem. You have to click through a bit to find expense reports, but they are there. I believe strategic finance and SES are attempting to unify the accounting and reporting practices that are used by each core unit. Standardization is a step in the right direction, I believe. To come back to your question of where the money is going, there is a breakdown by-core-unit here on makerburn, but there’s no internal breakdown on spending there. At the least it can give you an idea of how much money goes where in terms of core units. ",
                    "links": [
                        "https://expenses.makerdao.network/",
                        "https://makerburn.com/#/expenses/core-units"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8695054945054945
                }
            ]
        }
    ]
}