{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/vote-mobilization-vox-module/4751",
            "title": "VOTE MOBILIZATION - Vox module ",
            "index": 4751,
            "category": [
                "Governance"
            ],
            "tags": [
                "governance-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#1",
                    "likes": "5",
                    "time": "15/10/2020-07:04:08",
                    "content": "COMMUNITY WAKE UP CALL There is currently a hugely important vote ongoing in the onchain polls - the possible inclusion of the Vox module that will allow for negative interest rates. This is a really important vote with a large potential impact and possible unforeseen consequences. Currently less than 20 people have voted (!). No matter what you think about negative interest rates, this topic really needs your attention. The topic is much too important to just slip under the radar. There currently about 9 hours left so please make your MKR matter. ",
                    "links": [],
                    "GPT-summary": "The author of the post is asking for feedback on the Vox module proposal, which would allow for negative interest rates. They are also advertising the proposal and urging people to vote, as currently only a small number of people have voted. The post also suggests that the topic is important and requires attention.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.349206349206349
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "14/01/2021-13:04:08",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}