{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/resumen-del-mes-de-la-core-unit-de-riesgos-octubre-de-2022-traduccion/18654",
            "title": "Resumen del mes de la Core Unit de Riesgos: Octubre de 2022 [Traducci\\xc3\\xb3n] ",
            "index": 18654,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "translate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#1",
                    "likes": "6",
                    "time": "02/11/2022-19:52:23",
                    "content": "Este post resume las tareas, el trabajo, y las actividades de la @Risk-Core-Unit durante el mes de octubre. A continuación se describe el enfoque principal de este mes.  Incorporación de garantías y otros análisis  Incorporación de garantías  Encuesta de ratificación para el conjunto de MIP de pre-lanzamiento de Endgame - Octubre 10, 2022 MIP39c2-SP35: Modificación del mandato de la Core Unit de Riesgos - RISK-001 (Última versión de la propuesta)  RISK-001 renovado Mandate Diffchecker  El 24 de octubre de 2022 se aprobó la encuesta de ratificación del conjunto de MIP del prelanzamiento de Endgame. Como resultado, las enmiendas MIP39c2-SP35: Modificación del mandato de la Core Unit de riesgo - RISK-001 también fueron aceptadas por los titulares de MKR. El Mandato actualizado de la Unidad Central de Riesgos hace que el Facilitador de la Unidad Central de Riesgos pueda proponer unilateralmente, y sin ningún proceso adicional, encuestas semanales no estándar y votaciones ejecutivas relacionadas con: (i) Gestión de garantías descentralizadas y RWA, (ii) Cambios en los parámetros de riesgo para las garantías descentralizadas y RWA, (iii) Otros parámetros de riesgo en el Protocolo Maker, (iv) Incorporación de garantías descentralizadas y RWA, (v) Incorporación de garantías descentralizadas y RWA, y (vi) Otras votaciones y acciones de gobierno relacionadas con el riesgo, las garantías Dai y los parámetros de riesgo. La diferencia completa entre el mandato anterior y el actualizado está disponible aquí. La Core Unit de Riesgos está actualmente en proceso de:  Junto con otros gestores de garantías en cadena (CMON), seguir definiendo los procesos de incorporación, exclusión y gestión de las garantías, después del conjunto de MIP de prelanzamiento de Endgame. Debatir la posibilidad y la utilidad de una posible formación de un comité de incorporación de garantías con miembros de otras core units.  Más información sobre la incorporación de garantías, la gestión de garantías, la exclusión de garantías y la formación de un comité de incorporación de garantías, a su debido tiempo.  Trabajos pendientes de la garantía  Índice de Estado de las Garantías  Actualmente hay tres tipos de garantías en fase de implementación en la vista prefiltrada de CSI CMON: (i) rETH, (ii) D3M Compound y (iii) GNO. Hay un tipo de garantía en la fase “Greenlit”: Financiación respaldada. Hay un tipo de garantía en la fase de “Solicitud”: Goldfinch. rETH: La votación Ejecutiva incluyendo el rETH Technical Onboarding [aprobado].(Maker Governance - Proposal rETH Technical Onboarding, Enable Starknet DAI Bridge Fees - October 26, 2022) el 28 de octubre, y se ejecutó el 31 de octubre. El límite máximo de endeudamiento inicial (línea) se fija en 0. Los restantes parámetros de riesgo reflejarán el resultado satisfactorio de los anteriores sondeos de gobernanza del rETH (1, 2), que fueron recomendados por la Core Unit de Riesgos en el original y actualizado rETH Evaluaciones de riesgo de incorporación de garantías. Compound D3M: La auditoría relacionada con la aplicación técnica de Compound D3M ya ha concluido. Como resultado, el MOMC  ha propuesto activar el Compound D3M con hasta 160 millones de techo de deuda, 10 millones de brecha, 12h ttl, y 2% de barra. GNO: La Core Unit de Crecimiento, Core Unit de Riesgo, y Gnosis están ultimando el acuerdo para implantar una vault GNO. La Core Unit de Riesgos está trabajando actualmente en la evaluación de riesgos de la incorporación de garantías GNO. La hoja de cálculo CSI and the latest CSI Update (October 27, 2022) proporciona más información sobre los activos a los que dan prioridad y en los que trabajan las partes interesadas de CMON.  Investigación de usuarios de Vault  Análisis del impacto de los parámetros de Maker (October 17, 2022) Investigación de usuarios de Vault: Migración de la exposición dentro del protocolo (Octubre 20, 2022)  Un Análisis del impacto de los parámetros de Maker, en el que se analizan los efectos de la reducción de la tasa de estabilidad de stETH-B al 0%, fue publicado en la página de Block Analitica’s Medium page en Octubre (publicado anteriormente en el foro Maker en septiembre). Siguiendo con el mismo tema, un informe de investigación de los usuarios de Vault sobre Migración de la exposición dentro del protocolo se publicó en el foro Maker en octubre. El análisis profundiza en la migración de la exposición a las vaults mediante una visión más general y de alto nivel.  Tablero de riesgos de Maker Actualizaciones clave del Tablero de riesgos de Maker  incluye:  El código es de código abierto (tanto la interfaz de usuario como el backend) y se transfieren los derechos de autor a la Fundación DAI.  UI:    GitHub    GitHub - blockanalitica/maker-ui: Maker risk dashboard Maker risk dashboard. Contribute to blockanalitica/maker-ui development by creating an account on GitHub.      Backend:    GitHub    GitHub - blockanalitica/maker-api Contribute to blockanalitica/maker-api development by creating an account on GitHub.       Se ha añadido un registro de cambios para obtener información más transparente y accesible sobre las actualizaciones del Panel de Riesgos de Maker:   1600×766 138 KB   Mejora de las Páginas PSM  (ver el registro de cambios para más información):   1318×1220 93.9 KB   Vista de monedero que muestra todos los monederos relacionados con un determinado monedero (captura de pantalla de ejemplo ):   1600×808 148 KB   Identificadas todas las vaults de la Estrategia Yearn:   1600×827 143 KB   Comité de Mercado Abierto de MakerDAO  Modificar las orientaciones de D3M para MOMC Las encuestas en la cadena (1, 2) relacionados con la modificación del D3M concluyó en Octubre. La opción ganadora fue “Sí” para eliminar el rendimiento de la oferta de ETH y los incentivos de liquidez de los cálculos al sugerir la tasa de préstamo objetivo (bar).  934×269 7.64 KB  En la encuesta de seguimiento de la aprobación, ganó la opción 1 (margen objetivo para el tipo de préstamo objetivo (bar) de D3M del 0,5%).  941×304 9.28 KB  El MOMC utilizará esta información a la hora de decidir las futuras recomendaciones sobre los parámetros del D3M.  Propuesta de cambios en los parámetros  Propuesta de cambios en los parámetros - PPG-OMC-001 - 28 Octubre 2022 (Octubre 28, 2022)  Dos miembros de la Core Unit de Riesgos, @Primoz y @monet-supply forman parte del MOMC . Los cambios propuestos este mes incluyen:  Activar Compound V2 D3M: Hasta 160 millones de techo de deuda, 10 millones de brecha, 12h ttl, y 2% de barra MANA-A: Reducir el techo de la deuda a 10 millones, aumentar la tasa de estabilidad al 7,5%. YFI-A: Mantener los parámetros actuales  Los cambios propuestos están actualmente disponibles para la votación en cadena. La encuesta de gobernanza estará activa hasta el 3 de noviembre de 2022.  Compromisos comunitarios en el Foro Maker Los debates y las respuestas pertinentes de la Core Unit de Riesgos correspondientes al mes de octubre están disponibles a continuación. También están documentados en el Archivo del Foro de la Core Unit de Riesgos.  ¿Cómo aguanta Dai su Peg? - respuesta de Twigmaester (Octubre 2, 2022) ¿Cómo aguanta Dai su Peg? - respuesta de (Octubre 4, 2022) Core Unit de Riesgo resumen del mes: Septiembre 2022 - respuesta de Sean (Octubre 5, 2022) [Signal Request] Desincorporacion YFI - respuesta de rema (Octubre 11, 2022) [Signal Request] Borrar la deuda de las Vaults en el protocolo MakerDAO - respuesta de monet-supply (Octubre 21, 2022) Immunefi Actualización de la CU de seguridad para septiembre - respuesta de commanderkeen (Octubre 22, 2022) Análisis de impacto: Rebaja de la tasa de estabilidad stETH-B al 0%. - respuesta de josolnik (Octubre 24, 2022)   Trabajos pendientes  Identificar, discutir y definir las condiciones financieras de la operación de la vault GNO Evaluación del riesgo del GNO Modelo ML para la puntuación de la protección de la vault Seguimiento de la migración de vault Investigación de usuarios de Vault: Análisis de retención  Este es el decimoquinto resumen mensual publicado por la Core Unit de Riesgos. Para leer el resumen del mes pasado, pulse aquí. Seguiremos actualizando a la comunidad mensualmente en lo sucesivo. Agradecemos cualquier pregunta, petición específica o sugerencia sobre estas actualizaciones. Por favor, añada cualquier comentario a continuación o póngase en contacto directamente con los miembros del @Risk-Core-Unit. Para leer más sobre el trabajo y el compromiso anteriores de la Core Unit de Riesgos, visite nuestro archivo del foro, donde documentamos todos los temas y debates relevantes en los que participa la Core Unit de Riesgos en el Foro de Gobernanza de Maker.  Esta es una traducción libre del topic Risk Core Unit Month in Review: October 2022 de @Sean Créditos: Traducción @cryptenthusiastic ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP39c2SP35",
                        "https://www.diffchecker.com/JweHb2j0",
                        "https://forum.makerdao.com/t/mip39c2-sp35-modifying-risk-core-unit-mandate-risk-001/17749/2",
                        "https://www.diffchecker.com/JweHb2j0",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672&fvid=1149713581",
                        "https://vote.makerdao.com/executive/template-executive-vote-reth-technical-onboarding-enable-starknet-dai-bridge-fees-october-26-2022#proposal-detail",
                        "https://vote.makerdao.com/polling/QmfMswF2#poll-detail",
                        "https://vote.makerdao.com/polling/QmS7dBuQ#poll-detail",
                        "https://forum.makerdao.com/t/reth-collateral-onboarding-risk-evaluation/15286",
                        "https://forum.makerdao.com/t/reth-collateral-onboarding-risk-evaluation-update/18071",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672&fvid=1149713581",
                        "https://forum.makerdao.com/t/collateral-status-index-csi-update-2022-10-27/18548",
                        "https://medium.com/block-analitica/maker-parameter-impact-analysis-bdd81080a0df",
                        "https://forum.makerdao.com/t/vault-user-research-intra-protocol-exposure-migration/18447",
                        "https://forum.makerdao.com/t/impact-analysis-lowering-steth-b-stability-fee-to-0/18122",
                        "https://medium.com/block-analitica/maker-parameter-impact-analysis-bdd81080a0df",
                        "https://forum.makerdao.com/t/vault-user-research-intra-protocol-exposure-migration/18447",
                        "https://maker.blockanalitica.com/",
                        "https://github.com/blockanalitica/maker-ui",
                        "https://github.com/blockanalitica/maker-ui",
                        "https://github.com/blockanalitica/maker-api",
                        "https://github.com/blockanalitica/maker-api",
                        "https://maker.blockanalitica.com/changelog/",
                        "https://maker.blockanalitica.com/psms/",
                        "https://maker.blockanalitica.com/wallets/yearn-strategies/",
                        "https://maker.blockanalitica.com/wallets/yearn-strategies/",
                        "https://vote.makerdao.com/polling/QmSvCFpP",
                        "https://vote.makerdao.com/polling/QmbbdsRR",
                        "https://forum.makerdao.com/t/signal-request-modify-d3m-guidance-for-momc/18069/7",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-28-october-2022/18564",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355",
                        "https://vote.makerdao.com/polling/QmahDuNx#vote-breakdown",
                        "https://maker.blockanalitica.com/forum-archive/",
                        "https://forum.makerdao.com/t/how-is-dai-holding-its-peg/18160/6",
                        "https://forum.makerdao.com/t/how-is-dai-holding-its-peg/18160/10",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-september-2022/18239/3",
                        "https://forum.makerdao.com/t/signal-request-offboarding-yfi/18301/13",
                        "https://forum.makerdao.com/t/signal-request-clear-vaults-bad-debt-in-the-makerdao-protocol/18376/10",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-september/18170/3",
                        "https://forum.makerdao.com/t/impact-analysis-lowering-steth-b-stability-fee-to-0/18122/3",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-september-2022/18239",
                        "https://maker.blockanalitica.com/forum-archive/",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-october-2022/18615"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.680555555555555
                }
            ]
        }
    ]
}