{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/modeling-dai-maturity-modelado-de-madurez-de-dai-traduccion/16227",
            "title": "Modeling DAI maturity | Modelado de madurez de DAI [Traducci\\xc3\\xb3n] ",
            "index": 16227,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "core-unit",
                "strategic-finance",
                "translate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#1",
                    "likes": "12",
                    "time": "29/06/2022-23:37:30",
                    "content": " Resumen  Este documento modela el vencimiendo del DAI para complementar el  ALM Framework; Comenzamos analizando las metodologías de TradFi; Nos decantamos por un modelo simple que utiliza el peor de los casos históricos para dos categorías de tenencias de DAI: especulativa (DAI en contratos inteligentes) y orgánica (DAI en direcciones EOA); Este modelo muestra que:  50% de DAI es estable (vencimiento > 1 año). El vencimiento a corto plazo es más alto de lo esperado inicialmente, al menos 20% (intradía) y 40% (dentro de 1 semana).   El hecho de que el 20-40% del DAI circulante tenga un riesgo de vencimiento corto está reduciendo significativamente nuestra capacidad de inversión. Necesitamos explorar:  Desinvertir programáticamente en los D3M del mercado monetario cuando la liquidez es baja. Ganar con los activos de PSM. Tener algunos activos transferibles, la capacidad de generar liquidez a partir de activos (es decir, pedir prestado USDC de Aave usando ETH como garantía).     Introducción Como se discutió en el ALM Framework, sobre la liquidez, la capacidad de mantener el PEG de DAI, es una restricción clave que tenemos en la asignación del balance. No podemos bloquear los activos durante un período prolongado de tiempo y quedarnos atrapados por no tener liquidez para sostener las salidas de DAI. Actualmente, tenemos una posición con mucha liquidez con un PSM desbordado. Sin embargo, a medida que comencemos a asignar más de nuestro balance general, esto evolucionará. Necesitamos entender el perfil de salida de DAI (perfil de vencimiento de liquidez de DAI). Si bien proporcionamos un perfil de vencimiento de liquidez de ALM para DAI (ilustrado a continuación), solo fue un marcador de posición. Dado que nuestras reservas de PSM han disminuido últimamente y que pronto estaremos listos para implementar nuestro balance en instrumentos con vencimiento fuera del bloque (como bonos a corto plazo, RWA), ha llegado el momento de ser más precisos.  2190×1135 80.6 KB  En este documento, comenzaremos explicando cómo se definiría el perfil de liquidez de DAI en TradFi, luego propondremos una metodología on-chain para DAI.  ¿Cómo modelaría TradFi el vencimiento del pasivo DAI? En TradFi, el instrumento más cercano a una moneda estable es un depósito bancario. En Bank Asset and Liability Management Strategy, Trading, Analysis (publicado en 2007), Moraad Choudry sugiere cuatro métodos para modelar depósitos bancarios (copiado):  agrupar todos los saldos pendientes en una categoría de vencimiento con fecha futura acorde al plazo preferido por el banco, o una fecha posterior. Esto los excluiría del balance de la brecha. Aunque se considera poco realista porque excluye los saldos de las cuentas corrientes del balance de la deuda, es un enfoque bastante común; confiar en una tasa de amortización estimada para los saldos, digamos 5% o 10% cada año; dividir los depósitos en saldos estables e inestables, de los cuales los depósitos básicos se establecen como saldo permanente. El monto del saldo principal lo establece el banco en función de un estudio del patrón de volatilidad del saldo total a lo largo del tiempo. El exceso sobre el saldo básico se considera entonces como deuda a muy corto plazo. Este método se acerca razonablemente a la realidad ya que se basa en observaciones históricas; hacer proyecciones con base en variables observables que se correlacionen con los saldos de depósitos vigentes. Por ejemplo, dichas variables podrían basarse en el nivel de crecimiento económico más un factor de error fundamentado en las fluctuaciones a corto plazo del patrón de crecimiento.  En estos casos, el #1 no tiene mucho sentido. #2 es bastante arbitrario y demasiado simplista. #3 está cerca de lo que usaremos más adelante (pero seremos más precisos en los vencimientos). # 4 no es aplicable al rendimiento de las criptomonedas ya que el ámbito es demasiado reciente. Basel III también proporciona un enfoque de liquidez cercano al #3 con el LCR (que es un indicador de liquidez de 30 días). Se basa en la identidad del depositante que generalmente no tenemos en DeFi (un contraejemplo, serían los bonos del Tesoro DAO, como OlympusDAO, pero aún no representa una gran cantidad). A continuación se puede ver la clasificación de algunos depósitos y la correspondiente ponderación del LCR (ratio de los depósitos que podrían ser redimidos dentro de un mes).  934×577 75.6 KB   Modelado de madurez de DAI propuesto  ¿Qué sería lo mejor? Como se observa en la literatura de ALM y hablando con profesionales en dicha área, la mejor práctica sería modelar el comportamiento del cliente utilizando datos de comportamiento on-chain informados por factores macroeconómicos (mercados alcistas/bajistas, tasas de interés, …). Si bien este es ciertamente el objetivo final, optar por un modelo de este tipo sería muy costoso y poco confiable en esta etapa. En primer lugar, no tenemos una distinción para los clientes de DAI. Cada cliente podría tener muchas direcciones y aunque probablemente podríamos desarrollar algunas heurísticas para agruparlas, no sería algo totalmente preciso. Además, al ser DAI componible, los clientes pueden enviar DAI a otros productos, sin dejar de ser el propietario final de DAI. Un ejemplo es Aave, cuando un cliente deposita DAI en Aave, el DAI se mueve de la dirección de la billetera del cliente a la dirección de Aave y se mezcla con todos los demás depositantes. Si bien es posible descifrar eso, la cantidad de trabajo necesaria sería extrema, ya que tendríamos que administrar todos (o la mayoría) de los protocolos DeFi existentes. Si eso no fuera suficiente, la situación se vuelve más compleja en un mundo L2/multicadena. En segundo lugar, DeFi es bastante joven y el comportamiento de los clientes de 2021 podría no proporcionar mucho aprendizaje sobre el comportamiento de los clientes en 2023. Construir un modelo elaborado sobre el comportamiento pasado no predictivo, solo nos daría una confianza equivocada. Por esas razones, tiene sentido comenzar con un modelo más simple, más fácil de entender y más replicable por la comunidad.  Intuición de una caída del mercado Durante el desplome de las criptomonedas de mayo de 2022, la mayor parte de la reducción de tenencia de DAI se debió a las posiciones de contratos inteligentes, mientras que la métrica EOA (Direcciones de propiedad externa) se mantuvo constante (en púrpura en el cuadro a continuación). Se pueden encontrar más detalles en el informe de liquidez de ALM de mayo de 2022.  809×486 29.8 KB  Si bien es difícil saber quién es el propietario final de DAI, es bastante fácil etiquetar las direcciones donde se encuentran algunos DAI. Algunas son plataformas de préstamo, otras son intercambios descentralizados, … Se aplica la Ley de Pareto, lo que significa que etiquetar algunas direcciones permite cubrir la mayor parte del valor de DAI en circulación. Por lo tanto, la idea es crear bloques de direcciones en cadena y luego generar el peor escenario de salida basado en datos históricos.  El modelo Dividimos todas las direcciones que poseen DAI en dos grupos:  Orgánica: contiene todas las Direcciones de Propiedad Externa, consideraremos que, para ellas, mantener DAI es una decisión anticipada que debe permanecer constante. Especulativo: todos los contratos inteligentes y el DSR.  A continuación, para cada uno de estos grupos, calcularemos la reducción máxima durante los períodos de 1 día, 1 semana, 1 mes y 3 meses. La disposición máxima del período de 1 día se asignará en un 50% al vencimiento de 1 bloque y al vencer 1 día. Luego, para cada grupo de vencimiento posterior, utilizamos la reducción máxima, deducida de los números de vencimiento más cortos. Vamos a explicar con datos reales. Encontramos los siguientes números para la reducción máxima. Para el DAI especulativo, la reducción máxima de 1 día es del 24%, mientras que la reducción máxima de 1 semana es del 48%. Esto no significa que el retiro haya comenzado el mismo día para ambos, ni que dicho retiro de 1 día esté incluido dentro de la operación de 1 semana.  765×110 12.4 KB  Esto condujo al siguiente perfil de vencimiento de liquidez para DAI. En el caso de DAI especulativo, la reducción máxima de 1 día se divide en partes iguales entre el perfil de vencimiento de 1 bloque y el de 1 día. Luego, el perfil de vencimiento de 1 semana es del 48 % (reducción máxima de 1 semana), en el que eliminamos las disposiciones de vencimientos más cortas (la reducción del 24 % de 1 día), lo que nos da un 23 % (diferencia debido al redondeo).  905×122 15 KB  Como se puede ver, el DAI especulativo tiende a tener un vencimiento más corto con un 48% que sale del sistema luego de una semana. Por otro lado, el DAI orgánico tiende a ser más estable. Tener una combinación de DAI sesgada hacia DAI orgánico nos permitirá asumir un mayor riesgo de vencimiento en el lado de los activos.  Simulación sobre datos pasados Al utilizar estas cifras para extrapolar las posiciones pasadas (15 de febrero de 2022 y 12 de mayo de 2022), encontramos los siguientes resultados. Para el 15 de febrero, las salidas esperadas son bastante significativas, con un 38% a 1 semana y un 48% a 3 meses. La mayor parte se debe al DAI especulativo.  1823×1043 71.9 KB  Para el 12 de mayo, es decir, después de una salida significativa de DAI y el colapso de Terra, la cantidad de DAI en circulación se redujo de 10B a 6B (-40%). Además, el perfil de liquidez fue bastante diferente con solo un 30% (frente al 38%) en la semana posterior y del 37% (frente al 48%) en los siguientes 3 meses. Dado que se eliminó una buena parte del DAI especulativo, el resto se inclinó más hacia el DAI orgánico.  1808×1004 72.8 KB  Al ejecutar el modelo en toda la historia (desde julio de 2020 y el verano de DeFi), podemos ver que el vencimiento de los DAI (según el modelo propuesto) se acorta cuando el mercado es alcista (verano de DeFi). Sin embargo, siempre hubo > 50% de DAI con un vencimiento superior a 3 meses. Puedes consultar el contenido aquí en Dune.  1549×776 82.5 KB   Aprendizajes Utilizando este modelo, podemos ver que el 50% de los DAI pendientes de pago tienen un vencimiento “largo” (más de 3 meses). Esto se encuentra en concordancia con la suposición anterior de que siempre deberíamos mantener un 50% de préstamos fácilmente revocables (que incluyen total o parcialmente préstamos respaldados en criptomonedas, dependiendo de nuestra opinión sobre la relación con el prestatario). Un hallazgo es que el frente a corto plazo del vencimiento de DAI es bastante volátil con más del 20%, un vencimiento inferior a un día y hasta un 40% a más de 1 semana. Hasta ahora, nuestras únicas formas de gestionar esas posibles fluctuaciones era mantener un sólido colchón en los PSM. Esto no es muy eficiente actualmente. Hay muchas posibilidades de mejorar este problema. En primer lugar, podemos automatizar la retirada de los mercados monetarios D3M cuando la liquidez sea baja. Esto aumentará la tasa de préstamo de DAI y creará un arbitraje de USDC a DAI (llenando el PSM). En segundo lugar, si planeamos mantener ETH (u otros criptoactivos importantes) en el futuro, esos activos podrían utilizarse para obtener liquidez en los mercados monetarios. En tercer lugar, podemos encontrar formas de generar rendimiento a partir de los activos del PSM. En cuarto lugar, las asociaciones con otros emisores de monedas estables podrían ayudar en el frente de la liquidez proporcionando líneas de crédito bilaterales (véase ClearingDAO). Finalmente, esperamos que los Bonos del Tesoro tokenizados se conviertan en una realidad pronto, ya que proporcionarán una fuente de liquidez en la cadena (préstamo o venta directa).  Limitaciones conocidas Todos los modelos son erróneos, pero algunos son útiles. En esta sección describiremos las limitaciones conocidas del modelo que la comunidad debe considerar.  El modelo no tiene en cuenta el DAI circular. Por ejemplo, la vault DAI-USDC LP es una posición altamente apalancada en la que se acuña DAI pero la mitad se pone simplemente como garantía en la vault. Cerca de la mitad de esos préstamos respaldados por LP no corren riesgo de salida, ya que la reversión anularía el impacto. Este es/era el caso en el pasado, cuando la mayoría de los préstamos se utilizaban para producir granjas. El prestatario tiene un préstamo DAI pero a la vez  se queda con el activo DAI. El reembolso de esos DAI se hará mediante la devolución del préstamo. Un modelo futuro debería utilizar el DAI neto pendiente (DAI menos DAI prestado por la misma cuenta). No modelarlo es añadir una precaución extra. No todos los DAI bloqueados en los contratos inteligentes son iguales. El riesgo de salida es más pronunciado en los esquemas de inyección de liquidez donde al final se anula la asignación. Si el DAI está en un LP de ETH-DAI, entonces el flujo de salida será condicionado a una fuerte disminución del precio de ETH. Las billeteras inteligentes (incluyendo las multifirmas) son consideradas como contratos inteligentes pero podrían estar comportándose como EOA. Gnosis Safes tiene actualmente 240M DAI, por lo que el impacto es bastante limitado. Una salida de DAI especulativo podría ser una entrada de DAI orgánico. Esto no es aparentemente una gran preocupación aquí, pero esto generaría más errores al añadir la subdivisión de las categorías. El modelo asume un contexto de negocios como de costumbre, incluyendo algunas caídas graves del mercado. No hay una historia de fuerte desafío al DAI que deba ser modelada.   Conclusión En este documento hemos propuesto una metodología de perfil de madurez del DAI que es transparente y sencilla de reproducir. Necesitamos mantener al menos el 50% del DAI en circulación en activos de vencimiento a mediano plazo (que no se puedan liquidar en el plazo de un año), el 40% que se puedan liquidar en el plazo de una semana y el 20% que se puedan liquidar en el plazo de un día. P.D: El modelo se basa en datos históricos “amables”, por lo que deberíamos verlo como un escenario común (incluyendo el habitual auge/caída de las criptomonedas). También debemos pensar en un escenario de emergencia, en el que necesitemos liquidar nuestro activo pero asumiendo una pérdida. Esta es una traducción libre del post “Modeling DAI maturity” de @SebVentures Créditos: Traducción @FuchoCrypto - Revisión @Gonzalo_Napolitano ",
                    "links": [
                        "https://forum.makerdao.com/t/alm-framework-for-makerdao/12994",
                        "https://etherscan.io/address/0x31f8cc382c9898b273eff4e0b7626a6987c846e8",
                        "https://dune.com/queries/907852",
                        "https://forum.makerdao.com/t/modeling-dai-maturity/15961"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.979166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#2",
                    "likes": "5",
                    "time": "30/06/2022-00:30:03",
                    "content": "Super interesante. Mucha data para analizar. Gran laburo con la traducción y revisión @FuchoCrypto y @Gonzalo_Napolitano ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#3",
                    "likes": "1",
                    "time": "30/06/2022-01:34:06",
                    "content": "Es un muy buen tema! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#4",
                    "likes": "2",
                    "time": "30/06/2022-01:35:11",
                    "content": "Gran trabajo @FuchoCrypto  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#5",
                    "likes": "4",
                    "time": "30/06/2022-01:38:05",
                    "content": "Gracias @Leandro, así es. Bastante data para analizar y aprender. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#6",
                    "likes": "4",
                    "time": "30/06/2022-01:39:18",
                    "content": "Igualmente @Gonzalo_Napolitano, gran trabajo  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#7",
                    "likes": "4",
                    "time": "03/07/2022-13:25:14",
                    "content": "    FuchoCrypto:  Necesitamos mantener al menos el 50% del DAI en circulación en activos de vencimiento a mediano plazo (que no se puedan liquidar en el plazo de un año), el 40% que se puedan liquidar en el plazo de una semana y el 20% que se puedan liquidar en el plazo de un día   El grafico y esta conclusion demuestran un punto muy importante, el protocolo tiene muchos activos/efectivo no invertido creando una oportunidad de generar retorno en inversiones seguras. Esta semana paso un voto de gobernanza para invertir en ETFs una parte del PSM.  Que les parece la decision de invertir un porcentaje en activos del mundo real (RWA)? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xRami",
                    "index": "#8",
                    "likes": "1",
                    "time": "03/07/2022-19:15:40",
                    "content": "Excelente traducción @FuchoCrypto ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}