{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/actualizaciones-de-la-core-unit-de-techops-agosto-de-2022-traduccion/18005",
            "title": "Actualizaciones de la Core Unit de TechOps - agosto de 2022 [Traducci\\xc3\\xb3n] ",
            "index": 18005,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "translate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#1",
                    "likes": "6",
                    "time": "20/09/2022-13:51:28",
                    "content": "La Core Unit de TechOps se encarga de dar soporte a la infraestructura crítica de Maker, manteniendo su estabilidad y operatividad con un horario 24/7/365. Tuvimos dos nuevos integrantes en agosto - @SashaTsurenko y @santiago . Estamos muy contentos de que se hayan unido y ya nos están ayudando con muchas tareas importantes. Resumen de incidencias de agosto de 2022 Aquí hay un resumen de todos los incidentes que la Core Unit de TechOps ha recibido y en los que ha estado trabajando durante el mes:  Frontend de subastas - 1 incidente Infraestructura de AWS - 1 incidente Sitios web del ecosistema - 1 incidente EC2 - 11 incidentes Aplicación de gobernanza - 1 incidencia Nodos - 8 incidentes Oráculos y feeds - 10 incidentes Poke Keeper - 2 incidentes Vulcanize DB - 4 incidentes  TOTAL - 39 incidentes El horario de guardia se establece para que todo el equipo tenga una cobertura de 24 horas al día, 7 días a la semana, para que las incidencias críticas sean atendidas al instante. Tickets de la comunidad Esto es para recordar que tenemos un canal en el canal oficial de Discord de MakerDAO (#techops-requests) que se puede utilizar para que los miembros de la Comunidad soliciten diversas tareas utilizando un formato de mensaje específico. Se abre un ticket en nuestro tablero de gestión y empezamos a procesarlo lo antes posible. El mes pasado se abrieron 14 tickets a través de ese canal de Discord. Animamos a todos a utilizarlo cuando sea necesario. Tareas de la comunidad y de las core units cruzadas  Lista blanca de spells Discord - crear/borrar canales, añadir/eliminar gente, actualizar las reglas de spam, etc. Foro - actualizaciones periódicas, adición de varios plugins Sitios web del ecosistema: actualización de los registros DNS de los sitios web Obtención de una lista de usuarios de Discord que pertenecen a todas las core units Actualizaciones hechas al chainlog, cambiando las rutas de la API y los datos históricos Mantener la lista de activos de la Fundación Dai al día, renovaciones de dominios ENS Actualización de los registros SPF para makerdao.com  Proporcionar a DF el desglose de los costes de todos los dominios de su propiedad Ayudando con la depuración de CI para gov-polling-db Creación de la infraestructura para la votación sin gas en el Portal de Gobernanza Creación y configuración de alertas para la actividad de los contratos de los delegados Comenzó a colaborar con la CU de Starknet, ayudándoles con la configuración de la infraestructura, la supervisión, el proceso de CI y la creación de guardianes para observar varios eventos. Preparación para la fusión: obtención de una lista de servicios de monitorización, creación de un canal de Discord, invitación e incorporación de personas a PagerDuty (herramienta de alertas), etc. Durante la fusión: supervisar de cerca todo el ecosistema durante la fusión.  Tareas técnicas  Actualizar los nodos de Erigon Provisión de la beacon de la red principal en Erigon1 Mejorar la seguridad de las cuentas de Maker AWS (restringiendo el acceso a algunas partes del sistema, actualizando los grupos de seguridad) Instalación del agente prometheus en Erigon Poner en marcha los nodos L2 Instalación y configuración de instancias Lair para L2 para Oracles Actualización de feeds Añadir monitorización de transferencias MKR (>1K MKR) Añadir guardianes de L2 Delegar la monitorización de DUX Mejora del proceso de despliegue de la infraestructura a través de Terraform Cloud Actualizar las reglas de integración de Travis en algunos repositorios Actualizaciones de Vulcanize para The Merge ( api ) Actualizaciones del bot de Discord para la lista CU y los enlaces psm Vigilancia del puente Starknet   Esta es una traducción libre del topic TechOps Core Unit updates - August 2022 de @dumitru Créditos: Traducción @cryptenthusiastic - Revisión @Brigith238 ",
                    "links": [
                        "https://forum.makerdao.com/t/techops-core-unit-updates-august-2022/17987"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}