{
    "poll_list": [
        {
            "title": "End DAI Funding For Sourcecred - October 10, 2022",
            "index": "18204",
            "option": "Yes",
            "supporting_mkr": "66,876",
            "highest_fraction": 0.94
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/poll-notice-signal-support-for-ending-dai-funding-for-sourcecred/18204",
            "title": "[Poll Notice] Signal Support for Ending DAI Funding for Sourcecred ",
            "index": 18204,
            "category": [
                "Discontinued Categories",
                "Misc Discontinued"
            ],
            "tags": [
                "meta-governance",
                "sourcecred",
                "gov-001",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "14",
                    "time": "04/10/2022-15:34:41",
                    "content": " Signal Support for Ending DAI Funding for Sourcecred The Governance Facilitators will be putting a poll on-chain next week to gauge MKR voter support for removing DAI funding for both Sourcecred instances for delegates and non-delegates. We are escalating this directly to MKR voters as, ultimately, money being spent on this program belongs to MKR holders. Provision for this action is granted to the Governance Facilitators as specified in MIP16 and MIP41. If voters see it as valuable and wish it to continue, we will continue to fund it from our budget. However, if MKR voters feel we should stop funding the program, we will discontinue funding Sourcecred once the October distributions have been paid out at the start of November.  Current Situation Currently, GovAlpha spends 1,000 DAI per week on the delegate instance and 2,500 DAI per week on the non-delegate instance. In Q2-2022, this was approximately one-quarter of the Core Unit’s DAI expenses, this figure does not include costs of administering the program. We have become increasingly concerned that Sourcecred is no longer delivering net-positive value for the DAO. As a Core Unit, we have spent some time over recent months discussing alternative parameters for Sourcecred and have run some simulations with these new parameters enabled. We have been unable to settle on something that we think is a reasonable improvement on the status quo. One possible course of action would be withdrawing the funding to the program. There are pros and cons to removing the Sourcecred instance. We have tried to present both sides of the discussion here.  Reasons for Discontinuing Sourcecred  Despite spending time studying the effect of SourceCred, GovAlpha has thus far been unable to identify positive results from the program that could not be plausibly explained by other causes. There is a high noise-to-signal ratio on the forum. This has been noted by GovAlpha, members of other CUs, Recognized Delegates, and community members. This is potentially exacerbated by rewarding participation in discussions. Low-effort posts being monetized have led to greater demands on the moderation team. This distracts from the foundational duties of running Core Units (all four active forum moderators are CU facilitators) and is an avoidable distraction. Due to the monetary reward of Sourcecred, this can often devolve into personal attacks on the motivations of the forum moderators from individuals involved as they have a financial incentive in their post remaining unmoderated, taking up yet more time. Rewarded posts and categories do not necessarily reflect participation in the governance of the DAO, instead rewarding sharing of tangentially related news articles or translating forum posts into Spanish (sometimes inaccurately).   Note: we see value in the ongoing translation of certain threads (such as MIPs and the Maker Operational Manual), but the recent trend of translating forum posts en masse is disconcerting and suggests farming of Sourcecred rewards and leads to forum clutter. The usefulness of these translations is difficult to gauge. SourceCred’s only moderating effort is the use of likes, which can prove inefficient for grading the quality of translations.   Time cost of administering the program - a not insignificant number of GovAlpha’s hours are spent on administering Sourcecred each month. This extends from signing up new members, running the instance, generating payouts, verifying payouts, and submitting payment transactions. At a conservative estimate, this is between 10-20 hours of work each month. Ending the program will allow us to spend this time on more productive output.  On a personal level, I would like to add that as other Core Units are the subject of offboarding proposals citing costs, then it makes sense for us to evaluate whether our own spending is also good value for the DAO. At present, it is my personal belief that Sourcecred is not providing good value.  Reasons for Keeping Sourcecred  Sourcecred can drive enthusiasm for participation in Maker Governance. For many, this is a means for their voice and opinions to receive tangible rewards and value. If Governance approves the Endgame proposals, Sourcecred may have a role in metaDAOs as they seek to grow their communities. There is a well-worn progression of people starting as contributors to the forum and receiving Sourcecred payouts before joining a Core Unit or even becoming Recognized Delegates. Stopping payments could see this flow of labor stop. SourceCred remains one of the few options for getting paid by the DAO without “joining the workforce.” Removing its presence may have a centralizing effect where only people approved by the Core Units will be able to invest the time required to meaningfully participate in MakerDAO. Delegates currently have large potential volatility with their pay from participating in voting. SourceCred offers another way to get compensated for their time that is not dependent on individual delegator preferences.   Next Steps We will stop funding Sourcecred after the October distributions if this vote passes. We will look at alternative methods of rewarding participation, which may include monetary or non-monetary rewards and will report back once we have settled on a preferred method. This may or may not include reinitializing Sourcecred with different parameters/rules. In the meantime, any DAI savings due to this reduction in costs will be returned to the Protocol. If this vote fails, we will continue funding Sourcecred at the current levels but will aim to present a package of reforms to the Program by the end of November for approval by Governance vote. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP41#MIP41c2",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/16",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/18",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191/29",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/57",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/26",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/104",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/10",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/123",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/23",
                        "https://forum.makerdao.com/t/govalpha-quarterly-report-q3-2022/19005",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-15/18478",
                        "https://forum.makerdao.com/t/governance-and-risk-211-thursday-october-06-at-17-00-utc/18244/2",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/67",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/28"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Board composition",
                        "Change to proposal pipeline",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.381237424547284
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "04/10/2022-15:43:50",
                    "content": "While we can agree that bureaucracy can not only stifle innovation and the pace of change, it can also cost humans financially. Hence, innovate & iterate on this Governance Mining Tool called SourceCred. Don’t take the easy way out by cutting it off. It is a resourceful tool that has onboarded many community members and fine tuning it might make a difference. You won’t know until you try. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.964285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#3",
                    "likes": "3",
                    "time": "04/10/2022-16:56:26",
                    "content": "    Patrick_J:   SourceCred remains one of the few options for getting paid by the DAO without “joining the workforce.” Removing its presence may have a centralizing effect where only people approved by the Core Units will be able to invest the time required to meaningfully participate in MakerDAO.    This seems to the crux of the struggle. At a high level, I’d bet that a contributor path for valuable effort  without going all in on the DAO is needed. On the other hand, it might be that we have to evaluate what “meaningful participation” is.     Patrick_J:  SourceCred’s only moderating effort is the use of likes   The other question that has always nagged me is: can we add nuance here? There is a large list of plugins for Discourse and even custom emoji sets. Tweaking the parameters before spinning this up is likely the most fruitful angle to pursue IMO. And as a historian, I believe we moved to discourse to battle sybil attacks and sockpuppets that were encountered on reddit. I wonder if evaluating the platform for the DAO is worth exploring too. ",
                    "links": [
                        "https://meta.discourse.org/t/configure-custom-emoji/23365"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.855494505494505
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#4",
                    "likes": "2",
                    "time": "04/10/2022-17:46:44",
                    "content": "I generally agree that SourceCred is inevitably going to need to be shut down. People are going to figure out ways to game it and it erodes trust in the forums. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.368055555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#5",
                    "likes": "6",
                    "time": "04/10/2022-18:59:41",
                    "content": "Let’s cut the Grain, not the Cred. I forgot if those are the real terms, but basically: let’s keep measuring the data (and let anyone find a better way of using it), but let’s stop the funds. I fully support custom emojis, @twblack88. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#6",
                    "likes": "2",
                    "time": "04/10/2022-19:04:49",
                    "content": "    juan:  Let’s cut the Grain, not the Cred.   Yes. To clarify, this is the plan for now. We can probably use cred scores for various things in future and have all the infra in place to track them if we want to. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#7",
                    "likes": "10",
                    "time": "04/10/2022-20:06:25",
                    "content": "Thanks for the writeup @Patrick_J. I find myself pretty torn on this one. Speaking candidly, SourceCred was a nice bonus when I first started getting involved with Maker, particularly to help justify the massive time sink required to ascend the Maker learning curve and understand how the different parts of the protocol fit together. I didn’t specifically go out to try and maximise my cred, but on the margins it probably did help encourage me to post higher-quality (or at least, attempted high-quality) contributions on the forum. It’s worth noting that the Maker forum still sees higher quality discourse for the most part than other communities in crypto (a low bar, but still). However, it’s hard to qualify the impact SourceCred has on that quality. I agree with Patrick that the noise-to-signal ratio on the forum has been exacerbated, particularly over the last few months, so it seems reasonably likely that the forum could see better discourse without SourceCred. On the other hand, I wouldn’t be surprised if the only people who continue to regularly post are CU members and Recognized Delegates - this seems suboptimal given we are a DAO at the end of the day. Overall, I tentatively agree that SourceCred is no longer serving a helpful purpose, but my strong preference would be to replace it with alternative methods of rewarding participation as noted above - with an eye to building an inclusive community and encouraging prospective Maker workers to dip their toes in. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.719827586206896
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#8",
                    "likes": "1",
                    "time": "04/10/2022-22:08:51",
                    "content": "Agree with your write up, I had a similar experience. Even though I was hooked and wanted to participate in this community, Sourcred pushed me to pick my brain and attempt to create higher quality content. I think the experiment can be improved to reduce noise and incentivize productive discussions while decintivizing spam. Its normal that during budget cuts we look to reduce sourcecred payouts, so maybe in the meantime we can brainstorm ways to improve it, otherwise by removing sourcecred we will get rid of all the noise but also potential incoming talented members. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ekryski",
                    "index": "#9",
                    "likes": "5",
                    "time": "05/10/2022-04:35:10",
                    "content": "The ramp up cost is very real. I’m spending more time than I can afford getting back up to speed after taking a couple year hiatus to focus on the company, our own research and evaluating other protocols. Still feel a bit like a fish out of water. Had no idea SourceCred was a thing. Can see the merits but I also do think you want to attract people who care about the ideas and the ethos first and reward later. Using incentives to drive discussion will likely lead to more noise. Gitcoin bounties for more freelance opportunities (or something similar) would likely be a better option. FWIW, pending how some of the upcoming MIP votes go, I’ll still be here with or without SourceCred.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.148076923076923
                },
                {
                    "author_link": "https://forum.makerdao.com/u/squid",
                    "index": "#10",
                    "likes": "0",
                    "time": "05/10/2022-12:08:38",
                    "content": "    Patrick_J:  Delegates currently have large potential volatility with their pay from participating in voting. SourceCred offers another way to get compensated for their time that is not dependent on individual delegator preferences.   1000 Dai divided among so many delegate is probably a rounding error to their salary. The others are just spamming for likes to get a piece of the 2500 Dai. Maybe I should get some too while this is going  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.678571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#11",
                    "likes": "4",
                    "time": "05/10/2022-12:28:29",
                    "content": "    flipflopflapdelegate:  Hence, innovate & iterate on this Governance Mining Tool called SourceCred. Don’t take the easy way out by cutting it off.   Happy to take this signal from the MKR voters. We have changed up SourceCred several times since onboarding a pilot program two years ago and have found some of the same issues. With that said we have a full list of possible improvements, we can explore if the voters do want to keep it. Just want to be upfront that it costs our CU a decent amount of time and money and the tangible output is quite small. I think people that want to keep the program are advocating for some of the intangible effects which can still have value.     twblack88:  And as a historian, I believe we moved to discourse to battle sybil attacks and sockpuppets that were encountered on reddit. I wonder if evaluating the platform for the DAO is worth exploring too.   Have been wondering this myself, having completed the migration from Rocket.Chat to Discord in my tenure, I’m quite confident we could pull it off for the forums if we felt like we had a suitable alternative.     Matt_NZ:  Overall, I tentatively agree that SourceCred is no longer serving a helpful purpose, but my strong preference would be to replace it with alternative methods of rewarding participation as noted above - with an eye to building an inclusive community and encouraging prospective Maker workers to dip their toes in.   We very much intend to keep our Off-Chain Proposal Bounties program and look for more targeted ways to use our incentives budget regardless of the outcome of this vote. We’ll be processing the second payout from this program this month with the potential for many more soon.     squid:  1000 Dai divided among so many delegate is probably a rounding error to their salary.   *1000 DAI per week. Still, small numbers if evenly distributed among delegates, but not all are as active. Moreover, several delegates have small amounts of MKR, allowing this program to essentially double their monthly remuneration for participating in governance. Here, too, perhaps we have outgrown our original intention of onboarding more delegates even if they had to start small, in a little over a year we have had over 20 recognized delegates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.819921875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#12",
                    "likes": "4",
                    "time": "06/10/2022-17:18:13",
                    "content": "I want to chime in with a suggestion. When I first started out as a delegate, receiving sourcecred actually exceeded the delegate compensation. One of the major tasks of being a delegate is the time investment that goes into staying informed. Parts of that is getting intimately familiar with the forums and keeping a constant vigilance of what is going on there. Having good knowledge of the forums makes a person well positioned to comment on and making meaningful input on various topics being discussed. Now this is expected from delegates and as such shouldn’t warrant compensation on its own. However, the delegates we have now should not be expected to last forever. As such there is a need for new delegates to cut their teeth. Allowing prospective delegates to earn sourcecred will give a breeding ground of sorts. The basic sourcecred also gives some feedback on what the community cares about. At the same time I don’t think delegates with a decent compensation should receive further compensation for actions that is expected to be part of the role. Delegate compensation is tied to the total amount of MKR delegated. It is also influenced by performance metrics. To tie this together I therefore suggest that sourcecred be kept among delegates but reduced with the inverse of the factor used to determine compensation based on number of MKR delegated. That way large delegates will receive very little if anything, but prospective or delegates with low MKR will receive the majority and can more easily stay on and challenge the incumbent delegates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.652769105894105
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#13",
                    "likes": "2",
                    "time": "07/10/2022-10:11:53",
                    "content": "Thanks for your thoughtful comment, Justin.     JustinCase:  To tie this together I therefore suggest that sourcecred be kept among delegates but reduced with the inverse of the factor used to determine compensation based on number of MKR delegated. That way large delegates will receive very little if anything, but prospective or delegates with low MKR will receive the majority and can more easily stay on and challenge the incumbent delegates.   The rationale for removing both instances for the short term is that if we left the delegate instance intact, there would be an incentive to sign up as a Recognized Delegate just to access Sourcecred payouts. This would be exacerbated if smaller Recognized Delegates were entitled to a larger “slice of the pie”. There would be no requirement to put in the effort as a delegate to attract MKR if access to Sourcecred was the intended outcome, and if Sourcecred were weighted to smaller RDs, accumulation of MKR to the relevant contract would be disincentivized. My assumption here is that this would result in multiple new RDs coming forwards and would not discourage the problematic behaviour that we are targeting with the removal of payments. Therefore, we felt it more appropriate to pause both instances while investigating alternatives. This is intended to be a temporary pause in governance mining incentives. At the same time, we are researching alternatives. Still, we feel that the current situation may have become untenable, which caused us to suggest stopping payouts while investigating options. I like your idea of allowing smaller delegates a greater proportion of the rewards, and we can certainly see if any proposed solution will allow this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.853299635970091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#14",
                    "likes": "1",
                    "time": "07/10/2022-10:33:44",
                    "content": "    Patrick_J:  The rationale for removing both instances for the short term is that if we left the delegate instance intact, there would be an incentive to sign up as a Recognized Delegate just to access Sourcecred payouts. This would be exacerbated if smaller Recognized Delegates were entitled to a larger “slice of the pie”. There would be no requirement to put in the effort as a delegate to attract MKR if access to Sourcecred was the intended outcome, and if Sourcecred were weighted to smaller RDs, accumulation of MKR to the relevant contract would be disincentivized. My assumption here is that this would result in multiple new RDs coming forwards and would not discourage the problematic behaviour that we are targeting with the removal of payments. Therefore, we felt it more appropriate to pause both instances while investigating alternatives.   My counter argument is that to become a RD you need to go through a lot more work than signing up for sourcecred. You even have to create a delegate contract which carries an actual cost (even though that is a lot lower than it used to be). The difference in compensation between sourcecred and MKR delegated is at least an order of magnitude apart which means that there exists a clear compensation incentive to chase more MKR. Furthermore I see no reason you couldn’t also tie delegate performance metrics to the sourcecred reward as well meaning continuous activity would be required. Now, this might not fully address the concern about the quality of the content produced, but it does drive it towards individuals willing to put in more effort up front as well as showing a willingness to put some resources on the line. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.907754010695188
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#15",
                    "likes": "6",
                    "time": "07/10/2022-15:44:57",
                    "content": "Many early beneficiaries of SC went on to be delegates but many also went on to join CUs - I am one of those. At least from my experience, I’d say that the point you make below applies to anyone who starts from scratch and gets to the point where they’re contributing to Maker in some meaningful way. The forum lets you explore Maker and decide how you want to be involved.     JustinCase:  Having good knowledge of the forums makes a person well positioned to comment on and making meaningful input on various topics being discussed. As such there is a need for new delegates to cut their teeth. Allowing prospective delegates to earn sourcecred will give a breeding ground of sorts.   I suspect that the ideal version of SC would make no distinction between delegates, CU contributors and other posters. The issue with keeping only one instance alive is that it pushes people to become delegates - it would be the first thing any new user would sign up for. What we want is for the forum to be a pipeline for CU contributors and informed members of the community too. What SC would ideally do is cut off two types of posters - the low-effort posters who are here for SC indefinitely and the well-paid posters who don’t need SC. It’s in between these two where one finds posters who could potentially be valuable contributors to Maker and for whom SC might be the difference between staying and leaving. It is easy to cut out those who receive large salaries from the protocol. It is much harder to have a system that cuts off users who post low-level comments in the hope of getting some Dai and also not discourage those with genuine intent to learn and contribute. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3057605273514366
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#16",
                    "likes": "3",
                    "time": "07/10/2022-19:23:55",
                    "content": "This seems to be the best take so far. While SourceCred is a nominal expense for the DAO, its incentive mechanism infects discussions rapidly and creates false expectations. Rewarding commentating on proposals miss a Governance forum’s critical goal: education, iteration, and better decision-making. I would be more inclined to reinvest these funds into the following program, creating more integrations and improvements for users to vote on within MakerDAO.     prose11:  We very much intend to keep our Off-Chain Proposal Bounties  program and look for more targeted ways to use our incentives budget regardless of the outcome of this vote. We’ll be processing the second payout from this program this month with the potential for many more soon.   Proposals at their core require discussions and participation from the community; this is achieving SourceCred’s goal while also producing proposals. Seems like a more effective program, and @twblack88 is crushing because of it  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.655555555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#17",
                    "likes": "0",
                    "time": "07/01/2023-01:24:45",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1800"
}