{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rate-setting-framework/4809",
            "title": "Rate Setting Framework ",
            "index": 4809,
            "category": [
                "Governance"
            ],
            "tags": [
                "rates",
                "rates-working-group"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "12",
                    "time": "20/10/2020-17:32:39",
                    "content": "Authors: @Primoz, @LongForWisdom, @Hexonaut, @Monet-supply, @SebVentures, @Akiva With the RatesV2 signal request and poll passing, the working group agreed that it would be good to share an overview of the framework we’re using to approach rate setting, and to communicate next steps. We don’t expect to be making huge changes to every SF each week. The goal is to make rates more stable while keeping Maker well positioned in terms of the competitive landscape.  When will things happen? Once a month  Risk Team generates an analysis of the risk premiums of the assets currently active in the Maker Protocol. The RatesV2 working group will propose rate changes if necessary based on changes to risk premiums and will include a link to the risk analysis.  Once a week  Rates working group will meet and discuss competitive analysis and any other issues or concerns generated by the community. Risk Team may generate an analysis of the competitive landscape across DeFi if they have reason to believe there have been meaningful changes since the last analysis. Rates working group may propose changes based on the competitive landscape and will include a link to the competitive analysis. Any feedback from governance will be addressed  Schedule We currently aim to stick to the following schedule when it comes to rate changes. This schedule may be adjusted in the future depending on how well this works.   Monday: Rates group meets to discuss the rates, decides if changes should be proposed.  Tuesday: Proposal forum post is written up.  Tuesday - Friday: Feedback from governance considered, proposal may change due to feedback.  Monday-Thursday: On-chain poll to confirm proposed changes.  Friday: Executive   Format of Proposals Summary Table  Every vault type has a proposed SF and an indication of whether a change is being proposed. Risk Team delivers updated table with each Vault type having updated Risk Premium and Competitive Rate Summary table will look something like the below:      Vault Type Risk Premium Best Competitive Rate Average Competitive Rate  Current SF Proposed SF Change in SF     ETH-A 2.00% -2.23% 2.71%  2.00% 2.00% 0.00%   WBTC-A 4.00% -1.75% 3.95%  4.00% 4.00% 0.00%   BAT-A 4.00% -1.50% 1.34%  4.00% 4.00% 0.00%   KNC-A 4.00% 1.75% 2.85%  4.00% 4.00% 0.00%   ZRX-A 4.00% -6.17% -0.16%  4.00% 4.00% 0.00%   MANA-A 12.00% 1.75% 1.75%  12.00% 12.00% 0.00%   LINK-A 2.00% -9.78% 0.44%  2.00% 2.00% 0.00%   COMP-A 3.00% -8.83% -2.42%  3.00% 3.00% 0.00%   LRC-A 3.00% n/a n/a  3.00% 3.00% 0.00%   USDC-A 4.00% -2.22% 0.89%  4.00% 4.00% 0.00%   USDC-B 4.00% -2.22% 0.89%  50.00% 50.00% 0.00%   TUSD-A 4.00% 5.60% 5.60%  4.00% 4.00% 0.00%   PAX-A 4.00% n/a n/a  4.00% 4.00% 0.00%   USDT-A 8.00% n/a n/a  8.00% 8.00% 0.00%    Overview  This will be a brief overview of the current situation with regards to rates.  Comments on Changes  Each change listed along with rationale and comments. Reasons for a change can be due to combination of:  a) changes in risk exposures, b) competitive landscape change, c) monetary policy reasons or d) other reasons (for instance lower SF on stablecoins due to accrued fees issue)    Large Vault-Type Outlook  Comments will be provided for the vault-types with a large portfolio weight regardless of whether changes are proposed.  Other Considerations  Any other thoughts or considerations will be discussed here. One example of this would be the current situation with stablecoins.   Considerations for Proposals Risk Calculations of Risk Premiums will follow a new approach, which is still to be finalized. The idea is to simplify calculations so that every analyst that does a collateral evaluation can perform them. For larger debt exposures (i.e. ETH or WBTC) we will still rely on the General Model and use more Quantitative Approach to managing risk.  Reported every month to start, potentially moving to a bi-weekly basis. Initially we will use the current RP that were proposed by Risk in the past and voted on by governance as some time is still needed to finalize the new approach.  Competitive Rates Analyze rates at competitive lending venues, primarily:  Compound Aave Cream Nexo Celsius Blockfi  Compare lending products and assess advantages/disadvantages versus Maker, for instance:  Different LR / LTV (cost of capital adjustments) Debt Ceiling / Borrow Utilization Penalty fees Liquidation risks Origination and other fees Protocol solvency and other risks  Market Rates Hard to assess true market rate as lending products are non-standardized. We can though look at Futures Basis or Perpetual Swaps pricings to assess trends of rate movement on borrowing USD from particular assets. This should give us information about bullishnes or bearishness of an asset and willingness to leverage on it at higher or lower rates. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip41c4-sp1-facilitator-onboarding-real-world-finance/6226",
                        "https://forum.makerdao.com/t/a-maker-community-2020-summary/5848",
                        "https://forum.makerdao.com/t/mip7c3-sp5-domain-team-onboarding-risk-domain-team/5476",
                        "https://forum.makerdao.com/t/working-group-autonomous-makerdao-update/5197",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-115-thursday-october-22-16-00-utc/4757/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-18-pt-br-portugues/4891",
                        "https://forum.makerdao.com/t/week-21-dai-distributions-sourcecred-funding-mip13c3-sp6/4883",
                        "https://forum.makerdao.com/t/maker-relay-ep-18-en-espanol/4882",
                        "https://forum.makerdao.com/t/maker-relay-ep-18/4881",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/2",
                        "https://forum.makerdao.com/t/signal-request-sourcecred-stop-paying-people-who-are-already-paid-by-makerdao/12971/25",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-115-thursday-october-22-16-00-utc/4757/5"
                    ],
                    "GPT-summary": "The post explains the framework for rate setting in the Maker Protocol. The RatesV2 working group will propose rate changes based on changes to risk premiums and competitive landscape. The post also provides a format for proposals and considerations for proposals. The post invites feedback from governance.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.4148796939494614
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "2",
                    "time": "20/10/2020-19:20:59",
                    "content": "Probably not worth to take into account yet, but we might up ending in multiple vault types with different LR for potentially each collateral - will this be covered by a specific premium for each of them? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.85
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#3",
                    "likes": "1",
                    "time": "21/10/2020-01:12:19",
                    "content": "I think we should consider tracking token traffic as a reference indicator. For example, WBTC dropped 9% on our platform. We can track whether other platforms have increased WBTC accordingly. If it does not happen, it cannot be proved that this is caused by SF expenses. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#4",
                    "likes": "1",
                    "time": "21/10/2020-05:14:35",
                    "content": "Regarding risk premium calculations, How about also calculating risk premiums for 150% LR vaults which are more competitive than 175% LR? Will also reduce governance overhead if governance wants to add a 150% LR vault in the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#5",
                    "likes": "2",
                    "time": "21/10/2020-07:40:23",
                    "content": "@ultraschuppi @Jiecut both raised good points. Yes, for different Vault types different risk premiums will apply. This table didn’t include ETH-B because at the time we made analysis vault type wasn’t live yet. As for competitive rate we will try to compare it with the most similar product out there. For instance Compound’s ETH “vaults” are closer to Maker’s ETH-B than ETH-A. In that sense Maker is way less competitive compared to Compound since there is more than 8% spread versus Compound (ETH-B has 6% SF versus Compound’s rate of -2.2%). We shall see how this plays out with actual usage. @hongbiao_li exactly, this is also on my wish list - to have someone build a tool or manually track loan origination traffic on other platforms so market share can be compared through time and assess how rate changes affected users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.815771349862259
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "20/01/2021-13:40:26",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}