{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/incrementar-los-pagos-de-sourcecred/5271",
            "title": "Incrementar los Pagos de SourceCred ",
            "index": 5271,
            "category": [
                "Discontinued Categories",
                "Misc Discontinued"
            ],
            "tags": [
                "sourcecred",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#1",
                    "likes": "8",
                    "time": "22/11/2020-02:44:47",
                    "content": "Durante las últimas semanas, el grupo de trabajo de SourceCred ha estado debatiendo si aumentar los pagos semanales de 2500 DAI a 5000 DAI. Hemos decidido hacerlo y aumentar el pago a 5000 DAI por semana, a partir de diciembre. Creemos que esto es beneficioso por las siguientes razones:  Registros adicionales Estamos viendo que más usuarios se registran en la iniciativa, y más usuarios significa que los pagos se dividen entre más personas, lo que reduce el pago promedio.  Pequeña porción de los ingresos del protocolo 5,000 DAI/semana sigue siendo una fracción insignificante del ingreso actual total del Protocolo Maker (incluso excluyendo las monedas estables, pero puede marcar una diferencia significativa en la cantidad de tiempo que los contribuyentes sienten que pueden dedicar a Maker). Con 250k por semana de ingresos de monedas no estables, a 5,000 DAI por semana, esto representa el 2% de los ingresos del Protocolo Maker. Se debe tener en cuenta que, por el momento, la Fundación Maker sigue pagando este importe.  Crecimiento El crecimiento de la DAO es un objetivo clave en este momento. Tener más miembros de la comunidad le da al protocolo un grupo más grande de talentos potenciales que pueden estar dispuestos a trabajar de manera más formal para la DAO.  Experimentación El uso de SourceCred en MakerDAO todavía se considera en una fase de prueba; experimentar con el pago total con suerte nos permitirá establecer mejor el monto del pago cuando/si la DAO está financiando SourceCred con fondos del Protocolo Maker. Editado: Olvidé agregar que esto comienza en diciembre. (@LongForWisdom) ————————————————————————— Esto es una traducción libre del artículo original en inglés, gracias a @Lozadaluis12 y a @blimpa  por la traducción. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-22-en-espanol/5290"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.46875
                }
            ]
        }
    ]
}