{
    "poll_list": [
        {
            "title": "Increase the Surplus Auction Buffer to 2 Million DAI - August 10, 2020",
            "index": "3316",
            "option": "Yes",
            "supporting_mkr": "36,300",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-increase-system-surplus-threshold/3316",
            "title": "Signal Request: Increase System Surplus Threshold ",
            "index": 3316,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "reserves",
                "system-parameter"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#1",
                    "likes": "3",
                    "time": "23/07/2020-19:31:14",
                    "content": "Overview After Black Thursday it became apparent that a larger surplus would be needed in emergency situations to backstop the system in case of failure. With market sentiment, rates, and overall debt/supply increasing, I thought now would be a good time to introduce a signal to see if the community would be interested in raising the system surplus threshold the further insure the protocol. As well, with the future implementation of MIP14 (DAI Transfer) and eventually need to pay for the sustainment of the decentralized ecosystem, this surplus will need to be higher to facilitate the payment of future transactions. Pros:  Insures system further from black swan/system failure events Stockpiles a treasury for payment of future expenses (Oracle Feeds, Domain Teams, etc.)  Cons:  Delays MKR burn  @rune’s post here: System Reserves - #12 by rune  Removes DAI liquidity from the market  Should we increase the System Surplus Threshold?     Yes No Abstain     0 voters     What value should we increase the System Surplus Threshold to?     750,000 1 Million 1.5 Million 2 Million More than 2 Million Abstain     0 voters     This poll will run for 2 weeks as it is not urgent and will allow for maximum discussion. If you can think of any other pros/cons I will be sure to add them to the overview. Looking forward to hearing the communities thoughts on the matter! Edit: Sorry had to redo poll. I’m a little rusty. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-105-thursday-august-13-4-00-pm-utc/3570/5",
                        "https://forum.makerdao.com/t/poll-creation-of-a-makerdao-strategic-reserves-solving-the-peg/3638",
                        "https://forum.makerdao.com/t/maker-relay-ep-7/3630",
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaracion-de-intenciones-fondo-de-reservas-estrategicas-srf/5385",
                        "https://forum.makerdao.com/t/weekly-polls-2020-08-10/3627",
                        "https://forum.makerdao.com/t/poll-should-makerdao-print-unbacked-dai-to-solve-the-peg-issue/3589",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-103-thursday-july-30-4-00-pm-utc/3318/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-104-thursday-august-6-4-00-pm-utc/3469/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-106-thursday-august-20-4-00-pm-utc/3657/2",
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaration-of-intent-strategic-reserves-fund-srf/3765",
                        "https://forum.makerdao.com/t/maker-relay-ep-8/3712"
                    ],
                    "GPT-summary": "The author of the post is proposing to increase the system surplus threshold to insure the protocol from black swan/system failure events and to stockpile a treasury for payment of future expenses. The author is asking for feedback from the community on whether to increase the system surplus threshold and what value to increase it to. The post also mentions some pros and cons of the proposal.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.148958333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "2",
                    "time": "23/07/2020-19:32:04",
                    "content": "Abstain options please, so I can see how the vote is going without voting for anything specific  Edit: Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#3",
                    "likes": "1",
                    "time": "23/07/2020-19:35:41",
                    "content": "Can’t see who voted for the first vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#4",
                    "likes": "4",
                    "time": "23/07/2020-19:40:45",
                    "content": "I think it should be a % of DAI outstanding rather than a fixed amount. It could be implemented as a tax over the stability fee. Also increasing the surplus does not mean there is no burning, we could have a tax for the surplus once we reach a certain minimum,  a tax for capex and the difference to be burned. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.213169642857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#5",
                    "likes": "1",
                    "time": "23/07/2020-20:02:19",
                    "content": "Adding this topic for visibility as there is a ton of discussion in there as well     System Reserves Risk       While governance is currently focused on restoring the peg and improving liquidity, I’d like to open up a conversation about system reserves in preparation of a return to normal conditions (item 12 of the initial problem space from MIP1c2).  Bank capitalization metrics can provide some useful insight. The global banking system generally requires regulated financial institutions to maintain core capital ratios of 4%, meaning that their balance sheet common equity needs to be 4% of their total ass…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#6",
                    "likes": "2",
                    "time": "23/07/2020-20:22:57",
                    "content": "I think that there’s an argument to be made for the system surplus scaling with the DAI supply. Back when the previous system reserves thread was active the total DAI supply was less than 1/2 what it is now.     System Reserves Risk       The big problem with using the buffer as a system reserve (which is not its intended use) is that it means the game theory of emergency shutdown and its effect on the peg gets very screwy, since the contents of the buffer go to dai holders in an emergency shutdown.  In times of uncertainty when emergency shutdown become a possibility, the price of Dai will trend towards the expected payout in an emergency shutdown. If that payout is significantly more than 1 USD per dai, then it creates a self-r…     RE: @rune’s comment above from that thread, increasing the surplus could have a negative impact on the peg. People buying DAI above the peg have less to fear from ES as the surplus gets higher. I don’t expect this to have a big impact immediately but something to consider. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.848958333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#7",
                    "likes": "1",
                    "time": "24/07/2020-01:26:17",
                    "content": "@Andy_McCall @monet-supply From that thread it looks like there was pretty good consensus to increase the surplus to 2 Million! I’m surprised it got kiboshed without any action. I personally don’t really care about the game theory aspect, I care more about safeguarding the system from further failures. I’m sure it’s something to take into account but I think most of us can agree that 500k is too low right now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.1195054945054945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#8",
                    "likes": "2",
                    "time": "24/07/2020-02:51:35",
                    "content": "My 2 cents as to why it didn’t really “make sense” to raise it then and possibly why it still doesn’t is that the protocol isn’t really bringing in any revenue, so it doesn’t really matter what we set the stability buffer to bc we unfortunately won’t be able to fill it. That said I love that people are still looking at the protocol’s cash reserves and maybe raising it (even if it is mostly just a gesture) is worth doing so long as we have sufficient interest in doing so. If we ARE looking for ways to protect the protocol against potential future downturns given the current market conditions there probably are options I’m just not sure that the stability buffer is our best one. Ones that immediately come to mind would be to preemptively trigger a flop auction while the price of MKR is still high, or potentially raising the LR to lower our VaR. Don’t really expect either of those to be terribly popular options though so it really hasn’t been something I have tried pursuing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9399999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#9",
                    "likes": "4",
                    "time": "24/07/2020-14:31:01",
                    "content": "Having a growing and reasonably large system reserve is important.  It can protect MKR holders from MKR dilution from DAI losses in the future. Would be used to pay for stuff as Maker functions become fully decentralized.  The cons of doing this in DAI exclusively is that it removes DAI liquidity from the markets and management issues (either by governance and/or smart contracts to place and fill orders) Which was why I suggested taking the system surplus and using it to buy assets that either rise in value when collateral in vaults drop, OR retain value.   DAI we know appreciates when markets are stressed and it would be a good thing to be able to directly inject DAI liquidity but this begs other questions. Based on what I see about the MKR flop/flap pricing mechanics honestly would rather buy MKR with DAI setting a floor price and sell it when price is high.   What that is - a moving target.  But the protocol sold MKR to cover losses at around 250 after buying it between 400-800 give or take.   Not really an ideal use of capital really. A longer term solution regarding creating and managing a secondary system surplus portfolio using the primary surplus DAI would probably be the best option here as then this secondary surplus asset portfolio could have in place some automatiion controlled by governance to place bids and offers for collateral using other DEXs to either inject or remove DAI as market conditions and prices of assets warrant. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.913492063492064
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#10",
                    "likes": "0",
                    "time": "24/07/2020-15:11:50",
                    "content": "Don’t we need to do the opposite instead of decreasing the dai supply? If you increase the surplus it will put more pressure on the peg. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#11",
                    "likes": "3",
                    "time": "24/07/2020-15:13:54",
                    "content": "Remember to add as a ‘con’ removes DAI liquidity from Markets. Given that I am a ‘secondary system reserve’ proponent I am thinking instead of automatically buying MKR we should just toss off the system reserve excess into the secondary reserve and use that to set a floor price to buy MKR at via some reverse auction that can be triggered by a keeper that wants to sell MKR for DAI and will start the bidding at the floor price. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#12",
                    "likes": "1",
                    "time": "24/07/2020-15:18:34",
                    "content": "Large buffers are bad. While some small buffers here and there are unavoidable, actually planning to use large buffers to make the system work is in my humble opinion not a good idea. It quickly becomes a mental cushion and no buffer will ever protect us against a real black swan event anyway. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.455952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#13",
                    "likes": "0",
                    "time": "24/07/2020-15:37:11",
                    "content": "    alexis:  Don’t we need to do the opposite instead of decreasing the dai supply? If you increase the surplus it will put more pressure on the peg.   Personally i think this boils down to what you view as a bigger risk market movements or people losing faith in the peg. I’m of the opinion that being 1-3% off peg while not ideal probably isn’t the end of the world especially since the arguments against it seem to be vague and hypothetical. Having no cash reserves on the other hand, well we saw how that played out last time. If this model by the risk team is to be believed we’ve already burned through about 20% of the capital we could expect to raise through dilution, so we might be particularly exposed in the event of another large downturn and this time we have even more DAI lent so that further worsens the situation. That is why i would view bolstering cash reserves as a higher priority. Unfortunately though to save up a bit of a rainy day fund requires revenue and the way this protocol makes that is through loans, so at least for now I think these two problems likely have the same fix which is more collateral options. IMO the most important thing right now is finding collateral options that people are willing to pay premiums for in order to get leverage. If we can find that holy grail collateral and fill the current buffer then we can worry about whether or not we want to raise it. Until then though raising it is just a moot point. IMO its basically just setting a lofty savings goal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.307222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#14",
                    "likes": "0",
                    "time": "24/07/2020-16:53:02",
                    "content": "Can you help me understand how it removes dai from the market? That dai would get sold for MKR anyways so it still wouldn’t be in the market. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#15",
                    "likes": "0",
                    "time": "24/07/2020-16:53:50",
                    "content": "I am more thinking like MakerMan, Right now, for me it looks like we have something like 400m demande that we can’t supply. And the only way to provide this demande is to remove all frictions. And reserve should be sold at max and even more. A peg at 1.06 is highly damageable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.445714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#16",
                    "likes": "1",
                    "time": "24/07/2020-17:04:21",
                    "content": "The Dai sitting in the buffer is Dai supply that isn’t in the market. When it’s sold for MKR via FLIPS, it enters the market, but when it’s just sitting in the buffer it’s not available to bring the price of Dai down. So say we have 100M Dai minted against ETH. At zero buffer that 100M is in circulation. Whereas if we have 100M minted against ETH and 20M in the buffer, that’s only 80M in circulation. Assuming demand for Dai is 100M, in the second case, the peg will be worse off. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.244444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#17",
                    "likes": "0",
                    "time": "24/07/2020-17:11:57",
                    "content": "Got it. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#18",
                    "likes": "4",
                    "time": "24/07/2020-18:11:36",
                    "content": "    Planet_X:  Large buffers are bad.   I agree a large DAI surplus buffer is bad from a DAI market liquidity standpoint.   I disagree that a large surplus buffer of other assets (stablecoins and things that maintain or preferrably increase in value, that have largish market liquidity in DAI, when collateral values are dropping) is bad. imo Maker to be fully decentralized will probably have yearly expenses on the order of 1-2M DAI - minimum.  I am still waiting for an accounting of Maker Foundation yearly expenses honestly because I think they are far above 1-2M DAI/yr and more like 5-10M.   So yeah a secondary surplus buffer of at least 2M DAI is going to be required and while Maker likes to pay for work in DAI, it is not a good idea to have this liquidity removed from markets doing nothing. At some point, sooner than later, Maker governance is going to have to approve of something like MIP14, as well as the creation of a secondary surplus reserve to fund operations expenses, etc. and to also appoint working groups to adminster those funds.  The idea that Maker governance is going to micromange fund disbursal for anything will grow old and tiresome pretty fast imo.   The compensation group has been putting hours into the whole compensation thing now basically for free with no real compensation on the horizon whether it succeeds or fails.   I have seen dependency on volunteer work in other organizations grow until basically people providing it disappear. IF it is time for this organization to grow we need to step back and address the real issues directly and proactively vs. waiting for them to become problems that need ‘emergency’ measures. This is not only true of the concept of how to manage the system surplus, but how to deal with managing DAI liquidity, PEG, handle dark fixes and dark topics.  Giving responsibility and authority to EPCs regarding changing SFs, DCs, RPs, etc.   A group making a recommendation that governance votes Yes/No on anothing thorny topic.  The whole idea of Maker deciding to manage the PEG directly.   CBs and governments handle this by making surprise announcements, then doing surprise interventions etc.  (discussed/planned a secret way) is completely lost here in this open governance model.   Which means we lose tools to manage market expectations to help us. Everything has pros/cons.   The multiple tasks set before us, in a very agressive timeline, is daunting.  A working group just to discuss and create such a larger visionary plan for Maker desperately needed vs. this micromanaging everything as someone puts it forward all the time organic model.  Providing funds for even a basic level of compensation for work on any of this stuff also needed.   While people have in their heads what will be needed, how to do this in a secure, trusted, verifiable, well managed/controlled AND decentralized model I think is not at all understood much less tried and tested. Increase the system surplus.   To me this one is a no-brainer.   The only issue is we don’t want to hold it all in DAI to drain system liquidity and to create a secondary working account to deal with funding Maker operations.   This to me is also a no-brainer YES.   The thought is then how much and what kinds of funds (NOT DAI) to fill this secondary working account/buffer (whatever you want to call it) as well as how to administer it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.8776190476190475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#19",
                    "likes": "1",
                    "time": "24/07/2020-18:18:07",
                    "content": "On the other hand, we’re only going to start seriously accumulating system surplus when the peg is fixed. And at that point, having 2m DAI in reserves isn’t that bad. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 3.9416666666666664
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#20",
                    "likes": "0",
                    "time": "24/07/2020-18:26:06",
                    "content": "How do you suggest we go about introducing a fund that purchases assets with the surplus? Would this be a MIP? I guess we need a couple other MIPs to pass before that becomes feasible but I would be interested in discussing the possibilities of creating something like that for sure. Idle DAI in this market is not productive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#21",
                    "likes": "0",
                    "time": "24/07/2020-18:34:40",
                    "content": "I feel 0.5-1% of total dai as surplus would be a conservative buffer.  Maybe we can propose to add something like that to MIP 17 adjustments, unless that adds too much complexity? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#22",
                    "likes": "0",
                    "time": "24/07/2020-18:37:42",
                    "content": "A percentage does sound like a good idea. Either added to a current MIP or a new one would be great! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.236363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#23",
                    "likes": "3",
                    "time": "24/07/2020-18:48:46",
                    "content": "    Aaron_Bartsch:  How do you suggest we go about introducing a fund that purchases assets with the surplus? Would this be a MIP? I guess we need a couple other MIPs to pass before that becomes feasible but I would be interested in discussing the possibilities of creating something like that for sure. Idle DAI in this market is not productive.   In regards to secondary asset reserve contracts: My guess would be to get a declaration of intent ratified. That would at least form be a foundational step that you could use to push the narrative forward. After that it is going to be securing funds to compensate project managers and for R&D to design/implement/audit the tech. On top of that there would need to be a handful of MIPs proposed and ratified to introduce and staff a domain team that would be responsible for administering the account. Probably some legal work in there as well to ensure that the domain teams can’t mismanage the funds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.578125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#24",
                    "likes": "0",
                    "time": "24/07/2020-18:54:56",
                    "content": "Yep, we’re getting a bit off-topic for this thread, but that’s one of the core reasons for having MIP13 . To give people a good way to determine whether there is support among MKR Holders for pursuing some of the longer term projects. In turn, that demonstration of support should give individuals (who might want to work on the idea) more of a incentive and reassurance that they are working on something the Protocol will value and hopefully reward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#25",
                    "likes": "0",
                    "time": "05/08/2020-12:52:25",
                    "content": "Just a friendly reminder that poll wording should be submitted on the community github here https://github.com/makerdao/community/tree/master/governance/polls by end of day. Please tag me as a reviewer on the PR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#26",
                    "likes": "0",
                    "time": "05/08/2020-16:52:28",
                    "content": "Just a reminder that this signal request will close tomorrow. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#27",
                    "likes": "0",
                    "time": "05/08/2020-20:36:03",
                    "content": "@Aaron_Bartsch You need to submit a PR today if you want a governance poll on Monday, July 10. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#28",
                    "likes": "1",
                    "time": "05/08/2020-20:51:00",
                    "content": "I know. Lfw already told me I just don’t have the time right now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#29",
                    "likes": "8",
                    "time": "06/08/2020-01:41:23",
                    "content": "Based on a decent sized consensus I am ending this poll slightly early so I may include it in Monday’s polling. The community has voted “Yes” to increase the system surplus FLOP threshold from 500,000 to 2 Million. Thank you to everyone who participated! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.729166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#30",
                    "likes": "4",
                    "time": "11/08/2020-16:58:20",
                    "content": "This signal request has now been added to governance polling as \" Increase the Surplus Auction Buffer to 2 Million DAI\" - https://vote.makerdao.com/polling-proposal/qmneswmjkygu4akcns68hbmk2l6jgppbqszt2jnlk7tdgy If passed by MKR holders it will be added to the executive this Friday. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#31",
                    "likes": "5",
                    "time": "13/08/2020-23:03:01",
                    "content": "This governance poll has now passed and will be included in tomorrow’s (Friday’s) executive vote! https://vote.makerdao.com/polling-proposal/qmneswmjkygu4akcns68hbmk2l6jgppbqszt2jnlk7tdgy ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#32",
                    "likes": "4",
                    "time": "18/08/2020-20:07:45",
                    "content": "This proposal has now passed the latest executive and been implemented. Thank you to everyone who helped make this possible including those who participated in the discussion, polling, and MKR voting! Shoutout to the smart contract team for their work as well. See you on the next one! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "• 3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 5.892857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#33",
                    "likes": "0",
                    "time": "25/08/2020-20:07:49",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2516"
}