{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/a-message-to-maker-cp-eric-and-teej/17153",
            "title": "A Message to Maker - CP, Eric, and Teej ",
            "index": 17153,
            "category": [
                "Discontinued Categories",
                "Real World Finance"
            ],
            "tags": [
                "rwf-0x",
                "archive-rwf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#1",
                    "likes": "22",
                    "time": "10/08/2022-15:26:15",
                    "content": "Past Hey folks, teej here. I hope that everyone is having a beautiful week despite the backdrop, within and without Maker. Hopefully after Friday’s theater of war, you’ve taken the weekend to unplug, touch grass, hang with loved ones, and relax a bit. Perhaps you’ve picked up The Metaverse by Matthew Ball or The Network State by Balaji. Or maybe, if you’re a finance turbo like me, you’re housing the Economist. With this rejuvenation, we should all be prepared to deal, head on and honestly, with the issue at hand. I’ll kick off the healing: I’d like to personally apologize on behalf of the 0x team for our insensitive comments toward stakeholders. Building a system, de novo, without a playbook, constrained resources, an adversarial public forum, and a small team is stressful. When people are in pressurized and high-stakes situations, in an effort to feel ok, they’ll create cohesion by poking fun and criticizing outgroups. In the heat of a moment, whether it’s with family, friends, or business, we can say things we regret. And we did just that. I hope that it was obvious, as per the content (and context!) of the comments, that we were honestly just trying to protect Maker holders (to whom we have a duty) from what we thought were ill-suited commercial arrangements. As the commercial sentries of an amateur lender in a fiercely professional space, we were maybe overly cynical and protective. This cynicism tainted our camaraderie which bled into our communications. Live and learn. We will do just that. With that out of the way, our small team has taken RWAs from a sideshow to core protocol collateral. Prior to 2022, when we really got started, the aggregate RWA debt ceiling was 59MM DAI. As of today it is 189MM DAI, a > 3x increase. Whereas once it was normal for RWA vaults to be capped at 2MM, the protocol now boasts a vault with a 100MM current debt ceiling with plans to scale to 1B. Due to professionalization, rigor, thought, and strategy, Maker is now competing, on level footing, with professional structured credit managers. We need only look to the capstones of the past year, HVB and SocGen, to internalize the impact of what’s been achieved. Present While the situation at RWF must be addressed in short order, what is actually of paramount importance is ensuring business continuity. Neither our existing vaults nor newly onboarded vaults are “set-it-and-forget it” structures just yet. They require maintenance. Business continuity is the mark of a professional organization that deserves a seat at the table. Business continuity means continuing to monitor Maker’s existing RWA exposures (especially as markets erode), continuing to communicate with existing vault holders, safely integrating and monitoring HVB’s varied assets (the 4 DAI deliveries have not yet arrived at the Trust nor have the on-chain or on-forum reporting standards been executed), providing feedback and advice to prospective institutions like Blocktower and Anchorage, etc. Surveillance of vaults, communication with vault operators, commercial integrations of new deals, and management of prospective MIPs have always been managed by Eric, CP, and myself. MakerDAO leads the RWA space via a unique superpower, sovereign currency issuance and a flexible crypto-native balance sheet. In other words, we can deploy capital to galvanize the change we’d like to see in the world. If the protocol were committed to a broader mission than profit, say clean money, we now have the underwriting machinery required to onboard green assets with commercial reasonability. Again, to the best of our ability, we’ve built the RWA bedrock with the protection, rights, and remedies of MKR holders in mind. So, as the DAO figures out what its North Star is, the new pipes can be laid in a way that optimizes for it. Given Maker’s reliance on demand for crypto leverage and its existential exposure to USDC, RWAs are essential to MakerDAO’s success, in one form or another. Upon the reputational and financial foundation erected by successfully onboarding HVB and SocGen, Maker has earned itself an enormous opportunity. All of the confusion, brain damage, time, and money invested into building out the RWA platform pales in comparison to the portal that has just opened. By mere continuance, in terms of strategy and personnel, Maker widens its comparative advantage and ushers in a golden age for RWAs on-chain. Future The active MIP-6 proposal by Blocktower and the imminent (should be ready to go within a few weeks!) proposal by Anchorage exemplify the opportunities on the frontier. Anecdotally, the flood gates of high quality asset originators have been washed open. Since HVB closed, Eric, Christian, and I have been having daily calls with impressive originators across the gamut—$100B institutional real estate funds, innovative EM credit platforms, hash-power backed lenders, energy derivative protocols, and many more. Whether we want green collateral, short-term collateral, hyper-liquid collateral, digitally-native collateral, it’s all out there waiting for DAI. For RWAs, what was once an adverse selection problem is now an issue of limited resources to triage the deluge of deals. With a large RWA collateral engineering team, a growth team savvy with RWAs, and an RWF-0x team that has worked symbiotically with those groups for many months, this cluster is primed to drive innovation in the RWA space. Maker is in an enviable position to catapult itself to new heights. Oddly, the commercial deal team that helped to bring about this bright future has been left in limbo. We hope that, based on the chronology of events, it is obvious that our terminations were vindictive and unfair. As the community perseveres through this turbulence, we ask that folks be honest, moral, and to do the right thing. Not just for Christian, Eric, and myself but for posterity. If this team leaves, which is Maker’s prerogative, Maker will lose the significant, embedded network effect that this group is a vessel for. Christian, Eric, and myself have managed entirely the relationships with existing vault operators, such as New Silver, recently onboarded vault operators such as HVB and SocGen, as well as all new business, like Blocktower and Anchorage. To lose this progress would be devastating and firmly reduce Maker’s optionality vis a vis RWAs. To be abundantly clear: if RWAs are, in any way, shape or form a pillar of Maker’s future, the DAO will need a commercially literate team to help it navigate. Absent excellent reasoning, rather than building a team from scratch, Maker should double-down on those who’ve lived and breathed within it for the last year. We have pioneered legal, commercial, and governance structures that, as they evolve, can enable private credit origination at scale without reliance on key personnel. However, as the long-term vision of a more automated and permissionless lending module crystallizes, onboarding RWAs today is still a human and business matter, not an engineering one. As we embed each new RWA with progressively more trust-minimization and transparency, the DAOs RWA-facing tooling improves. Eventually Maker will have an out-of-the-box credit origination, structuring, and monitoring system that can be utilized invariant of ultimate product or governance structure. If Maker token holders decide to usher in a series of RWA MetaDAOs, for example, which compete for resources, the DAO will still, always, need a last line of defense. Greener Pastures We (CP, Eric, Teej) decided to take a few days to reflect on what’s happened. We wanted to provide reconciliation and a post-mortem after an acrimonious few days. And we have decided to keep pushing, as we always have, for a rosy future of RWAs in crypto but especially at Maker. We do not wish to dwell on the past, but rather to minimize damage and secure the future. We have no desire to engage in mud-slinging nor drama. We are all human beings and are doing the best we can. RWF-0x is ready to reconstruct, re-engage, and build towards the next era. Ultimately, even if MKR holders prefer to remove us from the workforce, we still believe in our push for doing RWAs the right way and we will still love this place. We’ve served token holders to the best of our ability. And until we are decidedly, and with due process, removed from DAO, we intend to keep serving. Whatever the future of RWAs, as determined by our token holders, RWF-0x is committed to defending and executing that vision. Thankfully, from our seats at MakerDAO, activity—mind share, talent, money, respect—within our corner of crypto is exploding right now. Whether it is at Maker or another protocol building in the space, rest assured that we will continue working tirelessly to bring the on-chain RWA market to fruition. It is our domain of expertise and we are committed to it long-term. Whichever way this next episode plays out, we truly cherish the time we’ve spent building here alongside our colleagues. We look forward to many more years of collaboration with MakerDAO, Maker token holders, delegates, Rune, asset originators who we’ve forged meaningful relationships with, and the amazing CUs. Sincerely, @teej “What makes an organization great is not the ability to avoid mistakes, but what it does when they inevitably occur. How fast it gets up, dusts itself off and comes back stronger, leaner and with renewed purpose and poise.\" - @rspa ”RWF is an inevitable part of making blockchain and MakerDAO relevant to the world as we know it. Removing RWF honestly tells me that you are against what the DAO believes in and where it wants to go, as it has been stated that this is the goal for a long time.” - @gwintery ”This industry is filled with pioneers taking on untold personal risks with little to no guidance and meager pay… all sacrifices we make to be part of building a better future.” - @aburban90 “Time makes more converts than reason.” - Thomas Paine ",
                    "links": [
                        "https://forum.makerdao.com/t/the-case-for-clean-money/10684",
                        "https://cointelegraph.com/news/circle-freezes-blacklisted-tornado-cash-smart-contract-addresses",
                        "https://forum.makerdao.com/t/mip39c2-sp34-creating-rwf0x-from-a-split-of-rwf-001/16967/12",
                        "https://twitter.com/Lempheter/status/1556795398697746432",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/10",
                        "https://forum.makerdao.com/t/signal-request-mkr-pro-rata-vesting-community-sentiment-poll/17350/15",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-04-10-de-agosto-del-2022/17250"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6777612330198535
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "4",
                    "time": "10/08/2022-16:02:59",
                    "content": "Writing as a concerned community member, not ISCU     teej:  We do not wish to dwell on the past, but rather to minimize damage and secure the future. We have no desire to engage in mud-slinging nor drama.   Wonderful to hear, but you need to follow through on that promise by making the requested funding for RWF-0x independent of RWF-001. As it is, if RWF-0x is approved then RWF-001 will be crippled. Make the funding independent! It’s not like the DAO cannot afford more RWF CUs. RWF is a profit center. If you leave things as they are, threatening to cripple RWF-001, then I advocate Recognized Delegates to vote No on RWF-0x for that reason. Don’t interfere with @williamr’s efforts to re-staff his CU. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.96875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MungoBlakey",
                    "index": "#3",
                    "likes": "0",
                    "time": "10/08/2022-19:10:41",
                    "content": "Thanks for all your hard work on RWAs! One small step for Maker, one giant step for DeFi  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.481770833333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "08/11/2022-19:11:07",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}