{
    "poll_list": [
        {
            "title": "Short Ratification Poll for SPF ETHAmsterdam Event (MIP55c3-SP3) - March 28, 2022",
            "index": "13781",
            "option": "Yes",
            "supporting_mkr": "73,856",
            "highest_fraction": 0.7
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip55c3-sp3-ethamsterdam-event-spf/13781",
            "title": "MIP55c3-SP3: ETHAmsterdam Event SPF ",
            "index": 13781,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "rfc",
                "mips",
                "weekly-cycle",
                "spf",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#1",
                    "likes": "6",
                    "time": "09/03/2022-15:36:23",
                    "content": " MIP55c3-SP3: ETHAmsterdam Event SPF  Preamble MIP55c3-SP#: 3 Author(s): Jon Perry Contributors: @PonJerry, @hexonaut, @Saint.Burban, @juan, @Nadia Tags: spf Status: Accepted Date Applied: 2022-03-09 Date Ratified: 2022-03-31 Amount Requested: 50,000 DAI Recipient Address: Multisig address will be added after successful on-chain vote prior to the executive vote. Forum URL: https://forum.makerdao.com/t/mip55c3-sp3-ethamsterdam-event-spf/13781 Ratification Poll URL: https://v2.vote.makerdao.com/polling/Qmb9brx3#poll-detail   Sentence Summary The purpose of this sub proposal is to allocate 50,000 DAI for the MakerDAO event in Amsterdam scheduled between April 20-24, 2022.  Motivation  Putting MakerDAO back in the European Scene Recently, MakerDAO hosted an event at the ETHDenver conference called DAIvinity. Due to its overwhelming success and response from the Maker Community we believe that it would be good to host another event during ETHAmsterdam.  Making it a Habit In parallel to this SPF a Core Unit proposal has been put forth on the forum for feedback (see MIP39c2-SP32). EVENTS-001 has been proposed based on discussion with the Maker community to provide a permanent budget and ongoing hosting of MakerDAO events.  Time Constraints Due to the time constraint imposed by MakerDAO’s current governance cycle to be able to get the funding in time for ETHAmsterdam, this SPF has been created to partially fund the event. The remainder of funds will be coming directly from participating Core Units.  Special Purpose Fund Name ETHAmsterdam Event SPF  Special Purpose Fund Scope & Work Credentials  Fund Scope This SPF will partially cover costs for the ETHAmsterdam MakerDAO event, which has been allocated a budget of 80,000 DAI. This is based on the “minor” event sub-budget in the Core Unit proposal with the addition of FTE compensation.  Due to time constraints, 50,000 DAI is being requested through this SPF with the balance coming directly from participating Core Units. The funding breakdown gives the scope of how the funds will be used. Funds from this SPF will be spent between March 1, 2022 and May 8, 2022. Any unused funds will be returned to the surplus buffer.  Work Credentials The team who organized the ETHDenver event (John Legg & Jon Perry) would return to their roles to plan and execute the ETHAmsterdam event.  Funding Breakdown The following is a summary of the event budget outlining how the funds will be used:      Dai     Travel (2 FTE & 2 Contractors) $5,200   Accommodations/Food (2 FTE & 2 Contractors) $6,200   Set Dress (Venue Branding, DJ Equitment Rental, Lighting Rental, Visual Renderfarm, Plugins/Software) $2,000   Labor (2 FTE & 2 Contractors) $42,400   Venue/Hospitality $17,000   Music & Photography $2,800   Misc (Shipping, COVID Tests, Onsite Tools/Equipment, Overhead, Contingency) $4,400       Event Total $80,000    Due to time constraints, 50,000 DAI is being requested through this SPF with the balance coming directly from participating Core Units.  Multisig Wallet The multisig for the funds will be 2:3 with @juan/@hexonaut/@Nadia and will be set up after the successful on-chain vote, prior to the executive vote.  Special Purpose Fund Details Official Contact or Group Name: Jon Perry Contact Email/Handle: [email protected] Date Added: (2022-03-09) Total Amount: 50,000 DAI Wallet Address: Multisig address will be added after successful on-chain vote prior to the executive vote. Comptroller signers: @juan, @hexonaut, @nadia  ",
                    "links": [
                        "https://newsletter.banklesshq.com/p/8-things-you-missed-at-ethdenver-ab5",
                        "https://forum.makerdao.com/t/mip39c2-sp32-adding-events-core-unit-events-001/13780/14",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-28-de-marzo-de-2022/14308",
                        "https://forum.makerdao.com/t/weekly-mips-update-79-pinata/14106",
                        "https://forum.makerdao.com/t/weekly-mips-update-78/13903",
                        "https://forum.makerdao.com/t/mip39c2-sp32-adding-events-core-unit-events-001/13780/12",
                        "https://forum.makerdao.com/t/governance-and-risk-184-thursday-march-31-17-00-utc/14314/2",
                        "https://forum.makerdao.com/t/monthly-governance-review-march-2022/14428",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/57",
                        "https://forum.makerdao.com/t/mip39c2-sp32-adding-events-core-unit-events-001/13780/45",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/47"
                    ],
                    "GPT-summary": "The post is a proposal for the allocation of 50,000 DAI for the MakerDAO event in Amsterdam, scheduled between April 20-24, 2022. The proposal explains the purpose, motivation, time constraints, funding breakdown, and work credentials for the event. The post also provides details on the multisig wallet and the special purpose fund. The post does not contain any negative feedback or constructive criticism of the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.523809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "1",
                    "time": "09/03/2022-16:14:21",
                    "content": "Hello @PonJerry ! Nice to meet you on the digital side  Looks like we’ll still need the multisig details for this to be a compliant MIP55 (SPF) application. As stated in MIP55: A SPF must contain one Point of Contact (from the SPF receiver) and a minimum of two Comptrollers. Comptrollers execute payouts to final recipients based on the completion of milestones stated in the SPF Scope. Please let me know if you are having difficulty sourcing these Comptrollers and I’m happy to recommend some people to reach out to. Likewise if you are reading this message and a facilitator please consider volunteering! And if you are reading but not a facilitator and still would like to help, consider asking a facilitator if they would recommend you for the spot. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TravinImmunefi",
                    "index": "#3",
                    "likes": "2",
                    "time": "09/03/2022-17:49:59",
                    "content": "I recommend @psychonaut, Deputy Facilitator of IS-001, as comptroller. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#4",
                    "likes": "2",
                    "time": "10/03/2022-17:45:33",
                    "content": "Hi @prose11 thank you for raising those issues. The comptrollers will be @juan, @hexonaut & @Nadia .  They will set up a 2/3 multisig for the funds.  I have amended the SPF. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#6",
                    "likes": "7",
                    "time": "10/03/2022-21:05:30",
                    "content": "Here is a comparison of DAIvinity and ETH Amsterdam.  This is based on DAIvinity being replicated by the existing team.  I have modified the actuals of DAIvinity to a “real” labour cost based on the FTE compensation in the Events CU DAI budget.  I did this because as highlighted in a events CU proposal post, the team labour cost for DAIvinity did not reflect the true work involved.  You can refer to a more clear explanation here. .  The ETH Amsterdam event has corrected this issue by compensating FTEs and contractors based on the rates proposed in the Events CU DAI budget. Another area that has been pro-rated is set dress.  The team has the advantage to use resources available to them at their current employers which had the advantage of being offered free of charge to Maker.  This would not be the case moving forward with other events.  In the interests of a good 1 to 1 comparison, I have added cost to these two areas from the actual paid out by MakerDAO. The strategy of the ETH Amsterdam event is to scale it down and reuse visual animations and physical material from the DAIvinity event.  This gives us the advantage of saving on a set dress.  The DJ for the event will be a more local DJ rather than the international DJs which were brought in for ETH Denver One thing I will note in regards to the portion of your comment “cost to replicate”,  this comparison is both events done by the current team who is not running a for-profit events company.  We get compensation but do not charge markup and also have the advantage of accomplishing this branding/visuals without using external contractors.  In both of these areas, you would see an increase in the “cost to replicate” DAIvinity if an events company was used.     Category Actual Amount DAIvinity (DAI) 1000 Attendees ETH Amsterdam ETH Amsterdam 350 person capacity     Travel (5 People) $5,471.98 Travel (2 FTE & 2 Contractors) $5,200   Accommodations/Food (5 People) $3,858.85 Accommodations/Food (2 FTE & 2 Contractors) $6,200   Set Dress (Venue Branding, LED Logos/Installations, DJ Equitment Rental, Lighting Rental, New Visual 3D & 2D Stock, Visual Renderfarm, Plugins/Software, Added $5000 from DAIvinity costs for free materials, Tools & facilities provided by contractors) $17,026.71 Set Dress (Venue Branding, DJ Equitment Rental, Lighting Rental, Visual Renderfarm, Plugins/Software) $2,000   Labor (Event Manager, Engineer, Visual Artist, 2 Contractors), Pro Rate for Actual Labour based on Events MIP Budget  $88,250.00 Labor (2 FTE & 2 Contractors) $42,400   Venue/Hospitality $26,450.86 Venue/Hospitality $17,000   Music/Photography/Videography $15,000.00 Music & Photography $2,800   Misc (Shipping, COVID Tests, Onsite Tools/Equipment, Overhead $5,530.00 Misc (Shipping, COVID Tests, Onsite Tools/Equipment, Overhead, Contingency) $4400   Total $156,057.54 Total $80,000    I hope this addresses your question. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.593668163112607
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#7",
                    "likes": "2",
                    "time": "23/03/2022-16:37:21",
                    "content": "    MIP55c3 Subproposal Template:  “Comptroller signers: Include links to public statements verifying an individuals’ involvement as a Comptroller”   @juan, @hexonaut, @nadia, can I get your public confirmations as replies here? Thank you  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#8",
                    "likes": "6",
                    "time": "23/03/2022-17:18:56",
                    "content": "I hereby confirm my participation as a Comptroller. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#9",
                    "likes": "5",
                    "time": "23/03/2022-19:33:02",
                    "content": "I hereby confirm my participation as a Comptroller. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#10",
                    "likes": "6",
                    "time": "23/03/2022-20:06:32",
                    "content": "I confirm my participation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#11",
                    "likes": "4",
                    "time": "27/03/2022-03:20:50",
                    "content": "Maybe this is a dumb question, but what is the reason to spend this kind of money on a party?  Who will attend? Crypto bros or actual business partners? What information are we collecting on those who attend? Email? Phone? Organization? Title? Does attendance include any obligation to Maker? A follow up phone call, subscribing to an email list, or even paying something at the door? Will there be some way for VIPs (job candidates, prospective business partners, politically important individuals) to be given the appropriate level of direct engagement?  I guess my question is whether this serves an actual business purpose or is it just a way for some people to get drunk and party? And please do NOT say “brand awareness” because it’s a crypto conference. Everyone there has already heard of Maker and doesn’t need us to buy them a drink. Right now it sounds kinda like a kickback to people already rich enough to go to Amsterdam. I admit I’m one of them who will definitely go if it happens, but I think it needs to be clear that there’s an actual focused reason for doing this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.530612244897959
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#12",
                    "likes": "4",
                    "time": "27/03/2022-16:24:54",
                    "content": "You’re probably not going to like this answer, but it is all about brand awareness. Frankly this is the basics of how to run a business. Coca cola pays for advertising not because people don’t know who they are, but because it gives people this hard to describe positive association with the brand. Throwing these events is precisely this type of association we are creating. If you are looking for direct results I think you are missing the big picture. Having zero spend on branding is insane, and no other business does this. Are we unique? Or perhaps let’s go with what works. Regarding kickbacks, it is a huge amount of work to throw these events and there are a bunch of other places to go if this was some cynical operation. Appreciate the feedback, but I vehemently disagree with the implication. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.728377525252525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#13",
                    "likes": "6",
                    "time": "27/03/2022-16:56:17",
                    "content": "If we are indeed looking for brand awareness, we can spend a fraction on sponsoring ETHAmsterdam and its bounties, which will cost less than 20k. But instead we are going to spend 3-4x on party because this kind of party creates more positive association with the brand than supporting the ecosystem directly? I am personally fine with Maker community hosting some events but “brand awareness” shouldn’t be an excuse to throw parities at every event. If there are better alternatives, the community should reconsider better options.  image1257×761 127 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.542929292929292
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#14",
                    "likes": "0",
                    "time": "27/03/2022-17:01:25",
                    "content": "Why not both? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#15",
                    "likes": "1",
                    "time": "27/03/2022-17:05:59",
                    "content": "Aren’t you saying Maker should raise money? That means any extra dollar spent is one that has to be sourced from debt or dilution. I don’t have a lot of MKR, but I don’t want to be diluted to pay for parties ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#16",
                    "likes": "1",
                    "time": "27/03/2022-17:10:52",
                    "content": "Maybe it’s both but if you are asking why not Maker pay all for events and marketing. Just like even Coca Cola doesn’t sponsor all advertisement and events, Maker protocol should be cautious about its spending. $80-100k usually can afford one full time non tech role or part time tech role. So if we decide to throw many of these, we should consider opportunity cost of not might be able to fund such roles ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#17",
                    "likes": "2",
                    "time": "27/03/2022-17:19:56",
                    "content": "Ya sorry, but I disagree with this zero sum thinking. We need to grow to get more revenue, and we grow by doing this kind of stuff. The spend is not super high imo <1% of recurring revenues. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None"
                    ],
                    "Sentiment": 5.593333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#18",
                    "likes": "0",
                    "time": "27/03/2022-17:26:31",
                    "content": "It’s a party. Where we are not even capturing emails or names? I hope we are! Do we have a list of who went to the last one? Maker is not a consumer facing business. Perhaps instead of being open to the public it can be just for possible job candidates and possible borrowers? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#19",
                    "likes": "2",
                    "time": "27/03/2022-17:27:12",
                    "content": "Btw I think this discussion is better suited for the events CU thread. We’ve already booked the event for Amsterdam as it had to be done in advance. By denying this particular proposal it will end up wasting 30k in existing deposits. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#20",
                    "likes": "1",
                    "time": "27/03/2022-17:27:46",
                    "content": "Whose deposits? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#21",
                    "likes": "1",
                    "time": "27/03/2022-17:28:24",
                    "content": "3 core units have pitched to cover the remaining amount. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#22",
                    "likes": "0",
                    "time": "27/03/2022-17:28:54",
                    "content": "Then why do we need this fund? If core units are already willing to pay for it from existing budgets? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#23",
                    "likes": "0",
                    "time": "27/03/2022-17:29:52",
                    "content": "50k from the SPF. 30k from core units. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#24",
                    "likes": "2",
                    "time": "27/03/2022-17:30:56",
                    "content": "To clarify, I am not against this event per se (also the post was up earlier this month and challenging at the end of month is quite late). Just wanted to point out there were other alternatives. And in the future, the community should consider some options. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.074999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#25",
                    "likes": "0",
                    "time": "27/03/2022-17:32:16",
                    "content": "So “you have to approve this money because we already spent 30k on it and sunk cost fallacy?” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#26",
                    "likes": "1",
                    "time": "27/03/2022-17:32:59",
                    "content": "Agree with doing these other things you suggested. I’m in Boston right now with the other teams doing hiring and running a booth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.059523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#27",
                    "likes": "0",
                    "time": "27/03/2022-17:35:12",
                    "content": "Just providing info. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#29",
                    "likes": "0",
                    "time": "27/03/2022-17:38:54",
                    "content": "Growth, Governance, Immunifi and CES. 4 actually. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#31",
                    "likes": "1",
                    "time": "27/03/2022-17:42:00",
                    "content": "Because we have to move faster than governance sometimes for modest spends to get things done. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#32",
                    "likes": "4",
                    "time": "27/03/2022-18:05:47",
                    "content": "Won’t presume to know the reasoning from the other CUs, but happy to offer some insight from GovAlpha. We put travel as a budget line in our Q1 budget and more accurately described it as travel and events in the budget that is currently up for vote. Seeing as we haven’t used the Q1 travel funds, and this is the type of thing we expected to fund on occasion in our current budget request, we felt quite comfortable committing the funds. We do no currently have a marketing or events CU despite the demonstrated need to market both the protocol and the DAO itself. GovAlpha does not claim to know what the best marketing strategy is for the DAO. When Growth and Sam asked for CUs to support this effort  (after putting on a successful event in ETHDenver) we were happy to pitch into the event, noting that we will benefit from it, both from being able to attend and network, as well as from the PR it creates. The decision to fund this SPF is the DAO’s, and we will not support or oppose the proposal. However given the need to make deposits so this event could happen if the DAO funds it, we were happy to commit our funds that had already been earmarked for like spending. If this SPF fails, I have no doubt the people who found this a good use of funds will make the best of the situation, though I would expect some losses from non-refundable deposits to occur. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 7.036764705882352
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#33",
                    "likes": "3",
                    "time": "27/03/2022-18:43:20",
                    "content": "I find how this has been handled so disappointing. I hope next time random core units are not asked by their colleagues for funding for a party that needs additional unapproved funds. I appreciate you’re trying to make a positive association with Maker’s image, but this has really shaken my faith in a lot of members I’ve respected from afar for months now. My little bit of MKR will be voting no on this and I hope others do the same. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.385551948051948
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#34",
                    "likes": "3",
                    "time": "27/03/2022-20:29:24",
                    "content": "    PaperImperium:  Does this mean there’s specific goals for this event that serves those CUs?   We trust @hexonaut’s judgment. The 10k DAI we sent fit within our monthly contingency buffer. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.145833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#35",
                    "likes": "5",
                    "time": "27/03/2022-21:14:30",
                    "content": "Maybe instead of arguing about whether to have this party approved at all, we can focus on how to best make use of it? Some of the questions Alice had seem like they would be super easy to implement (like getting the names and contact info of attendees), and easy to measure afterwards. Then we could treat this like a cheap marketing experiment instead of just an expensive party. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#36",
                    "likes": "5",
                    "time": "27/03/2022-23:08:36",
                    "content": "I am less than thrilled by the way this proposal has been handled. If this is a thing that falls fully under CU finding then that is fine and should be within CU autonomy, but any additional request should have a process free from entanglements and sunk costs. CUs putting down funds first and then using that as leverage to gain additional funding undermines the real decision point. Throwing good money after bad should not be our modus operandi. I will also echo concern others have voiced as to the utility and value of participating in this without a clear marketing plan or objectives in place. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.822222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#37",
                    "likes": "1",
                    "time": "27/03/2022-23:36:52",
                    "content": "Appreciate the feedback. What do you think we should do differently next time when we need to make decisions, it’s outside of any CUs mandate and the governance process will take too long? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.916666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#38",
                    "likes": "0",
                    "time": "28/03/2022-00:10:00",
                    "content": "I don’t understand how this could possibly be something that requires cutting corners on getting approval. The worst that happens is it is the next big conference for an event instead of this one. If people are willing to bypass standard governing processes just for a party, then what do we do for something that could be a small danger to the protocol? Who is the target audience for this event? What do we want from them? Why was this so important to go ask technical core units like Immunefi and Collateral Engineers to contribute? I’m sure it wasn’t the intention, but a respected colleague goes to them and says “we need this” and they found money based on that. Surely we can see how we need to avoid that happening again. But it is clear that there is no actual purpose for this event. Marketing strategy should drive type and size of spend. There does not appear to be any strategy, so there is not a clear need for this type or size of spend. If it’s so important, table this request to make sure the money is spent well, with clear goals. There is no shortage of Eth conferences to do another one at ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.197368421052632
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#39",
                    "likes": "1",
                    "time": "28/03/2022-02:42:57",
                    "content": "I have a basic question on these. Why is Maker, when holding parties (which should be considered as PR events) not seeking out partners to share expenses in exchange for a PR presence at our own events?  I mean heck everyone likes a good party, and many players want to have the ‘best’ party.  Wouldn’t it make sense both from a growth, awareness, and expense point of view to not just have a Maker party but Maker/Nexo/Celcius/whatever/whomever else party to save on costs, and be a generally bigger PR event for the players? Why would Maker not talk to folks like Celcius, Nexo, and whomever to give them space at our events in exchange for helping us cover expenses and/or make a bigger party for less cost to Maker? This is my biggest beef with these Event expenditures and the same goes for Maker swag.   Wouldn’t it make sense to put up space at our own events and swag space as advertising space to anyone who will buy it?    Make Maker Events not just for MakerDAO but for as many partners and advertisers as we can bring in (within reason, and within MakerDAO mandate). My point, and I have been saying this for a long time is that CUs really need to think out of the box and start deriving some revenues from outside sources in creative ways that both leverages MakerDAO brand with other growing parties so we help create a network and brand as well as save on CU expense budgets. I have this vision in my head of the biggest race cars with all these stickers of companies that are supporting the team with financing all over the car as advertising, why not think of Maker the same way? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.887731481481482
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#40",
                    "likes": "3",
                    "time": "28/03/2022-03:29:30",
                    "content": "Partnerships for events are always preferred from our point of view. This Amsterdam event only came to fruition shortly after DAIvinity in Denver. Which has left us with only about 7 weeks to plan. We did discuss a partnership in the beginning but due to the tight timeline, arranging and coordinating any branding content with said partnership was not best suited for this timeline. We didn’t want to jeopardize relationships with partners if their needs/wishes weren’t adequately met due to the short timeline. Partnerships and cost splitting will be a large focus moving forward, with our proposed CU we would be able to plan far enough ahead to secure, coordinate and commit to event partnerships. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2063492063492065
                },
                {
                    "author_link": "https://forum.makerdao.com/u/autobot98765",
                    "index": "#41",
                    "likes": "4",
                    "time": "29/03/2022-11:12:25",
                    "content": "Everyone here doesn’t understand the problem. The root of the problem is that these “contributors” don’t even have skin in the game to be tied to Maker’s success. They are just happy to spend some DAI (that would otherwise have gone to Maker holders) and have some fun in the name of Core Unit funding. Who cares if it’s $80k or $150k? Maker bagholders are paying rofl ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal.",
                        "3rd party giving constructive criticism of proposal.",
                        "3rd party asking questions about proposal."
                    ],
                    "Sentiment": 6.799999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#42",
                    "likes": "6",
                    "time": "29/03/2022-11:59:25",
                    "content": "    autobot98765:  Everyone here doesn’t understand the problem. The root of the problem is that these “contributors” don’t even have skin in the game to be tied to Maker’s success.   Not part of any Core Unit, so can post without much bias. Frankly, I think this is not even the slightest bit true, and actually quite opposite. I would say that working as a contributor to a core unit, even if the core unit doesn’t have Maker token rewards (which most have), is the most ‘skin in the game’ you can have. These people are offering a part of their carreer to work for the DAO. For the rest of their carreer they will be asked about this period. A Maker bagholder can voice their opinion by selling the MKR (or buying more of course). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Dairyman",
                    "index": "#43",
                    "likes": "2",
                    "time": "29/03/2022-15:35:22",
                    "content": "Wait a minute. Is the following correct? A bunch of core units take money from their budgets and put it towards a party after being asked to by a dev. This party has not been approved yet. The people being paid to run this party are friends of the dev who asked for the 30 000 before approval. This party is open to the public and not just token holders? Please tell me this isn’t what is happening here. I’m sure it will pass because all the delegates probably get to go to Amsterdam and want to go to this party along with everyone else ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#44",
                    "likes": "1",
                    "time": "29/03/2022-18:36:51",
                    "content": "To clarify, I am not going to Amsterdam and I don’t think most delegates are going either. Also, restricting events to only MKR holders would defeat the purpose (like you don’t need AAVE or SOL to go to their events). But in terms of the process, I do think the protocol should clarify what’s allowed and not. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#45",
                    "likes": "10",
                    "time": "29/03/2022-21:00:27",
                    "content": "The CES CU contributed 10k Dai to this event and I’m happy to share my intentions at the time I made the decision. At ETH Denver, there was an intention for an offsite meeting with CUs, Delegates and other stakeholders. I had planned to travel and participate in that and other associated events. I was also hiring three positions on my team so this was also recruiting event for me. In the past, I would rely on other groups within my organization to provide the air coverage to build buzz and hopefully attract some folks to ask about Maker, what we do, and open positions. Based upon ETH Denver, the party appeared to provide a lot of visibility for Maker. Given the same organizers were putting on this event, I was hopeful the same would be created at ETH Am. Without the support of a Marketing or People/Talent/HR group, it is damn tough to attract talent into this ecosystem. I am also a believer if that I “use” something, I should pay for it. Being a “user” of ETH Am, this seemed like a good investment especially since recruitment fees alone would make the 10k Dai a very good use of funds. On a side note, I’ve done a fair amount of event planning and getting money upfront is needed to reserve the venue, etc. and the rest can be paid later hence the structure of this MIP. Yes, things have changed since I made that decision and I do not plan to attend ETH Am. I still support the event since I will get indirect benefits without being physically present. While I am happy to answer to the community on my decision, it’s super important we focus and place our energy on the core issue…we have very little Marketing and we need to fix that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.890972222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#46",
                    "likes": "3",
                    "time": "30/03/2022-16:58:33",
                    "content": "My reading confirms this to be an accurate summary of the facts. Not the way to do things. I am not going to Amsterdam and am voting no for the same reasons stated here:     MakerMan:  Why is Maker, when holding parties (which should be considered as PR events) not seeking out partners to share expenses in exchange for a PR presence at our own events? I mean heck everyone likes a good party, and many players want to have the ‘best’ party. Wouldn’t it make sense both from a growth, awareness, and expense point of view to not just have a Maker party but Maker/Nexo/Celcius/whatever/whomever else party to save on costs, and be a generally bigger PR event for the players?       JustinCase:  I am less than thrilled by the way this proposal has been handled. If this is a thing that falls fully under CU finding then that is fine and should be within CU autonomy, but any additional request should have a process free from entanglements and sunk costs. CUs putting down funds first and then using that as leverage to gain additional funding undermines the real decision point. Throwing good money after bad should not be our modus operandi. I will also echo concern others have voiced as to the utility and value of participating in this without a clear marketing plan or objectives in place.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.038807189542483
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#47",
                    "likes": "5",
                    "time": "30/03/2022-17:32:00",
                    "content": "Sorry to hear that you are not attending Kianga, but respectfully this should not be a reason to vote against a branding initiative for people outside Maker. Would like to re-iterate a few points as they seem to be getting lost:  Costs are already sunk to the tune of 30k. It was either we did this or we had no event in Amsterdam which is turning out to be a large conference. If you object to the idea overall that’s fine, but I would suggest making your opposition on the Events CU rather than this budget which would effectively waste 30k with nothing to show for it. The Events CU will be seeking partnerships to reduce costs. We have already had offers from a few other projects, but it was too short notice to include for Amsterdam. The Events CU is confident they will likely be able to half the costs per event via co-sponsorships moving forward. After the Denver event these guys were approached by many other crypto projects trying to snipe them away from us as it was nearly universal consensus this was the best event in Denver. There is a reason every major protocol is throwing events. Talking to @aburban90 in Boston this past weekend, he informed me people were still talking about the event in ETH Rio wondering when the next one was. As much as this can seem superficial, this is how this industry works, and it will lead to real opportunities in the future.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.46668956043956
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#48",
                    "likes": "5",
                    "time": "30/03/2022-17:41:00",
                    "content": "To be clear, me not attending has nothing to do with my vote. It was a comment to push back against the assertion that all delegates will vote yes because they are attending and want to enjoy a boondoggle. Apologies for the confusion! It looks like the Poll will succeed, so I am happy for all the good that will come of it. I do follow your points, but I stand by the principles articulated in the sentiments I quoted. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#49",
                    "likes": "3",
                    "time": "30/03/2022-17:43:20",
                    "content": "    ACREinvest:  To be clear, me not attending has nothing to do with my vote.   Ah okay, my mistake. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#50",
                    "likes": "5",
                    "time": "30/03/2022-18:08:42",
                    "content": "    Doo_StableLab:  If we are indeed looking for brand awareness, we can spend a fraction on sponsoring ETHAmsterdam and its bounties, which will cost less than 20k. But instead we are going to spend 3-4x on party because this kind of party creates more positive association with the brand than supporting the ecosystem directly? I am personally fine with Maker community hosting some events but “brand awareness” shouldn’t be an excuse to throw parities at every event. If there are better alternatives, the community should reconsider better options.    Here’s my argument against these “low” numbers you cite @Doo_StableLab  Maker can “invest”: $10k, $16k, $20k into hosting an event like any other protocol. Objectively… yes, their spend is half an order below ours (probably only eclipsed by AAVE)… Have you ever been to one of these events you cited? or any generic crypto event for the matter? Do you remember who hosted it? I never do. At best, it was always just another bar or cliche thing. Yes, everyone got together and mingled… but for the life of me, I can’t recall attending a single one of those events where I remember who threw it. “Oh… it was a Solana party? a Flux party?.. ” Best case scenario… they didn’t gatekeep or make attendees pay for drinks. The recent Avalanche event I attended in Harvard… the one takeaway I had… “these guys are so cheap… they’ll only cover one drink for the attendees of their mixer.” Pay cash for more. BAD IMAGE! A good case? No memory of whose event I attended. The money they spent there, cutting corners that shouldn’t be cut, is legitimately wasted. $15k for an unmemorable event is $15k down the toilet. So ya, we can follow in their footsteps. On paper, we can spend less on these things. Yes, our events are much more expensive… no doubt about that, but… the difference between what our Events CU will do, and has already done… is that MAKER events are memorable. There is not a single person that attended DAIVinity in ETH Denver, that isn’t t still going on about it TO THIS DAY. We’re gotten media attention. Bankless coincidentally invites us for an interview after two years of no contact. We’ve gained a reputation amongst the community for caring about the work we put into crafting a memorable experience. You can’t put a number on what that’s worth. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.831146284271284
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#51",
                    "likes": "4",
                    "time": "30/03/2022-18:20:16",
                    "content": "@leggevents, @PonJerry, and his crew, right now… are so dedicated to becoming a part of our community. They are absolute killers at what they do. Organized, professional… just experts at what they do They’re new to the world of crypto. They need guidance to do this right. If we label them as “greedy” or otherwise discount their value add… we risk pushing them away. We should help them succeed as part of our community. What they can put together, no one else in our space can. They already are in high demand after our last event. Pushing them out of our community, IMO, would be a terrible mistake. In a snap, they can take their skills elsewhere, to a community that values them more than we do. If we disenfranchise them… we will be the losers here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.408896103896104
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#52",
                    "likes": "11",
                    "time": "30/03/2022-19:41:20",
                    "content": "    Dairyman:  A bunch of core units take money from their budgets and put it towards a party after being asked to by a dev. This party has not been approved yet. The people being paid to run this party are friends of the dev who asked for the 30 000 before approval.   Think it’s important to provide a bit of push back here. Regardless of your feelings on this event (which should be debated freely here), it’s important to recognize how Core Units currently function within the DAO. The MKR holders vote on a budget which is then executed by the teams, hopefully with transparency into transactions and budget returns when there is a surplus. The actual things the teams are doing are rarely “approved” explicitly by Governance, instead the Core Units provide a mandate and budget objectives to allow the community to decide if they are comfortable trusting the group with the funding. So while it is important that these events get discussed in public, we must note that what has happened so far is fairly optimal from a Governance standpoint:   A group of CU members brought up a funding need that wasn’t being fulfilled by any CU directly, but fits the ethos of several mandates, and a recognized business objective.   CUs with funds earmarked either directly for this type of event or a “contingency” of unexpected expenses volunteered some of their funding to ensure the opportunity was possible.   A proposal was made to the community to fill the remaining funding gap to achieve the event.   If Core Units have to ask governance anytime they use any of their own funding there is little use having Core Units, as we would just process all requests through Governance.  It’s worth noting that how we operate is always in flux. If anyone observing this thinks they have a better process to improve how we can meet objectives as a DAO, they are encouraged to work on it and bring it forward. As GovAlpha we will uphold anything in our power that the community votes through. So far everything that has occurred with this funding is in line with what has been passed by Governance. If this SPF event is voted down then there will need to be some transparent reporting about where funds went if they are non-refundable and it will be a learning lesson for all involved. However, I want to push back against tones of anything unethical occurring here when CUs are following the restrictions that have been passed and the budgets they put forward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.87633547008547
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#53",
                    "likes": "2",
                    "time": "30/03/2022-19:54:31",
                    "content": "    prose11:  Think it’s important to provide a bit of push back here. Regardless of your feelings on this event (which should be debated freely here), it’s important to recognize how Core Units currently function within the DAO.   Push-back, constructive criticism, etc… all valid and necessary. There are standards and expectations within our DAO that would-be newcomers should familiarize themselves with.     prose11:  However, I want to push back against tones of anything unethical occurring here when CUs are following the restrictions that have been passed and the budgets they put forward.   Yup… agreed. Anyway… not looking to add much more here. Just, generally stating what I’ve said above. Help guide new talent. Don’t villainize.  Also, we should all be using Grammarly’s tone checker extension when writing on forums publicly. What we write here is immortalized in public. Let’s be mindful of our tones before posting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.6737012987013
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#54",
                    "likes": "2",
                    "time": "30/03/2022-21:52:25",
                    "content": "    aburban90:  Have you ever been to one of these events you cited? or any generic crypto event for the matter?   ? Of course, I been to them and even spoke at such events. In fact, It’s common and expected to go to main and side events during the conference because we are there to network and do business.     aburban90:  Best case scenario… they didn’t gatekeep or make attendees pay for drinks. The recent Avalanche event I attended in Harvard… the one takeaway I had… “these guys are so cheap… they’ll only cover one drink for the attendees of their mixer.” Pay cash for more. BAD IMAGE!   And yet, Avalanche is doing well contrast to what you feel so maybe not all feel like you do? And even if they do, maybe they care more than just what they felt about the event.     aburban90:  We’re gotten media attention.   Beside Bankless which the Maker protocol has been working together (what do you mean no contact of two years? Literally we been operating blog collaboration with them) even before the event. Can you point to articles that talk about Maker’s event in Denver? I feel for such strong statements require strong evidence. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.481944444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#55",
                    "likes": "3",
                    "time": "30/03/2022-21:54:15",
                    "content": "    aburban90:  They’re new to the world of crypto. They need guidance to do this right. If we label them as “greedy” or otherwise discount their value add… we risk pushing them away. We should help them succeed as part of our community.   Now this part I agree. We should examine proposals carefully but shouldn’t assume they are here in malicious intent. So apology if I came off that way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.536796536796537
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#56",
                    "likes": "1",
                    "time": "30/03/2022-22:40:45",
                    "content": "    aburban90:  You can’t put a number on what that’s worth.   Yo ho! I can indeed, and it be a very round number. Much like an egg  Mayhaps ye disagree, but I be seein’ very simple suggestions in this here thread like getting the names of swabbies that go into the tavern. But nary a one seems ta be adopted! I say this proposal be smelling’ worse’n a drunken sailor drinking from the head!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.393750000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#57",
                    "likes": "1",
                    "time": "31/03/2022-00:17:55",
                    "content": "That’s true. Mastercard did lie to us when they advertised that somethings are priceless. In truth, even insurance companies have to measure the price of human life for insurance payout and etc. But on more serious note, this is why the community has asked for ways to ensure we can keep in touch with the attendants. For example, it’s quite common to collect emails which then can be used to share updates and newsletters and etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.013888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#58",
                    "likes": "2",
                    "time": "31/03/2022-01:14:22",
                    "content": "    Doo_StableLab:  For example, it’s quiet common to collect emails which then can be used to share updates and newsletters and etc.   I’ve heard this point and strongly disagree with email farming or data collection. It’s a bad look for an industry built on self-sovereignty and privacy. I don’t think I’ve ever received an unsolicited email from attending another event. Appreciate you guys agreeing with staying away from bad faith accusions, and would encourage additional ideas on how to gain more benefit from these events. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.361111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#59",
                    "likes": "0",
                    "time": "31/03/2022-01:33:39",
                    "content": "Ok, I am getting newsletter emails from attending such so maybe just difference in how we view it. This one is from Solana. Also even ETHDenver sent a message asking for feedback and thoughts via emails. Is that against self-sovereignty and privacy as well? I believe it’s a way to improve the event similar to how we want to apply to ours.    image808×365 15.7 KB   image788×255 11.2 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#60",
                    "likes": "0",
                    "time": "31/03/2022-01:38:02",
                    "content": "ETH Denver doesn’t have the best track record with data privacy if you remember the controversy with signups requiring real names and such. I wouldn’t point to them as an example of good PR. I would also say conferences are a little different from side events. Honestly have you ever received an email from signing up to a side event on Eventbrite? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.6517857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#61",
                    "likes": "1",
                    "time": "31/03/2022-01:38:22",
                    "content": "On second thought, I guess it is unfair to compare party to conference so I take it back. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CYJFC",
                    "index": "#62",
                    "likes": "2",
                    "time": "31/03/2022-01:39:59",
                    "content": "Maybe it’s because I’m new (or a civics teacher who talks a lot about separation of powers and quality of governments), but this seems questionable. Who oversees spending here? Why are they not involved in this discussion at all (or are they and I don’t know who they are)? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.090909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#63",
                    "likes": "0",
                    "time": "31/03/2022-01:41:59",
                    "content": "Ok I was actually thinking the same for the ETHDenver part. In terms of side events, yes, indeed such as Republic Realm, Polygon, and Blockdaemon (but maybe it’s different because I just try to attend as many events as possible). But to be also fair, AAVE party, which is popular, don’t send out follow ups so maybe it’s more case by case ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#64",
                    "likes": "1",
                    "time": "31/03/2022-01:44:27",
                    "content": "Can you forward some examples? I still think it’s a bad idea from a PR perspective, but always curious to see what others are doing. Feel free to DM or email if you don’t want to post it here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving negative feedback on proposal"
                    ],
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#65",
                    "likes": "1",
                    "time": "31/03/2022-01:48:41",
                    "content": "Sure, for transparency     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#66",
                    "likes": "1",
                    "time": "31/03/2022-02:01:13",
                    "content": "Technically the Maker community itself oversees spending as MKR holders are the ones that ultimately vote for budgets for different Core Units and also spending on special cases. So I think it’s fair to say they are involved in this discussion already. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving information about MakerDAO community involvement in proposal"
                    ],
                    "Sentiment": 6.057142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#67",
                    "likes": "4",
                    "time": "31/03/2022-06:53:49",
                    "content": "Hi @hexonaut , I thought perhaps you would find this short interview interesting - and perhaps useful. It is a short-form of a “marketing thinking frame” I have personally found productive over the years. One could, for instance, think about the event in this context and perhaps devise experiments within it on brand building and activation - and create valuable data from these experiments to aid further decision making/improvements on how for Maker to gain value from events. Might make this particular event even more valuable for Maker. Just a thought for you.    warc.com   Les Binet on why long-term marketing matters in the age of short-termism | WARC In this exclusive interview for WARC’s annual Marketer’s Toolkit, Les Binet  – Group Head of Effectiveness at adamandeveDDB and a leading researcher on marketing effectiveness – speaks to WARC’s Anna Hamill about the practicalities of long-term brand...      ",
                    "links": [
                        "https://www.warc.com/newsandopinion/opinion/les-binet-on-why-long-term-marketing-matters-in-the-age-of-short-termism/3307"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0476190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#68",
                    "likes": "6",
                    "time": "31/03/2022-08:41:50",
                    "content": "I am late to this discussion. For this specific event (Amsterdam), given that it’s strongly supported by 100% trusted people (@hexonaut , @juan @Nadia ) I’d personally just accept it and try to make the best of out of it. I feel the discussion, as it is devoloping right now, has just the potential to turn down the enthusiasm of @hexonaut and others, and we need that for a party. For the future, I agree that the process should be improved and this means:  Having a broader discussion on if/how we want to do ‘brand creation’ and how much USD/year we are willing to invest on it. → long forum talk + vote + etc.  At the same time, give organisers (like @hexonaut in this case) quick access to the cash because sometimes things need to move fast (or fast_er_ than the bureaucracy).  In the line of discussion (1) above, we should decide who we want to target: teenagers, young people 20-30yo, 30-50, millionaires? young users? coders? content creators? hippies ??? This type of parties seem to me as oriented towards 20-30yo. And I strongly doubt it is much effective (but I might be wrong, as I am not 20-30yo anymore). I’d rather invest money on systematically making hackatons, University-campus level events, press interviews, youtube influencers, etc. I personally think (but again, I am not 20 anymore) these drink parties with alchool+music+fancy lights are quite ineffective but, more importantly, they do not build the type of image we (or, I should rather say, I’d like to) want to build. To me a 50kusd party organised by a startups screams: YOLO! Lambo! Bitconneeeeeect!, etc ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.877376818783069
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#69",
                    "likes": "3",
                    "time": "31/03/2022-13:42:41",
                    "content": "    iammeeoh:  I’d rather invest money on systematically making hackatons, University-campus level events, press interviews, youtube influencers, etc.   Completely agree. Currently this stuff is being picked up by other CUs because we don’t have enough dedicated talent. Would like to eventually expand the Events CU to include all in-person organizing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.96875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#70",
                    "likes": "1",
                    "time": "01/04/2022-20:19:14",
                    "content": "As I said before, I would prefer to invest in the creation of a marketing CU. It could organise such a party from its budget if the price/value meets the branding objectives. It is likely to be important and valuable for us to have such an event, but I think it is difficult to measure, so it would need to be validated by professionals who have experience in this. Unfortunately we are not there yet, but the current confusion in marketing strategy will certainly be sorted out soon. If we had the MCU to do this, it would be enough to discuss its budget and keep track of its achievements through various marketing events. This thread also shows that people are interested in this issue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.938311688311688
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leggevents",
                    "index": "#71",
                    "likes": "8",
                    "time": "01/04/2022-21:13:32",
                    "content": "Hey guys, thank you all for your input/support. Im excited to inform you all that the event date is April 20th in Amsterdam. We have a fantastic night planned and I hope to see you all there and meet you in person. Please follow @Daivinity on twitter for further updates! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party advertising proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.96875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#72",
                    "likes": "1",
                    "time": "04/04/2022-09:12:45",
                    "content": "On the Governance end, we’ll need the address of the Multisig and for the signers/comptrollers to confirm their listed addresses before we can put this item in an executive vote. Happy to assist if you have any questions  ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-81/14443",
                        "https://forum.makerdao.com/t/relay-semanal-28-de-marzo-4-de-abril-de-2022/14495"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#73",
                    "likes": "2",
                    "time": "04/04/2022-12:25:26",
                    "content": "Yes, @hexonaut is taking care of this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#74",
                    "likes": "3",
                    "time": "05/04/2022-13:00:48",
                    "content": "Multi-sig: Gnosis Safe @Nadia @juan and @PonJerry can confirm their addresses are present along with mine. It is a 3-of-4 multi-sig. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-relay-april-5-11-2022/14590",
                        "https://forum.makerdao.com/t/monthly-governance-review-april-2022/14986",
                        "https://forum.makerdao.com/t/relay-semanal-5-11-de-abril-de-2022/14616"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#75",
                    "likes": "1",
                    "time": "05/04/2022-13:17:16",
                    "content": "I confirm my address is one of the signers of the multisig ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#76",
                    "likes": "1",
                    "time": "05/04/2022-15:00:18",
                    "content": "I confirm my address is one of the signers of the multisig ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#77",
                    "likes": "1",
                    "time": "06/04/2022-13:48:18",
                    "content": "    hexonaut:  can confirm their addresses are present along with mine   Confirmed! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#78",
                    "likes": "10",
                    "time": "20/04/2022-10:40:11",
                    "content": "I am not in Amsterdam, but I literally got more than 10 requests to help get in to DAIvinity party. So I must admit it seems to be quite well advertised and demanded. Hope the participants have a fun and productive time  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#79",
                    "likes": "5",
                    "time": "26/04/2022-14:01:07",
                    "content": "Just want to thank everyone who attended or helped out at DAIvinity Amsterdam last week.  It was a great night and we had a lot of positive feedback.  A few minor issues came up, so we will be doing a lessons learned so we can adjust and improve even more on the next event.  See all of you at the next one!!! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.798295454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#80",
                    "likes": "2",
                    "time": "26/04/2022-14:24:25",
                    "content": "Pictures or didn’t happen.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#81",
                    "likes": "3",
                    "time": "26/04/2022-14:31:22",
                    "content": "haha,  we do have them!  Got an initial batch from the photographer a few days ago.  Been travelling so haven’t posted them yet.  Keep an eye on the DAIvinity twitter page in the coming days. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#82",
                    "likes": "0",
                    "time": "26/04/2022-15:20:53",
                    "content": "Haha, exactly. Images and videos are needed  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#83",
                    "likes": "13",
                    "time": "18/05/2022-20:07:53",
                    "content": "To close off this SPF with some financial transparency here is a breakdown of the budget vs actuals.      DAI (Budget) DAI (Actual)     Travel (2 FTE & 2 Contractors) $5,200 $4,902   Accommodations/Food (2 FTE & 2 Contractors) $6,200 $6,089   Set Dress (Venue Branding, DJ Equitment Rental, Lighting Rental, Visual Renderfarm, Plugins/Software) $2,000 $2,426   Labor (2 FTE & 2 Contractors) $42,400 $42,400   Venue/Hospitality $17,000 $19,697   Music & Photography $2,800 $2,550   Misc (Shipping, COVID Tests, Onsite Tools/Equipment, Overhead, Contingency) $4,400 $2,791        Event Total $80,000 $80,855    OMG but why $855 over!  VAT in Europe on venue fees caught us off guard.  Something we have adjusted for in the CU budget going forward. The overage will be covered out of the newly formed Events CU contingency. Onwards ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.136363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leggevents",
                    "index": "#85",
                    "likes": "1",
                    "time": "19/05/2022-11:35:27",
                    "content": "Thank you for your comments, much appreciated. The Events CU will make it a priority to be as punctual and transparent with our expenditure as possible after events. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                }
            ]
        }
    ],
    "group_index": "786"
}