{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/bounties-grants-to-improve-governance-and-mkr-protocol/2857",
            "title": "Bounties & Grants to improve governance and MKR protocol ",
            "index": 2857,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/freiza",
                    "index": "#1",
                    "likes": "4",
                    "time": "17/06/2020-01:50:30",
                    "content": "I really like the way the Urbit community is funding bounties (Grants • urbit.org), (not an Urbit plug–but for those who don’t know some early MKR contract developers were heavily influenced by Urbit’s design). There is a handsome reward for finishing tasks and clear milestones to earn the reward; and work is getting done rapidly. There is also transparency into compensation as well as who is responsible for items which is currently lacking with Maker. Some ideas for bounties/grants could be: -Vote delegation -Compensation analysis for Black Thursday (Thanks to community members for stepping up and somewhat resolving this, but we could have hired a firm to do on-chain analysis and done this more efficiently) -Even creating this bounty page like Urbit has could be a bounty in it of itself Funding ideas: -What if we could award contributors with MKR from the Multisig to start with, with cooperation from the Maker Foundation? I’m not sure if this is a taboo ask, but the war chest is quite large and my understanding is people are currently hired to do work for the Maker foundation and are compensated through the Multi-sig (correct me if I’m wrong) -As the Maker Foundation closes shop and dissolves this can seamlessly transition into a way that we compensate workers (through flop auctions if that MIP passes). ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-june-18-9am-pst-4-00-pm-utc/2814/5",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-june-18-9am-pst-4-00-pm-utc/2814/6"
                    ],
                    "GPT-summary": "The author of the post is proposing the implementation of bounties and grants to improve governance and the MKR protocol. The post explains the benefits of using bounties and grants, and suggests some ideas for potential bounties. The post also proposes funding ideas and suggests the use of MKR from the Multisig to compensate contributors. The post is also advertising the benefits of using bounties and grants and extending the proposal to the Maker community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.2492559523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "2",
                    "time": "17/06/2020-10:00:06",
                    "content": "Thank you for sharing this @freiza. Out of curiosity, is this something you’d be interested in working on within Maker? I created a very basic bounty framework in the initial version of MIP13, but it was voted down for being too simplistic. A number of people (@andytudhope, @charlesstlouis, myself) are interested in setting up some sort of bounty system. The introduction of the MIPs process provides a framework for setting up a system that allows bounties to be proposed and managed by the community, but currently I don’t believe anyone is directly working on it. We have all the pieces available to set this sort of thing up, we really just need someone to take ownership of the project and make it a reality. Assuming MIP14 passes, that could provide a way to find out if Maker Governance wants to pursue this sort of project. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.338383838383839
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "0",
                    "time": "17/06/2020-14:25:24",
                    "content": "@freiza I was looking over what I could see at the link you provided. All I see is people being given ‘stars’ so I don’t know do people redeem stars for payment?   As a non-member I also don’t see the details of how a bounty is offered, how the # stars is determined, and then who determines when the work is completed and satisfies some level of quality. In short where are the guts of the details of how this bounty system is run?! Thanks in advance and sorry if I missed some obvious link.   I really didn’t have an urge to sign up just to ‘see’ if what I was looking for was there or not. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.9
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#4",
                    "likes": "6",
                    "time": "22/06/2020-15:01:45",
                    "content": "Great post Frieza, I think a system for making paid opportunities discover-able is important. It’s just a matter of doing it right. We used to use bounties.network for bounties in the past, but found that for more complex work, one-to-one agreements are a lot better; both for the client-side and worker-side. MIP14 is a great first step to getting the protocol to handle these work-requests themselves. However, it is still early and being developed. In the meantime though, the Maker Foundation’s Community Development department is working with the community on a number of Dai grants for various needs, many of which are governance-related. In fact, we’re even currently sponsoring a  Protect Privacy Virtual Hackathon that includes two of our own bounties running through Jul 06th:  Maker Bounty 1: Privacy in payments Maker Bounty 2: Privacy in Governance and Voting  As a side-note, we also have a grants program specifically for meetups. Overall, I hear your feedback. It’s having all these sorts of opportunities listed and accessible in a place that makes sense. Hopefully we will have such a place where we can comfortably point people soon! ",
                    "links": [
                        "https://github.com/makerdao/community/issues/585",
                        "https://github.com/makerdao/community/issues/586",
                        "https://community-development.makerdao.com/meetups",
                        "https://forum.makerdao.com/t/week-4-dai-distributions-sourcecred-trial/2974"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None"
                    ],
                    "Sentiment": 6.3580827067669174
                }
            ]
        }
    ]
}