{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/would-you-like-to-use-part-of-the-3-billion-usdc-to-buy-back-mkr-token/10965",
            "title": "Would you like to use part of the 3 billion usdc to buy back mkr token? ",
            "index": 10965,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Mikkkkk",
                    "index": "#1",
                    "likes": "0",
                    "time": "13/10/2021-03:21:43",
                    "content": "Mkr token is undervalue and as a token holder, I see this as an opportunity as there are 3 billion in interest free usdc collecting in dust and not being utilized at all. This post is to gauge the community and token holders interest on the plan to borrow 10% of the 3 billions usdc, so 300 millions, at 0% interest to buyback mkr token over 12 months period. ",
                    "links": [],
                    "GPT-summary": "The author proposes to use part of the 3 billion USDC to buy back MKR tokens. The post aims to gauge the community's interest in borrowing 10% of the USDC to buy back MKR tokens over a 12-month period at 0% interest. The post explains the proposal and asks for feedback and questions while also inviting constructive criticism.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mikkkkk",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/10/2021-03:34:12",
                    "content": "Traditional banks utilizes 95% of their capital for lending and investments, and its not unheard of for corporation to buy back stocks and pay dividend whenever cheap debt is available. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#3",
                    "likes": "2",
                    "time": "13/10/2021-04:22:21",
                    "content": "The issue with this is that it is a gamble on the price of MKR. If the price of MKR drops after it is bought, some DAI out there will not be backed by collateral. The USDC should indeed be used somehow and there are plans to do so but it needs to be used to buy a risk-free collateral. Some suggestions have been to purchase US Treasury bonds through a RWA style mechanism. The yield will be low but non-zero and that should keep everyone happy! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "1",
                    "time": "13/10/2021-12:14:18",
                    "content": "I find it even more concise to use your USDC as deposits in DeFi protocols, and use the proceeds to buy back MKR if applicable. Or buy ETH or wBTC to continue to counterbalance USDC as collateral in the system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#5",
                    "likes": "1",
                    "time": "13/10/2021-14:50:43",
                    "content": "In the loosest sense this USDC is in a vault backing DAI.    You are asking to swap this for MKR which has a predictable price movement (down if for any reason if the protocol is losing money).  This has terrible implications. I have long supported the idea of putting a good chunk of this USDC into a 100% liquid contract (USDC-DAI on Uniswap for example) to earn return.   We could have dropped it into compound or AAVE but none of these have 100% liquidity.    The biggest issue here is we don’t want to fully depreciate this facility because we want USDC here to buy if the markets want to sell DAI for USDC.  USDC in the PSM is the DAI downside PEG protection, vaults next, SF and DSR raises 3rd and 4th. If Maker were to convert all of this USDC into a bond we would lose our downside PEG protection. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.496031746031746
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mikkkkk",
                    "index": "#6",
                    "likes": "0",
                    "time": "13/10/2021-15:14:46",
                    "content": "No offense but risk free sounds like boomer finance and it makes me sick.  Crypto is inherently risky and we are here because of the asymmetrical payout. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#7",
                    "likes": "0",
                    "time": "13/10/2021-15:16:06",
                    "content": "I’m tempted to flag your post as spam. You commented on RWF’s serious proposal Investing our liquidity in short-term ETF, managing PSMs exposures - #10 by Mikkkkk, but seem to have no perspective on the history of how the latest proposal was developed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.444444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mikkkkk",
                    "index": "#8",
                    "likes": "0",
                    "time": "13/10/2021-15:48:48",
                    "content": "As a token holder, I really don’t understand what is enticing about etf that only producing 0.6% apr. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#9",
                    "likes": "3",
                    "time": "13/10/2021-15:50:09",
                    "content": "    Mikkkkk:  only producing 0.6% apr   The point is to earn some non-zero return and reduce our reliance on USDC. Very modest but important goals. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.883333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mikkkkk",
                    "index": "#10",
                    "likes": "0",
                    "time": "13/10/2021-17:03:27",
                    "content": "Mkr token holders shouldn’t have to settle just because its non zero return.   There are loads of low hanging opportunities in defi that should be considered prior to rwa assets which is prompt to policy, contract, corruption and fraud risks. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "8",
                    "time": "13/10/2021-17:39:10",
                    "content": "    Mikkkkk:  No offense but risk free sounds like boomer finance and it makes me sick. Crypto is inherently risky and we are here because of the asymmetrical payout.   I think the difference is we’re not risking our capital. We’re risking the backing of DAI, which is our core product. It’s fine for people to degen into things with their own money. Feels less fine for us to degen into stuff with the collateral that backs DAI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.793650793650793
                }
            ]
        }
    ]
}