{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-update-mana-vault-stability-fee-to-3/17097",
            "title": "[Signal Request] Update MANA vault stability fee to 3% ",
            "index": 17097,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "mana",
                "sig-status-rejected",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cazala",
                    "index": "#1",
                    "likes": "2",
                    "time": "08/08/2022-16:48:14",
                    "content": "Hello, I’m cazala, one of Decentraland’s core contributors. I’m writing this signaling request today to ask the Risk team and the community to consider lowering the stability fee for MANA vaults, currently sitting at 6%. Background Last year there was a singal request to offboard multiple collaterals, one of them was MANA (link). I stepped in back then and talked with some people from Maker and the Decentraland Foundation (i’m not part of the Decentraland Foundation, but since I’ve been part of the communty for a long time I’m in touch with many people there) to see what we could do to keep the collateral. The solution back then was to increase the SF of the MANA vault from 3% to 6% to meet the $300k/year cost of the oracles (link) until MANA liquidity could be improved on-chain to raise the debt ceiling and allow higher utilization to bring the fees down back again. And so we reached out to MANA whales + the Foundation opened vaults to keep the product alive until it could be sustainable. This was in December, and it was discussed in that topic that once the debt ceiling reached 10M (it was 5M at that time) the SF could be lowered again (link). Currently the gas cost associated with Oracle updates have lowered drastically, but even considering the same costs as last year, the debt ceiling has been increased by three fold and it’s at 15M DAI and 100% utilization. There’s a 2M debt ceiling increase scheduled (taking the DC to 17M) that is expected to yield another $120k/year in fees if fully utilized (link). Even deducting the $300k/year Oracle expenses, the MANA vaults are generating a net revenue of $600k/year (link). I know that several owners of MANA vaults who stepped in last year to keep the product afloat are starting to look at alternatives due to the high SF, and I think is sensible considering that you can get DAI using MANA as collateral at Aave for ~1%. I know that MANA doesn’t have a deep on-chain liquidity (although it is quite decent on exchanges), but other vault types with similar liquidity issues, low usage, net negative revenue and higher risk premium have stability fees of 2.5% and 3%, like LINK and MATIC respectively. So I’m asking the Maker community to please consider lowering the stability fee for the MANA vault back to 3%.    Should the MANA-A Stability Fee be Reduced to 3%  Yes No Abstain     0 voters      updated by Patrick_J to amend poll options and add next steps  Next steps: This poll will return for 14 days until 2022-08-22T17:00:00Z. If the result is a “Yes” vote, an on-chain poll will follow. ",
                    "links": [
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-2021-11-25/11825/4",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-2021-11-25/11825/5",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-28-july-2022/16895",
                        "https://docs.google.com/spreadsheets/d/1n1yxQmbTFl00qeLYN2lhRJkVXuzRpYpybs4b6YWHlzA/edit#gid=1552963597",
                        "https://forum.makerdao.com/t/governance-and-risk-203-thursday-august-11-at-17-00-utc/17157/2",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/11",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-11-17-de-agosto-del-2022/17376",
                        "https://forum.makerdao.com/t/governance-and-risk-204-thursday-august-19-at-17-00-utc/17318/2",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-25-august-2022/17448",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-04-10-de-agosto-del-2022/17250",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/10"
                    ],
                    "GPT-summary": "The post is a signal request by a Decentraland core contributor, cazala, to lower the stability fee for MANA vaults from 6% to 3%. Cazala explains the background of the current stability fee and argues that the current fee is too high compared to other vault types with similar liquidity issues. The post also includes a poll for the Maker community to vote on whether to reduce the stability fee. The post includes constructive criticism and questions from third parties, and the author is explaining the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 4.974444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/08/2022-16:48:15",
                    "content": "This post has been reserved for GovAlpha’s proposal summary on proposal [Signal Request] Update MANA vault stability fee to 3% ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#3",
                    "likes": "2",
                    "time": "08/08/2022-16:49:35",
                    "content": "@cazala, here’s your new Signal Request. @lollike @PaperImperium @prose11, you had voted on the previous post, apologies for any inconvenience. Please consider voting again. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.924242424242424
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cazala",
                    "index": "#4",
                    "likes": "1",
                    "time": "08/08/2022-16:50:48",
                    "content": "thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#5",
                    "likes": "3",
                    "time": "08/08/2022-18:26:49",
                    "content": "Hey @cazala. Can’t speak for MOMC group that proposes rate changes but I can provide input from @Risk-Core-Unit. Calculated risk premium for MANA-A vault type starts quickly approaching 10% when debt exposure moves from 15m to 20m. Since debt ceiling got utilized at 15m and we suggested additional 2m increase, we proposed to keep 6% rate fixed for time being. The risk model assumes black thursday type of price crash of 50%+ within a day and then simulates auctions outcome based on the on-chain liquidity which you can see on chart below is very poor, actually the lowest among collateral tokens Maker holds (selling $1m of MANA leads to 12% slippage on-chain). It’s true however that off-chain liquidity isn’t as bad and we’d likely see arbitrage between off-chain and on-chain pricing during liquidations. But at the same time liquidations throughput for MANA at Maker is set to be very limited due to questionable on-chain liquidity that keepers mostly rely on. This explains why our model is very conservative at simulating potential losses.  That said, MOMC group is also aware of of competitive rate at Aave and also the fact that oracle costs have dropped significantly. We are holding next meeting in about 3 weeks. If community supports 3% SF, we’ll revise our proposed SF, but ideally Risk would push towards some compromise between 3% and 6% SF, especially now when DC was proposed to be slightly increased. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-august-2022/17615"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0961451247165535
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#6",
                    "likes": "1",
                    "time": "08/08/2022-18:32:34",
                    "content": " After Oracle costs, the change from 6% to 3% would reduce MKR profitability by 75% which seems a little too aggressive. 4% to 5% range seems reasonable compromise given history, revenue dynamics but also the above rationale from @Primoz ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.020833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#7",
                    "likes": "0",
                    "time": "08/08/2022-18:54:32",
                    "content": "I think the oracle costs have fallen below those levels so probably less big of an impact (although this could of course change if the market turns bullish). ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-august-2022/17615"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#8",
                    "likes": "1",
                    "time": "08/08/2022-19:10:16",
                    "content": "My vote was yes. but not at 3% maybe it should be reevaluated, currently MANA can deposit its tokens in AAVE and get better prices for those loans, besides generating interest on its token. I think it is prudent for Maker to reconsider their approach and not lose this great ally. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cazala",
                    "index": "#9",
                    "likes": "1",
                    "time": "08/08/2022-19:14:38",
                    "content": "I see, I think any reduction would help a lot  and yeah on-chain liquidity has been an issue for a while, actually most of the DAI minted by the Foundation was used to provide MANA/DAI liquidity on-chain, but yes there’s still a lot of room for improvement. As you said, liquidity on exchanges is way higher and unless you are trying to sell $1M of MANA in a single tx you can probably do it in smaller chunks and let the market arb it back in a short while without such slippage. Regarding a black thursday-like event, if it serves as a reference, during that day there was no bad debt generated in Aave (and there were over 50M tokens deposited as collateral there), and during the recent LUNA crash, MANA went from above $1.60 to $0.69 according to the OSM (yes I was watching closely ) without issues on the vaults. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.391774891774892
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cazala",
                    "index": "#10",
                    "likes": "0",
                    "time": "08/08/2022-19:27:15",
                    "content": "Hi @TRUEMAKER , yes, I’m aware that this is reducing the profits by a big chunk, but at the same time, those profits are mostly coming from a few organizations and individuals who stepped in to help keep the product alive… and it was informally agreed to eventually take the fees back to previous levels once it was sustainable… which it has been for a while, not even cosidering that the costs were calculated in USD terms when both gas price (in ETH terms) and ETH price (in USD terms) were multiple times higher than this year. I don’t want to sound like i’m placing a threat of leaving, i’m not even an owner of a MANA vault myself, but for some reason I ended up being in the middle of the conversation, and I’m a big fan of Maker too, I know great people who work and have worked there, and both Decentraland and MakerDAO have been around for a while and survived several market cycles by now, so I’d like to help keep both communities together . If 3% is deemed as too low, then I’m sure any reduction would still be greatly appreciated by the vault owners. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.745098039215685
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#11",
                    "likes": "0",
                    "time": "08/08/2022-19:34:33",
                    "content": "    TRUEMAKER:  After Oracle costs, the change from 6% to 3% would reduce MKR profitability by 75% which seems a little too aggressive. 4% to 5% range seems reasonable compromise given history, revenue dynamics but also the above rationale from @Primoz   To be fair this is all else being equal. Such a dramatic change would likely (hopefully) bring in new deposits. Oracles team have also done a lot of work on gas optimizations as @monet-supply  points out. Would be interested in seeing the Risk team’s pov on a staggered reduction over a longer timeframe rather than a step cut from 600 to 300bps. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.332765151515152
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tbone",
                    "index": "#12",
                    "likes": "0",
                    "time": "08/08/2022-19:59:41",
                    "content": "SR needs more options, 4.5% could be a reasonable compromise rate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#13",
                    "likes": "0",
                    "time": "08/08/2022-20:29:53",
                    "content": "Yup that makes sense. Gradual reduction to the desired rate (i.e. 3%) in X% increments which hopefully gets completely/partially offset by some inflows benefits all of us.     tbone:  SR needs more options    ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#14",
                    "likes": "2",
                    "time": "08/08/2022-21:16:14",
                    "content": "I generally trust CUs in their ability. Therefore, unless risk team suggests such, maintaining “no” to lowering the rate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#15",
                    "likes": "1",
                    "time": "11/08/2022-17:07:43",
                    "content": "If no one else voted and even though 75% of voters choose abstain option would this SR pass since its Yes votes (6) are higher than the No votes (2)? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#16",
                    "likes": "0",
                    "time": "11/08/2022-19:50:16",
                    "content": "I think so from what I understand ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#17",
                    "likes": "1",
                    "time": "11/08/2022-22:29:51",
                    "content": "Bumping this thread. This SR would benefit from a rejection so a modified version could be put forward with more options. This would make it more likely to pass on chain. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#18",
                    "likes": "2",
                    "time": "12/08/2022-10:13:23",
                    "content": "Based on my observation, the current stability fee is suitable and I do not recommend lowering it at current debt exposure. Even if debt exposure would decrease to 5-10M dai, I wouldn’t recommend lowering it to 3%. To the contrary, I would recommend increasing the stability fee in case debt weighted CR continues to decline. As of right now, Maker is assuming market risk towards MANA due to its lack of liquidity - this is the least liquid collateral asset within MCD. Some portion of permissionless liquidity is also provided by the same party who is minting MANA backed debt. MANA-A used to be one of the most collateralized vault types; during the end of 2021, beginning of 2022, the debt weighted CR was above 1500%. The CR started to decline more rapidly after March, as it reached 360% at some point. Currently it is a bit higher due to recent price increase across the majority of crypto assets. The debt exposure of the vault type rapidly increased during May and June, from ~4.8M to current 15M dai. This means that drop in debt weighted CR was due to general price decrease of MANA and additional borrowing from mostly existing collateral. This basically means that MANA became from previously highly unlikely to be liquidate and produce bad debt due to low liquidity to now likely to the point where liquidation could occur based on historical drawdowns. MANA experienced a 58% daily drawdown during the 2021 May 19th crypto market crash. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-august-2022/17615",
                        "https://forum.makerdao.com/t/core-unit-de-riesgo-mes-en-revision-agosto-2022-traduccion/17699"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2760989010989015
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#19",
                    "likes": "0",
                    "time": "12/08/2022-18:31:02",
                    "content": "Seems like there is no communication between Maker and Decentraland, both are big projects within the Ethereum Ecosystem, there should be a way for both to be okay with a resolution. Isn’t a way to make a kinda Institutional Vault or Vault between organizations that makes this tradeoff easier? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#20",
                    "likes": "1",
                    "time": "12/08/2022-19:18:37",
                    "content": "As Maker is a DAO, the resolution comes from the Maker governance and community, which is related to the ongoing poll here. I don’t think anybody in MakerDAO has an authority and power to change it to 3 or 4% without onchain voting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#21",
                    "likes": "0",
                    "time": "12/08/2022-19:46:00",
                    "content": "Any PPG can make a proposal (which also needs to be ratified onchain) - @rema already made a statement and MOMC usually follows the assessment of the RISK-CU. Nevertheless MOMC will likely talk about MANA-A at the next meeting ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#22",
                    "likes": "1",
                    "time": "13/08/2022-17:14:43",
                    "content": "In the traditional world, once deals are complete and the customer has delivery/implementation of the product and/or service, transition to a customer success organization is typically the next step. In the past, Maker has spent most of our time on the collateral onboarding then the technical aspects of managing our collateral once onboarded. We’re looking to have more of a holistic approach, sunrise to sunset, moving forward. Collateral is our product and each product has a lifecycle. We need to do a better job of managing all aspects of this lifecycle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.628787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#23",
                    "likes": "0",
                    "time": "14/08/2022-08:11:42",
                    "content": "That’s what institutional vaults are for. I don’t see a reason why such commitments needs to be made (as there is no deal, just a product offer!) For non-IV vaults ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cazala",
                    "index": "#24",
                    "likes": "0",
                    "time": "19/08/2022-14:56:43",
                    "content": "I think at this point is clear that this signal request is not going to move to the next stage as is. I see some people in support of a reduction of the SR, just not agree on the 3% fee, and other don’t want a reduction at all. Should I create a new signal request with more options like 3%, 4%, 5%, keep at 6%…? or is not even worth it? I think keeping it at 6% is pretty much the same as voting to sunset the product at this point, which is sad i think, but it’s not competitive as it is, and the few users of it are already talking about moving to cheaper alternatives (desks, cexes, aave). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.300619834710743
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#25",
                    "likes": "2",
                    "time": "19/08/2022-15:07:33",
                    "content": "@cazala MOMC is having their next meeting next week, we will for sure talk about MANA-A as well. If MOMC proposed to lower the SF, this will go up for an onchain poll in the week later. That’s the shortest path we can go here ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cazala",
                    "index": "#26",
                    "likes": "0",
                    "time": "19/08/2022-15:24:29",
                    "content": "@ultraschuppi cool, thank you, looking forward to hear the outcome of the meeting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#27",
                    "likes": "0",
                    "time": "19/09/2022-01:25:02",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}