{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-2019-7-25/212",
            "title": "Maker \\xe3\\x82\\xac\\xe3\\x83\\x90\\xe3\\x83\\x8a\\xe3\\x83\\xb3\\xe3\\x82\\xb9\\xe3\\x82\\xb3\\xe3\\x83\\xbc\\xe3\\x83\\xab\\xef\\xbc\\x83\\xef\\xbc\\x94\\xef\\xbc\\x95\\xe3\\x81\\xae\\xef\\xbc\\x98\\xe5\\x80\\x8b\\xe3\\x81\\xae\\xe9\\x87\\x8d\\xe8\\xa6\\x81\\xe3\\x81\\xaa\\xe7\\x82\\xb9\\xef\\xbc\\x9a2019\\xe5\\xb9\\xb47\\xe6\\x9c\\x8825\\xe6\\x97\\xa5 ",
            "index": 212,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen_Chu",
                    "index": "#1",
                    "likes": "2",
                    "time": "30/07/2019-08:50:49",
                    "content": "  ガバナンスは解決済みではありません。MakerDAOがこの先に考えなければならないことは重要な決断をどうのように行うか？どのようなメカニズムとプロセスが効果てきか？どうやって意見を集めるのか？（Rich)   MCDがはじめるので、ガバナンスを本格的に進めていきます。MCDのスタート時期は1つはメカニズム、コード、監査などです。もう1つはガバナンスとコミュニティー、これらの2つの要素によってかわります。（Rich)   Governance at a Glance Thread  Meta Governance: Signal Requests Signal Request/ Should we modify the SF voting cadence and stepping? MakerDAOフォーラムのディスカッションのまとめをシェアしました。SFの変更についての頻度の投票数（79％/ 21％が好意、16票）およびRocketChatでの議論からもわかるようにSFの隔週seのコンセンサスを形成しています。Visheshは、SFの隔週のケイデンス（Cadence）を主張しています。これは、Dai価格にあまりにも早く反応しすぎて、前の変更の影響が見られるのに十分な時間が与えられない可能性があるからです。(David)   Ongoing Initiative/ Estimating DAI/USD from the eth2dai order book instead of dex trades 素晴らしいDai価格を集める方法と分析について、これからの議論を聞くことに興味があります。(David)   On The Horizon/ Navigating the waters between now (SCD) and MCD with the DSR  SCDからMCDへ段階的に移行する最良の方法は何ですか？ Mrabinoはそれにつて賢明な方法を提案しました。(David)   Graphs about Maker  Graphs about DeFi Loans  DAI 24hr VWAP Graph レバレッジはDai価格に最も影響を与えます。Stability feeは、Daiにとってのセンシティビティーパラメータ（Sensitivity Parameter）のようなものです。Daiのボラティリティは、3月上旬など過去と比較して減少しています。 (Vishesh)   dydxとCompoundがMakerからマーケットシェアを得るというナラティブではなく、効率の改善です。Secondary Lending Platform (SLP) におけるDaiの使用量の増加により、Daiの供給の減少の少なくとも半分くらい想定しています。供給の減少が必ずしも需要の減少を意味するわけではありません。（Vishesh)   問：どうすればDaiのSFが自然に低くなりますか？ 答：データがSFが高すぎることを示しているときだけ下げるべきです。これは重要な点です。（Vishesh)   ",
                    "links": [
                        "https://forum.makerdao.com/t/meta-governance-signal-requests/55",
                        "https://forum.makerdao.com/t/should-we-modify-the-sf-voting-cadence-and-stepping/26/5",
                        "https://forum.makerdao.com/t/estimating-dai-usd-from-the-eth2dai-order-book-instead-of-dex-trades/92",
                        "https://forum.makerdao.com/t/navigating-the-waters-between-now-scd-and-mcd-with-the-dsr/80",
                        "http://makerdao.descipher.io/",
                        "http://loans.descipher.io/",
                        "http://dai.descipher.io/"
                    ],
                    "GPT-summary": "The post discusses the governance of MakerDAO and the decisions that need to be made for the future. It also includes discussions on modifying the SF voting cadence, estimating DAI/USD, and transitioning from SCD to MCD. The post also provides graphs about Maker and DeFi loans, and addresses the decrease in Dai's volatility. The post does not advertise the proposal, but rather explains and discusses it.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen_Chu",
                    "index": "#2",
                    "likes": "1",
                    "time": "30/07/2019-08:53:08",
                    "content": "私の考え： 1.コミュニティーは、Richが言ったように、ガバナンスは解決された問題ではないことを知っておく必要があります。皆さんがコミュニティーに貢献したいのなら、フォーラムで皆さんのお考えを共有してください。 2. Davidがフォーラムの主要なディスカッションについて話すことがとても良かったと思ういます。なんぜなら、皆さんのご意見を大事にする意味で、私たちの日本のコミュニティーでもっとディスカッションが行われることを望みます。私の方から英語圏のコミュニティーに重要なポイントを伝え、またDavidがガバナンスコールの中に言及していることを確認することができたらうれしいです。 3. 過剰な供給がどの程度健全なレベルにまで減少したかについてのVisheshの分析は興味深いです。他のSecondary Lending Platform がMakerの市場シェアを奪うと見なすのではなく、実際には非効率性の改善です。 4.分散型のコミュニティエンゲージメントとガバナンスは、これまで一度も行われたことがないため、容易ではありません。 「誰かが担当している」という考え方が多いかもしれないです。しかし、Daiステブールコインシステムはコミュニティーの取り組みであり、分散型であるため、そのような考え方は無効です。 ステブールコイン システムはそれを機能させるためにコミュニティーの関与を必要とします。 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}