{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/reverse-treasure-hunt-help-me-find-the-winner-of-unique-nft-from-gods-unchained-est-value-50k-usd/4512",
            "title": "Reverse Treasure Hunt - Help me find the winner of unique NFT from Gods Unchained (est. value ~50k USD) ",
            "index": 4512,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Tharsonius",
                    "index": "#1",
                    "likes": "2",
                    "time": "02/10/2020-12:00:27",
                    "content": "Dear Maker community, I would like to ask for your help in identifying and informing a user presumably associated with you who was randomly selected as the winner of a valuable one-of-a-kind NFT, the mythic card Tethys, from the blockchain card game Gods Unchained. The corresponding raffle (The Genesis Raffle - Win a Mythic! - Gods Unchained Blog) took place about a year ago but the winner of its aforementioned main prize was never identified and the winning address did not display any signs of activity after the raffle either, which led the NFT to be commonly considered as lost to the ether until further notice. The winning address (0xcEE772FFc011fD09C901619A8206623bdd9B5d04) appears to have been ultimately funded by the following much more active address 0x15a190CEeE1163F0b1f05793541BC362AE8883e9, which has been heavily involved in Dai and Sai over the last two years. This leads me to my question, does anybody recognize this address or knows whom it might be associated with? Does anybody know people from the Maker community who also played Gods Unchained about a year ago? Given that you appear to have a large Latin American community also consider that option, the transaction timestamps seem to match an Americas timezone at first glance. Within the game community entire episode has sparked a fair amount of controversy and discussion regarding immutability of the selection process vs. practicability of a retry in case the winner did not react and could not be found but the team eventually decided in favor of immutability. In general people would just be happy to see the card reemerge from the dark space of Ethereum instead of being lost forever. Regards, (“Galotta” on the game discord) ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.439523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#2",
                    "likes": "0",
                    "time": "02/10/2020-14:38:18",
                    "content": "I see you (or others of your community) already tried to use the messaging/comments functionalities of Etherscan… https://etherscan.io/address/0x15a190CEeE1163F0b1f05793541BC362AE8883e9#comments I always thought that having a good/better messaging system on top of Ethereum would be a very desirable feature! Weird that nothing better has yet emerged (I guess?) I hope you good luck with this search!  REMARK: perhaps for the future, I guess a better way to release prizes is to allow for the winner to actively redeem them rather than sending to their wallets directly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.162037037037037
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tharsonius",
                    "index": "#3",
                    "likes": "0",
                    "time": "02/10/2020-16:58:15",
                    "content": "Yeah, in the next raffle the winner would likely have to actively claim it within a certain time frame. But the terms and conditions for the first one lacked the foresight to include any such provision unfortunately. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.879251700680272
                }
            ]
        }
    ]
}