{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/proposed-stablecoin-regulation-and-existential-threats-to-dai/9722",
            "title": "Proposed Stablecoin Regulation and Existential Threats to DAI ",
            "index": 9722,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Quiet",
                    "index": "#1",
                    "likes": "2",
                    "time": "06/08/2021-02:08:29",
                    "content": "I’m sure many are aware of this, but for those who aren’t following US policy developments closely, Rep Don Beyer has proposed a bill which would regulate crypto, which has a heavy focus on stablecoin regulation:   U.S. Representative Don Beyer – 28 Jul 21    Beyer Introduces New Legislation To Regulate Digital Assets      Ive already broached part of this topic on another post (Mapping out policy challenges and opportunities for Maker - #39 by Quiet) however I thought the proposed stablecoin regulation merited it’s own post. TLDR, Beyer’s legislation suggests the outright illegalization of fiat pegged or collateralized stable issuance, and stablecoin use except for stablecoins which meet regulatory criterion, and which are registered by their issuer (something a DAO likely cannot do in current frameworks). As I understand, this could chastise not just parties considered as issuers of DAI, but CEXs and Firms, which list DAI, or use it in their own processes. Right now the regulatory attention on stablecoins has been primarily given to centralized issuers like USDT. Even if the worst case of DAI being delisted or blacklisted doesn’t occur, these regulations will also make things riskier for these centralized stable collateral types that DAI is dependent on. This seems like a potential existential threat to the protocol. Even if the language written here is revised or this bill goes nowhere, this may be the start of a monumental change of footing of policymakers on the issue, from cautious application of pre existing laws and vague statements, to active regulation and codification of restrictions on stables. What are other community members thinking in regards to this? ",
                    "links": [
                        "https://beyer.house.gov/news/documentsingle.aspx?DocumentID=5307",
                        "https://forum.makerdao.com/t/mapping-out-policy-challenges-and-opportunities-for-maker/8959/39"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.345722260195944
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "8",
                    "time": "06/08/2021-02:24:28",
                    "content": "So I won’t comment on the specific legislation proposed here. But several senators’ offices have stated they oppose this particular language and will support instead the somewhat lighter touch of proposed amendments. Additionally, some influential House members have made it clear what their primary concerns are in this area. The good news is that Maker can very easily assuage their fears and concerns. The bad news is that Tether and USDC won’t be able to, and it is a bit of a battle to demonstrate how Maker is operationally different from our competitors. Indeed, in the stablecoin horse race, we are the only pony that can’t interfere with Fed policy, is transparent, and is not fragile in the face of runs. What will be the outcome? Who knows? But that’s what our understanding of the current climate is. If you’re American, write/call your representative and senators. Unfortunately, a DAO is in no position to lobby, as that carriers certain legal reporting requirements and also a level of discretion and feather touch that a brutally public and transparent organization won’t be good at. So we are likely to be just observers ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.586071428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#4",
                    "likes": "1",
                    "time": "05/10/2021-15:43:26",
                    "content": "Here is a relevant article from CoinBase’s State of Crypto newsletter. Stablecoins as not-securities The narrative The Biden administration is moving beyond vague hints on how it will regulate stablecoins to some more concrete descriptions. There’s still a lot we don’t know yet. Why it matters Stablecoins have exploded in popularity over the past year or two, with some $130 billion worth of these fiat-pegged tokens in circulation as of Sunday night, according to CoinGecko. Regulators have been eyeballing this specific sector of the broader crypto industry for nearly a year, and we’re finally seeing their response. The final regulations will determine whether some issuers have to shut down or block U.S. users, as well as what sort of transparency we can expect to see from these issuers. Breaking it down Stablecoins! Yes we’re still talking about this. The Biden administration has gotten very busy around cryptocurrencies in general. The Securities and Exchange Commission (SEC) will start approving or rejecting bitcoin exchange-traded fund (ETF) applications in the next few weeks, the Office of Foreign Assets Control just sanctioned a crypto trading firm for the first time and regulators have been talking a lot about regulating the market. Stablecoins have taken on a particular importance. The Trump administration even convened a President’s Working Group for Financial Markets meeting to discuss the issue, so it’s no surprise the current administration has been looking to enact regulations. “What isn’t clear is what sort of regulatory framework would make the most sense for stablecoins,” I wrote in July. We now have the first hint at how the Biden administration plans to answer this question: Treating stablecoin issuers similar to banks. The administration has a two-track plan here: the first depends on Congress. Should that not work out for whatever reason, officials will also look to the Financial Stability Oversight Council, an interagency body established in the wake of the 2008 financial crisis to monitor risks to the system. The Congressional path seems fairly straightforward at first blush. Team Biden intends to ask Congress to draft a law that would authorize a special-purpose bank-like charter for stablecoin issuers. This would create a federal framework for stablecoin issuance, while assigning a regulator oversight authority over these businesses. This would also impose bank regulations and supervisory requirements on stablecoin issuers, which I’m guessing would include some specific reporting or backing requirements. Regulators have espoused the need (in their view) for any sort of regulatory oversight over stablecoins at the federal level. While some U.S.-based stablecoin issuers are regulated by state financial regulators (cough, NYDFS) there’s no one formally assigned at the federal level. Fed Chair Jerome Powell reiterated this view in a hearing before the House Financial Services Committee hearing last week. “Stablecoins are like money market funds, they’re like bank deposits but they’re to some extent outside the regulatory perimeter and it’s appropriate that they be regulated – same activity, same regulation,” he said. SEC Chair Gary Gensler has likewise compared stablecoins to money market funds, as have lawmakers in the House and Senate. Bank regulations are something else. We don’t yet know the specifics of this special-purpose charter that the Treasury is pitching. Matthew Homer, executive in residence at VC firm Nyca Partners and formerly the fintech lead at the New York Department of Financial Services, said one of the major questions is why the Office of the Comptroller of the Currency’s (OCC) current trust bank or full bank charter framework would not suffice. Another question is whether the OCC, a federal bank regulator, would indeed be the chartering entity here, or if a different federal agency would be given oversight of stablecoin issuers. “Would banks with normal bank charters be able to issue stablecoins? Will this have implications for other areas like the issuers of prepaid cards?” Homer asked. “In some ways a stablecoin is no different from a stored-value product like a prepaid card where you have a third-party program manager with a bank holding the deposits.” It’s also unclear to me personally how stablecoins tied to decentralized finance (DeFi) projects might fall into this new framework. Given the attention on DeFi though, I’m sure this is an area we will see addressed. Dante Disparte, chief strategy officer and head of policy at Circle, which manages the USDC stablecoin, said in a statement that the rumored framework “is encouraging.” “The time has come to address the risks and seize the significant opportunities of dollar digital currencies like USD Coin (USDC),” he said. “Circle has already been working toward becoming a full-reserve national commercial bank, and we strongly believe that a full-reserve banking model built on digital currency technology can lead to a more efficient, fair, inclusive and resilient financial system.” ",
                    "links": [
                        "https://link.coindesk.com/click/25235186.75861/aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIwLzEyLzIzL3ByZXNpZGVudGlhbC1hZHZpc29yeS1ncm91cC13ZWlnaHMtaW4tb24tcmVndWxhdG9yeS1hcHByb2FjaC10by1zdGFibGVjb2lucy8/611d2a763d38e453ae3f7d8eBdfc7df18",
                        "https://link.coindesk.com/click/25235186.75861/aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIxLzA3LzE2L3VzLXByZXNpZGVudGlhbC1hZHZpc29yeS1ncm91cC10by1kaXNjdXNzLXN0YWJsZWNvaW5zLw/611d2a763d38e453ae3f7d8eBb4015441",
                        "https://link.coindesk.com/click/25235186.75861/aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIxLzA3LzIwL3N0YXRlLW9mLWNyeXB0by1zdGFibGVjb2luLXJ1bGVzLWFyZS1jb21pbmcv/611d2a763d38e453ae3f7d8eBe8cc4a4c",
                        "https://link.coindesk.com/click/25235186.75861/aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIxLzEwLzAxL3N0YWJsZWNvaW4taXNzdWVycy1jb3VsZC1zb29uLWZhY2UtYmFuay1saWtlLXJlZ3VsYXRpb25zLXJlcG9ydC8/611d2a763d38e453ae3f7d8eB2f4322ad",
                        "https://link.coindesk.com/click/25235186.75861/aHR0cHM6Ly93d3cuZGZzLm55Lmdvdi9yZXBvcnRzX2FuZF9wdWJsaWNhdGlvbnMvcHJlc3NfcmVsZWFzZXMvcHIxODA5MTAx/611d2a763d38e453ae3f7d8eBb1ed3fc2",
                        "https://link.coindesk.com/click/25235186.75861/aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIxLzA5LzMwL2ZlZC1jaGFpci1wb3dlbGwtc2F5cy1oZS1oYXMtbm8taW50ZW50aW9uLW9mLWJhbm5pbmctY3J5cHRvLw/611d2a763d38e453ae3f7d8eB48970de1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.493479020979021
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#5",
                    "likes": "1",
                    "time": "22/10/2021-18:11:52",
                    "content": " DeFi Is Like Nothing Regulators Have Seen Before. How Should They Tackle It?  Without middlemen to deputize, the SEC and other regulators will have to rethink their approach to enforcement. A lot could go wrong. Oct 19, 2021 CoinDesk Insights The cryptocurrency industry is going through a period of intense growing pains. Like a lanky tween, it is running faster and jumping higher than ever before, thanks to major milestones such as bitcoin adoption in El Salvador, a continuing surge in non-fungible token (NFT) interest and ever more involvement from established players like Visa. But, again like an ambitious adolescent, the newly empowered crypto sector is also bumping awkwardly into the constraints imposed by society. Gary Gensler’s Securities and Exchange Commission seems determined to be crypto’s strict disciplinarian, laying down the law about curfews, hemlines and exchange-traded funds. For nearly a decade, crypto regulation was absent or scattershot. The trade-off for crypto’s adulthood will be much stricter oversight by the graybeards who make the rules. This feature story is part of CoinDesk’s Policy Week, a forum for discussing how regulators are reckoning with crypto (and vice versa). The metaphor of crypto-as-teenager, though, breaks down on one front: decentralized finance (DeFi). In functional terms, DeFi protocols are venues for trading or lending crypto tokens and derivatives. But unlike a conventional crypto exchange like Coinbase or Kraken, DeFi protocols exist across a swarm of validating and coordinating nodes rather than as a single portal and matching engine run by an incorporated legal entity. Furthermore, at least in theory, a DeFi protocol can exist without the formal leadership with which regulators would normally interact. This is a particular challenge for regulators because many existing DeFi systems are designed without any requirement that users reveal their identities. Again, that’s a stark contrast with entities like Coinbase and Kraken, which have comprehensive “know your customer” processes. This matters because DeFi is a potential vector for all three of the key risks that financial regulators are tasked with controlling. One is criminal activity, including money laundering, tax evasion and terrorist financing (though these activities already appear very limited across crypto systems). The second is fraud, which was on major display with a series of fake or deceptive token sales during the 2017 initial coin offering (ICO) boom – facilitated by early iterations of DeFi. The third target is systemic risk. DeFi and crypto still probably aren’t large or influential enough to trigger broader financial contagion in the event of a major market collapse or system failure, but you no longer have to engage in wild speculation to foresee that level of influence in the future. Traditionally, regulators rely immensely on the people running trading services to control those risks by monitoring their customers and suspicious activity on their platforms. The leaders of traditional financial services themselves sometimes become the linchpin of enforcement – the responsible arm the SEC twists to get what it wants. Without those pressure points, things will get tricky. “It’s going to be very difficult to regulate DeFi. Much harder than crypto,” says Katherine Kirkpatrick, co-chair of the financial services practice at King & Spalding. “The ultimate question, beyond how to regulate, is how do you enforce the rules? How do you make someone accountable for breaking the rules? It doesn’t make sense to regulate if you have no enforcement mechanism.” In other words, trying to regulate DeFi is a bit like trying to parent a super-powered 14-year-old who can fly, teleport and turn invisible at will.  Should DeFi be Regulated? Of course, that demands a question: If you had a kid like that, would you want to lay down the law at all? When something new appears in the world, should we immediately start building fences around it, or give it the space to see just how powerful it is? Premature or misguided regulation could certainly stifle innovation and growth in DeFi. “If you try to regulate the technology itself rather than activity, you’re going to wind up having unintended consequences,” says Duane Pozza, formerly assistant director in the Division of Financial Practices at the Federal Trade Commission and now a partner at the law firm Wiley Rein. That could lead to “crushing the technology and probably not even stopping the [unlawful] activity.” For better or for worse, though, regulators usually don’t think like that. “If they think something is enabling mass money laundering,” says Pozza, “They’re not going to sit on their hands.” Despite the risk of misguided overreach, though, there are good reasons to want a regulatory framework for DeFi. Above all, it would make the fundamental advantages of the technology accessible to many more participants, particularly public companies and regulated institutions. That’s especially true now that the idea of private blockchains created by large banks has mostly fizzled out, according to Michael Shaulov, CEO and cofounder of Fireblocks, a DeFi custody and infrastructure provider. “In the last 10 years, most financial institutions recognized that blockchain and DLT is the future,” says Shaulov, referring to distributed ledger technology. “Now they have quite a few good use cases, but what they all want to do is disintermediate. Uniswap is something that replaces for them the Nasdaq [market].” Shaulov says he has frequent conversations with large players interested in DeFi, but the current U.S. regulatory landscape is a barrier. Using DeFi in its current state could expose banks like JPMorgan to money laundering or fraud risk. That’s a major reason the DeFi platform [Swarm Markets] made the unusual decision to move from a largely unregulated jurisdiction to one with more oversight. The platform launched in the United States in 2018, but the ambiguity of the rules there soon became a constraint. “The effective tone [of U.S. regulator statements] was, ‘We don’t know, and because we don’t know, we’re not going to make a ruling,’” according to Philipp Pieper, Swarm Markets’ co-founder. “It stated very clearly no one was willing to risk the current structure of the market.” In mid-2018, Swarm started looking at alternatives, including other lightly regulated domiciles like Malta and Cyprus. “It was clear that wasn’t where things were going to happen,” Pieper chuckles. Then in 2019, Germany passed new rules clarifying regulation of a variety of crypto-assets, including tokenized securities. Swarm Markets chose to relocate to Germany because that clarity gave it a firm platform for growth, while maintaining the key advantages of DeFi for institutions, including self-custody, decentralized liquidity provision and transparency. “Controlling my own assets … and choosing whatever custody provider I see fit, that’s a huge differentiator versus putting a couple hundred thousand into a centralized exchange,” says Timo Lehes, managing director at Swarm Markets. Swarm users can also contribute to a liquidity pool and earn fees or yield much as through other DeFi protocols. Finally, the transparency of a system that records orders to a public blockchain improves market fairness by making manipulation easier to spot. Running a regulated centralized exchange “involves all these questions about how you create an unbiased system,” says Pieper. But “all of that is answered very cleanly if you build transparently, and show all that to the regulator. Our [regulatory] application documents got thinner and thinner.”  Know your customer Of course, there is a trade-off here and one that will understandably raise the ire of crypto purists. “The result of being a licensed outfit is that we have to do an extensive amount of customer due diligence,” says Pieper. “KYC [know your customer], AML [anti money laundering] and chain analytics. From a customer perspective, it’s no different from what you get today on a centralized exchange.” By the same token, Swarm Markets has a degree of centralized control built into its system. “If we’re forced by regulators [we can] suspend a user. It could follow that basically funds are frozen, but it’s not that we can then take control of those funds.” Customer oversight also impacts flows between DeFi protocols and pools, which could soon involve a sharp divide between “clean” and “dirty” operations. Funds from a platform with weak KYC likely won’t be free to flow into regulated and “whitelisted” pools like Swarm Markets’ because it would re-introduce the counterparty risk institutions want to avoid. It’s an undeniably bitter pill. However, DeFi and crypto technologies also promise a variety of advancements to the KYC process that could make it more palatable. For instance, zero-knowledge proofs could be used to provide verification of a trader’s eligibility without revealing their identity to a regulated DeFi protocol. Under such a regime, traders could remain completely anonymous unless and until law enforcement subpoenaed their identity records from a protocol, substantially preserving user anonymity. A related idea is “portable” KYC, which could allow a clearance from one trading venue to be used on another; that could include getting cleared by a centralized exchange like Coinbase and then using that credential elsewhere, possibly with an NFT housed in the KYC’d wallet. Both innovations, though, would require significant regulatory reform to enact.  Is a DAO a person? The return of some sort of end-user KYC may be inevitable for any workable DeFi regulation. But on other frontiers, there are strikingly new questions that deserve innovative regulatory approaches. Biggest among these is the question of how regulators should approach truly decentralized systems. In principle, DeFi systems have bootstrapping mechanisms that rhyme with Bitcoin’s, with protocols that distribute native tokens in exchange for liquidity deposits. That means a system can have basic rules written by one developer or a small team and potentially grow to the size of a major hedge fund or beyond. In theory this could also include decentralized governance by the user community, making such platforms a species of decentralized autonomous organization (DAO). To be clear, not all DeFi systems are as decentralized as advertised. But some truly do seem to be exactly what they say: asset markets run by a distributed community rather than a middleman. SushiSwap, which arose from a fork of the more centrally run Uniswap, was one example sources considered on the more authentically decentralized end of the scale. On one level, this isn’t as complex to regulate as it might sound, according to Stephen Palley, a partner specializing in crypto at the law firm Anderson Kill. “Lawyers invented robots,” he says. “The corporation is a legal fiction – it has personhood under the law. We have a very robust series of laws that explain what that means.” That means a DAO, like a corporation, could be the target of legal or regulatory judgments, even if it had no formal leaders. “We’re starting to see that – who’s responsible for decisions made by an AI? Is it a software developer, is it code?” asks Palley. “For it to be a code, you have to recognize legal personhood for software. It sounds goofy and science-fictiony, but it’s not too far over the horizon.” That leaves the question of enforcement a bit up in the air, since there’s no clear mechanism for a national regulator to force decisions onto an effectively stateless entity. But the variety of on-and-off ramps to any crypto system could become chokepoints for enforcement. At an extreme, a government could make it illegal for citizens to transact with a rogue DAO.  The state I’m in The unhappy truth is that such hypothetical extremes will likely become reality if DeFi continues to grow. Regulators exist to regulate and have little stomach for powerful entities floating beyond their oversight. The modern state’s monopoly on violence as the endpoint of law enforcement will likely find some way to control your access to protocols living in the cloud. There will undoubtedly be plenty of committed crypto-anarchists willing to test the resolve of regulators. For operators of DeFi systems, there will always be jurisdictions beyond the reach of tough regulation, and it seems plausible that small-time users who take sufficient privacy precautions will continue to take the risk of using them. Even if they get pushed to the margins, such “pure” DeFi systems will continue to have social value as borderlands of innovation and privacy. In the broader sweep of history, they will be testing grounds for new forms of digital statelessness. But for those interested in building on DeFi and leveraging most of its advantages to improve the financial system, there will be trade-offs even in the best-case scenario. That may not sound like much fun, but growing up rarely is. ",
                    "links": [
                        "https://www.coindesk.com/tech/2021/09/23/why-nfts-are-so-appealing-and-how-anyone-can-start-learning-for-free/",
                        "https://www.coindesk.com/business/2021/10/13/visa-launching-nft-program-to-support-digital-artists/",
                        "https://www.coindesk.com/policy/2021/09/29/gensler-reiterates-support-for-futures-based-bitcoin-etfs/",
                        "https://www.coindesk.com/policy/2021/10/18/crypto-2022-policy-week/",
                        "https://www.coindesk.com/learn/what-is-defi/",
                        "https://www.coindesk.com/markets/2021/01/19/criminal-activity-in-crypto-transactions-fell-sharply-in-2020-says-chainalysis/",
                        "https://www.ey.com/en_us/innovation/how-public-blockchains-are-making-private-blockchains-obsolete",
                        "https://www.investopedia.com/terms/d/distributed-ledger-technology-dlt.asp",
                        "https://www.coindesk.com/business/2021/02/04/what-is-uniswap-a-complete-beginners-guide/",
                        "https://www.nortonrosefulbright.com/en/knowledge/publications/5ee1e37e/new-regulatory-regime-for-crypto-assets-in-germany",
                        "https://docs.swarm.markets/core-concepts/pools",
                        "https://www.coindesk.com/markets/2019/10/14/zcashs-halo-breakthrough-is-a-big-deal-not-just-for-cryptocurrencies/",
                        "https://www.coindesk.com/learn/what-is-a-dao/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.417598334873616
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#6",
                    "likes": "2",
                    "time": "22/10/2021-18:18:13",
                    "content": " Opinion  Lassoing a Stallion: How Gary Gensler Could Approach DeFi Enforcement  The SEC may “pierce the veil” of “decentralization theater” by going after individuals involved in DeFi projects, observers say. By David Z. Morris CoinDesk Insights Oct 21, 2021 at 4:58 p.m. EDT Updated Oct 22, 2021 at 11:44 a.m. EDT  (Justin Sullivan/Getty Images) Earlier this week, we considered the challenges of creating viable long-term regulations for decentralized finance (DeFi) protocols. These systems can ostensibly remove intermediaries from the trading of any asset represented on a blockchain, but those intermediaries have been the ones enforcing rules on behalf of regulators for the better part of a century. That means workable DeFi regulation will likely be much different in substance, and enforced differently, than current securities and finance rules. That rethink may be years away from occurring, but U.S. regulators aren’t sitting idly in the meantime. With Securities and Exchange Commission chief Gary Gensler signaling that he’s paying attention, there’s significant expectation that enforcement actions could target DeFi well before any new regulations become official. Those enforcement actions will likely prioritize instances of clear lawbreaking, such as fraud or money laundering, taking place on DeFi systems. This op-ed is part of “Policy Week,” a forum for discussing how regulators are reckoning with crypto (and vice versa). David Z. Morris is CoinDesk’s chief insights columnist. They will be significant tests for the legal implications of decentralization. And they could get very, very ugly – particularly for individuals running “DeFi” systems that aren’t very decentralized at all. Here, based on conversations with lawyers, former regulators and DeFi executives, are three key points about how things are likely to play out over coming months and years. 1. Enforcement will come before new rules. The first ugly truth about DeFi regulation is that it will inevitably come too late. Systems like UniSwap and Celsius were built in ways that challenge the fundamental premises of conventional financial regulation, but regulators will not be quick to shift their models to conform with the reality on the ground. Meanwhile, DeFi systems continue to grow, guaranteeing they’ll face increasing scrutiny. Jai Massari, a partner focused on trading and markets at the law firm Davis, Polk and Wardwell, predicts a three-step process of reconciling those conflicting truths. Call it the Stages of Regulatory Grieving. “I think it starts off with enforcement,” she says, “because enforcement is easier than regulation.” Those enforcements could be similar to recent actions that have led to large fines for crypto exchanges like Kraken or services like Tether. But they could also go further to include criminal charges against individuals, on which more below. Then we’ll begin to “see an effort [by regulators] to push these DeFi activities into existing regulatory categories,” Massari says. “But I don’t think that’s going to go well. I think it could be quite messy.” In other words, she doesn’t expect serious consideration of a new regulatory framework that actually fits how DeFi works until after regulators spend time trying to hammer square pegs into round holes. In the U.S. context that could include jurisdictional fights between the SEC and other financial regulators. Plenty of crypto operators will rightly view putting enforcement ahead of regulation as shutting the barn door after the horse is loose. To some extent, it’s a consequence of the shifting priorities of a new administration. Trump administration regulators, for better or for worse, made only incremental progress on laying out rules for crypto, much less DeFi, as crypto and DeFi grew from marginal to meaningful between 2016 and 2020. There are signs regulators see things as running out of control. “It appears [Gary Gensler is] aligned with people like [Massachusetts Sen.] Elizabeth Warren that it’s the wild west, that it’s under-regulated,” says Katherine Kirkpatrick, co-chair of the Financial Services working group at the law firm King & Spalding. Gary Gensler and Co., in other words, see themselves as trying to lasso a galloping stallion. That may lead to particularly strong enforcement tactics. “They’re operating from the perspective of trying to solve something that’s the most egregious thing going on using traditional law enforcement tools,” Duane Pozza, a former Federal Trade Commission staffer who is now a partner at Wiley Law. “Because it means there will be fewer limits.” 2. Investigators will “Pierce the Veil” of decentralization. In principle, DeFi protocols run without owners, leaders or managers. Much like Bitcoin, the protocols are in principle just software run by a collection of node operators or validators who neutrally facilitate transactions while collecting liquidity yield and fees. Governance decisions, including changes to the protocol itself, could also in principle be managed by users. But there are still few examples of this in practice today; instead, the reality of “DeFi” in the present is often that it’s a fig leaf for a very clear group of core leaders who are actually in charge. The clearest evidence of this is instances where accounts, tokens or entire “decentralized” systems have been frozen or shut down. “One of the design decisions in an autonomous system is whether there’s a kill switch,” says Stephen Palley, a lawyer focused largely on crypto regulation at Anderson Kill. “The problem with a kill switch is, what’s the liability or exposure of the person who controls it? To be truly autonomous, you can’t have a kill switch. The absence of that is a way to say you’re not responsible.” It’s a grim irony of DeFi’s coming collision with legal reality: DeFi administrators who have been taking direct action to control problematic activity may have given law enforcement clear evidence that they’re actually the ones in charge, making themselves targets. Particularly in cases where there is no legal entity affiliated with a DeFi platform, experts say this could lead to regulators and investigators “piercing the veil” in their DeFi enforcement actions. “Piercing the veil” is a legal term of art normally applied to prosecutions of corporate wrongdoing that target individual officers of the company, not just the legal corporation itself. At least two recent crypto prosecutions have shown the willingness of the SEC and others to pierce the veil of crypto organizations, even those that have conventional corporate structures. One was the SEC’s charging of individuals at Ripple, including CEO Brad Garlinghouse, with an unregistered securities offering. The other was the filing of money laundering-related criminal charges against officers of BitMEX, including CEO Arthur Hayes. Similar direct action against individuals with control over DeFi systems may not be far off. SEC chief Gensler has already made clear that he views most claims of decentralization in DeFi with skepticism. In addition to use of kill switches, law enforcement may look for evidence of control and responsibility in public representations of a protocol’s team, or control of multisig wallet keys. 3. Clarity will not come soon. It will be extremely tricky to craft regulation that controls risks like fraud and money laundering through DeFi while preserving technological advantages like open access, self-custody and democratic governance. That could be worth the trade-off in the long term if new rules are truly crafted carefully. “We’re at a moment where a bit of enlightened thinking about regulation, a little creativity, a little open-mindedness would result in a much better outcome,” says Jai Massari. “I think the best approach is to take a step back and think about the policy objectives we’re looking for.” That process could easily take years. In the meantime, enforcement actions will likely ramp up, perhaps leaving DeFi creators and administrators in the difficult position of defending themselves for breaking rules that simply can’t be fairly applied to the new technology. Even then, there’s no guarantee that competent and well-considered regulation will be the end result. As we saw over the summer with the poorly crafted reporting requirements in the U.S. infrastructure bill, there is still a large technical deficit in technical knowledge among legislators and regulators, and it can have serious consequences. “The technological shortfall is pretty significant,” says Duane Pozza. “The lawmakers have a million other things going on. We’re far away from getting to the point of understanding DeFi. I do think the infrastructure bill was a wakeup call – at least some influential people on [Capitol] Hill had to learn, had to think through this new technology.” That leaves an uncomfortable status quo, at least for those in the world’s largest financial market. For a period that could stretch for years, there will be no changes to U.S. financial regulations to accommodate the way DeFi really works. But at the same time, law enforcement and regulators will likely be making life very uncomfortable for anyone who could be seen as having authority or control over DeFi systems. Unless something changes very soon, that will almost certainly push innovation in DeFi out of the United States, much as huge, centralized crypto exchanges including Binance and BitMEX found it more comfortable to center their operations elsewhere. It’s a message that at least some would-be creators are getting directly from their legal advisers. “I might not agree with the application of certain laws to what my clients do, but I’m not the [Commodity Futures Trading Commission], I’m not the SEC,” says Palley. “I’m just a simple country lawyer and I have to call balls and strikes. “So I spend a lot of time just telling people to stay out of the United States. I hate it, but it’s good advice.” ",
                    "links": [
                        "https://www.coindesk.com/policy/2021/10/19/defi-is-like-nothing-regulators-have-seen-before-how-should-they-tackle-it/",
                        "https://www.coindesk.com/policy/2021/10/18/crypto-2022-policy-week/",
                        "https://markets.businessinsider.com/news/currencies/cftc-fines-crypto-exchange-kraken-125-million-margined-products-illegally-2021-9",
                        "https://www.cftc.gov/PressRoom/PressReleases/8450-21",
                        "https://www.coindesk.com/podcasts/the-breakdown-with-nlw/how-decentralized-is-defi/",
                        "https://www.sec.gov/news/press-release/2020-338",
                        "https://www.coindesk.com/podcasts/the-breakdown-with-nlw/how-decentralized-is-defi/",
                        "https://www.coindesk.com/markets/2021/08/19/gary-gensler-isnt-buying-your-decentralization-theater/",
                        "https://www.coindesk.com/tech/2020/11/10/multisignature-wallets-can-keep-your-coins-safer-if-you-use-them-right/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.156282743207086
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "2",
                    "time": "27/01/2022-20:41:35",
                    "content": "In case you missed it, 650 pages and 30 days to respond to the Proposed rules by the SEC–posted 24 hours ago: https://www.sec.gov/rules/proposed/2022/34-94062.pdf And Gabe Shapiro’s call to Action: Urgent Considerations of Impact on Blockchain/DeFi of the SEC's Proposed Regulation ATS Amendment \"Just as one easy way to illustrate the seriousness of this issue, under this new rule, EVEN A BLOCK EXPLORER LIKE ETHERSCAN could be argued to be a SECURITIES EXCHANGE because it could be argued to constitute a COMMUNICATIONS PROTOCOL through which buyers and sellers can interact with smart contracts to communicate TRADING INTEREST resulting in a trade. If the SEC in fact intends such a result, it is clearly unacceptable, and should be deemed an unconstitutional restraint on free speech.\" ",
                    "links": [
                        "https://lexnode.substack.com/p/urgent-considerations-of-impact-on?justPublished=true"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6577681577681584
                }
            ]
        }
    ]
}