{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/6s-capital-audited-financial-statements/14420",
            "title": "6s Capital - Audited Financial Statements ",
            "index": 14420,
            "category": [
                "Governance"
            ],
            "tags": [
                "risk",
                "sixs",
                "rwa-001",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "3",
                    "time": "04/04/2022-03:44:08",
                    "content": "As outlined in the Credit Agreement, 6s Capital Partners LLC (“6sCP”) must complete an audit of its financial statements after each calendar year and deliver the results to the Trustee.  Why is it required in the Credit Agreement? As 6sCP is a financial ratio driven operating business, oversight on the amount of equity in the business is an essential component. The more equity the company has, the more credit 6s has access to (constrained by the debt ceiling). Thus the audit is the ultimate “oracle” for real-world assets. Including the audit in the Credit Agreement was not a requirement demanded by the MakerDAO community. 6s, foreseeing this would be appropriate, needed, and customary, volunteered to have this added as a compliance and safeguard to protect all parties. As anyone in financial services that has been in or around a GAAP audit knows, completing the audit and then receiving a clean opinion is an accomplishment and not issued easily. This audit is the independent certification that the numbers in the financial statements have been reviewed and inspected. Further for operating businesses that are in the non-bank lending space, auditors inspect originated loans (closing statements, line-by-line, etc) to ensure that they are compliant with applicable documents. (This last part is >> essential << for the DAO). A U.S. GAAP financial statement audit is a milestone and from our lens should be a required component for all RWA DAO participants. If the Securities and Exchange Commission requires that all publicly traded companies file annual reports with GAAP audited financial statements, so should the DAO. The DAO should leverage external service providers to scale (including auditing services and intentionally avoid the private entanglement of trying to accomplish the same with a core unit). To that end, 6s is happy to announce that the 6s Capital Partners LLC - 2021 financial statement audit was completed by Watkins Uiberall, PLLC. Further, it was issued “clean” and has been shared with RWA Company LLC and WSFS. Additional links:   Law Insider    US GAAP Audit Definition | Law Insider Sample Contracts and Business Agreements         CFA Institute    US GAAP: Generally Accepted Accounting Principles Learn about the Generally Accepted Accounting Principles with CFA Institute. The US GAAP are a set of standards for financial reporting adopted by the SEC.      ",
                    "links": [
                        "https://www.wucpas.com/",
                        "https://www.lawinsider.com/dictionary/us-gaap-audit",
                        "https://www.lawinsider.com/dictionary/us-gaap-audit",
                        "https://www.cfainstitute.org/en/advocacy/issues/gaap",
                        "https://www.cfainstitute.org/en/advocacy/issues/gaap",
                        "https://forum.makerdao.com/t/rwf-001-monthly-update-april-2022/15024",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-31-april-6-2022/14502"
                    ],
                    "GPT-summary": "The post explains why an audit of financial statements is required in the Credit Agreement of 6s Capital Partners LLC. The author of the proposal explains that the audit is necessary to oversee the amount of equity in the business, which is an essential component for a financial ratio-driven operating business like 6sCP. The post also suggests that a U.S. GAAP financial statement audit should be a required component for all RWA DAO participants. The 6s Capital Partners LLC - 2021 financial statement audit was completed by Watkins Uiberall, PLLC and was issued \"clean.\"",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.575268817204301
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "04/04/2022-18:21:12",
                    "content": "    mrabino1:  has been shared with RWA Company LLC and WSFS.   Thanks for the this forum post Matt. When can we expect to see a published report by RWA Company LLC @g_dip @maxglass as well as a report of the closing of the Tesla collision deal? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#3",
                    "likes": "0",
                    "time": "04/04/2022-18:23:34",
                    "content": "    flipflopflapdelegate:  WA Company LLC   Why would RWA Co., LLC submit a report to us (the DAO) – they are simply an advisor to 6S? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/04/2022-18:25:31",
                    "content": "err what am I missing here Introducing the Real World Asset Company (\"RWA Co.\") ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#5",
                    "likes": "5",
                    "time": "04/04/2022-18:48:05",
                    "content": "Our agreement with RWF is that our report will be submitted to the forums a week after the end of the month (the month of the reporting period, that is). So you can expect it by April 8th. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "1",
                    "time": "04/04/2022-19:34:55",
                    "content": "Thanks for clarifying. Will let the delegates know & looking forward to it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#7",
                    "likes": "0",
                    "time": "04/04/2022-20:33:58",
                    "content": "Cool – that makes sense. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#8",
                    "likes": "1",
                    "time": "04/04/2022-21:41:31",
                    "content": "    g_dip:  So you can expect it by the April 8th.   @g_dip Thanks for clarifying those dates here too. As the attesting party to the 6s transaction, we are looking forward to receiving your April report. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "05/07/2022-03:41:38",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}