{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rwa-6s-2022-a-time-to-start-walking-part-4/12424",
            "title": "RWA - 6s - 2022 - a time to start walking - Part 4 ",
            "index": 12424,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "sixs",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "2",
                    "time": "31/12/2021-05:57:43",
                    "content": "(Thread continued from RWA - 6s - 2022 - a time to start walking - Part 3)  RWA - 6s - 2022 - a time to start walking - Part 4  The DAO needs more LendCOs / Arrangers Even with the targeted collateral portfolio outlined in my previous post, 6s Capital >> wants << other arrangers in the DAO ecosystem. At the time of this writing, there are ~9 Bn DAI outstanding. As DAI continues its geometric growth into 2022 and beyond, the ability for on-chain collateral to be able to keep up is hopeful, but unknown. As a result, the DAO may find itself needing to massively ramp up off-chain, real world asset (RWA) collateral if it does not want to be cornered into continued reliance on stablecoins. 6s’ debt ceiling, contemplated in 5 years, is small in the context of the current amount of DAI outstanding let alone what may be in place in future. As a result, 6s believes it will only (and should only) represent a small percentage of the DAI collateral market. And to ensure that 6s does >> NOT << have a disproportionate percentage of RWA collateral in the system, the DAO >> needs << other market participants to join. (Please DM if you are interested, 6s will help you!)  A system of constraints From a lender’s perspective, first authorization for a scope is obtained and >> then << staff are engaged to work with borrowers to identify solid collateral and make loans while operating within the constraints of its authorization. This approach with regards to an expanded scope and authorization is quite similar to the book “Playing to the Edge”. Just because a lender has authorization, doesn’t mean it will use all of it (to use the analogy in the book It will not use the entire playing field). BUT, it makes all the difference for a lender knowing that it can if needed or desired. This transactional certainty drives a productive decision making process / environment for lenders. A lender cannot engage with a borrower with the narrative of “I hopefully will be able to lend in this space in X months”. It must be, “I know I can lend to you if you can deliver appropriate collateral”. An example of not making use of a full authorization can be seen in 6s’ history to date. Because 6s’ was set up with a financial covenant compliance-driven lending structure from the start, 6s’ authorizations were based on certain covenant “ratios” (for example, the amount of debt outstanding against the value of collateral). 6s would be in breach of its authorizations, and its Credit Agreement, if these ratios were breached. Knowing therefore that a breach would be catastrophic, 6s will not allow, nor even get close to those ratio thresholds. It is simply not worth the risk. (In addition, as previously outlined, 6s is also driven to operate well within its authorizations because it includes a “first loss equity component”. This means that in the event of non-performance of loans the owners of 6s make a loss before the DAO faces exposure.) It is impossible today for 6s to accurately predict which sector will anchor its business in five years. Instead, given the constraint for >> ALL << lending activities for 6s (as they relate to being an Arranger for the DAO) is the total debt ceiling and compliance with financial covenants, the sector in which we lend is less important compared with making sure the terms for the underlying loans enable us to comply. The lending space is dynamic. The sectors 6s will focus on will be largely driven by market trends, industry expertise, societal impact, staff ability, regulation and of course, profit.  Running an operating business, not an investment fund This is an important distinction for the community to be aware and mindful of. For the avoidance of any doubt, 6s Capital’s business model is that of running an operating business where 6s operates as a senior secured >> lender <<. 6s is not running an investment fund and has no plans to hold securities. 6s has access to other sources of funding aside from the DAO Credit Agreement(s) These range from a variety of classes of equity (both “common” and “preferred”), alongside an additional source of external credit (a “revolver”) that has its own allowable authorizations in the form of certain collateral types and financial covenants. Should 6s make a loan that does not fit within the authorizations of the Credit Agreement(s) extended from the DAO (in the form of the RWA Senior Lending Trust), 6s must finance that loan from another of its funding sources.  6s Forward Guidance In 2022 we look forward to starting to “walk”. Under the currently approved lending scope, our transactional lending pipeline continues to solidify and strengthen. 6s has three existing borrowers planning for an expansion that will significantly increase our loan book, and as a result our credit needs, both in 2022 and into 2023. Today, 6s has ~$20MM in loans outstanding on a portfolio of projects. Our pipeline of transactions will require ~$40MM in additional credit during the course of the next 6 months alone. As the engagement with certain key tenants (like Tesla) increases as they ramp up their development pipelines, transactional certainty becomes ever more important to 6s. The pipeline in Q3 & Q4 2022 should be ~$100MM (or more) with materially >> more << in 2023. 6s will need increased debt ceilings as part of its authorizations under its Credit Agreement(s) with the DAO, in order to transact this increasing quantity of loans with certainty. What’s more, this credit requirement guidance is specifically related only to 6s’ currently approved scope (credit tenant leases). Should the approved scope change, our debt ceiling values may need to be adjusted upwards accordingly.  There will be bumps There is significant work to do to successfully start walking. Lots of work ahead for the 6s team to stand-up operations and run this lending business. It will be a while before we have “smooth sailing” for 6s or the DAO as it relates to building a portfolio of off-chain collateral in the form of RWAs. However, I can tell you it will be interesting, and 6s will not quit. Not on my watch, it is simply not an option. We all want this to go faster, but the fastest we should go is the pace of “safe” (yet aligned with incentives). A walk. We have a world that needs changing, and we need more Arrangers / LendCOs to do it in a pragmatic way. And then, we will run. Buckle up MakerDAO. Time to build and expand !! (/fin) ",
                    "links": [
                        "https://www.amazon.com/Playing-Edge-American-Intelligence-Terror/dp/0143109987",
                        "https://forum.makerdao.com/t/mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14482",
                        "https://forum.makerdao.com/t/addendum-for-mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14481",
                        "https://forum.makerdao.com/t/forum-at-a-glance-dec-16-2021-jan-6-2022/12507"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.829633763227513
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "31/03/2022-15:24:22",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/rwa-6s-2022-a-time-to-start-walking-part-2/12392",
            "title": "RWA - 6s - 2022 - a time to start walking - Part 2 ",
            "index": 12392,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "sixs",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "4",
                    "time": "28/12/2021-02:08:13",
                    "content": "(Thread continued from RWA - 6s - 2022 - a time to start walking - Part 1)  RWA - 6s - 2022 - a time to start walking - Part 2  What is 6s’ strategy going into 2022 and beyond? 6s continues to expand in its starting / anchor business of credit tenant lease lending while identifying the next markets in which to expand. Profit is an important motivator but can be jeopardized by growing too quickly. 6s, as a lender, must be race-fit before it \"Runs”. It is not a state to enter unprepared. So before running, 6s must “Walk”. What does that mean? Put simply, 6s will be making new loans and growing, but willfully and intentionally holding ourselves back from aggressive capital deployment. It means constructing a well-rounded diverse portfolio, while always being there for its borrowers that bring repeat business. As 6s walks, it understands that credit concentrations to some borrowers will happen along the way. But a successful walk will mean 6s sustainably grows to a size where there is no trade off between credit concentration and getting repeat business from those existing borrowers. During 2022, 6s will be working with the Maker community to expand its lending scope to allow a successful walk: enabling horizontal scaling (expanding to new lending sectors), in addition to scaling within the initial sector of Credit Tenant Leasing (“CTL”).  So what is the right path? 6s has spent a significant amount of time debating the right strategy to grow to the point at which we breach the barrier of geometric scale. One key question is whether to focus on originating loans ourselves, or take part in bank participations (described in Part 1). A strategy that went for exclusively self-originating loans may be the way to have the most early impact, but is probably too risky and expensive to be a successful path to scale while we walk. 6s believes the right path will be a healthy portfolio allocation to bank participation in the near term while maintaining the existing CTL borrowing base and expanding carefully and selectively to new sectors with the best prospects for success. How do we successfully walk the path? Answer: By possessing the discipline to always focus on the end goal of scale and diversity, and persisting to achieve it, while at the same time being pragmatic about the tactical decisions along the way. It is a bit like sailing; winning teams are always focussed on reaching the finish line fastest, but are constantly making decisions as to how to tack back and forth to get there. While 6s is walking the path, our loan portfolio will not be perfectly ratioed. It will not stay constant. Loans are going to come in lumps, and growth is going to come in phases, before we get to the “goldilocks” portfolio allocation that is targeted.  So what is 6s’ objective? Change or scale? Well, yes !!  They are two parts of the same equation. But first, we scale. This helps the DAO remove exposure to existing stable-coin collateral and provides some needed lending revenue (to all parties). One of 6s’ most attractive features to borrowers will be a low cost of capital, making for affordable and flexible loans. This will be very helpful in building scale. That said, competing with TradFi banks purely on price is not the core longer-term objective for 6s (nor do I believe it should be for the DAO as a whole). As we have already said, this process cannot be rushed. 6s must establish its base and stand up operations. We must make sure it has sufficient (first-loss) equity in place (with the plans, and legal docs) in order to prudently lend, while identifying sources to allow for orders of magnitude more. We don’t know what we don’t know, but 6s is already seasoned at handling challenging situations. As we grow, making sure we have the right team, with top quality legal counsel will be paramount… and quitting, well, that is for the other guy. Not on my watch.  Growth is the solution, pragmatic growth To grow, 6s needs certainty from its super-senior creditor, the RWA Senior Lending Trust (the legal embodiment of the DAO). I’ll talk more about what exactly that certainty might mean in future posts. With certainty in place, 6s has the relationships to raise equity and put its Credit Agreement(s) to use making loans. 6s operates in a senior-secured, financial-ratio compliance driven structure. This means that the more equity there is in 6s, the more credit it can deploy through its Credit Agreement(s). This is by design to ensure a scalable first-loss buffer “lending machine”.  Portfolio Allocation Credit Tenant Lease (“CTL”) finance was a great place for all of us to start. The underlying credit quality is known. No singular deal was large enough to ever bring 6s down. It provided bite-sized transactions that allowed us (collectively) to get started. However, the term on CTL debt turns too fast to build a seriously scalable lending operation that has a sustainable outstanding balance. CTLs should without question be >> part << of the portfolio but not the entire thing. 6s’ upcoming future proposal will incorporate this. “Coming soon.” As we approach 2022, I have been asked multiple times by different DAO participants, “What is 6s’ plan to grow, in general?” Here is a thought experiment for what a target portfolio might look like in five-years, combining CTL and Clean Money initiative lending.  1598×904 95 KB   |624x1217.7373598582997820×1600 187 KB  Fundamentally, 6s is aiming to add the Clean Money initiative announced by @rune as new targeted sectors for lending. As I responded back then, this is as big as someone can dream, and 6s will step up to answer this call. 6s is putting staff and resource plans together for 2022-23 to enable us to access this opportunity. For the avoidance of any doubt, 6s has zero desire to ever deviate off of the senior secured position as a lender. There are others that can assume a junior debt role (and be paid very well for that risk). 6s is just not interested in that risk profile as a lender. 6s acknowledges there is some degree of dislocation with its historically approved CTL collateral and the Clean Money initiative. Any business that wants to survive long-term must evolve. It is too early to know how certain CTL borrowers will evolve in a new “clean” world. They too will need capital to evolve, which 6s may be able to provide. As a proactive step, 6s will be monitoring existing CTL borrowers and self-constraining lending to some until such time as the underlying collateral fits within the “Clean” category (e.g. the underlying collateral changes their operations)… For today, CTL still serves an important baseload loan origination purpose. As mentioned in a previous post, bank participations are an important aspect to short-term diversification and risk-mitigation. That said, simply “trading paper” by entering into bank participations will probably not change the world. Self-originated, targeted lending >> will << . While 6s will almost always make use of bank participations as part of its overall collateral portfolio, we intend to ramp-up self-originated lending activities over time. Slowly and cautiously, the proportion of bank participations will fall as they are displaced with self-originated targeted loans…  986×344 40.9 KB  To be able to execute on the Clean Money Initiative, seasoned transactional experience is a must. Whether self-originated loans or bank participations, there is no substitute for competence and the scars from when things went sideways. Alongside that, engaging with top legal counsel is just simply a prerequisite for even starting. The wisdom that can be gained from seasoned counsel is something that cannot be replicated (ours have thirty plus years of legal experience (individually)). When put all together and led with a steady-hand, each participant (internal & external) works as if in a well-tuned orchestra for consistent execution. This part simply cannot be coded.  What further engagement is needed between MakerDAO and 6s to allow a more diverse portfolio? That is the heart of an upcoming post that is “coming soon” that will deep-dive into the details. One thing is certain, 6s will struggle to accomplish its mission for a diverse portfolio with the currently approved scope. That scope served its purpose to get 6s started but needs to evolve alongside 6s to make for a successful “walk” for everyone. (Thread continued: RWA - 6s - 2022 - a time to start walking - Part 3 ) ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1HpFkCcGUGmQvGeyQIbwMZAQRTA74yxgm7cuOXUQODa0/edit?usp=sharing",
                        "https://forum.makerdao.com/t/the-case-for-clean-money/10684",
                        "https://forum.makerdao.com/t/the-case-for-clean-money/10684/29",
                        "https://forum.makerdao.com/t/the-case-for-clean-money/10684",
                        "https://forum.makerdao.com/t/rwa-6s-2022-a-time-to-start-walking-part-3/12408",
                        "https://forum.makerdao.com/t/mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14482",
                        "https://forum.makerdao.com/t/addendum-for-mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14481",
                        "https://forum.makerdao.com/t/forum-at-a-glance-dec-16-2021-jan-6-2022/12507"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.947795664983165
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "1",
                    "time": "28/12/2021-15:58:28",
                    "content": "Thanks for the update Matt. I appreciate how meticulously focused you and the team are on getting the internals right before prioritizing aggressive growth—we build amazing things when we care about getting them right and that’s the ethos i’ve sensed with your project from the beginning. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.714285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#3",
                    "likes": "7",
                    "time": "28/12/2021-17:56:11",
                    "content": "We have all had the pleasure to interact with @mrabino1 for a while, and I can’t stress enough how supportive and open he has been to the research efforts that myself, @williamr, and the rest of the Community have conducted over the last months. Matt’s intention to be the intermediate layer between the protocol and a diverse set of individual borrowers is consistent with the view we have outlined as part of the Real-World Sandbox effort, which is for Maker to become the ultimate senior lender and leverage intermediaries to provide operating leverage and risk buffering. In addition, Matt has been working with other intermediaries to cross-pollinate innovation and thinking around structuring and I do believe this to be beneficial and in line with the principles of decentralisation and collaboration that have characterised the DAO for a long time now. As the 6s efforts move to the implementation phase, i.e. to the details phase, a mutual agreement should be found between parties in order to satisfy 6s’ business needs and Maker’s risk, legal, and technological requirements. We shouldn’t forget that in providing credit at the rates that Maker is able to achieve, such details are very important, as we are not a VC but rather a senior (and hopefully one day programmatic - as it happens for crypto collaterals) lender. As we are in the experimentation phase, this is far from being easy, but the whole team is working hard together with 6s to find common ground. More specifically, in providing sticky senior financing to 6s vs a diversified pool of collaterals, we should ensure that 6s maintains flexibility and certainty, while Maker keeps the required risk-absorption buffers, clear debt covenants, and a structure that allows the protocol to retain visibility and control over the ongoing lending practices and the collateral assets. We are all looking forward to engage, with the ambition of being able to provide the Community with the most comprehensive deal package - Term Sheet, Risk Assessment, Legal Report, Technological Report. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.81231884057971
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "28/03/2022-17:56:46",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/rwa-6s-2022-a-time-to-start-walking-part-3/12408",
            "title": "RWA - 6s - 2022 - a time to start walking - Part 3 ",
            "index": 12408,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "sixs",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "4",
                    "time": "30/12/2021-03:04:40",
                    "content": "(Thread continued from RWA - 6s - 2022 - a time to start walking - Part 2 )  RWA - 6s - 2022 - a time to start walking - Part 3  Being mission driven 6s has a vision for change and for utilizing this unprecedented power for the benefit of all. Thus far, 6s has invested significant capital in the construction of its lending structure and shared this valuable knowledge and legal framework with the community. This is not a vision that is only about metrics and measured by capital deployed and deals done. Rather this is much larger. It is about change. Not only the source of capital and putting it to a targeted use, but rather the people that engage around that. No need to think small. From 6s’ lens, we want to change the mentality of a city and how that city is viewed to the world. When folks think of San Francisco (or more broadly the Bay Area), start-ups, incubators, and venture capitalists come to mind. That didn’t happen overnight; it happened because a hotspot of innovation was concentrated into one geographic area over a sustained period of time. Today, when folks think of New York, it is viewed in the context of big investment banks and the markets. When folks think of Houston, they think of the oil & gas sector. So what do folks think of a city like Dallas, Texas? Maybe they view it mostly as a city of real-estate and corporate headquarters, with some remnants of oil & gas. 6s wants to change that – to include clean money initiatives at the scale to ultimately change a city, not just be a lender… A lender’s lender, mixed with self-originated loans, focused and targeted to a mission. 6s wants to change how Dallas operates, as a hub of innovation and value, and to change how the city is viewed by the rest of the world as this powerful credit facility takes root. 6s has a vision, and it is not small.  Character matters. This shouldn’t be a surprise, humans matter. No smart contract can nor should ever be able to perfectly predict or define human outcomes. We can code it all day long, but the character, integrity, and soul of a person matters. Period. The legal systems that have grown to support advanced economies exist specifically because disputes arise. People breach contracts and understandings. Harmed parties want relief. Courts are there to interpret the law to allow for resolution. For a lender, just like for everyone else, avoiding costly legal processes is always the ideal. A lender that has no “upside” but only wants its money back with interest, making this even more pronounced. Embedded within all good lenders is the process of building a comprehensive awareness of risks associated with loans, and then mitigating each risk as much as possible, moving it to the borrower (where it squarely belongs). Given the importance of character, an Arranger must make a subjective character evaluation before lending to any borrower (in addition to the underlying economics). This is not a question of money or wealth, but character. In most cases an Arranger will, for the most part, know before a loan is ever issued if the borrower is a person of their word. Things go sideways. Deals and projects do not always go precisely to plan (in fact I’ve never seen a project go precisely to plan). That is life. The real question is “will the borrower make it right” when it happens. Make no mistake, for lenders, the subjective character analysis can be equally, or more, important than the quantitative analysis when engaging with potential borrowers. Every lender wants the borrower to “win”, but the prudent way to achieve this is to “plan for the worst and hope for the best.”  “… [On being asked ‘Is not commercial credit based primary upon money or property?’] No sir. The first thing is character. [‘Before money or property?’] Before money or anything else. Money cannot buy it… Because a man I do not trust could not get money from me on all the bonds in Christendom… “ - JP Morgan  The community must also by proxy make the same character evaluation for each Arranger that comes forward. For an Arranger, there are many qualities that must be in place to succeed, many of which the community never sees (nor needs to). The community should know that they exist though. These qualities include by are not limited to:  Reputation (in front of the community / trustee / borrowers / investors / social) Ability to execute for a borrower (the good old-school business handshake, which very much still matters and >> always << will) Following legal best practice, for example, ensuring securities law compliance related to any securities offerings for the first-loss equity  Compliance with law, including federal securities law, is always the base ingredient for success, with just about everything else vital is tied to a good reputation. If an Arranger cannot perform as a lender, its deal pipeline dries up, and it becomes the walking dead. Ability to say what you will do, and then do what you say is everything. While each community participant cannot conduct their own deep-dive psychological evaluation on each Arranger, the community can rely on an alignment of incentives and community engagement, as measured over years, as a decent gauge. In this years-long process there will be no handbook nor checklist that defines when a person or company “passes” this character evaluation, but like meeting your future partner (business or other), you know a winner when you meet one.  Everyone wants the same thing… Certainty. Borrowers want certainty. Maker wants certainty. Investors (in 6s) want certainty. Therefore 6s wants certainty. We all want the same thing, a core ethos of good commerce, and by proxy that of a good (debt) investor… Certainty. As it walks, 6s wants to build a diverse portfolio of collateral, and to do so, 6s will request that the Maker community authorize scope increases when the time is right.  Staff needed 6s will staff its operations in accordance with its underlying transactional needs. Based on the five year projected target portfolio, 6s will need to expand its team to bring on industry experts and “jack-of-all-trades” professionals alike. Uniquely, the lending business is quite a scalable business that directly confronts those with the “sickness of the zeros”: doing a ten million dollar deal, and doing a one-hundred million dollar deal, require the same amount of paperwork. As we’ve just discussed, Lenders like to execute with certainty, so staffing for new and unapproved sectors will likely be deferred until such sectors are approved. And when staff are employed, they will be selected with the utmost care for character, so that 6s’ own good character can be protected. (Thread continued: RWA - 6s - 2022 - a time to start walking - Part 4) ",
                    "links": [
                        "https://forum.makerdao.com/t/rwa-6s-2022-a-time-to-start-walking-part-4/12424",
                        "https://forum.makerdao.com/t/rwa-6s-2022-a-time-to-start-walking-part-2/12392",
                        "https://forum.makerdao.com/t/rwa-6s-2022-a-time-to-start-walking-part-4/12424",
                        "https://forum.makerdao.com/t/forum-at-a-glance-dec-16-2021-jan-6-2022/12507",
                        "https://forum.makerdao.com/t/mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14482",
                        "https://forum.makerdao.com/t/addendum-for-mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14481"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166407279314888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "30/03/2022-03:05:06",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/rwa-6s-2022-a-time-to-start-walking-part-1/12380",
            "title": "RWA - 6s - 2022 - a time to start walking - Part 1 ",
            "index": 12380,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "sixs",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "6",
                    "time": "27/12/2021-02:48:01",
                    "content": " RWA - 6s - 2022 - a time to start walking - Part 1  “Crawl. Walk. Run.” This simple yet powerful statement is intended to convey the need for a continued pragmatic approach for onboarding real-world assets as collateral for the DAO. While it is tempting to sprint during a marathon. to successfully finish an endurance event, preparation, discipline (especially when no one is watching), and execution makes all the difference. To even contemplate crossing that finish-line, preparation is something that cannot be skipped. There are no shortcuts. Period. Building a lending platform for real world assets requires planning, implementation, and execution — a never-ending endurance marathon.  Crawl  Brainstorm ideas and engage with professional experts and vendors Establish the legal framework and “test” the financial circuit. Establish forms for all transactional documents. Establish underlying underwriting requirements and process. Engage with equity participants to ensure financial ratio compliance. Close on some underlying transactions to hammer out the above process …and then adjust, improve and repeat!  There are no shortcuts.  Walk Build on the lessons learned from the above and expand lending operations both vertically (more lending to existing borrowers) and horizontally (lending to new borrowers, in new sectors). Deploy capital. Staff accordingly.  Run 6s builds up speed and ramps up capital deployments once we >> know << victory is only a question of due diligence, execution, endurance, and a lender’s best-friend, time. Today, going into 2022, 6s is no longer crawling but is standing… and about to start walking.   Where are we headed (Community & 6s) To address this, let’s fast forward the video five years and see what this entire construct will look like (more or less) and then back our way into the steps needed to enable that construct. From Maker’s perspective: In five years, the DAO will hopefully have several (more than 10) well-capitalized “Arrangers” per major geographic region. Each will be acting as a non-bank private lender providing senior secured loans they either originated themselves (sometimes acting as a wholesale lender) or through bank participation (where loan underwriting and servicing is being undertaken by another bank). To date, virtually all applicants to Maker have been seeking credit, rather than seeking to arrange credit for others (to be an Arranger). In five years, applicants would choose which path to take. The few who wish to be Arrangers go down the MIPs path to be onboarded; the majority who are borrowers (with real world assets that could be pledged as collateral) would be directed to Arrangers. As the number and quality of applicants rises, overall risk falls, and so can governance’s engagement with Arrangers and have the Core Units engage behind the scenes. For 6s: In five years, 6s is aiming to be an active lender (with Maker as its super-senior credit facility) in a variety of different sectors with a short, medium, and long-term loan portfolio. Its portfolio will include self-originated and externally originated loans including “bank participations” (described below). 6s will have stretched to develop this diverse portfolio. 6s will have built the right team to execute this mission, adding the right people at the right time. A “bank participation” in this context is when an Arranger enters into a loan alongside other participants, who typically include one or more regulated banks who make use of these types of loan to diversify their portfolios. Control over the collateral (the “senior lien”) is shared amongst the lenders in proportion to their participation (“pari passu”). In a bank participation, another lender would manage the loan (the “lead bank”), including underwriting and servicing it, while the arranger simply puts up capital. This is done to spread the risk and deploy capital further across the borrowing landscape. In effect, the arranger will have the same “deal” as the bank but only needs to use capital, the underlying relationship and servicing is outsourced. Transactions have a lead bank, but the remaining participants (including the arranger) need only to tap into the transactional flow. 6s intends to have a decent percentage of its future mature portfolio utilizing bank participations and views this as an important step in diversifying its underwriting and collateral risk with institutional participants, especially early in its growth, tapering lower as the Arranger infrastructure matures. Why taper? Because just doing bank participations would cause the Arranger to simply be “just another senior lender.” While that could be a useful way to deploy capital, it does not have the potential economic or social impact of self-originated targeted lending. 6s wants to have a big positive economic and social impact, and can best do that by continuously maintaining a healthy balancing act between the different types of lending.  Intentions 6s is here for the long-game and is honored (and humbled) to be a part of the TradFi to DeFi revolution. Individually, the principals behind 6s are financially independent and could finance existing enterprises with TradFi only. 6s and its team are here because we want to be, not because we have to be. The 6s team wants to make a positive contribution to humankind on a large scale. Compared with its chain-collateral cousin, an Arranger has more similarities to TradF than DeFi. One of the big differences is that there are live people running 6s, as an Arranger. We are not anons that the community doesn’t know. As this very post is on a forum platform that allows for private messages, anyone can reach out to me directly (or on telegram / discord / facetime / signal / POTS). What difference does that make? For some historic ETH collateral only vaults, the community used to debate the reasoning for some borrower decisions. As 6s is not some anonymous random participant, rather than the need for community debate on what drives a 6s’ decision, anyone can just call and ask us. This applies for portfolio construction (short, medium, and long term) as well. 6s actively welcome the dialog with a would-be RWA Portfolio core-unit, and collaboration and communication more broadly. It is important to always keep in context what role capital plays in economies and society. The availability of capital determines the what and when of every aspect of our world (research, innovation, power, infrastructure, food, housing, welfare, conservation, environment, and giving — literally everything). Capital, however, is not endless. It should not be wasted or lost, rather it should multiply. Doing so requires wisdom and a seasoned team to deploy it with preservation in mind. (Thread continued: RWA - 6s - 2022 - a time to start walking - Part 2 ) ",
                    "links": [
                        "https://forum.makerdao.com/t/rwa-6s-2022-a-time-to-start-walking-part-2/12392",
                        "https://forum.makerdao.com/t/forum-at-a-glance-dec-16-2021-jan-6-2022/12507",
                        "https://forum.makerdao.com/t/mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14482",
                        "https://forum.makerdao.com/t/addendum-for-mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14481"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.528636046493189
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "4",
                    "time": "27/12/2021-10:17:34",
                    "content": "I almost put this in another thread or discussed privately but this thread is a good place to put these questions. When I look at RWA and 6s in particular I see loans in the 1-5M range with a 1-2 month lead and a 12-24 month completion. This is reminding me of the questions I asked about how Maker with MCD gets to 1B two years ago now…   Do we really do this 1-10M at a time?   My feeling was this wasn’t the way Maker was going to get to 1B and honestly it wasn’t.   What happened with Maker is that ETH basically 20x’d, adding wBTC, and the PSM(now paying nothing and backing almost 1/2 of all DAI) was the prime way Maker has gotten to 10B DAI. So here is the question for 6s and regarding the concept above. How does Maker scale to 20B much less 100 to 1000B based on Arrangers doing deals in the 1-5-10M ranges?   I mean sure banks do this all the time.  It requires lots of people and time to create and manage pipelines.  These loans have limited lifetimes. I keep thinking ok scale arrangers linearly, and arrangers scale their loans roughly linearly, but this is going to roughly mean manpower scaling as the square (or linearly with TVL).   From these deals and collateral I think Maker will do pretty well on the return for the loans but I don’t see DAI outstanding scaling to B’s quickly.   We limit risk to some extent because any one arranger with one or a couple bad loans isn’t going to impact Maker to any significant extent.  We need more of a systemic event of some kind (either with a particular arranger, or with all of them via some market or rate event). When I look at the other side of this RWA equation - things like bonds could increase DAI substantially, but the rate of return for this expansion is going to be near zero.   Literally the eurobond being proposed is paying a 0% return.   Sure Maker will have a collateral cushion for currency risk etc but the return to float 20-50-100M or more DAI at a time for bonds is going to be nothing. I have a real concern here that with a reduced market capitalization (MC) for Maker in the 2.6-3B range relative to DAI outstanding (10B), and collateral assets available (20B TVL currently) the growth path to 100B or more is going to be a difficult road which won’t lead to much revenue growth and this is going to put risk pressure across the board on DAI and Maker generally. Matt given the post above and upcoming Part 2 do you have a good idea for how RWA is going to even get to 10B in the next 2-3 years much less 100B in 5 with a reasonable return that doesn’t put MKR and DAI holders into a higher risk environment with less return? FYI:   This 10-20B or 100-200B RWA I have as just 1 of 5 components of what Maker needs to build to 100B-1000B DAI. I think Maker here at 10B DAI outstanding (almost 50% of this is backed by stables paying nothing btw) with 160M revenue and what 130M net per year (numbers changing) is actually quite good.  Prudence says that since we are going pretty well to take a bit more care and time to plan our moves to get from 20B TVL with 10B DAI outstanding to 40B TVL and 20B DAI. 1B was seen for a long time as a key target.  Maker hit that and is tapping on the 10B door in a short 12months.   It is easy to lose track of a steady path (crawl, walk, run) and try to move quickly to 100B. It is my hope here when Maker looks at RWA we focus on a sustainable path that doesn’t multiply our risk factors.   My main concerns at this point is that our MKR market cap (this is the backing for DAI) is weakening dramatically relative to DAI outstanding and the surplus buffer won’t suffice to back a single loss event of 2-5% of our outstanding DAI and we are looking to broaden the collateral profiles here to expand DAI. So my questions to you are:   How do you see the Maker side of this dealing with growing further without additional significant protocol risk and likely losing on the revenue growth side (returns for DAI growth will continue to dwindle creating a increasing risk hazard that the backstops can’t handle)?   Do you have any ideas for how governance can improve the protocol backstop measures Surplus Buffer/MKR to be able to backstop this massive growth in DAI that we want to see?   Should we limit protocol growth to some ratio of DAI to SB+MKR market cap ratio?  Right now it is 4:1 (meaning 10B DAI being backed by roughtly 2.5B MKR MC + SB).   During Black Thursday this was 1:4 (600M MKR MC + surplus to 150M DAI).   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.903886554621849
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "27/03/2022-10:17:49",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "494"
}