{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/daif-cu-update-q4-2021/11736",
            "title": "DAIF CU Update - Q4 2021 ",
            "index": 11736,
            "category": [
                "Core Units",
                "Dai Foundation"
            ],
            "tags": [
                "cu-update",
                "daif-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#1",
                    "likes": "10",
                    "time": "19/11/2021-14:57:40",
                    "content": "Hello all A bit of news from DAIF Core Unit We have now a public list of the Asset Dai Foundation currently are holding:   docs.google.com    Dai Foundation Asset Registry Asset Classes  Name,Technical Delegation Manager,Allocation Administrator,Delegation Method,Usage Conditions,Allocation Policy Web2 Domain,TechOps CU,Maker Governance faciliated by GovAlpha CU per MIP60,Configure DNS A record,1) Personal contact...      We are ready to effectuate changes to content manager coming in through the interim asset assignment process and the Asset Assignment MIP which currently is in RFC. Our next focus will be to get clear guidance on how contributors can assign copyright and hand over IP to Dai Foundation and then look at supporting tools and processes. On the Dai Foundation side we are still in a transition mode from the situation where Maker Foundation provided a number of services in areas such like finance, accounting, legal, techops etc where we are making direct agreements with various providers, getting accounts with financial institutions , agreement with trademark lawyers etc. This work will continue for some time yet before we have direct agreements with all providers. Another piece of work have been to respond to a query from the Danish Authorities regarding some of the operations of Dai Foundation We have had a slow start on direct expenses. We have received services from various suppliers where payment for their services are outstanding as we still need to formalize agreements. In the new year I do aim for our reporting of monthly expenses to be unambiguous and I will also look into whether we can provide some forecasting of expenses as many of our expenses aren’t recurring on a monthly basis. That was what I had for now. As always feel free to reach out with questions here or 1-1 All the best Your DAIF CU Facilitator ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1tW2FeaseSb4ExjRajbes9WURrIc416K6kIcrPc5l1zQ/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1tW2FeaseSb4ExjRajbes9WURrIc416K6kIcrPc5l1zQ/edit?usp=sharing",
                        "https://forum.makerdao.com/t/interim-intangible-asset-assignment/10320",
                        "https://forum.makerdao.com/t/mip60-intangible-asset-assignment/10319",
                        "https://forum.makerdao.com/t/maker-relay-ep-72-en-espanol/11799",
                        "https://forum.makerdao.com/t/maker-relay-ep-72/11773"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.74690082644628
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "17/02/2022-14:57:46",
                    "content": "This topic was automatically closed after 90 days. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09090909090909
                }
            ]
        }
    ]
}