{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/lending-against-a-volatile-asset/4676",
            "title": "Lending Against a Volatile Asset ",
            "index": 4676,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "discussion"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/pensivepenguin",
                    "index": "#1",
                    "likes": "1",
                    "time": "09/10/2020-20:56:42",
                    "content": "I have been brainstorming different methods for making volatile crypto assets like ETH be a little more reliable as collateral and less likely to result in sudden liquidations. One idea is a token that is perpetually worth $1 of the [time-weighted?] average cost of ETH over the past month (or even year)…kind of like what UMA is doing with the yield dollar but without an expiry and based on an average cost that wouldn’t move as quickly so that people would have more time to repay or add more collateral to avoid liquidation. In turn, maybe MakerDAO could lend a greater amount of DAI. Is anyone working on something like this? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.617559523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#2",
                    "likes": "1",
                    "time": "10/10/2020-10:13:05",
                    "content": "It is my understanding that this token, as you described it, could very well be a product of MakerDAO. Before the release of MCD (multi-collateral-DAI) Rune announced that MakerDAO was planning to have Euro-DAI and KRW-Dai. Technically, these are just other stablecoins, just like DAI, and only need additional Oracles. The idea was to back them with DAI (i.e., usd pegged, the main product of MakerDAO). Your stable-ETH is just another example of this. I don’t really know what happened, but these ideas has not been discussed for months now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.315476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#3",
                    "likes": "0",
                    "time": "11/10/2020-01:24:02",
                    "content": "This is definitely worth discussing further. I would like to see what other big brains have to say on the merits of the idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.21875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OliverNChalk",
                    "index": "#4",
                    "likes": "0",
                    "time": "12/10/2020-00:45:19",
                    "content": "You have described a derivative product that itself would need to be collateralized. Assuming you use the same collateral pool as dai for this weughted average eth, you will have not gained access to any new collateral, simply shifted it between products ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.982954545454545
                }
            ]
        }
    ]
}