{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/unified-auctions-ui-release-v1-2-0-april-29th-2022/14861",
            "title": "Unified Auctions UI Release v1.2.0 - April 29th 2022 ",
            "index": 14861,
            "category": [
                "Core Units",
                "Sidestream Auction Services"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "5",
                    "time": "29/04/2022-12:59:56",
                    "content": " Unified Auctions UI Release v1.2.0 - April 29th 2022 Version: v1.2.0 Name: Beurs van Berlage  v1.2.0 in a nutshell We had some great days at DevConnect Amsterdam, but didn’t want the conference to prevent us from shipping. We have kept our resolution and are happy to announce the release of v1.2.0. It comes with improvements to the overall UX like a collateral pop-up to withdraw funds, the introduction of UniswapV3 support via the dedicated callee contract, and changes to our keeper implementation. Nevertheless, the update is supposed to be under the sign of Devconnect. The event’s co-working space was located in the old Amsterdam Stock Exchange. Therefore, it is obvious to give the update the name: Beurs van Berlage. The name goes back to the architect. Hendrik Petrus Berlage’s building now serves as the event venue and its architecture is considered one of the 1000 most important buildings of the 20th century.  A closer look at changes  Collateral withdrawal modal  Collateral_Withdraw_Popup1218×330 32.3 KB  When we introduced the Dai bidding-based flow to participate in auctions, the overall flow expected the user to directly withdraw the obtained funds after a successful bid. There was no intuitive way in the UI to withdraw funds from the VAT at some later point, but only when another auction of the same collateral type was active again. Obviously, something that needed to be improved. With the newly introduced collateral pop-up, a user can manage funds at any point in time. Together with a dedicated pop-up to manage Dai this gives the user complete flexibility to manage funds between the wallet and the VAT decoupled from any active auctions. Additionally, the collateral pop-up allows authorizing collateral types in advance of any auctions. With that, the user is able to authorize for auction participation during times of low gas prices and being prepared for liquidation events.  Refetching indicator  Auction_Table1846×208 31.9 KB  Up until now, looking at the auction table, a user might have wondered whether it is up-to-date or whether the page needs to be refreshed in order to have the latest information on auctions. To reduce uncertainty and prevent any type of confusion for the user, we introduced a small indicator to the auction table about the last time auction data has been fetched.  UniswapV3 support With the introduction of UniswapV3 callee support, we are now also using the last callee that was missing for now. Meaning that both the UI and the keeper implementation now facilitate auction execution through this UniswapV3 callee for all of the collateral types that do not require another dedicated callee. The switch from v2 to v3 is a logical consequence, as most all pairs have better liquidity compared to UniswapV2 that was used until now.  Keeper improvements On our quest to continuously improve our backstop keeper implementation, we introduced a way to whitelist collateral types. This is achieved via an additional parameter that allows passing a comma-separated list of collaterals the bot will fetch. Again, we encourage you to test and give feedback on the implementation. Everyone is able to download and run the code themselves after setting the required parameters (more on that in the Readme). Besides the whitelisting of collaterals, we changed the keeper logic in a way that transactions are not executed in parallel any longer but sequentially. While parallel execution was considered valuable in the first place, we will only switch back to it once there is sophisticated nonce management in place. So, the adjustment comes down to reduce risk of failed transactions due to nonce errors. ",
                    "links": [
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-april-2022/15217"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.724897787397786
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/07/2022-13:00:41",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/unified-auctions-ui-release-v1-1-0-april-14th-2022/14627",
            "title": "Unified Auctions UI Release v1.1.0 - April 14th 2022 ",
            "index": 14627,
            "category": [
                "Core Units",
                "Sidestream Auction Services"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "2",
                    "time": "14/04/2022-17:40:48",
                    "content": " Unified Auctions UI Release v1.1.0 - April 14th 2022 Version: v1.1.0 Name: Armchair Auctions  v1.1.0 in a nutshell We are excited to give a new look to our UI with this release. For both flows, auction participation via Dai bidding and via flashloan execution, we have introduced a panel-based approach. The panels replace a loose list of buttons and provide a cleaner approach for the user when it comes to the different steps required for participation. Other than that, we are finally releasing the CRVV1ETHSTEHT support and introducing EIP-1559 support for gas prices. With the new panel-bases approach comes this update’s name. The Armchair Auction house specializes in antique buttons. Since buttons are not that prominent anymore (so kind of antique) on our UI, we thought Armchair Auctions is a suitable name.  A closer look at changes and things to come  Panel-based approach to UI  Panels1402×1376 149 KB  Auction participation requires different authorization steps; If a user decides to bid on an auction with own Dai, funds first have to be deposited and at some point withdrawn from the VAT; flashloan based auction execution can yield a positive gross profit while the net profit after transaction fees is still negative. These aspects and many edge cases more demonstrate that the whole process of participation in an auction can be confusing and even intimidating for a user, especially for the inexperienced one. With the introduction of our new panel as a core UI element for the participation flows, we aim to increase accessibility and lower the barrier for auction participation. The panels reflect different states and directly point the user to the required next step. The panels also allow hiding information that is not relevant at the given state of the user flow. This improves the overall experience and makes it easier for the user to navigate the UI with confidence. You are welcome to take a look and give us feedback on the new UI approach.  CRVV1ETHSTETH support We finally introduced CRVV1ETHSTETH support. Meaning that both the UI and the keeper implementation now facilitate the execution of auctions for this collateral type. The testing scenario is based on a simulation provided by chaoslabs. In particular, we spin up a remote in-the-cloud simulation and start a reverse proxy to the simulation RPC node to serve it on localhost. Connecting our UI with the localhost allows us to then test actual auction participation.  Reworking gas parameters Until now, we relied on a regular http endpoint to fetch gas price data. This was not optimal in several respects: It could be overloaded and down, did not work properly when testing auctions on a fork, and most importantly was not properly aligned with gas changes introduced by EIP-1559. Enough reasons to tackle the topic. In our new approach, we are passing max fee per gas and priority fee per gas as parameters. Additionally, we let the keeper user define max priority fee per gas using the environment variable. With these changes, we want to prevent any gas related transaction errors in the future. Needless to say, the experienced user can still adjust these values before transaction confirmation via metamask. As always, feedback on our new approach is more than welcome. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.718592409768881
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/07/2022-17:41:41",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/unified-auctions-ui-release-v1-0-0-april-1st-2022/14375",
            "title": "Unified Auctions UI Release v1.0.0 - April 1st 2022 ",
            "index": 14375,
            "category": [
                "Core Units",
                "Sidestream Auction Services"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "10",
                    "time": "01/04/2022-15:30:36",
                    "content": " Unified Auctions UI Release v1.0.0 - April 1st 2022 Version: v1.0.0 Name: Lempertz  v1.0.0 in a nutshell In our last release notes, we told that a release of a larger milestone comes with the joy of having a good feeling. Today we’re feeling good again. And this is due the shipping of the first functional version of the Dai bidding flow. So from now on, a user can either participate in a collateral auction, bringing his own Dai to the table or by using the flashloan capabilities. Besides that, we prepared support for participation in CRVV1ETHSTETH auctions. A new collateral type that was onboarded recently. One last thing, from now the Unified Auctions UI will be available under a new domain: https://unified-auctions.makerdao.com/ We are happy to release the Dai Bidding Flow with this update. Therefore, it was obvious to find a suitable name. We decided to go with Lempertz. Not obvious at first glance, but the name fits. The auction house is currently auctioning paintings by the artist Xi Dai! So Lempertz is having kind of a Dai bidding flow to right now.  A closer look at changes and things to come  Dai bidding feature  DaiBidding1378×572 48.3 KB  The latest larger market crash in January showed that there is still demand for auction participation with own Dai funds. A feature, the Unified Auctions UI was lacking so far. From now on, a user is able to decide whether to participate in an auction by bidding with own Dai or by using the flashloan capability. Our goal was to introduce the new flow in a way that it integrates seamlessly with the existing UI/UX concept and the overall look and feel. As always, we tried to reduce the complexity for the user as much as possible. With the release of this feature, the Unified Auctions UI covers all the features the older Liquidation Portal offers. So from now on, the Unified Auctions UI is going to be the go-to destination when it comes to auction participation as support for the old UI is deprecated. We are coordinating the deprecation of the Liquidation Portal with @dux-core-unit. We already have plans on how to improve the overall UX of this flow, further taking away the burden from the users’ shoulders. This is what we are aiming for in the upcoming sprint. In the meantime we are more than happy to receive your feedback on the current implementation of the Dai bidding flow.  CRVV1ETHSTETH support We’ve implemented support for the latest collateral type CRVV1ETHSTETH using the new callee contract. In case of future vault liquidations, users will be able to participate in respective auctions via the Unified Auctions UI. However, the final testing cycle for auction execution is pending. That is why we are planning to do a special in-between release at the beginning of next week once the functionality is finally tested. As it is part of our overarching mission to streamline the process to support new collateral types, this was also a good opportunity to further standardize our onboarding practices. One takeaway here is that we are going to improve our testing capabilities in the future, especially when it comes to new collateral types where no actual liquidations have happened yet.  A unifying domain One of the core narratives that we are pursuing is to build a UI that unifies the auction related experience for a user. To underpin this from now on, we will operate under the following domain: https://unified-auctions.makerdao.com/ No need to change your bookmarks immediately. We are ensuring a smooth transition. In a first step, we will operate both domains in parallel and in a second step, we will take care of proper redirects. But you can already get used to the new domain… ",
                    "links": [
                        "https://unified-auctions.makerdao.com/",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-april-2022/15217"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.074529306672164
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#2",
                    "likes": "1",
                    "time": "02/04/2022-10:27:03",
                    "content": "Congrats on the launch! This is a big one for sure  Looking forward to putting liquidations.makerdao.com to rest forever  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "2",
                    "time": "04/04/2022-09:25:02",
                    "content": "    danik:  https://unified-auctions.makerdao.com/   Very neat! Excited to see the progress and the link outs to all the other tools we have in the ecosystem. One brief note, CatFlip is no longer supported, but GovAlpha is working on a successor with dSpot, might suggest removing the link until then. Looking forward to exploring  the UI during the next pullback (assuming no more UpOnly  ). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lukass",
                    "index": "#4",
                    "likes": "2",
                    "time": "04/04/2022-10:04:57",
                    "content": "    prose11:  One brief note, CatFlip is no longer supported, but GovAlpha is working on a successor with dSpot, might suggest removing the link until then.   @prose11 thanks for pointing that one out. We’ll remove it from the overview. Let us know once dSpot is ready to be included  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "03/07/2022-10:05:26",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "896"
}