{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ces-core-unit-update-1/10872",
            "title": "CES Core Unit Update | #1 ",
            "index": 10872,
            "category": [
                "Core Units",
                "Collateral Engineering Services"
            ],
            "tags": [
                "cu-update",
                "ces-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#1",
                    "likes": "6",
                    "time": "09/10/2021-01:10:26",
                    "content": "As the first update of the CES Core Unit, I would like to take this opportunity to thank everyone in the community supporting the ratification of CES. I realize we had about 30k MKR that voted against CES. I would encourage any of you that did not support CES, for whatever reason, to reach out to me and share your thoughts and opinions. You will find I encourage feedback of all types and I am ready to listen. Activities this week focused on business entity/core unit formation and recruiting/hiring. These tasks are critical in the next 0-3 months. Business Entity/Core Unit Formation  Hired Launch Legal, www.techlawstartup.com, to assist with the business entity formation as a Wyoming LLC  Entity name: Clio (klee-oh) Finance, clio.finance   Confirmed multisig signers and Auditor’s Wallet setup, Gnosis Safe  IT setup tasks CES budget preparation/confirmation for 2021-10-08 executive vote Various conversations with core unit facilitators and team members Setup a variety of meetings with business service providers for Core Unit operations  Recruiting/Hiring  Worked closely with the SES Talent Incubation Core Unit on recruiting activities (they ROCK!) Four smart contract engineering candidates in the pipeline  Offer stage for one of the candidates - start date Nov 15 2021   Two product manager candidates in the pipeline One advisor commitment, advisor agreement being put in place  Other  Plugging into the normal meetings as a Core Unit Facilitator for Collateral Confirmed speaking engagement at ETH Portland  Topic: Beyond the Maker Foundation – I will be sharing my experiences on managing the Foundation’s transition into the DAO/Community and the progress we have made to date.    As always, let me know if you have any feedback or questions. Enjoy your weekend! ",
                    "links": [
                        "https://gnosis-safe.io/app/#/safes/0x25307aB59Cd5d8b4E2C01218262Ddf6a89Ff86da",
                        "https://2021.ethportland.com/",
                        "https://forum.makerdao.com/t/maker-relay-ep-66-en-espanol/10982",
                        "https://forum.makerdao.com/t/maker-relay-ep-66/10950"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.049744897959184
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "0",
                    "time": "09/10/2021-01:15:36",
                    "content": "    monkey.irish:  Entity name: Clio (klee-oh) Finance, clio.finance   History is your Muse? Or just like the name? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#3",
                    "likes": "1",
                    "time": "09/10/2021-01:17:17",
                    "content": "You got it! Clio was a Greek mythological muse and Goddess, featured in heroic poetry and history. I mean, we could use a little feminine energy in this place! lol ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.953125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "07/01/2022-01:17:44",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/ces-core-unit-update-3/11742",
            "title": "CES Core Unit Update | #3 ",
            "index": 11742,
            "category": [
                "Core Units",
                "Collateral Engineering Services"
            ],
            "tags": [
                "cu-update",
                "ces-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#1",
                    "likes": "6",
                    "time": "20/11/2021-02:17:29",
                    "content": "Hi, all! CES update #3. First, let’s start with our new hires!   Kauê Cano @kaue will be joining us as a Smart Contract Engineer! Most recently, Kauê worked at Jigstack as a Blockchain Lead and led local and remote teams of smart contract and dApp developers involving multiple DeFi products of the Jigstack ecosystem. Prior to Jigstack, Kauê worked with or founded companies focusing on state-of-the-art on Artificial Intelligence, Data Science, Blockchain, and DeFi.   Nazar Duchak will be joining us as a Smart Contract Engineer! Most recently, Nazar worked at ParaSwap as a Blockchain Developer and was involved with pricing aggregation, partner exchange integration, and designing and building ParaSwap’s infrastructure. Prior to ParaSwap, Nazar worked for IOV Labs (RSK and RIF Platforms), Aeternity, as well as a variety of organizations as a full stack developer.   Phil Elsasser @0xean will be joining us as an Advisor to the CES Core Unit! Phil is the Head of Technology at the new Fox Foundation supporting the efforts of the ShapeShift DAO. Previous to his role with the Fox Foundation, Phil was the CTO and lead solidity developer on ElasticDAO core, worked for Amazon in Measurement and Data Science, was a founder of a DeFi crypto startup called MARKET Protocol, and has led numerous technical teams in the web2 and web3 space. His early career was spent building trading algorithms and execution systems on proprietary trading desks in Chicago which cemented his fascination in capital markets and the DeFi ecosystem.   Please take a moment to welcome Kauê, Nazar, and Phil to the CES Core Unit and MakerDAO. I’m excited for them to bring their background, talents, and experiences to the team and the protocol! Again, I want to thank all that have assisted CES in hiring our team: PE (Chris & Brian), Oracles (Mark-André), SES (Wouter), and Talent (Teodor). The CES Core Unit kicked off on Oct 4 and within six weeks, we’ve been able to identify, interview, and make offers for all key positions (one more is coming that I will announce shortly). That is quite an accomplishment given the talent environment, the newness of a DAO, and industry we work within. CES Status This week, Nikolaj and Henrique formally started with the CES Core Unit…and what a perfect week to start! Both were able to immediately jump in, while onboarding, and materially contribute to the WBTC-B, SocGen contract review/assessment, and MIP21 work. We also had our initial meeting with PE to discuss the initial transition of collateral work from PE to CES. Next week, Kauê will start on Nov 24 and Nazar will join us part time until Dec 20 as he winds down his ParaSwap work. Prior to the team starting, my time was focused on getting the CES Core Unit up and running, from an operational perspective, aligning with key Core Unit stakeholders, and recruiting the team. This week, we started the transition into operating the Core Unit and working to deliver on our mandate:  Scale the Dai supply (1T) by enabling anyone to onboard collateral in a stable and cost effective manner.  So, what’s next? CES Focus & Deliverables In the past six weeks, I have learned a lot and am excited about the opportunity ahead of us. As we stay true to our crypto native roots, I believe the MakerDAO has a tremendous future by enhancing real world asset exposure to help us deliver on the CES mandate. In the short time remaining before the end of the year, the CES Core Unit will focus on a variety of goals and deliverables:  Onboard new CES team members Continue to identify and transition collateral activities from PE to CES Collateral process and coordination of MakerDAO stakeholders CES Strategic Planning  As always, please reach out to me if you have any questions or feedback on the above. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-72/11773"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.758554292929293
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kaue",
                    "index": "#2",
                    "likes": "8",
                    "time": "20/11/2021-16:38:21",
                    "content": "Hey everyone, nice meeting you all! I’m super excited about joining the team and it’s an honor being officially part of Maker. I’m a bit new to the forum (honestly more of a Discord guy myself) but I’ll try to follow along and keep the community updated here as well. Let’s scale up DAI then… Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.219696969696969
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "18/02/2022-16:39:19",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/ces-core-unit-update-2/11299",
            "title": "CES Core Unit Update | #2 ",
            "index": 11299,
            "category": [
                "Core Units",
                "Collateral Engineering Services"
            ],
            "tags": [
                "cu-update",
                "ces-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#1",
                    "likes": "9",
                    "time": "29/10/2021-22:15:48",
                    "content": "Hi, all! CES update #2. I want to provide a quick update on the status of a number of Core Unit initiatives. Our first priority is filling our open positions on the team. Today, I am very excited to announce two new hires:   Nikolaj Lollike will be joining us as a Solutions Architect! I’ve worked closely with Nikolaj at the Maker Foundation where he was the Lead of the Integrations Team. Most recently, he was working within the SES Core Unit. Nikolaj brings in a WEALTH of experience and knowledge about the Maker ecosystem especially with collateral management and the integration of Dai into a variety of platforms. I couldn’t think of a better Maker OG to join our team!   Henrique Barcelos will be joining us as a Smart Contract Engineer! Most recently, Henrique worked for Kleros as a Full Stack Blockchain Engineer. He has an extensive background in Web 2 and 3 technologies which will enable the CES team deep coverage on the range of technologies used for collateral management. Henrique is gearing up to be a Maker OG really soon!   Please join me and welcoming both Nikolaj and Henrique to the CES Core Unit! And…we have a number of candidates in our recruiting pipeline and anticipate hiring the rest of the team in the next several weeks. Stay tuned!  High Priority Items Now that we are adding new members to the team, there are a number of higher priority items we are focusing on:  Onboarding new contributors into the CES Core Unit Offloading collateral onboarding from the PE Core Unit Provide clarification on when and how to use MIP6 including parameters for collateral offboarding Partnering with RWF, PE, Oracles, Risk, & Growth on the implementation of the SocGen collateral application Detailed product planning for crypto native and real world assets Continuing to setup the operations of the CES Core Unit  It’s no small feat to operationalize a Core Unit! I greatly appreciate the assistance from the PE, Oracle, and SES Core Units especially with their help in interviewing our candidates. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/maker-relay-ep-69-en-espanol/11439",
                        "https://forum.makerdao.com/t/maker-relay-ep-69/11345"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.117707832291166
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "29/10/2021-23:56:50",
                    "content": "    monkey.irish:  Please join me and welcoming both Nikolaj and Henrique to the CES Core Unit!   Wowzers! You landed some super talented people–nice work Rojo! Looking forward to seeing who else you onboard. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.020833333333332
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#3",
                    "likes": "12",
                    "time": "30/10/2021-09:21:45",
                    "content": "Hey all I’m super excited to be joining CES. For the ones who do not know me, I’ve been working on scaling the demand side of Dai for 2.5 years at the Maker Foundation Integration Team, where we together with Business Development (now Growth CU) grew the number of integrations of mainly Dai and Vaults from 200 to just shy of 1000 in the timespan I was involved. We also wrote many guides on how to integrate with Maker, and even created a handbook for collateral onboarding - together with Risk, PE, and Oracles. I’ve since then spent almost half a year at SES, where I’ve helped incubate some really rock star teams, that will hopefully be accepted by Maker Governance very soon! Now I’m excited to shift my focus back to integrations, albeit this time it will be from the Maker POV in terms of integrating collateral and tackle what I find the most interesting problem of MakerDAO: Scaling the Dai supply. I’m hopeful I can use my experience from the Integration Team, and incubation program in SES to help the developers of CES team get up to speed quickly on everything Maker, so we can start executing quickly and work towards 1 trillion Dai  ",
                    "links": [
                        "https://collateral.makerdao.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.033333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#4",
                    "likes": "10",
                    "time": "31/10/2021-09:45:25",
                    "content": "We wanted to share with the broader community some points discussed internally at our weekly meeting.  Contributors changing Core Units There seems to be some taboo or unspoken issues in our culture that we would like to change: contributors changing Core Units / Core Units “poaching” contributors.  SES has and will continue to openly encourage contributors to go where they feel they can have the most significant impact on their careers and MakerDAO’s vision.   Nikolaj Nikolaj has played a significant role in bootstrapping SES’ incubation program. He was of great help facilitating the meetings with the incubees, organizing resources, sharing Maker knowledge, and making sure that each incubee had what they needed to succeed. @lollike, @SES-Core-Unit will miss you and is looking forward to seeing your subsequent victories with @collateral-core-unit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.59375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "13/02/2022-13:50:21",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/ces-core-unit-update-4/12010",
            "title": "CES Core Unit Update | #4 ",
            "index": 12010,
            "category": [
                "Core Units",
                "Collateral Engineering Services"
            ],
            "tags": [
                "cu-update",
                "ces-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#1",
                    "likes": "5",
                    "time": "05/12/2021-22:54:41",
                    "content": "Hello, everyone! CES update #4. Let’s start with our latest new hire.   Miguel Cabeza will be joining us as a Technical Product Manager! Miguel has experience as Head of Product Management in the e-commerce industry and 10+ years of experience on roles in Digital Marketing in video games and FMCG industries. He is a contributor to yearn.finance and SAI holder (still have some dust in a wallet!). Please join me in welcoming Miguel to the team as he started part-time Nov 29th.  Overall, this completes the core CES team. We have an opportunistic hire open for a Lead Smart Contract Engineer, Lead Smart Contract Engineer, and have several candidates working through the hiring process. If you know of anyone that would fit this job description, please reach out to me. CES Status It’s been a busy few weeks with onboarding new team members and getting into the execution phase of the core unit. Below is a short summary of the high-level accomplishments:  Continued working with the Maker CUs and on the SocGen implementation.  Nikolaj delivered the MIP21 technical overview and implementation recommendations for SocGen.   Syncing and alignment with Maker CUs on our RWA approach. Contribute to Goerli and Mainnet executive spell for Dec 3rd in collaboration with PE, specifically working on onboarding of GUNIV3DAIUSDC2-A, collateral rate changes, dust changes, and debt ceiling changes. Having multiple teams work on a mainnet spell is a first in MakerDAO, which is a development towards parallelization of work which will help reduce the bus factor and increase decentralization in the DAO. We are thrilled with the support we’ve had from PE so far in getting up to speed, and appreciate their collaboration on this. Identify gaps in existing documentation and processes as we go through the collateral onboarding and spell making processes. Started work on spell crafting docs. Internal training: Did walkthrough of the Maker Protocol modules, and collateral onboarding process. Had two dedicated team work sessions on writing the weekly spell. Contributed with input on the Collateral Offboarding Process MIP by PaperImperium. Continued with the CES CU planning process and budget MIP preparation.  As always, let me know if you have any questions! ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-74-en-espanol/12071",
                        "https://forum.makerdao.com/t/maker-relay-ep-74/12035"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.583642547928262
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/03/2022-22:55:41",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "194"
}