{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/presentamos-maker-wormhole-traduccion/15112",
            "title": "Presentamos Maker Wormhole [Traducci\\xc3\\xb3n] ",
            "index": 15112,
            "category": [
                "Latin America"
            ],
            "tags": [
                "translate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/0xRami",
                    "index": "#1",
                    "likes": "5",
                    "time": "11/05/2022-17:52:26",
                    "content": " f7fa8a529fa1113874e194e1c603f911088aee9f2595×665 23.4 KB   Introducción La unidad central (Core-Unit) de ingeniería del protocolo Maker está construyendo una estrategia multicadena (multichain strategy) para presentar DAI Wormholing, habilidad de teletransportación casi instantánea de DAI entre layers 2 compatibles + Ethereum. A medida que el ecosistema de layers 2 evolucione y la liquidez de DAI crezca dentro de estos dominios, será importante para los usuarios poder mover DAI entre ellos de manera trustless. Esta iniciativa de Wormhole DAI en los ecosistemas de layers 2, comenzando con Optimism y Arbitrum, se convertirá en una característica integral de la fungibilidad de DAI en layers 2. Nuestra propuesta de diseño es totalmente confiable y permite a los participantes del sistema unir una liquidez prácticamente ilimitada a través de la acuñación instantánea de DAI en el dominio de destino. Esto significa dejar de estar a merced de una contraparte que tenga liquidez disponible.  Ampliando los retiros rápidos Una observación clave es que Maker Wormhole es una versión generalizada de Fast Withdrawals y que permite transferencias de DAI a través de dominios de layer 2. Después de algunas discusiones dentro del Equipo de Ingeniería del Protocolo, quedó claro que deberíamos generalizar el concepto antes de implementar el caso especial de L2 → L1 “Retiros rápidos”. Al adoptar este enfoque, podremos implementar Maker Wormhole sin problemas en cualquier L2 después de que MCD (Multi-Collateral Dai System) esté disponible en esa cadena. Ejemplo: L2 → L1 “Retiro Rápido”  wormhole-l2-l11920×1423 108 KB  En la imagen de arriba hay 3 usuarios que quieren hacer retiros de DAI a L1. En lugar del enfoque habitual de iniciar un mensaje L2 → L1, el sistema emitirá un evento en L2 de la intención del usuario. El DAI de la L2 se quemará en este punto, y se marcará una ranura de almacenamiento para el contrato Checkpoint Slow Fallback. Maker Oracle Network ejecutará los nodos L2 que pueden dar fe de la finalidad y validez de las transacciones L2. Los operadores estarán atentos a estos eventos de “agujeros de gusano” y proporcionarán certificaciones firmadas. Los usuarios podrán consultar estas certificaciones y proporcionarlas al contrato Oracle Fast Withdrawal para la autenticación. En el camino feliz, la autenticación es exitosa, se acuña un nuevo DAI y se envía al usuario siempre que el adaptador Wormhole tenga suficiente límite de deuda disponible. En el caso de que la red de Oracle no esté disponible por algún motivo, será necesario proporcionar un respaldo en la cadena. Hacemos esto al permitir que los usuarios envíen una prueba Merkle de que se ha configurado una ranura de almacenamiento en particular en el L2. Si la prueba es válida, garantiza que se ha llamado al initWormhole() correspondiente (suponiendo que la raíz merkle del estado L2 sea válida). Una sutileza importante aquí es que la etapa de liquidación se ha agrupado en un bloque fungible de DAI. Esto contrasta con algunos otros protocolos populares que deben hacer coincidir cada transferencia rápida con una transacción de liquidación correspondiente después de la ventana de prueba de fraude de 7 días. Esto puede no parecer un gran problema, pero tiene enormes implicaciones para la escalabilidad. Si hay cientos de miles de transacciones por $ 5.00 de DAI, es simplemente demasiado ineficiente en términos de gas para eliminarlas 1:1. Debido a esta restricción, Maker elige hacer que la deuda emitida por el módulo Wormhole sea completamente fungible. Un problema introducido por la deuda fungible es que, debido al techo de deuda limitado, es posible que los usuarios sean adelantados y se les niegue el acceso a su DAI, posiblemente incluso después de que hayan transcurrido los 7 días. Este problema se puede resolver introduciendo un mercado de tarifas. Los detalles de cómo funcionará esto todavía se están investigando activamente, y agradecemos cualquier idea de la comunidad en general. Creemos que esta compensación vale la pena. Ser capaz de enrutar una cantidad ilimitada de transacciones individuales es clave para escalar L2. La liquidación es el principal cuello de botella y creemos que hemos encontrado una solución sólida.  L2 Multi-Collateral DAI (L2-MCD) El caso especial de L2 → L1 es relativamente sencillo de conectar porque ya tenemos MCD en L1. Para admitir el wormhole de uso general, primero debemos implementar MCD en L2 de destino. Una vez que se implemente MCD, será trivial agregar soporte para el lado de la acuñación. El código se puede reutilizar casi exactamente desde L1 junto con la misma API de Oracle. La única diferencia es durante la liquidación, así como el retroceso lento del punto de control, pero estos son detalles menores. Ejemplo: L2 → L2 “Agujero de gusano” (Wormholing)  wormhole-l2-l21920×984 98.4 KB  Como se ve en el diagrama anterior, initWormhole() en L2-A y las atestaciones de Oracle en L2-B son idénticas al caso especial L2 → L1. La liquidación también es más o menos la misma, excepto que debe enviar el reembolso de DAI al puente DAI del dominio de destino en lugar de liquidar la deuda en la entrada de Wormhole en L1. La idea es usar Ethereum como la capa de liquidación principal, pero los usuarios finales no necesitan tocar L1 para moverse a través de L2. Generalizando esto aún más, ya no necesitamos siquiera pensar en términos de L2 o incluso cadenas de bloques. Hemos optado por utilizar el término “dominio”, que se refiere a cualquier lugar donde se implemente una instancia de MCD. Incluso podría haber múltiples implementaciones en la misma cadena. MCD (y Wormhole) podrían implementarse en otros L1 si la gobernanza así lo desea. Por supuesto, se debe tener en cuenta los modelos de seguridad de estos L1, ya que ya no heredamos la seguridad de Ethereum y, por lo tanto, no podemos proporcionar las mismas garantías del DAI que aparece durante la liquidación. Creemos que la combinación de deuda fungible, costo de capital cero y liquidez virtualmente ilimitada consolidará a DAI como la moneda dominante de la cadena cruzada.  Línea de tiempo Sobre la base del trabajo anterior completado a principios de este año (2021), estimamos la entrega de la función Retiros rápidos (L2 → L1) en el primer trimestre de 2022. Debido a la capacidad ampliada del equipo y la reducción de los artículos prioritarios urgentes, podemos avanzar mucho más rápido en estos compromisos a más largo plazo. La función completa de Wormhole llevará más tiempo, ya que existe un requisito previo de MCD en L2, pero cuando se entrega, obtenemos todo de una vez. Bóvedas, Wormhole, D3M, etc. La entrega tentativa para esto es el segundo trimestre de 2022. Inicialmente apuntamos a Optimism y Arbitrum, pero L2-MCD/Wormhole se expandirá a otras L2 a medida que estén disponibles.   Debate para la implementación a la propuesta → MIP69: Retiros Rápidos de L2 a L1  Votación a la propuesta → MIP69 Más información pueden mirar → Encuestas de la Semana: 09 de mayo de 2022  Traducción por @0xRami del post original → Introducing Maker Wormhole  ",
                    "links": [
                        "https://makerdao.com/whitepaper/White%20Paper%20-The%20Maker%20Protocol_%20MakerDAO%E2%80%99s%20Multi-Collateral%20Dai%20(MCD)%20System-FINAL-%20021720.pdf",
                        "https://forum.makerdao.com/t/mip69-l2-to-l1-fast-withdrawals/14041",
                        "https://vote.makerdao.com/polling/QmWZvSpa",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-09-de-mayo-de-2022/15089",
                        "https://forum.makerdao.com/t/introducing-maker-wormhole/11550",
                        "https://forum.makerdao.com/t/nuevo-nombre-de-maker-wormhole-maker-teleport-traduccion/15273"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.970833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "2",
                    "time": "11/05/2022-19:06:19",
                    "content": "tremenda traduccion crack!!! felicidades! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xRami",
                    "index": "#3",
                    "likes": "4",
                    "time": "12/05/2022-00:06:55",
                    "content": "Me picó el bicho de la curiosidad e investigué un poco sobre alternativas en las L2s. Muy fascinante esta nueva tecnología, y más con lo que se viene pronto en Buenos Aires. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#4",
                    "likes": "3",
                    "time": "13/05/2022-16:31:08",
                    "content": "Gracias por la traducción, estas contribuciones son lo que necesita la comunidad de latam ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#5",
                    "likes": "1",
                    "time": "15/05/2022-23:22:56",
                    "content": "Definitivamente el Wormhole de Maker le abre muchas oportunidades al sistema ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#6",
                    "likes": "1",
                    "time": "16/05/2022-15:18:44",
                    "content": "Excelente laburo @0xRami! Una temática muy interesante, buscar formas de escalar L2 y permitir mayores alternativas para el usuario, genial. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#7",
                    "likes": "5",
                    "time": "17/05/2022-15:20:49",
                    "content": "Gracias por esto @0xRami, dejo constancia también de que luego de mucho hablar se cambiará el nombre de Maker Wormhole a Maker Teleport, así tenemos un nombre más amigable para hacer PR y causar menos confusiones en el entorno cripto. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#8",
                    "likes": "2",
                    "time": "19/05/2022-22:00:30",
                    "content": "Complementando éste topic, hice la traducción del topic donde se anunció el cambio de nombre de Maker Wormhole a Maker Teleport y las razones del porqué ese cambio. Pueden leerlo aquí: Nuevo Nombre de Maker Wormhole: Maker Teleport [Traducción] ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}