{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-december-2021-update-and-2022-outlook/12536",
            "title": "New Silver December 2021 Update and 2022 Outlook ",
            "index": 12536,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "newsilver-update",
                "rwa-002"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "8",
                    "time": "09/01/2022-20:30:35",
                    "content": "Dear Community, In this post, I will cover the activity of the last month of 2021, and offer our outlook on the macro trends of 2022. December was a bit slower on originations, mainly due to US Thanksgiving holiday and the end of year holidays. We took in an overall of 247 applications and closed on 16 loans, with specifics below. We are also closely following the macro trends that are happening in the US housing and financial markets, as those two are closely related. We are coming into 2022 with rampant inflation (>6% year over year increase) and a similar increase in the Consumer Price Index. The Federal Reserve promised to raise rates 3 times in 2022 (none of this is certain until it occurs). NASDAQ is down some (but still much higher than a year ago) and the same goes for the cryptocurrency markets. The era of “free” central bank money may be over, for now. Coronavirus is still amongst us, in many different forms. So what is waiting for us in 2022? While I am not focused nor qualified to opine on the overall economy, I will just say that our thesis at New Silver is that market corrections come and go, this is likely one of them, and it may be a good thing. Overheated markets are not good for anyone, and eventually, bubbles pop. Stocks are still expensive, even at these levels. And we do not believe that politicians have the appetite to raise rates too high and drive down the stock market too much on their watch. Specifically in real estate, the markets are continuing to be very robust. Mortgage rates are still low, sitting at 3.22% at the time of writing, so while prices have appreciated and continue to do so, first time buyers (who make up a large chunk of homebuyers) are still able to afford homes. Millennials, unlike many predictions some years ago, are buying homes and settling down, though not always around the major metro areas as before, since many are now able to work remotely. We believe that mortgages rates under 4% are still historically low and will allow new buyers to enter the market, and allow our clients, the real estate investors, to resell renovated property to these buyers. There is also a vast shortage of entry-level homes across the country, and this shortage is continuing to accelerate (the shortage is estimated to have been 3.8mm units in 2020, see Freddie Mac). One other concern has also been raw material pricing, and how this will effect borrower budgets - we keep a close eye there and make sure that budgets have some cushion, and all of our borrowers have extra liquidity on hand. We have not had any negative effect from this so far, and believe that a lot of the price appreciation has been due to supply chain interruptions, which should be slowly resolving in 2022. We believe that the robust real estate market will continue in 2022, and will continue to propel strong, quality originations at New Silver, with ample exit possibilities to either a sale or a rental. We are continue to focus on building technology and process to speed up originations, improve other areas like underwriting and post-close, and work closely with our partners to bring high-quality assets. We are also engaging in an internal project to study how, using the funds we advance to borrowers, we can do our part to be more sustainable and climate friendly, and would like to start offering some incentives to “green” builders in 2022. Would love some community feedback on this topic particularly. Lastly, I have written about a scholarship we offered to students in 2021, and would like to expand it in 2022, the post is here, if there is any feedback beyond what was already offered, happy to hear it. Loan Originations in Tinlake New Loans:16 New Loan USD Volume: $3.7mm Average Originated Interest Rate: 8.7% Average Tinlake Finance Fee: 6.02% Average Loan Amount: DAI 219,372 Average Loan to Value: 64% Average FICO score: 722 Average Term: 12 months Loans Paid Back: 4 Current MakerDAO Debt Ceiling: $20mm with about $10.7mm used **data provided is based on loan origination date, not finance date Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 Technology Working on a real-time report to provide more transparency into the loan portfolio. The redesigned web app is now live. People We are hiring developers and loan processors, anyone interested in applying please let me know. ",
                    "links": [
                        "https://forum.makerdao.com/t/scholarship-partnership-proposal/12325",
                        "https://forum.makerdao.com/t/weekly-relay-january-4-10-2022/12544",
                        "https://forum.makerdao.com/t/relay-semanal-4-10-de-enero-de-2022/12593",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-december-2021/12692",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-january-2022-updated/13094"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.452641492279651
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "14/01/2022-18:06:01",
                    "content": "Interesting question from this write-up with regards to crypto being the future of Real Estate—but, first things first—crypto as a payment rail needs to stop being taxed as a property and more as what it is, currency. Well, at least DAI is in my eyes     sothebysrealty.com    Is Crypto The Future For Real Estate - Luxury Outlook 2022 Sotheby's International Realty      ",
                    "links": [
                        "https://www.sothebysrealty.com/eng/is-crypto-the-future-for-real-estate"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#3",
                    "likes": "2",
                    "time": "14/01/2022-18:29:26",
                    "content": "Thanks for sharing. Totally agreed! We are hopeful and optimistic that we will, in the near future, be able to work natively in DAI without the need to exchange to fiat. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "14/04/2022-18:29:33",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}