{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/be-selective-of-what-is-allowed-to-be-collateral/2841",
            "title": "Be selective of what is allowed to be collateral ",
            "index": 2841,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "summary",
                "meta-governance",
                "alignment"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Jaybro91",
                    "index": "#1",
                    "likes": "0",
                    "time": "15/06/2020-11:41:50",
                    "content": "To Whom It May Concern, I believe we should re evaluate what can be used as collateral. I think ETC should be used as collateral asset but ETH should not, due to no cap. Use coins like, usdc, bitcoin, zcash, etc, augur, bat, 0x, nexo. We should also be very selective on what assets are tokenize and allowed to be collateral. The Maker should be able to become a million dollar coin before bitcoin in my humble opinion. Just look at the float for starters. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.703125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/06/2020-12:45:24",
                    "content": "Hi @Jaybro91, welcome to the Maker forum. I’d be interested to hear the reasoning behind why ETC having a hard-cap makes it stronger collateral, and especially why it should replace ETH (given that Maker runs on the Ethereum chain.) Likewise with the other asset suggestions, can you share your reasoning? We are currently using USDC, wBTC, and BAT as collateral, and 0x is currently being worked on for addition. You can get an idea of the current status of various collateral types here: Collateral Status Index ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.291666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jaybro91",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/06/2020-13:50:01",
                    "content": "I am happy to speak further on this topic. I’ll start with ETH. In my opinion later in life ETH will be heavily diluted due to there being no cap. To me its a crypto form of the dollar, were as etc is gold and eth is the dollar. What happens when eth becomes worth thousand a coin then the ones who was staking decides to sell off possibly convert to etc then the loan collateral gets killed and maker coins are forced to be created which may kill maker coin market cap. Remember eth was only created because of bad coding… Now the reason behind nexo, bat, 0x, zcash. There are company’s and foundation behind them and they could use dia creations to fund operations while still locking the company assets and helping price appreciation to coin market cap. Those are some of the reason to my post. Thank you for responding to my post. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.528846153846154
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#4",
                    "likes": "2",
                    "time": "15/06/2020-15:10:09",
                    "content": "The inflation rate of eth is low and decreasing. The inflation rate is not programmatically determined like bitcoin, but that’s because the Ethereum community tends to have a less negative view of hard and soft forks than the bitcoin community and is fine with updating parameters as needed. Likewise eth 2.0 is supposed to allow a dramatically reduced inflation rate. Imo this issue is not as great as it initially appears. Also as long as the growth rate of eth demand is greater than the inflation rate, the asset should increase in value in the long term. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4356060606060606
                }
            ]
        }
    ]
}