{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/unified-dao-toolkit-making-transparency-easy/16210",
            "title": "Unified DAO toolkit: Making transparency easy ",
            "index": 16210,
            "category": [
                "Governance"
            ],
            "tags": [
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "8",
                    "time": "29/06/2022-17:43:13",
                    "content": "One of the major concerns people have with the Endgame Plan is the impression that “you aren’t allowed to talk to your colleagues anymore”. Obviously that is a mistaken belief since there is no way anybody would benefit something and I hope I can clear that up with this post. Mostly this refers to things I have said in connection to what I call separation of powers (which is actually a term I want to stop using because it has confused many people since I don’t use it exactly as it is defined when used in government). Some of it pertains to core unit neutrality - how I believe that building political alliances or political momentum for particular proposals inside the core units that erode core unit independence and neutrality poses a long term danger to MKR holders. But in this post I want to talk about transparency. We need maximum reasonable transparency of the work Core Units are doing. So what exactly does maximum reasonable transparency mean? Mainly I would say that it means all signicant work interactions between separate independent core units must be done publicly and fully documented, following standardized processes. This is btw pretty much already how it all works. Work internally in a core unit should be expected to a black box, and any transparency beyond that is a nice to have but in reality you can’t provide that level of transparency in an efficient and non-intrusive way. Why do we need this maximum reasonable transparency? When you look on a long enough timeframe (hundreds of years into the future, endgame style) there are many good reasons, but let me just list a few:  measure results and evaluate performance in an unbiased way, so it isn’t based on the judgement of some middleman or boss ensure security and integrity of processes and documentation, so we don’t have critical operational risk if one day a core unit just goes off the grid, which is something that can theoretically always happen and there’s nothing we can do to prevent it. verify that prices paid by Maker are set by free market processes and that Core Units aren’t accidentally or intentionally creating vendor lock-in or monopolization etc… There are really endless edge cases and risks that can only be dealt with by using transparency, once you think on a long enough timeline.  The big problem is that transparency so far as has meant doing things like write forum reports, hold office hours, join public calls, governance calls etc etc Almost all of this activity is very labor intensive, and must be done instead of doing any real work. At the same time the produced material is rarely read or attended, and when someone actually wants the information its very hard to find… and most of the time they dont even know it exists. This is the problems of bureaucratic overhead and high information cost producing a worst-of-both-worlds outcome. So basically, core units are already operating with transparency and spending a lot of resources on being as transparent as possible, but it’s not paying off as voters and community members don’t feel like there is transparency or access to what’s going on (at least to the extent that many would like).  Unified DAO Toolkit with built-in transparency I think a powerful solution to this problem is the development of a unified DAO toolkit. This is actually a project that has already been worked on in SES, although only with a limited scope. My suggestion is that we rally the community and core units around making this the central concept that we organize all of internal governance and workforce operations around. The basic idea is to cover all high level and low level processes, complexity and information in the entire DAO with a single toolkit that has a unified UX and design. This single toolkit is both the actual tool used to for workflow processes, like a jira or kanban board, or an ERP system, but at the same time it is also the governance information dashboard, like wikipedia. So governance and operations are unified in a single system with consistent language and design, making low-information-cost transparency free when just following the standard work flow and processes. This is comparable to open source software writing on github. When developing with github, you don’t have to first write all the code and do all the work, and then follow some second process to make all the code available externally in a way that others can actually use. You simply work in github, and then if it is a public repo your work is automatically published and made open source in a format that everyone knows how to use. To continue the open source software on github analogy, there is one thing to consider, and that is documentation. Documentation takes time to write, and if you are just coding for yourself or in a closed org, you could choose to skip it, and then if you want to later make it open source you would have to spend time to write the documentation. But the reality is that code is always better, and especially a lot more secure, if the developer has spent the necessary time to document it properly while writing it, especially if you are working in a team with other people, having as much complexity and decisions documented is always critically important. The same dynamic is true for working in the decentralized workforce, if all decisions and processes are well documented, the overall quality of the work improves even if it takes a longer time to do things the right way. So, since we want the work to be done the right way anyway, then it is actually a big advantage to have automatic easy-to-understand transparently built into the toolkit, because it forces all processes to be done properly, without skipping the necessary documentation. I think as we develop this tool, we may find that using software to define processes allows us to answer a lot of the open questions and challenges we are facing in a way that is very tangible and provides a pragmatic solution. In fact we will likely discover a lot of questions we didn’t even know existed, but that only come to the forefront when building out a practical solution rather than considering these things theoretically. The build out of the unified DAO toolkit could also be done in parallel with the development of better governance practice, such as defining the scope maps (individual top-level functions that require a high level strategy that voters understand). The process of designing the scope maps could go hand in hand with the process of building the practical software tools necessary to support that particular scope map, and each may contribute with information to the other. Over time, the Unified DAO Toolkit could be evolved to encompass evolutionary learnings as the workforce grows and keeps working to deliver results, making it a force for continuously improving the workforce and learning as much as possible, while also practically integrating those learnings, every time a mistake or unforeseen situation occurs.  Synergy with MetaDAOs Last note is that there is tremendous synergy between this and then the ability to mass produce cheap but highly impactful MetaDAOs. The operational glue of each MetaDAO could be easily created just by deploying another instance of the unified DAO Toolkit, and the standardized processes and UX would mean that it would be very easy for community members to participate across different MetaDAOs and Maker. Finally the MetaDAOs could then differentiate by beginning to develop more specialized modules and processes on top of the core DAO toolkit. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/4",
                        "https://forum.makerdao.com/t/this-week-in-governance/16382/2",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/3"
                    ],
                    "GPT-summary": "The author of the post explains the need for maximum reasonable transparency in the work of Core Units and proposes the development of a unified DAO toolkit to achieve this. The toolkit would cover all high and low-level processes, complexity, and information in the entire DAO with a single toolkit that has a unified UX and design. The author also suggests that the toolkit could be evolved to encompass evolutionary learnings as the workforce grows and keeps working to deliver results. The post also invites feedback and collaboration from the community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.502110389610389
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/09/2022-23:43:28",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}