{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-needs-liquidity-pools/4824",
            "title": "MakerDao needs Liquidity Pools ",
            "index": 4824,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/nanook",
                    "index": "#1",
                    "likes": "0",
                    "time": "21/10/2020-15:21:59",
                    "content": "Liquidity pools do a lot for taming volatility and making trading easier and quicker. This fits very well with the idea of reducing volatility to stabilize dai and another tool to bring back the peg. Just not sure where liquidity pools would fit best within the protocol? ",
                    "links": [
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/3",
                        "https://forum.makerdao.com/t/weekly-mips-update-18/4847",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-116-thursday-october-29-16-00-utc/4835/4",
                        "https://forum.makerdao.com/t/weekly-mips-update-19/4935",
                        "https://forum.makerdao.com/t/weekly-mips-update-20/5009"
                    ],
                    "GPT-summary": "The author is proposing the implementation of liquidity pools in MakerDao to reduce volatility and stabilize Dai. The author is asking for feedback on where liquidity pools would fit best within the protocol and a third party is providing constructive criticism and asking questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.35
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "7",
                    "time": "21/10/2020-15:42:10",
                    "content": "There are already liquidity pools that include DAI. In terms of bringing these to Maker, the main path is to allow the LP tokens to be used as collateral to mint DAI. This allows users to get credit on or lever up on liquidity pool tokens. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#3",
                    "likes": "1",
                    "time": "21/10/2020-17:47:38",
                    "content": "In addition to providing loans to liquidity providers as long mentioned above there have been some talks about providing liquidity to pools directly floating around on the forums.     Discussion on Uniswap liquidity pooling as a potential tool Governance       There has been some discussion in the past around the protocol minting dai and buying up assets on the open market like usdc and eth. Both of these asset types have disadvantages. Ethereum still is incredibly volatile and so is not a secure reserve currency. Usdc is stable, but is under regulatory and custodial jurisdiction. Neither of these tokens produce any yield.  We have also had some discussions about increasing dai reserves held by the protocol to allow us to sell dai on the market later …     I think the current idea is that if/when a strategic reserve is created for dai these liquidity pools tokens stand as a probable asset that the maker community would be interested in holding for that purpose. Personally I think this is going to be the most likely way that they will be incorporated outside of using them for loan collateral. There might be other options too like having the protocol fund some of these pools directly from fees collected in the stability buffer, but I’ve seen some pushback from the community stating things like “this can be done more efficiently by end users.” Speaking purely from conjecture here, it would seem to make sense to me if we used some of the mkr bought from flap auctions to fund for instance the DAI/MKR pool on uniswap to help ensure the long term health of the project for both of it’s related tokens. That said, not sure how likely it is that we would see that happen. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-115-thursday-october-22-16-00-utc/4757/2"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.356366459627329
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#4",
                    "likes": "1",
                    "time": "21/10/2020-17:56:00",
                    "content": "    Andy_McCall:  fund for instance the DAI/MKR pool on uniswap to help ensure the long term health of the project for both of it’s related tokens.   I honestly really like your idea, have one question, the fees earned from this pool where will them go? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#5",
                    "likes": "1",
                    "time": "21/10/2020-18:03:22",
                    "content": "Frankly, i haven’t thought about it much. I think that for uniswap pools specifically all of the fees are just collected in the pool itself so in practice you might not really need to worry about managing it much. Just as long as your main goal is ensuring that there are liquid pools out there, but like i said not sure whats best there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#6",
                    "likes": "1",
                    "time": "21/10/2020-18:03:39",
                    "content": "The beauty of that pool is that it wouldn’t be subject to IL since those mkr would be destined to the burn contract anyhow. I’d like the fees to go to gitcoin grants. The negative side effect is that we are doing open market operations in competition with end users taking away partially the advantage some may see to holding maker aside from governance ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.291666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#7",
                    "likes": "0",
                    "time": "21/10/2020-18:11:42",
                    "content": "Then having MKR/DAI LP as collateral can be a option? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#8",
                    "likes": "0",
                    "time": "21/10/2020-18:20:34",
                    "content": "not sure that it is advisable to have MKR even in a diluted form be used as collateral for loans as mkr is basically the equity traunch for the loan portfolio, so using it as collateral could exacerbate situations where the protocol is incurring losses from things like a price drop in eth. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#9",
                    "likes": "1",
                    "time": "21/10/2020-18:23:50",
                    "content": "The MKR-DAI pair has an insane $98 amount of liquidity so unsure why we should make a vault type for that. I’m all in to deploy capital to add value to DAI. But even providing MKR-DAI LP, I don’t see how that helps. In July it would have make sense to increase the ETH-DAI pair, but now there is enough liquidity. Maybe bringing liquidity on L2 solution like xDAI. Our users in low income countries can’t stay on mainnet with high gas fees. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.95
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#10",
                    "likes": "0",
                    "time": "21/10/2020-18:43:06",
                    "content": "    SebVentures:  The MKR-DAI pair has an insane $98 amount of liquidity so unsure why we should make a vault type for that.   lol, didn’t knew that, just was asking cuz of the question above.     SebVentures:  Maybe bringing liquidity on L2 solution like xDAI. Our users in low income countries can’t stay on mainnet with high gas fees.   This i asked a few days ago, love to see if a solution like this can be soon in the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.185714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#11",
                    "likes": "1",
                    "time": "21/10/2020-18:52:04",
                    "content": "For xDAI, wrapped xDAI liquidity on the main exchange is only $1 459 423 (and it’s like ETH there). I’m fully supportive of adding liquidity for WXDAI-ETH and WXDAI-MKR liquidity there if that’s useful for our DAI users there. Governance has validate the idea of Strategic Reserves and this can be a use case (still far from being live). ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaration-of-intent-strategic-reserves-fund-srf/3765"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.002525252525253
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#12",
                    "likes": "0",
                    "time": "21/10/2020-19:12:03",
                    "content": "    SebVentures:  I’m fully supportive of adding liquidity for WXDAI-ETH and WXDAI-MKR liquidity there if that’s useful for our DAI users there.   I think this would be an excellent idea. Current the HNY token is N1 token in xDAI-Network, and that is arguably not great because it’s an unknown token and people would very much prefer to have ETH available to covert to a ‘safe asset’ whenever they want. Similarly, adding MKR would give a very nice exposure to MakerDAO. Generally speaking, even if I am not from a low income country, I am personally enjoying using xDai a lot: it’s fast, the bridges work fine,  and the fact of spending only 0.0001 DAI for tx fees is just very pleasant. In my very humble opinion, xDAI-Network is going to grow over the next few months. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1
                }
            ]
        }
    ]
}