{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-alternative-reasons-why-dai-is-returning-to-1-001-peg-versus-usdc/5285",
            "title": "[Discussion] Alternative Reasons? Why DAI Is Returning to 1.001 Peg versus USDC ",
            "index": 5285,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "dai"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "2",
                    "time": "23/11/2020-19:25:52",
                    "content": "Market Speculation Discussion–All opinions are my opinions With the recent excitement behind the Return of DAI to the Peg, I have started thinking of many reasons as to why this has happened. My first impression–it’s from the news that the community wants to implement the PSM. My other thoughts–perhaps the measures the community has taken via Governance decisions, discussions, and other actions. Or perhaps short-sellers are out and moved-on to other trades, or/and arbitrageurs. The current Maker blog Governance Poll: Accelerate the Peg Stability Module Launch titled “Governance Poll: Accelerate the Peg Stability Module Launch” states that: “The PSM will be initially rolled out for at least USDC and (time permitting) to the other stablecoins as well. Debt ceilings will be made high enough to allow as much supply as needed to return the peg to 1.001 USDC.” As I type out this opinion, DAI is 1.0012 to USDC on Coinbase Pro. But I’ve been thinking–is the return to the Peg community driven, Fund/Arb driven, etc., or just a return of CONFIDENCE in DAI, or perhaps POPULARITY? Now before you shush me away  I can tell you that while roaming/lurking around Degen Telegram channels and Discord–I’ve seen messages like, “I’m going to ape-in with 1,000 DAI”. Or, “Maker is adding ________ as collateral”, and “I’m an LP with DAI/%&#”. What I am saying is, the talk of the DeFi community is starting to turn a little positive with regards to Maker and DAI (if I am right, I hope I don’t jinx it ). Okay–we All don’t want to probably talk about it but in my opinion after the Black Thursday events Maker lost some supporters. And it felt like back then on TG, Discord, Crypto Twitter, most wanted to see the protocol fail. Now I’m seeing a resurgence of ETH heads wanting to use DAI, maybe not as much as USDC (would be cool if someone had a study on this) but we are starting to get there. Not quite–but once we get there–that’s when we know it’s on! What are your Thoughts? Do you believe the Peg is returning because_______________. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.157465451215452
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#2",
                    "likes": "2",
                    "time": "23/11/2020-20:06:20",
                    "content": "1 - uniswap return 200m 2 - ETH increasing, ETH vault increasing 3 - 19M has been converted from pickle to tornado 4 - I bet a lot of dais have been removed from pickle. Also 400m dai of debt in uscd are not reconvertable so no glass ceiling limit the dai can go. As the 4% interested is about to hit the 100%. What else? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#3",
                    "likes": "5",
                    "time": "23/11/2020-20:10:11",
                    "content": "To quote Friedman: “Inflation is always and everywhere a monetary phenomenon.” I don’t think we have to look much further than the increase in supply from ETH Vaults. That’s Dai that gets sold directly onto the market. WBTC and YFI helped a bit too. EDIT: To be more specific, I’m saying it’s just people using Vaults for leverage. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#4",
                    "likes": "1",
                    "time": "23/11/2020-20:13:35",
                    "content": "I honestly believe the biggest factor is the pump in ETH and the market generally shifting to a more speculative nature, diminishing the popularity of stablecoins. Same factor during pump in 2018 where SF had to be raised to 22% to maintain the peg. If PSM were to be cancelled I bet price would still keep falling (but we should launch it anyway to maintain credibility.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#5",
                    "likes": "3",
                    "time": "23/11/2020-20:40:45",
                    "content": "My guess is that the price decline is due to increasing leverage, but I believe one of the main pieces giving DAI/USDC shorters confidence is still the PSM. If we were to wait on the PSM, I’m expecting you would see the stablecoin supply come down and the Dai peg break upward again. We saw this happen a bit on Thursday when the SF reduction vote was in contention. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.810185185185185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#6",
                    "likes": "0",
                    "time": "23/11/2020-21:13:42",
                    "content": "As I said before, people are realizing that DAI is USDC, so no reason to price them differently. I was looking forward to buying (more) DAI at $1.00 before it went full USDC, now I’m not interested. If USDC goes down, DAI will go down. The resilience is gone. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.344907407407407
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "2",
                    "time": "23/11/2020-22:19:06",
                    "content": "Come on Bit! Where’s the Love? You know you  DAI ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#8",
                    "likes": "1",
                    "time": "23/11/2020-22:25:34",
                    "content": "I love decentralized and censorship-resistant DAI and I’m fighting for it (sort of). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "23/02/2021-04:25:35",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}