{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/pre-mip-discussion-a-market-sentiment-based-strategy-to-burn-mkr/8089",
            "title": "Pre-MIP Discussion: A Market Sentiment-Based Strategy to Burn MKR ",
            "index": 8089,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "idea",
                "discussion",
                "proposal-ideas",
                "system-surplus",
                "burn",
                "makerburn",
                "capital-efficiency"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#1",
                    "likes": "8",
                    "time": "14/05/2021-22:21:18",
                    "content": " Pre-MIP Discussion: A Market Sentiment-Based Strategy to Burn MKR   Current Burn Situation As it stands, we currently target a 25% burn with lerp based on a recent community poll and executive vote. This target to burn MKR, in my opinion, is somewhat arbitrary. Sometimes the burn is on. Sometimes it’s off. During pullbacks, we all scramble to decide whether we should restart the burn and by how much. Once the Surplus Buffer hits 60M, we’ll again have to debate how to increase it while still burning MKR. The way we currently burn MKR is not efficient. The decisions we make are arbitrary, and these discussions eat away at the already limited cognitive bandwidths of our team members.  Dynamic MKR Burning Instead of manually adjusting our burn rates, turning them on and off when we feel like it (someone calls lerp), we can implement an automated burning strategy based on on-chain metrics and market sentiment.  Counter-Trading Market Sentiment  We can counter-trade market sentiment by looking at on-chain metrics, such as long and short interest. The best buying opportunities tend to be when short interest across the board piles up, not just on MKR, but on the entire market. Conversely, the worst times to buy are when the entire market is long. Effectively, without knowing the current price or any previous price action, we can identify:  Pullbacks worth buying when shorts have piled up. Levels to stop burning when longs have piled up.     On-Chain Metrics & Exchange Data  We have access to on-chain metrics and all exchange data for both CEXs and DEXs. From experience, there is reliable signal in counter-trading long and short interest. It’s worth looking into all the data available and determine which of it is best suited for our needs.    Automated Burning Strategy  Vote on a target percent of the fees to be dedicated to MKR burning, and set that DAI aside.  Currently, we voted for 25%.   Read long and short contracts data from on-chain metrics and select exchanges.  We can discuss and vote on which data feeds we like.     Suggested Logic The logic I propose below is just a suggestion for how I believe we can implement a strategy to better optimize how we burn MKR:  For DAI that is set aside towards burning:  If long interest maxed out:   Burn: 0% of DAI   If long interest at 80%:   Burn: 5% of DAI   If long interest at 60%:   Burn: 10% of DAI   If long interest equals short interest:   Burn: 20% of DAI   If short interest at 60%:   Burn: 30% of DAI   If short interest at 70%:   Burn: 50% of DAI   If short interest at 80%:   Burn: 70% of DAI   If short interest maxed out:   Burn: 100% of DAI       Edit #1: We could also agree on a base burn rate to DCA at any price, maybe 5-10% of the allotment. As short interest piles up, the automation would crank the burn rate. Also, it’s worth noting that this does not necessarily guarantee that we are burning at exact bottoms each and every time. Shorts are often right before they are wrong. Still, by cranking the burn when shorts pile up, we are increasing the likelihood that we are burning on pullbacks at lower, more optimal prices. The biggest downside, as I see it, is that we just burn less and retain more DAI in the SB, especially during a sustained run.   Edit #2 - In response to @flipflopflapdelegate: Governance would still have the authority to revoke the burn allotment to zero if we believe we are entering exceptionally bad times and want to wait for a \"bottom.” Conversely, if we think times are good, we can vote to increase how much DAI we allocate to burn by automation. The idea though is that we all suck at timing markets and that a strategy like this takes the guesswork out of it. You probably want to burn when times are bad because the price is likely depressed and you’ll never know when the “bad times” end.    Discussion The exact implementation for this should be open to discussion. Someone willing would have to build this, but I believe the time and energy spent would be worthwhile. Not only will we optimize our MKR burn, but we will also reduce unnecessary cognitive overload on governance in the future.  There could be some linear or logarithmic interpolation for how much we burn and at what levels. We can vote on how much we would like to burn in general. We can vote on which data feeds we trust the most. We can run backtests on variations of this strategy and compare them against our past burn performance.   Note: The general idea for this counter-trading strategy comes courtesy of @TomDeMichele. He and his team have worked to develop a custom trading indicator. They would be more than happy to work with us to develop a strategy to counter-trade market sentiment to burn MKR.    Tags  Credit & Shoutouts  @TomDeMichele @prose11   Requests for Feedback  @ultraschuppi @LongForWisdom @reuptaken @SebVentures @Primoz @flipflopflapdelegate @iammeeoh @g_dip @Aaron_Bartsch @brianmcmichael  ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-143-thursday-may-27-17-00-utc/8228",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-142-thursday-may-20-17-00-utc/8116/4",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-14-20-2021/8194"
                    ],
                    "GPT-summary": "The author proposes an automated burning strategy for MKR based on on-chain metrics and market sentiment. The proposal suggests counter-trading market sentiment by looking at on-chain metrics, such as long and short interest, and implementing an automated burning strategy. The author suggests a logic for how to implement the strategy and requests feedback from several individuals.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.289253539253539
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#2",
                    "likes": "7",
                    "time": "14/05/2021-22:49:35",
                    "content": "Timing the market is notoriously difficult. I am skeptical any automated strategy would outperform. That said, currently MakerDAO buys and burns MKR when the surplus buffer is overflowing, but mints and sells MKR when it is depleted. An interesting adjustment to this process would be to curtail some of those buy and burns (in “good times”) and store those funds for use in slowing down minting and selling (during “tough times”). If it turns out to be true that in the long term MKR prices are cheaper during “tough times” and more expensive during “good times” then the protocol comes out ahead. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.802469135802469
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#3",
                    "likes": "8",
                    "time": "14/05/2021-22:49:58",
                    "content": "Something something if counter-trading worked everyone would be rich. I like the idea in theory but not sure how much more efficient it is (not to mention added risk to the protocol) compared to a general DCA strategy over the long term. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#5",
                    "likes": "0",
                    "time": "14/05/2021-22:59:28",
                    "content": "We can have a base burn rate of like, 5-10% of the burn allotment for example… and have it crank when shorts piled up. Worst case, we don’t burn as much… which, I don’t think is a huge downside? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 2.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "2",
                    "time": "14/05/2021-23:22:29",
                    "content": "Nice write-up and explanation Burban. From a traditional point of view  buybacks occur when growth opportunities are poor and when companies have excess capital. Assuming we enter a Bear Market, I think it would be best to accumulate DAI and wait it out. An example of this–last year during the pandemic, stock buybacks were cut by 55% because companies were hoarding Cash. I guess what I’m asking is, if short interest is high, why burn? I gotta believe when short interest is high, it means things are not going well. Or, perhaps I misunderstood the whole concept. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.955555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#7",
                    "likes": "1",
                    "time": "14/05/2021-23:32:41",
                    "content": "Edit #2 - In response to @flipflopflapdelegate: Governance would still have the authority to revoke the burn allotment to zero if we believe we are entering exceptionally bad times and want to wait for a “bottom”. Conversely, if we think times are good, we can vote to increase how much DAI we allocate to burn by automation. The idea though is that we all suck at timing markets and that a strategy like this takes the guesswork out of it. You probably want to burn when times are bad because the price is likely depressed and you’ll never know when the “bad times” end. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#8",
                    "likes": "2",
                    "time": "14/05/2021-23:42:59",
                    "content": "So implementation wise we could probably set minimum amounts on the SB so 100% is being stacked there when it is below that amount. Then to @flipflopflapdelegate ’s point it would be pretty easy to turn it off if we’re worried about dropping revenue. The best thing about this idea is it allows us to burn based on price action. Currently we only get to burn until someone calls lerp. This means we can easily be burning while the price is high and stacking the SB when it’s low. The part of this idea that excites me was as a defense against short interest driving down MKR price. The cheaper MKR is, the less expensive a governance attack is. Plus shorting inherently involves borrowing, which already puts us at risk. If we use this mechanism we help prevent an attack that relies on borrowing more MKR as the price drops. The only question is how easy would this be to implement. But the best thing is risk wise it only toggles the burning amount, which we already do with lerp! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.28625730994152
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#9",
                    "likes": "1",
                    "time": "15/05/2021-01:46:17",
                    "content": "If anything, by reducing burning as the market goes long, we allow the price of MKR to go up organically. The price doesn’t always only go up though. Sometimes it goes down, especially after sharp rises, and that’s  completely healthy. Shorts pile up on pullbacks, and that’s when we would ramp up burning. This strategy would blunt MKR’s downside and we would be buying the dip every time. This is basically a strategy to buy fear, typically the best buying opportunities. We can identify fear by proxy, short interest. Generally, it peaks when the market is most afraid. It doesn’t means we buy and burn at the exact bottom every time, but it’s better than micromanaging when we do burn. We remove the human element of turning burning on or off. Also, I’d think some % of the DAI should be dedicated to a pure DCA, regardless of price. The rest could be deployed on pullbacks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.599082341269841
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#10",
                    "likes": "5",
                    "time": "15/05/2021-04:45:36",
                    "content": "I generally feel like having a consistent and predictable burn is better as it allows kerpers to prepare and also make auctions more competitive. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#11",
                    "likes": "1",
                    "time": "15/05/2021-07:40:01",
                    "content": "I think we need to zoom out. No need to time the market. Rare events are where we really lose money. It’s way too early for dealing with such optimizations. I would rather focus on separating surplus buffer from expenses (part of fees should not go to surplus buffer. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#12",
                    "likes": "1",
                    "time": "15/05/2021-09:31:16",
                    "content": "    Aaron_Bartsch:  if counter-trading worked everyone would be rich   This. If the honorable gentleman @TomDeMichele, or anyone else for that matter, has really worked out how to counter-trade they would be “rich AF” within a month or two. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#13",
                    "likes": "3",
                    "time": "15/05/2021-14:22:36",
                    "content": "I like the idea of increasing the impact of burns, but this feels complicated. What about something similar to the idea below? For example, P/E ratio (thanks for adding this @makerburn!) is ~23. If it drops to, say, 15, turn on the burner. That way MKR price should be encouraged to stay in step with fees, TVL etc, if it’s not already keeping pace.    [Tutorial] Increase the Surplus Buffer using the `lerp` Module   There’s no 100% correct answer, but one extremely simple solution would be burning above a certain FCF yield (e.g., it’s currently trading at 4.2%, or 23.8x run-rate cash flows, which is ridiculously cheap versus any private or public market comp). This would solve for arbitrariness and “poor timing,” among other things. There’s plenty of incorrect answers though, such as burning below an arbitrarily defined absolute price or price range, such as $5k. This would come with a whole host of capital allocation inefficiencies at the expense of MKR holders (but luckily this isn’t planned, nor do I think it’d ever get passed)   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.256652661064426
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#14",
                    "likes": "2",
                    "time": "15/05/2021-15:46:24",
                    "content": "This is the solution I support. It’s simple and can be measured without much overhead. I think short interest is interesting, but only a derivative metric of PE which is what we should really be targeting. Also, I wouldn’t want to punish short sellers if they’re selling at inflated valuations. I think MKR holders would rather support a more stable market around a fair value. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#15",
                    "likes": "7",
                    "time": "15/05/2021-16:42:35",
                    "content": "This is an interesting idea but I feel it’s a bit premature and most importantly, needs to be dependent on where the Surplus Buffer is relative to risk weighted assets (CET1 ratio). I think the first step to having an automated burning strategy is to first discuss and implement an automated Surplus Buffer strategy. I would strongly recommend we listen to the experts in the @Risk-Core-Unit on what is appropriate and how we could calculate based on changes in our collateral pool. Let’s not forget we’re in the midst of onboarding a number of CUs and will have to pay them out of the Surplus Buffer. Even if we only consider the CUs that have been proposed today our annual DAI expenses exceed the current Surplus Buffer. Yes, the forward annualized revenue we’re generating far exceeds this number, but we fell from ~17.5M annualized income in August 2019 to <10K in August 2020 and are in a bull market where dog named tokens with a multi-trillion coin supplies are being aped into. We need to have enough funds to cover our risk-weighted assets and DAI CU expenses, this should be our priority. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#16",
                    "likes": "2",
                    "time": "15/05/2021-17:22:57",
                    "content": "    Aes:  Let’s not forget we’re in the midst of onboarding a number of CUs and will have to pay them out of the Surplus Buffer. Even if we only consider the CUs that have been proposed today our annual DAI expenses exceed the current Surplus Buffer.   This    I can’t help but think that when growth opportunities become poor and when companies have excess capital they should hold-on to Cash (DAI). Is the Surplus Buffer at a stage where one can say it is sufficient to outpace volatile Market conditions, or it has the ability to survive a slowdown in growth opportunities? The last thing we want to do is to ask Core Units to cut down on Staff because we don’t have enough of a healthy Surplus Buffer. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.9603174603174605
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#17",
                    "likes": "2",
                    "time": "15/05/2021-17:38:55",
                    "content": "Is there a tally of these proposed expenses, by the way? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#18",
                    "likes": "5",
                    "time": "15/05/2021-17:50:16",
                    "content": "    Aes:  Let’s not forget we’re in the midst of onboarding a number of CUs and will have to pay them out of the Surplus Buffer. Even if we only consider the CUs that have been proposed today our annual DAI expenses exceed the current Surplus Buffer.   When you reply on the forums, I sometimes have to make sure I’m not reading my own posts. By which I mean, I’m catching what you’re pitching here, and it’s very important to keep our eye on it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TomDeMichele",
                    "index": "#20",
                    "likes": "1",
                    "time": "15/05/2021-17:58:18",
                    "content": "Honestly it has been a good month or two. Hence the idea to share the idea here.  @Planet_X ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TomDeMichele",
                    "index": "#21",
                    "likes": "2",
                    "time": "15/05/2021-18:00:51",
                    "content": "Trading short/long interest is just one example of a metric that can be used. There is lots of data like exchange flows, etc to consider. I think the specific strategy is less important than finding a profitable strategy that would work. That is something the right group could do I would think. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.648809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#22",
                    "likes": "3",
                    "time": "17/05/2021-07:30:42",
                    "content": "I was looking at the chart today and thinking “Wow, would be great if MKR can be burned now”  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#23",
                    "likes": "3",
                    "time": "17/05/2021-13:31:36",
                    "content": "Yes I have something - format may be changing a bit but looking to share something in the next couple weeks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}