{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/transitioning-away-from-rocket-chat/10097",
            "title": "Transitioning Away from Rocket Chat ",
            "index": 10097,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "rocket-chat"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#1",
                    "likes": "10",
                    "time": "01/09/2021-02:33:40",
                    "content": "Hi Everyone, As the Maker Foundation dissolution reaches its final stages, one of the remaining tasks is shutting down the Maker Rocket.chat channel by taking the databases offline. This means all the public chats (ie #general, #speculation etc…), and conversations with other community members will be taken offline and become inaccessible after October 31, 2021. We recommend that any conversations a community member would like to keep should be screenshot or copy/pasted. The MakerDAO Community is tasked with exploring and/or deciding on a new communications platform (ex. Discord). Moreover, given certain legal obligations (related to the ongoing class action, for example) the Foundation is required to maintain the Rocket Chat channels and cannot “pass” the RC account or channels included therein to the community. Lastly, we understand the inconvenience this may cause for everyone and appreciate everyone’s understanding. We hope that with a two-month headstart, the community can find a suitable replacement and transition to a new platform. If you have any questions, please contact Brian (@bri174) or Coulter (@Coulter). @LongForWisdom @prose11 ",
                    "links": [
                        "http://chat.makerdao.com",
                        "https://forum.makerdao.com/t/maker-governance-review-september-2021/10645",
                        "https://forum.makerdao.com/t/options-for-transitioning-from-rocket-chat/10243",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-3rd-9th/10241",
                        "https://forum.makerdao.com/t/maker-relay-ep-61/10214",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-27th-september-2nd/10125",
                        "https://forum.makerdao.com/t/maker-relay-ep-69-en-espanol/11439",
                        "https://forum.makerdao.com/t/announcing-makerdao-s-official-discord-server/11079",
                        "https://forum.makerdao.com/t/maker-relay-ep-69/11345",
                        "https://forum.makerdao.com/t/govcomms-bi-weekly-update-sept-17-30/10596",
                        "https://forum.makerdao.com/t/maker-relay-ep-63/10400",
                        "https://forum.makerdao.com/t/maker-relay-ep-63-en-espanol/10443",
                        "https://forum.makerdao.com/t/maker-relay-ep-61-en-espanol/10376"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.425560550560551
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#2",
                    "likes": "1",
                    "time": "01/09/2021-05:21:44",
                    "content": "@Bri174 is there a way to get some data dump backups from channels? I am thinking mostly private channels where relevant and important issuer related conversations happened for assets onboarded. My previous company did something like this in slack channels and I remember that was possible. Our team currently doesn’t have a backup plan yet (cc @SebVentures) so we need to manage that in the transition. Something like this: GitHub - willardb/rocketchat-history-downloader: Download, export, and preserve Rocket.Chat user-a ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4523809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "0",
                    "time": "01/09/2021-05:40:18",
                    "content": "Thanks for the heads-up @Bri174 even if this is short-term. What is the situation regarding the forums? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#4",
                    "likes": "4",
                    "time": "01/09/2021-07:51:07",
                    "content": "Just a reminder of this poll: https://forum.makerdao.com/t/informal-poll-discord-chat where it emerged that there is some kind of consensus for moving to Discord. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "0",
                    "time": "01/09/2021-09:39:02",
                    "content": "This is a sad day in Maker history  Rocket Chat was my MVP, Back in the day it was my favorite melody. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#6",
                    "likes": "1",
                    "time": "01/09/2021-14:09:09",
                    "content": "Let me look into that for you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#7",
                    "likes": "1",
                    "time": "01/09/2021-14:09:33",
                    "content": "Sure. Nothing is happening with the forums. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#8",
                    "likes": "1",
                    "time": "01/09/2021-14:29:50",
                    "content": "Sorry,  Frank. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "10",
                    "time": "01/09/2021-14:35:02",
                    "content": "Just to confirm GovAlpha is investigating options with a couple of groups. We’ll make sure that we have something sorted by the deadline. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#10",
                    "likes": "1",
                    "time": "01/09/2021-14:51:53",
                    "content": "Long would it be possible for the Groups to look into an IPFS based tool? Not sure if that exist, or if its scalable–but TOL since Discord was rumored to be in talks w/Microsoft --and I believe Sony took a stake in the company–not sure if the community has thoughts on such. Not sure–and I guess the DAI Foundation can still own a fully decentralized application (if available), right. Anyhow, I believe Stacks and… oh man I can remember the name–maybe ICP–would built one… maybe i’m asking for 2 much ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.936507936507937
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#11",
                    "likes": "4",
                    "time": "01/09/2021-15:02:35",
                    "content": "Nothing prevents us from using several platforms… One could be more “intimate”… the other more “for the masses”. One of the reasons for moving to Discord was also to attract new people. We are always the same 20 people on rocket.chat. Which is nice in some ways, less in others. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.91372053872054
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#12",
                    "likes": "1",
                    "time": "01/09/2021-15:58:03",
                    "content": "    flipflopflapdelegate:  Long would it be possible for the Groups to look into an IPFS based tool?   Yeah, so I would like to get a report done that explains the options and gives some pros and cons. We’re still like 13 hours post announcement right now though, so give us a little time lol.     iammeeoh:  Nothing prevents us from using several platforms…   Nothing prevents us… But it does incur a fairly step cost in moderation and coordination. I don’t want to be in a situation where core units + community have conversations spread across multiple platforms. That said, having backups in place is pretty critical, and is something I’d like to organise soon as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.899107142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#13",
                    "likes": "1",
                    "time": "01/09/2021-16:14:03",
                    "content": "    LongForWisdom:  That said, having backups in place is pretty critical, and is something I’d like to organise soon as well.   Yes, agreed. I suggest to take a loo at “Keybase” (https://keybase.io/) as a backup channel. It is based on public keys, end-to-end encryption and such. I thin it is considered “pretty safe”. On the other hand, Discord is the kingdom of scammers, people impersonating other people, PMs inviting you to group channels, etc  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.194444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#14",
                    "likes": "1",
                    "time": "02/09/2021-14:09:07",
                    "content": "    iammeeoh:  On the other hand, Discord is the kingdom of scammers, people impersonating other people, PMs inviting you to group channels, etc   Regarding to this, Discord, Telegram, etc etc there are scammers everywhere, we were lucky on rocketchat cuz to be honest rocketchat is not so popular among normal users. On Discord with good bots is hard for scammers to get into the group, and you can have lot of private channels in there, the other thing is that yeah, as Discord is quite popular lots of conversations might go like “more public”. On the other hand, Slack is veeeery used by lots of companies all over the world, we can have Discord like a more public chat with Community and outsiders, and Slack as the private channel. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.938725490196078
                },
                {
                    "author_link": "https://forum.makerdao.com/u/KryptoKnight",
                    "index": "#15",
                    "likes": "0",
                    "time": "02/09/2021-20:29:13",
                    "content": "I’ll be honest I found it odd that Maker didn’t have a Discord when I first joined. I have nothing against RocketChat, I just feel like I miss out on convos because they are not with my main crypto community hub of Discord. Like others have said, there are bots and moderation tools that can mitigate scammers and other riff raff. If we create permissioned rooms for the more regular community members we can still have the quality convos we are used to on RocketChat. As an added benefit, we will probably gain more community members as it lowers the barrier to entry. Sure, some will be passerbys with low-quality input, but with the permissioned rooms I don’t see this being much of an issue. I do like the idea of using Keybase as a secure backup channel as well. Just don’t use Telegram please! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.329545454545454
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#16",
                    "likes": "3",
                    "time": "02/09/2021-22:24:03",
                    "content": "Rocket Chat is a clunky, buggy and frustrating experiment that I hope has run its course. I agree with the dominant sentiment here that we should just transition over to Discord though I hope the Foundation can be flexible in making the “data dump” @williamr requested.  If that ask can be answered in the positive, we should chart a course for Discord, which will have the added benefit of easing the onboarding process for new contributors (imo). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9393939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s_ben",
                    "index": "#17",
                    "likes": "7",
                    "time": "03/09/2021-01:47:13",
                    "content": "SourceCred supports Discord, should we want to include chat in rewards. It would take some configuring, but wouldn’t be too heavy a lift to get something basic up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#18",
                    "likes": "6",
                    "time": "03/09/2021-04:17:02",
                    "content": "Even if we can do it, should we? Currently, RocketChat is essentially a chatroom where people just hang out and there’s a good mix of serious and small talk. The way I use it is mostly social and to ask for quick help here and there. Meanwhile the Forum is for deeper and more complex discussions. Some have already pointed out that there is an issue on the Forum where there’s people making useless posts just to earn cred. It’s not widespread but does happen. I imagine rewarding chats could lead to a lot of spamming there without adding any real value. It’s nicer when people are social because they want to be, rather than to earn some DAI. Just my 2p but I do understand that there’s different points of view to this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3273809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#19",
                    "likes": "3",
                    "time": "03/09/2021-07:03:22",
                    "content": "Aw Rocketchat, I will miss you  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#20",
                    "likes": "5",
                    "time": "03/09/2021-14:37:50",
                    "content": "@Content-Production Is there any way y’all can create a Commemorative NFT for past & present Rocket Chat participants? That would be neat. Based on activity (car-jacking the idea from LobsterDAO Telegram Group  ) Check this out Not sure if you can pull the same data by taking a snapshot from say the release of MCD (January 2020)  to now… Actually the old school Maker people as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#21",
                    "likes": "2",
                    "time": "03/09/2021-14:39:34",
                    "content": "NFT for Maker participants sounds fascinating. Many have been asking for it as well. And can be gas efficient if using other L2, mainnets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/KryptoKnight",
                    "index": "#22",
                    "likes": "2",
                    "time": "03/09/2021-15:35:43",
                    "content": "The NFT idea is interesting. Perhaps we could even have a room on Discord for holders, special swag drops etc.? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.142857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#23",
                    "likes": "1",
                    "time": "03/09/2021-16:29:20",
                    "content": "Cool idea! I’m sure that’s doable. We’ll look into it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.34375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#24",
                    "likes": "2",
                    "time": "03/09/2021-16:29:38",
                    "content": "@aburban90  “They don’t want me to have another Anthem, So, I make I sure got another Anthem” —DJ Khaled ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#25",
                    "likes": "1",
                    "time": "05/09/2021-02:56:22",
                    "content": "Discord can be a good option, in addition to creating a server with all the tools, if you create a good community can be very positive for Maker, the problem of spam, is somewhat problematic. I know this tool that is an all-in-one, personally I have not used it, maybe it will be useful. https://noysi.com/ Goodbye rockechat, hello  (insert new service) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.776515151515151
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#26",
                    "likes": "2",
                    "time": "07/09/2021-22:24:20",
                    "content": "Hi All/@williamr I wanted to revisit this. FYI, we opened the APIs and tested the script, and everything looks good. If community members are interested in doing a data dump from the public channels and have technical questions, please go to the #help channel in Rocket Chat and ask away. A member of the Foundation’s remaining tech ops team will be there to answer and assist as much as possible. Please note that there could be some availability issues if everyone runs the script simultaneously, but we will deal with that case by case. I will also post this message in several RC chats for maximum coverage. Thanks. Brian ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.821428571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#27",
                    "likes": "2",
                    "time": "08/09/2021-07:56:25",
                    "content": "Regarding POAPs, what happened to the series started in 2020 Q4 and 2021 Q1? Has it been stopped?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#28",
                    "likes": "1",
                    "time": "08/09/2021-10:51:21",
                    "content": "Ya—no funding—it was also expensive to create. Hopefully each Rocket Chat commemorative NFT will be unique. Imagine?—and only 111 of them will ever exist  I use “1” as a tribute to DAI and the community—in the quest to remain pegged to 1. That would be  Alright, I’m asking for too much haha ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#29",
                    "likes": "1",
                    "time": "08/09/2021-15:24:03",
                    "content": "BRB gonna start a “what NFT’s do you want for being in Maker” thread ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#30",
                    "likes": "2",
                    "time": "08/09/2021-15:24:48",
                    "content": "We stopped those due to low participation. If it helps, we’ve been quietly tinkering in the background to make the MVP of Maker Badges (the little icons next to your profiel) more robust, scalable, and interesting. The final pieces are coming into place to start user testing and debut a roadmap. Soon  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4296875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#31",
                    "likes": "0",
                    "time": "08/09/2021-15:44:31",
                    "content": "    twblack88:  We stopped those due to low participation. If it helps, we’ve been quietly tinkering in the background to make the MVP of Maker Badges   Well… participation was/is one of the problems here. We had like 6 MKR addresses voting in that period. What about promoting the POAP thing with events, like MKR drops or something like this instead of silently shutting down the thing? I am personally not very interested in forum badges. Feels like something from 20 years ago, it’s not decentralised, and if for whatever reason the forum goes down, they are lost. We are in Crypto/DeFi, the POAP or other things should be favoured. Note: I haven’t research much about badges (I have 0), so I might be wrong on some aspects. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.488194444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#32",
                    "likes": "1",
                    "time": "08/09/2021-15:51:11",
                    "content": "    iammeeoh:  Feels like something from 20 years ago, it’s not decentralised, and if for whatever reason the forum goes down, they are lost.   Fair, but… if the badges went in your wallet and based around on-chain actions would that change your mind?     iammeeoh:  What about promoting the POAP thing with events, like MKR drops or something like this instead of silently shutting down the thing?   That’s a @juan question ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.486111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#33",
                    "likes": "1",
                    "time": "08/09/2021-16:00:40",
                    "content": "    twblack88:  Fair, but… if the badges went in your wallet and based around on-chain actions would that change your mind?   Yes! But only partially because I don’t like the idea of sharing my Ethereum address in a forum. Somebody with access to it could check out my voting behaviour, or worse, how much MKR/ETH/tokens I have. This is not web3 in my opinion. I did like very much the Poap thing because it was something awarded via the Forum (old-internet), via a PM, but could be claimed by any 100% anonymous wallet of choice (web3) in xDai for free.     twblack88:  That’s a @juan question   @juan could you please throw some MKR at POAP addresses?    EDIT: I understand the above are VERY PERSONAL likings. @twblack88 I’m super happy to see what you guys are preparing, and I am 100% open to be positively surprised and to participate! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.958974358974359
                }
            ]
        }
    ]
}