{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/no-new-executive-proposal-2021-07-30/9591",
            "title": "No New Executive Proposal - 2021-07-30 ",
            "index": 9591,
            "category": [
                "Updates"
            ],
            "tags": [
                "executive"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "8",
                    "time": "29/07/2021-18:43:55",
                    "content": "Hello everyone! As Reported in today’s Governance and Risk call we will not be putting up an Executive tomorrow. This is a collective decision from the mandated actors but was brought up for discussion by GovAlpha. Last week @LongForWisdom posted this 2021-07-23 Executive and ongoing participation issues, concerning our plans with the prior executive, and mentioning discussions about switching to a biweekly Executive Proposal cadence. While we have not concluded that a bi-weekly cadence would be preferable, the Mandated Actors have agreed that we should not be seeking to put up an Executive every week, just for the sake of having a new one. In this week’s case, the only contents would have been some code housekeeping changes from the @Protocol-Engineering team that can easily be batched into next week’s vote. Voter participation remains a primary concern of GovAlpha, and we hope that some amount of voter fatigue will be relieved by not pushing nominal executives up for a weekly vote. We believe that Voter Delegation will help with some participation issues, but until there is significant voting power resting with recognized delegates we do not suspect there to be too much change in participation. We are, as always, open to questions and concerns about this decision and encourage community feedback on how we can best communicate changes. Thank you for your time, feel free to comment here or reach out to me privately with concerns if you prefer. A reminder that we have an anonymous question box that can be utilized for concerns outside of Governance calls as well. ",
                    "links": [
                        "https://forum.makerdao.com/t/2021-07-23-executive-and-ongoing-participation-issues/9500",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/maker-relay-ep-56/9649",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-august-1st-2021/9657",
                        "https://forum.makerdao.com/t/no-new-executive-proposal-2021-08-13/9841",
                        "https://forum.makerdao.com/t/maker-relay-ep-56-en-espanol/9812",
                        "https://forum.makerdao.com/t/maker-governance-review-august-2021/10139"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.051677489177489
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "12/08/2021-18:44:42",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/no-new-executive-proposal-2021-08-13/9841",
            "title": "No New Executive Proposal - 2021-08-13 ",
            "index": 9841,
            "category": [
                "Updates"
            ],
            "tags": [
                "executive"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "4",
                    "time": "13/08/2021-11:33:07",
                    "content": " Announcement As mentioned during yesterday’s Governance and Risk Call we will not be putting up a new Executive Proposal today. While this is the second time in a row that we have opted for biweekly Executives, we have not committed to that being our new schedule. This week we did not have anything from previous polls or an urgent need of posting, with a decent amount of expected content slated to be ready by next Friday. While this was the reason we did not set up a new vote, it’s probably worth noting that the previous executive has not passed yet and at the time of writing is sitting under 14k MKR.  Call for feedback As for the other part of this post, I would like to ask the community for some feedback on the communication of these executive cancelations. Typically we have not announced our intentions until after confirming during the weekly Governance and Risk call on Thursdays. There are a few practical reasons for this, and some risks associated with announcing earlier. However, in the spirit of transparency and our commitment to serving the community, I would like to detail our considerations here and then ask the community if they feel the timing of these announcements should change.  Reasons for announcing later in the week:  Gives time for urgent situations or missed material to come to the Mandated Actors’ attention. Allows for a potential live discussion on the Governance and Risk call. Could prevent some amount of voter apathy (voters not taking action due to perceived lack of urgency). Gives time to contact relevant stakeholders to confirm a potential week-long delay will not cause problems.   Risks of waiting until later in the week:  Voters may not see the post/hear the announcement until after they go looking for the Executive. Could give the appearance of favoritism toward Executives that have longer to pass. A select group (Mandated Actors and anyone they need to contact) has access to the information before the community at large. If something important is missed by the Mandated Actors there is little turnaround time to spin up an executive.   Please comment below, reach out to me privately, or utilize our anonymous submission box to let us know your thoughts. ",
                    "links": [
                        "https://forum.makerdao.com/t/no-new-executive-proposal-2021-07-30/9591",
                        "https://vote.makerdao.com/executive/template-executive-vote-momc-proposal-august-core-unit-budgets-housekeeping-august-6-2021?network=mainnet#proposal-detail",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-13th-19th/9936",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-154-thursday-august-12-17-00-utc/9793/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.201649430816097
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "1",
                    "time": "13/08/2021-12:29:24",
                    "content": "I don’t have any opinions about when in the week you announce it, but I would like to see some non-discretionary methodology for when an executive is skipped. That way we don’t end up in a situation where a controversial executive doesn’t get competition based on the discretion of GovAlpha. If there’s literally nothing to put into a spell, that’s one thing, but I would like to see some “rules of the road” that lower the ability of individuals to put their thumb on the scale. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "0",
                    "time": "13/08/2021-15:43:09",
                    "content": "I really don’t have too many issues with executives and late cancellations.  In fact not even against going to a biweekly executive unless there is something pressing/urgent or some reason not to.    Generally going to trust the discretion of GovAlpha here regarding executives. Honestly unless there is some issue to be dealt with here someone raises (like some example where a late notice to cancel an executive is an issue) my approach and attitude is to give CUs some flexibility how to handle their responsibilities via their given authority. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/KryptoKnight",
                    "index": "#5",
                    "likes": "1",
                    "time": "13/08/2021-16:11:54",
                    "content": "I’m in agreement with @PaperImperium. I see no issue as long as the guidelines for skipping an executive is laid out clearly. I’m also not against switching to a bi-weekly cadence if this becomes more common (in which case we would want some guidelines for what constitutes an urgent Executive that would need to occur on an interim week). I don’t have any strong feelings about the time of announcement, but I tend to lean toward a later in the week mainly because of the point you bring up regarding voter apathy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.607142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#6",
                    "likes": "1",
                    "time": "14/08/2021-14:59:21",
                    "content": "    PaperImperium:  I don’t have any opinions about when in the week you announce it, but I would like to see some non-discretionary methodology for when an executive is skipped.   I don’t think that’s doable, as part of our mandate as Governance Facilitators is to be the final check on what goes to the Voting Portal. Plus, there are a variety of reasons outside of our control why we may not proceed with an executive. For instance, if PE finds a critical error in a planned executive we would skip it. Likewise, if someone in the community raised valid concerns over something we would want to hold off until we could get them addressed. This is the main reason I wanted to ask for feedback here, as the decision will always have a discretionary element to it. Since that can’t be changed, the best we can do is communicate openly and transparently about our decisions. We obviously wouldn’t communicate an issue until it is safe to do so to the community (thinking of a bug being discovered here), but as mentioned in this post we have some reasons for delaying communications even when protocol safety isn’t at risk. To me, that means we must ask for feedback and keep community response in mind for all future decisions. My job as a Governance Facilitator is to be a good steward of Community Governance and I am very aware it is a privilege to be in this position. The community always has the right to take my powers away from me and in most situations that process can be avoided through effective communications IMO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.456207482993197
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "28/08/2021-14:59:57",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "3963"
}