{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-blog-actualizacion-y-discusion-traduccion/16892",
            "title": "MakerDAO Blog Actualizaci\\xc3\\xb3n y Discusi\\xc3\\xb3n [Traducci\\xc3\\xb3n] ",
            "index": 16892,
            "category": [
                "Latin America"
            ],
            "tags": [
                "discussion",
                "informal-poll",
                "espa\\xc3\\xb1ol",
                "translate",
                "blog",
                "com-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/brigith238",
                    "index": "#1",
                    "likes": "8",
                    "time": "28/07/2022-20:26:13",
                    "content": "  La Situación El Makerdao.com blog es un recurso no utilizado que puede ser un activo valioso si se maneja apropiadamente. Los beneficios incluyen pero no están limitados a;  Acceso a una audiencia externa establecida. Mejor control sobre la narrativa de Maker. Acceso a una plataforma donde podemos reforzar la marca Maker. Libera el camino para la inclusión en un embudo de marketing más grande. Incrementa la exposición general. Mejora los lazos con la comunidad extendida de personas interesadas. Nuevo canal para  Lanzamientos de Productos Noticias de Productos Reportes Financieros Mensuales Reportes Financieros Anuales Piezas de pensamiento únicas Lanzamientos de Prensa     GovComms planea presentar una MIP60 - Intangible Asset Agreement Modification of Management proposal para intervenir como gestor de contenidos del blog. Sin embargo, con el fracaso de SP63, impidiendo la contratación de un especialista en relaciones públicas, y nuestro rediseño del mandato en curso, que se aleja de las comunicaciones enfocadas externamente, ya no somos la mejor opción para el manejo del blog. No creemos que lo mejor para la DAO sea dejar el blog sin usar. Estamos dispuestos a compartir nuestro borrador de MIP con cualquier persona interesada en desempeñar el cargo. Estamos trayendo esto a la atención de la comunidad porque este asunto no puede progresar. Las opciones, tal como las vemos, son:   Dejar el blog sin usar. El status quo continúa hasta que las estrellas se alinean.   Incorporar una CU de marketing que eventualmente administrará el blog. Conceptualmente, esta es la mejor opción. La advertencia es la cantidad de tiempo que tomará para que un equipo de este tipo se forme.; Mínimo, seis meses, máximo, ilimitado.   Persuadir a Growth o Brand para que asuma esta responsabilidad. May require the adjustment of mandate or budget.Puede requerir el ajuste de mandato o presupuesto.   Persuadir a GovComms para que asuma esta responsabilidad. Puede requerir el ajuste de mandato o presupuesto.     ¿Qué curso crees que es apropiado para el blog?   Dejar el blog sin usar Incorporar una CU de marketing que eventualmente administrará el blog Persuadir a Growth o Brand para que asuma esta responsabilidad Persuadir a GovComms para que asuma esta responsabilidad Abstención    Nuestro Punto de Vista Creemos que la acción correcta es esperar a un equipo de marketing adecuado. La ejecución del blog debería requerir una supervisión profesional de relaciones públicas, para lo cual la DAO actualmente no tiene capacidad. Los equipos que actualmente se acercan más son Growth CU y la CU en incubación Brand. Sin embargo, la responsabilidad parece fuera del alcance de ambos en sus formas actuales. Si te gustaría participar en esta encuesta puedes votar aquí  Está es una traducción libre del topic MakerDAO Blog Update & Discussion de @Artem_Gordon Créditos: Traducción @Brigith238 - Revisión @Gonzalo_Napolitano ",
                    "links": [
                        "https://forum.makerdao.com/t/makerdao-com-performance-overview/15168",
                        "https://mips.makerdao.com/mips/details/MIP60",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP63",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-june-2022/16529",
                        "https://forum.makerdao.com/t/makerdao-blog-update-discussion/16829",
                        "https://forum.makerdao.com/t/makerdao-blog-update-discussion/16829"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#2",
                    "likes": "3",
                    "time": "29/07/2022-05:17:18",
                    "content": "Gracias @brigith238  por la traducción y @Gonzalo_Napolitano  por la revisión. La parte más importante que hace que un blog tenga éxito es la regularidad.  Las publicaciones de blog regulares generarán nuevo tráfico, harán que se encuentre en línea y obtengan más lectores.  Pero la regularidad viene con el interés.  Entonces, deberíamos comenzar por encontrar a alguien interesado en pasar algunas horas a la semana escribiendo publicaciones.  Luego, si gana tracción, podemos escalar e invertir en él. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "0",
                    "time": "29/07/2022-12:57:49",
                    "content": "Tu respuesta está muy buena, recuerda también postearla en el de inglés un comentario así no debe pasar bajo la mesa. Además recuerda votar panita. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/07/2022-13:05:03",
                    "content": "Ya publiqué esta respuesta en una publicación en inglés también. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#5",
                    "likes": "3",
                    "time": "29/07/2022-16:14:30",
                    "content": "Hay una división bastante notable entre hacer el blog o no hacer el blog, ya que las propuestas que dieron en la encuesta fue o delegar la tarea a alguna CU o no realizar el blog. Yo me abstuve, un blog lleva mucho trabajo como para añadirle más trabajo a esos departamentos, la única forma es como la que tú dices que lo apoyo completamente, pero en los comentarios me percate que quieren realizar un contrato de trabajo que es válido, pero no será lo mismo contratar a una persona que deba hacerlo por obligación a beneficiar a una persona porque lo hace con pasión. Además, las lecturas pasionales se denotan mucho, y cuando alguien escribe por obligación es igual de evidente, así que, se debería buscar administradores de blogs que les encante la criptografía, historia, finanzas, redes sociales, dao y por supuesto Maker, hasta no encontrar a un escritor con esas características no se debería realizar el blog, ya que los contratos de trabajadores pueden vencer y no cumplir los objetivos. Entonces sería, presupuesto y tiempo perdido. La única forma que veo viable es un contrato de plazo fijo con expectativas obligatorias a cumplir en cierto periodo de tiempo, si el contratado no consigue esas expectativas no se realiza vence su contrato o no se realiza la paga completa, pero como dije arriba esto hará que un contratado trabaje por obligación y no por pasión. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#6",
                    "likes": "0",
                    "time": "30/07/2022-05:02:17",
                    "content": "Si esta es la situación, también me gusta la idea de hacer un contrato a plazo fijo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}