{
    "poll_list": [
        {
            "title": "Ratification Poll for Offboarding the Events Core Unit - EVENTS-001 (MIP39c3-SP4) - October 10, 2022",
            "index": "17755",
            "option": "Yes",
            "supporting_mkr": "81,264",
            "highest_fraction": 0.69
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip39c3-sp4-offboarding-the-events-core-unit-events-001/17755",
            "title": "MIP39c3-SP4: Offboarding the Events Core Unit (EVENTS-001) ",
            "index": 17755,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "cu-offboarding",
                "impact-:-high",
                "events-001",
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "0",
                    "time": "07/09/2022-13:57:10",
                    "content": " MIP39c3-SP4: Offboarding the Events Core Unit (EVENTS-001)  Preamble MIP39c3-SP#: 4 Author(s): @rune Contributors: @juan, @retro Tags: core-unit, EVENTS-001, cu-offboarding Status: Accepted Date Applied: 2022-09-07 Date Ratified: 2022-10-24 Forum URL: https://forum.makerdao.com/t/mip39c3-sp4-offboarding-the-events-core-unit-events-001/17755 Ratification Poll URL: https://vote.makerdao.com/polling/QmbP2XdV   Sentence Summary This subproposal offboards the Events Core Unit (EVENTS-001), removing all associated activities of the Core Unit from the DAO.  Specification  Core Unit ID EVENTS-001  Motivation MakerDAO is restructuring the work and the workforce across the DAO according to the Endgame Plan. The mandate for this Core Unit does not support a standalone core unit and will be better aligned within a cluster of a MetaDAO. As a result, this core unit must be offboarded to support the transition.  Core Unit Work Continuity All activities associated with EVENTS-001 will stop upon the ratification of this subproposal. MakerDAO will commit to pay for the following expenses of EVENTS-001 to unwind the Core Unit and deliver on their work obligations (DevCON Daivinity):     Item DAI Comment     Tax Payout $37,910 Sales tax on fait used by CU’s corporate account   Accounting $10,000 Tax audit & general accounting   Legal $10,000 ~20 hours legal resources for audit & corporate wind down   Rent $8,340 Non-breakable lease for industrial workshop to build Daivinity materials   Motion Designers $16,667 Final payment to Motion Designer, non-cancellation clause due to reserving future time   Contractors $4,000 Payout to contractors booked for future planned events   FTE $88,332 DAI This is the 4 month golden parachute referenced below   AccountAble $7,435 Fee to convert above to Fiat   Total: $182,684      Funds in the Core Unit Multi-sig wallet will be used, and if an additional top-up is required, it will be provided through an Executive Vote.  Mandated Actor Status The facilitator will have their Mandated Actor status removed.  Golden Parachute  DAI A Golden Parachute payout will be provided to the Core Unit for the facilitator to distribute to their team. The amount will be based on the following calculations: Core Unit's Monthly Contributor Budget x 4 = Golden Parachute amount 22,083 DAI x 4 months = 88,332 DAI  MKR This Core Unit does not have an active MKR MIP40. No MKR is in scope.  Budget Implementation Upon ratification of this proposal:  All DAI DssVest streams will be terminated. Any amount of DAI over the unwinding expenses amount in the Core Unit’s Multi-sig wallet will be returned to the protocol using DssBlow by the date of the following Executive Vote, or Governance will withdraw the funds in the Executive Vote using the MCD_Pause_Proxy beneficiary role on the multi-sig. If the unwinding expenses amounts is above the current balance in the Core Unit’s wallet, the following Executive Vote will distribute the difference to the Core Unit.  ",
                    "links": [
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/17",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191/30",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/106",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/21",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/73",
                        "https://forum.makerdao.com/t/relay-semanal-7-de-octubre-13-de-octubre-del-2022/18456",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/21",
                        "https://forum.makerdao.com/t/weekly-mips-update-109/18404",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/12",
                        "https://forum.makerdao.com/t/relay-semanal-14-20-de-octubre-2022/18516",
                        "https://forum.makerdao.com/t/weekly-mips-update-108/18310",
                        "https://forum.makerdao.com/t/weekly-mips-update-107/18199",
                        "https://forum.makerdao.com/t/weekly-mip-update-106/18103",
                        "https://forum.makerdao.com/t/weekly-mips-update-105/17999",
                        "https://forum.makerdao.com/t/weekly-mips-update-104/17861",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/20",
                        "https://forum.makerdao.com/t/weekly-mips-update-110/18493",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/28"
                    ],
                    "GPT-summary": "This post is a proposal to offboard the Events Core Unit (EVENTS-001) from MakerDAO, as part of the DAO's restructuring plan. The proposal outlines the motivation for the offboarding, the expenses associated with it, and the implementation plan. The post does not contain any advertising or collaboration requests, but it does provide an opportunity for 3rd parties to audit and review the proposal and provide feedback, either positive or constructive criticism.",
                    "GPT-proposal-categories": [
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.361689814814815
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sebix",
                    "index": "#2",
                    "likes": "0",
                    "time": "07/09/2022-17:30:24",
                    "content": " MIP39c3-SP4: Offboarding the Events Core Unit (EVENTS-001) This a summary of this subproposal, from GovAlpha’s perspective:  This subproposal aims to offboard the Events Core Unit (EVENTS-001) as part of the Endgame plan. Upon ratification, all DAI DssVest streams will be terminated and the Facilitator will lose the mandated actor status. A total of 182,686 DAI for the unwinding work, plus a Golden Parachute of 66,250 DAI will be granted. If the amount of DAI in the Core Unit’s multisig wallet exceeds the Golden Parachute amount + the unwinding provision (248,876 DAI total), it must be returned using DssBlow or will be withdrawn via the MCD_Pause_Proxy. If the amount of DAI in the Core Unit’s multisig wallet is lower than the Golden Parachute amount + the unwinding provision (248,876 DAI total), the following Executive Vote will distribute the difference to the Core Unit. This proposal has been assigned High-Impact based on the methodology listed here.  Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. Updated 2022-09-24 ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-107/18199",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/17",
                        "https://forum.makerdao.com/t/endgame-rfc-dvc-calls/17773/7"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#3",
                    "likes": "1",
                    "time": "13/09/2022-00:51:55",
                    "content": " RFC-DVC feedback  Does the EVENTS-001 Failed Offboarding carry any weight? Like, governance just said no to offboarding events; what’s the point if it’s up for a vote again? Should offboarding, in general, be bundled?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 3.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#4",
                    "likes": "0",
                    "time": "19/09/2022-15:25:36",
                    "content": "Hello, can i get alittle history behind how this CU was formed? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leggevents",
                    "index": "#5",
                    "likes": "0",
                    "time": "19/09/2022-15:45:50",
                    "content": "Right here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#6",
                    "likes": "2",
                    "time": "20/09/2022-06:40:34",
                    "content": "wow… 3 months golden parachute for a division only incorporated in MARCH 2022? is this a charity? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#7",
                    "likes": "0",
                    "time": "22/09/2022-15:01:38",
                    "content": "Reminder that this proposal will enter its Frozen Period on Wednesday, September 28 at 23:59 UTC. Substantive modifications beyond that date will render the proposal ineligible for the upcoming Governance Cycle / reset its Frozen Period, as the case may be. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#8",
                    "likes": "1",
                    "time": "25/09/2022-20:45:28",
                    "content": "Updated to indicate that the unwinding expenses cover the golden parachute (so we don’t pay a golden parachute twice), and have properly edited the amount to be 3 months worth of income, which is the same offered in the two other core unit offboarding MIPs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.645833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#9",
                    "likes": "0",
                    "time": "26/09/2022-05:54:44",
                    "content": "i suggest the severance to be prorated. Industry standard = 3month X (length of tenure for the year). the amount is far too high for a division not even lasting 6 mths ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.324999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leggevents",
                    "index": "#10",
                    "likes": "1",
                    "time": "26/09/2022-12:04:53",
                    "content": "I’d suggest the DAO give all newly on boarded CU’s at least a year commitment unless mandate is not being executed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.590909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#11",
                    "likes": "3",
                    "time": "30/09/2022-00:17:33",
                    "content": "Had to make a clarification edit here. The proposal was updated before the frozen period to add a month of golden parachute/offboarding time to the proposal. However, though the line item was updated, the total in that table was not. Thanks to @PonJerry for pointing this out. I’m submitting an update to the MIPs repo as well @MIP-Editors . ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#12",
                    "likes": "2",
                    "time": "05/10/2022-09:22:38",
                    "content": "I am formally submitting this subproposal (MIP39c3-SP4) for the October governance cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "03/01/2023-09:23:10",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1709"
}