{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/collateral-management-feature-to-help-the-peg-issue/4307",
            "title": "Collateral management feature to help the peg issue ",
            "index": 4307,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "alignment",
                "idea",
                "rates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Gaoez01",
                    "index": "#1",
                    "likes": "4",
                    "time": "21/09/2020-21:55:54",
                    "content": "Hey folks, I am new to the forum and wanted to share an idea I have. Hopefully this is not a duplicate topic, although it is similar to many ideas. Background and observations:  Long term demand for volatility free tokens continue to increase in the current “yield farming” craze and general crypto growth There are challenges maintaining the peg due to this demand, and DAI has been above the USD$1.00 value for a long time now; many interesting ideas have been proposed to address this One of these ideas is negative interest rates to address that there are currently no incentives to lock up collateral and create DAI beyond taking a leveraged position (which can also be obtained through certain DeFi protocols such as Aave), and not without risks such as liquidation and costs such as the stability fee Another idea is to ramp up collateral onboarding, which does nothing to address the previous issue. Also this is in context of current collateralization at 185% (and often exceeding 200% if I am not mistaken)  Idea:  A collateral management feature that allows the Maker protocol to manage the unused collateral to issue DAI  How does this work: Step 1. Vault owners deposit collateral and may choose to borrow DAI or not Step 2. The vault holders have the option of opting into the new “collateral management feature” which allows the Maker protocol to manage the remaining (and changing) collateral value in excess of the liquidation ratio This unlocks some benefits for both MakerDAO and vault owners. Firstly, MakerDAO benefits with flexibility to mint DAI (as much as 33% more collateral backed tokens, at 200% system collateralization and 150% liquidation ratio) as required to exert pressure toward the peg. This pressure could be exerted either in the form of arbitrage, or simply just loans to borrowers (through lending platforms). Secondly (and IMO more importantly), this will generate a yield which can be returned to the vault owners (minus the stability fee), acting as an incentive to provide collateral. This alone may not solve the peg issue, but I think it would address at least some of the causes of the issue to some degree. ",
                    "links": [],
                    "GPT-summary": "The author proposes a collateral management feature to help maintain the peg of DAI to USD. The feature would allow the Maker protocol to manage unused collateral to issue DAI, which would benefit both MakerDAO and vault owners. The proposal is explained in detail, and the author suggests that it could address some of the causes of the peg issue. A 3rd party could give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.515378438765536
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#2",
                    "likes": "0",
                    "time": "22/09/2020-02:04:55",
                    "content": "The result this aims for is interesting, and sounds a lot like the yearn yETH vault. But the technical aspects of having the Maker protocol manage excess collateral in this fashion sounds technically challenging and less efficient than something like the yETH vault with a similar strategy (such as borrowing Dai and lending it out at a profit). I suspect something like this would be better done externally to the Maker protocol (by Maker or someone else). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaoez01",
                    "index": "#3",
                    "likes": "0",
                    "time": "22/09/2020-05:09:24",
                    "content": "Yes it is similar to a part of the proposed Yearn Finance protocol, and it definitely could be implemented by them instead. However, the risk then would be that many individual vault owners would move their assets from Maker to Yearn and similar protocols, and eventually the majority of vault assets would be held by very few owners (ie these protocols that are specialized in managing/maintaining vaults close to the liquidation ratio in order to maximize yield). This would not be good for MakerDAO or crypto in general. IMO the only way MakerDAO can continue to attract vault collateral [edit: from individual vault owners rather than protocols like yearn] is to enable efficient asset management for the lay user. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.495
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#4",
                    "likes": "0",
                    "time": "23/09/2020-02:30:46",
                    "content": "I like out of the box thinking, assuming the vault owner keeps the liquidation risk the best thing imo would be a collaboration between yearn & maker to see what are the possibilities that can be explored for the excess capital. The issue I see is that an individual can have that separately, if he/she wants to do that they can use yearn, the benefit for the user must come from convenience of the product and I’m not entirely sure that it’s going to be so convenient for them to leave money on the table for maker to collect. The only middle ground I can see is to use the profits that correspond to vault owners to cancel debt or increase the collateral. That way a user can get a loan with a sufficiently high CR that may eventually be paid out (or partially) while explicitly keeping liquidation risk on the hands of the vault owners ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party suggesting collaboration on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.63125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaoez01",
                    "index": "#5",
                    "likes": "1",
                    "time": "23/09/2020-04:15:43",
                    "content": "Yes I agree, that is what I suggested in the last part of my post:     Gaoez01:  this will generate a yield which can be returned to the vault owners (minus the stability fee), acting as an incentive to provide collateral.   You mentioned a collaboration between Yearn and Maker, however would it not be best for Maker system to have many vaults with individual vault owners, rather than a single vault with a protocol like Yearn? I think it would be better to not have all our eggs in one basket, so to speak. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.142857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "23/12/2020-10:15:45",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}