{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/intentional-organization-what-can-we-do-to-communicate-better-in-the-dao/7588",
            "title": "Intentional Organization: What can we do to communicate better in the DAO? ",
            "index": 7588,
            "category": [
                "Governance"
            ],
            "tags": [
                "discussion"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#1",
                    "likes": "11",
                    "time": "21/04/2021-15:17:25",
                    "content": "Sometimes, things get heated both in the Forum (example) and on calls. This isn’t a new issue and I see no value in calling out particular individuals; we’re currently navigating an important transition and it’s helpful to have critical eyes on the proposals that will shape the future of the DAO. It’s also important to be conscious of how our communications encourage or discourage different types of participation. The better we communicate in our organization, the more we can accomplish in support of Dai and the Maker Protocol. I’m not interested in a discussion about “tone policing” or anything like that; what I do think would be valuable is a discussion around how we can encourage more constructive communication, on and offline.  What’s the problem? Information is valuable and while we do want contributors who bring expertise and the strong opinions that come with that, we also don’t want to discourage people from participating just because they’re less comfortable dealing with criticism than others. This is an admittedly fine balance to walk and I don’t expect us to fully solve the problem; every organization deals with conflict resolution at some point or another but this is also about establishing the organizational culture of MakerDAO as we pivot to the Core Unit model. We don’t want to replicate the culture of certain prominent financial institutions and we don’t want a bunch of pushovers saying “yes” all the time, either. In any case, it’s worth being sensitive to the way our communications encourage or discourage others from participating.  What are some solutions? Two things I’ve observed are that:   For some people, giving feedback is their primary outlet for interacting with governance. That may be their choice and that’s fine but it can also box people in - if the only way someone interacts with the group is through criticism, it becomes easy to see them as just another voice in a sea of critics.   Between our jargon and the number of communications channels we have, getting involved in the community can be difficult, and offering criticism may be one of the easier ways for people to get a response.   I do think a comms map will help with this and believe a handful of proposed Core Units are eager to work on making it easier for people to figure out where to go for different kinds of communication. CommDev has also started working on a Glossary to help with the jargon issue. Maybe more “water cooler” events or opportunities for these community members to share their opinions and expertise would help ease some tension? I think “carrots” are more effective than “sticks” and generally like the idea that we should try to “praise specifically; criticize generally.” The idea of drafting Community Guidelines has come up in several places and things like the “Triple Filter Test” or the Socratic Method may provide helpful starting points and it’s worth considering how these might be implemented as well. What if, for example, the only responses allowed to forum posts in the first week of the (month-long) RFC (request for comment) phase were those put in the form of a question?  Next Steps Communication is a skill like any other; something we can constantly improve on. Is anyone aware of models for sharing feedback that might be useful to the community or does anybody have ideas about how we can communicate better? ",
                    "links": [
                        "https://www.vanityfair.com/news/2021/04/goldman-sachs-former-interns-abuse-suit-moves-forward",
                        "https://community-development.makerdao.com/en/learn/Glossary/",
                        "https://www.thrivetosuccess.com/triple-filter-test-useful-giving-receiving-feedback-mastering-emotions/",
                        "https://rationalwiki.org/wiki/Socrates#The_Socratic_method",
                        "https://forum.makerdao.com/t/maker-relay-ep-42/7673",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-april-16-22-2021/7613",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-138-thursday-april-22-17-00-utc/7515/2",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-april-25th-2021/7744"
                    ],
                    "GPT-summary": "The author of the post is asking for feedback on how to encourage more constructive communication within the organization. They suggest that some people may feel boxed in if the only way they interact with the group is through criticism, and that a comms map and glossary could help with this. They also propose the idea of drafting community guidelines and implementing communication techniques such as the Socratic Method. The author is seeking feedback and ideas from the community on how to improve communication.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 6.022294372294372
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#2",
                    "likes": "1",
                    "time": "21/04/2021-17:42:11",
                    "content": "As a philosophy student, I am all for communicating via dialectic. But many people will not be so comfortable. You do have a point in that it is hard to engage when it feels that tempers are running high and the substance of the issue is not being addressed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.960416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#3",
                    "likes": "1",
                    "time": "22/04/2021-11:40:13",
                    "content": "Agreed that we have a fine line to walk. We need both frank disagreement and civility to be the norm. Ensuring civility is I think easy as long as moderators are not afraid to act. I’m not sure what mechanisms we have to avoid groupthink but I hope that everyone’s self-interest will be enough. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "22/07/2021-17:40:30",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}