{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-aave-d3m-target-borrow-rate/9142",
            "title": "[Signal Request] Aave D3M Target Borrow Rate ",
            "index": 9142,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "meta-governance",
                "rates",
                "aave",
                "sig-status-accepted",
                "d3m"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "9",
                    "time": "03/07/2021-16:56:21",
                    "content": "In preparation for the launch of the Aave Direct Deposit Dai Module (D3M), I want to run a signal request to see how the community wants to set the rates relative to Maker’s own rates. Since Maker has variable SFs it makes sense for the community to provide general guidance to the Maker Open Market Committee rather than pick a particular number. I see three options and we will compare against ETH-A as it is our flagship offering:  Match the ETH-A rate. This means we will target a variable borrow rate on Aave to be equal to the ETH-A stability fee. Aim for slightly above the ETH-A rate. This would be something like a 1-2% spread on the rates between Aave and Maker. Aim for a large spread. This would be something like 3-6% spread on the rates between Aave and Maker.  I will take a go at pros/cons of each choice:  Option 1 - 0% Spread  Pros  Maximize the amount of DAI generated by the module. DAI becomes a very attractive stablecoin to borrow against on Aave compared with USDC.   Cons  People may choose to borrow from Aave instead of Maker which loses us revenue overall (part of their fees go to AAVE holders) Revenue earned will be lower per unit of DAI minted as we are giving them a lower rate.   Option 2 - 1-2% Spread  Pros  Middle-ground approach retains Maker as the primary market to borrow from while still giving fairly strong guarantees at Aave (which helps with borrowers choosing DAI to borrow against instead of USDC).   Cons  Even a 1-2% spread may not be low enough to get any serious supply generated especially during a bear market.   Option 3 - 3-6% Spread  Pros  Maker retains status as the best place to borrow against by far. Module is only activated during excessive demand for borrowing which gives us a high return Having even a high upper bound may be enough to convince users to choose DAI instead of USDC for fear of excessive rates (15%+ surges).   Cons  Periods of excessive borrowing may be few and far between - diminishing the value of this module.   AAVE Rewards The D3M targets the borrow rate on Aave ignoring the AAVE token farming rewards. There is an additional question of whether we should be factoring in the rewards to determining the spread. For example, borrowing DAI backed by ETH currently has a borrow rate of around 3.5% if you ignore rewards, but if you factor the rewards in the rate is more like 1.5%. What this means in practise is if we were to factor in the rewards (approximately) then we would run the D3M at a target rate of 4% in the 0% spread scenario with current market conditions. This is calculated by taking the 2% SF for ETH-A and adding 2% which Aave produces in rewards.  Some General Thoughts I’ve been changing my thinking on how to view the D3M over the past few weeks. At first options 2 and 3 seemed like the obvious choice. Why would we want to give Aave a competitive advantage over Maker in terms of rates? But this space is not like traditional finance. Aave the brand doesn’t really own the smart contracts. You could make the argument that Aave governance owns the contracts, but over time Maker should become a larger voting share of that governance process because we will be earning rewards like everyone else. Smart contracts by their nature are just neutral pieces of code. Whether we mint DAI from Maker or Aave it shouldn’t really matter all that much all else being equal. There are trade offs in terms of revenue, but we also get a lot of benefit by giving them a cut of the SFs. We get access to a team that has shown that they are capable of moving quickly and promoting themselves effectively. We also are paying for insurance that stkAAVE holders provide. This is not me advocating for running the spread at 0%, but I think it’s something to keep in mind.    How should the MOMC target the spread?  0% Spread Small Spread (~1-2%) Large Spread (~3-6%) Abstain     0 voters        Should we factor the rewards into the rates calculus?  Yes, take the rewards into account No, only take the vanilla rates into account Abstain     0 voters     This poll will run until Thursday July 15th, 2021 after which any options which garner >= 50% of the vote will move to an on-chain poll. If all three options for the spread are over 50% then a ranked choice poll will be used. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-53/9305",
                        "https://forum.makerdao.com/t/proposal-to-increase-the-d3m-dc-from-50m-to-100m/11737/4",
                        "https://forum.makerdao.com/t/maker-relay-ep-52-en-espanol/9209",
                        "https://forum.makerdao.com/t/maker-relay-ep-52/9191",
                        "https://forum.makerdao.com/t/forum-at-a-glance-july-2-8/9251",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355/38",
                        "https://forum.makerdao.com/t/maker-relay-ep-53-en-espanol/9330"
                    ],
                    "GPT-summary": "The author is seeking feedback from the community on how to set the rates for the Aave Direct Deposit Dai Module (D3M) relative to Maker's own rates. The post outlines three options and their pros and cons, and includes a poll for the community to vote on. The author also raises the question of whether to factor in AAVE token farming rewards when determining the spread. The post invites feedback and collaboration from the community and indicates that the poll results will inform an on-chain poll.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.438831168831168
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "5",
                    "time": "03/07/2021-17:08:04",
                    "content": "I am aiming for volume with regards to the D3M - the more the better. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "2",
                    "time": "03/07/2021-17:14:53",
                    "content": "I think we should just treat the Aave rewards as windfall. Just liquidate whatever we get and call it a day. If that’s significant, great. If it’s not, no problem. This is a money supply tool and we shouldn’t let something like token rewards alter our opinion about the ideal rate. Let me think more about the spread questions, but for now I basically just voted that there be a spread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.21875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "7",
                    "time": "03/07/2021-17:15:50",
                    "content": "By having a 0% spread, Aave is strictly a better place to borrow. Rates can go lower than Maker but not higher. And for the same amount of borrowings, we would get fewer fees (we get paid the lending rate, not the borrowing rate). If this reasoning is correct, I don’t see how it can be chosen except if we think Aave system is safer than Liquidation 2.0. Now I see MIP50 can handle the rewards, but still complex to take into account. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#5",
                    "likes": "0",
                    "time": "03/07/2021-17:17:20",
                    "content": "This is a good point @SebVentures . Yes this is a maximum borrow, so Aave could in theory have strictly better rates with a 0% spread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#6",
                    "likes": "0",
                    "time": "03/07/2021-18:43:01",
                    "content": "It will be limited by the DC tho. I think we should consider going at 0% spread and without reward. I do believe aave will stop the reward if we can provide enough supply. Also we can change it after if that affect us too much. I think it is a good PR thing to do. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.035714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#7",
                    "likes": "0",
                    "time": "03/07/2021-18:44:34",
                    "content": "Wait we can’t unwind? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#8",
                    "likes": "1",
                    "time": "03/07/2021-19:07:10",
                    "content": "Not below 0  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#9",
                    "likes": "0",
                    "time": "03/07/2021-19:44:55",
                    "content": "The DC will limit it. Let’s say we have 100M DC. It won’t draw more than 100M from ETH-A. But that means we will have a spreaded risk with 100M from another collateral. To be honest we could go for 0% rate and fill up the vault to the DC. I believe the fee returned is not affected by the rate we setup. Taking into account that the initial DC is going to be low. Note:     SebVentures:  I don’t see how it can be chosen except if we think Aave system is safer than Liquidation 2.0.   It is actually less risky, because aave is riskier for the borrower. ( 1h OSM, selling drop) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.933333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#10",
                    "likes": "1",
                    "time": "03/07/2021-20:01:41",
                    "content": "    alexis:      SebVentures:  I don’t see how it can be chosen except if we think Aave system is safer than Liquidation 2.0.   It is actually less risky, because aave is riskier for the borrower.   AAVE also has the safety module as a backstop. (AAVE/ETH stakers) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#11",
                    "likes": "3",
                    "time": "03/07/2021-20:05:54",
                    "content": "    SebVentures:  By having a 0% spread, Aave is strictly a better place to borrow. Rates can go lower than Maker but not higher. And for the same amount of borrowings, we would get fewer fees (we get paid the lending rate, not the borrowing rate).   I wouldn’t say strictly better. Borrowers on MakerDAO have the benefit of the OSM delay. It’s also not a strict competition. We’re also making it more attractive to borrow DAI vs USDC/USDT on AAVE. AAVE also has some collateral that Maker doesn’t support. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#12",
                    "likes": "8",
                    "time": "04/07/2021-14:09:49",
                    "content": "We are still working on D3M risk assessment but I can share few insights because they are relevant to this topic. Because Aave v2 DAI borrow rates are based on specific formula where rates are pretty much flat between 0% and 80% utilization (0% to 4% borrow rate range) and start increasing very fast after 80% utilization, any Target Borrow Rate below 4% of D3M could likely cause very high exposures of D3M to Aave. Of course the debt ceiling of D3M will protect against this, but then the Target Borrow rate won’t be maintained. Here is a snapshot of how much debt exposure would D3M have historically at different Borrow Target Rates (simulated range from 3% to 6%).  Screenshot 2021-07-04 at 15.37.111956×1212 213 KB   Screenshot 2021-07-04 at 15.45.061960×1216 331 KB  For instance if 3% target borrow rate was picked today, D3M would need to mint 322m DAI to Aave to reduce current borrow rate of 3.6% to 3.0%. Share of DAI deposits of D3M at Aave could reach between 20% and 30%, which is a high number considering liquidity/bank run risks of these platforms. If for instance D3M debt ceiling was lower 100m, rate would drop by only 0.2% to 3.4%. TL:DR What I want to say is that any target rate below 4% will be hard to maintain unless community really wants to risk of having high exposure to Aave in hundreds of millions. More on credit risk and other risks will be addressed in our upcoming evaluation. Personally I think it is better to “cap” the rate at 4% or higher if the aim is to signal to Aave borrowers that DAI is preferred market to borrow versus other stables. Otherwise the module won’t be effectively capping it below 4% if it has debt ceiling limits. Also note that these dynamics are very much dependent on liquidity mining. Rate has been stable and at around 3.5% range because DAI market is in large majority represented by recursive leverage stablecoin farming where people build max leverage 75% LTV DAI positions. This is why the utilization is always around 75% which implies 3.5 - 4.0% borrow rates. As soon as liquidity farming ends, rates should spike, market size will drop by at least 5x and D3M becomes an efficient tool for fixing rates at lower exposures. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.595311355311355
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#13",
                    "likes": "0",
                    "time": "04/07/2021-14:25:22",
                    "content": "This is really helpful insight @Primoz . Do you think we should run an additional poll to set a lower bound of 4%? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#14",
                    "likes": "3",
                    "time": "04/07/2021-14:32:51",
                    "content": "Probably, but perhaps we don’t need a poll specifically for this. If this is meant as guidance for Maker Open Market Committee, this guidance can or should anyway come from Risk having members in the Committee? Because as I said, this could also change or become less of an issue as soon as liquidity farming is disabled. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.388888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#15",
                    "likes": "0",
                    "time": "04/07/2021-14:34:56",
                    "content": "    Primoz:  If this is meant as guidance for Maker Open Market Committee, this guidance can or should anyway come from Risk having members in the Committee?   I think it’s entirely appropriate for there to be a system-wide view of how any changes affect the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#16",
                    "likes": "1",
                    "time": "04/07/2021-14:45:57",
                    "content": "Yeah this seems to be more of a risk decision. I think the original poll involves more of a business/competitive decision which is why it made sense to run a signal request to me. If people feel strongly about allowing us to go below 4% they are free to run another signal request. I’ll leave this as-is for now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 7.208333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#17",
                    "likes": "1",
                    "time": "05/07/2021-22:56:09",
                    "content": "Opted out of 0% Spread. Assuming we get 35 trusted Community Members to vote ASAP–Can we end this poll by Thursday, July 8th as well? @LongForWisdom In desperate need to get things going here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 2.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#18",
                    "likes": "3",
                    "time": "05/07/2021-23:08:17",
                    "content": "It’s up to @LongForWisdom if he thinks that’s enough time. Btw this module is not overly useful with rates so low, so there isn’t a strong rush to get this out. Farming adapters and conditional vaults will arrive sooner and have a much larger effect on DAI supply. Edit: didn’t mean to put LFW on the spot. I don’t think we need to rush this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.350694444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#19",
                    "likes": "1",
                    "time": "06/07/2021-00:41:07",
                    "content": "I’m not sure about the framework and I’m wondering how free governance will be to change the parameters. The poll is on a) a target rate b) based on a spread relative to eth-a borrowing. Why not target an absolute exposure level relative to the DAI pool on Aave? Or a utilization ratio (quite different since the rate curve is very flat)? Or if governance targets a rate, why not base it on a combination of risk/competitiveness factors? Also, once this starts the control exerted will have an effect beyond Maker’s enclosure which may make changes more controversial and thus reduce governance’s freedom in setting monetary policy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.88375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#20",
                    "likes": "3",
                    "time": "06/07/2021-08:55:37",
                    "content": "@flipflopflapdelegate @hexonaut I think the timeline on this is fine as it is. Only 30 votes so far, and as Sam said, I don’t think this is super urgent. (Fairly sure it isn’t the limiting factor on deploying the D3M.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.35
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#21",
                    "likes": "0",
                    "time": "06/07/2021-12:30:57",
                    "content": "    swakya:  I’m not sure about the framework and I’m wondering how free governance will be to change the parameters.   Governance is free to override any decision at any time.     swakya:  The poll is on a) a target rate b) based on a spread relative to eth-a borrowing. Why not target an absolute exposure level relative to the DAI pool on Aave? Or a utilization ratio (quite different since the rate curve is very flat)? Or if governance targets a rate, why not base it on a combination of risk/competitiveness factors?   The MOMC usually takes risk/competition into account for rate setting, so I’m guessing it will be the same for this. These polls are to provide guidance for how the MOMC should pick the values (and/or other PPGs if governance doesn’t like our recommendations).     swakya:  Also, once this starts the control exerted will have an effect beyond Maker’s enclosure which may make changes more controversial and thus reduce governance’s freedom in setting monetary policy.   Not quite sure what you mean by this. Could you elaborate? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.729411764705883
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#22",
                    "likes": "1",
                    "time": "06/07/2021-13:27:29",
                    "content": "Sure, I mean that Maker changes in monetary policy will directly impact Aave DAI borrowing rates (right now they have indirect, market impact). Aave handing Maker the keys to the DAI borrow rate also hands it the responsibility that come with it, and one should be mindful of how differently Aave rate changes ‘imposed by Maker’ could be perceived. To expand a little on target rate spread, what I find strange is that suppose you match 0% spread with ETH-A borrowing (taking into account the Aave ETH-A lending APY, lending rewards, and borrow rewards). Your net borrow rates for people who supplied something other than WETH to Aave will be downstream of that. And for collateral types that are also available at Maker, DAI borrowing may be cheaper and/or more expensive. I’m really not clear on why singling out ETH-A just because it is the ‘flagship offering’ makes sense. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.215659340659341
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#23",
                    "likes": "2",
                    "time": "06/07/2021-16:54:22",
                    "content": "This is a fair point. Maybe I could have worded the polling a bit better. This is not meant to be an overly prescriptive design of what to set the rates to. This was to provide a general feel of how the community wants the MOMC to set this. Maybe I shouldn’t have used actual numbers. It’s more like do we want to give them as good a deal as borrowing at Maker, slightly less of a good deal, or a large spread between borrowing rates. What form this translates to with the rates is a little subjective, and we will do our best at the MOMC to not be overly rigid with the polls here. Competitive rates, market conditions and risk will always factor into the MOMC’s decisions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.75421626984127
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#24",
                    "likes": "6",
                    "time": "15/07/2021-12:49:47",
                    "content": "I’ve closed the poll. It looks like having a small buffer and not taking rewards into account are the clear winners. Since there is nothing to poll against we can skip the on-chain vote. Risk has already proposed initial parameters here: D3M Risk Assessment and there will be an on-chain vote for those parameters. The MOMC will keep this poll in mind when determining rates in the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#25",
                    "likes": "0",
                    "time": "14/08/2021-22:50:01",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}