{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/asset-change-request-process/14956",
            "title": "Asset Change Request Process ",
            "index": 14956,
            "category": [
                "Core Units",
                "Dai Foundation"
            ],
            "tags": [
                "daif-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#1",
                    "likes": "5",
                    "time": "04/05/2022-10:11:30",
                    "content": "Dai Foundation protects MakerDAOs intangible assets, and aims to make them available to the Maker ecosystem with as little friction as possible. If you want to be a NEW Content Manager of an asset, then you must use the MIP60 process to do this. The process in this document is for Content managers of assets that already have been assigned. Once you have Content Manager access to an asset you may still need to interact with Dai Foundation regarding the asset configuration. Examples can be to change the IP target of a subdomain, create new or change rights for existing GitHub repository, having another admin added to a SoMe account etc. This document describes what to do in these situations to ensure that all change requests are logged in a single place, are acted upon in a timely manner, can be audited and the Dai Foundation Asset Registry is kept up to date.  Go to change.daifoundation.org  To request a change to an asset that you have Content Manager rights to go to https://change.daifoundation.org/ There you are presented with a form where you must fill in the following information. Email Specify your email such that Dai Foundation/TechOps (@techops-core-unit ) can get in touch with you, and if needed verify that you indeed have Content Manager rights to the asset you are requesting a change to Asset Group Select what type of asset are you requesting the change for   [ Web2 domain/subdomain, Web2 email domain, GitHub repository for publishing content, ENS domain/subdomain, or SoMe account ] Change request Describe the change that is requested providing as many details as possible and the reason for the change. And that is it - Click the Submit button to send the request.  Once the request is sent  When the request is received, it is sent to Dai Foundation for review (initially this is done for all requests - later we plan to implement rules such that certain requests can be acted upon without this step) The request is approved or rejected If approved, TechOps performs that change (TechOps may reach out to the requestor if any additional details are needed) Once the change is executed by TechOps (@techops-core-unit ), both the Dai Foundation members as well as the requestor are notified by TechOps  If you have any questions or comments to this process please reach out in the #dai-foundation-public channel on the MakerDAO Official Discord server. Note @Core-Facilitators - Currently all Content Managers are in Core Units - please make relevant team members aware of this process - Thanks ",
                    "links": [
                        "http://change.daifoundation.org",
                        "https://change.daifoundation.org/",
                        "https://discord.com/channels/893112320329396265",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-28-may-4-2022/14981",
                        "https://forum.makerdao.com/t/governance-and-risk-189-thursday-may-05-17-00-utc/14965/2",
                        "https://forum.makerdao.com/t/techops-core-unit-updates-april-2022/15213"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.549467893217893
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#2",
                    "likes": "0",
                    "time": "04/05/2022-10:32:49",
                    "content": "Huge improvement over the former process—great work  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#3",
                    "likes": "0",
                    "time": "04/05/2022-10:49:19",
                    "content": "Sorry to pour water on your fire, but this is only for “internal” requests for assets that remain with their current assignment like updating the target IP. For example. to transfer a subdomain from one CU to another you still need to use MIP60 (but it should be fairly quick to fill out a MIP60 anyway  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#4",
                    "likes": "1",
                    "time": "04/05/2022-10:51:47",
                    "content": "Gotcha, thanks for the clarification. Consider one out of two requests as unsent  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "0",
                    "time": "04/05/2022-17:14:42",
                    "content": "Maybe you want to add a link to this change form from https://daifoundation.org/assets ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#6",
                    "likes": "1",
                    "time": "08/05/2022-12:42:47",
                    "content": "Thanks for your suggestion. The Dai Foundation web site is aimed to share the most important high level information about the foundation to an as broad audience as possible. Meanwhile change.daifoundation.org is for “internal” changes for assets that already are assigned. To get new asset assignments the MIP60 process is to be used. Given this the currently the number of potential users are approximately 10 people I do think it may provide more confusion than help to list it on the Dai Foundation web site without additional context which then would defeat the original purpose of the site. As we produce more “operational” documentation we will think about what is the best way to publish to make it easy for our users to find the information they need ( it could for exmample be standing up a Notion server or dedicating a repo for documentation ) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2084990530303035
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "02/08/2022-10:12:05",
                    "content": "This topic was automatically closed after 90 days. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09090909090909
                }
            ]
        }
    ]
}