{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/strategic-direction-integration-with-defi-or-protocol-base-layer/5646",
            "title": "Strategic direction - integration with defi or protocol base layer? ",
            "index": 5646,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#1",
                    "likes": "9",
                    "time": "13/12/2020-09:56:31",
                    "content": "There have been multiple ideas and proposals around using other defi protocols to support Maker functions. On the top of my head I could mention replacing buy-and-burn with buy-and-make, proposal for a strategic fund, b protocol backstop, insurance of Maker through Nexus Mutual and using Uniswap as an active fund. I am sure there are others as well. Is this the way forward or is it an evolutionary dead end? It is a bit of an either/or question, making a strategic choice for the whole Maker ecosystem. Maker is either envisioned as an independent protocol or it is not. It is either dependent on other defi systems or it is not. There is just no middle ground on this. This is why it could be important for us as a community to discuss the pros and cons of the strategic direction of Maker - will we go the way of integrating with other defi projects or will we go the way towards replacing humans with code - gradually becoming a protocol for money. The most enthusiastic will off course answer ‘both please’, but that is just not how things work. Every single time we outsource a function or make use of outside projects for support we are at the same time anchoring human involvement in the active running of Maker. Why? Because active funds must have active managers. Insurance plans must have humans reviewing them. Relying on other defi projects for core functions such as liquidations requires very vigilant human oversight. While there might be benefits, all outsourcing of functions increases the administrative load on Maker governance in the form of brains, not code. There is simply no way to have your cake and eat it too on this subject. The integration with other defi projects could possibly be the way to go forward, but it is in direct opposition with the intention of Maker becoming the Linux of money. So what I am proposing is that we have a principled discussion on the direction of Maker. Right now I feel there is a vacuum with little or no leadership from the Foundation on this subject. This might be intentional or not but the net result is that community members could end up putting their hearts and minds into into proposals that hits a Wall of No once it is time to vote on them. This is wasteful use of creative energy and could create friction in the community. I prefer to hear your arguments and so decided against using a poll on this topic. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaration-of-intent-strategic-reserves-fund-srf/3765",
                        "https://forum.makerdao.com/t/discussion-wbtc-b-collateral-type-backed-by-b-protocol-with-x10-leverage/5409",
                        "https://forum.makerdao.com/t/mip13c3-sp8-maker-protocol-cover-with-nexus-mutual-declaration-of-intent/5056",
                        "https://forum.makerdao.com/t/mip31-active-reserve-via-amm/5639",
                        "https://blog.makerdao.com/how-linux-provides-a-roadmap-for-increased-adoption-of-blockchain-tech-and-the-maker-protocol/",
                        "https://forum.makerdao.com/t/maker-relay-ep-25-en-espanol/5680",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-dec-20th-2020/5760",
                        "https://forum.makerdao.com/t/maker-relay-ep-25/5671"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.358787593984963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#2",
                    "likes": "4",
                    "time": "13/12/2020-11:08:30",
                    "content": "For the dependencies of the core protocol (DAI credit system), I would argue that we need to avoid introducing any dependency. Whatever happen to a third party protocol, should not be an extinction event for Maker. Maker is in the business on creating money using credit. Credit is made against collateral. Therefore, collaterals will include a lot of dependencies. With the decision to go into RWA, it’s even bigger as we have a dependency on the real world regulation. What we should aim here is that no issue with a collateral dependency can trigger an extinction event for Maker. This is achieved through diversification and risk management. For layers on top of Maker, this should be encouraged. The more protocol have a dependency on Maker, the stronger we are. This creates increased usage of DAI which is our moat. But we also should encourage diversification. If we have one main client, this client has all the bargaining power (I discussed that a bit more here). My feeling is also that we are not a protocol like uniswap that can be automated. We are in the business of trust and, while having a flawless protocol is important, they key is to have sound managers which is the Maker Community & Governance. The PSM is 20 lines of code but 6 months of community debate. USDC has moved from being the devil on earth to be our main collateral with no reward to compensate the risk. “Money will not manage itself, and MakerDAO has a great deal of money to manage.” - Walter Bagehot, 1873 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.782051282051283
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#3",
                    "likes": "1",
                    "time": "13/12/2020-14:29:35",
                    "content": "Important post.     Planet_X:  There is just no middle ground on this.   Yes.     SebVentures:  For the dependencies of the core protocol (DAI credit system), I would argue that we need to avoid introducing any dependency. Whatever happen to a third party protocol, should not be an extinction event for Maker   Yes.     SebVentures:  With the decision to go into RWA, it’s even bigger as we have a dependency on the real world regulation   Yes. But, USDC/WBTC etc… are already dependent on US regulations, so… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "0",
                    "time": "13/12/2020-15:17:39",
                    "content": "You’re right. Maybe we should define the list of risks that are just unavoidable with our current strategy. US regulation is one. I think we already made the decision to be governed by US. Ethereum is the second one. Probably something that can be mitigated if we want to. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.476190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#5",
                    "likes": "7",
                    "time": "13/12/2020-18:28:23",
                    "content": "@Planet_X     Planet_X:  Maker is either envisioned as an independent protocol or it is not.   I feel that this is a false dichotomy. MakerDAO does not exist in a vacuum unto itself. It exists in the context of other DeFi protocols that can and do add value. To try and succeed in isolation is foolish since we need all the help we can get if we want to scale in an efficient and safe manner. We are already using Centrifuge and 6S Capital to on-board RWAs. Why not bring in more protocols like CrescoFin and leverage their infrastructure to enable a DAI-based yield curve.     Planet_X:  will we go the way of integrating with other defi projects or will we go the way towards replacing humans with code   Why not have artificial intelligence do the heavy lifting in terms of stress-testing and producing outputs. Then, have human beings act accordingly. For example, use Gauntlet Network to determine interest rates, leverage limits, possible emergency shutdown, etc., and have people vote to enact such measures. This would save so much time rather than being a DMV for every little decision like raising the debt ceiling. Let people do what they are good at (i.e. specialization) and let computers do what they are good at (i.e. drone work).     SebVentures:  The PSM is 20 lines of code but 6 months of community debate. USDC has moved from being the devil on earth to be our main collateral with no reward to compensate the risk.   If every meaningful decision is going to take 6 months of in-fighting to be able to come to a consensus and then begin to execute it, then MakerDAO is never going to scale. Some decisions should be put up to everyone, but many can be delegated to people who know better. Imagine if the Fed asked every single employee what they thought interest rates should be and actually went with the consensus after hearing all sides of the argument. Sometimes things break and you have to be nimble enough to quickly pivot. It would be unreasonable to think that every decision will be the perfect one since we don’t know what we don’t know. I think that we can partner with other protocols without necessarily being dependent on them. For instance, if YFI develops a smart contracts academy why not use them to mitigate any potential smart contract bugs. The more eyes looking at the same problem can prevent fires before they happen which enables long-term stability. Just look at how fast Yearn is innovating and growing AUM at the same time by partnering with other protocols. By forming alliances the pie gets bigger, by isolating yourself from others the pie gets smaller. If CrescoFin brings institutional investor capital to Aave won’t some of it bleed into other protocols like MakerDAO. If MakerDAO can onboard aDAI and cDAI, then we should be able to onboard iCRES/wCRES. Diversification of protocol partnerships (e.g. B. Protocol) would actually reduce the likelihood of an extinction event for MakerDAO. Bringing in the capital of B. Protocol, Yearn, Nexus Mutual, CrescoFin, Uniswap, and so on actually makes it less likely to blow up since there are more assets to absorb the losses of a black swan event. Why do you think the large banks are each other’s counter-parties? It is to save their own skin from large losses. I am vehemently opposed to framing this as a zero-sum game We should all be working together to achieve a shared vision of Finance 2.0 and eliminate redundancy wherever possible. Human involvement is what got us here and it is what can take us to the next level. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.583939594356261
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hugh_Karp",
                    "index": "#6",
                    "likes": "5",
                    "time": "13/12/2020-20:37:39",
                    "content": "As an outsider it feels like Maker has already made a strategic decision on this. There are two ways to manage tail risk (which could lead to protocol failure);  avoid it as much as possible to minimise the likelihood diversify as much as possible, accepting events will happen but minimise the consequence.  Option 1) would be taking a Reflexer Labs (RAI) type approach, Option 2) is what Maker appears to be doing with all the new collateral types. You could argue that protocol integrations are slightly different to taking on collateral, and I’d accept that to some degree. However in the end it’s about scaling DAI in a secure way, new collateral and adding integrations can both contribute to those goals so fundamentally the same principle should hold. On that basis, it’s important that any external integrations should not be so large as to endanger the entire protocol if they fail. If they do, then I believe external integrations fit within the existing strategic direction. Note: I’m the Founder of Nexus Mutual so my comments may well be biased! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.323448773448773
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#7",
                    "likes": "3",
                    "time": "13/12/2020-21:19:59",
                    "content": "    Planet_X:  Relying on other defi projects for core functions such as liquidations requires very vigilant human oversight. While there might be benefits, all outsourcing of functions increases the administrative load on Maker governance in the form of brains, not code.   At least my point of view (as founder of B.Protocol) is that B.Protocol will make it easier for the governance to asses the liquidation risk. In the present state (both in liquidation 1.2 and 2.0) the governance has no idea on the capabilities of the current liquidators. Analyzing on-chain data will show you that there are very few active players, and there is no way to estimate their capabilities. One might speculate that initially the foundation might have been active in on-board/promoting some liquidators. But in the long run the governance itself cannot make decisions based on unpublic information.  more generally i understand the bigger issue that you are trying to raise, and it is not specific for B.Protocol. ** we will post an informal poll this week about B.Protocol integration, so it probably best to continue the specific discussion about B.Protocol there. I just wanted to emphasize that my view is that it actually reduces the human effort, and make it more incentive based.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2972222222222225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "1",
                    "time": "13/12/2020-21:26:38",
                    "content": "    ejbarraza:  For example, use Gauntlet Network to determine interest rates, leverage limits, possible emergency shutdown, etc.   As much as I like Tarun and the Gauntlet Team–this might be a Conflict of interest since they are heavily involved in/with Compound (own a large chunk of COMP).  But I do think the can run models on liquidations, risk, and ES. Would be good to also get an analysis on what happens if DAI get to $200B and it’s too big to fail… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.081632653061224
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#9",
                    "likes": "0",
                    "time": "14/12/2020-01:13:13",
                    "content": "He also works with Aave so I don’t see that in itself as a conflict of interest. He gets compensated for deliverables and if that somehow clouded his judgment, then the hit to his company’s reputation would be large enough to dissuade people from working with him. I think having all three lending protocols stress-tested under the same parameters would be best because then you can have an apples to apples comparison of risk under the hood. Like a DeFi equivalent of Moody’s ratings. Customers could choose where they want to do business based on risk score, interest rates, and so on. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.517857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#10",
                    "likes": "0",
                    "time": "14/12/2020-01:42:17",
                    "content": "I think we can participate in DEFI protocol integration with limited risk, let us stand in the front row of DEFI, rather than independent of DEFI. I believe that the collective strength is great. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hyman",
                    "index": "#11",
                    "likes": "1",
                    "time": "14/12/2020-06:53:52",
                    "content": "I’m more on the simpler side, though it’s tough to talk about a potential DeFi integration without knowing what it would be. There are certainly some DeFi integrations most rational people would not want. For example, locking DAI in the DSR into yearn vaults… The Maker product is a $1 algorithmically pegged ERC20. IMO that’s it. Do that and do it well, rather not get spread too thin. If the integrations help with that, maybe. I am wary of complexity, increased/additional attack vectors, and losing focus ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.946712018140589
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#12",
                    "likes": "0",
                    "time": "14/12/2020-07:05:00",
                    "content": "@hyman, Being a baselayer protocol means other projects build on top of Maker. Example: a project decides to use DAI on their platform. Integrating with defi means using other projects for Maker functioning. Example: having an fund on Uniswap, or using B Protocol for liquidations. None of the above has anything to do with collateral, which Maker always will have. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#13",
                    "likes": "0",
                    "time": "14/12/2020-07:31:54",
                    "content": "@SebVentures     SebVentures:  My feeling is also that we are not a protocol like uniswap that can be automated.   I bet you this can be done. Using the functionality of Instant Access Modules most of Maker’s functions can be automated. MIP27 is just a start.     SebVentures:  USDC has moved from being the devil on earth to be our main collateral with no reward to compensate the risk.   USDC was never the devil on earth. Tether is (possibly) the fallen angel. That is one pilgrimage for you sir. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#14",
                    "likes": "1",
                    "time": "14/12/2020-07:46:38",
                    "content": "    ejbarraza:  I feel that this is a false dichotomy.   I don’t. It’s crossing the Rubicon kind of event. There is no way back. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#15",
                    "likes": "1",
                    "time": "14/12/2020-07:49:23",
                    "content": "    jernejml:  It’s crossing the Rubicon kind of event. There is no way back.   I have to agree with you there @jernejml. Either the Maker protocol stands on its own feet or it does not. It is possibly not a disaster to go the integration with defi route but I suspect we give up true ability to scale if we do . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.550000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#16",
                    "likes": "0",
                    "time": "14/12/2020-08:06:04",
                    "content": "    Hugh_Karp:  You could argue that protocol integrations are slightly different to taking on collateral, and I’d accept that to some degree. However in the end it’s about scaling DAI in a secure way, new collateral and adding integrations can both contribute to those goals so fundamentally the same principle should hold.   Collateral onboarding and protocol integration function very differently. Again, the key is scale. Right now collateral onboarding is a human intensive effort - resulting in a 30 month waiting line for new collateral types. Collateral onboarding can however, with the help of Instant Access Modules and possibly staking, be a (nearly or fully) automated process. Protocol integration however, cannot be automated and requires high intensity human effort. So while both are superficially the same with regards to short-term outcome, the implications for Maker are likely very different. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.358365164247517
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#17",
                    "likes": "1",
                    "time": "14/12/2020-10:24:43",
                    "content": "is the primary goal of stability to:  catalyse innovation and adoption OR approximate the US dollar with leverage and collateral  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#18",
                    "likes": "0",
                    "time": "14/12/2020-12:17:11",
                    "content": "    Planet_X:  Using the functionality of Instant Access Modules most of Maker’s functions can be automated.   The easiest way to scale is to onboard RWAs like securitizations, real estate, bonds, loans, whole life insurance, and bank deposits. I don’t see how this can be done autonomously since there are legal barriers to entry (i.e. securities regulations). Bank deposits alone are a $60 trillion industry. If CrescoFin already has the infrastructure set-up to onboard billions of dollars of institutional investor capital, then MakerDAO can offer a line of credit on this conservative asset-class and pool of capital. Going solo will not allow this to come to fruition. Whole life insurance is another good idea that is not going to be executed without human intervention on some level. RWAs reduce the concentration risk of digital assets, but they are extremely slow to onboard and will never be done autonomously. If you want to do it without the help of CrescoFin, 6S Capital, Centrifuge, or anyone else then this is basically a lost cause. Why not leverage other people’s human capital and just work with them rather than against them? Once again if we partner with others the AUM pie gets bigger because the people who get introduced to one product like iCRES can then use it as collateral for minting DAI and possibly use that DAI to yield farm on Yearn. The more capital is in Yearn, the more AUM is yield farming on Sushiswap, Cover, Hegic, etc. The more AUM is buying options, the more capital efficient DeFi becomes. The more AUM is buying credit default swaps (i.e. cover), the less downside risk of a black swan event. MakerDAO cannot and should not innovate every one of these products, but it can certainly stand to gain from the end result which is more capital flowing into DeFi which can end up minting DAI.     David_Meister:  catalyse innovation and adoption   I was under the impression that it was the former, but it seems as though it is the latter. If we are trying to compete with the Fed then we are fighting an uphill battle since they can print to infinity and beyond regardless of solvency. If we are trying to do the former, then we have a legitimate shot at bringing lots of capital into Finance 2.0 which can earn a higher yield based on eliminating intermediation and using secure blockchain technology to generate a higher ROI than traditional savings accounts with less risk. The only way this can be done is if there are legal entities being run by human beings that bridge the gap between TradFi and DeFi. Human intervention got us in this mess and it is the only thing that will get us out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.77106227106227
                }
            ]
        }
    ]
}