{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/the-role-of-delegates-within-a-dao/16873",
            "title": "The Role of Delegates within a DAO ",
            "index": 16873,
            "category": [
                "Governance"
            ],
            "tags": [
                "delegation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#1",
                    "likes": "0",
                    "time": "26/07/2022-18:36:37",
                    "content": "   [SIGNAL REQUEST] Budget Re-allocation & Core Unit Accountability Framework   You and I are servants of the DAO   This seems to be the big misconception here. Delegates are not servants of the DAO nor or are they beholden to the DAO in any way. They are representatives of their delegators and nothing more. Delegates have no inherent right or reason to proactively manage the activities of the DAO beyond voting on proposals as they come up. The whole point of a DAO is to have different sets of people creating proposals and voting on proposals. When you have the same people creating and voting on proposals, then there is no need to have a DAO. You then just have the same kind of organization that we’ve been trying to escape. This is how it is today. If you don’t like it, then you need to change the way that the DAO works and how its incentives are structured. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-budget-re-allocation-core-unit-accountability-framework/16788/8"
                    ],
                    "GPT-summary": "The post discusses the role of delegates within a DAO and how they are not servants of the DAO, but rather representatives of their delegators. The author emphasizes the importance of having different sets of people creating and voting on proposals to avoid having the same people in charge and to maintain the decentralized nature of the DAO. The post invites readers to consider changing the way the DAO works and its incentives.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.4642857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "4",
                    "time": "26/07/2022-19:11:24",
                    "content": "    ChrisBlec:  Delegates have no inherent right or reason to proactively manage the activities of the DAO beyond voting on proposals as they come up.   If you are an MKR token owner you have the right to Govern. You could choose not to, that’s your prerogative. To me, MKR token is a governance token, and I choose to govern wether i’m a delegate, or not. It’s been that way since my inception to the DAO. And since 3F Delegate, delegates to its token contract, then ser I will use my right to govern and vote as I see best for the benefit of MakerDAO. What can I tell you. You and I are built differently. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.857142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#3",
                    "likes": "0",
                    "time": "26/07/2022-19:58:21",
                    "content": "    flipflopflapdelegate:  You and I are built differently.   I can’t hear you while you’re up on that moral high-horse, sir. This isn’t about the work ethic of me or you or any individual in the DAO. This is about moving toward - not away from - decentralized decision-making and ensuring that Recognized Delegates do not morph into a “C-suite management team”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ClausClowes",
                    "index": "#4",
                    "likes": "1",
                    "time": "26/07/2022-20:05:30",
                    "content": "Isn’t the distinction between shadow delegates and recognized delegates the compensation from and therefore beholden-ness to the DAO? Recognized delegates are in the best position to know what budgets the MKR holders will support, so it seems their involvement on some level (beyond the final vote) would be almost a pre-requisite to this method of budgeting. ( Not replying to anything above, beyond asking the difference in roles between shadow and recognized delegates.  ) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#5",
                    "likes": "0",
                    "time": "26/07/2022-20:11:06",
                    "content": "    ClausClowes:  Isn’t the distinction between shadow delegates and recognized delegates the compensation from and therefore beholden-ness to the DAO?   Recognized Delegates get compensated based on how much MKR is delegated to them. There is no incentive whatsoever to be “beholden to the DAO” (whatever that actually means) if your delegators do not value that particular principle. I’m not here to support the momentum of the current system because I feel that it’s overly centralized and opaque. I’d like to see it change. So I’m certainly not beholden to it. Shadow Delegates and Recognized Delegates have the exact same role as far as governance goes. RD’s are just incentivized to do it consistently and clearly and SD’s are not. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.479761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "2",
                    "time": "26/07/2022-20:23:03",
                    "content": "    ChrisBlec:  you’re up on that moral high-horse   Indeed–this is the moral high-horse I’m on:  image1478×1462 149 KB  At this point, our convo is just spam. Best to divide this discussion if you want to continue, as the subject matter has diverted from the SR at hand. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#7",
                    "likes": "0",
                    "time": "26/07/2022-20:38:14",
                    "content": "    flipflopflapdelegate:  At this point, our convo is just spam.   I agree that we can end it here, but I disagree that it’s spam. I’d like to help SF address this problem in a way that encourages decentralized decision-making. Leaning on Recognized Delegates to “handle it” is not the right way forward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "27/10/2022-15:03:41",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}