{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/change-on-chain-voting-from-voting-by-raise-of-hands-to-voting-by-ballot/15745",
            "title": "Change on-chain voting from voting by raise of hands to voting by ballot ",
            "index": 15745,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "meta-governance",
                "voting"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Balloonist",
                    "index": "#1",
                    "likes": "3",
                    "time": "11/06/2022-18:20:42",
                    "content": "Introduction For those that don’t know me, my name is Balloonist (Søren), and I’m part of the incubation program aiming to ramp up a legal resiliency Core Unit in MakerDAO - I joined the incubator 10 days ago. This is my first forum post, so I owe you a beer if I am totally off with this discussion. Why is there full transparency for on-chain voting? I am curious why the on-chain voting is designed as voting by show of hands instead of voting by ballot. Please see this example showing the current level of details published for an on-chain voting: Maker Governance - Offboarding Parameters for UNIV2DAIETH-A - May 30, 2022  Screenshot 2022-06-11 at 17.27.441820×840 134 KB  Show of hands vs. ballot Pros: Show of hands  It may be easier to document that decisionmaking in MakerDAO is decentralized. Transparency around delegates’ votes is useful for documenting that opinions and actions are aligned. It is great for further discussion in small groups with a high level of mutual trust.  Pros: Ballot  The voters are protected against intimidation, etc. post-voting. It reduces the risk of corruption (because it is more difficult to buy votes). It is possible to documented who voted without revealing their choices. Voters can bring arguments for or against the proposal no matter what they voted.  When bringing this up, I am aware that:  for many of the voting pools, there is 100% support which will reveal what each voter voted. I believe we can come up with a solution to fix this. It’s makes it harder to prove how decentralized MakerDAO actually is, as one person could control several wallets (one could argue that the same could be the case for ‘show of hands’). it would require the code of conduct for recognized delegates to be changed a bit. *when the result is based on total number of MKR-tokens voting, this would require some kind of maneuver to be able to keep the voters choice anonymous.  LongForWisdom made it clear, that delegates can not be anonymous. However, this is not the case, it is only the actual decision when voting that will be made anonymous.  Please let me know, what you think? I prefer the on-chain voting to be by:     Raise of hands Ballot     0 voters     ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmQUozNn#vote-breakdown",
                        "https://forum.makerdao.com/t/recognised-delegate-code-of-conduct/9384",
                        "https://forum.makerdao.com/t/delegation-and-makerdao/9429",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-09-15-2022/15843",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-09-15-de-junio-de-2022/15954",
                        "https://forum.makerdao.com/t/governance-and-risk-195-thursday-june-16-at-17-00-utc/15816/2"
                    ],
                    "GPT-summary": "The author of the post is proposing a change in the on-chain voting system in MakerDAO from voting by raise of hands to voting by ballot. The author presents pros and cons for both methods and acknowledges potential issues with implementing a ballot system. The post is seeking feedback and opinions on the proposed change.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.684615384615385
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "2",
                    "time": "11/06/2022-18:34:33",
                    "content": "Relevant so I will get you a beer. The current system is not perfect but in most crypto communities from L1 to DeFi protocols, such transparency and accountability are needed. In fact, even for many real world governments, in terms of parliament or congress, when votings happen for new proposals, it’s often recorded in public ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.686868686868687
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "3",
                    "time": "11/06/2022-18:36:43",
                    "content": "Not to mention it’s onchain so even if you hide it, one will be able to track it anyway. The current system relies on IOU MKR token so one can look at the blockchain history to track ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Balloonist",
                    "index": "#4",
                    "likes": "2",
                    "time": "11/06/2022-19:07:26",
                    "content": "Cheers, I look forward to that. Great feedback, @Doo_StableLab Can you help me out with some examples of what transparency and accountability are needed for, in this case where the specific proposal and the final decision are published including details on the group of people who made the decision? IMO, just because governments do something, doesn’t mean it is always a good idea. For instance, delegates do not enjoy the same protection as politicians do. And to my knowledge governments do not yet consider using blockchain/private-keys when voting - today’s voting method would probably be rigged if anonymous voting were used by governments (or be blamed for being rigged, which is nearly just as bad). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.215277777777779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#5",
                    "likes": "2",
                    "time": "11/06/2022-19:16:31",
                    "content": "    Balloonist:  just because governments do something   It’s not just governments. It’s standard in blockchain onchain votings. Do you know any major protocol with onchain voting that allows ballot system that you discussed?     Balloonist:  Can you help me out with some examples of what transparency and accountability are needed for, in this case where the specific proposal and the final decision are published including details on the group of people who made the decision?   Each delegate, after making decision is encouraged to share their reasonings. You can check mine here Doo Delegate Platform - #53 by Doo_Nam ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.078125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#6",
                    "likes": "0",
                    "time": "11/06/2022-21:07:24",
                    "content": "Yep. It’s on-chain so no matter how its done it will be transparent. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#7",
                    "likes": "1",
                    "time": "11/06/2022-21:13:29",
                    "content": "Welcome, counselor! A good amount of what I post on here is regulatory and stemming from the U.S. I look forward to seeing what you have in store! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#8",
                    "likes": "3",
                    "time": "12/06/2022-21:52:12",
                    "content": "I’m not sure how we could apply a delegation system where the delegates’ votes are anonymous. MKR holders who are delegating their MKR are entitled to know how their chosen delegate is using their voting power - if they are unhappy with how a delegate is voting, they have the right to re-delegate their MKR to a more acceptable choice. In a system where votes are anonymous, this would be impossible. I guess the main question I have is: why would anyone delegate millions of dollars worth of MKR voting power without knowing how that power was being used? Without this question being answered, such a change is a non-starter in my eyes. Please correct me if I’ve misunderstood your proposition, and you’ve accounted for this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.834821428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Balloonist",
                    "index": "#9",
                    "likes": "1",
                    "time": "13/06/2022-08:55:05",
                    "content": "Hi @Patrick_J, thanks for sharing your view. I agree with you, MKR holders who are delegating their MKR are entitled to know how their chosen delegate is using their voting power, to some degree. Having full transparency on how the delegates are voting especially makes sense to me for proposals of low complexity. However, I believe once the complexity of the proposals is getting much higher, it becomes a matter of trust or dependence on the delegates’ skills and judgment. My answer to why anyone would delegate millions of dollars worth of MKR voting power, without being able to supervise how the power was being used on a day-to-day basis, would be that the MKR holders are relying on the chosen delegate’s political standpoint, strategy, expertise, and ‘business judgment’ as the delegates most likely are better suited making these decisions than the average MKR holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.020833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#10",
                    "likes": "1",
                    "time": "13/06/2022-09:12:24",
                    "content": "Thanks for the response. It’s definitely an interesting discussion and it’s always good to consider where we can make improvements.     Balloonist:  the MKR holders are relying on the chosen delegate’s political standpoint, strategy, expertise, and ‘business judgment’   None of this is relevant if delegates are not trustworthy - people lie. The current system works because it is very obvious if a delegate is misrepresenting their votes when they communicate because it is visible on the blockchain. It is trustless. Without the ability to verify that delegates’ voting actions match their platforms or their stated voting intentions, the system doesn’t work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.285714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Balloonist",
                    "index": "#11",
                    "likes": "1",
                    "time": "13/06/2022-09:37:31",
                    "content": "I agree the discussion is interesting. I am considering the balance of transparency and MKR holder-supervision on one side and business judgment and responsible management by the delegates on the other side. When looking at traditional organizational structures in the corporate world, the shareholders appoints the Board of Directors (BoD), which then appoints the Board of Management (BoM). In this scenario, the shareholders have to rely on the high-level reporting from the management and have to wait and see how the company performs, it is accepted that the management from time to time makes the wrong decisions, but overall the decisions have to be correct for the company to succeed long-term. I see delegates as some kind of a hybrid between the BoD and BoM in symbiosis with the CUs and the MKR holders. Too tight a grip around the delegates can be slowing down or compromise the decision-making that is required to let MakerDAO move forward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1704365079365076
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#12",
                    "likes": "1",
                    "time": "13/06/2022-11:27:45",
                    "content": "We are far removed from traditional boards of directors/managers. Keep in mind that those boards owe fiduciary responsibilities. Delegates do not. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Balloonist",
                    "index": "#13",
                    "likes": "1",
                    "time": "24/06/2022-12:32:23",
                    "content": "Hi again @MFeinberg and @Patrick_J Just saw that Polygon ID launchede yesterday, so from the technical perspective, it is not impossible. “#PolygonID lets DAOs allow only those that have received valid attestations to participate in voting. Once verified, activity is completely private.” https://twitter.com/0xPolygon/status/1539638078020628480 However, I have decided not to spend more time looking into this at the moment as I believe the developing powers would be better spent somewhere else at the moment. Just wanted to update the thread, so we can revert to it at a later stage should it becomes relevant. Just another update on anonymous voting (18/7/22): The most popular governance voting platform, Snapshot, just added the option for anonymous voting, so it can be done technically.    Decrypt – 18 Jul 22    Snapshot Adds 'Shielded Voting' for DAOs to Help Solve Voter Apathy - Decrypt The voting-as-a-service platform Snapshot is rolling out a new feature that would let DAO members vote on proposals privately.      ",
                    "links": [
                        "https://decrypt.co/105201/snapshot-adds-shielded-voting-daos-help-solve-voter-apathy",
                        "https://decrypt.co/105201/snapshot-adds-shielded-voting-daos-help-solve-voter-apathy"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#14",
                    "likes": "0",
                    "time": "18/07/2022-18:05:05",
                    "content": "Tbh, I’d rather see “show of hands” but based on the delegators rather than the delegates. For instance, if a VC delegates to 10 different delegates, I’d prefer to see those votes all represented as the delegators vote. Delegates are just voting the will of others. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Balloonist",
                    "index": "#15",
                    "likes": "1",
                    "time": "18/07/2022-19:45:10",
                    "content": "I agree if raise of hands is to be used. I am gathering suggestions to add transparency and reduce the risk of puppeteering, so this was a useful input, thanks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#16",
                    "likes": "0",
                    "time": "20/07/2022-10:03:22",
                    "content": "My overriding concern here is that by shifting to voting by ballot, all of a sudden, the DAO becomes a lot less transparent. I share your concerns about puppeteering @Balloonist and actually quite like @ChrisBlec’s idea to represent all votes from a particular delegator (perhaps in a separate chart/screen compared to the main delegate vote screen). But I would prefer to counter that issue in a way that still preserves the inherent transparency of the DAO’s governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Balloonist",
                    "index": "#17",
                    "likes": "0",
                    "time": "20/07/2022-10:33:38",
                    "content": "Thanks for sharing your view, @Matt_NZ . As stated above, I agree ballot voting probably is not the right thing to pursue at the moment with the coin voting governance framework and the current delegation framework in place. There are different ways to approach the issue, ballot voting was just the first I wanted to discuss. Two chamber voting like Optimism or one person one vote discussed with Vitalik here are some other options. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.436224489795919
                }
            ]
        }
    ]
}