{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/thoughts-of-next-steps-for-alm-and-rwa/19899",
            "title": "Thoughts of next steps for ALM and RWA ",
            "index": 19899,
            "category": [
                "Core Units",
                "Strategic Finance"
            ],
            "tags": [
                "rwa",
                "alm",
                "sf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "14",
                    "time": "21/02/2023-19:13:04",
                    "content": " Context Currently, the DAI peg is mainly maintained by our extensive balance sheet allocation in stablecoins (around 3B or 60% of our assets), while this provides a diamond strong peg it is also not great for MKR holders as the protocol is not burning MKR, neither for DAI holders as the protocol is not generating surplus to protect them (surplus buffer is short 175M of it’s target). The protocol is relying on US regulated stablecoin competitors which is not great for optics. The first wave of improvement was rewards programs that Strategic Finance and Growth were able to attract including GUSD, USDP and Coinbase Custody. While the community is continuing the discussion and the workforce the work on the two latter, GUSD is representing around 17% of Maker revenues, not far from all the crypto-backed vaults combined. Strategic Finance also worked hard to get MIP65 implemented which is now generating the bulk of MakerDAO revenues. Moreover, with both Viridian and Spring, and the Arrangers Monetalis and BT, we are working on finding ways to onboard MMF (Money Market Funds) which will enable getting the risk-free rate with limited friction (lower than our current MIP65 ETFs). Continuing to onboard the stablecoins rewards opportunities and the short-term bonds solutions, assuming it is the will of the community, remains a priority. But now is the time to also plan for the next stage of Asset Liability Management and RWA. This was also reiterated by @rspa lately. This post also presents the evolution of my thoughts (and the DeFi space) since the Updating the short-term bond strategy?  Next stage of short-term bonds Last year, I presented the following steps:    Modeling DAI maturity   Step 1: Off-chain ETF managed by a Foundation/Trust under the control of MakerDAO Step 2: On-chain tokenized ETF Step 3: On-chain tokenized ETF that we can use as collateral on repo-markets (Aave) to get liquidity if needed Step 4: On-chain tokenized ETF that we use for market-marking (UNniswap LP, additional revenues) and that can use as collateral on repo-markets to get liquidity if needed. Step 5: The US Gov issue bond in a permissionless tokenized form because the market is so efficient that it’s cheaper than tradfi. We are the primary dealer. We are at step 0, step 1 soon, step 2 end of year?   We have collectively jumped from step 0 to step 1. It is time to go to step 2,3,4. It will not be easy and it will take time. We have currently those proposals:  Backed Finance ETF tokenization MIP65 Sub-project: Tokenization MIP119: Onboard DAI Funds to the Flux Finance DAI Lending Pool  Both Backed and Ondo/Flux are now live. It is early days of course. Both seem high quality on a first look (Due Diligence TBD) and address a similar problem in two different interesting ways. There is also Swarm that is launching soon. While Backed is tokenizing IB01 and IBTA, ETFs we already use in MIP65 under the Swiss DLT Act and in a US-remote way, Ondo is providing US-regulation exempt funds investing mainly in similar ETFs. The twist is the introduction of Flux that allows permissionlessly to lend against such a collateral. Notice, as DAI is present, we would get the borrow rate on our funds, not just the lending rate. Both provide on-chain yield (4%+) that is quite liquid and programmable. Assuming they continue to develop nicely, they will be great tools for DAOs. And indeed, there is a lot of interest. The space is nevertheless evolving quickly and with the lag we usually have at MakerDAO, nothing we do will be fast but careful and slowly ramping up. Finally, we still have the question of how to manage and allocate our existing RWA vaults, including MIP-65, and integrate them into on-chain processes. For instance, an improvement to introduce off-chain liquidation triggers in executive spells if liquidity on PSMs run low for MIP-65 or any of the legacy RWA vaults.  Next Steps   Continue diligencing existing opportunities for onboarding in the short-term  For e.g. USDP and Coinbase Custody, to the extent there is appetite from token holders to ultimately onboard them Continue diligencing and supporting work to onboard MMFs at the Protector DAOs Provide ongoing reporting and risk analytics for existing RWA vaults    Begin diligence and development work on new tokenization proposals  Support the development of MIP-65 tokenization projects Conduct legal due diligence on bIBTA and bIB01 as approved by token holders in the now defunct greenlight process Conduct due diligence on Flux Finance as a D3M integration opportunity    Research and develop on-chain integration strategies for existing vaults  Develop proposals for integrating off-chain resolutions and liquidations through on-chain governance spells Support the development of RWA oracles that can bring relevant information on-chain to execute these actions Support research into incentives to develop independent NAV verification for off-chain private credit collateral, in-line with MIP13-SP13’s goals    At the end of this process, by 2024, it is my hope we no longer have to rely only/mainly on unproductive stablecoins in uncertain regulatory frameworks, in order to continue supporting the peg and get to a more productive balance sheet. My goal is simple: No DAI should earn less than the risk-free rate. ",
                    "links": [
                        "https://forum.makerdao.com/t/paxos-makerdao-partnership-usdp-psm/19469",
                        "https://forum.makerdao.com/t/mip81-coinbase-usdc-institutional-rewards/17703",
                        "https://forum.makerdao.com/t/mip105-the-real-world-asset-collateral-scope-framework/19688/22",
                        "https://forum.makerdao.com/t/updating-the-short-term-bond-strategy/18302",
                        "https://forum.makerdao.com/t/modeling-dai-maturity/15961/16",
                        "https://forum.makerdao.com/t/mip-6-declaration-of-intent-invest-in-short-term-bonds-proposal-for-implementation/16185",
                        "https://forum.makerdao.com/t/mip65-sub-project-tokenization-community-feedback-request/16692",
                        "https://forum.makerdao.com/t/mip119-onboard-dai-funds-to-the-flux-finance-dai-lending-pool/19885"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.439192416778624
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#2",
                    "likes": "5",
                    "time": "21/02/2023-19:29:45",
                    "content": "    SebVentures:  Conduct due diligence on Flux Finance   Hey Seb great overview - I have recently completed an indepth review of Ondo/Flux. Flux is basically a fork of Compound with additional KYC and permissioning requirement. On flux, liquidations and borrowing against the Ondo tokenized etfs  there is a requirement that you have been KYC’d and whitelisted. I think prior to investing too much time in this it would be interesting to know whether a MakerDao trust would pass their KYC process - do you have any indications as to whether a MakerDao Trust would pass their KYC requirements - or maybe @Eumenes can enlighten us? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.145833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nathan_Allman",
                    "index": "#3",
                    "likes": "4",
                    "time": "21/02/2023-19:40:54",
                    "content": "Love the overview @SebVentures! Excited to work with the Maker community to diversify Maker’s exposure and to additionally generate low-risk sustainable yield. @dbkcan, as to your questions, I will first say that the outstanding MIP119 from @Flux_Finance does not require that Maker pass KYC with Ondo (or with anyone), as it would be lending via D3M into Flux, over-collateralized by OUSG. You are also right about liquidations of OUSG being permissioned, since only investors in Ondo I LP are permitted to hold OUSG tokens. If Maker wishes to participate in liquidation markets (e.g. to buy OUSG at a discount in exchange for DAI if/when third-parties become subject to liquidation) or even to invest in OUSG directly with DAI we can certainly begin a KYC/AML/CFT review of an entity affiliated with MakerDAO. We have on-boarded several Cayman Foundation Companies in the past and are familiar with the structures. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.961805555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#4",
                    "likes": "3",
                    "time": "21/02/2023-19:53:41",
                    "content": "Thanks @dbkcan.  We are checking with some smart folks on your Maker permissioning/KYC question. Maker entities have passed KYC for the SocGen and HVB transactions so that is encouraging. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.035714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "0",
                    "time": "21/02/2023-22:25:15",
                    "content": "Seb, Can you provide more details about the RWA oracles that are being developed, and how they will help to execute actions related to off-chain private credit collateral? Also, what is the timeline for the next stages of tokenizing ETFs such as Backed Finance? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.607142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#6",
                    "likes": "0",
                    "time": "22/02/2023-04:50:04",
                    "content": "    SebVentures:  My goal is simple: No DAI should earn less than the risk-free rate.   This is a commendable goal but it would be great to define what the risk-free rate target will be in the endgame (i.e. free floating DAI). Currently, its simple because DAI has a hard USD peg and its risk-free benchmarks are known (SOFR or IORB) Also, how can we ensure that DAI supply will remain above the required levels to meet withdrawals in periods of volatility, such as during the next crypto bull run (when assets rotate from stablecoins to non-stablecoins)? The community has voted for off-chain investments with longer maturities than can be unwound quickly enough to meet withdrawal needs. Given that open market borrowing of DAI is not available, it is crucial that we get this right. That is also why the GUSD deal is preferable to Coinbase Custody’s; aside from the higher rate of return, the DAI supply and funding stay in alignment. In my view, until all assets are on-chain, there is a real pressing need for MIP118. Some may think it is exaggerated, but as yields increase and deploying assets becomes more attractive, the risk grows that eventually a Black Friday-like event will occur and we will be unable to meet withdrawals. Data as of 2/21  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.522142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#7",
                    "likes": "3",
                    "time": "22/02/2023-08:04:04",
                    "content": "    flipflopflapdelegate:  Can you provide more details about the RWA oracles that are being developed, and how they will help to execute actions related to off-chain private credit collateral?   My comment was more for MIP65 so for instance. First so the dashboard is filled by a trusted source. Second, so we might use the NAV at some point instead of the vault loan outstanding. Third, a loop with the PSM to instruct directly the trustee when/what to sell (in line with the quarterly process). I don’t see much value in doing so for private credit.     flipflopflapdelegate:  Also, what is the timeline for the next stages of tokenizing ETFs such as Backed Finance?   We are starting the legal DD which includes legal advices both from Switzerland and the US. Then we will coordinate with CES and Oracles to develop the PSM-like structure. We also need to understand the ecosystem, how market makers see it and so on. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip65-quarterly-process/19755",
                        "https://forum.makerdao.com/t/request-for-proposals-for-a-on-chain-rwa-monitoring-solution/19535/36"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.819444444444445
                }
            ]
        }
    ]
}