{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/hide-the-current-votes-until-the-outcome-is-reached/2450",
            "title": "Hide the current votes until the outcome is reached ",
            "index": 2450,
            "category": [
                "Miscellaneous",
                "Site Feedback"
            ],
            "tags": [
                "voting",
                "vote-participation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/fbarnes",
                    "index": "#1",
                    "likes": "3",
                    "time": "11/05/2020-17:58:39",
                    "content": "Hi all, My first post on the forum. I’m a UX Writer and I’ve been participating in polls and executive votes for a while now-constantly thinking about user experience and MKR holder participation. Nobody should be forced to vote but similarly a small % of voters leaves the system open to manipulation. One of the problems I’ve had (as well as vote.makerdao.com not being mobile friendly with an increasing number of Web3 browsers available) is how it shows the number of votes already cast for each choice before the user has voted. It’s like going to polling station and seeing that 90% of people in your constituency have already voted for your party’s the opposition. It makes sense to me that this would discourage people from voting or thinking independently about which way to vote. It’s already hard to keep up with all the weekly changes and get your head around all the 1st, 2nd and 3rd order affects of your choice. Couple this with immediately seeing your choice has just 0.4% support and it’s likely to be very discouraging, not just for that vote but long term. because what’s the point. And if enough people think ‘what’s the point’ then that could change the outcome before the vote has even gotten started. I would propose we change the interface so that the outcomes aren’t shown until after the vote is over. While you could argue this is less transparent, those particularly interested in how the vote is shaping up before the cast their own vote could query the network. 3rd party voting platforms could also opt to show if they want. I briefly thought about showing it after the user casts their vote but with the ability to change your vote this could defeat the object. What do you think? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.267543859649123
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#2",
                    "likes": "6",
                    "time": "11/05/2020-19:12:06",
                    "content": "My two cents is that i don’t really think this is a great idea until we have ranked choice voting in place. Basically I worry about the potential for like minded individuals to split and effectively nullify their vote. Yes the current system suffers from the spoiler effect but as a smaller mkr holder you are able to simply ask yourself which one of these top options most aligns with my world view and vote accordingly. If i am not able to see where the mkr has been staked at this point I run the risk throwing away my vote on some option that is not going to pass in any case which imo is a bigger issue than the influence you received by being able to see the popular options prior to voting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.046875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fbarnes",
                    "index": "#3",
                    "likes": "1",
                    "time": "13/05/2020-07:09:49",
                    "content": "Hi Andy, Thanks for chiming in.  If i am not able to see where the mkr has been staked at this point I run the risk throwing away my vote on some option that is not going to pass  I hear you but I’d argue that it’s a truer representation of the outcome you want. The alternative is you end up supporting something that you don’t want as much just because it ‘counts’ (which when you think about it doesn’t make much sense because the more popular option would win the poll with or without your vote). Also, it might seem like you’re ‘throwing it away’ when you look at it as an individual case but chances are there are many like you who would have collectively made that option viable. What we’re saying is that the option that gets chosen first is more or less the winner every time because it convinces others to vote that way too.  My two cents is that i don’t really think this is a great idea until we have ranked choice voting in place.  Not sure what this is. Could you explain?  Basically I worry about the potential for like minded individuals to split and effectively nullify their vote.  What do you mean by this? Thanks, ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.205208333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#4",
                    "likes": "0",
                    "time": "13/05/2020-08:37:19",
                    "content": "I support your idea - it might need a bit of tweaking but it’s better than what we have now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#5",
                    "likes": "0",
                    "time": "13/05/2020-09:23:08",
                    "content": "Hi @fbarnes , welcome to the forum! Good discussion, on one hand, speaking to users has revealed that showing the balance before the conclusion of polls has helped those who are not following on a daily basis gain an idea of where there is interest and vote accordingly (as they can’t take the time to track chat discussions/posts). On the other hand, this transparency can be detrimental as you say by discouraging people or swaying their vote. It’s tricky and open for debate. Likewise, I’d like to see how ranked choice voting (now available) is received by the community and reassess? The context here is that the current voting model only allows a voter to choose a single candidate, whereas ranked choice allows the users to pick multiple candidates in order of preference. re:  not being mobile friendly  Yes! we have seen an increase in mobile usage and are redesigning the Governance Portal to be mobile responsive, hoping to share that in the coming weeks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.988467261904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#6",
                    "likes": "0",
                    "time": "13/05/2020-14:29:40",
                    "content": "    Derek:  ranked choice voting (now available)   We mean the contract is live here? Voting portal doesn’t seem to allow. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3731060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#7",
                    "likes": "0",
                    "time": "13/05/2020-14:42:51",
                    "content": "Sorry, I meant that the capability to use ranked choice is live as of this week, we just haven’t applied it to a new poll yet. I’ll ask Rich on the governance call if we want to use it in the next round of polls. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9564393939393945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#8",
                    "likes": "2",
                    "time": "13/05/2020-14:44:50",
                    "content": "    fbarnes:  Not sure what this is. Could you explain?   The short answer is that most elections that you are familiar with use a system called “first past the post.” There has been loads of research around its many problems, and this problem you are describing is one of the main flaws that is often discussed. For a pretty good ELI5 explanation I would suggest checking out these the two videos in this youtube playlist those videos go over the problem with first past the post and explain how ranked-choice voting works. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.934027777777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#9",
                    "likes": "2",
                    "time": "13/05/2020-14:49:32",
                    "content": "    Derek:  I’ll ask Rich on the governance call if we want to use it in the next round of polls.   Ranked choice stability fees FTW! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "0",
                    "time": "13/05/2020-15:25:06",
                    "content": "    Derek:  I’ll ask Rich on the governance call if we want to use it in the next round of polls.   I think this may require a signaling poll. I do think it would be beneficial, but it is more complex than the current iteration so it’s not an improvement without cost. It is something I would expect to pass though. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#11",
                    "likes": "3",
                    "time": "13/05/2020-15:58:22",
                    "content": "When adding ranked choice voting, I think it’s just as important that mkr holders are able to easily view current votes. No need for obfuscation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666668
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fbarnes",
                    "index": "#12",
                    "likes": "0",
                    "time": "18/05/2020-22:16:24",
                    "content": "@Andy_McCall Thanks for the insight. Just read your reply and watched the video, which was helpful. Some thoughts off the top of my head:  Minority rule is definitely a potential (and probably present) problem Two-party system isn’t an issue bc in most cases there are no ‘popular’ candidates before the vote is open. In fact, removing outcomes until after the vote is over actually eliminates this problem since you’re not swayed to vote for a more ‘popular’ option. I’ll be interested to see how ranked voting goes. Without overcomplicating it, are there any metrics we’re using to measure this against participation of the old system? @Derek   Thanks everyone for the discussion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.980769230769231
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#13",
                    "likes": "1",
                    "time": "20/05/2020-13:51:44",
                    "content": "Hi @fbarnes, beyond measuring the growth of MKR locked in chief and polling participation over time, I’m mostly interested in the qualitative aspects from users, namely - is it easy to interpret how polls were determined, do I understand how my vote contributed to the end result, does the information provided help me vote effectively, most of which we determine from R/C chat, user interviews and 1:1 discussions. I imagine this will continue to surface the debate over whether we show which votes are in the lead prior to completion - for now the majority of people want to continue to see this information as it helps them make a decision, but we should definitely revisit if this sentiment changes. Appreciate your thoughts in this space, thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.194444444444445
                }
            ]
        }
    ]
}