{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dai-lights-news-moves-and-layer-2s/17188",
            "title": "Dai-Lights | News, Moves, and Layer 2s ",
            "index": 17188,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "summary"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#1",
                    "likes": "4",
                    "time": "11/08/2022-17:23:17",
                    "content": " Dai-Lights | News, Moves, and Layer 2s  6912×3456 1.51 MB  Image AI generated via MidJourney  News/TLDR  Data pulled on Sunday, August 8, 2022. My apologies for the delay, have a couple of Maker-centric projects in the works.   Optimism launches liquidity mining incentive program via Aave. Optimism flips Arbitrum in both TVL and circulating DAI. At current rates, Velodrome’s DAI pools are generating $2.69M in fees annually. A total of 283.73M DAI still resides in exploited Ethereum wallets.   Moves & L2s    From a technical standpoint, not much separates the two major Optimistic networks, but “first” always comes with its merits. Arbitrum saw the bulk of initial project ports, thus building a more robust and interactive ecosystem. Optimism, on the other hand, stacked slowly, focusing its efforts on the retention of blue-chip DeFi protocols and integrations. But that was then. Today, that slow-but-steady model’s seen significant shifts. In a move reminiscent of Avalanche, Optimism launched a liquidity mining program, and yet again, Aave is at the forefront of the distribution.  What does the OP token do?   Editorial disclaimer: I’m biased against farm tokens, mostly because of the way they are.  In a word, nothing. Holders can participate in on-chain governance, which currently exists to poll grants for additional OP distribution. Regardless, it seems to be working.  Volume Weighted %inc695×206 19.2 KB  Optimism saw the largest month-over-month movement, tacking on 110.97M DAI - good for a 517.68% relative increase in circulating DAI. The L2 now plays host to around 132.41M DAI or 1.8% of the total supply. And good for them. I haven’t covered much Optimism, but not for lack of trying. There just genuinely wasn’t much going on… but, that’s finally changed.  🅞 Optimism   Defillama Opt TVL1385×389 114 KB  Optimism saw its TVL double in 72 hours. The uptrend began with the launch of Velodrome, which as @Saludiego_201 pointed out, handles a sizeable chunk of the network’s stablecoin transactions. That said, the true catalyst for the immense growth came via the OP token and the grants directing its distribution. Velodrome I’m going reverse-alphabetical because I’m tired of Aave.    Assuming the above rates remain constant, Velodrome’s DAI pools collect around 180.79k in fees per week, or over $2.69M annually. While it would introduce counterparty risk, the DAO stands to make a solid chunk of passive revenue by actively participating in similar pools from their onset; something worth considering as L2s continue to grow. All in all, Velodrome accounts for around 7.81M in pooled DAI.. Aave v3    Aave enjoyed a 1500+% increase in 7-day TVL after its announcement that 50M OP tokens would be distributed to protocol users. Though, for our purposes, that’s only tangentially relevant. What’s wholely relevant is Aave’s massive influx in L2 liquidity ahead of its impending stablecoin launch. The lending protocol currently houses around 488.99M DAI, with over 391.21M in DAI borrows. This accounts for around 81% of the DAI circulating on Optimism.  𐒰 Arbitrum   Defillama Arbi TVL1379×382 115 KB  GMX has seen continued growth through sideways price action and is now the top protocol by TVL on Arbitrum. We went over the specifics of the protocol in the last update, so let’s instead take a look at how the index has evolved since.    While DAI capitalization has fallen from its previous high of 11%, 15.18M DAI still buoy the index, which accounts for 6.3% of the pool’s TVL and around 22.37% of the DAI circulating on Arbitrum.  Radiant Capital is a relative newcomer; though as an Aave fork, is it really? The project utilizes a similar token framework to Fantom’s GEIST, itself a Compound fork. All the same, it only took a week for the project to flip Aave as humble farmers congregated en masse. In a sense, Radiant serves as a counter to Optimism’s OP token and subsequent mining program. Users earn token rewards plus RDT on both deposits and borrows, which can then be vested or locked for 100+% returns. Early exits then require a 50% slash from that vested stake. In other words, another project sacrifices long-term stability for a short-term liquidity boost. Rather than a utilitarian approach, RDT functions as a vested farm token, which, if GEIST is any indicator, goes something like this.  GEIST price chart835×473 20.4 KB  Still, money poured into the lending protocol over the week, leading to a TVL of around $485M. Of that total, 93.64M are held in DAI, good for around 19% of Radiant’s locked value. It’s’ worth noting that a few differences separate the GEIST and RDT, but not enough to fundamentally alter the general structure.  Geist had a built-in 6-month lock, enticing users to eat the 50% slash and take their early-mover profits. RDT chose a 28-day lock period, but still has an attached LP to farm unlocked tokens. The shorter lock-up should, in theory, decrease sell pressure in the present, but we’ll see how the token holds up once the unlocks begin.    But… can we have it back? This year’s already seen a total of 29 protocol exploits and cross-chain bridge hacks, with several actors holding DAI over freezable alternatives. When a project’s hacked, it’s bad; but when a bridge is comprised, the losses can be devastating and complete. Recent Protocol Exploits     Protocol Date Stolen     Audius July 24, 2022 $6.1M   Inverse Finance June 16, 2022 $15M   Rari Capital + Fei Protocol May 1, 2022 ~$80M   Saddle Finance April 30, 2022 $10M   Deus Finance April 28, 2022 $13.4M    Recent Bridge Exploits     Bridge Date Stolen     Nomad Bridge August 2, 2022 ~$200M   Horizon Bridge June 24, 2022 $100M   Ronin Network March 29, 2022 $625M   Wormhole February 3, 2022 $326M    The below only encapsulates one of these bridge incidents, but keep in mind that these figures represent the remainder. In most cases, the majority of the funds have already been moved off-chain or siphoned through Tornado Cash.  A total of 283.73M DAI are still stuck in blacklisted Ethereum wallets, representing around 4% of the total supply.  Customary disclaimer: None of the above should be taken as financial advice, but as an overview of the current landscape from my perspective. Thanks for reading, skimming, or immediately returning to the homepage. Until next time, have a solid one!  Resources      1. Dai-Curious Dashboard      2. Dai on Different Networks Dashboard      3. MakerDAO Dashboard via @SebVentures      4. Optimism Explorer (DAI)      5. Arbitrum Explorer (DAI)      6. Timeline of DeFi Hacks   ",
                    "links": [
                        "https://defillama.com/chain/Optimism",
                        "https://dune.com/embeds/258836/1955336/830747bc-36cc-4c91-b14a-b64deef0ade8",
                        "https://dune.com/queries/1113770/1903403",
                        "https://dune.com/queries/244221/456569",
                        "https://twitter.com/optimismFND/status/1555235060579794945?s=20&t=4OZThFPX7kgSAST6lNe5dg",
                        "https://twitter.com/AaveAave/status/1555230478394966018",
                        "https://optimistic.etherscan.io/token/0xda10009cbd5d07dd0cecc66161fc93d7c9000da1#balances",
                        "https://defillama.com/protocol/gmx",
                        "https://forum.makerdao.com/t/dai-lights-reunion-tour/16636#arbitrum-5",
                        "https://defillama.com/protocol/radiant",
                        "https://cryptosec.info/defi-hacks/",
                        "https://dune.com/alec/Where-is-my-Dai",
                        "https://dune.com/alec/Dai-on-Different-Networks",
                        "https://dune.com/SebVentures/maker---accounting_1",
                        "https://optimistic.etherscan.io/token/0xda10009cbd5d07dd0cecc66161fc93d7c9000da1#balances",
                        "https://arbiscan.io/token/0xda10009cbd5d07dd0cecc66161fc93d7c9000da1",
                        "https://cryptosec.info/defi-hacks/",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/11",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-11-17-de-agosto-del-2022/17376"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.339583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "2",
                    "time": "11/08/2022-18:13:14",
                    "content": "    alec:  The uptrend began with the launch of Velodrome, which as @Saludiego_201 pointed out, handles a sizeable chunk of the network’s stablecoin transactions. That said, the true catalyst for the immense growth came via the OP token and the grants directing its distribution.   It even has 2 times more liquidity than its closest competitor, it’s incredible.  image1345×129 18.1 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#3",
                    "likes": "1",
                    "time": "19/08/2022-16:28:28",
                    "content": " Circ DAI update704×215 13 KB  Small update: L2s are making moves. Optimism tacked on another 15.48M DAI, overtaking both Fantom and Polygon to shimmy into the top three chains by circulating DAI. Of the ~147.89M DAI hosted on the chain, around 76% is parked in Aave. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                }
            ]
        }
    ]
}