{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/how-is-dai-holding-its-peg/18160",
            "title": "How Is Dai Holding Its Peg? ",
            "index": 18160,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/puniaviision",
                    "index": "#1",
                    "likes": "0",
                    "time": "30/09/2022-16:03:01",
                    "content": "It seems like in most use cases, Dai is borrowed and immediately sold for another asset. If I want leverage on my ETH, I will borrow Dai against my ETH and sell it for more ETH. If I want liquidity on my ETH to buy a car, I will borrow Dai against my ETH, sell it for USD, and buy my car. For the RWA cases, everyone is selling the borrowed Dai for fiat to interact with TradFi. I understand the loans need to be paid back in Dai and that creates a natural buyer, but there is a massive time lag there. Who is the natural net buyer of Dai? Why has the peg not already gone below $1? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.857142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "0",
                    "time": "30/09/2022-17:20:40",
                    "content": "I know many like to point out the peg is maintained due to PSM which allows the protocol to convert Dai to USDC and vice versa. But the fundamental question is why are users willing to convert USDC to Dai in the first place? You see, Dai was actually above the peg starting Black Thursday and again starting when DeFi was booming. As users could gain attractive yields by using Dai for LPing, paying for premium was seen as ok. And though PSM has brought back to peg, the demand especially in DeFi still continues ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.836805555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/puniaviision",
                    "index": "#3",
                    "likes": "0",
                    "time": "30/09/2022-17:57:35",
                    "content": "    Doo_StableLab:  You see, Dai was actually above the peg starting Black Thursday and again starting when DeFi was booming. As users could gain attractive yields by using Dai for LPing, paying for premium was seen as ok. And though PSM has brought back to peg, the demand especially in DeFi still continues   If I am interpreting this correctly, the peg is held because Dai is used in a collection of yield-generating opportunities on chain so people are buying Dai to participate in those? I certainly get that the PSM is a valuable thing, but I would’ve imagined given the consistent, theoretical, sell pressure on Dai, it would be exhausted at some point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.499007936507936
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#4",
                    "likes": "0",
                    "time": "01/10/2022-16:26:59",
                    "content": "If Dai gets under 1 Dollar. People will use the PSM to redeem 1xDai for 1xUSDC and the PSM will burn the Dai. Its a simple concept. If its over 1 Dollar people use 1xUSDC to buy 1xDai and the PSM prints more Dai. Also the backed loans if someone has a loan they need to buy Dai to pay off their debt so they can redeem their collateral again. There is a constant buy pressure by people.  Just because you listed some examples that show sell pressure doesnt mean there are no examples of buy pressure to equalize that. Also here are other reasons why one would use Dai–> To store your money in a manner that doesnt allow circle or the us government to freeze your assets. People borrowing Dai to speculate to exchange for other tokens is also buy pressure. Not just sell pressure. Also someone buying your Dai for Fiat is also buy pressure from the person that buys it for Fiat. Regardless of the PSM you know that every Dai is backed by more crypto assets than their denomination. And for people to get their collateral back they will have to buy all the Dai eventually to repay their loan. Dai demand is actually so high that the price wouldnt remain 1 Dollar it would be over 1 Dollar if it werent for the PSM: Look at stablecoins like sUSD that trade for a premium because they dont have a PSM (thank god) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.331944444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/puniaviision",
                    "index": "#5",
                    "likes": "0",
                    "time": "01/10/2022-17:58:27",
                    "content": "    Ber10:  If Dai gets under 1 Dollar. People will use the PSM to redeem 1xDai for 1xUSDC and the PSM will burn the Dai. Its a simple concept. If its over 1 Dollar people use 1xUSDC to buy 1xDai and the PSM prints more Dai.   Totally follow you there. The question becomes if there is a net sell pressure on Dai, the PSM will eventually run out of money. It isn’t a natural buyer of Dai by itself.     Ber10:  There is a constant buy pressure by people. Just because you listed some examples that show sell pressure doesnt mean there are no examples of buy pressure to equalize that.   This clearly seems to be the case. I guess I’m trying to understand the principles at hand that make it so.     Ber10:  Also here are other reasons why one would use Dai–> To store your money in a manner that doesnt allow circle or the us government to freeze your assets.   This seems a less relevant value add with Maker holding like $5B of USDC.     Ber10:  People borrowing Dai to speculate to exchange for other tokens is also buy pressure. Not just sell pressure.       Ber10:  Also someone buying your Dai for Fiat is also buy pressure from the person that buys it for Fiat.   Would you mind explaining this? When I borrow to speculate, I am selling Dai for the other asset.     Ber10:  Dai demand is actually so high that the price wouldnt remain 1 Dollar it would be over 1 Dollar if it werent for the PSM: Look at stablecoins like sUSD that trade for a premium because they dont have a PSM (thank god)   Yea demand definitely does seem to be high. The story I am understanding so far for the natural buy pressure of Dai seems to be its integration in yield generating opportunities in crypto. Like the Curve 3pool? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.212731481481482
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Twigmaester",
                    "index": "#6",
                    "likes": "1",
                    "time": "02/10/2022-12:58:28",
                    "content": "This thread is a great read, if you want to learn about the peg. ",
                    "links": [
                        "https://forum.makerdao.com/t/resumen-del-mes-de-la-core-unit-de-riesgos-octubre-de-2022-traduccion/18654",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-october-2022/18615"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#7",
                    "likes": "0",
                    "time": "03/10/2022-13:25:21",
                    "content": "The PSM has enough funds to buy back most of the DAI. The rest of the DAI has to be bought back by the people that take out a loan for Dai. Because they have to pay back their interest in Dai to close their debt position. Both of those facts make sure that every Dai there is will be bought back for 1 Dollar no matter what happens. I dont understand the trip up to be honest. Its pretty simple. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.925000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#8",
                    "likes": "3",
                    "time": "03/10/2022-14:29:14",
                    "content": "OP is wondering why the PSM has not already been drained yet. OP is wondering why there is that much excess DAI demand (specifically in excess of demand for generating DAI through crypto loans). Kind of tough to speak on behalf of hundreds of thousands of holders, but here is where DAI is today: MakerDAO - Where is my DAI? updated mapping logic Over half of it sits in wallets (\"EOA\"s and treasury wallets). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.305555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/puniaviision",
                    "index": "#9",
                    "likes": "2",
                    "time": "03/10/2022-21:07:20",
                    "content": "    lyt:  OP is wondering why the PSM has not already been drained yet. OP is wondering why there is that much excess DAI demand (specifically in excess of demand for generating DAI through crypto loans).   Thank you for so succinctly describing my question! Appreciate it.     lyt:  Over half of it sits in wallets (\"EOA\"s and treasury wallets).   Fascinating, it does seem like Dai has done the really hard thing of getting natural adoption. Really cool to see.     Twigmaester:  This thread  is a great read, if you want to learn about the pe   Thanks for the thread! Is there anything I can read regarding how Maker was able to bootstrap in the early days? I’m fascinated by how Sai stayed true to the peg with 0 token incentives and such limited on-chain liquidity. I can only imagine the challenge when there is not much on-chain liquidity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.923412698412697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Twigmaester",
                    "index": "#10",
                    "likes": "0",
                    "time": "04/10/2022-09:30:45",
                    "content": "As far as I know, the Sai peg was managed purely with stability fees and arbitrage. Regarding further further reading, you might find this article interesting. ",
                    "links": [
                        "https://forum.makerdao.com/t/resumen-del-mes-de-la-core-unit-de-riesgos-octubre-de-2022-traduccion/18654",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-october-2022/18615"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.814285714285714
                }
            ]
        }
    ]
}