{
    "poll_list": [
        {
            "title": "Adjust the WBTC-A Risk Premium - August 24, 2020",
            "index": "3484",
            "option": "Yes",
            "supporting_mkr": "34,276",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-should-we-change-the-rps-for-various-collateral-types/3484",
            "title": "[Signal Request] Should we change the RPs for various collateral types? ",
            "index": 3484,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "collateral",
                "signaling",
                "wbtc",
                "rates",
                "usdc",
                "bat",
                "eth-a"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#1",
                    "likes": "8",
                    "time": "31/07/2020-20:07:04",
                    "content": " Overview With the base rate potentially being changed to -4% soon, we have the unique opportunity to adjust risk premiums on many collateral types without dramatically changing stability fees. There have been some concerns voiced on the forums, in community calls, and rocket chat that BAT, WBTC, USDC, ETH may have current RPs that do not accurate reflect their risk. In particular I want to bring to attention that USDC currently has a RP of 4% and WBTC has a RP of only 2%. Both of these assets have custodial/centralization risk, whereas WBTC has both custodial risk and price volatility risk. There has been some limited discussion on thinking about collateral risk within this framework of risk categories here. Although, more discussion on this topic is certainly welcome. Some community members have also mentioned that while BAT has a similar risk profile to a few other collateral types we recently onboarded(namely KNC and ZRX), its risk premium remains at 0%. Likewise Ethereum is a volatile asset and so not a riskless collateral type, so it is possible a 0% RP is not appropriate. Up until this point the adjustment of collateral risk premiums have been used as strategic levers to fix the peg, and not solely to compensate mkr holders for collateral risk. The assumption made with this poll is that this strategic lever should largely be the role of the base rate, rather than individual risk premiums. If there are arguments against this assumption, input is welcome. Let me know if there are additional collateral types of interest that we want to adjust risk premiums on, and I will add a poll for them.  Should we change the risk premiums for BAT, WBTC, USDC, and/or ETH?     abstain Yes No     0 voters      BAT risk premium     abstain 0%(unchanged) 1% 2% 3% 4% higher than 4%     0 voters      WBTC risk premium     abstain 0% 1% 2%(unchanged) 3% 4% 5% 6% higher than 6%     0 voters      ETH risk premium     abstain 0%(unchanged) 1% 2% 3% 4% higher than 4%     0 voters      USDC risk premium     abstain 0% 1% 2% 3% 4%(unchanged) 5% 6% higher than 6%     0 voters      Next steps Poll will run for two weeks and depending on the result will move on-chain assuming the outcome of the poll deems it necessary. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-105-thursday-august-13-4-00-pm-utc/3570/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-7/3630",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-104-thursday-august-6-4-00-pm-utc/3469/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-107-thursday-august-27-16-00-utc/3754/2",
                        "https://forum.makerdao.com/t/signal-request-should-emergency-action-be-taken-to-raise-the-wbtc-a-debt-ceiling/3519",
                        "https://forum.makerdao.com/t/maker-relay-ep-6/3517",
                        "https://forum.makerdao.com/t/signal-request-should-emergency-action-be-taken-to-raise-the-wbtc-a-debt-ceiling/3519/16",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-106-thursday-august-20-4-00-pm-utc/3657/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-09/3793/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340986394557823
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#2",
                    "likes": "3",
                    "time": "31/07/2020-20:52:36",
                    "content": "I think that changing RP without having a solid framework is not the good solution. It’s like asking for a quote for health insurance and fire insurance without any other information. We might get something a little bit better than currently but it will be the same empirical process. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6171875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#3",
                    "likes": "0",
                    "time": "31/07/2020-21:06:57",
                    "content": "This is shooting in the dark and the small changes will not help the peg. If we want income (since we cannot have the peg), we should say so and increase the rates as they will not make the peg much worse (nobody will buy DAI for $1.05). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "3",
                    "time": "31/07/2020-21:15:47",
                    "content": "We should also state that RP has nothing to do with making money. All risk premium should be provisioned to be used when the risk arise. Not used burning MKR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#5",
                    "likes": "8",
                    "time": "31/07/2020-23:33:06",
                    "content": "I want to clarify that this has nothing to do with helping the peg right now, and more to do with getting accurate risk parameters that will help when we are raising the base rate. When we are raising the base rate later mkr holders will then be compensated for risk accurately, and also borrowers are incentivized to borrow the assets we deem as least risky over the assets we deem as more risky. It also theoretically lowers future governance overhead because we can ask 1 question each week about the base rate, instead of asking questions about the risk parameters for every collateral type. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.744047619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#6",
                    "likes": "0",
                    "time": "31/07/2020-23:33:38",
                    "content": "    SebVentures:  We should also state that RP has nothing to do with making money. All risk premium should be provisioned to be used when the risk arise. Not used burning MKR.   I support this view. We must always be alert to assets with volatile prices. Considering the dramatic fluctuations in asset prices in the cryptocurrency world, we must prepare in advance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#7",
                    "likes": "0",
                    "time": "01/08/2020-01:31:41",
                    "content": "    SebVentures:  I think that changing RP without having a solid framework is not the good solution. It’s like asking for a quote for health insurance and fire insurance without any other information. We might get something a little bit better than currently but it will be the same empirical process.   The risk team put something together awhile back but to the best of my knowledge nothing has been open sourced so we kind of have limited visibility into their model. There are some links in this post if you are curious.     Special Governance and Risk calls Tuesday 4/14 and 4/15 Governance       Hey guys,  The Interim risk team will be doing additional governance calls this week on Tuesday and Wednesday at 1pm EST (one hour later than the normal Thursday time).  The idea is to do a few consecutive calls so there isn’t any significant interruption in our presentation of the risk work. They will be recorded, of course.  Tuesday Agenda   Vishesh: Overview of Risk Model Cyrus: Overview of Vaults and Risk Parameters  Recording: https://www.youtube.com/watch?v=blpPCgLmUaM   Wednesday Agenda   …     ",
                    "links": [
                        "https://www.youtube.com/watch?v=blpPCgLmUaM"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.81531954887218
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#8",
                    "likes": "2",
                    "time": "01/08/2020-04:35:31",
                    "content": "Can we get some solid discussion on the ETH RP? Is it possible to have any collateral with less risk than ETH on the Ethereum chain? My thoughts are no, anything less volatile than ETH would surely carry custodial risk. If that is the case, then I believe ETH RP should be set at 0% and everything is scaled from there. If we can imagine a collateral less risky than ETH, then ETH RP should be increased to allow this hypothetical collateral to be set at 0%. Edit: I had typed SF previously. I have corrected to RP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8809523809523805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#9",
                    "likes": "1",
                    "time": "01/08/2020-05:24:18",
                    "content": "The MAKER community voted on the proposal that the base interest rate is -4%. Here, we are only discussing the risk premium of collateral, not the basic interest rate. I also believe that any collateral must have a risk premium and cannot be zero risk. We cannot confuse the risk premium with the base interest rate. As for adjusting the basic interest rate to a negative number, this is a temporary method for the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.416666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#10",
                    "likes": "2",
                    "time": "01/08/2020-07:00:18",
                    "content": "I voted for ETH 1%, but i would rather go very small, like 0.25%. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#11",
                    "likes": "1",
                    "time": "01/08/2020-10:39:07",
                    "content": "    SebVentures:  I think that changing RP without having a solid framework is not the good solution   I don’t follow. It’s not like current RP were determined by solid framework, right? What changed? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.985714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#12",
                    "likes": "0",
                    "time": "01/08/2020-10:47:14",
                    "content": "I don’t see how changing the RP are useful. There is a peg issue and a risk management issue. Changing the RP might get us think the risk issue will be addressed but it will not. Raising RP without changing the surplus buffer (which will be full soon at such rates) doesn’t make sense and doesn’t remove any risk. We should focus on what matter. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#13",
                    "likes": "0",
                    "time": "01/08/2020-10:47:56",
                    "content": "Have been discussed before the creation of some market simulator, that we could provide statistics and get a simulation of how could some RP affect the DAI price for many parameters (this applies to many other parameters of course)? Such simulator could help us to start establishing a framework to determine the best RP combination, which could have in its core results from a simulation based on statistic collected. Also we could study on it the risks (like running those “worst case scenarios”  we think about). We’re right now using social-intelligence to get the best RP combination, but I should agree that this is not an efficient methodology, and we’re spending many voting polls, weeks (and GAS) to test what this “social intelligence” considers the best. Please note, that I’m not saying such simulation should tell us which the values will be, but if correctly tested with the past (and I’m aware the past is not indicator of the future), it could give us clear signals of how bad or good some configuration of RP should be, and we could have even a base to prepare our polls (I’m not sure that polls with values: 0%, 1%, 4%… makes always sense, for some assets, maybe something like 1%, 1.25%, 1.5% is the best thing to vote on, but it is very hard for us to see these differences right now). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.708457341269842
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#14",
                    "likes": "0",
                    "time": "01/08/2020-11:05:45",
                    "content": "    SebVentures:  There is a peg issue and a risk management issue. Changing the RP might get us think the risk issue will be addressed but it will not.   I don’t think we fool ourselves. It’s about more transparency of amount of subsidizing (i.e. negative base a rate). As mentioned in OP, BAT currently has 0% RP.     SebVentures:  Raising RP without changing the surplus buffer (which will be full soon at such rates) doesn’t make sense and doesn’t remove any risk.   I am not sure if i follow here… what’s wrong with full surplus buffer and burning mkr? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.638888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#15",
                    "likes": "2",
                    "time": "01/08/2020-12:14:32",
                    "content": "It is possible. The uniswap tokens have less price volatility risk than ETH, and if both tokens are non-custodial, such as dai-eth, the uniswap tokens are also non custodial. Not to mention we have yet to concretely quantify what custodial risk should mean for risk parameters. It is likely that some tokens which represent derivatives of the cryptocurrency market will have lower overall risk that standard volatile cryptocurrencies. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.794270833333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#16",
                    "likes": "0",
                    "time": "01/08/2020-12:27:59",
                    "content": "The risk premium is a way to compensate the risk of a collateral hitting the solvency structure or MakerDAO. Setting 4% RP for USDC is like saying there is a 4% chance USDC goes bankrupt per year (losing keys, being frozen by the US gov whatever). Maybe a little less if you put risk remuneration here. The loss when a risk arise doesn’t have to be 100%, but it’s not impossible here. Let’s pretend it’s a 1% risk (100% loss). Currently, the equity part of the MakerDAO balance sheet is the surplus buffer (0.3M$, max 0.5M$). We in have 50M DAI backed by USDC. MakerDAO will become insolvent in such case and will have to raise 49.5M DAI. Sure it can work, there is a lot of immaterial value in MakerDAO but can also fail. In any case, it wouldn’t be unfair to wipe all current MKR holders. 4% RP for USDC-A mean risk about 2M DAI per year. With a surplus buffer of 500k, you are expressing that you expect to lose 4x the surplus buffer each year. As nothing happened with USDC for some time, you expect to lose way more than the buffer with one issue leading to MKR issuance. Either there are other reserves in the system that’ I’m not aware, that’s not risk management, that’s YOLO. From my perspective you can’t discuss risk premium without have a framework to manage risk. With BR @ -4%, the peg in its state, and the lack of diversification we don’t have to move fast as it’s not something that can be solved in the next few months. That’s why we have time to discuss the framework before moving in action. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.857843137254902
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#17",
                    "likes": "3",
                    "time": "01/08/2020-12:32:23",
                    "content": "Since this post is getting traction and sentiment seems to be changing, I just wanted to plug my signal request for increasing the ETH-A RP. “No” is still winning but based on this polls results I’m wondering if some people haven’t changed/added their vote yet. Please be sure to signal if you can. Thanks.     Signal Request: Increase ETH-A Risk Premium Governance       Overview MKR holders have been subsidizing the risk of ETH collapse since Black Thursday in order to bootstrap and encourage DAI supply growth as the peg has stayed above $1. With the ratification and creation of the base rate, we should begin to look at that as the lever to use to encourage DAI supply growth/retraction. Therefore I am asking the community whether it is time to re-add/add a risk premium to ETH-A to insure the Maker system against future ETH collapse. I look forward to your feedb…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#18",
                    "likes": "1",
                    "time": "01/08/2020-12:43:07",
                    "content": "    SebVentures:  4% RP for USDC-A mean risk about 2M DAI per year. With a surplus buffer of 500k, you are expressing that you expect to lose 4x the surplus buffer each year   If we simplify, why would buffer size matter? Important thing is how much (dai) fees are collected annually. If there is MKR issuance, auctioned price would be influenced by previous MRK burn rate. (And i am not saying, we should not increase buffer size).     SebVentures:  From my perspective you can’t discuss risk premium without have a framework to manage risk.   You can. You just won’t have very good estimates. I don’t need to have a formal “risk framework” to determine BAT RP of 0, is too low. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8590277777777775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#19",
                    "likes": "1",
                    "time": "01/08/2020-13:19:05",
                    "content": "You’re right that earning (fees collected) should somehow have a value. That’s exactly why Synthetix is backed by nothing more than expected earning. That’s unheard of in TradFi but why not. The issue is that such expected earnings also have a risk premium on them, or a discount rate. If MakerDAO need $50M, a bidder can provide it to resolve the insolvency issue or copy/paste MakerDAO code in a MakerDAO2 with a better solvency. You don’t need to have correct RP or even generate fees for that to work. Expectation is all that matter. If you know the supply rate in Compound/Aave is around 5%, it seems okay to charge 2% on the whole DAI supply. You don’t have to do that to be counted in your MKR valuation. You are hopping that there will be buyers of last resort, that MakerDAO will be too big to fail and that they will be nice/fair to existing MKR holders. I wouldn’t bet on that. PS : Not saying that BAT at RP 0% makes sense, just saying it’s the least of MakerDAO problems right now… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.543367346938775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#20",
                    "likes": "8",
                    "time": "01/08/2020-17:14:17",
                    "content": "Completely agree with now being the time to set the risk premiums for collaterals that have been grandfathered in at 0%. That being said, we should be deferring to the risk team as to what those rates should be. It’s their job to do the analysis and come up with a number based on science. I think we should stop having these types of popularity polls for Risk Premiums where the community guesses at what a good number is. We have a risk team. Let’s use them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#21",
                    "likes": "3",
                    "time": "01/08/2020-22:50:40",
                    "content": "Agree. And I would prefer that the Risk team propose RP values for every collateral. But have we got any indication that they are planning to give us values in the next 1-2 weeks? I would rather adjust the RPs now while we have the chance. And then we can always adjust again if we need to. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#22",
                    "likes": "6",
                    "time": "02/08/2020-15:10:45",
                    "content": "    hexonaut:  Completely agree with now being the time to set the risk premiums for collaterals that have been grandfathered in at 0%. That being said, we should be deferring to the risk team as to what those rates should be. It’s their job to do the analysis and come up with a number based on science.   In general, I agree. But it’s hard to have a complete confidence in risk team ability to execute, since it appears they are understaffed (there is always some emergency that breaks their focus - i assume), plus their work is quite opaque. I am not disputing their abilites/knowledge/motivation/intentions etc., just saying that it’s hard to form an opinion, at least for me. I believe they also outsource some work, but am not sure if the details are known. I have no idea how Foundation manages it’s resources and if community can be of some help here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.369047619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#23",
                    "likes": "0",
                    "time": "04/08/2020-18:30:25",
                    "content": "Do you plan to have multiple on-chain governance polls or just one? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#24",
                    "likes": "1",
                    "time": "04/08/2020-18:44:03",
                    "content": "Probably just one? Although I’m open to thoughts/suggestions on this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#25",
                    "likes": "0",
                    "time": "04/08/2020-20:16:41",
                    "content": "Doing seperate polls might help since the changes are quite distinct? I can see arguments for both sides. Well with the current poll results, you’ll only need 1 governance poll anyways.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#26",
                    "likes": "5",
                    "time": "04/08/2020-21:30:51",
                    "content": "Having a poll saying that ETH has no risk at all (0%) less than 6 months after the Black Thursday which led to a loss for Maker due to the fall of ETH is … interesting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.052083333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#27",
                    "likes": "0",
                    "time": "05/08/2020-01:46:49",
                    "content": "I see no reason to set a zero risk premium for ETH. ETH accounts for the largest proportion, the price is a variable asset, and the Black Thursday event occurred. If you want to subsidize the stability fee in the short term, you can choose 0 stabilization fee, but the risk premium cannot be 0, which will lose justice. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tbone",
                    "index": "#28",
                    "likes": "0",
                    "time": "05/08/2020-09:27:21",
                    "content": "When I come back to this thread after voting my votes have disappeared. Is anybody else having trouble voting in this Signal Request? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#29",
                    "likes": "1",
                    "time": "05/08/2020-14:52:06",
                    "content": "I see your votes in the polls ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#30",
                    "likes": "0",
                    "time": "10/08/2020-18:27:03",
                    "content": "@LongForWisdom on Wednesday this poll will have been going for 12 days rather than 2 weeks, but that is also the deadline for this to be put in an on chain poll this coming week. Is it okay to end the signal request a few days early? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#31",
                    "likes": "2",
                    "time": "10/08/2020-19:24:08",
                    "content": "@befitsandpiper as a general rule I think it’s important to try to stick to the communicated timelines unless there is a good reason not to. I don’t think this is particularly urgent given the current state of the base rate. You’re running the signal though, so if you think this has had sufficient participation and you think having the on-chain vote happen a week sooner is worthwhile, feel free to close it down early. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.680555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#32",
                    "likes": "1",
                    "time": "14/08/2020-18:14:06",
                    "content": "It’s been 2 weeks since starting this poll and so it is being closed today. From the results it looks like the only change that will polled on chain is a RP change for Wbtc from 2% to 4%. I will PR the poll language before wednesday so that this can be onchain next Friday. Thank you everyone who participated! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#33",
                    "likes": "1",
                    "time": "20/08/2020-02:24:01",
                    "content": "submitted here: https://github.com/makerdao/community/compare/master...befitsandpiper:patch-1 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#34",
                    "likes": "0",
                    "time": "20/08/2020-04:02:04",
                    "content": "@befitsandpiper It should be a yes/no governance poll whether the WBTC-A RP should be increased from 2% -> 4%? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#35",
                    "likes": "3",
                    "time": "02/09/2020-17:48:00",
                    "content": "This was put to a governance vote  on 24/08/2020 to express support or opposition to increase the WBTC Risk Premium from 2% to 4%. “Yes” won with 100% of the vote. Yes  - 34,275.53 MKR (100.00%) No  - 0 MKR (0.00%) The executive vote passed [in the Liquidations 1.2 Proposal].(https://mkrgov.science/executive/0xf8085d74ad616d48c225f3812a610f5cd5f676da) I’ll be removing the active-signal tag. I’ll message the moderators to lock this thread. ",
                    "links": [
                        "https://mkrgov.science/executive/0xf8085d74ad616d48c225f3812a610f5cd5f676da"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#36",
                    "likes": "0",
                    "time": "09/09/2020-17:48:06",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2556"
}