{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mandated-actors-neutrality-discussion/16025",
            "title": "Mandated Actors Neutrality Discussion ",
            "index": 16025,
            "category": [
                "Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "9",
                    "time": "23/06/2022-11:07:29",
                    "content": "I was expecting this to start occurring now that open season on CUs seems to be declared. We are working on a strategy for holistic budget cuts with SF. Let’s stay professional while we move through this contentious time. The OP has 0 insight into what’s going on behind the scenes. @rune can you please commit to not honoring these ad hoc off-boardings as I expect we will just be flooded with them, and they will do nothing other than start terrorizing the good folks who have been working hard over the past year. ",
                    "links": [
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-9/16355",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-9-traduccion/16383",
                        "https://forum.makerdao.com/t/mip40c3-sp72-modify-core-unit-budget-events-001/15991/17"
                    ],
                    "GPT-summary": "The post does not fit into any of the listed topics. It appears to be a discussion about a specific issue related to budget cuts and off-boardings, with a request for a commitment to not honor ad hoc off-boardings.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "None"
                    ],
                    "Sentiment": 4.809523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#2",
                    "likes": "1",
                    "time": "23/06/2022-11:20:12",
                    "content": "    hexonaut:  The OP has 0 insight into what’s going on behind the scenes.   With all due respect, there shouldn’t be a “behind the scenes” in a DAO. Less “behind the scenes” please! That being said, I’m open to withdrawing this if a clear justification for the expense presents itself. I think that would mostly mean finding a way to repurpose the CU to something that either raises revenues or lowers costs.     hexonaut:  I was expecting this to start occurring now that open season on CUs seems to be declared   I don’t think anyone has done that. A single proposal to shrink spending is hardly a threat to the endless parade of proposals to ask token holders to fund various non-core activities. I’m sure every proposal will be decided by token holders on its own merits.     hexonaut:  @rune can you please commit to not honoring these ad hoc off-boardings   What’s ad hoc? I’m following the process laid out by governance ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match. The comment appears to be a discussion about a specific issue related to budget cuts and off-boardings, with a request for a commitment to not honor ad hoc off-boardings."
                    ],
                    "Sentiment": 4.805357142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#3",
                    "likes": "3",
                    "time": "23/06/2022-15:11:39",
                    "content": "    hexonaut:  We are working on a strategy for holistic budget cuts with SF   Who is “we”. Protocol engineering? What is your mandate? @Protocol-Engineering ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match the comment. The comment appears to be a request for clarification on the author's mandate and involvement in a specific issue related to budget cuts and off-boardings."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#4",
                    "likes": "0",
                    "time": "23/06/2022-15:13:45",
                    "content": "I’m an elected mandated actor. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#5",
                    "likes": "1",
                    "time": "23/06/2022-15:13:58",
                    "content": "What is your mandate? Very simple question. Also, you didn’t answer who “we” is. @Protocol-Engineering Can someone from protocol engineering please provide your mandate here? It would help clarify the confusion on thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match. The comment appears to be a request for clarification on the mandate and identity of a group or individual mentioned in the post."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#6",
                    "likes": "4",
                    "time": "23/06/2022-15:20:52",
                    "content": "“We” is the informal group which has been filling in the gaps to keep the protocol growing over the past year. Has nothing to do with PE. Why are you not posting these questions under your primary identity? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#7",
                    "likes": "5",
                    "time": "23/06/2022-15:22:13",
                    "content": "This is my only identity on Maker Forums. As an aside, if you are doing this informally and not as PE, then you are NOT operating as a mandated actor, just a conflicted actor operating outside of a mandate. This is why these various anon community members feel taken advantage of by the way you approached this CU. The offboarding is unfortunate and this CU received feedback prior to this situation that would have avoided this entirely. In the growth pill instance, you are likely operating against your mandate. You can see this confusion above in your own statements. The conflict and risk you and this “informal” group pose to both the workforce at large and the security of the protocol is serious. It is truly unfortunate to see a hierarchy form that has failed to consider any of the substantive technical contributors. It is unclear how you and your group intend to dictate the direction of the protocol without first considering or including others in your discourse. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.743650793650794
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#8",
                    "likes": "1",
                    "time": "23/06/2022-15:29:32",
                    "content": "Somebody needs to run operations. Your CU operates externally to the internal units, so you guys have the benefit of being able to stick to precisely the prescriptive mandates. In reality if none of us picked up the slack we would be far worse off. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#9",
                    "likes": "3",
                    "time": "23/06/2022-15:31:56",
                    "content": "It is about coming together in a way we can all agree on, moving toward a solid vision, and assigning those responsibilities transparently and in a way that protects the system and protocol. That’s all we are talking about. No need for random coups. If there need to be interim operational plans, let’s all agree on them and ensure they are moving us all in the same direction in a way we all agree with. Otherwise failure is certain. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.397619047619047
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#10",
                    "likes": "21",
                    "time": "23/06/2022-15:38:59",
                    "content": "Let’s please keep this thread specific to the Events CU. Team members (as MKR holders) are by all means welcome to speak their mind - we encourage transparent communication, however this does not represent the official stance of Protocol Engineering. Unless otherwise stated, Protocol Engineering as a Core Unit remains focused on its mandate of technical work as requested by Maker Governance and is neutral on this topic. Likewise, as a CU we are not involved in informal groups, but individuals are free to participate as they see fit as long as it does not impact their CU contributions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.291666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#11",
                    "likes": "1",
                    "time": "24/06/2022-05:06:17",
                    "content": "Just a general comment on decision making in the DAO, of which this offboarding is one example. Not questioning letting it go through as it is being done as per governance rules and ultimately the token holder decides. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#12",
                    "likes": "4",
                    "time": "24/06/2022-05:13:54",
                    "content": "    hexonaut:  The OP has 0 insight into what’s going on behind the scenes   stop the secret meetings ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#13",
                    "likes": "7",
                    "time": "24/06/2022-08:46:29",
                    "content": "    Derek:  individuals are free to participate as they see fit as long as it does not impact their CU contributions.   @Derek I agree with the sentiment but I do believe it’s time to answer the question at which point the team believes political activities are no longer compatible with the role of smart contract developer. Especially because the role of PE is part of the critical infrastructure. It should remain neutral so that the political power struggles leave the functioning of the core protocol unaffected. As far as I know, the team has always supported this view. Is the role of smart contract developer compatible with unbounded political ambitions: yes or no? If not then where do we draw the line? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match. The comment appears to be a discussion about the compatibility of political activities with the role of a smart contract developer and the need for neutrality in critical infrastructure."
                    ],
                    "Sentiment": 5.511904761904763
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#14",
                    "likes": "6",
                    "time": "24/06/2022-09:55:34",
                    "content": "I think political activities you are mentioning is simply extension of freedom of expression. There’s also freedom of assembly and as long as contributers are not actively sabotaging or undermining core work (such as smart contract, or marketing and etc) for political gain, I think it’s fine for the system ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match. The comment appears to be a discussion about political activities and freedom of expression, and does not relate to any of the listed topics."
                    ],
                    "Sentiment": 5.404761904761904
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#15",
                    "likes": "2",
                    "time": "24/06/2022-14:37:37",
                    "content": "Using confidential business information for personal gain has a name in the US, Doo. No claim to “freedom of assembly” is going to get you out of that… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#16",
                    "likes": "13",
                    "time": "24/06/2022-15:20:08",
                    "content": "If you restrict an individual’s freedom to voice their opinions in Governance, you’re going to see an increase in sock puppet accounts from any individual that wants to voice their opinion, which will likely further exacerbate the lack of transparency and mistrust. Encouraging this sort of behavior is a step in the wrong direction, IMO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#17",
                    "likes": "0",
                    "time": "24/06/2022-17:00:08",
                    "content": "Don’t really want to weigh in too much here because I don’t have a strong opinion but sock puppet accounts don’t have nearly the influence a longstanding CU member would have.  If a CU member were able to use an undercover account to influence the DAO, it might even point to the greater merit of their views. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match. The comment appears to be a discussion about the influence of sock puppet accounts in a DAO and the potential merit of a CU member's views."
                    ],
                    "Sentiment": 6.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#18",
                    "likes": "1",
                    "time": "24/06/2022-17:57:38",
                    "content": "Regardless of the ‘influence’ of any community/CU member, what matters are rational arguments. I don’t want to take position on this debate too much     Traster_Tray:  Don’t really want to weigh in too much here because I don’t have a strong opinion   for your same reasons, but I also feel that this:     hexonaut:  I’m an elected mandated actor.   is quite confusing. @hexonaut you should separate your activities as PECU member (dev) from the additional ones that you (no need to say) can pursuit in your free time (as any other person and MKR holder).     hexonaut:  The OP has 0 insight into what’s going on behind the scenes.   Maybe true, but how can we get insight on what’s going on behind the scenes? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.253787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#19",
                    "likes": "1",
                    "time": "24/06/2022-18:13:02",
                    "content": "I think it depends on how you define those. Not to mention within DAO, unless we want to invite legal understanding outside, we should look at what is permissible within governance frameworks. For example, some might object to initiative to offboarding in a short time period. There’s no governance rule against proposing such initiative and therefore I also think it’s valid. Or anonymous accounts applying as delegates. There’s no rule against it either. In similar fashion, there’s no rule within Maker governance that explicitly states you can’t voice your opinion or work / help with other CUs or even interested upcoming CUs (like LOVE CU right now). Also, what exactly is personal gain. Financial gain? Reputation? Is CU talking with delegates to appeal their case also considered personal gain as CUs get the benefit? Thus, unless there’s a governance rule that explicitly prohibit it or their actions actively undermine core work, I think it’s fine or at least tolerable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.364682539682539
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#20",
                    "likes": "9",
                    "time": "24/06/2022-18:17:02",
                    "content": "    wouter:  Especially because the role of PE is part of the critical infrastructure. It should remain neutral so that the political power struggles leave the functioning of the core protocol unaffected.   Feel like some context on how GovAlpha navigates this issue might be useful. We maintain neutrality as a Core Unit, and hold our facilitators to this mandate. This makes sense as they are “in charge” and tasked with bridging comms between the core unit and the broader community. However, we do not make any contributor to GovAlpha adhere to neutrality, provided they are clearly expressing their personal view and not that of the Core Units. It is possible this causes some confusion, but we think it’s an important feature for Core Units with neutrality mandates. The DAO is strengthened by knowledgeable parties being able to debate and provide their prospective on issues. If we slowly take away the ability of those working in the Core Units to be able to express their opinions we’re left with discourse lacking significant stakeholders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.651785714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#21",
                    "likes": "1",
                    "time": "24/06/2022-18:20:10",
                    "content": "    prose11:  However, we do not make any contributor to GovAlpha adhere to neutrality, provided they are clearly expressing their personal view and not that of the Core Units. It is possible this causes some confusion, but we think it’s an important feature for Core Units with neutrality mandates.   What about when interacting with other counterparties? For example, business opportunities or negotiations? For example, in the above they author suggests they have been operating as the Maker operations unit? At what point is engaging in activities that you are not mandated for, not appropriate? What about when these engagements include confidential information not disseminated within their own core unit or other MA? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match. The comment appears to be discussing the issue of adhering to neutrality and appropriate behavior when engaging in activities outside of one's mandate, particularly when confidential information is involved."
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#22",
                    "likes": "1",
                    "time": "24/06/2022-18:21:00",
                    "content": "That being said, I do understand that following part is very subjective:     Doo_StableLab:  actively sabotaging or undermining core work   And I can see where some might have issues as I heard that some view some threatening to leave unless such CU (like events) are preserved,is like threatening the protocol for unrelated CU and thus undermining the protocol and core work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match. The comment appears to be a discussion about a specific issue related to budget cuts and off-boardings, with a request for a commitment to not honor ad hoc off-boardings."
                    ],
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#23",
                    "likes": "2",
                    "time": "24/06/2022-18:28:15",
                    "content": "Probably not the best person to answer these inquires, given the neutrality mandate   so will leave most of these to someone else. But I think it’s fair to say the A in DAO is supposed to stand for something. Obviously representations can be problematic and should be viewed on a case by case basis, but there are plenty of gaps in CU mandates that most organizations find necessary. Things like marketing and recruitment are obvious gaps in our mandate coverage. The reality is someone has to be doing work outside of the passed mandates. If it’s community members, great! If it’s CU members they need to be ensuring their mandated work is covered, but after that they should feel just as welcome to contribute their time, provided they aren’t making false assertions about what they have been authorized/mandated to do. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.863636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#24",
                    "likes": "7",
                    "time": "24/06/2022-18:34:54",
                    "content": "    prose11:  … provided they are clearly expressing their personal view and not that of the Core Units.   So, saying “I’m a mandated actor” as justification for activity in an area that has nothing to do with the mandated role… that would be inappropriate and show a lack of appreciation for that separation of the two roles? Another thing is the usage of the official forum account with badge. If the hobby next to the official role has gone to such extents, wouldn’t it be appropriate to use a different account? Back at the Foundation we were very careful to always clarify if we were talking in personal capacity and make that distinction clear. The DAO doesn’t have to be the same, but for me it’s pretty obvious that there is no distinction made. The theoretical rule is just held up as a justification to keep using one role to support the other. The exact opposite of careful disclosure and separation of the two. I’m assuming this is not in bad faith. But in reality it can be deceitful and we need to be careful. So I suggest we seriously show some effort to avoid the most obvious confusions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.046014492753623
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#25",
                    "likes": "17",
                    "time": "24/06/2022-18:59:10",
                    "content": "(I’m representing my own opinions and not those of DICU) @wouter, yes, I agree that CU members should generally focus on the tasks at hand. I understand the sentiment of wanting to differentiate between someone’s role within their Core Unit and their broader impact within the community. However, I feel this concept is quite reductive given our organisational model (DAO). I believe that the multifaceted aspects of CU members are a unique reason why people choose to work at a DAO instead of a corporation. I would even argue it’s our unique competitive advantage. In the opposite scenario would have only a few selected individuals weighing in on matters (even if they are “political”) while the rest are in their respective silos. I myself have not been vocal in the forum. Still, I sincerely appreciate the people who are, whether or not their opinions align with my personal views. I’m concerned about the path you are opening here, as I feel it limits the contribution of self-motivated contributors. I’ll offer my own set of leading questions:  Whose role is compatible with “political ambitions”? Is SES in a unique position to do so? Should PE abstain from any “political” discussions? Even those that may affect the core functioning of the protocol? Why are these ambitions “unbounded”? Should this word be interpreted negatively?  Lately, I’ve been reconsidering whether or not I should be more vocal with personal views in public. My main fear has been that in voicing my opinions, I may negatively affect the work we do at DICU. I worry it will affect the great people I work with and, ultimately, the community I serve. Given the reactions to this and similar topics in the forum as of late, I feel my fears might be true. I want to see Maker and everyone involved thrive together. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.780797101449275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#26",
                    "likes": "1",
                    "time": "24/06/2022-19:18:02",
                    "content": "    wouter:  So, saying “I’m a mandated actor” as justification for activity in an area that has nothing to do with the mandated role… that would be inappropriate and show a lack of appreciation for that separation of the two roles?   In this situation the “we” Sam was referring to (correct me if I’m wrong @hexonaut) was the mandated actors. We brought up budgetary issues at the last Mandates Actors meeting. No decisions were made but we talked to @Aes about what SF-001’s plan was and broadly agreed to let the signal process play out instead of spending time seeing if we could find informal agreement about a budget cut percentage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.270833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#27",
                    "likes": "1",
                    "time": "24/06/2022-19:30:22",
                    "content": "But the mandate of @hexonaut applies to smart contracts, doesn’t it? And that’s the basis on which MKR holders have voted?     MIP7c3-SP6: Domain Team Onboarding (Smart Contracts Domain Team) Archive       Preamble MIP7c3-SP#: 6 Author(s): Sam MacPherson (@hexonaut) Contributors: Status: Formal Submission (FS) Date Applied: 2020-12-08 Date Ratified: <yyyy-mm-dd> --- Domain Role: Smart Contracts Domain Team Facilitator Proposed Applicant: Sam MacPherson  Application Form Domain Team Introduction  The Smart Contract Domain team has been working on implementing updates to the protocol, onboarding new collateral types, and writing spells to adjust governance approved risk params.  Motivation The DAO d…     Maybe it’s simply time to update that MIP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match the content of the post. It appears to be a discussion about a specific issue related to budget cuts and off-boardings, with a request for a commitment to not honor ad hoc off-boardings."
                    ],
                    "Sentiment": 5.827922077922078
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#28",
                    "likes": "1",
                    "time": "24/06/2022-19:36:18",
                    "content": "This mirrors fairly closely to RL debates over unions and organized labor. Should CUs be able to organize? Collectively bargain for certain actions? Perform strikes and slow-downs in solidarity with other CUs? “CUs should just stay in their own lane” would certainly make things easier for delegates and maker holders, who fill the dual purpose of management and shareholders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.752976190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#29",
                    "likes": "0",
                    "time": "24/06/2022-19:36:36",
                    "content": "I get what you’re saying and, yes, it is trying to find a balance with a lot of grey zones. But it’s not because it’s difficult to draw an exact line that we shouldn’t set any limits at all. In fact, from your post it’s very clear that you yourself have been extremely careful in considering these nuances. So I think it’s only reasonable to ask others to be considerate too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.95
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#30",
                    "likes": "10",
                    "time": "24/06/2022-19:48:48",
                    "content": "I retract the mandated actors comment. I’m acting as a community member with an informally formed group. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#31",
                    "likes": "9",
                    "time": "24/06/2022-20:03:03",
                    "content": "Thank you for this. I will personally appreciate it, and I’m sure I’m not the only one, if the distinction between the two is kept clear in the future too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#32",
                    "likes": "9",
                    "time": "24/06/2022-21:09:02",
                    "content": "    wouter:  In fact, from your post it’s very clear that you yourself have been extremely careful in considering these nuances. So I think it’s only reasonable to ask others to be considerate too.   I think not speaking out due to fear of retribution has been a mistake I’ve made, and I own it. The DAO needs Sam and more people like him. Communication breaks down when we don’t voice ourselves and progress grinds to a halt. This is something none of us want to see. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.655902777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#33",
                    "likes": "4",
                    "time": "24/06/2022-21:24:47",
                    "content": "Appreciate this @tadeo. In my official capacity I am completely neutral, but I believe in speaking up when sub-optimal routes are being taken for Maker. We all want success for Maker, and it’s healthy to debate all the options available. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#34",
                    "likes": "0",
                    "time": "27/06/2022-04:11:42",
                    "content": "17 posts were split to a new topic: A Large Complex DAO: reducing the human footprint ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.063311688311688
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#35",
                    "likes": "4",
                    "time": "24/06/2022-21:59:41",
                    "content": "Difficult to respond here because of the lack of clarity of discussion except to make the following comments. I have seen on-line communities decimated by users having multiple accounts.  Like one malicious actor could use like 3-5 accounts to basically set up some premise, have another vehemently attack, and then the other couple support varying points of view ALL to just to try to get attention to themselves by the community.   These people would purposely pick divisive issues and lay them out in some inflammatory way to satisfy their own ambitions (need for attention, desire to attack the community generally, or ??) The idea that anyone ‘is neutral’ I think is incorrect.  We all have inherent biases and predilections and I find it better when individuals simply come forward with these vs. endeavoring to present this ‘I am neutral’ kind of view.   As soon as I hear this from anyone I want to run because I know they probably are NOT going  to actualy be able to entertain ‘objective views’ because they are already ‘subjectively neutral’. So in reality here there are multiple issues.  Multiple accounts with same users, and this idea of of objective neutrality.  Both of these create numerous obstacles when it comes to communicating effectively, and generally dilute the ability to have constructive dialogue. In the end this is a tricky discussion because one has to not just subjectively disclose our non-neutrality, but then also manage debates and discussions with others who also are non-neutral and decidedly on other sides of important topics.   Healthy vs. unhealthy debate is a real issue, just as healthy vs. unhealthy discussion is. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.557692307692308
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#36",
                    "likes": "4",
                    "time": "24/06/2022-22:11:43",
                    "content": "Okay. Trying to understand clearly. Was the group performing operations and “picking up slack” you operating as a PE mandated actor or informally? There seems to be two things going on:  a group performing ongoing business operations on behalf of makerdao and representing the DAO in transactions, and a group planning a new governance and business structure for Maker.  These groups are composed of seemingly the same people This ops group asked for this privilege and approach be formally codified their role  (task force) and the signs from the DAO so far has been to resoundingly reject that structure and your request. Those activities and that structure should then immediately cease until a different interim structure can be approved. Can you please disclose who this above group is? Is this simply the task force group? Who is different across the task force vs this “informal group” redesigning the DAO structure. As you can imagine, the concern is there is no clear boundary to warrant the claim of it being “informal.” On the other hand, this “informal group” is meeting in private with VCs to put together a vision and business strategy that is not being publicly disclosed or including other relevant core unit members and MKR holders in the process. This is a transparency problem as you can imagine. Unfortunately, it seems like the same people are part of both groups. Hence, the cause for concern. All or most of these parties in the informal group are also contracted as mandated actors by the DAO and engaging collectively in private with no transparency. This activity is allegedly done as informal meetings because of the gross ethical violations it otherwise presents. I think if you can just lay out transparently what has happened and who you are meeting with, why, and when, as well as the substance of the discussions it would help your credibility. Suggesting these meetings are informal, but that they involve cross core unit member coordination, business activity, and are directly relevant to different lines of business and involve only a subset of MKR stakeholders is tenuous at best… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.340067340067341
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#39",
                    "likes": "0",
                    "time": "24/06/2022-22:29:50",
                    "content": "Thanks for questions Andrew. We have a meeting next Thursday to publicly present what we have been working on as I explained in our DMs. This is mostly the group formerly known as the growth task force presenting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#40",
                    "likes": "2",
                    "time": "24/06/2022-22:31:08",
                    "content": "So the growth task force group is still (will still be) operating despite being voted down by MKR holders? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#41",
                    "likes": "0",
                    "time": "24/06/2022-22:36:24",
                    "content": "Yes. I have not seen a MIP that prevents freedom of assembly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#56",
                    "likes": "0",
                    "time": "26/06/2022-12:48:55",
                    "content": "    MadShills:  So the growth task force group is still (will still be) operating despite being voted down by MKR holders?       hexonaut:  Yes. I have not seen a MIP that prevents freedom of assembly.   Could you elaborate a little on your response here @hexonaut? Because this could be interpreted as deliberately going against a majority vote by the community, which I’m sure isn’t your intention. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match. The comment appears to be a discussion about a specific issue related to budget cuts and off-boardings, with a request for a commitment to not honor ad hoc off-boardings."
                    ],
                    "Sentiment": 5.821180555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#57",
                    "likes": "7",
                    "time": "26/06/2022-13:11:31",
                    "content": "Sure. As the MIP is written the growth task force has no special influence because the vote has likely failed. I do not view the failure of the vote from preventing free assembly of like minded individuals in an unofficial capacity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.92063492063492
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#58",
                    "likes": "10",
                    "time": "26/06/2022-15:12:31",
                    "content": "I echo @hexonaut 's response here. As the community is aware, I am against Growth Task Force and questioning and voting against it. However, operating as an initiative that does not use the unauthorized budget is valid. Meaning though the community is likely to vote against Growth Task Force, community members can continue to discuss it as long as they are not using budget from elsewhere (unauthorized spending). In similar logic, Rune’s Endgame plan is not yet passed but just because it’s not passed doesn’t mean community members who are interested in supporting such plan can’t continue to discuss it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.2421875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#59",
                    "likes": "22",
                    "time": "26/06/2022-17:21:37",
                    "content": "(I’m a contributor to the risk core unit and recognized delegate but not a facilitator, not sure where I land with respect to “mandated actor” label. I’m speaking on my own behalf and not representing the views of delegators or the risk core unit) I’d like to share a quick anecdote from recent experience. I’ve been a Cosmos ecosystem enjoyer since early 2021, and deepened my participation after Osmosis DEX launched in June 2021. When DAI bridging to Cosmos became available earlier this year I was the first liquidity provider for both Gravity Bridge and Axelar Bridge DAI in the Cosmos, committing over 20k personal capital along with several thousand in fees for pool deployment. I successfully advocated (in a personal capacity) to add support for DAI pairs to Osmosis router and incentives schemes in the aftermath of Terra UST collapse (when the default course of action was to support just USDC). The OSMO/axlDAI LP now holds over $4 million TVL which is sufficient to make DAI a viable stablecoin and bridge asset within the Cosmos ecosystem. And there is an opportunity to expand DAI support to other platforms like Junoswap and Crescent DEX (which currently only support USDC). I didn’t commit to actions on behalf of MakerDAO, internally discuss with other contributors, or use any Maker resources. But neither did I ask permission from the DAO to engage in discussions with 3rd parties. If MKR holders insist on contributors strictly adhering to narrowly defined mandates and not taking any other initiative to ensure “political neutrality”, I don’t think they will be pleased with the results (missed opportunities and declining market share). It is neither healthy nor sustainable for an organization to demand contributors should be “seen but not heard”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.615530303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#60",
                    "likes": "12",
                    "time": "26/06/2022-19:24:37",
                    "content": "    monet-supply:  I didn’t commit to actions on behalf of MakerDAO, internally discuss with other contributors, or use any Maker resources. But neither did I ask permission from the DAO to engage in discussions with 3rd parties. If MKR holders insist on contributors strictly adhering to narrowly defined mandates and not taking any other initiative to ensure “political neutrality”,   Monet, Thanks for the response here. The point here is that you did not collude and withhold information from the community, other MKR holders, or your peers. You had integrity in your interactions.This is a great point to discuss. Integrity as a Core Hiring Criterion Rather than narrowly define mandates, etc, Maker would be best to have a clear vision and strong leadership at the core unit facilitator level in addition to a system of checks and balances. The facilitators are tasked with hiring talent with strong ethical and moral foundations and the ability to help them deliver on the vision. When deceit happens, trust is weakened. Trust in a decentralized workforce is more important than a centralized workforce, since generally, core units are entrusted with more autonomy and fewer checks and balances than a standard hierarchy. Trust Requires Integrity The primary criticism of this “growth task force group” is that they have been deceitful in their actions. Deceit can come as either telling outright lies, or withholding relevant information. When trust is broken, the damage is often irreparable. The core units are entrusted to act in the best interest of the protocol and MKR holders at large. Yet, a portion of individual contributors colluded to act in what appears to be their own interest and withheld their engagements with large MKR holder from other MKR holders. They also withheld this information from their core unit peers, their core unit facilitators, and from the community at large. Growth Task force: Unofficially Official then turned \"informal community members\" The task force notes above they are operating as a stop gap official operations unit for Maker. After some time, they felt it necessary to disclose their activities beyond their mandates and ask for their new privileges to be explicitly codified and expanded in an MIP. What was not disclosed at that time was that they had been having numerous discussions with large MKR whales to redesign governance and remove checks and balances. They colluded to design and create a new centralized hierarchy that places them in the position of an executive committee, above their peers and possibly to the detriment of MKR holders. Again, this information was withheld from other core units, MKR holders, and the community. When it was clear the task force would be rejected. The narrative changed from the group as an executive operations unit to being “informal” community members. This is again deceit because it fails to acknowledge what they themselves admitted:   their previous and ongoing role as a Maker “operations” unit and their current individual contributor roles which are paid. An individual contributor role comes with expectations of transparency.  (c.f. tweet) You only live once: Integrity or not, you decide. In the end, governance will not be able to defend against those who are willing to violate ethical boundaries for personal gain. This is an unfortunate reality. As Wouter noted above, what we can do is build systems that allow for discourse more openly. This helps to make these violations more clear and hopefully avoid back door centralization.  Right now, the lack of a system allows for plausible deniability, and the ability to claim business discussions are “informal” and need not be disclosed to the community and peers. The community is generally not this gullible. Maker has legs: Why break the ethos that gave it success? Designing appropriate transparent structures can create alleviate the operational inefficiencies that led to centralization. We can avoid the loss of trust within the workforce; we need not slap a centralized hierarchy on a decentralized protocol and call it a day. It would be best to take a long and honest look at the two proposed structures, including the fact that Maker is a decentralized protocol that requires decentralization to maintain its resilience. Many of the core team have been here for a long time, and together with those before them, designed and produced the most resilient project on Ethereum. All of these individuals are geniuses. Maybe we should ask them what centralization or decentralization means for the protocol? It would make sense to move slowly and be weary of a new guard throwing this ethos to the wind in pursuit of short term profit and control. The old guard and ethos has delivered to us the most successful project on Ethereum. What has this other group produced to inspire confidence in their plan to centralize? This is a community. Not a corporation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.8528494531784006
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#61",
                    "likes": "0",
                    "time": "26/09/2022-10:12:02",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}