{
    "poll_list": [
        {
            "title": "Migration Contract Debt Ceiling Adjustment - March 30, 2020",
            "index": "1823",
            "option": "Yes",
            "supporting_mkr": "13,386",
            "highest_fraction": 1.0
        },
        {
            "title": "MKR Oracle Deactivation in SCD - April 20th, 2020",
            "index": "1823",
            "option": "Yes",
            "supporting_mkr": "46,571",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/sequential-process-for-scd-shutdown/1823",
            "title": "Sequential Process for SCD Shutdown ",
            "index": 1823,
            "category": [
                "Governance"
            ],
            "tags": [
                "scd-shutdown"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "13",
                    "time": "27/03/2020-01:40:55",
                    "content": "Hi all, this post explains the sequential process for shutting down Single Collateral Dai. The process involves two executive spells; one to protect MCD and the other to shutdown SCD. I will outline what these steps are and why they are important. As of April the 19th you will notice that the section in (B) Executive Spell 2, now includes updated steps, a timeline and request Governance Vote support. A) Executive Spell 1 - Set the SAI Debt Ceiling to 0 in MCD  This action will protect MCD by preventing SAI from being swapped for DAI. This is necessary to prevent exposing MCD to SAI liquidity and/or peg fluctuations. We will continue to allow DAI to be swapped for SAI. This will allow individuals to push DAI through the Migration Contract to drain it of all the SAI, which will be burnt into ETH at shutdown.  SCD is now isolated from MCD, the Migration Contract has been drained, and SCD can be safely shut down… B) Executive Spell 2 - SCD Global Settlement  The action of calling cage is the final and definitive step to shutting down Single Collateral Dai.   -> New Information: Proposed SCD shutdown steps once the SAI Debt Ceiling has been set to 0: 24th April: Governance community vote on SCD Shutdown. The community has signalled to introduce a ‘pause’ which we are calling the grace period between when this vote passes and the time at which SCD is actually shutdown. This gives the community time to carry out the following steps. 24th April: MKR Oracle is deactivated. Following community approval of the Governance poll (link tbd 20th April), The Oracle Team with their existing mandate will deactivate the individual price feed providers thereby invalidating the MKR price feed. This will have the effect of eliminating the MKR stability fees for all remaining CDPs (more information below). 24th April - 10th May: CDP holders migrate to MCD. This will be possible through the Migration Portal and will not require the payment of stability fees. This will have the positive effect of encouraging people to (1) migrate their CDPs and (2) help reduce the amount of Sai in the migration contract. 10th/11th May: Liquidity providers drain the migration contract. Liquidity providers will work with the Foundation to drain the migration contract, which will involve:  Depositing USDC into MCD to mint enough DAI to cover the remaining balance of SAI in the migration contract This DAI will be converted into SAI which will be deposited into the migration contract The migration contract at 0 will now be unable to introduce unbacked debt into MCD once shutdown occurs  12th May: Actual SCD shutdown occurs. As planned in the SCD shutdown spell, the end of the grace period marks actual SCD shutdown, this is currently scheduled for the 12th of May. Upon which point, SCD will be irreversibly shutdown and one SAI will become fixed to $1 of ETH. Timeline:  SCD Shutdown Steps1069×473 36.5 KB  Supporting Notes: Governance Poll Support for Oracle Deactivation Vote Here By deactivating the MKR Oracle for SCD in order to forgive Stability Fees, it will be necessary to post an active Governance Poll requesting Maker Community support. As can be seen from the above process, the action of deactivating the Oracle will eliminate stability fees and incentivize users to migrate their CDPs. This process helps the community of CDP holders work together to drain the migration contract. The end state for CDP holders migrating is no different than if they had waited for actual shutdown, yet it has the benefit of allowing instant migration, and no need to wait for actual shutdown with the ensuing cool down period (6hrs). It also reduces the burden and exposure of liquidity providers needing to source large amounts of Sai for the migration contract. Implications: There is a risk that unknown ecosystem participants may be using the MKR Oracle feed, in which case deactivating it would disrupt their feed ingestion. We will be doing a blockchain block analysis of who is using the feed as well as reaching out to partners to mitigate this risk as much as possible. SAI Liquidity Providers: In the above, you may have noticed that liquidity providers will be depositing USDC to mint DAI which will be converted into SAI to drain the migration contract. Once shutdown occurs they will be left holding anywhere up to 20k ETH depending on the amount of SAI they needed to purchase. To complete the trade and eliminate exposure on the original USDC position, this ETH will incrementally be wound back into DAI and the original USDC position closed.  SCD has now been globally settled and Sai owners (including the liquidity providers that purchased SAI) can claim their ETH collateral while CDP holders must wait for the cool down period to end… C) Sai Owners Redeem Collateral While Bite Keepers Bite CDPs  Sai owners will be able to immediately redeem their ETH collateral from the Migration App. (Draft UI to be shared in a follow-up post) Bite keepers will be required to bite all CDPs to ensure that the maximum PETH:WETH ratio has been reached before CDP holders claim their collateral. The Migration App will not allow CDP collateral redemption before this time has elapsed. (Please see note below)  Now that the bite keepers have bitten all CDPs and a maximum amount of ETH can be claimed for each unit of PETH that a CDP holds, the CDP holder can now claim their collateral… D) CDP Holders Redeem Collateral  CDP holders can go to the Migration App to redeem their ETH. (Draft UI to be share in follow-up post)  The End - Success! Note: PETH:WETH Ratio - This will be covered in our shutdown guide, however I would like to give it mention here too. Please observe the cool down period before redeeming your collateral - this is currently estimated to be 6hrs yet may be much longer, and will be determined at the time of shutdown as a result of how many outstanding CDPs exist. This waiting period is necessary in order for the system debt to be accounted for by bite keepers, thereby allowing users to receive a maximum amount of WETH for every unit of PETH in their CDP. If they do not wait, the exchange rate may not yet be favourable due to debt in the system. Although the Migrate.makerdao.com site will not allow users to claim their collateral during this cool down period, interacting through the command line will still be possible, so again, users should pay close attention to the PETH:WETH exchange rate applied. Immediate Next Steps A) The Maker Foundation Interim Risk Team and the Interim Oracle Team have placed a Governance Poll into the voting system for the community to signal their support for the Oracle team to deactivate the MKR Oracle in Single Collateral Dai. Link to Governance Poll. ",
                    "links": [
                        "https://daistats.com/#/",
                        "https://forum.makerdao.com/t/signal-request-grace-period-between-when-scd-shutdown-spell-is-scheduled-and-actual-shutdown/1992/5",
                        "https://vote.makerdao.com/polling-proposal/qmfnkvy2nzpjdzmzumzuh1vjqhhrxzdasxk6v4unx1fdhs",
                        "http://migrate.makerdao.com/",
                        "https://vote.makerdao.com/polling-proposal/qmfnkvy2nzpjdzmzumzuh1vjqhhrxzdasxk6v4unx1fdhs",
                        "https://forum.makerdao.com/t/signal-thread-scd-shutdown/1673/65",
                        "https://forum.makerdao.com/t/single-collateral-dai-shutdown-details-and-context/1978",
                        "https://forum.makerdao.com/t/mkr-holder-dai-gest-week-13-2020/1835",
                        "https://forum.makerdao.com/t/mkr-holder-dai-gest-week-19-2020-use-bitcoin-wbtc-to-open-a-vault-on-makerdao/2435",
                        "https://forum.makerdao.com/t/signal-request-grace-period-between-when-scd-shutdown-spell-is-scheduled-and-actual-shutdown/1992/9",
                        "https://forum.makerdao.com/t/mkr-holder-dai-gest-week-17-2020-the-state-of-the-peg/2177",
                        "https://forum.makerdao.com/t/signal-request-grace-period-between-when-scd-shutdown-spell-is-scheduled-and-actual-shutdown/1992",
                        "https://forum.makerdao.com/t/signal-thread-scd-shutdown/1673/53",
                        "https://forum.makerdao.com/t/signal-thread-scd-shutdown/1673",
                        "https://forum.makerdao.com/t/signal-request-grace-period-between-when-scd-shutdown-spell-is-scheduled-and-actual-shutdown/1992/22"
                    ],
                    "GPT-summary": "The post explains the sequential process for shutting down Single Collateral Dai, involving two executive spells. The author outlines the steps and why they are important. The post also includes new information on proposed SCD shutdown steps and a timeline. The post invites feedback and questions from third parties and provides supporting notes. One potential risk is that unknown ecosystem participants may be using the MKR Oracle feed, in which case deactivating it would disrupt their feed ingestion.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Smart contract updates",
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.389699231117142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#2",
                    "likes": "0",
                    "time": "27/03/2020-03:04:34",
                    "content": "    Derek:  We will continue to allow DAI to be swapped for SAI. This will allow individuals to push DAI through the Migration Contract to drain it of all the SAI, which will be burnt into ETH at shutdown.   Does the migration contract need to be completely drained before the cage spell? Or is it fine as long as users cant get DAI with SAI? I am asking because if it doesn’t need to be completely drained then we could potentially do all of this bundled in one executive vote right? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.7103174603174605
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#3",
                    "likes": "1",
                    "time": "27/03/2020-10:36:37",
                    "content": "The Migration Contract does not explicitly need to be drained before cage but if it isn’t drained we may expose ourselves to unbacked debt if the value of ETH goes down (i.e SAI would not be = $1), conversely, if ETH goes up there is an arb opportunity. The reason for the first executive is to ensure SAI is set to 0 in MCD BEFORE caging, it also sends a clear message that SCD is finally - with certainty, shutting down so people should migrate their CDPs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.038888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#4",
                    "likes": "0",
                    "time": "27/03/2020-14:34:27",
                    "content": "Thank you, great info!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#5",
                    "likes": "0",
                    "time": "27/03/2020-15:25:24",
                    "content": "I think a couple points here. Precursor to step A not mentioned is that SCD DC should go from $20M to $15M.   Then Step A)  Setting SAI DC to 0 to MCD.  Realize by nature of both these actions this will begin a liquidity crunch on SAI to drive the PEG up.   Literally there will be nothing we can do about this.    The question will then be how far does the community allow the PEG to move before we execute step B. The other issue here is that the DAI/SAI in migration contract will have to undergo settlement.  SAI exchanged for ETH and ETH sold for DAI to cover the migration contract DAI.   I honestly would like to have an idea on hand before we do Step A) on who is going to take this on or how the community is going to deal with it?   We don’t want to be figuring this part out before we do step A) Another point I DO NOT like the idea that people can in step C) claiming collateral using command line tools.  This seems to create a disconnect in terms of access.   Now if this means people will end up losing if they access early ok, fine, but if they gain advantage we need to mitigate this imo.   Probably someone will have to watch on-chain tx’s to determine if we need to move faster on opening up redemptions to all step D).  I think this means we need to do this in a rising vs. falling market.  We need all auctions cleared which again is why we should not allow people to open new CDPs here.  (see precursor to step A) SCD DC from 20M to 15M. Regarding fees and incentives to take on the migration contract DAI.  I heard that governance can change the GS OSM price on ETH and mint SAI.   Wouldn’t the way to apply a tax across the board is to change the OSM price down by the tax% and mint corresponding SAI in effect diluting SAI or is there some mechanism for only allowing 1-tax% to be the SAI value for redemptions against collateral? My point here is that using something like above tools might be the final move (even if talking about how to do this) to get people out of CDPs.  We could then open up a deposit facility for people than want to deposit SAI to drain DAI from the migration contract for a piece of the fee from the above move. I am just thinking out loud here to try to kill multiple problems with one set of actions.  Not for Maker to collect fees (which would be nice) but for how to extract them from the system to deal with the lagging issues and use the funds to incentivize actors to take on the migration contract risk by depositing SAI in another contract so this can all be tracked… Anyway I am back to my precursor to step A)   SCD DC from 20M-15M as the first step. One last thing Derek. Thank you for putting this all together! Having steps helps a lot and I really wished I understood the PETH/WETH equations better because I like the idea of collecting fees but then distributing them to incentivize actors to close out things and use them to buffer unforseen ‘expenses’ that may appear here.  Anything left over we can give back to CDP holders or just use to burn MKR as the fee for everything…  Heck we could use the ETH as the beginning of a fund to compensate people for Black Thursday so perhaps this SAI in the migraction contract might find some real use after all.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6261169386169385
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#6",
                    "likes": "0",
                    "time": "27/03/2020-20:52:55",
                    "content": "    MakerMan:  We need all auctions cleared which again is why we should not allow people to open new CDPs her   Just gonna point out that In SCD there aren’t auctions. Keepers bite collateral at a discount which I am preeetty sure is 3% atm, but I couldn’t verify that number right now with some brief research. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.922077922077921
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#7",
                    "likes": "0",
                    "time": "28/03/2020-12:07:32",
                    "content": "Thanks @MakerMan for your comments,   Good point, I definitely agree a precursor is for the SCD DC to be reduced as soon as possible to reduce additional exposure. Similarly, yes, we need better clarity on who will help drain the migration contract.   If an individual chooses to redeem collateral via a CLI there is no negative impact to people who are only redeeming via the UI. If there is still debt in the system, then the first person redeeming would be at a disadvantage because their unit of PETH would be worth less ETH until system debt that impacts that exchange rate has been cleared.   It’s probably not a good precedent for Governance to set any Oracle price other than the price at the time of shutdown. I need to ponder this some more, but essentially you’re saying to create an arbitrage opportunity for DAI holders to purchase SAI.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8217592592592595
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#8",
                    "likes": "0",
                    "time": "28/03/2020-17:05:07",
                    "content": "I think a safe first move while we are polling on this is to do the SCD DC 20-15M.   I have been harping on this for a while and unless @cyrus or @vishesh anyone has a cogent argument for why NOT to do it we should just get this first step done. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#9",
                    "likes": "0",
                    "time": "28/03/2020-19:15:37",
                    "content": "    MakerMan:  I think a safe first move while we are polling on this is to do the SCD DC 20-15M   I agree. I didn’t hear any argument against it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#10",
                    "likes": "0",
                    "time": "28/03/2020-21:35:14",
                    "content": "We tried to get it done weeks back but the executive never passed. Definitely will be going into this weeks polling. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#11",
                    "likes": "1",
                    "time": "07/04/2020-03:11:18",
                    "content": "The current executive vote is starting to look like it isn’t going to pass.  Current vote: https://vote.makerdao.com/executive-proposal/adjust-multiple-risk-parameters  Current Hat: https://mkrgov.science/executive/0x64976c5b5062c56d91dafe661cb85dcf7e349c9d   Curious what is next for this plan if step A fails. What do we do now that we have decided to end SCD at the end of this month? ",
                    "links": [
                        "https://mkrgov.science/executive/0x64976c5b5062c56d91dafe661cb85dcf7e349c9d",
                        "https://vote.makerdao.com/polling-proposal/qmb8d1use4uzsgpjf3tbmnqfnvq1bf1mcifzlabnp58cjw"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.571428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#12",
                    "likes": "1",
                    "time": "07/04/2020-08:40:28",
                    "content": "Tempted to say we should separate SCD shutdown executives from the others. That comes with it’s own problems though. I kind of wish that the shutdown poll had been phrased such that it was an aim rather than a certainty. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#13",
                    "likes": "0",
                    "time": "07/04/2020-19:07:45",
                    "content": "    LongForWisdom:  Tempted to say we should separate SCD shutdown executives from the others.   This. I didn’t vote for the proposal although I support the SCD shutdown. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#14",
                    "likes": "1",
                    "time": "14/04/2020-01:28:19",
                    "content": "SAI has returned to $1, but DAI has not. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#15",
                    "likes": "0",
                    "time": "17/04/2020-01:14:24",
                    "content": "This is no-longer true. SAI is priced in-between DAI and USDC at this moment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#16",
                    "likes": "7",
                    "time": "19/04/2020-20:41:52",
                    "content": "Hi everyone, over the past week we have been investigating various opportunities for draining the migration contract as we approach SCD shutdown. These have included; working with liquidity providers, exploring protocol changes as well as working with existing CDP and Vault holders. In this post, which I have appended to the opening post under B) Executive Spell 2, I will propose a solution through a set of steps; including deactivating the SCD MKR Oracle, implementing a grace period for people to migrate, and sourcing DAI to drain the migration contract in time to shutdown SCD. As detailed above, the next steps involve the Maker Foundation Interim Risk Team and the Interim Oracle Team placing a Governance Poll into the voting system on Monday 20th April, for the community to signal their support for the Oracle team to deactivate the MKR Oracle in Single Collateral Dai. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0561224489795915
                },
                {
                    "author_link": "https://forum.makerdao.com/u/marcandu",
                    "index": "#17",
                    "likes": "0",
                    "time": "23/04/2020-17:31:58",
                    "content": "Is there a time set for the SCD shutdown on May 12th? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#18",
                    "likes": "2",
                    "time": "23/04/2020-18:26:48",
                    "content": "Yes, executing cage for actual shutdown will be 16:00 UTC on May the 12th. (FYI: The executive spell timing is being managed by a mini contract in the 24th of April’s executive spell aptly called SaiSlayer which will be assigned as the owner of the SaiTop contract to cage SCD) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#19",
                    "likes": "0",
                    "time": "24/04/2020-02:08:03",
                    "content": "How does the SaiSlayer calculate the cage price? Can you link to the contract or the code? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/galabasquer",
                    "index": "#20",
                    "likes": "1",
                    "time": "24/04/2020-14:29:44",
                    "content": "The price will come from the oracle feed. This is the code: contract SaiSlayer {     uint256 constant public T2020_05_12_1600UTC = 1589299200;     SaiTopAbstract constant public SAITOP = SaiTopAbstract(0x9b0ccf7C8994E19F39b2B4CF708e0A7DF65fA8a3);      function cage() public {         require(now >= T2020_05_12_1600UTC);         SAITOP.cage();     } } ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/martinkrung",
                    "index": "#21",
                    "likes": "0",
                    "time": "25/04/2020-09:33:42",
                    "content": " SCD has now been globally settled and Sai owners (including the liquidity providers that purchased SAI) can claim their ETH collateral while CDP holders must wait for the cool down period to end…  Where to claim my ETH for my SAI? Is there a tool? Or via CL? Any hint how to do this? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.324074074074074
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#22",
                    "likes": "0",
                    "time": "25/04/2020-09:52:53",
                    "content": "Pending the current governance vote, it will be possible to claim ETH for Sai from the Migration Portal after 16:00 on May the 12th. This will be visible once the system is ‘caged’ aka shutdown. https://migrate.makerdao.com/ If you want to exchange Sai for another cryptocurrency before then you could visit other well known decentralised exchanges such as uniswap, kyberswap or 1inch. I would advise not to use any sites claiming to be Maker branded. The above migrate site is the only site Maker is maintaining for this migration. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.895833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/martinkrung",
                    "index": "#23",
                    "likes": "0",
                    "time": "25/04/2020-10:00:42",
                    "content": "Thanks for this quick answer. At which time the SAI/ETH rate is set? Is the rate from today? Or the Rate from 12 May? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#24",
                    "likes": "3",
                    "time": "25/04/2020-10:03:17",
                    "content": "It will be the rate on the 12th. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek98",
                    "index": "#25",
                    "likes": "1",
                    "time": "27/04/2020-20:44:01",
                    "content": "24th April - 10th May: CDP holders migrate to MCD But actually is no longer possible (https://migrate.makerdao.com/). So I have to keep waiting and what would happen on 12th May? Paying 9% fee and get my ETH back? Or to claim as a MCD? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#26",
                    "likes": "0",
                    "time": "28/04/2020-07:48:07",
                    "content": "Hi @Derek98, you will need to keep your CDP collateralized and wait until the 12th of May when the system is actually shutdown to claim your ETH. On shutdown all stability fees are forgiven but again be cautious to maintain collateralization as per usual. Because the system is now approaching shutdown there is no more migrating to MCD, meaning that users will be able to claim their ETH. The reason for not being able to use the migration contract as intended was that over the weekend one of the large CDP holders migrated their CDP and drained the migration contract, which means that it is no longer possible to migrate using that mechanism. Therefore we must wait until the 12th which is the date determined by the community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.446428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#27",
                    "likes": "0",
                    "time": "29/04/2020-07:14:03",
                    "content": "Hi @Derek, as I mentioned on the other thread here, by having the final settlement price based on ONLY one specific time (16:00 UTC on May 12th) will put our CDP holders into an extremely vulnerable situation if no other options to help them to migrate before the shutdown. Please be cautious, and don’t make this big mistake!  Anyone with some basic finance knowledge can tell the risk of this settlement method.  We should try our best to protect the loyal and long term supporters of the MakerDAO project, not to facilitate the “whales” to slaughter the helpless CAGED loyal supporters.   Thank you for your attention!!  @LongForWisdom ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.517361111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#28",
                    "likes": "2",
                    "time": "29/04/2020-11:42:37",
                    "content": "    1bit:  having the final settlement price based on ONLY one specific time (16:00 UTC on May 12th)   The oracle is resistant to attacks. Much of DeFi depends upon it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#29",
                    "likes": "0",
                    "time": "30/04/2020-05:16:48",
                    "content": "Hi, you misunderstood my point.  I was not saying the someone will attack the oracle directly, but by manipulating the market in general during this specific time, so the price source from the oracle still get affected.  This is an obvious loophole in term of finance.  It has nothing to do with the robustness of the underlying tech of the oracle. Longer the pricing period, harder to manipulate…shorter the pricing period, the easier… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.05
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#30",
                    "likes": "1",
                    "time": "30/04/2020-05:20:59",
                    "content": "    1bit:  I was not saying the someone will attack the oracle directly, but by manipulating the market in general during this specific time   It would take a lot of money to manipulate the ETH price for even 5 minutes. You would probably lose more than the market cap of SAI doing that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#31",
                    "likes": "0",
                    "time": "30/04/2020-05:39:54",
                    "content": "There were many instances in the Maker history that whales utilized some “weakness” of the system to take advantage for their own financial gains.  Please don’t need to underestimate their abilities.  If the team can do something to prevent this in advance, why not?  I just wanted to explore if you can make the pricing period longer to mitigate some potential risks.  This is just my common instinct/alert I have after years of working in the financial market.  I hope that I am wrong about this…otherwise, this will drain the Maker reputation further down… Please do reconsider.  Peace! @MakerMan. @Derek ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek98",
                    "index": "#32",
                    "likes": "1",
                    "time": "30/04/2020-14:16:02",
                    "content": "Thanks for your explanation. But I don’t know much about what’s happenning. Could you please tell me what’s my better solution:  Keep waiting until May 12th, and to get my ETH back. Get my ETH back via CDP right now.  Another question: On May 12th, will the smart contract sends my ETH derectly to my wallet, or I get it back from CDP manually? @Derek ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#33",
                    "likes": "0",
                    "time": "30/04/2020-14:47:48",
                    "content": "Hi @Derek98 I can’t give you specific advice because it depends on your individual circumstances (level of debt, if you want to wait, etc), however some helpful info: The only way to get your ETH back today is to source the Sai on the open market to close out your CDP debt (this would automatically allow you to send your ETH back to your wallet as a result). Now, if you happen to have too much Sai debt that makes it difficult to source and pay off, then the only option is to wait until the 12th. So, if it isn’t too expensive to source the Sai today then it would be ideal to close your CDP and get your ETH so you don’t have to wait for the cooldown period. But, if you can’t do that, then, as above, you will have to wait for the 12th. On May the 12th it will not be automatic, you will have to go to the migration portal as described in this forum post ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek98",
                    "index": "#34",
                    "likes": "0",
                    "time": "30/04/2020-16:04:29",
                    "content": "Very nice reply. Thank you very much! Is MCD safe now? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.675000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#35",
                    "likes": "0",
                    "time": "30/04/2020-18:18:34",
                    "content": "Yes, absolutely. Furthermore, I’d recommend reading about our Multi-Collateral DAI (MCD) Security to learn more about the audits, bug bounties and formal verification that go into securing the Maker protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fahed_Correa",
                    "index": "#36",
                    "likes": "0",
                    "time": "30/04/2020-20:21:20",
                    "content": "Off topic, im having a problem with Exchange Kraken. Someone has send me some Sai to my Dai address ( i though that person will send dai and not sai other wise i would send it to my wallet) but kraken dont accept sai anymore but still under their contract. What would happen to the sai that exchanges has on the shut down? I have a ticket support open but no one has fix it yet. I think kraken is waiting to the shutdown to do something with the Sai they have.  Sorry of this is off topic ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.919444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#37",
                    "likes": "1",
                    "time": "01/05/2020-02:20:15",
                    "content": "    Fahed_Correa:  What would happen to the sai that exchanges has on the shut down?   It remains credited to them. They can redeem it for WETH any time after cage, at the caged rate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chaser",
                    "index": "#38",
                    "likes": "0",
                    "time": "01/05/2020-02:22:31",
                    "content": "    Derek:  Bite keepers will be required to bite all CDPs to ensure that the maximum PETH:WETH ratio has been reached before CDP holders claim their collateral.   Will these bites levy a liquidation penalty? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#39",
                    "likes": "0",
                    "time": "01/05/2020-03:40:26",
                    "content": "These are all good questions.  Either way, all CDP owners will be screwed unless the Maker Team willing to help out by adding more SAI to the Migration Contract before the shutdown. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.416666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#40",
                    "likes": "1",
                    "time": "01/05/2020-12:36:56",
                    "content": "Hi @chaser these bites do not levy a liquidation penalty. The CDP holder will be returned their ETH minus their debt. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#41",
                    "likes": "0",
                    "time": "01/05/2020-14:49:16",
                    "content": "As I mentioned from the other thread, the CDP owners are pretty screwed.  Actually, the SAI owners are facing the same risks (opposite) at settlement as well. This is the main reason that I urgently hope that the Maker team can find a better and liquid way to help the CDP owners and SAI owners to exchange SAIs in a not-insanely-riff-off way (the markups for both sides can be ranged from 30% to over 100% for a 50k SAI trades). A  — Now, the final shutdown is determined to be on May 12th, 2020, and CDP owners only have two options:  1)  just wait for the shutdown and do nothing now;  2)  get SAI to pay down the debt and close the CDP before the shutdown. Both options are lethal for the CDP holders because  option 1)  can lead them to face huge potential market risk (if ETH price drops to an unacceptable level, they still need to (get forced) sell their ETHs from the contract collateral at shutdown), on top of potential getting liquidated (if ETH price crashes again) even before the shutdown. And  option 2)  forces the already financially wounded CDP holders to obtain SAI now with insanely markups (based on current market condition). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.065586419753086
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#42",
                    "likes": "6",
                    "time": "01/05/2020-15:10:01",
                    "content": "    1bit:  This is the main reason that I urgently hope that the Maker team can find a better and liquid way to help the CDP owners and SAI owners to exchange SAIs in a not-insanely-riff-off way   They did that 5 months ago. It was called migration, now it’s finished. No one forced you to wait out the migration period. That was the most user friendly solution, and it was available for anyone to use for months. The fallback options you described are less user friendly, but they aren’t ‘lethal’ or ‘insanely-rip-off.’ If you want to close manually, buy SAI in smaller amounts from a variety of DEX’s so you don’t pay 30% markups. There is not enough liquidity for you to trade 50K in one go without facing severe slippage (as you’ve noted) so the solution is to trade in smaller chunks. If you want to wait until shutdown, then your position will be closed at market price. Sure maybe this is undesirable for you, but that was why there was a migration period. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.865384615384616
                },
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#43",
                    "likes": "0",
                    "time": "02/05/2020-04:45:38",
                    "content": "Copy from my post on Risk thread. Please stop bullying the loyal and early MakerDAO supporters.  I have been communicating with you guys nicely, and you should understand how much stress that some of the CDP owners have now.  Can you try to think of putting yourself in the position of the CDP 3088 owner now?  Although i don’t know who 3088 is, but I sure feel his/her/their pain at the moment…be safe and well.  PEACE! Most of the current top SCD (  CDP  ) owners are the loyal and early supporters of MakerDAO as they first created those CDPs about two years ago when ETH was above $300. Most of them were long term bullish on ETH and MKR, so they were willing to deal with the short term market volatilites and prepared to swallow the ridiculous expensive “Stability Fees” (SF) because they believed that they would be able to pay back all the debt + SF when the market goes back up in the future. All they needed was just more time for the market to be recovered because they believed in ETH and MakerDAO. These warriors barely survived from getting liquidated due to the last couple market crashes. The CDP holders were pretty exhausted and financially wounded after long time fighting with the “Whales” and dealing with security issues of this new technology. [  STOP KEEP SAYING THAT “They had couple months of time to migrate”!  ] And it was like the light at the end of the tunnel when the forgiven SF for SCD > MCD migration news was out last week, but unfortunately, the good news didn’t last too long as the migration was no longer available after couple days due to limited SAI supply in contract. Speaking of frustration! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.675549044451484
                },
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#44",
                    "likes": "0",
                    "time": "02/05/2020-04:49:54",
                    "content": "Pasting the whole post here, in case people are too lazy to click the Link above. Most of the current top SCD (  CDP  ) owners are the loyal and early supporters of MakerDAO as they first created those CDPs about two years ago when ETH was above $300. Most of them were long term bullish on ETH and MKR, so they were willing to deal with the short term market volatilites and prepared to swallow the ridiculous expensive “Stability Fees” (SF) because they believed that they would be able to pay back all the debt + SF when the market goes back up in the future. All they needed was just more time for the market to be recovered because they believed in ETH and MakerDAO. These warriors barely survived from getting liquidated due to the last couple market crashes. The CDP holders were pretty exhausted and financially wounded after long time fighting with the “Whales” and dealing with security issues of this new technology. [  STOP KEEP SAYING THAT “They had couple months of time to migrate”!  ] And it was like the light at the end of the tunnel when the forgiven SF for SCD > MCD migration news was out last week, but unfortunately, the good news didn’t last too long as the migration was no longer available after couple days due to limited SAI supply in contract. Speaking of frustration! A  — Now, the final shutdown is determined to be on May 12th, 2020, and CDP owners only have two options:  1)  just wait for the shutdown and do nothing now;  2)  get SAI to pay down the debt and close the CDP before the shutdown. Both options are lethal for the CDP holders because  option 1)  can lead them to face huge potential market risk (if ETH price drops to an unacceptable level, they still need to (get forced) sell their ETHs from the contract collateral at shutdown), on top of potential getting liquidated (if ETH price crashes again) even before the shutdown. And  option 2)  forces the already financially wounded CDP holders to obtain SAI now with insanely markups (based on current market condition). B  — In addition to the risks mentioned above, is the timing of the shutdown. It is scheduled (voted) for  16:00 UTC on May 12th  , and this is just about  3 hours after the Bitcoin Halving  (as expected now). Can’t even tell if this timing is just being coincident or plotted. Regardless, this just adds extra risks to the community as people have been discussing about potential market crash right after the halving (though no one really knows the truth until that time, but why gamble with the loyal CDP holder’s valuable asset?). Plus, the final settlement price will be just based on one snap shot at 16:00 UTC on May 12th, and it will provide an easier way for whales to manipulate the market for their own gains (if they want to). This has nothing to do with the robustness of the pricing oracle, because the pricing period is just too short, and too risky for CDP holders (and SAI owners as well). You don’t need to be a finance expert to understand this. C  — Due to many previous CDP liquidating incidences, there are already rumours flying around that the MakerDAO team has been associated with whales to “slaughter” the CDP owners, who are the loyal and long term supporters of this project. And I don’t think it is true at all, can be just a perception. This will further damage the MakerDAO reputation for sure. Not even mentioning about the extra stress adding to people on top the current Coronavirus situation that we are all facing now. D  — With all of the above concerns, I sincerely hope that the MakerDAO team will reconsider the followings to mitigate all of the potentials risks:  Work with SAI liquidity providers to add more SAIs back to the Migration Contract to help CDP holders to make a more smooth and less risk migration to MCD Vaults. If impossible to accomplish item 1) above, then at least to work with SAI liquidity providers to provide a  more fair SAI markets  for CDP owners to obtain SAI to close their CDPs properly before shutdown, but not to take advantage of the poor long term supporters. Adjust the final shutdown date/time to avoid the potential market turbulence (3 hours after Bitcoin Halving), maybe one day before or a week later can be better. Expand the shutdown final settlement pricing period. A 48-hour or 24-hour average price will be ideal, but just a snap shot at 16:00 UTC will impose huge market risk as mentioned in “ paragraph B ” above.  We understand that the team has been dealing with lots of stresses from different parts of this project on the top of the health crisis that we are all facing around the world now. I believe that you can do all of the 4 items stated in  paragraph D  above, and manage to help the community to make a smooth transition. Let’s do something before it is too late. And I thank you all for your hard works and contributions to the crypto community!! Stay safe and well.  THANK YOU!! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.486560151550869
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#45",
                    "likes": "9",
                    "time": "02/05/2020-18:55:31",
                    "content": "    1bit:  Can you try to think of putting yourself in the position of the CDP 3088 owner now? Although i don’t know who 3088 is, but I sure feel his/her/their pain at the moment   CDP 3088 basically played chicken with Maker governance to avoid having to pay stability fees. They succeeded in having their fees waived, so I don’t feel any pain for them at all to be honest ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#46",
                    "likes": "2",
                    "time": "02/05/2020-22:25:12",
                    "content": "If i read your post correctly, you lost money and now you are additionally stressing how could things go wrong further. It likely won’t. CDP owners are long on eth, why would they suddenly change their position. I don’t find your arguments convincing, plus cdp owners had 5 months to voice their opinion on this forum. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.958333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#47",
                    "likes": "4",
                    "time": "03/05/2020-13:42:26",
                    "content": "Why do you keep ignoring the fact that CDP 3088 has been given a gift worth close to a million dollars in forgiven stability fees?  Surely this is more valuable than any of the risks you are describing, ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek98",
                    "index": "#48",
                    "likes": "0",
                    "time": "07/05/2020-16:48:21",
                    "content": "I’ve noticed that you’d repeated some good points again and again. I think you’re right. Personally, I signed a contract, and now the contract is tore up and actually I lost some really money. It’s absolutely a bad story. I can understand there’re some bad things (not just one) happened and SCD need a solution. To be honest, not much time to think about what might be the best solution. Cause I have a big challenge. My team is trying to develop a platform(DAism.io) for creation and development of DAO. The future is much better. Best wishes for all of you! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.994897959183674
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#49",
                    "likes": "3",
                    "time": "08/05/2020-01:21:08",
                    "content": "    Derek98:  Personally, I signed a contract, and now the contract is tore up and actually I lost some really money.   The only party who loses money from shutdown is MKR holders, because of the forgiven interest. Shutdown converts SAI from being pegged to USD to being pegged to ETH, and neither SAI holders nor CDP holders are taking an immediate loss. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.9
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chaser",
                    "index": "#50",
                    "likes": "0",
                    "time": "08/05/2020-07:58:38",
                    "content": "A few more questions:  How can people run bite keepers for this event? I guess the answer is no, but is there a capital requirement as with regular bites? Is there any boom/bust spread?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#51",
                    "likes": "0",
                    "time": "08/05/2020-08:13:27",
                    "content": "    Derek98:  Personally, I signed a contract, and now the contract is tore up and actually I lost some really money.   That because you need update with Metamask or your browser, this is sure. The best way to do this, is to uninstall completely the wallet, reinstall it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#52",
                    "likes": "0",
                    "time": "08/05/2020-08:15:30",
                    "content": "We do not make your transaction, everyone is responsible for his related activities with his crypto and wallet.  If you seek some help, we can do this, but prior to this, make sure you have the lastest version, and try with a well updated browser, use Edge if possible. not chrome. In years and years, Metamask as example, is and have always been running great. If you have transaction in suspension or that is looping , do the step i did recommend and it will work. You can’t really lose, the transaction is visible on the blockchain., always. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek98",
                    "index": "#53",
                    "likes": "0",
                    "time": "08/05/2020-16:37:41",
                    "content": "I’m not talking about transaction. It is a contract which is going to be shut down. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#54",
                    "likes": "0",
                    "time": "12/05/2020-16:03:26",
                    "content": "It is done ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#57",
                    "likes": "2",
                    "time": "12/05/2020-16:51:36",
                    "content": "    Sequential Process for SCD Shutdown Governance       I have borrowed 64574.669 SAI, totally 906.234 ETH with 265.514% pool. Could you please tell me how much I can get back? And how to get back?     ETH back = 906.234 - (64574.669 / $189.2) = 564.93 ETH I think that’s how you do the math. You can check the first post for updates, I think you first need to wait for the cool down period to finish. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match. The comment is not related to the post's content and does not provide feedback or questions about the proposal."
                    ],
                    "Sentiment": 5.496913580246914
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek98",
                    "index": "#58",
                    "likes": "0",
                    "time": "12/05/2020-17:49:21",
                    "content": "Yes, the reason made me confusing is that I’d not known there’s a cool down period. It showed a wrong number. I have tried to shut down CDP but failed. Looks like the gas is pretty high. I actually set it up to 26 gwei…Scary. Also looks like I can withdraw. Withdraw or shut down, what’s a little bit cheaper/easier? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.4571969696969695
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#59",
                    "likes": "0",
                    "time": "12/05/2020-18:07:53",
                    "content": "You have to wait for the cooldown period, as of right now that is 4hrs remaining. Then migrate your CDP on https://migrate.makerdao.com ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek98",
                    "index": "#60",
                    "likes": "1",
                    "time": "13/05/2020-09:02:22",
                    "content": "@wjmelements Thanks guys! I’ve finished my handy migration. MakeDAO is abosolutely a great project, though it’s started when there’s no fundalmental support in Blockchain for any DAO. My team have worked for this kind of solution near a year. And we had development some wonderful demos (published its descriptions on DAism.io and NaturalDAO.io) and recently we are going out of our lab. Just wish we could have a chance to collaborate in the future. Ethereum’s TPS theoretically reaches up to 2000 after the Istanbul. But in fact it’s quickly dropped as low as 10! There’re so many smart contracts running that makes this blockage. I think it’s a hard time for Dapps and might last for a long time. So good luck MakerDAO! ",
                    "links": [
                        "http://NaturalDAO.io"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party wanting to collaborate on proposal",
                        "3rd party giving positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.450280112044818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amadeobrands",
                    "index": "#61",
                    "likes": "2",
                    "time": "19/05/2020-12:26:00",
                    "content": "It is interesting to see what happens here … I forgot I still had a small amount of PETH locked. As you can see due to an ETH price increase the price went up … 698×569 13.4 KB ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.208333333333334
                }
            ]
        }
    ],
    "group_index": "1806"
}