{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/coverage-against-black-swan-event-risk-of-depeg/14394",
            "title": "Coverage against black swan event (risk of depeg) ",
            "index": 14394,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Octavenotpunk",
                    "index": "#1",
                    "likes": "0",
                    "time": "02/04/2022-09:25:05",
                    "content": "Hello, After reading a few threads discussing whether or not to purchase insurance coverage from Nexus Mutual with pros and cons. I wanted to bounce off some of the sound arguments mentioned and think about coverage that fits those needs.  Some people mentioned that they were not sure if Nexus would reimburse Maker if an event occurred because the claim process is discretionary  Couldn’t we set up parametric insurance contracts where the payout is determined by the output of some oracle? One of the purposes of a smart contract exploitation in MakerDAO or an economic problem (reduction of collateralization, bank run, liquidity run) would result in a destabilization of the DAI or even a Depeg in the most concrete cases.  Others pointed out that hedging was expensive and that the expected value was negative  This point is true. However, the economic utility of insurance is justified by the fact that it can pay for extreme events that a person or entity could not have absorbed alone (or much less well)  Isn’t the size of MakerDAO and DAI relative to the size of a web3 insurer a sign that insurance can only pay for a tiny fraction of black swan events?  Indeed, with Nexus, we have seen that the coverage of 12M USD only covered a part of the losses during extreme events. Wouldn’t it be wise to let the users of the protocol (instead of the protocol itself) cover themselves against extreme events? If not, how do we cover ourselves against blackswan events?  A post by deejbarraza described insurance in three buckets: 1) Self-insurance (equity tranche) 2) liquidity pool (mezzanine tranche) 3) third party cover (remote risk - senior tranche)  I agree 100% with this vision of risk management and the fact that a third party insurer should only focus on the most senior and extreme risks. The depeg of a collateral or of the DAI itself is for me the main (if not only) manifestation of this extreme risk. Would it be wise for the users directly or for the DAO to hedge against the depeg of the DAI or of certain collaterals (USDC, stETH) in order to protect against black swan events? Which points am I missing and what are the principal drawbacks of these coverage mechanism ? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.305294486215539
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "0",
                    "time": "03/04/2022-00:16:23",
                    "content": "    Octavenotpunk:  Couldn’t we set up parametric insurance contracts where the payout is determined by the output of some oracle?   As Maker itself doesn’t have an insurance product, I believe Nexus Mutual community itself would be a good place to explore such questions. There are some projects like Solace that do work on such based on blockchain data.     Octavenotpunk:  Wouldn’t it be wise to let the users of the protocol (instead of the protocol itself) cover themselves against extreme events? If not, how do we cover ourselves against blackswan events?   Maker users who want to insure themselves can do so via various methods including Nexus Mutual.     Octavenotpunk:  Would it be wise for the users directly or for the DAO to hedge against the depeg of the DAI or of certain collaterals (USDC, stETH) in order to protect against black swan events?   For users, if they want to once again can buy insurance or Stablecoin futures contract to hedge against it. It wouldn’t be so wise for the DAO itself to engage in such because   We saw insurance projects themselves get hacked like inSure and Cover Protocol and while not the protocol itself, CEO of Nexus Mutual got hacked.   In case if the Maker gets hacked or peg is completely broken, the likelihood of a company able to actually pay out is not likely especially if it requires over $100 million+ in extreme cases. Of course, it’s possible to cover only a portion and in exchange, the payout will be also more reasonable but then considering there are over 10 billion Dai, it would be a tiny coverage for the DAO.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7603519668737055
                }
            ]
        }
    ]
}