{
    "poll_list": [
        {
            "title": "Ratification Poll for Onboard-Amend Keeper Network - Gelato Network (MIP63c4-SP3) - March 14, 2022",
            "index": "12749",
            "option": "Yes",
            "supporting_mkr": "79,134",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip63c4-sp3-onboard-amend-keeper-network-gelato-network/12749",
            "title": "MIP63c4-SP3: Onboard/Amend Keeper Network - Gelato Network ",
            "index": 12749,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "keeper",
                "mips",
                "mip63",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "6",
                    "time": "20/01/2022-14:12:48",
                    "content": " MIP63c4-SP3: Onboard/Amend Keeper Network  Preamble MIP63c4-SP#: 3 Title: Onboard/Amend Keeper Network - Gelato Network Author(s): Sam MacPherson (@hexonaut), Hilmar Orth (@hilmarx) Contributors: Tags: keeper-network Status: Accepted Date Proposed: 2022-01-20 Date Ratified: 2022-03-28 Ratification Poll URL: https://vote.makerdao.com/polling/QmTnVxAL?network=mainnet#poll-detail Forum URL: https://forum.makerdao.com/t/mip63c4-sp3-onboard-amend-keeper-network-gelato-network/12749   Specification   Name: Gelato Network  Short Name: GELATO  Website: https://app.gelato.network/   Requested Budget: 1,000 DAI / day  Requested Buffer Min: 4,000 DAI  Requested Buffer Max: 20,000 DAI  Chain: All  Address to Stream DAI to: 0x926c21602fec84d6d0fa6450b40edba595b5c6e4    Network Description Gelato Network is Web3’s automation network, enabling developers to automate a wide variety of arbitrary smart contract executions on and across all EVM-based compatible blockchains such as Ethereum. Examples of use cases developers have built on top of Gelato include Limit Orders on AMMs like Uniswap, automatic compounding of yield farming vaults, Aave liquidation protection, automated liquidity management, and even the petting of Aavegotchis.  Expected Coverage  ALL  ",
                    "links": [
                        "https://etherscan.io/address/0x926c21602fec84d6d0fa6450b40edba595b5c6e4",
                        "https://forum.makerdao.com/t/governance-and-risk-184-thursday-march-31-17-00-utc/14314/2",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/43",
                        "https://forum.makerdao.com/t/protocol-engineering-month-in-review-january-2022/13202"
                    ],
                    "GPT-summary": "The post is a proposal titled \"MIP63c4-SP3: Onboard/Amend Keeper Network - Gelato Network\" that explains the Gelato Network and its requested budget, buffer, and address to stream DAI to. The proposal has been accepted and ratified, and the post provides links to the ratification poll and forum discussion. The post also briefly describes the Gelato Network's capabilities and expected coverage.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.571428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hilmarx",
                    "index": "#2",
                    "likes": "5",
                    "time": "28/01/2022-09:02:25",
                    "content": "Happy to be supporting the MakerDAO ecosystem further  ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-76/13493",
                        "https://forum.makerdao.com/t/weekly-mips-update-75/13330",
                        "https://forum.makerdao.com/t/weekly-mips-update-74/13234",
                        "https://forum.makerdao.com/t/weekly-mips-update-73/13092",
                        "https://forum.makerdao.com/t/weekly-mips-update-72/12945"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "0",
                    "time": "16/03/2022-17:06:36",
                    "content": "Can you elaborate on how the increase helps the Maker protocol (or hurts the system if not funded)? Also, should we expect all Keeper Networks to be paid similarly eventually? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#4",
                    "likes": "4",
                    "time": "16/03/2022-20:26:08",
                    "content": "Sure. Currently all keeper actions are supported by Maker’s internal tech-ops team. While they’ve been doing a great job, it is a point of centralization and if a critical piece ever went down then it could be catastrophic. MIP63 is an effort to gradually decentralize this to include not only the internal tech-ops team, but also include Gelato, Keep3r Network as redundancies to make sure these critical functions always get executed. Currently we are in a trial phase, and so only 3 non-critical keeper actions have been added, but the idea is to eventually switch over to this entirely for system stability. Another benefit is more technical in that Protocol Engineering has a standard interface to add new keeper actions. Previously this required a back and forth with tech-ops, but can now be automatically added in to the list via executive. For the 1000 DAI / day, this is a stream rate, but will not be the cost. It is set high enough in case of gas spikes, but in reality the 20k max buffer will likely be filled and any excess is programmed to automatically return to the surplus buffer. Keep3r Network has been running services pro-bono for about a month now and they’ve built a chart to show expenditure: Dune Analytics Their numbers show expenditure of around 1.48 ETH in that one month so we are talking around 4000 DAI / month in actual costs. Gelato will not be exactly the same, but this is the sort of ballpark we are talking. Tech-ops is currently working on more detailed charts so we can keep track of expenses on this more closely going forward. Keep3r Network will also be requesting a budget soon of probably around the same amount, and as we move more services from tech-ops only to this new decentralized system obviously the costs will increase. Tech-ops pays for their gas from their own budget so they don’t need this. TLDR this is a beta phase, and it will likely cost under 10k / month (assuming gas prices are the same) for the whole thing even with another network onboarded. Does that cover all your questions? ",
                    "links": [
                        "https://forum.makerdao.com/t/mip63c4-sp4-onboard-amend-keeper-network-keep3r-network/14321"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.738526288526289
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#5",
                    "likes": "1",
                    "time": "17/03/2022-00:15:44",
                    "content": "Yep, thanks for the details ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                }
            ]
        }
    ],
    "group_index": "568"
}