{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-14/18039",
            "title": "SourceCred Bi-Weekly Happenings #14 ",
            "index": 18039,
            "category": [
                "Discontinued Categories",
                "Misc Discontinued"
            ],
            "tags": [
                "sourcecred"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/TheExistence",
                    "index": "#1",
                    "likes": "8",
                    "time": "22/09/2022-04:06:58",
                    "content": "Hey community! This is a new edition of the short report on SourceCred’s bi-weekly happenings! We are here with the most recent information on what has been going on with our favorite algorithm over the past few weeks! If you want to check our instance you can find it here. Haven’t you signed up yet? For details on opting in, see Opting in to Sourcecred/Wth is SourceCred?.  Announcements We are working on some mods for the SourceCred implementation. If you have ideas about changes you would like to see happen on the usability or functionality of the algorithm please leave a comment  or DM me. Navigate to the DAI Accounts tab  of the Maker instance to see your current DAI balance and total DAI earned.  Cred Stats A total of 8.472 Cred have been generated in the last two weeks, with 109 topics and 926 posts created. As we can see in the first graph below, the activity has been quite uneven, with a rise in activity during the first week and a noticeable drop in the second reaching the lowest levels of the year. The second chart underscores the abrupt change when compared to the same period the previous year, which shows a much more stable transition between weeks.  773×501 22.2 KB   767×535 11.3 KB  Top 5 Categories Below are the top 5 categories of the period, ranked by Cred generated.     Cred Categorie     5342 RFC   1334 Governance   640 Updates   631 Latin America   582 Signal Requests    Top Contributions Below are the top 10 topics created in the period, ranked by Cred generated. The Cred minted in these topics was 7,603, that is, 87% of the total Cred for the period in the forum.     Cred Contribution Author     4420.09 MIP81: Coinbase USDC Institutional Rewards @CB_Institutional   525.19 MIP85: LDO to MKR OTC Swap @rune   511.66 [Signal Request] Temporary Freeze of RWF-001 Operational Wallet @GFXlabs   410.28 LFWs Endgame Commentary @LongForWisdom   330.17 MIP84: Activate Protocol-Owned Vault Emulation @rune   320.66 Coinbase MIP81 Live Call with Coinbase CFO - Questions Needed ASAP @prose11   306.42 PECU Announcement: Maker Protocol, the Merge and Future Forks of Ethereum @Derek   290.87 Endgame RFC DVC Calls @twblack88   268.78 Using jokedao for soft consensus in governance @divine_economy   219.17 Endgame Metanomics diagrams @rune    Top Contributors Below are the top 10 contributors of the period, ranked by Cred generated.     Cred Contributor     130.74 cryptenthusiastic   115.00 Gonzalo-Napolitano   69.73 Marian   52.94 Saludiego-201   51.26 Moi:   50.48 Allan-Pedersen   48.55 iammeeoh   48.37 Rahii   47.19 brigith238   45.06 Dilip     ",
                    "links": [
                        "https://forum.makerdao.com/t/opting-in-to-sourcecred-wth-is-sourcecred/3913/1",
                        "http://makerdao.sourcecred.io/#/accounts",
                        "https://forum.makerdao.com/t/17703",
                        "https://forum.makerdao.com/t/17714",
                        "https://forum.makerdao.com/t/17995",
                        "https://forum.makerdao.com/t/17907",
                        "https://forum.makerdao.com/t/17713",
                        "https://forum.makerdao.com/t/18007",
                        "https://forum.makerdao.com/t/17789",
                        "https://forum.makerdao.com/t/17773",
                        "https://forum.makerdao.com/t/17673",
                        "https://forum.makerdao.com/t/17870",
                        "https://forum.makerdao.com/t/sucesos-quincenales-del-sourcecred-14-traduccion/18059"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.730176767676768
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#2",
                    "likes": "1",
                    "time": "22/09/2022-10:43:44",
                    "content": "Congratulations to all  Glad to be in the top 10 contributors for the second time. Really enjoying being part of the community ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "1",
                    "time": "22/09/2022-15:11:42",
                    "content": "I have noticed a pattern, I like to migrate from the forum to the discord the whole discussion of plans or new ideas. I already see the forum as the final phase for the execution of the idea, amazing. I don’t know if that explains the low activity on the forum @TheExistence. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9363636363636365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MungoBlakey",
                    "index": "#4",
                    "likes": "0",
                    "time": "22/09/2022-23:19:25",
                    "content": "Yeah the discord is better for planning than the forum ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TheExistence",
                    "index": "#5",
                    "likes": "2",
                    "time": "23/09/2022-14:25:18",
                    "content": "You mean migrate the entire discussion? Discord It may be one of the factors that explain the current drop in forum participation, although it is probably not the only one. Ideally the forum is where one can better articulate ideas and concepts and where discussions can be developed in more depth. In that sense, looking for example to increase the weight of some categories such as RFC or SR seems a good option to encourage qualitative discussion. Another idea could be to make the system a mean to certify the reputational factor linked to Cred, visible to the whole community and validable for other communities where Maker is widely respected. I think the symbolic factor is important within Maker and in the general ecosystem and is something we haven’t explored yet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.78125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#6",
                    "likes": "0",
                    "time": "23/09/2022-15:21:50",
                    "content": "Yes you are right, in the end this is where everything discussed in discord makes sense. And no I didn’t mean to migrate the discussion, I meant that discord may be the cause of the low activity in the forum, maybe I didn’t use the right words, I apologize for that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3236607142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TheExistence",
                    "index": "#7",
                    "likes": "0",
                    "time": "23/09/2022-17:50:18",
                    "content": "No need  most likely I misunderstood lol. You are probably right, with all the discussion that is going on today regarding possible future changes in the protocol. However, the formal proposals that impact governance are here, that’s why we insist on improving the SC functionality in discourse, although I personally don’t rule out any option or idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.13265306122449
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Dilip",
                    "index": "#8",
                    "likes": "0",
                    "time": "25/09/2022-08:22:34",
                    "content": "Thank you, I didn’t expect to be listed in the Top 10 in such a short time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "25/12/2022-14:22:45",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-15/18478",
            "title": "SourceCred Bi-Weekly Happenings #15 ",
            "index": 18478,
            "category": [
                "Discontinued Categories",
                "Misc Discontinued"
            ],
            "tags": [
                "sourcecred"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/TheExistence",
                    "index": "#1",
                    "likes": "10",
                    "time": "24/10/2022-09:45:09",
                    "content": "Hey community! This is a new edition of the short report on SourceCred’s bi-weekly happenings! We are here with the most recent information on what has been going on with SC over the past few weeks! If you want to check our instance you can find it here. Please leave your comments below if there is anything else you would like to see added.   Announcements The governance facilitators submitted an on-chain vote last week to gauge MKR voter support for the remotion of DAI funding for the two Sourcecred instances for delegates and non-delegates. The governance decision was to stop funding the contributions with DAI, therefore payouts will cease to be effective as of November 1, and this month will be the last in which GovAlpha will issue them. GovAlpha is still working to find alternatives to keep using Cred as a collaborative and reputational incentive tool. We will have news on this very soon. In the meantime, the Proposal Bounties Program continues with its regular operation and we hope that everyone can join and participate!  Cred Stats In the last three weeks, a total of 4,454 Cred have been generated, with 82 topics and 706 posts created. As we can see in the first chart, the activity has been decreasing week by week, reaching in the last one lowest value to date, breaking the 1000 Cred floor. The second graph reinforces the low activity of the period when contrasted with last year’s values, where in some cases production quadrupled.  788×497 23.9 KB   776×537 12.3 KB  Top Contributions Below are the top 10 topics created in the period, ranked by Cred generated. The Cred minted in these topics was 7,603, that is, 87% of the total Cred for the period in the forum.     Cred Contribution Author     623.99 Crimson Creator Cluster @hexonaut   557.19 [Poll Notice] Signal Support for Ending DAI Funding for Sourcecred @Patrick_J   362.40 Maker Academy Staging Release @colby   410.28 A16z Endgame Thoughts @Porter_Smith   315.43 Viridian cluster introduction @Allan_Pedersen   300.15 [Signal Request] Offboarding YFI @ultraschuppi   295.67306.42 Poll for MKR Holder only Discord Channel @rspa   203.76 Toward decentralized front-end hosting @psychonaut   191.82 [Signal Request] MIP65 Asset Reallocation @Allan_Pedersen   185.19 Spring Cluster Introduction and Proposal @Centrifuge    Top Contributors Below are the top 10 contributors of the period, ranked by Cred generated.     Cred Contributor     149.12 Allan-Pedersen   91.68 colby   64.26 Moi   54.72 iammeeoh   31.67 Valen-Gayone   30.14 Cpt-Rick   29.32 Gonzalo-Napolitano   21.26 Aye   20.24 Aldi   19.60 Rahii     ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmYNSoyu#vote-breakdown",
                        "https://forum.makerdao.com/t/off-chain-proposal-bounties-round-up-4/18283",
                        "https://forum.makerdao.com/t/18241",
                        "https://forum.makerdao.com/t/18204",
                        "https://forum.makerdao.com/t/18364",
                        "https://forum.makerdao.com/t/18412",
                        "https://forum.makerdao.com/t/18332",
                        "https://forum.makerdao.com/t/18301",
                        "https://forum.makerdao.com/t/18360",
                        "https://forum.makerdao.com/t/18265",
                        "https://forum.makerdao.com/t/18295",
                        "https://forum.makerdao.com/t/18398",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/29"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.663825757575758
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Freakytainment",
                    "index": "#2",
                    "likes": "0",
                    "time": "24/10/2022-12:50:37",
                    "content": "Where does a proposal bounty go to. Does it stay in budget for the proposal, or does it go to those that have voted in for the proposal to pass or those that initiated the proposal? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TheExistence",
                    "index": "#3",
                    "likes": "1",
                    "time": "24/10/2022-13:07:39",
                    "content": "Bounties are for those who initiate proposals approved by governance.  Here you can find all the information about how the program works. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#4",
                    "likes": "4",
                    "time": "25/10/2022-01:50:28",
                    "content": "    TheExistence:  therefore payouts will cease to be effective as of November 1, and this month will be the last in which GovAlpha will issue them.   It was a good experiment to bootstrap the initial community engagement. Thank you for coordinating so far ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#5",
                    "likes": "4",
                    "time": "25/10/2022-01:59:06",
                    "content": "    TheExistence:  The governance decision was to stop funding the contributions with DAI, therefore payouts will cease to be effective as of November 1, and this month will be the last in which GovAlpha will issue them.    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#6",
                    "likes": "2",
                    "time": "25/10/2022-06:09:04",
                    "content": "People started gaming the SourceCred, so funding had to be removed. But hopefully GoAlpha will soon find a new and better alternative to this in which only the valuable efforts for the community will be monetized. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Freakytainment",
                    "index": "#7",
                    "likes": "0",
                    "time": "25/10/2022-10:59:37",
                    "content": "Well going through the chart I feel this is a good decision until an improvement is noticed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#8",
                    "likes": "0",
                    "time": "25/10/2022-16:00:08",
                    "content": "I think the off-chain bounties are way better than sourcecred since lot of ppl started to take advantage of it, great decision here from GovAlpha. We need proposals and people with skin in the game, not just making random comments to earn cred. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "24/01/2023-22:00:10",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1763"
}