{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/marketing-for-makerdao/9497",
            "title": "Marketing for MakerDAO ",
            "index": 9497,
            "category": [
                "Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#1",
                    "likes": "10",
                    "time": "23/07/2021-08:33:59",
                    "content": "Since the governance call is a starting point of discussions, I would like to continue on that topic of marketing. I am putting my thoughts in bullet points, so it is easier to read:   Whether it is our team to handle marketing or not, not having a marketing team in place puts MakerDAO behind every single day.   Marketing is complicated with many elements to consider and key messaging that need to be sorted for different target audiences. This complexity issue has been raised repeatedly, which can be seen as daunting and overwhelming.   That’s why MakerDAO needs an experienced marketing team to be in charge of solving these problems.   An ideal marcomms unit will do so by utilizing their experience, figuring out a clear messaging for new exciting developments, and having discussions with other units to understand and address their needs.   For example, that marketing unit will coordinate with marketers in teams such as Growth to amplify their messaging and at the same time be able to address the needs of other CUs such as introducing new features by the Protocol Engineering CU, as mentioned during the governance call.   Someone raised a point that each unit understands their products best, which I agree. However, whether each team is best suited to promote what they do is a different story. When it comes to messaging, a team needs to turn complex concepts or technical terms into something easy to absorb for the targeted audience. That requires a different set of skills.   A marcomms team will be effectively work on a unified and clear messaging for communications and marketing.   Someone mentioned about starting small. It is one way to go, but from how I see it, we risk aiming small, achieving small when MakerDAO needs to go full speed on marketing in this rapidly growing market.   Starting from scratch, which will take time, is also an option. One thing to add here is that the community needs to recognize the opportunity cost or the risk of taking no action isn’t going to become clear until much later.   One last point, everyone is welcome to have a different opinion. I believe that’s one of MakerDAO’s strengths. However, if every proposed core unit is to be judged fairly, then no proposed CU, facilitator or contributors should be judged based on which organization one has worked.   I look forward to hearing how you all think about these points. ",
                    "links": [
                        "https://forum.makerdao.com/t/informal-poll-marketing-maker/8700",
                        "https://forum.makerdao.com/t/forum-at-a-glance-july-23-29/9583",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-152-thursday-july-29-17-00-utc/9553/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-55/9531",
                        "https://forum.makerdao.com/t/maker-relay-ep-55-en-espanol/9715"
                    ],
                    "GPT-summary": "The author of the post is explaining the importance of having a marketing team for MakerDAO and how it can benefit the organization. The post also invites feedback and opinions from the community on the topic. A 3rd party provides constructive criticism and extends to the proposal by suggesting the need for a unified and clear messaging for communications and marketing.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.789837146980004
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "4",
                    "time": "23/07/2021-11:23:05",
                    "content": "    Kathleen:  For example, that marketing unit will coordinate with marketers in teams such as Growth to amplify their messaging and at the same time be able to address the needs of other CUs such as introducing new features by the Protocol Engineering CU, as mentioned during the governance call.   I feel like this is fairly important for GovAlpha as well. If we launch something like delegation, it would be good to have a team setup whose main focus is to market it (and other things.) If every core unit needs to handle everything themselves, it’s going to be really expensive and inefficient. We can aim to specialize core units to different roles (which we mostly already do) and have duplication and overlapping responsibilities to ensure resilience and decentralization. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6357808857808855
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GuyB",
                    "index": "#3",
                    "likes": "10",
                    "time": "23/07/2021-12:11:26",
                    "content": "    LongForWisdom:  If every core unit needs to handle everything themselves, it’s going to be really expensive and inefficient.   This is critical. One of the key discussions to date has been whether marketing in the DAO should be managed by one CU (for now) or in-house by every CU. That’s a false choice and we have already seen what the result would be. It’s pretty gut-wrenching that no one has used the new flash loan capability developed by PE, most likely because they don’t know about it. I don’t want to see the same for Delegates, the Optimism Bridge, and other amazing developments coming down the track. There has to be a way to pool resources and allow CUs to access marketing services if they want to. If they don’t want to, that’s fine too. What I find deeply concerning is that MakerDAO may now have no effective marketing for months, at a time when it is vital both as the DAO emerges and at this point in the evolution of DeFi. So I would urge the DAO to get creative about what we might do as a stopgap in the event that no marketing CU is approved by governance, because nature abhors a vacuum and is likely to fill it with USDC and Tether. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.278535353535354
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#4",
                    "likes": "2",
                    "time": "23/07/2021-16:08:48",
                    "content": "While I think having a marketing CU is a good thing overall, I don’t agree with how this is being characterized as urgent and critical. The current ratification poll shows that MKR holders appear to be against the proposed Marcomms CU. Note that participation is actually quite high and the margin is currently not that slim (75% voting no as of typing this post). Should this vote fail, I do not think the correct response should be to immediately submit another CU proposal or stopgap marketing measure without first understanding why this poll failed. I also disagree that the reason some of Maker’s engineering products are not being used is due to a lack of knowledge about it. If Maker creates an opportunity for people to make money (whether it’s leverage through vaults, PSMs or whatever else), users will come. Marketing is good for getting users, putting money in their pocket is infinitely better. Crypto is a space where people know of the latest degenerate, high-risk, unaudited yield farming opportunity within a day of its launch. Many of us DAO members also tweet, post on Reddit and generally do talk about new developments at Maker. I think planned messaging still adds value and has a place in MakerDAO but not having it isn’t going to be the reason we lose to USDC or Tether. TL;DR would be nice to have a marketing CU but if it takes time to get it right, understand its value and find its place in the DAO, then so be it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.857125768967874
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#5",
                    "likes": "5",
                    "time": "23/07/2021-17:06:27",
                    "content": "    LongForWisdom:  I feel like this is fairly important for GovAlpha as well. If we launch something like delegation, it would be good to have a team setup whose main focus is to market it (and other things.)   That is one example that the role of a marcomms team plays. Naturally, a marcomms team will also focus on branding and evaluate how new developments fit into the overall narrative of MakerDAO and get more exposure through PR and content.     AstronautThis:  Crypto is a space where people know of the latest degenerate, high-risk, unaudited yield farming opportunity within a day of its launch.   That is true if we want to only focus on the crypto space, which we know is insignificant compare to the global financial market.     AstronautThis:  Many of us DAO members also tweet, post on Reddit and generally do talk about new developments at Maker.   Many people in crypto tend to believe that having Twitter influencers equals marketing/PR/communications. That may be true to some extent, but the actual work goes beyond Twitter. Using the example given by PE that the fact that no one is utilizing the new feature is a case in point. I agree that no one should rush to any decision and that clear reasons need to be stated for the votes against the proposal.  For that, I appreciate @Planet_X, who is the only voter that has given his reasoning, despite that it is not an accurate reflection of the team’s efforts. At the same time, knowing that my opinion will be seen as having an agenda, I am genuinely concerned about the possibility of not having a marcomms team in place at MakerDAO anytime soon. If anyone who is reading this hasn’t voted yet, please vote. If you haven’t reviewed the proposal, I urge you to read through because my team has put a lot of efforts and time into it. It would only be fair to do so. ",
                    "links": [
                        "https://forum.makerdao.com/t/delegate-i-will-vote-no-on-the-ratification-poll-for-strategic-marcomms-core-unit/9335/5",
                        "https://vote.makerdao.com/polling/QmbWeLjJ",
                        "https://forum.makerdao.com/t/mip39c2-sp14-add-strategic-marcomms-core-unit/8617"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.142992424242424
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#6",
                    "likes": "7",
                    "time": "23/07/2021-17:57:53",
                    "content": "100% agree that we need a Marketing Core Unit but I do not agree on the costs incurred for it, nor do I consider that it is more “efficient” to have a single Marketing CU than each Core Unit that handles a product, has its own product mtk person. Example I think @brianmcmichael  said, “PE wants to build, it doesn’t want to market.” I understand what you’re saying Brian, but in reality, that doesn’t mean that PE makes a release and “hands over” the product to Marketing to do its job. Unfortunately is not like that, actually, you have to work together constantly to develop, message, channels, users, and the type of iteration around it. As software is a continuous improvement, so is product marketing, and if you want to achieve adoption, the work done has to be constant, it is not a “one off marketing action” that will make your product be used. That is the reason-why behind my insistence on taking the product marketing path since it is much more efficient to hire a person who is in charge of the team that manages a product than to have a core unit that accumulates expenses for trying to provide a horizontal service to the DAO. Marketing performance output is extremely similar to how a software factory works, where the question is.  Is the product coming out of a software factory better than the product coming out of your own PE?  We all know that the answer is no, even the cost per hour of development of a Software factory in most cases exceeds the cost of a proprietary team having much fewer iteration hours possible for said product. On the other hand, if you do not want to hire a product mkt person, which is totally fine too,  then the expectations around product adoption need to be at level with the maximum output possible that this core unit marketing can give you, which I think is the same analogy of “product output” from a software factory. Everyone needs to think if you want your core unit to behave like a company or like a public good. Another issue to take into account is the work backlog that a marketing core unit may have if it has to provide services to the DAO. How would priorities be set? Who gets the most attention from PE, Gov Alpha, Growth or Content? All of this leads to more and more discussion that makes MakerDAO expensive and slow. We have to establish a way of working in the DAO that limits the number of discussions that do not provide an immediate decision, and that provide agility and cost-efficiency. In terms of Budget, it is not “more expensive” as I read in some answers, the budget proposed by strategic Marcomms is 4.1M, with 15% of that for each core unit that has a product, is more than enough to hire a person who responds 100% to that product, and participates in the construction of said product (that’s why it’s better for you too Brian) Remember that products are built from the user experience point and not only For a technical Feature/novelty, this input can be provided by that person from product mkt within the team. As I said before, I do believe that we need a marketing/branding core unit, but the cost should be minimum in this stage. Also,  it would be ideal that each sponsoring opportunity (which I think is the most expensive thing)  be discussed with a simple business case with cost and a poll for each occasion. Another point that I do not like for DAO is that Marketing costs in most cases are outsourced costs. example PR agencies. where they do not really add value for the price they charge, having a US only, costs that are around 100k per month on average, where the only task they have is to call media outlets that “spread the news” where those media outlets at the end of the day are taking the news from Twitter. Regarding what LFW said, I think we also have to make a clear division of what are political products that do not generate direct revenue and products that generate direct revenue. For the former, I would say that a Marketing Core unit can take the lead and communicate those but I don’t think that 4M budget is needed for that. In fact also Governance Communication CU should be doing that. Just my two cents. Finally, I think we also have to know very well the products we have and what expectations we have of them, I remember yesterday @cmooney  said \"if it were for growth CU we would only be in the bucket of institutions.\" I understand what you say Chris, the thing is from growth CU we did a lot of research on how to grow the circulation of DAI, and we concluded that there is a single lever that dictates whether most vaults will come from retail or institutions and that lever is the DUST. for 2 years the resounding success in Latam and I think that also part of the success of DAI in all DEFI initially was that the premise was clear “MINT YOUR OWN STABLE AND UNBIASED CURRENCY”, today 10K DAI is prohibitive for 98% of the planet, Therefore, if you want to reach the common user (retail) for dai to be used as currency, you have to find/develop an industry that is willing to mint DAI in such a way that it can sustain the costs of  Running MakerDAO, today that industry is institutions. I would be the happiest person in the world if we have a DUST level that invites a big portion of the planet to mint DAI, I even think that this may take a BIG market share from compound or save, and ultimately be the door to have a Generic Strategic Marcomms. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-55/9531",
                        "https://forum.makerdao.com/t/maker-relay-ep-55-en-espanol/9715"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.709867931547619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "1",
                    "time": "23/07/2021-23:53:35",
                    "content": "    AstronautThis:  The current ratification poll shows that MKR holders appear to be against the proposed Marcomms CU.   Hey Astro, I think like 2 Eth addresses with 28,000 MKR have voted “No”—that is obviously not the voice of the“Community” as “one”…  And this is the brilliance of on-chain voting. Which is good. But yea not sure we can say MKR holders have spoken. Unless you’re okay with a plutocracy?     MarianoDP:  nor do I consider that it is more “efficient” to have a single Marketing CU than each Core Unit that handles a product, has its own product mtk person.   Ooff not sure I agree with this man. I know some people who work in Growth/BD teams and they want nothing to do with “marketing” — they just want to Close Deals… Closers close, right? I mean at least I hope they do  — but seriously—would you rather put together a marketing event or close a deal? Obviously close a deal. I truly believe marketing should create leads as opposed to Growth developing leads via marketing, IMO ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.539148351648352
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#8",
                    "likes": "3",
                    "time": "24/07/2021-16:43:48",
                    "content": "As a suggestion and not throwing shade at the Marcomms CU application,  have the CUs given thought to outsourcing the marcomms function? Perhaps instead of a full-time, beefed up marcomms CU, 1 or 2 people could be onboarded to manage outside teams to provide the bulk of this service (similar to how some CUs have hired outside legal counsel to advice on different matters). This team could onboard a major digital marketing team (the company Mindshare comes to mind,  no pun intended) and manage the work they conduct for the DAO’s benefit. We could even onboard a company focused more on internet financial applications,  such as the teams conducting campaigns for products like Stash or Betterment (I’m NOT saying Maker is a bank though). The costs may shake out as comparable but we get a strong namebrand working for us through various channels, less in-house bloat AND a better connection to real world services. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.576388888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#9",
                    "likes": "5",
                    "time": "24/07/2021-21:51:23",
                    "content": "While it’s a bit ironic to suggest marketing strategy to the Marcomm team, I genuinely believe the marcomm team should rethink its approach with the Maker community and governance. After all, communicating with the Maker community and governance needs to be smooth before the team thinks about how to communicate with outside communities and the general public. The assumption the team is making is that the community doesn’t value marketing because the Maker governance voted against the proposal. However, as Kathleen herself hinted, the governance is not necessarily against marketing itself, just against this specific proposal. Therefore, more time should be spent on asking the governance and community to see what were the issues. Was it the budget? Strategies? Core Unit members? The team should, for example, set up polls to see what concerns the Maker community, especially after the recent vote. Trying to antagonize the voters is likely to undermine the team’s efforts, unfortunately. “However, if every proposed core unit is to be judged fairly, then no proposed CU, facilitator or contributors should be judged based on which organization one has worked.” This is another point that I feel like the Marcomm team is misunderstanding. Even if we assume the community judges the team’s plan without such bias, it’s possible to reject the proposal. In fact, when most organizations or initiatives first start without much reference (as we saw with other DeFi protocols), usually the starting team or budget is small to test and then scale up, which naturally follows to this point. “Someone mentioned about starting small. It is one way to go, but from how I see it, we risk aiming small, achieving small when MakerDAO needs to go full speed on marketing in this rapidly growing market.” Once again, let’s see if that’s what the governance wants. When companies interact with marketing or PR agencies, they have different needs and sometimes they have specific needs (I just want media release, viral marketing, etc). But agencies are not going to force them to have all the services because the agencies believe it’s better that way. Ultimately, the decision is up to a “client / customer”. And in this case, “client” is Maker Governance and the team should communicate and listen to their feedbacks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.339285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#10",
                    "likes": "3",
                    "time": "25/07/2021-00:43:16",
                    "content": "Thanks, Doo. The proposed CU always welcomes suggestions and feedback. There is still time before the poll closes, so let us not start discussing a result that we don’t yet have. Roughly three out of every four people voted FOR the proposal, based on the data from Token Flow. Yes, the number of people who voted is less relevant to the outcome, but it is a way to gauge how the voters feel about the unit. After getting that out of the way, let me address some of the points you have made.     Doo_StableLab:  The assumption the team is making is that the community doesn’t value marketing because the Maker governance voted against the proposal. However, as Kathleen herself hinted, the governance is not necessarily against marketing itself, just against this specific proposal. Therefore, more time should be spent on asking the governance and community to see what were the issues. Was it the budget? Strategies? Core Unit members? The team should, for example, set up polls to see what concerns the Maker community, especially after the recent vote.   The team isn’t making any assumptions. We made the efforts to reach out and gathered feedback from as many community members as we can. Our  proposal, incorporating feedback we’ve received, contains planning and research documents probably exceeding many other previously proposed CUs. That is because we want to make it easy for the community to review and understand our plan. If somehow, some comments gave you such an assumption, then do let me know.     Doo_StableLab:  Trying to antagonize the voters is likely to undermine the team’s efforts, unfortunately.   Our efforts have been focusing on getting the preparation work done and communicating with the community. Antagonizing voters isn’t something we do. I don’t know if you have listened to the last governance call where the community discussed marketing and the Strategic Marcomms CU. That’s how it prompted me to write this post after hearing that discussion. I am reluctant to put anyone on the spot, but there are individuals simply judging based on the fact that I am from the marketing at the foundation. That means even the entire team is new, the point I am associated with the foundation is the problem and that MakerDAO needs to “start from scratch.” Many attempts to find out what the issues were in the past months have gotten no response. We didn’t hear back after explaining and pointing out misinformed assumptions, and that individual made the same assumption again during the call. There’s very little one can work with if the problem is that I have worked for the marketing division at the foundation. We asked to be judge the same because the same individual asked many questions in the Core Unit Launch Pod Session with Amazix, whereas in our case, no questions were asked even after we followed up. We asked to be treated the same because my team members who have nothing to do with the foundation have spent months and effort on this proposal, but they might not get a chance to contribute because I have worked for the foundation.     Doo_StableLab:  This is another point that I feel like the Marcomm team is misunderstanding. Even if we assume the community judges the team’s plan without such bias, it’s possible to reject the proposal.   The team accepts the outcome no matter what.     Doo_StableLab:  But agencies are not going to force them to have all the services because the agencies believe it’s better that way. Ultimately, the decision is up to a “client / customer”. And in this case, “client” is Maker Governance and the team should communicate and listen to their feedbacks.   Going full speed is my take on how we approach marcomms and the feedback the team has gotten from the community in various discussions and discontent that the foundation didn’t and couldn’t do enough. Mariano has mentioned PR agencies. PE and GovAlpha have made it clear that marketing/PR/communications are something that they need help with. The issue comes down to who owns the problem. The Strategic Marcomms is proposing a chance to show what we can do by owning responsibility to solve various marcomms issues. It will be for MakerDAO as branding is vital in setting apart with competitors in the minds of users. It will be for any CUs that need help and amplifying messaging for CUs like the Growth unit. ",
                    "links": [
                        "https://drive.google.com/drive/u/1/folders/1xCys_FwCEv5oQ-GX3EMzXfdNkB7KTApK"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.312450897867564
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#11",
                    "likes": "1",
                    "time": "25/07/2021-02:09:56",
                    "content": "You are right that the voting is not yet closed. So I will comment more once it’s closed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.732142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#12",
                    "likes": "8",
                    "time": "25/07/2021-08:36:33",
                    "content": "FYI all. This partnership is a very big deal. I had introduced this company JPYC to the Growth team last month among half dozen other potential partners. However, this can be promoted solely by our partner there for now. Yes, the Growth team has tweeted but people outside of Japan wouldn’t understand its importance. All PR/marketing efforts in Japan on this partnership will depend on our local partner. There’s so much we can do to promote in the world’s largest crypto markets such as the U.S., China and Japan. I want to share this with the community and make sure we are ready to take on these opportunities and win.   twitter.com    MakerDAO Growth @MakerGrowth    To our Japanese DAI holders, you can now purchase JPYCoin using DAI to pay local hometown tax soon in Japan 🇯🇵😉 twitter.com/jpy_coin/statu…   JPYC @jpy_coin  JPYC Inc. Is to Launch The Promotion Purchasing JPYC (JPYCoin) in Stablecoin DAI https://t.co/pxvzC9fFfa    8:06 PM - 23 Jul 2021           19                4            ",
                    "links": [
                        "https://twitter.com/MakerGrowth/status/1418663911654625286?s=20",
                        "https://twitter.com/MakerGrowth/status/1418663911654625286?s=20",
                        "https://twitter.com/jpy_coin/status/1416945399219191809",
                        "https://twitter.com/jpy_coin/status/1416945399219191809",
                        "https://twitter.com/MakerGrowth/status/1418663911654625286?s=20"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.502976190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#13",
                    "likes": "11",
                    "time": "26/07/2021-15:40:17",
                    "content": "    MarianoDP:  Is the product coming out of a software factory better than the product coming out of your own PE?   Most large organizations don’t put the marketing on their engineers for very good reasons.  Engineers are very expensive and it is most cost effective for the organization to direct those personnel to the task of engineering. Engineering skills are not sales skills, and the skillset is generally inversely correlated. We’re generally socially awkward introverts which makes us pretty good at sitting in a dark room by ourselves and picking things apart, but not so much at cheerful interaction with media outlets and twitter influencers. The engineering team is typically building products in response to external inputs, it makes more sense for the product owner (RWA, Growth, etc.) if not a marketing department, to take that product and advertise it. Engineers aren’t very good marketers. We know what could have been done better and we’ll tell you. We can produce a product that doesn’t make a lot of sense because MKR holders really wanted it but it’s going to be hard for us to really want to shill it.  If the DAO is to succeed it probably won’t be effective to have every core unit have it’s own marketing person on staff. In PE’s case, Derek is the facilitator would be the one to talk to, but we’re currently focused and streamlined entirely on engineering, adding management of various other disciplines seems out of our mandate. We can be a decentralized organization and all working to the same goal, and it should follow that each core unit should not need to provide every layer of the business stratum if it can be picked up by another core unit that is better optimized for it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.185637480798771
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#14",
                    "likes": "0",
                    "time": "26/07/2021-16:13:03",
                    "content": "@MarianoDP agreed with McMichael – PE and other future engineering CUs need the freedom and bandwidth to focus on their primary efforts – building – not figuring out to sell Maker. Again,  not throwing shade at the marketing CU (or Foundation marketing which likely and justifiably were restricted),  but a two person marketing CU that manages outside agencies strikes me as viable alternative to the current application. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.229166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#15",
                    "likes": "2",
                    "time": "26/07/2021-16:51:53",
                    "content": "Apologize in advance if my explanation was not clear. @brianmcmichael: I´m not saying that engineers need to sell or market, not at all. I´m saying that in my experience, is more efficient to have PE CU ask for a bit more budget and hire a Product Marketing professional to work with Derek and the team, having all the advantages that I mentioned in my previous post. This does not mean that every CU needs a marketing person, just those CU that manages a product, that so far is only one. @Tosh9.0 a two-person Marketing Core unit for general-purpose marketing is definitely something doable in my opinion ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.633101851851851
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#16",
                    "likes": "9",
                    "time": "26/07/2021-18:06:56",
                    "content": "    brianmcmichael:   We’re generally socially awkward introverts which makes us pretty good at sitting in a dark room by ourselves and picking things apart, but not so much at cheerful interaction with media outlets and twitter influencers.    I feel seen. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Luffy8055",
                    "index": "#17",
                    "likes": "0",
                    "time": "02/08/2021-03:04:27",
                    "content": "Hello @MarianoDP I would like to connect with you regarding something. Can you drop me a message. I just joined here so I’m trying to figure out things! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#18",
                    "likes": "0",
                    "time": "01/11/2021-09:04:51",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}