{
    "poll_list": [
        {
            "title": "Budget Ratification Poll for Modify Strategic Finance Core Unit Budget, SF-001 (MIP40c3-SP69) - June 13, 2022",
            "index": "15090",
            "option": "Approve existing budget only (business as usual)",
            "supporting_mkr": "109,633",
            "highest_fraction": -1
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp69-modify-core-unit-budget-strategic-finance-sf-001/15090",
            "title": "MIP40c3-SP69: Modify Core Unit Budget - Strategic Finance (SF-001) ",
            "index": 15090,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "core-unit-budget",
                "sf-001",
                "strategic-finance",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#1",
                    "likes": "7",
                    "time": "11/05/2022-02:34:44",
                    "content": " MIP40c3-SP69: Modify Core Unit Budget - Strategic Finance (SF-001) MIP40c3-SP#: 69 Author(s): @Aes  Contributors: @SebVentures @adcv Tags: core-unit, cu-sf-001, budget, dai-budget, active Status: Accepted (B: Approve existing budget only (Business as usual)) Date Applied: 2022-05-10 Date Ratified: 2022-06-27 Budget Start Date: 2022-7-1 Budget End Date: 2023-7-1 Forum URL: https://forum.makerdao.com/t/mip40c3-sp69-modify-core-unit-budget-strategic-finance-sf-001/15090 Ratification Poll URL: https://vote.makerdao.com/polling/QmVMc78Z   Sentence Summary MIP40c3-SP69 modifies the DAI budget for Core Unit SF-001: Strategic Finance.  Paragraph Summary MIP40c3-SP69 modifies the budget for Core Unit SF-001: Strategic Finance. It contains:  Total Budget Cap: The hard limit voted on by Governance. Breakdown of Team for the budget period. Requested monthly is 108.5K vs 82.4K in the prior budget, a 32% increase.   Specification  Motivation Based on the nature of the work done by the Strategic Finance Core Unit (SF-001), the budget reflects the needs of the team to ensure continuity of the work described in our MIP39c2-SP27. This is summarized in, but not limited to:  Maintaining Financial Statements, Reporting, and existing Dashboards. Driving alignment and facilitating discussion for Strategic Focus Areas & KPIs. Tracking, consolidating, and reporting Core Unit expenses to the DAO. Institutional vault analysis & deal negotiations. Oracle gas modeling and risk mitigation. Asset-Liability Management.  The SFCU is also supporting various strategic initiatives, including but not limited to:  Authoring proposals to earn income from dormant balance sheet assets. Supporting the aggressive growth strategy with financial modeling and strategic advisory. Meeting with various parties to research cost and legal structure of balance sheet investments.   Core Unit ID SF-001  Budget Implementation The SF-001 budget is designed with the following in mind:  Paying for the operational costs to run the Core Unit. Having a buffer for unexpected legal, technical, or financial problems.  Therefore, a vote to ratify this MIP means MKR holders make a commitment to: A continuous funding model similar to those proposed by RISK-001, SES-001, and DUX-001. If any modifications are needed, they will be done on a six-month basis through a “Modify Core Unit Budget Subproposal Process” (MIP40c3 subproposals.) If modifications are not proposed, the monthly payment amount gets rolled over from the initial proposal, if our work meets community and MKR holders’ expectations and demands.  Smart Contract Implementations This budget implementation uses the DssVest. This can be changed if needed to any method achieving similar objectives. The vesting budget will be in place from July 2022 to July 2023 included. It will be renewed each year.  DAI per month: 108,515. The destination wallet is: 0xf737C76D2B358619f7ef696cf3F94548fEcec379 - SF Core Unit Multisig. A total of 1,302,185 DAI will be streamed to 0xf737C76D2B358619f7ef696cf3F94548fEcec379 address starting date 7/1/22 and ending date 7/1/23.   Budget Breakdown  DAI Expenditure We’re asking for a monthly budget of 108,515 DAI. The budget cap differs from the actual expenses of the Core Unit. The cap refers to the maximum that the Core Unit can request for operating, and it includes room for unforeseen circumstances.  Reporting Transparency  Budget  image841×921 26.5 KB   2022 FTEs - Actuals & Forecast by Month      February March April May June July August September October November December     FTEs 2.2 3.6 4.3 4.3 6.2 6 6 4.75 4.75 4.75 5.75     2023 FTEs - Forecast by Month      January February March April May June     FTEs 5.75 5.75 6.75 6.75 6.75 6.75     Budget Term Budget commences on 7/1/22 and ends on 7/1/23.  Budget Details Providing additional detail with regards to the above line items: Compensation: This budget contains compensation for the aforementioned six full-time contributors and two temporary contributors. It also contains a small allocation for grants for specific projects. The total compensation includes a competitive base salary and funds to cover health insurance, 401K matches, and other benefits offered in the marketplace. Travel and Conferences: The team plans to travel once a quarter to collaborate more intensely, meet with other DAO members, and work on our roadmap and strategic initiatives. Hardware & Welcome Package: An allocation of $3,500 per new FT team member (new members only, one-time cost). IT & Subscriptions: We currently have subscriptions to Dune Analytics and various productivity applications (MS OneDrive, HackMD, etc.). We will test out various data providers to determine which product best suits our needs. We will also work with the Data Insights CU to see how our data needs can be served. Gas Costs: Covers monthly payments to contributors. Professional Services: Coverage for legal, tax, and advisory services. Contingency Buffer: Approximately 7.5% of the total cap costs added in case of additional unforeseen expenses. Any Contingency Buffer funds used will be detailed in our financial reports for transparency. The team will generate monthly financial reports with expense forecasts and return excess Dai at the end of the budget period.  Increasing Value to Maker Token Holders The Strategic Finance CU seeks to drive value to the protocol through revenue growth and improving operational efficiency tangibly. Our focus is on utilizing dormant protocol assets to generate income for the protocol on the revenue side. This work can be broken down into the following key components:  Allocating the majority of stablecoin PSM exposure to short-term bonds. We are seeing significant traction here, and will support any proposal brought forward that we believe is in the DAO and protocol’s best interest.  Modeling target asset exposure and authoring SRs/MIPs to implement. Launching a treasury management strategy with the long-term goal of automating, to generate yield and support DAI & MKR liquidity.  On the operational efficiency side, our focus is on delivering accurate and timely financial reports about the state of the system to token holders and commercially relevant blockchain insights. This work can be broken down into a few key areas:  Ongoing monthly financial reporting and analysis. Our objective is for MakerDAO to set the DeFi standard for financial reporting quality and accuracy. Better data meaningfully improves the quality of decision-making at the protocol.  Building financial dashboards and tools that provide real-time financial data directly from the blockchain so stakeholders can understand the health of the protocol. Facilitating Quarterly Strategic Reviews (QSRs) to review DAO-approved strategic focus areas, KPIs, and the DAO’s progress against them. Working with the Growth, Protocol Engineering, and Oracle Core Units to model growth opportunities and risks. Accounting, solvency, liquidity, and potential regulatory reporting.   Roadmap and Objectives  Working with the community to allocate the majority of stablecoin PSM exposure to short-term bonds. Refining our target asset exposure model and aligning with the Risk & Lending Oversight CUs and community to implement. Launching treasury management with the long-term goal of automating to generate yield and support DAI & MKR liquidity. Create a Strategic Action Plan (STRAP) to develop plans to achieve DAO-wide long-term goals by facilitating:  Determining the protocol’s strategic position. Prioritization of Objectives. Developing and formalizing the strategic plan. The assessment of executing the plan. The review and revision of the plan as necessary.   Continue facilitating recurring Strategy reviews to:  Assess how CUs are executing the mission and agreed-upon strategy. Understand issues and obstacles the DAO needs to address. Discuss new opportunities that have arisen that the DAO may want to pursue. Decide if adjustments to the plan are needed. Facilitate optimal capital allocation.   Build out ‘Governance Relations’ by partnering with CU leadership to frame and communicate MakerDAO’s strategy, operations & financial results to the community. Asset-Liability Management: Reporting the current and future balance sheet structure in terms of interest rate, duration, maturity, and profitability.  Researching and proposing ways to optimize the balance sheet allocation. Providing insights into borrower risks and analyzing customer capital flows.   Financial Reporting & Planning   Monthly Financial Reports.  Monthly Expense Reports. Monthly Revenue and Expense Forecasts. Budgeting support through building Budget Templates and providing expense analysis to CUs.   KPI dashboard.  Building real-time dashboards leveraging on-chain data to measure DAO-approved Strategic Focus Areas and Key Performance Indicators.   Real-time Vault Profitability Analysis. Partnering with SES to standardize and automate expense reporting across the DAO.  Increase transparency and reporting standards to provide more accountability to CU spend     Headcount Planning and Team Summary for 2H 2022 The team for this budget cycle will be composed of six permanent members and two temporary (Summer Interns) members: Facilitator - @Aes ALM - @SebVentures Finance & Strategy - @adcv Business Analysis - @lyt Sr Financial Analyst - TBD Lead Accountant - TBD Temporary/part-time team members include: 1 MBA Intern @pipko 1 Undergraduate Intern @Juanbug  Contingency Planning - Scenarios Bear/Superbear: Should the DAO seek to cut expenses in a bear or superbear market, the SFCU would reduce expenses by minimizing or eliminating travel, delaying new hires, and, if needed, reducing HC compensation. Bull: In a bull market, we would accelerate hiring plans and bring on the Sr. Financial Analyst, Lead Accountant, and DAO Auditor more quickly. We would also move forward efforts to automate Makershire, subject to performance and DAO approval, by co-funding smart contract development and audits. In the event of rapid expansion outpacing our capacity, we would explore expanding the budget to accommodate an additional resource. However, our policy is to reach and exceed 100% capacity for some months with each of our Core Unit collaborators before looking into the need for adding an additional resource.  Unwinding and Defunding If SF-001 is defunded, all expansionary work will be halted to shift focus to wrapping up existing initiatives, creating documentation of existing processes, transitioning any processes, and archiving projects & data. Any funds not already allocated (such as employee compensation and software subscriptions) at offboarding will be returned to the DAO through DSSBlow. All unvested MKR would be returned to the DAO as of the end date. No one-time expenses are anticipated at this time.  Considerations for Budget Modifications The requested budget is a 43% increase over the first SF-001 budget. The increase is driven almost entirely by headcount compensation, which is driven by increased headcount. This is slightly offset by a lower contingency buffer (24% lower than the previous budget). Travel expenses have been increased nearly 3x, driven by a 69% (nice) increase in headcount and increasing the frequency of team meetings from twice a year to four times a year. The new travel budget remains lower than average. We plan to increase the permanent team headcount by two, and hire two temporary interns for the Summer ( 1 MBA and 1 Undergraduate). Please see below for a summary of core responsibilities for each role: MBA Intern:  Analyze the protocol’s core business from a first-principles approach, and build an investment and capital allocation prioritization framework to help guide protocol capital allocation decisions. Assist with refining and iterating on the Quarterly Strategic Review deck, leveraging learnings from the above analysis. Research quantitative and qualitative metrics for DAI and how to best position DAI in the marketplace to maximize organic DAI growth.  Undergraduate Intern:  Create an investment and risk framework for treasury asset allocations in collaboration with key DAO stakeholders and the community. Model treasury portfolio risk, return, measure and report results, monitor and optimize positions. Build the action plan and roadmap for automating the treasury.  Sr. Financial Analyst  Take overall existing Financial Reporting, including but not limited to: monthly financial reports, expense reports, forecasting models, DCF models, Oracle gas models, etc. Collaborate with the SF team and Lead Accountant to automate, optimize, and increase the robustness of our financial reporting processes. Assist with QSR and developing Operations QSR materials, Stakeholder relations, and educational materials.  Lead Accountant  Develop the foundation for DeFi-native accounting principles, leveraging concepts from traditional accounting frameworks (GAAP and IFRS). Own and manage the protocol financial statements to maximize transparency and visibility to stakeholders. Finalize and launch a DAO financial and accounting closure process.   Business Case for Investment Hiring Summer Interns will enable the DAO to source and trial talent on a cost-controlled and temporary basis. Many have joined the DAO starting on a part-time basis to gain comfort and ensure mutual fit with the DAO before committing to the project on a full-time basis, myself included. Building relationships with top Universities will enable the DAO to source talent better. At this time, SF has sourced intern talent from Harvard Business School and UPenn (Wharton). In addition to the above, we believe these individuals can add tremendous value to the DAO, even during the limited time with us on a full-time basis. If the trials are successful, we will endeavor to keep these individuals engaged on a part-time basis. Hiring a Sr. Financial Analyst will free up significant time for @adcv and me, allowing us to work on higher-value initiatives and projects. We currently spend 40+ hours per month on financial reporting and related activities. With the higher bandwidth, we plan to invest significant time into:  Vault User Research a. Creating an NPS (Net Promoter Score) survey b. Quantifying vault usage by Front End c. Analyzing historical CLIPs and how liquidations can be improved Surplus Buffer & Treasury Analysis a. Collaborate with risk to model and quantify the minimum amount to be held in Surplus Buffer b. Develop NPV framework for potential investments (re-investing vs. burning MKR) c. Strategic partnerships to increase yield Create an investment prioritization framework to maximize ROI Accelerate automation efforts of Makershire Develop an Operations QSR  Investing in a dedicated accounting resource will build higher confidence and trust in all MakerDAO financial reporting. While MakerDAO is already considered a leader by some top crypto funds in terms of financial reporting and transparency, we believe we are just scratching the surface of what can and should be done to bring confidence to DAI and protocol stakeholders. Making an investment in a seasoned accounting professional will signal to the market that MakerDAO is serious about furthering these efforts and committed to continuing to be an industry leader in trust and transparency.  image808×379 19.6 KB   Proposal Parameters   Minimum Feedback Period: 1 Month.  Minimum Frozen Period: 1 Week. Ratification Polls for MIP40c3 subproposals involving a Core Unit Budget Modification will have different requirements to MIP51c2. Instead of binary voting, they must use ranked-choice voting, with the options as follows:  A: Approve increased budget B: Approve existing budget only (Business as usual) C: Reject budget D: Abstain    In order for this Ratification Poll to conclude successfully and the contained proposal(s) move to Accepted status, each of the following conditions must be true:   A or B vote-weight must exceed C vote-weight when the poll closes. Winning vote-weight must exceed the Minimum Positive Participation value of 10,000 MKR when the poll closes.  Please make sure to rank all of the options during the vote, specifically for approving a budget request. Also, make sure to rank the option to approve the existing budget. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp12-declaration-of-intent-invest-in-short-term-bonds/13084",
                        "https://forum.makerdao.com/t/mip65-bond-allocation-review-vote-baillie-gifford/14865",
                        "https://forum.makerdao.com/t/a-balance-sheet-approach-to-executing-an-aggressive-growth-strategy-the-road-to-300m-revenues/14818",
                        "https://forum.makerdao.com/t/signal-request-deploy-the-balance-sheet-in-eth/14834",
                        "https://forum.makerdao.com/t/mip55c3-sp4-adding-a-special-purpose-fund-makershire-hathaway/14643",
                        "https://forum.makerdao.com/tag/financial-report",
                        "https://dune.com/SebVentures/maker---accounting_1",
                        "https://forum.makerdao.com/t/borrowers-concentration-analysis/12014",
                        "https://forum.makerdao.com/t/alm-liquidity-update/14687",
                        "https://forum.makerdao.com/tag/financial-report",
                        "https://forum.makerdao.com/tag/expense-reporting",
                        "https://www.ar.ca/blog/the-good-bad-ugly-of-voluntary-reporting-and-transparency",
                        "https://forum.makerdao.com/t/relay-semanal-7-13-de-junio-2022/15897",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/79",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-13-de-junio-de-2022/15883",
                        "https://forum.makerdao.com/t/weekly-relay-june-7-13-2022/15818",
                        "https://forum.makerdao.com/t/weekly-mips-update-91/15787",
                        "https://forum.makerdao.com/t/weekly-mips-update-90/15648",
                        "https://forum.makerdao.com/t/weekly-mips-update-89/15464",
                        "https://forum.makerdao.com/t/governance-and-risk-196-thursday-june-23-at-17-00-utc/15998/3",
                        "https://forum.makerdao.com/t/relay-semanal-21-27-de-junio-del-2022/16272",
                        "https://forum.makerdao.com/t/weekly-relay-june-21-27-2022/16158",
                        "https://forum.makerdao.com/t/weekly-mips-update-93/16129",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/4",
                        "https://forum.makerdao.com/t/mip39c3-sp1-core-unit-offboarding-sf-001/17134",
                        "https://forum.makerdao.com/t/relay-semanal-14-20-de-junio-del-2022/16062",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/25",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/75",
                        "https://forum.makerdao.com/t/weekly-relay-june-14-20-2022/15950",
                        "https://forum.makerdao.com/t/weekly-mips-update-92/15933",
                        "https://forum.makerdao.com/t/governance-and-risk-194-thursday-june-09-at-17-00-utc/15664/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Board composition",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4710127835127835
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#2",
                    "likes": "1",
                    "time": "11/05/2022-11:02:13",
                    "content": "Thanks for this writeup @Aes. SF’s proposals on the revenue side have been great and I appreciate the robust analysis and modeling that goes into each of them - it’s very helpful. I had a couple of questions after digesting this post:     Aes:  potential regulatory reporting   I may well have missed something - but what is this potential regulatory reporting in reference to?     Aes:   Create a Strategic Action Plan (STRAP) to develop plans to achieve DAO-wide long-term goals by facilitating: Determining the protocol’s strategic position Prioritization of Objectives Developing & formalizing the strategic plan The assessment of executing the plan The review and revision of the plan as necessary    The focus on long-term thinking here is appreciated but crafting a DAO-wide plan with an agreed set of objectives (and priorities!) seems like an almighty task. Logistically, how will this strategic plan be developed - is the idea for SF to develop a plan and then propose it to the DAO, or perhaps for it to be developed in conjunction with delegates etc?  I would also be interested in how this interacts with Rune’s proposals - I recall the Clean Money vision finding pretty widespread support from the community. Is the STRAP partially about operationalising that vision? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.898809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#3",
                    "likes": "2",
                    "time": "11/05/2022-13:33:38",
                    "content": "Appreciate the kind words!     Matt_NZ:  I may well have missed something - but what is this potential regulatory reporting in reference to?   We believe that over time regulators will become more involved in web3 and will likely require some sort of transparency reporting similar to traditional financial markets. We’re strong believers in providing maximal transparency and the more we invest resources in furthering this belief, the less we will have to ‘catch up’ in the future when such reporting may be required.     Matt_NZ:  The focus on long-term thinking here is appreciated but crafting a DAO-wide plan with an agreed set of objectives (and priorities!) seems like an almighty task. Logistically, how will this strategic plan be developed - is the idea for SF to develop a plan and then propose it to the DAO, or perhaps for it to be developed in conjunction with delegates etc? I would also be interested in how this interacts with Rune’s proposals - I recall the Clean Money vision finding pretty widespread support from the community. Is the STRAP partially about operationalising that vision?   We will work with a variety of contributors across the DAO to align on a vision that guides the STRAP. A major focus of this initiative will be to better understand the subset of our industry, competitive landscape, our positioning, and what levers we should be pulling to maximize growth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.903769841269842
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#4",
                    "likes": "1",
                    "time": "31/05/2022-22:39:18",
                    "content": "In light of the deterioration of the lending markets since the budget was originally posted, we decided to push out our hiring plans for a Sr Financial Analyst and Lead Accountant to December 2022 and March 2023 respectively. We will revisit the hiring timeline in Q3/Q4 and adjust plans pending market conditions and the DAO’s desire to invest further in StratFi. The adjustment in phasing led to a 108K reduction in the annualized DAI budget and reduces the requested increase from 43% to 32%. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#6",
                    "likes": "0",
                    "time": "07/06/2022-17:58:07",
                    "content": "Kind reminder that this proposal is eligible to enter the current Governance cycle. Please express your intention to formally submit the proposal by Thursday 9, 00:00UTC. Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#7",
                    "likes": "1",
                    "time": "07/06/2022-18:54:50",
                    "content": "We are formally submitting this MIP. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#8",
                    "likes": "0",
                    "time": "14/06/2022-21:05:26",
                    "content": "This proposal is currently being voted on. Its RP will run from 06/13 to 06/27. Please vote here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#9",
                    "likes": "2",
                    "time": "24/06/2022-07:34:15",
                    "content": "We will vote for the Increased Budget option and believe that SF are the right people to disentangle the various flows of funds in the incredible machine that MakerDAO has become. If there’s one thing that we want to suggest it is that the cost for DuneAnalytics be replaced with working with us at FlipsideCrypto. Our data can be accessed via APIs and is free of charge. We also have capable analysts on our team and rock-star analysts in our community that both Strategic Finance and the DAO as a whole is more than welcome to tap into. Please reach out to us, we want to support you as much as possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.825396825396826
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#10",
                    "likes": "3",
                    "time": "25/06/2022-00:42:23",
                    "content": "We really appreciate the support! I’ve checked out flipside. DM me on discord (lyt#7323), I’ll let you know our reasons for choosing dune analytics thus far and maybe this feedback can guide you to build flipside up to a point where we might want to switch over. Competition is always good! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.041666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#11",
                    "likes": "0",
                    "time": "25/06/2022-04:55:43",
                    "content": "Thanks for the swift reply. I sent a friend request on Discord. My handle is raphbaph#5749. We’re just building out our Maker tables to make them more powerful and could tailor them to your needs. Happy to chat ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#12",
                    "likes": "0",
                    "time": "23/09/2022-04:56:11",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1067"
}