{
    "poll_list": [
        {
            "title": "Ratification Poll for Requesting Protocol DAI Transfer to fund TechOps CU for February 2023 (MIP14c2-SP1) - January 9, 2023",
            "index": "19018",
            "option": "Yes",
            "supporting_mkr": "94,160",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip14c2-sp1-requesting-protocol-dai-transfer-to-fund-techops-cu-for-february-2023/19018",
            "title": "MIP14c2-SP1: Requesting Protocol DAI Transfer to fund TechOps CU for February 2023 ",
            "index": 19018,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "core-unit",
                "tech-001",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/simonkp",
                    "index": "#1",
                    "likes": "3",
                    "time": "01/12/2022-23:33:21",
                    "content": " MIP14c2-SP1: Requesting Protocol DAI Transfer to fund TechOps CU for February 2023  Preamble MIP14c2-SP#: 1 Author(s): @simonkp Contributors: Tags: tech-001, core-unit, Status: Accepted Date Proposed: 2022-12-02 Date ratified: 2023-01-23 Forum URL: https://forum.makerdao.com/t/mip14c2-sp1-requesting-protocol-dai-transfer-to-fund-techops-cu-for-february-2023/19018 Ratification Poll URL: https://vote.makerdao.com/polling/QmUMnuGb --- Amount: 138,894 DAI   Specification  Sentence Reason This amount will sustain the team, critical infrastructure, tools and services through the month of February. A second MIP14 subproposal will be posted for the month of March. The new budget will be voted on in March and hopefully then take over the funding from April.  Reason Details This amount is a monthly cap of TechOps CU’s new revised NewBase DAI budget. After submitting our 2023 budget to the community it was rejected for a number of reasons, including:  Very high budget overall — bad time for new hires and TechOps CU failing to judge the community’s sentiment for cost cutting. Not giving Bear market vote options — as per MIP40 (only if the budget is higher) and as the new expected standard. Our role in Endgame — transitioning to Ecosystem Actor and/or Tribunal.  We’ve taken this feedback onboard and have revised our new budget significantly which will be up for voting in March 2023. Due to budgeting cycle happening quarterly we’re left without funding for February and March 2023. This amount will cover our expenses for the month of February. A second MIP14 subproposal will be posted for the month of March. Any excess funds as always will be promptly returned to the protocol.  Surplus Analysis Proposed transfer can be taken from the current surplus.  DAI Transfer Ceiling Analysis The proposed transfer is within the parameters of the DAI Transfer Ceiling (250,000 DAI).  Targets Recipient is TechOps CU Auditor Multi-sig Wallet. Recipient Address: 0x2dC0420A736D1F40893B9481D8968E4D7424bC0B Amount To Transfer: 138,894 DAI   Relevant Information:  2023 Revised DAI Budget MIP TechOps CU Mandate  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-spxx-techops-core-unit-dai-budget/19017",
                        "https://forum.makerdao.com/t/mip39c2-sp29-adding-techops-core-unit-tech-001/12070",
                        "https://forum.makerdao.com/t/weekly-relay-recaps-of-current-events-at-makerdao/16382/28",
                        "https://forum.makerdao.com/t/weekly-mips-update-116/19059",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/36",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/39",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/33",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/37",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/13",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806/42",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/87",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/51",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/117",
                        "https://forum.makerdao.com/t/weekly-mips-update-119/19289",
                        "https://forum.makerdao.com/t/weekly-mips-update-118/19260",
                        "https://forum.makerdao.com/t/weekly-mips-update-117/19148"
                    ],
                    "GPT-summary": "The post is a proposal by the author to request a transfer of 138,894 DAI to fund TechOps CU for February 2023. The proposal explains the reason for the transfer and how it will sustain the team, critical infrastructure, tools, and services through the month of February. The author also mentions that a second MIP14 subproposal will be posted for the month of March. The post includes information on the revised DAI budget and the TechOps CU mandate. Additionally, the proposal mentions that any excess funds will be promptly returned to the protocol. The post does not advertise the proposal, ask for collaboration, or ask questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.092813852813853
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "0",
                    "time": "07/12/2022-17:30:25",
                    "content": "This is a summary of the contents of this subproposal and its impact, from GovAlpha’s perspective:  This is a valid subproposal to request a DAI transfer from the Maker Protocol to a target Ethereum address, as defined in MIP14: Protocol DAI Transfer. So far, all MIP14 requests combined do not exceed the MIP14c4: Protocol DAI Transfer Ceiling, which is currently set to 250,000 DAI. Therefore, this proposal is eligible. The last TECH-001’s budget subproposal was not approved by Governance. Until a new budget can be submitted and voted on in March 2023, this request asks for 138,894 DAI to fund TECH-001’s continuity work for the month of February. A second request to cover for the expenses of the month of March will be submitted. As per MIP14c2, transfer requests that exceed 100,000 DAI must fulfill a twelve-week Feedback Period and a four-week Frozen Period. However, as per [MIP2c2:  Interim Phase 2] (https://mips.makerdao.com/mips/details/MIP2#MIP2c2) both periods can last one month unless otherwise noted as shorter. If this subproposal is ratified, 138,894 DAI will be transferred to the specified MIP47-compliant multisig wallet through the earliest executive vote. This proposal has been assigned High-Impact based on the methodology listed here.  Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. Updated 2022-12-26 ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP14#MIP14c4",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP86",
                        "https://forum.makerdao.com/t/mip40c3-sp88-techops-core-unit-dai-budget/19017/3",
                        "https://mips.makerdao.com/mips/details/MIP14#MIP14c2",
                        "https://mips.makerdao.com/mips/details/MIP2#MIP2c2",
                        "https://mips.makerdao.com/mips/details/MIP47",
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.2727272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/12/2022-20:06:36",
                    "content": "Inline with StableNode’s statement and considering TechOps CU is not offboarded and mandates valid and funding till February seems like a fair time to prepare for transition, we will support such vote based on our current understanding.    Resource and Clarity for Core Units’ Transitions into Endgame   Therefore, for delegates and governance participants that believe funding requests and mandates are fair but the issue is with the structure, we encourage you to support needed funding and resources that such Core Units request to transition successfully.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/simonkp",
                    "index": "#4",
                    "likes": "2",
                    "time": "18/12/2022-23:00:04",
                    "content": "Edited the wording to make it clear that this amount is for the February month only and that a separate MIP14 sub-proposal will be posted for the month of March. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/simonkp",
                    "index": "#5",
                    "likes": "1",
                    "time": "03/01/2023-04:23:49",
                    "content": "@MIP-Editors, We would like to formally submit this proposal for the January 2023 cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#6",
                    "likes": "0",
                    "time": "13/01/2023-01:59:18",
                    "content": "This proposal is currently being voted on. Its Ratification Poll will run until 2023-01-23. Please vote here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "1975"
}