{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dux-roadmap-spotlight-q1-2022/12612",
            "title": "DUX Roadmap Spotlight: Q1 2022 ",
            "index": 12612,
            "category": [
                "Core Units",
                "Development & UX"
            ],
            "tags": [
                "cu-update",
                "dux-001",
                "roadmap-spotlight"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#1",
                    "likes": "8",
                    "time": "13/01/2022-13:08:12",
                    "content": "   Instead of reading, also consider watching the recorded walkthrough below in which I’ll talk you through this update.    Loom    DUX Roadmap Spotlight: Q1 2022       Introduction Hey everyone! Happy New Year, on behalf of the DUX team! We hope everyone had a happy and healthy start of 2022. We’re eager to kick off our quarter by introducing a new concept for team updates to MakerDAO: Roadmap Spotlight—a quarterly update cadence from our team! Every three months we’ll share an elaborate forum post and pre-recorded walkthrough in which we’ll wrap up the past quarter and commit to a focus for the next quarter. We’ll touch upon prior commitments and the progress we’ve made, lessons learned, and the prioritised themes for our roadmap. Enjoy the read and please do reply below if you have questions or suggestions!  Looking back: Q4 2021 The past quarter was our first quarter as an official Core Unit since graduating from the SES incubation program. It’s been an incredible few months in which we were able to build our processes and sprint cadence, build a fun team dynamic and meet a lot of MakerDAO people in real life.   For those who are not yet familiar with the DUX (Development & UX) Core Unit, please refer to our Notion website.   What we’ve committed to Here’s a full list of the commitments we’ve made in September 2021 during our CU’s launch pod call   Roadmap spotlight Q1 &#39;22960×540 200 KB   What we’ve delivered Here’s the current status of the aforementioned commitments. Refer to the recorded walkthrough for an elaboration on each of these.   Roadmap spotlight Q1 &#39;22 (1)960×540 196 KB  All full release notes can be found here on our Notion website. Here’s a list of the delivered features since September 1st.   Roadmap spotlight Q1 &#39;22 (2)960×540 165 KB    Please do note that a lot of beneath-the-surface engineering and research work has been delivered in addition to these tangible features.   What we’ve learned Through better mastering the codebase of the Governance Portal, staying in tune with development trends in DeFi, and also through incidents we have amassed a lot of learnings these past three months. These lessons learned were used to define improvement points and roadmap items, which we also address in this forum post. Our main lessons learned in the past three months are listed below. Refer to the recorded walkthrough for an elaboration on each of these.   Frontends are part of a dapp’s attack surface (eg. BadgerDAO)   There are opportunities for simplifying and modernizing our stack   The Governance Portal needs better error handling   We need to be mindful of third-party dependencies of our apps   We need holistic automated tests that cover edge cases which are hard to manually test   We should include feature usage in our prioritisation framework    Looking ahead: Q1 2022  Team goals for the new year To kick off the new year we have spent two days doing FigJam workshops and discussing focussed topics, which helped us define a focus and progress on more abstract but important initiatives. Team goals for 2022 included a sharper focus on security and testing, working more data-driven, making time for longer-timeframe work (eg. L2 integrations, gamification) and maintaining a fun and healthy team vibe. Personal goals for 2022 included more engagement with the MakerDAO community, more writing/blogging/Tweeting and a renewed focus on personal productivity.  Roadmap focus As explained in our Launch Pod presentation back in September 2021, DUX team does not work with static roadmaps. We work with a fluid roadmap based on constant prioritization of work items, based on collected input from multiple sources.   Please refer to this page on our Notion website for more info on how we build and prioritize our roadmap.  Our roadmap focus for Q1 2022 is centered around three themes:   Security    Scalability    Interactivity    Below you’ll find a list of specific features, improvements and initiatives we have defined for each of these themes. Most of these apply specifically to the Governance Portal. We are very eager to hear your ideas related to these themes, so please do share them in the comments below!  Roadmap theme: Security     Deep code refactor to replace dai.js dependencies – Deprecate dai.js, a Javascript library once started by the Maker Foundation that we have been maintaining thus far. We consider dai.js as obsolete since it has many (superior) open-source alternatives, has zero community engagement and incurs significant engineering overhead to maintain. – We expect that this code refactor will make the Governance Portal more stable & secure, but also more future-proof and easier to work on.   Improvements to testing suite and practices – New system for integration testing – More and better e2e integration tests – Explore replacements of local testchain (ChaosLabs is working on something cool )   Refactor native hardware wallet integrations   Integrate with more wallets (eg. Gnosis Safe)   Refactor vote proxy creation feature   Redesign token approval flows for improved security and user awareness   Book an external security audit for the Governance Portal    Roadmap theme: Scalability     For short-term results – Explore gasless voting mechanisms – Decide on applicability of gasless voting w/ @GovAlpha-Core-Unit – Implement accordingly   For medium-term results – Investigate governance/voting initiatives leveraging zero-knowledge proofs (eg. StarkNet ecosystem) – Investigate Snapshot x StarkWare collaboration   For long-term results – Start exploring the applicability of Maker Wormhole to Maker’s voting system (ie. move governance voting to L2 completely)    Roadmap theme: Interactivity     Explore integrations between the Governance Portal and the Governance Forum (using the Discourse API)   Explore methods to export poll votes and comments to other channels (eg. Governance Forum)   Implement push notifications using EPNS   Implement richer hyperlink embeds for the Governance Portal   Explore integrations with governance aggregators      In addition we are working on a little surprise that we’ll tease soon. Something something landing page.   Wrapping up In addition to the above, here are some miscellaneous team updates:   We’re working on launching a Twitter account for our Core Unit. Follow us!   One of our senior engineers @tyler has switched from fulltime to 60% parttime   @bainpm is handing over the facilitator role to @0xdeniz and will fully focus on engineering and research   Our team runs on community input, therefore I want to close with a call-to-action:   Do you have any feedback or feature requests for the Governance Portal, or ideas for improving Maker’s governance UX in general? Please reach out in the comments below!   Thank you for reading!  ",
                    "links": [
                        "https://www.loom.com/share/36a30c6e30244fb2a7a92b07be5c6dcf",
                        "https://www.loom.com/share/36a30c6e30244fb2a7a92b07be5c6dcf",
                        "http://dux.makerdao.network/",
                        "https://makerdux.notion.site/Release-Notes-57ce7bad1723497e9826815ee53e4b5f",
                        "https://vote.makerdao.com/",
                        "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-17-development-and-ux-core-unit/10297",
                        "https://www.notion.so/makerdux/Mandate-Strategy-ef01bde010254f088a456c37ebf5d920#997372f021ed42b7b0aac17fc8fb3623",
                        "https://vote.makerdao.com/",
                        "https://twitter.com/chaos_labs",
                        "https://epns.io/",
                        "https://twitter.com/MakerDUX",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-january-2022-updated/13094",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-december-2021/12692",
                        "https://forum.makerdao.com/t/mip4c2-xx-core-unit-offboarding-process-amendments/12920/16"
                    ],
                    "GPT-summary": "The post is an update from the DUX team of MakerDAO, introducing a new concept for team updates called Roadmap Spotlight. The post covers the team's progress in the past quarter, their commitments, what they have delivered, and what they have learned. The post also outlines the team's goals for the new year and their roadmap focus for Q1 2022, centered around three themes: security, scalability, and interactivity. The author invites feedback, feature requests, and ideas for improving Maker's governance UX in general.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 6.153467465753425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/04/2022-13:08:59",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}