{
    "poll_list": [
        {
            "title": "Ratification Poll for Modifying Sidestream Auction Services Core Unit Mandate - SAS-001 (MIP39c2-SP39) - March 13, 2023",
            "index": "19738",
            "option": "No",
            "supporting_mkr": "51,261",
            "highest_fraction": 0.67
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip39c2-sp39-modifying-sidestream-auction-services-core-unit-mandate-sas-001/19738",
            "title": "MIP39c2-SP39: Modifying Sidestream Auction Services Core Unit Mandate - SAS-001 ",
            "index": 19738,
            "category": [
                "Maker Improvement Proposals",
                "Formal Submission"
            ],
            "tags": [
                "core-unit",
                "sas-001",
                "impact-:-high",
                "mandate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "1",
                    "time": "08/02/2023-18:23:49",
                    "content": " MIP39c2-SP39: Modifying Sidestream Auction Services Core Unit Mandate - SAS-001  Preamble MIP39c2-SP#: 39  Author(s): @danik Contributors:  Tags: core-unit, cu-sas-001, mandate Status: Formal Submission Date Applied: 2023-02-08 Date Ratified: Forum URL: https://forum.makerdao.com/t/mip39c2-sp39-modifying-sidestream-auction-services-core-unit-mandate-sas-001/19738 Ratification Poll URL:   Sentence Summary MIP39c2-SP39 modifies the mandate of SAS-001: Sidestream Auction Services Core Unit.  Paragraph Summary Modify the mandate to reflect the expanded scope of the CU. Renaming CU to Sidestream Automation Services (SAS).  Specification  Core Unit ID SAS-01  Motivation With the Pregame many things have changed for SAS. We broadly expanded our CU work scope to maximize our effectiveness for the DAO. In the past months, Auctions and Liquidations became a smaller fraction of our daily work. We’ve described our expanded work scope in our new budget MIP and in our 2 recent monthly updates. SAS strives to become a trusted custom software development service provider for SubDAOs. This is in accordance with the Endgame plan, where individual SubDAOs will focus on providing value where they know best, without the need to specialize in software development.  Core Unit Mandate With the mandate update, SAS will pursue the technical opportunities in the DAO that are most effective (not being limited to auctions and liquidations anymore). We strive to acquire as many project-based funded MakerDAO projects as possible. For that, we expanded our development capabilities and have now a Web3 Full-Stack offering: Smart contract, API, and decentralized frontend development services accompanied by Product Management and Infrastructure work. To reflect this change (but avoid changing the proven CU acronym), we would like to rename the CU into Sidestream Automation Services (SAS).  Related Documents  MIP40c3-SP95: Modifying Sidestream Auction Services Core Unit Budget (SAS-001) SAS Monthly Update: January 2023 SAS Monthly Update: December 2022  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp95-modifying-sidestream-auction-services-core-unit-budget-sas-001/19737",
                        "https://forum.makerdao.com/t/sas-monthly-update-january-2023/19714",
                        "https://forum.makerdao.com/t/sas-monthly-update-december-2022/19336",
                        "https://forum.makerdao.com/t/weekly-mips-update-130/20226",
                        "https://forum.makerdao.com/t/weekly-mips-update-125/19812",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806/69",
                        "https://forum.makerdao.com/t/weekly-mips-update-129/20172",
                        "https://forum.makerdao.com/t/weekly-mips-update-128/20070",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/106",
                        "https://forum.makerdao.com/t/weekly-mips-update-127/20001",
                        "https://forum.makerdao.com/t/weekly-mips-update-126/19881"
                    ],
                    "GPT-summary": "The post is a formal submission of a proposal to modify the mandate of the Sidestream Auction Services Core Unit (SAS-001) in MakerDAO. The proposal aims to reflect the expanded scope of the CU, which now offers custom software development services for SubDAOs. The author explains the motivation behind the proposal and the changes to the mandate, and provides related documents for further information. The post does not contain entirely positive or negative feedback, but rather explains the proposal and invites collaboration.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Board composition",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.938741405653171
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "09/02/2023-04:58:40",
                    "content": "This is a summary of this proposal from GovAlpha’s perspective.  MIP39c2-SP39 modifies the mandate of the SAS-001: Sidestream Auction Services Core Unit. This proposal would modify the SAS work scope to become a trusted custom software development service provider for SubDAOs, as described in their budget MIP and recent monthly updates. The updated mandate would allow SAS to pursue technical opportunities in the DAO beyond auctions and liquidations, and to acquire as many project-based funded MakerDAO projects as possible. SAS has expanded its development capabilities to offer Smart contract, API, and decentralized frontend development services, accompanied by Product Management and Infrastructure work. The CU will be renamed to Sidestream Automation Services (SAS) to reflect its expanded scope while retaining the proven CU acronym. This subproposal has been assigned High-Impact based on the methodology listed here.  Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. Updated 2023-03-09 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.653061224489796
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#3",
                    "likes": "0",
                    "time": "20/02/2023-17:42:12",
                    "content": "This is a placeholder. The author of the MIP is requiring feedback from MKR holders concerning the need for SAS-001 to submit a Mandate Modification subproposal (MIP39c2-SP39). The author affirms that SAS-001 has expanded their mandate to accommodate to Endgame. Details of the expanded scope can be found under the “Related Documents” section. CC @Recognized-Delegates ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "1",
                    "time": "21/02/2023-15:23:44",
                    "content": "    danik:  During the RFC phase we hope to receive feedback from MKR holders, whether an official update of our mandate is helpful or if the explanations in the other documents are sufficient.   From a few perspectives, I’d say it is a good idea to update the mandate. Though I’d hesitate to say it’s a requirement. First, someone less familiar with Maker trying to understand what exactly the SAS Core Unit does is at least as likely to land on the mandate MIP than they are on the most recent budget MIP. In terms of clarity and preventing misunderstanding, updating the mandate to be consistent with the most recent budget is a good idea. Second, updating the mandate will give you more freedom for spending your budget. As a general rule, mandates can be more general than budgets. If an expense comes up that isn’t covered by the budget, the mandate is what you’d use to justify that expenditure. If the mandate and the budget are in conflict, or are simply unrelated, it becomes harder to justify adjusting spending within the limit of your budgeted funds.  Given the reality of things with Endgame implementation, this may just be not worth the time, though. My understanding is that most of the MIPs (both in RFC and not) are not compatible with Endgame and will be removed at some point in the near future. I suspect core unit mandates fall into this category. If that is the case, the question becomes whether you believe it’s worth putting in the effort to do the ‘right’ thing, given that the definition of ‘right’ is predicted to change in the near future.  This reply probably just makes the decision more complicated, so apologies for that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.739247311827956
                },
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#5",
                    "likes": "1",
                    "time": "23/02/2023-06:43:12",
                    "content": "Thank you for bringing in some pros and cons. Based on this and a few other conversations, we’ve decided to pursue requesting an update of our mandate to reflect the current and future nature of the team’s work and to be as transparent as possible. cc: @Recognized-Delegates we have updated this MIP and also the Budget MIP based on feedback that I received so far. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#6",
                    "likes": "2",
                    "time": "08/03/2023-09:14:22",
                    "content": "I’m formally submitting this proposal for the March cycle. @MIP-Editors ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "2165"
}