{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/1-2-3-blindspots-check-core-units-we-need/6972",
            "title": "1, 2, 3, Blindspots check! Core Units we need? \\xf0\\x9f\\x95\\x8a ",
            "index": 6972,
            "category": [
                "Core Units"
            ],
            "tags": [
                "core-unit"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#1",
                    "likes": "17",
                    "time": "11/03/2021-14:05:04",
                    "content": "As the Foundation keeps dissolving and handing over (or archiving) all the existing projects, we must guarantee continuity. While new Core Units form and some people leap over to the DAO, it is essential to ensure that no vital function is left underserved. Those of us on the receiving end would appreciate a heads-up if there’s anything we should take care of that is utterly crucial. TechOps? A vet for the office dogs? The yoga teacher for the off-site meetings? Please let us know. Doing so will help direct new Core Units forming and nudge adjacent Core Units could take over the responsibility. Happy to talk to discuss it in private if you feel like remaining anonymous. Your Operational Support team. PS, if no Core Unit can take over the responsibility, Operational Support will do it. @amyjung is already learning Kubernetes while I struggle with Vyper. I might or might not be looking at you, @Derek, @wouter, @rune, @charlesstlouis, @brianmcmichael, @g_dip… and anyone that might have an idea (no matter how wild). ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-36/7039",
                        "https://forum.makerdao.com/t/maker-relay-ep-36-en-espanol/7053",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-march-14th-2021/7058",
                        "https://forum.makerdao.com/t/governance-at-a-glance-march-12-18/7085",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-12-18-2021/7089",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-133-thursday-march-18-17-00-utc/6982/2",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-22-24-2021/7192",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/21",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-134-thursday-march-25-17-00-utc/7095/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-132-thursday-march-11-17-00-utc/6859/5",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-25-30-2021/7275"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.611363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#2",
                    "likes": "6",
                    "time": "12/03/2021-20:21:43",
                    "content": "1. Community Management I’m curious to hear people’s thoughts on what this transition means with regard to MakerDAO’s relationship with the community. CommDev has been responsible for this up until now and MakerDAO isn’t going to suddenly stop having a relationship with the community just because CommDev is going away. In this new paradigm, I could see ‘community’ encompassing things like events, bounties and project-based jobs, recruitment, customer support, contests, and opportunities to feature community-created content. Some of these functions fall within the mandate of core units that have been proposed but maybe it would be helpful to have a Core Unit to centralize at least some of these efforts? Whether it’s a Core Unit or just a project coordinated between members of different Core Units, I think we should continue to have a group responsible for community management. 2. Legal @layerzero Any update on how things are coming with the Legal Core Unit? I think it’s in everybody’s best interest to have a well-compensated legal department responsible for mitigating legal risk for other Core Units and the DAO itself. 3. Tech Ops What digital properties are going to be managed by the Dai Foundation vs Core Units? How are tech, content, and design going to work together to maintain web properties like makerdao.com? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.670454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/03/2021-17:26:18",
                    "content": "    juan:  PS, if no Core Unit can take over the responsibility, Operational Support will do it. @amyjung is already learning Kubernetes while I struggle with Vyper.   This is great! Regardless of the subject of the topic, at least we can have a copy of UNI v1 or of CurvDAO now . K8s, nice! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.604166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#4",
                    "likes": "0",
                    "time": "15/03/2021-19:40:36",
                    "content": "Is there a consolidated and summarized list somewhere of every proposed Core Unit? Would be very helpful in this exercise to identify gaps and potential overlap rather than scrolling through the MIPs forum and reviewing each proposal one by one. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#5",
                    "likes": "5",
                    "time": "15/03/2021-19:44:41",
                    "content": "    Aes:  consolidated and summarized list somewhere of every proposed Core Unit   https://coreunit.makerdao.network ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#6",
                    "likes": "0",
                    "time": "15/03/2021-21:14:34",
                    "content": "Exactly, what I was looking for, thanks! I’m surprised no one has mentioned Corporate Finance and Accounting - is Accounting being outsourced through AccountAble currently? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#7",
                    "likes": "0",
                    "time": "15/03/2021-22:22:25",
                    "content": "It is not. @SebVentures has started exploring this space. He made a couple of really good presentations. I also believe there’s a Community Call somewhere where he goes more in detail. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#8",
                    "likes": "1",
                    "time": "15/03/2021-22:24:23",
                    "content": "The Real-World Finance Core Unit is dealing somewhat with that. You can check MakerDAO financials here. We also provide a financial presentation every month. ",
                    "links": [
                        "https://explore.duneanalytics.com/public/dashboards/DpFphwlksHG2tV7xPXQRahQNBZXNVjiuiSpKQbui",
                        "https://docs.google.com/presentation/d/17cGn6LxbAN2rlTTGAbsTvkJW83darysoKCkARv1sxlY/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#9",
                    "likes": "7",
                    "time": "16/03/2021-07:31:10",
                    "content": "I just wanted to say that this thread brings up a very good point. There are quite a few responsibilities the Foundation is taking care of that aren’t necessarily on the radar of the community. We are working with the teams to list these responsibilities, as well as the code repositories that will be handed over. It may take a couple more weeks, but we’ll definitely put them here to create that comprehensive overview so that we can avoid anything important falling through the cracks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.341666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#10",
                    "likes": "0",
                    "time": "16/03/2021-08:57:23",
                    "content": "In addition to the MIP Portal we will likely need a Core Unit Portal at some point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#12",
                    "likes": "3",
                    "time": "18/03/2021-17:26:19",
                    "content": "    williamr:  K8s, nice!    image800×251 52.8 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#13",
                    "likes": "7",
                    "time": "19/03/2021-01:28:21",
                    "content": "In the interest of checking blind spots, I started a graphic showing which Core Units are proposing to take responsibility for all of the digital properties owned by MakerDAO and which channels they might need access to in order to fulfill their mandate. None of these are set in stone; please feel free to comment and I’ll do my best to keep it up-to-date.    Figma – 16 Mar 21    Figma Created with Figma      ",
                    "links": [
                        "https://www.figma.com/file/98PbE5Nf5pe2a6qeOMMVSB/Untitled?node-id=7:2",
                        "https://forum.makerdao.com/t/bd-team-growth-cu-maker-community/7348/4",
                        "https://forum.makerdao.com/t/mip39c2-sp5-content-production-core-unit-mkt-001/6823/4"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen_Chu",
                    "index": "#14",
                    "likes": "4",
                    "time": "19/03/2021-02:45:12",
                    "content": "Thanks, Seth, for getting this started. Strategic Marcomms unit has listed social media, including Linkedin, Facebook, and Twitter, as part of their proposed mandate. Managing the content of MakerDAO homepage and Maker blog will also be key pieces and crucial for the unit. The plan shared earlier in March in Rocket Chat’s #core-unit-operating-model-onboarding will be formally submitted for a request for feedback next week. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.194444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#15",
                    "likes": "2",
                    "time": "19/03/2021-11:26:40",
                    "content": "Great Figma diagram @seth ! I’d add to that list a front end/applications team responsible for building/extending the existing governance portal/governance tools, developer experience, mkrgov-type frontends as well. The foundation JS team is working on a MIP proposal for this at the moment. ^ This also makes me think about ownership of docs.makerdao , which at a first glance would probably be a combination of Integration team, SC, frontend team input for documentation support with overall site ownership held by an overarching group. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#16",
                    "likes": "1",
                    "time": "19/03/2021-11:52:41",
                    "content": "Thanks for the diagram, @seth! Pinging @LongForWisdom to get his thoughts on the ownership of the Governance Portal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#17",
                    "likes": "3",
                    "time": "19/03/2021-11:56:47",
                    "content": "Having a tech-ops group keep these platforms running day-to-day is preferable I think. GovAlpha can organise changes and development work if it’s required (maybe with another core unit with that responsibility, or maybe with an external group.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#18",
                    "likes": "2",
                    "time": "20/03/2021-01:04:43",
                    "content": "I was going to add “automation of governance” as use case along with k8s auto-deploy. But thought it could piss off people  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#19",
                    "likes": "1",
                    "time": "02/04/2021-13:33:08",
                    "content": "I noticed the Maker Developer portal is missing from the chart. The ownership should presumably go under Front-End/Applications? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#20",
                    "likes": "0",
                    "time": "07/04/2021-12:35:38",
                    "content": "That portal is for SCD, and is therefore very outdated. Did you mean docs.makerdao.com? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.91875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#21",
                    "likes": "0",
                    "time": "07/04/2021-12:44:04",
                    "content": "Were there any plans on updating that page? Or have we retired it and moved to docs.makerdao.com? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#22",
                    "likes": "3",
                    "time": "09/04/2021-06:47:36",
                    "content": "One thing I haven’t seen yet, which is present in most public companies, is an oversight function. Usually, there is a board of directors with a senior management team being held accountable to them fulfills this role. With MakerDAO that Board is replaced with MKR voters, but how do MKR voters know that Core Units are being managed well? Are there standards? Should there be a dedicated Oversight CU to set those standards and report on them? Or can we take a different approach? Does a Governance Communications Core Unit make sense instead? The GCCU is in RFC, with a mandate that is being revised by its author(me). One focus of our mandate is to work with CU facilitators to set standards for CU reporting. Between that and the part of the mandate that involves forming relationships with MKR holders, it seems like we are naturally positioned to replace the oversight function with standards and transparent reporting. If facilitators are failing or underperforming, MKR voters need to know and understand why or at least what the failed results are and whether the facilitator is able to bounce back or carry on. In practice, governance communications not only provides a platform for shared updates and reporting but also help sharpen the accountability side of MakerDAO by understanding MKR voter needs and working to set reasonable standards for reporting. MakerDAO is still in early crypto-company mode. If it wants to be taken seriously by a wider range of stakeholders, new investors, and the world it needs to set the bar high for reporting and accountability to MKR holders. Anyway, these are just some late night thoughts. The scope for Governance Comms includes other things that I didn’t mention here, so this isn’t the full picture of that CU. This was just a rant on accountability to voters and the necessity of getting our practices up to par. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.109507575757576
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#23",
                    "likes": "0",
                    "time": "09/07/2021-12:48:29",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}