{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip58c4-sp1-rwa-foundation-broker-onboarding-expensing-for-professional-services/19997",
            "title": "MIP58c4-SP1: RWA Foundation Broker Onboarding & Expensing for Professional Services ",
            "index": 19997,
            "category": [
                "Maker Improvement Proposals",
                "Formal Submission"
            ],
            "tags": [
                "mips",
                "rwa",
                "rwa-foundation",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/dsm",
                    "index": "#1",
                    "likes": "10",
                    "time": "28/02/2023-00:12:11",
                    "content": " MIP58c4-SP1: RWA Foundation Broker Onboarding & Expensing for Professional Services  Preamble MIP58c4-SP#: 1 Author(s): @dsm Contributors: @SebVentures, @Aes Status: Formal Submission Date Applied: 2023-02-27 Date Ratified:   Sentence Summary  A DAO Resolution to instruct the directors of the RWA Foundation to onboard with a new prime broker and to expense legal and accounting fees for services provided by professional services firms to the RWA Foundation.   Specification  Motivation From time to time, the RWA Foundation needs to engage professional services firms to provide services that assist the RWA Foundation with carrying out its mandate. This DAO Resolution seeks to authorize the directors of the RWA Foundation to: (i) onboard with a new broker that is suitably qualified to play the role of Exchange Broker for the Huntingdon Valley Bank transaction; (ii) engage Ogier for legal services and/or another legal services provider to the extent other legal needs arise (e.g., advising directors on the legal implications of DAO Resolutions); (iii) engage an accounting firm that is suitably qualified to provide accounting services that are required to keep the RWA Foundation in good standing; and (iv) expense no more than $25,000 per year in fees for services rendered in connection with each of (ii) and (iii) to the RWA Master Participation Trust. For purposes of clarity, the directors of the RWA Foundation can only spend a maximum of $25,000 per year on legal services and a maximum of $25,000 per year on accounting services.  RWA Foundation designation  RWA Foundation, Company No: 381281.   DAO Resolution type  Instruction to directors   DAO Resolution instruction  The directors of the RWA Foundation are instructed to:  (i) onboard with a new broker that is suitably qualified to play the role of Exchange Broker for the Huntingdon Valley Bank transaction; (ii) engage Ogier for legal services and/or another legal services provider to the extent other legal needs arise; (iii) engage an accounting firm that is suitably qualified to provide accounting services that are required to keep the RWA Foundation in good standing; and (iv) expense fees for services rendered in connection with (ii) and (iii) to the RWA Master Participation Trust, provided total fees do not exceed $25,000 per year for legal services and $25,000 per year for accounting services. ",
                    "links": [
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/53",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/48",
                        "https://forum.makerdao.com/t/mip102c2-sp1-mip-amendment-subproposals/19703/15",
                        "https://forum.makerdao.com/t/coldiron-eth-delegate-platform/11193/172"
                    ],
                    "GPT-summary": "The post is a formal submission of a DAO resolution, MIP58c4-SP1, which seeks to authorize the directors of the RWA Foundation to onboard with a new broker and engage professional services firms for legal and accounting services. The proposal explains the motivation behind the resolution and provides specifications for the engagement of professional services firms. The post does not contain any advertising or collaboration requests, entirely positive or negative feedback, or auditing and reviewing of the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.626420454545454
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/02/2023-00:12:16",
                    "content": "This is a summary of this proposal from GovAlpha’s perspective.  This is a valid MIP58c5 subproposal - it is the first time that this component has been used. This DAO Resolution instructs the directors of the RWA Foundation to take several actions to support the Foundation’s work. The directors are instructed to onboard with a new prime broker, engage legal and accounting firms as needed, and expense no more than $25,000 per year in fees for services provided by these firms to the RWA Master Participation Trust. The legal and accounting firms are expected to provide services that help keep the RWA Foundation in good standing and ensure compliance with legal requirements. The total fees for legal and accounting services are not to exceed $25,000 per year each. The purpose of these actions is to support the RWA Foundation in carrying out its mandate, which includes engaging professional services firms as needed. This subproposal is valid to go on chain in the weekly cycle week beginning 2023-03-20. This subproposal has been assigned Medium-Impact based on the methodology listed here.  Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. Updated 2023-03-09 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.745454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#3",
                    "likes": "7",
                    "time": "28/02/2023-01:57:58",
                    "content": "I strongly recommend that the Maker community support this MIP. The situation with Genesis clearly dictates the need for a new broker. It will be important, however, to have the new broker accept the inflexible structure implemented in the existing arrangement. I recommend that Ankura Trust be fully informed of any developments as they have responsibility to monitor the RWA Foundation account. The engagement of an accounting firm is important for general compliance. In the interest of full disclosure, neither I nor North Lakes Legal will benefit from the passage of this MIP. I am simply pleased to see RWA Foundation continue to evolve. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.877525252525252
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#4",
                    "likes": "0",
                    "time": "28/02/2023-20:46:21",
                    "content": "Is RWA Foundation under SF CU? Apology but what’s the relationship? And is this asking for separate budget? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#5",
                    "likes": "3",
                    "time": "28/02/2023-22:09:32",
                    "content": "    Doo_StableLab:  Is RWA Foundation under SF CU?   No, RWA Foundation is autonomous and orphaned. But MKR holders, and only them, can provide direction to it. SF just happened to have looked at the things that need to be done there while monitoring RWA.     Doo_StableLab:  And is this asking for separate budget?   Yes and no, the expenses we are talking would be taken from the HVB deal, just like Ankura, WSFS and the other service providers for RWA Foundation. Or, in MIP65, like service providers of James Asset PTC. The RWA Foundation was setup to have little power and autonomy in order to protect Maker as much as possible. But the counterparty is that Maker should watch over the RWA Foundation. If we don’t onboard a new broker, you are betting on Genesis Trading only. If you don’t onboard Ogier, directors might not execute follow up resolution as they can’t be advise on the legality of it. If you don’t onboard an accounting firm, the RWA Foundation will at some point not be in good standing. Decision is up to MKR tokenholders. I would have less to do if you vote it down, but it is my duty to advise to vote it. There is exactly no reason to vote it down. In the endgame, probably better to use arrangers to take care of those administrative problems. But so far no one wanted to deal with it. It will probably be more expenses. PS: We also need to check TACO (the Foundation used for Blocktower MIP6). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.381589330808081
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#6",
                    "likes": "0",
                    "time": "28/02/2023-22:22:44",
                    "content": "Thanks for the detailed responses Seb. I think this voting will happen after the Endgame vote, so will have to see how the new governance views it but do agree that it would be good to hear perspective from others like @Allan_Pedersen ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.795454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#7",
                    "likes": "0",
                    "time": "20/03/2023-17:39:25",
                    "content": "    SebVentures:  No, RWA Foundation is autonomous and orphaned. But MKR holders, and only them, can provide direction to it. SF just happened to have looked at the things that need to be done there while monitoring RWA.   Thanks for keeping a close eye on this. Very much appreciated. I don’t see any negative effect that could come from diversifying the brokerage and obtaining counsel. What downsides could you think of? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#8",
                    "likes": "0",
                    "time": "21/03/2023-03:01:51",
                    "content": "hellos, would be great to have a draft copy of the actual resolution to review ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#9",
                    "likes": "1",
                    "time": "21/03/2023-06:50:42",
                    "content": "    rspa:  I don’t see any negative effect that could come from diversifying the brokerage and obtaining counsel. What downsides could you think of?   Some costs, work? The RWA Foundation might be able to take a look at the Paxos proposal (which is currently stuck as the RWA Foundation can’t have legal counsel). @fumoffuXx the actual resolution is on the top of the thread, MIP58c4-SP1 is the resolution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#10",
                    "likes": "0",
                    "time": "21/03/2023-07:06:31",
                    "content": "Isnt there a written driw whicb has to be filed? Or the memorandum allows it to be done this way ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}