{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-how-important-is-decentralized-governance/10882",
            "title": "[Informal Poll] How Important Is Decentralized Governance? ",
            "index": 10882,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "voting",
                "informal-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "1",
                    "time": "10/10/2021-00:49:46",
                    "content": "We all use the term “decentralized” a lot, so this will already be subjective to your personal definition, but with recent head scratching about mitigation of legal tail risks, I wanted to just ask everyone an important question: How important is it that a DAO like ours have decentralized governance? For the purposes of this question, let’s assume decentralized = unconcentrated voting power.    How important is decentralization of governance to Maker?  Essential Important, but not essential Not important Abstain     0 voters     Thanks for participating. Please leave any additional thoughts in the comments. Poll closes in a week. ",
                    "links": [],
                    "GPT-summary": "The author of the post is asking for feedback on the importance of decentralized governance in a DAO like theirs. They provide a poll with options for the readers to choose from and ask for additional thoughts in the comments.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.557692307692308
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "3",
                    "time": "10/10/2021-02:53:22",
                    "content": "It is an ironic poll coming from one of our largest delegates! For me, decentralization is a short-hand for  transparency flat power structure censorship resistance fewer single points of failure  I do not think that voting is great because voting is great. The point of voting is to make wise decisions that will maximize benefit for MKR holders. I guess the reason we use voting is because nobody wants an illegitimate, unwise leader. However, voting does not guarantee great decisions. Voting will have results that are informed by a weighted average of how educated the voters are. Delegation, or concentrated voting power, is important because it costs a lot of time to become educated. Better if we can delegate to a few people who invest a lot of time in becoming extremely well informed about Maker and decide wisely. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.472470238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "1",
                    "time": "10/10/2021-03:19:15",
                    "content": "    psychonaut:  It is an ironic poll coming from one of our largest delegates!   No one can be all things to all people, so it’s good to just ask opinions regularly. The worst that can happen is someone tells you something you don’t want to hear. That can be the best thing, as well, depending upon circumstances. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#4",
                    "likes": "1",
                    "time": "10/10/2021-06:43:31",
                    "content": "    PaperImperium:  depending upon circumstances   I wish I could say something reassuring about legal tail risks.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#5",
                    "likes": "0",
                    "time": "10/10/2021-07:14:11",
                    "content": "I’m curious how you would like to interpret the results. If we were to decide that it was essential that voting power was spread evenly across a large number of players or on the other end of the scale, if we decided that we don’t mind one entity, e.g. the Foundation, calling the shots - what next in each of those cases? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.989285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#6",
                    "likes": "3",
                    "time": "10/10/2021-07:33:10",
                    "content": "I care more about the quality of governance than the decentralization aspect. But in theory decentralization should help with that as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#7",
                    "likes": "9",
                    "time": "10/10/2021-09:15:56",
                    "content": "Decentralization is a means to an end. The end goal is good decision making that cannot be corrupted. Following this strictly to its conclusions, theoretically one could say that decentralization is not essential. But I strongly believe that decentralized governance for the Maker protocol is essential, because it leads to the best decision making:   Resilience: quite simply, a single (or very few) decision makers form a bottlenecked point of failure that we simply cannot afford. This doesn’t need much explanation. A single person or small group’s decision making may fail by loss of interest, distraction, hubris, lack of knowledge to deal with a new situation, burnout, other mental health issues, legal pressure, coercion, death by colliding objects, etc. The list is endless.   Incentive alignment: if we want to scale, Maker will need many people working on it. And if many people are working on the protocol, we better make sure that their incentives are aligned. A plutocratic model with voting power proportional to token ownership works well in this regard. While I’m a strong believer in democracy for wider society (because participation isn’t voluntary and a person is more than how rich they are), democracy wouldn’t work for a blockchain protocol like Maker because there’s a lack of incentive alignment. That said, I love how much soft power has become a part of Maker governance. While MKR voting power has the last say, a well articulated opinion carries a lot of weight. This is good because it biases towards sound logic. MKR holders’ bags should be the counter-weight that keeps populism at bay.   Sense of ownership: this is an argument about the motivation of the people working on Maker. The energy and dedication from the DAO comes from a shared sense of ownership and this is the reason why everyone working for Maker should be compensated with at least a little bit of MKR.   Bandwidth: once resilience, incentive alignment and sense of ownership are in place, it is time to unlock the superpower of the DAO: hacking the delegation problem. One of the main challenges of centralized organizations is the inability to effectively delegate. Because every decision in the end needs to be traced back to the stamp of approval of a small group of people with limited time, the entire operation is constrained by that group’s processing bandwidth. By removing centralized bottlenecks and decentralizing decision making, we turn single-threaded computing into massive parallelism. A decentralized organization can grow exponentially, but it requires that we build factories not cars: the blueprint that can be repeated and repeated by everyone who lay their hands on it. Like a self-replicating machine, groups of people can organize independently and become unstoppable. This is why we need to focus on education, training, and open-sourcing all the things; not just programming code but also our legal frameworks and process documentation.   Diversity: as Maker is a global and open organization that requires a sense of ownership to operate, everyone needs to feel welcome so that they can participate. A centralized leadership cannot be very diverse. Decentralization helps with this. Needless to say we can still do a lot better in this regard.   Consistency: centralization can work and decentralization can work. What cannot work is a Frankenstein creation of centralized and decentralized elements. Blockchain technology, the platform we build on, is fundamentally decentralized. It’s a well established principle in software engineering that organizations should mirror their infrastructure. If we want to run a centralized operation, why on earth would we want to use a blockchain!? They are really slow and expensive databases, you know. The reasons are decentralization, resilience and trustlessness.   Blockchain, the Maker protocol, are decentralized by nature. This is how the entire thing was constructed. Centralizing governance now makes as much sense as switching an electric car to gasoline while driving. Let’s reconfirm this and focus on how we can make decentralization work. ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Conway%27s_law"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6170985461079805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#8",
                    "likes": "2",
                    "time": "10/10/2021-12:43:25",
                    "content": "    AstronautThis:  what next in each of those cases?   I think I’m just taking a temperature check at the moment. The big danger would be relying upon “decentralization” as a legal/regulatory/marketing strategy while being quite centralized. I’m not sure either bucket is inappropriate, but we want to avoid “falling between two chairs” (a phrase Wouter used a few days ago and I’m stealing). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "09/01/2022-18:44:11",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}