{
    "poll_list": [
        {
            "title": "MIP14: Inclusion Poll for Protocol DAI Transfer - June 8, 2020",
            "index": "2462",
            "option": "No",
            "supporting_mkr": "16,258",
            "highest_fraction": 0.94
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip14-protocol-dai-transfer/2462",
            "title": "MIP14: Protocol DAI Transfer ",
            "index": 2462,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "mip-14"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "4",
                    "time": "12/05/2020-13:27:02",
                    "content": " MIP14: Protocol DAI Transfer  Preamble MIP#: 14 Title: Protocol DAI Transfer Author(s): @LongForWisdom Contributors: N/A Type: Process Status: Request for Comments (RFC) Date Proposed: 2020-05-12 Date Ratified: <yyyy-mm-dd> Dependencies: MIP0 Replaces: N/A   References MIP14c2-Subproposal-Template.md  Sentence Summary MIP14 defines a generic process for transfering DAI from the Maker Protocol to a target ethereum address.  Paragraph Summary MIP14 defines a generic process for transfering DAI from the Maker Protocol to a target ethereum address. This process is a fallback method of transferring value from the protocol in the event that a more specific process does not exist to do so.  Component Summary MIP14c1: Considerations Regarding Protocol DAI Transfers A component which outlines the various considerations that should be made before transferring DAI out of the protocol using MIP14c2. MIP14c2: Protocol DAI Transfer Process A process component that allows Maker Governance to transfer DAI from the Maker Protocol to a target ethereum address. MIP14c3: Protocol DAI Transfer List A list component that lists the previous direct DAI transfers that have been made by the protocol in the past.  Motivation Giving governance the ability to use the value generated by the Maker Protocol is beneficial for two main reasons:  It allows Maker Governance to incentivise actions taken to improve the protocol. It reduces Maker Governance’s reliance on the Maker Foundation.  Less reliance on the Foundation moves the protocol towards decentralization. Creating a process to allow Maker Governance to spend the value accrued by the protocol empowers Maker Governance to build and improve the protocol in the future.  Specification / Proposal Details MIP14c1: Considerations Regarding Protocol DAI Transfers There are several important considerations to take into account before transferring value out of the Maker Protocol.  Transfer of DAI from the protocol to an external address that is not controlled by Maker Governance is a one-way operation. Transfer of DAI from the protocol will take DAI from the surplus buffer if available. If there is insufficient DAI available in the surplus buffer unbacked DAI will be created and FLOP auctions will be able to be triggered immediately. If there is a more specific process MIP that allows DAI transfers that is more appropriate to the use case, use that process instead.   MIP14c2: Protocol DAI Transfer Process MIP14c2 is a Process MIP component that allows Maker Governance to transfer DAI from the Maker Protocol to a target ethereum address. Note that MIP14c2 subproposals are technical subproposals, they define executive code that transfers DAI from the Maker Protocol to one or more target addresses. If a MIP14c2 subproposal is Accepted, The DAI Transfer is appended to the list in MIP14c3 by a MIP Editor. MIP14c2 subproposals have parameters that depend on the total amount of DAI to be transferred (even if split among multipe target addresses) according to the following logic: < 10,000 DAI Transfer   Feedback Period: 0 full weeks  Frozen period: 0 full weeks  10,000 - 100,000 DAI Transfer   Feedback Period: 4 full weeks  Frozen period: 1 full week  > 100,000 DAI Transfer   Feedback Period: 12 full weeks  Frozen period: 4 full weeks  MIP14c2 subproposals must use the template located at MIP14c2-Subproposal-Template.md. This template is considered ratified once this MIP moves to Accepted status.  MIP14c3: Protocol DAI Transfer List This list can be amended through subproposals created under MIP14c2. List Entry Template Entries into this list should follow the following template: Reason: Sub-proposal Number: # Date Ratified: (yyyy-mm-dd) Amount Transferred: Recipient Address:  Historical Transfer List There are currently no historical transfers. Below is an example transfer which should be removed (as should this paragraph) when the first ratified transfer is added to this list . Reason: Funding Chocolate for Governance Facilitators Sub-proposal Number: MIP14c1-SP0 Date Ratified: 2020-02-30 Amount Transferred: 1,000,000 DAI Recipient Address: 0x0000000000000000000000000000000000000000   ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-17-pt-br-portugues/4810",
                        "https://forum.makerdao.com/t/maker-relay-ep-17-en-espanol/4804",
                        "https://forum.makerdao.com/t/maker-relay-ep-17/4798",
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaration-of-intent-strategic-reserves-fund-srf/3765",
                        "https://forum.makerdao.com/t/poll-creation-of-a-makerdao-strategic-reserves-solving-the-peg/3638",
                        "https://forum.makerdao.com/t/weekly-mips-update-10/3429",
                        "https://forum.makerdao.com/t/informal-poll-to-improve-mip14-protocol-dai-transfer/3427",
                        "https://forum.makerdao.com/t/a-word-on-the-psm-concept-and-next-steps-for-the-foundation/3293/12",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-98-thursday-june-25-9am-pst-4-00-pm-utc/2878/3",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-98-thursday-june-25-9am-pst-4-00-pm-utc/2878/2",
                        "https://forum.makerdao.com/t/vault-compensation-plan-proposal/2900",
                        "https://forum.makerdao.com/t/signal-request-vault-compensation-working-group-payment/5562/10",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-june-11-9am-pst-4-00-pm-utc/2742/4",
                        "https://forum.makerdao.com/t/weekly-mips-update-5/2833",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-june-11-9am-pst-4-00-pm-utc/2742/3",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-may-27-9am-pst-4-00-pm-utc/2655/3",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-may-27-9am-pst-4-00-pm-utc/2655/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-june-4-9am-pst-4-00-pm-utc/2737/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-3/2678",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-may-21-9am-pst-4-00-pm-utc/2579/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-may-14-9am-pst-4-00-pm-utc/2497/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-may-14-9am-pst-4-00-pm-utc/2497",
                        "https://forum.makerdao.com/t/maker-vault-compensation-updates-and-status/2583/41",
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaracion-de-intenciones-fondo-de-reservas-estrategicas-srf/5385",
                        "https://forum.makerdao.com/t/maker-relay-ep-19/4975",
                        "https://forum.makerdao.com/t/mip14-transferencia-de-dai-del-protocolo/4934",
                        "https://forum.makerdao.com/t/maker-relay-ep-18-pt-br-portugues/4891",
                        "https://forum.makerdao.com/t/maker-relay-ep-18-en-espanol/4882",
                        "https://forum.makerdao.com/t/maker-relay-ep-18/4881"
                    ],
                    "GPT-summary": "The post presents MIP14, which defines a process for transferring DAI from the Maker Protocol to a target ethereum address. The proposal is motivated by the benefits of giving governance the ability to use the value generated by the Maker Protocol, which reduces reliance on the Maker Foundation and moves the protocol towards decentralization. The post provides details on the considerations, process, and list components of MIP14. The post is open for feedback and comments, and it also outlines the parameters for subproposals that depend on the total amount of DAI to be transferred.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.761574074074074
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "12/05/2020-13:27:47",
                    "content": "Links to externals don’t go anywhere (because this was written for the mips folder structure in github) https://github.com/makerdao/mips/pull/31 for the pull request into the github conception branch, in which you can see the initial versions of the other files. On the whole MIPX thing, I’ll update this once it’s assigned a MIP number. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#3",
                    "likes": "0",
                    "time": "12/05/2020-15:17:40",
                    "content": "    LongForWisdom:  Frozen period: 0 full weeks   What is this frozen period referring to? We’d pull it out of the system buffer and lock it in some sort of transfer contract? Would love some more explanation there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "12/05/2020-15:49:56",
                    "content": "The frozen period is explained in MIP0. It refers to the amount of time a MIP or Subproposal must remain unchanged before it can be formally submitted into the governance cycle. For MIPs this is always 1 month (though this is modified temporarily by MIP2) Subproposals are able to define their own frozen periods, which is what that value refers to. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "2",
                    "time": "13/05/2020-12:58:01",
                    "content": "When transferring large amounts, can the FLOP auctions be staggered out over of time? For example, if we want to raise 2M DAI then can we run 500k FLOP auctions spread out over 4 weeks? Is this technically possible? I seem to recall that FLOPs could be paused and restarted, but maybe that was a bug? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#6",
                    "likes": "0",
                    "time": "13/05/2020-13:24:24",
                    "content": "Might be something @Kurt_Barry could weigh in on? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#7",
                    "likes": "2",
                    "time": "13/05/2020-17:31:21",
                    "content": "Actually we can and should probably define a transfer increment even though we may have a large total. So I would suggest we amend MIPXc2 to have a maximum transfer increment to limit flop auctions generally. Something like  If DAI to be transferred exceeds current surplus transfer surplus or 100,000 (example) DAI which ever is greater a)  In this case we may want governance approval but if the subproposal is adopted by governance there probably will already be provisions on how to pay for this included if the surplus isn’t sufficient. Have condition to be fulfilled before next 100,000 DAI can be transferred if surplus doesn’t have it. a)   Wait time b)   MKR flop auctions to complete. c)   Other?  (governance approval)  I think we should also consider the idea of having a place to accumulate these transfers that governance can control until sums can accumulate before being disbursed out formally. Just a few thoughts.   Though conceptually this MIP is important. I am not sure if this is something for this MIP or another but conceptually Maker will need a DAI cash account seperated from surplus I think to deal with known cash expenditures (salaries, oracle payments, maintenance and operations bills etc.). Something else to know from an accounting stand point is that we will need to have a Catagory or account # for MIPXc3 here for account tracking beyond Reason:   This could be a DOI MIP number.  The idea of having a catagory is for searching and account tracking.  This can have multiple entries.  Administrative, IT, development, documentation, data, analysis, oracle, insurance, legal, etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.317602040816326
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#8",
                    "likes": "2",
                    "time": "14/05/2020-06:36:25",
                    "content": "IIUC the scenario, we’re talking about sucking 2M DAI into existence. In that case, as the system stands now, the flops would begin immediately. We were able to delay the Black Thursday flops because that bad debt came from liquidations and was thus in the sin queue, which has a modifiable time delay before it releases debt to auction But…why not just raise the 2M DAI over 4 weeks in chunks of whatever makes sense? It should be rather rare to need to generate 2M DAI via MKR all at one time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chaser",
                    "index": "#9",
                    "likes": "1",
                    "time": "14/05/2020-11:31:20",
                    "content": "    MakerMan:  conceptually Maker will need a DAI cash account seperated from surplus I think to deal with known cash expenditures   Agreed, not least to differentiate budget that is there to soften unexpected impact from budget that is used for planned expenses.     Kurt_Barry:  In that case, as the system stands now, the flops would begin immediately. We were able to delay the Black Thursday flops because that bad debt came from liquidations and was thus in the sin queue   I may be misreading the code, but doesn’t suck also add to the sin queue? And in that case, couldn’t you kiss it before it goes on auction? Even if it goes on auction, I thought you can heal from the surplus before the first bid. (Of course both scenarios are relevant only if the surplus is positive and sufficiently big at the time). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.380303030303031
                },
                {
                    "author_link": "https://forum.makerdao.com/u/andytudhope",
                    "index": "#10",
                    "likes": "3",
                    "time": "14/05/2020-14:24:16",
                    "content": "    LongForWisdom:  Both of these should be seen as beneficial for fairly obvious reasons.   These kind of sentences do not belong in MIPs, imo. It is not future-proof, nor does it provide any helpful information. I also agree with @MakerMan that the logic for transfers can be improved. Rather than just categories of 0 - 10 000, 10 000 - 100 000, and > 100 000, why not make specific reference to the surplus buffer? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "0",
                    "time": "14/05/2020-14:33:09",
                    "content": "    andytudhope:  These kind of sentences do not belong in MIPs, imo.   Fair enough, I agree it doesn’t really add anything. I will take it out once this moves to RFC.     andytudhope:  why not make specific reference to the surplus buffer?   In what way? I don’t want to add something like 'this can only be done if there is sufficient DAI in the surplus buffer, because there may be times we want to transfer DAI regardless of the health of the buffer. Separating a single transfer into multiple smaller amounts is problematic from a governance perspective. It would require passing multiple executive votes over multiple months. The chance of one or more failing becomes higher due to bundling. I think much of this can be handled on the governance layer and other MIPs. If MKR Holders want to postpone  a payment until there is sufficient surplus they could pass a Declarations of Intent MIP with that intent. Individual sub-proposal authors can seek feedback on a transfer subproposal before posting it and potentially split it up manually in response to feedback. I guess my point is that I’m not sure that we need logic inside of this MIP to support this behaviour. It’s meant to be a functional fallback option, rather than include lots of complex logic. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.394642857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#12",
                    "likes": "3",
                    "time": "14/05/2020-14:44:10",
                    "content": "Unfortunately, you are misreading the code, although don’t feel bad as it’s kind of the code’s fault for re-using names. You’re conflating Vat.sin, which is the per-address unbacked debt, with Vow.sin, which is the actual sin queue (see here). suck is adding to the former. The only way to add to the sin queue is to call Vow.fess. Btw, if there’s sufficient surplus to heal all debt, the flops will never start in the first place. ",
                    "links": [
                        "https://github.com/makerdao/dss/blob/master/src/vow.sol#L139"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#13",
                    "likes": "0",
                    "time": "14/05/2020-14:45:04",
                    "content": "So if we sucked DAI out and it pushed us into bad debt, FLOPs would start immediately? If that’s the case I will add something to that affect in MIPXc1. Currently it says this:     LongForWisdom:  Transfer of DAI from the protocol will create bad debt and trigger FLOP auctions after the Debt auction delay (wait parameter) if there is not sufficient DAI available in the surplus buffer.   Which is incorrect? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 3.7500000000000004
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#14",
                    "likes": "3",
                    "time": "14/05/2020-14:50:01",
                    "content": "Assuming the conditions in the flop() function are satisfied (or can be satisfied with some initial calls to heal and/or kiss), then the flops() could be started immediately (a Keeper has to make these calls, of course). We could be really hacky and remove the Vow's authorization on the Flopper to block them, I suppose, but as soon as you re-authorize, they can still all start at once, and IIUC the goal isn’t so much a delay, but rather a titration.     LongForWisdom:  Which is incorrect?   Yes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#15",
                    "likes": "0",
                    "time": "14/05/2020-17:10:31",
                    "content": "    LongForWisdom:      andytudhope:  why not make specific reference to the surplus buffer?   In what way? I don’t want to add something like 'this can only be done if there is sufficient DAI in the surplus buffer, because there may be times we want to transfer DAI regardless of the health of the buffer. Separating a single transfer into multiple smaller amounts is problematic from a governance perspective. It would require passing multiple executive votes over multiple months. The chance of one or more failing becomes higher due to bundling. I think much of this can be handled on the governance layer and other MIPs. If MKR Holders want to postpone  a payment until there is sufficient surplus they could pass a Declarations of Intent MIP with that intent. Individual sub-proposal authors can seek feedback on a transfer subproposal before posting it and potentially split it up manually in response to feedback. I guess my point is that I’m not sure that we need logic inside of this MIP to support this behaviour. It’s meant to be a functional fallback option, rather than include lots of complex logic.   One of the few times we might disagree @LongForWisdom I think if Maker wants a MIP for DAI transfer we really want the mechanics of these transfers to be dealt with in this MIP.   What did we have as a criterion for a good MIP - that it was complete. Regarding governance.   Once governance approves a transfer having the actual mechanics in place to actually perform the transfer in a way that:  Takes into account what the surplus buffers is.   If sufficient no problem - do the full transfer.  If not then manage this in such a way as: We don’t completely thrash the MKR market with some huge flop auctions (i.e. control the rate at which MKR is sold).   This is critical not just to proper market functioning, getting the best MKR price, but also for our MKR investors.  These are some basic steps.    Now I can see perhaps one might want to construct another MIPX:  MKR flop auction management but then one is going to have to change smart contracts which we all are agreeing we don’t want to do.    We want to use the mechanics of the system as it is NOW to manage this and it was my understanding if we do progressive suck()'s and whatever else needs to happen we can completely manage the flow of MKR to flop auctions in such a way as to mitigate any issues.    From the point of view of raising DAI it makes sense then to put the mechanics of how we are going to raise the DAI from a surplus and flop in the Protocol DAI Transfer because if the system doesn’t have surplus this will become a governance issue directly. As to having multiple governance votes to do multiple transfers I think this is a moot point particularly from putting the actual DAI raising mechanics into this MIP.   Because no matter what the accumulated DAI necessary to raise it would simply be scheduled into the next system spell as usual until the DAI is raised and has been put into the temporary working cash DAI account and ready for disbursal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.393127705627706
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#16",
                    "likes": "0",
                    "time": "14/05/2020-17:26:19",
                    "content": "    MakerMan:  Regarding governance. Once governance approves a transfer having the actual mechanics in place to actually perform the transfer in a way that:   The issue with this is that Governance cannot approve the transfer without doing the transfer. If we wanted to be able to do this we need to somehow bind the protocol to actions in the future without further votes. It’s  doable with a smart contract, but that adds a level of complexity to this MIP that it does not currently have. It’s possible this would be doable within an executive. I will maybe follow up with devs some more.     MakerMan:  Because no matter what the accumulated DAI necessary to raise it would simply be scheduled into the next system spell as usual until the DAI is raised and has been put into the temporary working cash DAI account and ready for disbursal.   There isn’t a working DAI cash account right now, there is only the system surplus. Sucking into the system surplus is a inefficient way to do nothing. Also, including a suck into each executive until it passes is really dangerous, as it risks all the execs failing if the decision to suck has changed or only barely has consensus. We can’t really rate limit FLOPs in the current system. The best we could do is split up a payment across multiple subproposals. However, there is no point having a process for this written in the MIP, because the process wouldn’t be binding. Imo the best option is leave all of that complexity out, and allow governance to choose to do smaller subproposals to rate-limit FLOPs, or to wait until the surplus buffer has a sufficient amount of DAI on a case-by-case basis. If some reliable convention arises from these case-by-case examples, then this could be codified in the MIP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.620000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#17",
                    "likes": "2",
                    "time": "14/05/2020-17:46:19",
                    "content": "I think there are a few points here:  Maker needs a seperate DAI cash address where DAI can be accumulated seperately from Surplus There exists no mechanics to control the subsequent MKR flop auctions if the surplus is not sufficient. Because of the whole governance bundling issue all governance actions need to be carried out in a single executive.  I think the biggest issue doing anything with this MIP is that governance may balk if we don’t have funds available.   Which might bring me to a point  We might want to do a poll on what governance wants to do about system funding now that our surplus is only 55K.   Do we ask Maker Foundation to kick back some DAI into a governance controlled MKR fund, flop more MKR, or wait.?    Do we need the cash this instant?  No. Increase surplus buffer?!  If we create a cash buffer account seperate from the surplus we probably don’t have to change the surplus buffer just have governance vote to suck() from surplus into the buffer account before the system starts buying MKR.   If we don’t have or use a seperate cash buffer we will definitely want to raise the Surplus buffer level.  I point out while these issues are related they are somewhat orthogonal to the MIP:  Protocol DAI Transfer.   But I can say if this passes and we also get the MIP for Declaration of Intent we are going to quickly need a cash buffer account, and are going to be suck()ing on the surplus and probably at some point triggering MKR flop auctions.   All of this is going to come up and could be a real hitch to passing DOIs.    Just keep this in mind when assembling.   I consider this MIP a key component but there may need to be additional MIP components to actually make this function in the way you are envisioning from a governance and executive perspective. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.488095238095239
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#18",
                    "likes": "0",
                    "time": "14/05/2020-18:51:44",
                    "content": "    MakerMan:  Maker needs a seperate DAI cash address where DAI can be accumulated seperately from Surplus   Maybe but i wouldn’t accept that as a fact at this point. There were tons of concerns about taking large amounts of DAI out of circulation that were brought up by this thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#19",
                    "likes": "1",
                    "time": "14/05/2020-19:01:35",
                    "content": "    MakerMan:  Maker needs a seperate DAI cash address where DAI can be accumulated seperately from Surplus   I agree with this in principal. I’m assuming this would require making a separate smart contract module. Also need to determine what happens to funds in the separate cash account if ES is triggered due to critical bug or governance attack. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.148809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#20",
                    "likes": "0",
                    "time": "14/05/2020-19:02:01",
                    "content": "@Andy_McCall Yeah thanks for reminding me not just about the implications of actually having a working account in DAI to liquidity.    I remember making a suggestion that Maker actually could use DAI to purchase assets that were anticorrelated to collateral prices to help manage liquidity issues. One would sell assets for DAI to actually mop up DAI liquidity.   One would purchase assets for DAI to provide DAI liquidity.   This I saw as a direct DAI injection/removal method. Not sure this would fly at all given the centralization risk but Maker could just purchase other stable coins (PAX, USDC, USDT, whatever) with DAI in such a surplus account pay out to people using those.  It makes things a little more tricky from an accounting perspective but it does allevaite this accumulating cash (in DAI) liquidity issue.    This is a whole other asset and account management is an issue to be sure.  But is a valid approach that alleviates pulling DAI out of markets. I remember not just when Maker system liquidated effect on PEG (normal) but the after effect of this when MKR was flopped sopping up another 5.3M of liquidity to fill the surplus gap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5874999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#21",
                    "likes": "1",
                    "time": "14/05/2020-19:20:46",
                    "content": "    MakerMan:  Not sure this would fly at all given the centralization risk but Maker could just purchase other stable coins (PAX, USDC, USDT, whatever) with DAI in such a surplus account pay out to people using those.   Who is to say? There certainly seems to have been a relaxation of risk aversion as it pertains to centralization risks given the times we find ourselves in. Who knows how that will play out ultimately, but i find myself unable to predict the sentiment of MKR governance as it pertains to centralization. Would love to talk more about the idea as i think it is more or less how i would envision things might work. This may not be the best thread for a deep dive into that though. Maybe discuss it more on the system reserve thread? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.061649659863946
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#22",
                    "likes": "0",
                    "time": "14/05/2020-19:40:13",
                    "content": "    Andy_McCall:  Who is to say? There certainly seems to have been a relaxation of risk aversion as it pertains to centralization risks given the times we find ourselves in. Who knows how that will play out ultimately, but i find myself unable to predict the sentiment of MKR governance as it pertains to centralization. Would love to talk more about the idea as i think it is more or less how i would envision things might work. This may not be the best thread for a deep dive into that though. Maybe discuss it more on the system reserve thread?   I posted to bump that thread as well since a lot of good minds were noodling on the System Reserve topic.     System Reserves Risk       Reposting this here because this has popped up in relation to @LongForWisdom and the MIPX Proposal regarding DAI Protocol Transfer and discussion with @Andy_McCall  Given that Maker governance seems to have relaxed regarding centralization risks on various coins (wBTC, USDC, and who knows what we add next).  Wouldn’t it make more sense to take DAI surplus which one would use as system reserves and general operating funds and convert them into other stablecoin assets:   USDC, PAX, USDT, whatever. …     ",
                    "links": [
                        "https://forum.makerdao.com/t/system-reserves/2069/29"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1476934523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#23",
                    "likes": "1",
                    "time": "15/05/2020-10:17:27",
                    "content": "Updated with assigned MIP number, and moved to RFC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#24",
                    "likes": "2",
                    "time": "18/05/2020-13:11:40",
                    "content": "I’ve made minor wording changes to fix the issue Kurt brought up, and to remove the sentence Andy T brought up. Github RFC branch can be found here: https://github.com/LongForWisdom/mips/tree/ProtocolDAITransferRFC/MIP14 Free free to make PR’s, leave comments here or hit me up to discuss. I would also like to draw attention to the MIP14c2 Subproposal Template located here: https://github.com/LongForWisdom/mips/blob/ProtocolDAITransferRFC/MIP14/MIP14c2-Subproposal-Template.md This will also be ratified if the MIP is accepted. @Kurt_Barry if you could take a moment to look over the executive code snippet in there and potentially improve upon it, that would be appreciated. ",
                    "links": [
                        "https://github.com/LongForWisdom/mips/blob/ProtocolDAITransferRFC/MIP14/MIP14c2-Subproposal-Template.md"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#25",
                    "likes": "2",
                    "time": "18/05/2020-18:51:00",
                    "content": "I think at the schematic level, the code snippet is fine, and I don’t think there’s much point in trying to take it further than that (e.g. who knows maybe someday we’ll write executives in Vyper instead of Solidity or something). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party giving feedback on proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.027777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#26",
                    "likes": "0",
                    "time": "21/05/2020-12:57:25",
                    "content": "Does anyone have further comments or ideas on how to avoid FLOP auctions without making the MIP much more complex? I’m open to PR’s or to discuss the subject in the chat too if someone does want to try to hack something together that takes it into account. One option is to just explicitly write in the MIP that this MIP can only be used once there is sufficient system surplus to cover the suck. But this feels overly limiting, and I’d like to keep it as flexible as possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.023809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#27",
                    "likes": "3",
                    "time": "31/05/2020-23:22:25",
                    "content": "Based on the lack of feedback regarding avoiding FLOP auctions, I have decided to submit MIP14 into the governance cycle for June. @equivrel made some good points on the most recent governance call about explicitly disallowing transfers that trigger FLOP auctions in this MIP. While this would provide an extra layer of protection, I believe that it would limit governance’s ability to take action in times where they may want to transfer DAI despite triggering FLOP auctions. Limiting the process in this way runs counter to the intent for this MIP to be a generic fallback process for governance to transfer value in a formalized, recorded way through the MIPs process. Ultimately, each transfer subproposal is also required to pass through the MIPs process, and I feel that the correct time for voting against FLOP auctions would be at the individual proposal level rather than the process level. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-4/2749"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#28",
                    "likes": "7",
                    "time": "12/06/2020-01:56:01",
                    "content": "Here are the reasons I did not vote to support this MIP.  Please go easy on me, I’m still learning how to govern    FLOPS:  I felt uncomfortable having the max limit of the protocol’s first credit card be the entire MKR market cap.  I am not against amending this MIP to include FLOPS as a funding option in the future, I just feel more comfortable knowing that the worst-case scenario is the 500K surplus cap.  Also, lets practice spending money responsibly before we make it possible to dilute MKR holders. Training wheels are good. Sub-reason:  Would FLOPS for funding create a new attack vector?  If we were worried about a governance attack, however unlikely, we are also providing a direct route for hyper MKR dilution  Address clarity: I was confused reading the MIP to where these funds would be directed.  Are they going to individual vendor addresses?  An address controlled by a benevolent treasurer? Will it be a multi-sig wallet that community members oversee and disperse?  Do we have to whitelist these addresses?  Who will be in control of that?  Oversight:  I did not like that we were creating a tool without a plan to responsibly audit that tool. Sure we can pass a vote to issue money, but will the collective governance complete an audit to ensure those funds were spent responsibly? I think there are a great deal of questions we need to answer regarding the flow of compensation (How do we decide how much something is worth?  What frequency are we authorizing payments?  If funds are limited, how do we prioritize?  What is our budget?)  Scalability: I interpreted this MIP as needing a subproposal and executive vote for every line item that came across our collective desks.  In the future, hopefully we will be able to regularly issue hundreds (thousands?) of payments, and I don’t think executive governance has the bandwidth for that.  If you were to ask me - how do you think the DAO would use the protocol for recurring payments?  I would think it would be something along the lines of… the community votes-in a billing domain team, they are responsible for assigning values to items/tasks, they package multiple line items to create a budget that is monthly/quarterly and submit it to the community in a transparent way for approval (possibly as a MIP sub-proposal  ).  The funds are then released (to a multi-sig wallet?) and dispersed (and audited). Please let me know if something I posted was a gross misunderstanding of the MIP proposal! Thank you for letting me practice governance! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.669075548107806
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#29",
                    "likes": "2",
                    "time": "16/06/2020-02:36:51",
                    "content": "Good points and thinking @Jtathmann.  Welcome aboard btw!   I think having a DAI limit on these is good, but see comments below regarding scaling.   With regards to limiting flops I think a more appropriate discussion centers around creating a secondary surplus buffer that can take DAI from the working surplus and buy other assets that could be used as cash for operations.   And then applying this MIP to that secondary buffer.   What no-one has talked about is that other companies often sell bonds to raise cash if they need operating capital.   I think we should have that discussion since I want to create as many buffer rings around MKR dilution as possible for oh so many good reasons.   Clarity.   The MIP said the funds would go to a specific address.  But then again I had the idea that MIP13 would signal a declaration of intent and then make at least a deposit because why would someone work on satisfying a DOI if they ended up with 0 funds.   A vendor won’t sell you anything unless they have an upfront deposit and contract in hand and even then a lot of vendors want payment up front unless they are dealing with a well respected and known buyer they can legally go after if something goes amiss.    I do agree clarity with regards to details and conditions of fund disbursal needs to be looked at.   I personally think this part alone with make this MIP unwieldy and probably needs to be in another MIP regarding fund release in connection with MIP13 DOI contract performance as well as upfront payments non-refundable earnest deposits.   Oversight presumably would occur on high level DOIs with governance but in general agree that a business operations group would probably have to have input and deal with the day to day smaller stuff.  With large size contracts due to the amount of effort that goes into satisfying them this will mean breaking those into smaller manageable pieces from an oversight and Q/A point of view.   Oversight probably needs to be another MIP which itself will be complex unless some kind of Maker business group is formed.   Realize here somehow funds are going to be needed to pay elected positions (Cyrus with risk, and LongForWisdom + Rich on the governance side)  Not to mention recurring and one time operational costs for development bug fixes etc.   Good point on scalability again a reason for a business group that deals both with accounting and quality assurance (we got what we want).   But doing this from a centralized group (even if elected) is far different than governance portioning out these.   I agree with you that this kind of thing doesn’t scale well given current governance structure.   I liken this to stockholders micromanaging capital outlays of the company they own down to the penny.   We simply don’t want to do it which perhaps means there should be some kind of scale put on these things.   governance simply doesn’t need to micromange 10-10K DAI but definitely needs to have some flow control over > 500K DAI.   This is a greater governance and community question.   How do we see DOIs being completed and funds disbursed to assure quality of service.   One way is to have vendors put up MKR in exchange for a deposit on a DOI contract that could be slashed if performance metrics are not met.   Or really one would just put a contract payout conditional on meeting timely goals.   The intention wouldn’t be to slash the MKR stake but really to make sure the entity seeking to take on a DOI and getting a non-refundable DAI deposit has a real stake on the contract.   This is one idea which has issues to be sure.  As this is discussed perhaps other better ideas will come up.   BTW:  With regards to recurring payments there are many options.  One is to look at life of contract and simply fund for something like 6-12 recurring payments and then simply have some kind of business org deal with the day-to-day funding operations payment disbursals and verifying service quality.   Typically this involves having departments and departments submitting budgets.   Auditing can be done on-chain pretty easily - catagorizing the quality of service or hunting for better suppliers/workers is a constant process that governance probably doesn’t want to micromanage.  Putting this on-chain as well will lead to extra expense but can then be fully audited to determine quality of service against cost so optimization stratagies can be applied to manage expense growth and reward business individuals who cut costs and improve service.   This is a tricky area and if we have a centralized group doing this we end up with all kinds of back door schemes to raid the coffers so to speak. You are right that in connection with fund disbursal there are all kinds of checks and balances that need to be discussed in association with that one issue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.094467592592593
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#30",
                    "likes": "3",
                    "time": "16/06/2020-14:07:13",
                    "content": "Appreciate you providing your reasoning for voting against this @Jtathmann, but I don’t think I agree that any of these points are a good enough reason to not implement this MIP.     Jtathmann:  FLOPS   The main argument against this seems to boil down to ‘we’re worried that someone will spend all the money in a way that wasn’t possible before.’ This is a bad argument for a couple of reasons:   Everything in this MIP is already possible within an executive vote. If the Maker Protocol desperately needs funds for some reason (to the point where it will fail if we don’t use them) then they’ll be used to save the protocol. The question we should be asking is that if in a situation where we need to dilute MKR, do we want to be doing it with a clear process in place, or do we want to be doing it with no clear governance process beyond the signalling requests in the forum.   Spending DAI like this requires an executive vote. Approving this MIP isn’t the ‘last chance’ to prevent MKR dilution, there will always be Sub-proposals that need to go through the month long governance cycle before they are actioned. Prior to that governance cycle, there is a fixed feedback and frozen period that must be observed (the length of which is determined by the amount minted.) There will always be time for governance to raise the roof about potential dilution before it happens. Furthermore, as Facilitator I’d consider it part of my job to make sure that everyone is aware of a potential MKR dilution event, and has the chance to vote on the issue.   Furthermore, there are some really good reasons to not explicitly prevent minting beyond the surplus in this MIP.  The surplus can change swiftly, what if a sub-proposal is created when there is surplus, but by the time it comes to ratification, the surplus is no longer available? We can’t prevent MKR Holders from minting from the surplus if that is what they vote to do. Not having an avenue for this action doesn’t negate the reasons for taking the action, meaning if MKR Holders really wanted to do this, then they’ll do it using whichever process is most appropriate. Currently the most-appropriate process is the signal request process, which has a much shorter lead time, and is much more informal than the one laid out in this proposal.      Jtathmann:  Address clarity   I’d actually appreciate more feedback on this. The actual template for doing a MIP14c2-SP is located here, and maybe helps explain this better: https://github.com/makerdao/mips/blob/RFC/MIP14/MIP14c2-Subproposal-Template.md. If you’re still confused then I’ve done a bad job of explaining it and I’ll happily make it more clear.     Jtathmann:  Oversight   This is a fair point. But I would counter with the idea that perfect is the enemy of good in this situation. This is the first version of this MIP, I’d be happy to see it expanded in the future once we have a better idea of what sort of oversight is required and who can best provide it. We made this mistake with the onboarding process (fully specifying how everything would work before it was done in practice) and now as a result we’re having to amend the MIPs every cycle and we still don’t have something that is consistent and working.     Jtathmann:  Scalability : I interpreted this MIP as needing a subproposal and executive vote for every line item that came across our collective desks.   Yep, you’re absolutely correct on this one. But again, I don’t think it is worthwhile to prematurely optimize for scale when in all likelihood this is going to see very little use for the next year or so. Once we have a better understanding of usage patterns, we can make this MIP more complex (or create new MIPs to supercede this one for certain cases.)  Regarding recurring payments, I agree that this is not an ideal solution, and I expect we’ll see additional MIPs in that area at some point in the future. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-13-en-espanol/4313",
                        "https://forum.makerdao.com/t/maker-relay-ep-13/4310"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.041053549277233
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#31",
                    "likes": "6",
                    "time": "16/06/2020-14:17:26",
                    "content": "As a more general point, I’d also love to get feedback from anyone else who voted against this. What are the minimum changes you would need to see to vote in favour of this? What are you reasons for requiring those changes? In terms of making progress with the MIP, I’m at something of a loss without feedback. So far the arguments presented against ratification haven’t convinced me that this is a bad idea as written. One of the reasons for pushing this now is to help provide the tools necessary to provide compensation to Vault Holders that lost money in Black Thursday. It’s almost certain that this compensation will require more money than is currently available in the surplus buffer. Unless governance explicitly votes that they do not intend to compensate Vault Holders using MKR dilution, a MIP of this nature is required sooner rather than later. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6352813852813854
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#32",
                    "likes": "2",
                    "time": "26/06/2020-16:36:44",
                    "content": "I think this needs to be open back up for discussion, what does a better version of this proposal look like? The fact that MIP14 didn’t pass causes problems for the Black Thursday compensation plan, but it also means we have no framework for paying employees for work. We will have to do this in the future as the foundation delegates more responsibility to the community. Some of these employees include:  domain teams: risk, smart contract, oracle who onboard new collateral community developers, designers, content creators Probably funding SourceCred? Governance Facilitators I’m sure there will be more positions that add value in the future and will want to be paid for the work they are doing  It is hard to imagine our community/makerdao scaling much past its current size if we have no accepted process for paying people. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.586541434755721
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#33",
                    "likes": "2",
                    "time": "26/06/2020-17:32:36",
                    "content": "After reading LFW response, I realized a lot of my concern was HOW MIP14 would be used/managed, and not so much with the base function of the MIP.  I’m still not 100% sure why FLOPS are necessary from the get-go though  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#34",
                    "likes": "1",
                    "time": "26/06/2020-18:09:53",
                    "content": "I’ll clarify a little more… I’m not sure I support the logic of – if not enough surplus, then flop If we are engaging in a flop, could it be more explicitly called for? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.4625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#35",
                    "likes": "1",
                    "time": "29/06/2020-14:24:35",
                    "content": "    Jtathmann:  I’m still not 100% sure why FLOPS are necessary from the get-go though   It’s necessary to take into account the possibility because every governance action that MKR Holders can take in the Protocol should be covered by a MIP. By excluding it, you don’t prevent it from happening, only prevent it happening using the MIPs process. If you don’t take it into account, then it just means that it can happen without following agreed upon rules (rules such as ‘this must be discussed for at least 3 months before being implemented’.) I would also say that the negative impact of FLOPs is largely dependent on degree. It might be that we’re willing to trigger 10k worth of FLOPs if it means paying a contractor on time and preventing reputational damage, for example. Whereas we probably wouldn’t be willing to pay 500k to fund a new project. The point is that the use of FLOP auctions is largely dependent on the context surrounding the transfer of the funds, by either not-mentioning or prohibiting it in the MIPs, the result is an attempt to bind the future actions of governance. Fundamentally, governance cannot prevent itself from acting, because it can always go outside of the MIPs process to achieve its goals. We want to limit the need to do that as much as humanly possible. Outside of the MIPs process, decisions become more dangerous because they are more prone to following informal processes that MKR Governance hasn’t agreed upon.     Jtathmann:  If we are engaging in a flop, could it be more explicitly called for?   I could add something explicit to the sub-proposal template in the preamble along the lines of ‘Do you expect this to cause a FLOP Auction?’ Maybe you could expand on what you’d like to see in terms of explicitness. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.512487512487513
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#36",
                    "likes": "4",
                    "time": "11/07/2020-21:24:20",
                    "content": "    LongForWisdom:  I could add something explicit to the sub-proposal template in the preamble along the lines of ‘Do you expect this to cause a FLOP Auction?’ Maybe you could expand on what you’d like to see in terms of explicitness.   When we did the poll for vault compensation we included in the describption’Vault holder compensation will be paid for with additional flop auctions.’ So MKR voters were pretty aware of where the funds were coming from.  My impression is that MKR holders are much more willing to spend surplus than to dilute MKR supply.  My worry is that having the possibility of “surprise” flops will prevent funding from getting passed. Maybe we can just make it convention that when we put up a budget we can say, pulling from surplus only, or pulling from surplus and flops if needed. I’ll also add that there were 16,257.72 ‘No’ votes for MIP14, and I abstained from voting.  So I presume there are other issues that we have yet to discuss. Come on team, don’t be shy! ",
                    "links": [
                        "https://vote.makerdao.com/polling-proposal/qmzhnos9qt1rs77evnjydysxr63fvsvubfa4cq3lxxng8e",
                        "https://forum.makerdao.com/t/maker-relay-ep-1/2970",
                        "https://forum.makerdao.com/t/maker-relay-ep-6/3517",
                        "https://forum.makerdao.com/t/maker-relay-episode-3/3199",
                        "https://forum.makerdao.com/t/weekly-mips-update-8/3189"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#38",
                    "likes": "2",
                    "time": "14/07/2020-00:47:09",
                    "content": "Again.  One very simple tool to manage the PEG and to provide liquidity not just for operations or compensation is to be able to run the system with a negative surplus as this would signal to all DAI holders that their DAI is now worth < $1 USD in an ES.    Most normal markets would take DAI that was selling at 1.01 USD and drop the price to 1USD if the backing assets dropped by 1%.  Or say Maker governance decided to run with a negative surplus of 1% (now currently about 1.6M DAI) and to do this until the PEG comes back into line. People want to keep the DAI backing at a 1:1 or manhandle markets with a PSM.   Don’t get me wrong I believe we need more tools and to expand DAI liquidity with more assets but if the markets are telling us that DAI is worth more than $1 USD even if the backing is only worth $1 then perhaps the simplest way to manage this is to simply allow the system to run with a negative surplus and use the minted funds for: 1a)  Market operations to buy secondary reserve assets outside the normal system ES (during ES these can be voted in by governance or NOT).   This has a double effect of being a real drop in DAI backing value and a psychological one (for good or bad) that should have an effect as a tool to manage the PEG.   The bad effect is people thinking their DAI is not worth $1.   But heck why was it worth 1.02 or 1.01 when backed by $1 of real assets? 1b)  Use these DAI to direct inject and remove liquidity by buying or selling assets.  Hence there is a 2x multplier to 1a with 1b because it isn’t that we only reduce the backing value of DAI from 1:1 to .99:1 but we also inject said liquidity into markets by buying assets that sit in a secondary reserve outside the primary system.  THis has an additional effect of acting as a real reserve which can be used before we flop MKR to bring system back into line (of .99 USD value for 1DAI) before an ES say due to accumulating losses.   Use the funds for operations.  Since it is a negative surplus this will automatically reverse when PEG goes under 1 and SF can be increased naturally making the negative surplus go away ‘automatically’ (for 1a,1b,2)   We could even use this fund to floor the MKR price and then when we have surplus and want to sell MKR do it at a higher price.  I am not saying to do this but it is possible.   I literally have not thought of all the ways the above could be used but if we are talking about tools here to manage the PEG I find it interesting no-one wants to give up even a little on the $1:1DAI backing to affect the PEG positively. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-19/4935",
                        "https://forum.makerdao.com/t/weekly-mips-update-18/4847",
                        "https://forum.makerdao.com/t/octobers-monthly-mips-governance-poll-is-live-go-vote/2842",
                        "https://forum.makerdao.com/t/weekly-mips-update-17/4746",
                        "https://forum.makerdao.com/t/weekly-mips-update-15/4243",
                        "https://forum.makerdao.com/t/weekly-mips-update-14/4028",
                        "https://forum.makerdao.com/t/weekly-mips-update-13/3906",
                        "https://forum.makerdao.com/t/weekly-mips-update-12/3710",
                        "https://forum.makerdao.com/t/maker-relay-ep-7/3630"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.266813543599258
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#39",
                    "likes": "3",
                    "time": "27/08/2020-12:31:22",
                    "content": "Now being worked on by @Jtathmann here: MIP14: Protocol Dai Transfer Update ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-8/3712"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#40",
                    "likes": "0",
                    "time": "27/08/2020-12:31:30",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "2348"
}