{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/100-days-to-zksync-2-0-bridge-deployment/17034",
            "title": "100 Days to zkSync 2.0 Bridge Deployment ",
            "index": 17034,
            "category": [
                "Updates",
                "Integrations"
            ],
            "tags": [
                "bridge",
                "layer-2",
                "l2",
                "pe-001",
                "protocol-engineering",
                "zksync"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "23",
                    "time": "05/08/2022-15:01:04",
                    "content": " 100 Days to zkSync 2.0 Bridge Deployment Hi everyone, The zkSync team is getting ready to launch zkSync 2.0 in approximately 100 days. This will be the second general purpose zk rollup (after StarkNet), and works by rolling L2 transactions into a batch and posting them to L1 as call data with the new L2 state root alongside the zero-knowledge proof. L1 will then verify this before accepting the new state root as valid. zkSync’s roadmap as per the above link:  zkSync Roadmap1920×1001 78.6 KB  zkRollups in general are considered the most advanced and promising scaling tech - announced a few years ago as a theoretical possibility and are now finally being delivered! The main security risk profile of zkSync 2.0 will likely be very similar to StarkNet and a detailed risk analysis will be conducted by PECU and posted in the forum in due course. The main difference between zkSync 2.0 and StarkNet will likely be the level of compatibility with the L1 EVM. While StarkNet’s internal VM (CairoVM) is optimised for creating efficient zk proofs of a valid execution, zkSync tries to be EVM-compatible, which makes porting smart contracts written in Solidity for L1 somewhat easier. For the same reason as per Arbitrum’s recently launched Nova we believe that it is desirable to deploy a canonical Dai contract on zkSync ahead of the chain launch. This effort will likely be more difficult than launching a simple bridge on Optimism and Arbitrum due to the fact that zkSync, while it tries to be as compatible with EVM as much as possible, it is not equivalent, so we expect certain issues may arise that will need to be addressed, however it should be much simpler than launching a bridge on StarkNet that had to be written, tested and verified in native StarkNet’s language, Cairo. PECU is looking forward to sharing our upcoming research and testnet deployments in the lead-up to zkSync’s mainnet alpha launch. This will ensure that Maker is able to safely grow DAI adoption and participate in this new ecosystem. Big thanks to @bartek who is spearheading this initiative. ",
                    "links": [
                        "https://forum.makerdao.com/t/100-dias-para-la-implantacion-de-zksync-2-0-bridge-traduccion/17040",
                        "https://forum.makerdao.com/t/governance-and-risk-203-thursday-august-11-at-17-00-utc/17157/2",
                        "https://forum.makerdao.com/t/zksync-era-dai-bridge-and-zksync-era-platform-technical-assesment/19992",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-04-10-de-agosto-del-2022/17250",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/10",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-july-2022/16954",
                        "https://forum.makerdao.com/t/layer-2-roadmap-history-and-future/17310",
                        "https://forum.makerdao.com/t/pecu-month-in-review-august-2022/17941",
                        "https://forum.makerdao.com/t/ruta-de-layer-2-historia-y-futuro-traduccion/17387"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.415124458874459
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/09/2022-01:01:41",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}