{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - 0xBTC (0xBitcoin Neutral Mineable Token) - July 5, 2021",
            "index": "8761",
            "option": "No (Defer)",
            "supporting_mkr": "34,481",
            "highest_fraction": 0.93
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/0xbtc-0xbitcoin-neutral-mineable-token-collateral-onboarding-application/8761",
            "title": "[0xBTC] - 0xBitcoin Neutral Mineable Token Collateral Onboarding Application ",
            "index": 8761,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "mips"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/admazzola",
                    "index": "#1",
                    "likes": "3",
                    "time": "14/06/2021-19:34:27",
                    "content": "1. Who is the interested party for this collateral application ? Nobody and everyone, as 0xBTC is entirely decentralized trustless and neutral, structured exactly like ‘bitcoin/litecoin/dogecoin’ but as an ERC20 smart contract. 2. Provide a brief high-level overview of the project, with a focus on the applying collateral token. The ideal collateral to back DAI is neutral with no central point of failure and trustless with no IOU, no custodian, no central bank, and non-owned smart contracts with no oracles.  With this in mind, 0xBitcoin is the ideal collateral to back DAI. The 0xBTC smart contract was deployed in Feb 2018 with an initial supply of 0 tokens.   This non-owned contract gave no tokens to the deployer.  Instead, tokens are minted from the contract with a mint() method that rewards new tokens from Proof of Work.  This reward halves every ~4 years to a max supply of 21 million 0xBTC tokens.  The difficulty auto adjusts to target 15 minute reward periods.   There are no oracles used to accomplish either of these tasks and no human has any capability to affect the smart contract in any way.   There is no contract admin and the code can never be changed. 3. Provide a brief history of the project. Upon deployment on Feb 6th 2018, information about how to CPU mine for 0xBTC from the smart contract was published to Bitcointalk Forums.   More advanced CPU miners were developed by the community, followed by GPU miners and then mining pools.  Today, three large mining pools and many solo miners are mining for 0xBTC.   Liquidity for the token largely exists on UniswapV3 and on Sushiswap on the Polygon sidechain.   Mercatox exchange has additional liquidity. Since 0xBTC is trustless and neutral with no dependencies, since it works exactly like a new ‘version’ of Bitcoin but redeployed from genesis as a smart contract, and since its price is non-correlated to ETH, it is the absolute perfect token to use as collateral for DAI.   Since it is relatively new at only 3 years young, the liquidity is relatively small with a total market cap of $6m.   This would have been seen as large when Maker DAO first launched, and this is merely a chicken-before-the-egg type of phenomena. Liquidity can be grown over time, and it will with additional integrations.   Trustlessness and neutrality of an asset can never be grown or changed, so the fact that 0xBTC has better trustlessness and neutrality versus any other asset on the Ethereum Mainnet (Especially compared to USDC and WBTC) makes it extremely desireable as collateral to the Maker DAO basket.  My suggestion is that it be onboarded with a small capacity today, even if only used for a fraction of 1% of the basket of collateral, because it will be paramount and a key asset to the ecosystem fundamentally as liquidity grows.  By Maker DAO adding support, this will help grow liquidity of 0xBTC which will in turn make it a stronger asset which will in turn make Maker DAO stronger and more trustless like symbiotic partners. I strongly strongly encourage reading the smart contract as it explains the entire scope of 0xBTC.  There is no company, team, service, app, or anything else running 0xBTC except the contract. https://0xbitcoin.org/#/ https://etherscan.io/address/0xb6ed7644c69416d67b522e20bc294a9a9b405b31#code   messari.io    Crypto Research, Data, and Tools Gain an edge over the crypto market with professional grade data, tools, and research.      https://info.uniswap.org/#/pools/0xaff587846a44aa086a6555ff69055d3380fd379a  Medium – 14 Jun 21    Fundamentally: The perfect asset to back DAI DAI is intended to be a trustless and neutral form of currency on the Ethereum Mainnet whose price is tied to $1 US. A stablecoin. In this…  Reading time: 2 min read        image813×519 19.9 KB  Growing marketcap of 0xBTC over time  image1049×491 25 KB  PoW mining hashrate (mvis.ca/analytics.html) -Infernal Toast  ",
                    "links": [
                        "https://etherscan.io/address/0xb6ed7644c69416d67b522e20bc294a9a9b405b31#code",
                        "https://messari.io/asset/0xbitcoin/profile",
                        "https://messari.io/asset/0xbitcoin/profile",
                        "https://info.uniswap.org/#/pools/0xaff587846a44aa086a6555ff69055d3380fd379a",
                        "https://infernaltoast.medium.com/fundamentally-the-perfect-asset-to-back-dai-9913b3cfec94",
                        "https://infernaltoast.medium.com/fundamentally-the-perfect-asset-to-back-dai-9913b3cfec94",
                        "https://forum.makerdao.com/t/maker-relay-ep-53/9305",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/maker-relay-ep-53-en-espanol/9330",
                        "https://forum.makerdao.com/t/actualizacion-encuestas-y-votaciones-ejecutivas-5-de-julio-de-2021/9210/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-52/9191"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scaleability",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.860246671567426
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "1",
                    "time": "14/06/2021-21:42:09",
                    "content": "Wow, proof-of-work is hard to kill. Even if Ethereum moves to proof-of-stake, unethical tokens like this will continue to try to attract attention. I am against onboarding. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.520833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/admazzola",
                    "index": "#3",
                    "likes": "2",
                    "time": "14/06/2021-21:51:57",
                    "content": "Proof of Work tokens are not hard to stop, they are impossible to stop.  That is why they are so extremely valueable to DeFi and to Maker Dao.   Why in your opinion is Proof of Work ‘unethical’?   In my view, energy is consumed in order to create a trustless neutral unstoppable asset.  Since this is impossible to acquire in any other way, there is no waste.   Waste implies there is another way to accomplish the same thing.  For example, we NEED to drive cars so using energy/electricity to do so is not a waste it is consumption.  We NEED proof of work for trustless neutral tokens so we are using energy to do so.  [Would you rather use some instant-central-minted made up token called ‘JoshuaToken’ for which you started with the entire supply?  Maybe you should use that as collateral for DAI lol that wont need energy .   ] IMO it is your duty to look out for the best fundamental interests of Maker DAO, not to play The Lorax and try to save the environment.  By the way, 0xBTC uses 0.00000000000000000000000001% of the earths energy.   You are being brainwashed by the media, congratulations why dont you look at some data.   I will make a deal with you… if 0xBTC starts consuming more than 1/1000000 th of humanities energy you can ban it from Maker DAO.  There. No problems. ! EDIT: Also, does this mean you are going to eradicate WBTC from Maker DAO? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.241071428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#4",
                    "likes": "2",
                    "time": "14/06/2021-23:08:43",
                    "content": "    admazzola:  Also, does this mean you are going to eradicate WBTC from Maker DAO?   No because the wasteful proof-of-work part of the original BTC blockchains has nothing to do with the WBTC (or renBTC) wrapper. We can hope that eventually the BTC token will migrate to Ethereum and just be a regular meme token without the proof-of-work part.     admazzola:  not to play The Lorax and try to save the environment   Don’t tell me what my role is. I don’t think MakerDAO should facilitate leverage for useless proof-of-work tokens. That’s my opinion, and I’m voicing it. Of course I can’t stop you from wasting electricity, but I don’t want to aid and abet it either. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.453125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#5",
                    "likes": "1",
                    "time": "15/06/2021-00:40:34",
                    "content": "Feel the same way as the above I don’t think its wise to onboard this collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/admazzola",
                    "index": "#6",
                    "likes": "1",
                    "time": "16/06/2021-23:56:50",
                    "content": "You are completely clueless if you believe that the PoW of Bitcoin has nothing to do with renBTC and wBTC.   Without Bitcoin proof of work, those two coins would not exist!!  You are a total HYPOCRITE. Bitcoin cannot and will not every ‘migrate to Ethereum without proof of work’ you are 1000% delusional.   For a currency to be neutral it needs to be distributed by onchain verifiable mathematics that are immune from Sybil attacks, it needs to use proof of work. I’m ashamed that alleged ‘blockchain enthusiasts’ are so ignorant, misinformed and hypocritical.   0xBTC is among the most useful token in the Ethereum Blockchain precisely because it is exactly what you describe that you are looking for: Bitcoin migrated to the Ethereum Network natively !! It accomplishes this by being the largest token that total mathematically neutral, such that there is no owner, no control, no dependency, and no vulnerabilities.  This is only possible due to the specific way that it is designed and it is impossible to achieve mathematical neutrality in any other way.  Keep researching about Blockchain technology. You have a lot to learn.   And you are CLEARLY not concerned at all about energy use since over 20% of your collateralization is based on IOU of a proof of work coin.  I see no solid grounded argument from your point of view - not one that is not hypocritical ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1790021929824555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/admazzola",
                    "index": "#7",
                    "likes": "1",
                    "time": "17/06/2021-00:10:04",
                    "content": "To elaborate, If people buy up a ton of wBTC then arbitrageurs will sell to it and increase the price of actual BTC thereby encouraging mining Therefore your support of wBTC is actively and directly encouraging and paying Bitcoin miners rewards.   You must either remove it or rescind your statement about 0xBTC using energy . Furthermore, your speculation of original Bitcoin ceasing operation is absolutely proposterous and you know that will never happen.  There are no plans for that by any Bitcoin node operator or developer. So why even bring it up ?  You are making fantastical points from dreamworlds. I am still waiting for an argument that is not opinionated and that is not completely hypocritical.  I encourage that you use a scientific based approach for your protocol, lest it devolve into a cacophony of control by brainwashing and false truths. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.369791666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#8",
                    "likes": "2",
                    "time": "17/06/2021-01:15:44",
                    "content": "Thank you for all the effort of this application! I really love the enthusiasm and energy. Do understand that the low market cap makes it unlikely to be onboarded at this time, though. The fixed costs to Maker are quite high to accept and monitor the price of a collateral, and it typically requires millions of DAI minted before a collateral type is profitable for us. I encourage you to revisit us as your token grows! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.043055555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hey_ynot",
                    "index": "#9",
                    "likes": "0",
                    "time": "17/06/2021-01:26:22",
                    "content": "I do not want to come off rude, but your statements are littered with holes mysteriously placed where elaborating further would work against your argument and we must address them As a person, I would hope you at least admit that it is a genuine disservice to readers and users to say things such as:  We can hope that eventually the BTC token will migrate to Ethereum and just be a regular meme token without the proof-of-work part.  I am unable to tell if this is a joke. As long as BTC exists in the wild, this will never be a reality and custodians will have to exist until the end of time in order to maintain the 1:1 wrap/unwrap functionality that is critical for wrapped BTC to exist as an asset. Speaking of aspects critical to the existence of wBTC, the premise that relinquishing your BTC to a centralized org/custodian (for a fee) makes the wBTC immune to any energy-wasting finger-pointing is a heavily flawed argument If that/the custodian(s) at the center of this did not value the ‘waste’ and scarcity that comes as a byproduct of said ‘waste’, wrapping would be impossible, no? Denying consideration of this asset simply on the basis of energy consumption makes no sense…If the value is maintained from BTC<->wBTC, then the energy spent obtaining that value travels with it. The energy overhead added by simply having to maintain a network of custodians ready to wrap/unwrap 24/7 seems like the true waste here. This overhead spent on upkeep is not only wasteful because it is a hack, it is pointlessly siphoning BTC from those wrapping and putting it right into the hands of centralized entities. If your vision did miraculously pan out, how much of a ‘meme token’ scenario are we looking at if 0.25% of all BTC was now in the hands of the custodians? Paying an entity such as ‘coinlist’ a whopping 0.25% fee just to be able to use BTC on the ETH Mainnet is a wolf in sheep’s clothing, it is fundamentally a CEX on train tracks. Not only do users have to depend on custodians to give wBTC wrap/unwrap functionality indefinitely, they have to pay them a significant cost. If the fundamental concept of BTC is so attractive that you are willing to take on additional energy/monetary overhead as well as security risks, maybe it should be asked why. Why is there such a concerted effort to preserve the token itself, instead of adopting a future proof native version of BTC that has absolutely no centralized authority keeping it alive? Why the heck would anyone want a custodian holding a disproportionate amount of the total supply of BTC, opening up all sorts of potential for problems? On the flipside, 0xBTC is a native ERC20 - it needs no custodian and there is no central authority that must be depended on - is a form of trustlessly provable value that is immediately redeemable on the ethereum mainnet not what we’re after here? Why are we wasting time and money propping up custodians who get to sit back, wasting energy on hosting and various contract executions, ALL WHILE collecting fees from those who want to get away from centralized authorities in the first place? The only alternative these people have is selling off their BTC… Wrapped solutions are not robust, certainly not immune to all of the problems that Bitcoin has in the first place, waste more energy because they require overhead to centralize on top of just PoW, and funnel money into the hands of the few. I (respectfully) think you should take some time to research 0xBTC, and reconsider the points you attempted to make in your post. It’s natural that a lack of understanding causes friction, but I believe we will be in a better place once we stop attempting to apply short term solutions to problems that will outlive you and I. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.189718614718615
                },
                {
                    "author_link": "https://forum.makerdao.com/u/admazzola",
                    "index": "#10",
                    "likes": "0",
                    "time": "17/06/2021-02:11:41",
                    "content": "Much better answer that makes sense, exactly as I predicted. I am glad to revisit this once 0xbtc has larger marketcap.   Just to be absolutely clear for the record, the only reason not to add 0xbtc to collateralize DAI is the market cap.  Remember this carefully.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.892857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#11",
                    "likes": "0",
                    "time": "17/06/2021-08:00:03",
                    "content": "    admazzola:  You are completely clueless if you believe that the PoW of Bitcoin has nothing to do with renBTC and wBTC. Without Bitcoin proof of work, those two coins would not exist!! You are a total HYPOCRITE.   Please stop using this type of language. It is definitely not helping your onboarding application.     psychonaut:  No because the wasteful proof-of-work part of the original BTC blockchains has nothing to do with the WBTC (or renBTC) wrapper.   @psychonaut also on your side I think sentences like:     psychonaut:  unethical tokens like this       psychonaut:  the wasteful proof-of-work part of the original BTC blockchains has nothing to do with the WBTC (or renBTC) wrapper.   are expressing your own opinion, which is 100% fair. But perhaps you expressed it a bit too forcefully, as  if it was a solid truth (and it is not, of course). I think we should try to stay as objective/neutral as possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.225694444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#12",
                    "likes": "3",
                    "time": "05/07/2021-17:37:38",
                    "content": "update: 0xBTC as collateral is now up for an onchain poll about Community Greenlight - please participate in the poll to express your opinion about the prioritization of the inclusion. The poll will run until 2021-07-19T16:00:00Z ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "3795"
}