{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/delegate-compensation-calibrate-to-a-single-person/12679",
            "title": "Delegate compensation, calibrate to a single person ",
            "index": 12679,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "compensation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "3",
                    "time": "17/01/2022-01:31:59",
                    "content": "I recently played with some ideas about adding levels of delegate compensation. However, this would seem to encourage the creation of a team that is not really accountable to the DAO. By accountable, I’m thinking about the suffering content production CU. I don’t think anybody is really to blame, but it seems like there was a breakdown in communication of expectations that is being scrutinized and hammer out by delegates. I’m skeptical that anybody else besides big delegates like @flipflopflapdelegate would have had enough clout to threaten to rug this CU. As painful as it must be, I’m glad that CUs can, in practice, be rugged. In the future, let’s hope that is it usually just a theoretical threat and that conflicts can usually be resolved before things get so heated. In order to make the task of understanding the DAO tractable, I think I’d advocate for more core units like the Strategic Finance Core Unit. This is an introspective CU that basically makes the activities of the DAO easier to understand. In contrast, I think increasing delegate compensation high enough that delegates could hire their own team is probably the wrong direction. I’d rather see investment that benefit all delegates rather than invest more in individual delegates. ",
                    "links": [
                        "https://forum.makerdao.com/t/video-producing-under-mip41c5-sp3-facilitator-offboarding-mkt-001/12654",
                        "https://forum.makerdao.com/t/mip40c3-sp46-adding-strategic-finance-core-unit-budget-sf-001/11940",
                        "https://forum.makerdao.com/t/discussion-delegate-roles-and-incentives/15788/17"
                    ],
                    "GPT-summary": "The author of the post is explaining their thoughts on delegate compensation and how it could potentially harm the accountability of the DAO. They suggest creating more core units to make the activities of the DAO easier to understand, rather than increasing delegate compensation to the point where they could hire their own team. A 3rd party could provide constructive criticism by questioning the author's ideas and suggesting alternative solutions.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.022142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#2",
                    "likes": "3",
                    "time": "17/01/2022-10:29:04",
                    "content": "The SES objectives for 2022 contain a lot in the area of transparency and auditability. The two most notable elements are:   The creation of a DAO performance dashboard.   A dedicated incubation track for auditing and quality control core units.   The 2022 objectives presentation can be found in the folder linked below where we’ll add the recording too, once it’s available: https://drive.google.com/drive/folders/1E-0DjIEQm3vEu6UTjdVO1eIPuX0kZ-Xv The Immunefi Security CU can contribute to this too with regards to security practices or audits. It’s a fairly specialized but essential performance indicator. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 7.1
                }
            ]
        }
    ]
}