{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/tool-house-rock-2-bubblemaps/19848",
            "title": "Tool House Rock #2 | Bubblemaps ",
            "index": 19848,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "pubcall-:-tool-house-rock"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#1",
                    "likes": "3",
                    "time": "16/02/2023-21:36:47",
                    "content": " Tool House Rock #2 | Bubblemaps      Join us on Wednesday 22-Feb for another session of Tool House Rock. For this episode, we will host the CEO and CMO from Bubblemaps to explore this project’s intuitive solution for viewing token and wallet transactions.  Problem Space Analyzing token transactions can be both difficult and time-consuming for even the most adept cryptocurrency users. Although platforms such as Etherscan exist, they can prove to be cumbersome to navigate, especially as the network of transactions becomes more complex over time. With Endgame approaching, there will be more interactions between the protocol, SubDAOs and Ecosystem Actors, as well as a larger need for mapping the delegation layer of Governance. Bubblemaps aims to keep these interactions easy for humans to interpret and explore.  What is Bubblemaps? Bubblemaps is a software interface that allows users to see the relationships between various token types and wallets in an on-chain environment via a visual map. Bubblemaps provides a more user-friendly way of:  Exploring wallet contents Revealing token transactions between wallets Filtering between specific token types Assessing transactions from any period of time   Our guests are…  Bubblemaps’ CEO - Nick  Bubblemaps’ CMO - Don    Session hosted by…     @Juan  & @Retro     Join Us! If you can’t make this call, post any questions you may have for our guest on this post, and our hosts will ask them during the Q&A.  Agenda  Introduction of the problem space Product solution Demonstration Relevancy with Endgame Q&A   When Time in your local-timezone format: 2023-02-22T16:00:00Z  Add the call to your Calendar.  Where Zoom Link  here Attn: @Core-Facilitators, @Recognized-Delegates ",
                    "links": [
                        "https://bubblemaps.io/",
                        "https://bubblemaps.io/",
                        "https://fr.linkedin.com/in/nicolasvaiman",
                        "https://twitter.com/DonbmCameron",
                        "https://calendar.google.com/calendar/event?action=TEMPLATE&tmeid=NjNkODJjYWZjbGswN2IxZ2NydXQ4a2tobzIgbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://us02web.zoom.us/j/81976227573"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7444444444444445
                }
            ]
        }
    ]
}