{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/gauntlets-auction-assessment/7177",
            "title": "Gauntlet's Auction Assessment ",
            "index": 7177,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "auctions",
                "liq-20",
                "gauntlet"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/inkymaze",
                    "index": "#1",
                    "likes": "30",
                    "time": "24/03/2021-16:44:52",
                    "content": "At Gauntlet, we use agent-based simulations to evaluate the economic security of blockchain protocols. We have worked with the Maker team in parameter optimization for Liquidations 2.0 - an upgrade from the current Liquidations 1.2 system. The goal of the simulation was to optimize the Liquidations 2.0 parameters, which form the Dutch Auction pricing curve. We then compare the optimized Liquidations 2.0 system performance to the current Liquidations 1.2 system. Key metrics tested are auction throughput, risk, and slippage. Additionally, a key area of focus is in ensuring another Black Thursday insolvency situation does not occur again. Therefore we test these systems across a wide range of volatilities and simulate agent behavior over a 3 day period. The Liquidations 2.0 analysis found the optimal parameter values: buf = 110% cusp <= 60% tail >= 5200 seconds step = 30 seconds half life = 7200 seconds cut = 99.7% Additionally, the analysis shows that Liquidations 2.0 outperformed Liquidations 1.2 in every unambiguous metric of throughput and insolvency risk, especially during periods as volatile as Black Thursday. We hope that this report can serve as a reference for the ongoing discussions about risk on Maker and the upcoming Liquidations 2.0 release. https://maker-report.gauntlet.network/ ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-134-thursday-march-25-17-00-utc/7095/5",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/23",
                        "https://forum.makerdao.com/t/maker-relay-ep-38/7249",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-march-28th-2021/7280",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-134-thursday-march-25-17-00-utc/7095/2"
                    ],
                    "GPT-summary": "Gauntlet has conducted an analysis of the Liquidations 2.0 system, an upgrade from the current Liquidations 1.2 system, for the Maker team. The analysis aimed to optimize the Liquidations 2.0 parameters and compare its performance to the current system. The report found that Liquidations 2.0 outperformed Liquidations 1.2 in every unambiguous metric of throughput and insolvency risk, especially during periods as volatile as Black Thursday. The report hopes to serve as a reference for ongoing discussions about risk on Maker and the upcoming Liquidations 2.0 release.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 4.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#2",
                    "likes": "3",
                    "time": "24/03/2021-22:30:21",
                    "content": "Wow, this is exceptionally useful information. Would love to see more of Gauntlet in DeFi. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#3",
                    "likes": "4",
                    "time": "25/03/2021-09:07:20",
                    "content": "Thanks Gauntlet team. We made a proposal for LINK-A here and also referred to some of your findings. Your proposal doesn’t include other key parameters that are needed in Liq 2.0, which are ilk.hole, hole, chip, tip and ilk.chop. Some of these (particularly ilk.hole) are related to other “core” parameters that you suggested. We believe the buf that you proposed might be too low. As much as I can see your price curve makes expected auction duration of around 17 minutes and this might be too fast. Also, in some cases and especially when using it for volatile assets such as LINK, 1.10 buf could also lead to auction starting price below market price. But the real concern is that when using this curve on Black Thursday, auctions could settle in some occasions in first few minutes and we may want to avoid that as auction throughput would be simply too high. Especially if we again end up in scenario where network congestion leads to late and below market price bids. We also think the curve could be a bit less smoother than the one suggested here. If people potentially bid through UIs in these auctions, price change per 30 seconds is probably too fast. I am aware of recommending you to use a smoother rather than discrete line when we had discussions initially, but maybe it shouldn’t be too smooth for reasons mentioned. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.19320987654321
                },
                {
                    "author_link": "https://forum.makerdao.com/u/inkymaze",
                    "index": "#4",
                    "likes": "6",
                    "time": "25/03/2021-16:27:13",
                    "content": "We hope this serves as a helpful reference for the community. We very much are not trying to model everything and tried to prioritize the parameters that had the largest effect on key outcomes. We provide suggestions to be helpful, but the goal of the report is to allow people to see the tradeoffs here. It’s up to the community to weigh those tradeoffs to do what’s best for Maker. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 7.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#5",
                    "likes": "0",
                    "time": "25/03/2021-17:18:15",
                    "content": "Interesting, Did you take into consideration that the next auction kick off during the first auction process? I am also quite surprised that the step is around 2 blocks time. It seems quite small for me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jmo",
                    "index": "#6",
                    "likes": "3",
                    "time": "25/03/2021-17:37:14",
                    "content": "Definitely - you can flip through the individual simulation runs here: Gauntlet - MakerDAO Auction Report Scrolling down a bit, on the right-hand side you can see this:  As you change the sliders above, you can see how under different conditions (volatilities, etc.) the number of simultaneous auctions varies over time, as well as a slew of other metrics ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.766203703703703
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "24/06/2021-23:37:43",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}