{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-31-de-mayo-6-de-junio-2022/15684",
            "title": "Relay Semanal | 31 de Mayo - 6 de Junio 2022 ",
            "index": 15684,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "relay-semanal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#1",
                    "likes": "7",
                    "time": "08/06/2022-23:57:18",
                    "content": " 1727×390 307 KB  Hola a todos. ¡Gracias por consultar el Relay Semanal! Ya sea que poseas MKR o DAI, tengas tu propia Vault o te quieras involucrar más con la Gobernanza, esta es tu parada obligatoria para estar al día con las actualizaciones de MakerDAO.  Versión PDF Online en Inglés | Dale un poco de amor a nuestra Cuenta en Medium   Tenemos algunas nuevas ideas para mejorar y tu feedback realmente nos ayudaría hacer que el Relay Semanal sea una publicación más disfrutable para todos.     Propuestas de Recompensa Off-Chain La Core Unit de Gobernanza (GovAlpha) publicó un post en el foro donde se resalta la estrategia que han desarrollado para mejorar el sistema de incentivos off-chain de MakerDAO, en respuesta al debate que se está llevando acabo sobre cuál es el mejor uso del SourceCred. El SourceCred ha probado ser una herramienta de reputación innovadora para fomentar la colaboración abierta entre equipos de colaboradores descentralizados. Sin embargo, el SourceCred tiene sus limitaciones. El problema principal es que nuestra instancia de SourceCred hace que sea muy difícil modificar los incentivos para evitar que las recompensas caigan en manos de los colaboradores que ya reciben un salario por parte de MakerDAO. GovAlpha ha desarrollado un enfoque para fortalecer el proceso de gobernanza de MakerDAO. La idea es incentivar aquellas iniciativas “concretas que generan resultados” basados en los Objetivos de Incentivo de la Gobernanza Off-Chain. Propuesta La propuesta solicita 72,000 DAI para crear un nuevo fondo común que será distribuido a todas las propuestas de Gobernanza exitosas, incluyendo propuestas MIP, sub-propuestas MIP y Peticiones de Señal, a una tasa de 6,000 DAI por mes. Se recomienda a los Colaboradores presentar sus propuestas a tiempo, debido a que las recompensas son dinámicas y dependen del número de propuestas aprobadas que fueron presentadas. Recompensas Máximas Recompensas  MIPs: 2,000 DAI Sub-propuestas: 1,000 DAI Peticiones de Señal: 500 DAI  La pool de recompensas para cada mes es distribuida de acuerdo a las siguientes ponderaciones:  MIPs: 1 Sub-propuestas: 1/2 Peticiones de Señal: ¼  Más Detalles Manejo La pool será gestionada por GovAlpha, utilizando el Rastreador de Recompensas de Acciones Concretas. GovAlpha posteará un pequeño reporte sobre las recompensas cada mes. Impacto Presupuestario 27% del presupuesto ya designado para el SourceCred sería utilizado para financiar esta propuesta, lo que significa que no habrá gastos presupuestarios adicionales. Apuntándose Miembros de la comunidad con una cuenta oficial en el foro están calificados para los pagos de recompensas por propuestas off-chain. Los colaboradores deben proporcionar una dirección de Ethereum que pueda ser vista públicamente. Los colaboradores exitosos recibirán DAI al principio de cada mes. Recompensas de Propuestas (Manual Operacional de Maker) Este mes, se presentaron seis bugs a través del Programa de Recompensas por Bugs. Todos fueron declarados inválidos por el Triaje de Servicios Immunefi. Anuncio de Propuesta Archivada por Error @prose11 hizo un anuncio en Discord sobre una propuesta que fue archivada erróneamente:  1309×351 60.8 KB      Votaciones Ejecutivas El primero de junio del 2022 no se presentó ninguna propuesta ejecutiva. Debido a la falta de propuestas o puntos que requerían ser incluidos en la próxima Votación Ejecutiva, Ingeniería del Protocolo y GovAlpha concluyeron que lo mejor era omitir la votación programada para el 01 de junio del 2022 y reanudar la agenda habitual de Votación Ejecutiva la próxima semana, el 8 de junio del 2022. Para más información, por favor visita este post.  Encuestas de Gobernanza Hay un inconveniente con la votación en las Encuestas de Priorización recientemente publicadas GovAlpha removió la interfaz de usuario de las encuestas, mientras investiga y resuelve el problema. Una actualización sobre la situación estará disponible pronto. Antes de retirar las encuestas: Por favor, consulta la encuesta de feedback mencionada al principio de esta publicación para ayudarnos a mejorar las Encuestas de Gobernanza Activas. Esta semana hay noticias emocionantes sobre el mejoramiento de la Gobernanza: ¡GovAlpha ha publicado la primera ronda de votación mensual de prioridades, con dos encuestas de opinión!      Nombre de la Encuesta     Opinión de Priorización - Despliegue de Recursos Técnicos   Opinión de Priorización - Clase de Colateral     Consulta la edición anterior del Relay Semanal para más información sobre las encuestas recientemente concluidas.  Encuestas del Visto Bueno de la Comunidad Por favor, consulta la encuesta de feedback mencionada al principio de esta publicación para ayudarnos a mejorar las Encuestas del Visto Bueno de la Comunidad. Hay dos encuestas activas del visto bueno de la comunidad:     Encuesta del visto Bueno Desglose de Votación Fecha de Inicio Fecha de Cierre     KREDIKA (Kredika LTD)  2260×510 75.5 KB  6 de junio del 2022 a las 16:00 UTC 20 de Junio del 2022 a las 16:00 UTC   XSGD (StraitsX)  2250×510 79.3 KB  6 de junio del 2022 a las 16:00 UTC 20 de junio del 2022 a las 16:00 UTC    Échale un ojo a los tipos de Vaults actuales y a sus parámetros en MakerBurn.    Grabaciones de las Llamadas de la Semana Pasada:  Llamada de Gobernanza y Riesgo Ep. 193 | Video | Foro  Comité de Votación Descentralizado Abierto - 01 de junio del 2022 | Video | Foro   Próximas Llamadas:  Conoce tu Delegado #13 | Foro | Link para unirse  Conoce tu Delegado #14 | Foro | Link para unirse   Recurrentes:  Comité de Votación Descentralizado Abierto | Foro | Link para unirse - Miércoles a las 15:00 UTC Llamada de Gobernanza & Riesgo | Link para unirse | Agenda - Jueves a las 17:00 UTC  Horarios de Oficina de las Core Units   Link para Unirse | Gobernanza GovAlpha (Preguntas & Respuestas) - Lunes a las 17:00 UTC  Link para Unirse | Seguridad Immunefi - Martes a las 00:00 UTC  Link para Unirse | Ingeniería del Protocolo - Martes a las 15:00 UTC  Link para Unirse | Escalado de Ecosistemas Sostenibles - Martes a las 15:30 UTC  Link para Unirse | Growth - Miércoles a las 17:00 UTC  Link para Unirse | Finanzas del Mundo Real - Miércoles a las 17:00 UTC  Link para Unirse | Comunicaciones de Gobernanza - Viernes a las 18:00 UTC  Link para Unirse | Capital 6S - Cada dos miércoles a las 14:00 UTC     MIPs, Links y Recursos Abrir Actualización de MIPs Semanales Encuestas de Ratificación, propuestas y discusiones pre-MIP. Foro y Discord de Maker Discusiones y debates sobre MakerDAO. Calendario de Llamadas | Calendario de Votaciones y Eventos Suscríbete a ambos para estar al día con las llamadas públicas, votaciones y otros recordatorios. Herramientas de Participacion Biblioteca de links útiles para stakeholders: análisis del protocolo, análisis de DAI, métricas de colaterales y liquidaciones, historia de la gobernanza y datos de las subastas. Portal de Gobernanza Tabla de Votación para los votantes MKR. Portal de MIPs Tabla de MIPs para todos. Portal de Aprendizaje y Documentación Técnica Aprende más sobre el Protocolo Maker.    ¿Tienes algún Feedback? ¡Aquí valoramos tu opinión! Responde nuestra encuesta para hacernos saber que nos falta o como mejorar. Descargo de Responsabilidad: esta actualización fue ensamblada por un grupo de miembros colaboradores en la comunidad de MakerDAO. Esto no tiene el propósito de asesoramiento financiero ni es una incitación a votar de ninguna manera específica. Esta actualización solo tiene fines de información y comunicacion.  Créditos @nothsa y @Sol_Invictus  Esta es una traducción libre del artículo original en inglés gracias a @joserjimz y @Sebix. ",
                    "links": [
                        "https://medium.com/@MkrGovComms",
                        "https://forms.gle/nPfNEvrCog9gSF768",
                        "https://forum.makerdao.com/t/off-chain-proposal-bounties/15363",
                        "https://forum.makerdao.com/t/off-chain-governance-list-of-options-and-recommendations/13373",
                        "https://forum.makerdao.com/t/off-chain-governance-incentive-objectives/13298",
                        "https://docs.google.com/spreadsheets/d/1wo8Uf52ntrZwDUSQUX42cph7YwjbzV2gWVlzVkDUieY/edit#gid=0",
                        "https://manual.makerdao.com/governance/offchain-incentives/proposal-bounties",
                        "https://immunefi.com/bounty/makerdao/",
                        "https://discord.com/channels/893112320329396265/899667119426371625/983393049629565061",
                        "https://forum.makerdao.com/t/no-executive-proposal-2022-06-01/15386",
                        "https://discord.com/channels/893112320329396265/899667119426371625/983746847212449852",
                        "https://forum.makerdao.com/t/prioritization-framework-sentiment-polling/15554",
                        "https://forum.makerdao.com/t/relay-semanal-24-30-de-mayo-de-2022/15594",
                        "https://vote.makerdao.com/polling/QmWTfWad",
                        "https://vote.makerdao.com/polling/Qmd4RbRq",
                        "https://makerburn.com/#/rundown",
                        "https://www.youtube.com/watch?v=_tOhFiReRkI&t",
                        "https://forum.makerdao.com/t/governance-and-risk-193-thursday-june-02-at-17-00-utc/15548",
                        "https://www.youtube.com/watch?v=sGeA07E7XrQ",
                        "https://forum.makerdao.com/t/decentralized-voter-committees-startup-phase-wednesdays-5pm-cest-all-mkr-holders-welcome/15330",
                        "https://www.google.com/url?q=https://forum.makerdao.com/t/meet-your-delegate-13-mhonkasalo-teemulau-and-chicagodao/15481&sa=D&source=calendar&ust=1655041993971024&usg=AOvVaw1nObhHuXN4MHdokRGn3tZs",
                        "https://us02web.zoom.us/j/85268917264?pwd=YmRTbkZlSGRnZmMvakJ4b3JIcDJMZz09",
                        "https://forum.makerdao.com/t/meet-your-delegate-14-chris-blec/15585",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/89824692690?pwd%3DUG9lWWxaUnZLcjhXZDZuMmZVT2xDQT09&sa=D&source=calendar&ust=1655041993971024&usg=AOvVaw31TU7keyb9diOEbePofgLI",
                        "https://forum.makerdao.com/t/decentralized-voter-committees-startup-phase-wednesdays-5pm-cest-all-mkr-holders-welcome/15330",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/81436458345&sa=D&source=calendar&ust=1654445893399659&usg=AOvVaw0-CBSXWDpRLmmAO6XGLV0G",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://forum.makerdao.com/t/weekly-mips-update-90/15648",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/weekly-relay-may-31-june-06-2022/15654"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#2",
                    "likes": "7",
                    "time": "09/06/2022-00:40:45",
                    "content": "Gracias José por la excelente labor de continuar colocando a la disposición del habla castellana los relay semanales.     Joserjimz:  El SourceCred ha probado ser una herramienta de reputación innovadora para fomentar la colaboración abierta entre equipos de colaboradores descentralizados. Sin embargo, el SourceCred tiene sus limitaciones. El problema principal es que nuestra instancia de SourceCred hace que sea muy difícil modificar los incentivos para evitar que las recompensas caigan en manos de los colaboradores que ya reciben un salario por parte de MakerDAO.   Me parece una decisión acertada el sectorizar en tres grandes grupos la repartición de las recompensas, evitando así la redundancia de salarios e incentivando la participación tanto general, como a nivel de plantear propuestas. Saludos cordiales. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#3",
                    "likes": "4",
                    "time": "09/06/2022-17:09:20",
                    "content": "Excelente trabajo Jose  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xRami",
                    "index": "#4",
                    "likes": "3",
                    "time": "11/06/2022-17:52:58",
                    "content": "Muy buen trabajo como siempre! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#5",
                    "likes": "5",
                    "time": "12/06/2022-15:29:51",
                    "content": "Muy bueno!   Me parece que SourceCred es una herramienta excelente, y que ofrece un incentivo muy interesante para la comunidad. Creo que evitar la doble imposición de salarios y recompensas es importante para mantener el sistema funcionando, ya que de otra manera la razón original para su creación no se cumple. Gracias por la traducción Jose ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                }
            ]
        }
    ]
}