{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/independent-review-of-alm-framework-for-makerdao-and-suggestions-for-balance-sheet-optimization/15730",
            "title": "Independent review of ALM Framework for MakerDAO and Suggestions For Balance Sheet Optimization ",
            "index": 15730,
            "category": [
                "Core Units",
                "Strategic Finance"
            ],
            "tags": [
                "alm",
                "sf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#1",
                    "likes": "12",
                    "time": "10/06/2022-17:11:03",
                    "content": "Independent review of ALM Framework for MakerDAO Independent Review of ALM framework for MakerDAO and Suggestions For Balance Sheet Optimization. Main takeaways are listed below, for more details please reference the deck link above. TL;DR  MakerDAO’s ALM practice is constrained by maintaining DAI’s USD peg and has achieved high liquidity ratios, which provide protocol security, but could indicate less than optimal use of funds. Shift focus to balance sheet optimization to increase net interest income, liquidity buffer and reinvest in the platform. Recognition of vault’s backing collateral (i.e. crypto-collateral) as liabilities, similar to deposits at banks, and as un-invested assets held in reserves. This will establish a baseline for the balance sheet optimization. Focus on balance sheet optimization by converting crypto reserves to generate additional yield by launching an ALM investment program and/or new product features (i.e. notice periods) that will allow funding of short-term investments in crypto native platforms or real world assets. Source investment opportunities to generate yield for the PSM vault. In TradFi this would be similar to the investment program for excess deposits in the interbank market and US treasuries, which is the process by ALM gathers detailed portfolio data, develops scenarios, calculates deposits duration and devise investment strategies for yield-generating investments. Establishing an investment program may lead to a 180 million DAI increase in net interest income. Target state asset returns in table below. Leverage some of these identified investments to increase the robustness of MakerDAO’s liquidity buffer.   1  Target NIM and NII are based on 6/8/22 USD yields and allocation assumptions that may change 2  Crypto market values are based on 5/16/22 market prices 3 NII variance forecast could change based on cryptocurrencies market value fluctuations and investment opportunities @SebVentures ",
                    "links": [
                        "https://forum.makerdao.com/t/alm-framework-for-makerdao/12994",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-09-15-2022/15843",
                        "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151/24",
                        "https://forum.makerdao.com/t/signal-request-mip65-asset-reallocation/18295/11",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-junio-del-2022/16923",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-09-15-de-junio-de-2022/15954",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-june-2022/16783",
                        "https://forum.makerdao.com/t/revision-independiente-del-marco-alm-para-makerdao-y-sugerencias-para-la-optimizacion-del-balance-traduccion/15982"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.498701298701299
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "3",
                    "time": "10/06/2022-17:47:10",
                    "content": "I understand how Maker could invest the stablecoins stored in the PSM, but how could it invest the ETH and WBTC collateral? Isn’t this collateral sacrosanct and under exclusive control of the vault owner? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#3",
                    "likes": "2",
                    "time": "10/06/2022-18:04:03",
                    "content": "That’s a great question. Those coins are backing the crypto loans based on vault-specific collateral ratios, but they are technically part of MakerDAO’s balance sheet. It may not be possible to invest the backing collateral given the current vault set up because its deemed too risky, or because of underlying vault rights, but vault enhancements such as notice periods or wallet permissions could make it possible. There could be a lot to gain from the 7 billion of assets currently held as collateral for borrowers, MakerDAO and MakerDAO stakeholders. I expand on the possible investment options on slides 19-22 of the deck ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Khan",
                    "index": "#4",
                    "likes": "3",
                    "time": "10/06/2022-18:13:44",
                    "content": "Lots to digest, but this is great research. Glad to see it commissioned and really appreciate the level of depth and approach. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#5",
                    "likes": "8",
                    "time": "10/06/2022-18:23:20",
                    "content": "My main takeaway from this, which I strongly agree with, is that our top priority should be to reallocate USDC from the psm into US government bonds. I am right now working on figuring exactly what can be done to speed this up, specifically with MIP65 (which I gather is already being worked on at a good pace) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.946428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#6",
                    "likes": "7",
                    "time": "10/06/2022-19:05:56",
                    "content": "The independent review was commissioned to have a TradFi expert view on the ALM work done for MakerDAO. There are plenty of areas where we meet:  Focusing the ALM scope more on solvency then interest rate risk (liquidity risk staying important in both TradFi and DeFi). Investing in short-term bonds, area which is underway.  One main difference, and previous commentators have noticed, is taking the collateral of customers as “deposits” while I take it as a pledge only (enforced by smart contract) in mine. I always took the view that customer collateral is out-of-reach and that we don’t do rehypothecation (like Aave) or anything else with the collateral. From the whitepaper:  Vaults are inherently non-custodial: Users interact with Vaults and the Maker Protocol directly, and each user has complete and independent control over their deposited collateral as long the value of that collateral doesn’t fall below the required minimum level  Yet, it is good that studies like that one challenge this assumption. It might or might not be linked in some ways to Maker Ethereum from the Endgame plan. Overall, it’s really a business question, both are possible. On one side, Aave provide a yield on ETH which make them more attractive to borrow stablecoin there (against DAI), on the other side, having the collateral is pure safety is probably a selling argument as well. Up to the community and MKR holders to decide. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp12-declaration-of-intent-invest-in-short-term-bonds/13084",
                        "https://forum.makerdao.com/t/the-endgame-plan-parts-1-2/15456"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.935150375939849
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#7",
                    "likes": "4",
                    "time": "10/06/2022-19:50:50",
                    "content": "The pledged collateral is quite volatile - variance about 5X typical stocks.  As such one should be very careful trying to get additional yield on this bucket. First create solid investment options for the Demand DAI and devolop rock solid ALM processes ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.961111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#8",
                    "likes": "1",
                    "time": "11/06/2022-14:53:59",
                    "content": "@One_Pastrami I think the most elegant solution to Asset-Liability Management is Cash Surrender Value. By pegging DAI (i.e. a stablecoin) to an interest-bearing US Dollar (i.e. a stablecoin) on the balance sheet of a mutual life insurance company, you outsource the interest rate risk. Let the multi-trillion dollar insurance companies and actuaries handle that instead of MakerDAO. Meanwhile, all we do is collect a passive income of 3-6%. Since DAI is overcollateralized and insurance companies are fully-reserved and operate at a surplus (since the Civil War), there is no liquidity or solvency risk. Or to put it another way, if the mutual insurance companies need a bailout DAI’s peg is the least of our problems. It is the closes thing to perfect collateral as you can get to collateralize a digital dollar.    Decentralized Option Vaults and Superfluid Collateral Collateral Onboarding       “It ain’t what you don’t know that gets you into trouble. It’s what you know for sure that just ain’t so.“ – Mark Twain  Between now and 2045, a total of $84.4 trillion in wealth is expected to pass down either to beneficiaries or charity in the United States. What are they expected to do with all the wealth they inherit? One solution could be an annuity. A fixed interest annuity is a contract with a life insurance company that provides a guaranteed lifetime stream of income. It is like the Soci…         SebVentures:  One main difference, and previous commentators have noticed, is taking the collateral of customers as “deposits” while I take it as a pledge only (enforced by smart contract) in mine.   This is a good topic to bring up here. Traditional banks use the cash surrender value of a policy that is cross-collateralizing a secured bank line of credit as a cash deposit and rehypothecate it 10 times over. Plus they still get the risk-free yield from the loan. I think it makes sense to rehypothecate only the cash surrender value since it’s the most pristine collateral and has no variance in price. I don’t think it’s a good idea to use crypto for rehypothecation. Also, the contractual policy loan provision gives life insurance contracts a self-liquidation mechanism (i.e. exit liquidity) at all times. MakerDAO can treat the insurance collateral as the senior secured tranche, maybe if there’s a capital raise or revenue-based financing that would make it the mezzanine debt tranche, and the MKR holders the equity tranche. Some corporations even use IULs as an employee retention program which MakerDAO could employ by issuing them to key persons and instantly their life becomes a cash-flowing balance sheet asset for MakerDAO. Furthermore, the growth in principal from recapitalizing interest can be used as off-balance sheet leverage. All overcollateralized and tax-free until death. Death is not a matter of if, but when. So we might as well be maximizing our CAGR while we’re here.   Julius Baer    Why financing universal life policies makes perfect sense What is universal life insurance premium financing and why has it become such an attractive solution for wealthy clients?      ",
                    "links": [
                        "https://www.juliusbaer.com/en/business-navigator/intermediaries/why-financing-universal-life-policies-makes-perfect-sense/",
                        "https://www.juliusbaer.com/en/business-navigator/intermediaries/why-financing-universal-life-policies-makes-perfect-sense/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0931216931216925
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#9",
                    "likes": "0",
                    "time": "20/06/2022-21:55:17",
                    "content": "    Eumenes:  The pledged collateral is quite volatile - variance about 5X typical stocks. As such one should be very careful trying to get additional yield on this bucket.   I agree! Due to the volatility of crypto market prices, prudent investment options are needed. Also agree that DAI investment program should be prioritized, and seems to be the case as mentioned by Rune in the comments above and the MIP65 Signal Request. In current state the pledged collateral cryptocurrencies are sitting idle in MakerDAO’s balance sheet which is in most cases what collateral should do. Step 1 may be to recognize those collaterals in MakerDAO’s accounting balance sheet to have a line of sight of potential investment decisions that can be implemented without impacting DAI’s peg. A possible outcome may be to continue to have ALL of the collateral sitting idle but my assumption is that borrowers might want to earn a yield on their locked assets (specially as USD rates rise), MakerDAO could earn a referral/commission fee, which could incentivize broader uses and partially reduce repayment risks. This could be a win-win solution for borrowers and MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.137716450216451
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#10",
                    "likes": "0",
                    "time": "20/06/2022-23:01:19",
                    "content": "Pledged collateral is not Maker’s. You cannot touch it except in liquidation. Please understand it is not custodial. The collateral cannot be moved ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#11",
                    "likes": "0",
                    "time": "20/06/2022-23:04:33",
                    "content": "I understand that. What I am proposing is allowing the borrowers to place the collateral through MakerDAO in yield generating instruments such as overnight ETH platform lending, same as repo market, to generate yield. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#12",
                    "likes": "2",
                    "time": "20/06/2022-23:11:50",
                    "content": "Basically you are proposing that if I open a vault with ETH? and borrow DAI that ETH is generating interest? so as an example you spend in Compound? I deposit ETH and general Yields and if I borrow it continues to generate? Did you think that automatically that is there, it means that it was borrowed and technically in the protocol does not have its backing in real time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#13",
                    "likes": "1",
                    "time": "20/06/2022-23:17:57",
                    "content": "    One_Pastrami:  What I am proposing is allowing the borrowers to place the collateral through MakerDAO in yield generating instruments such as overnight ETH platform lending, same as repo market, to generate yield.   That’s Aave and Compound. Why wouldn’t they just do that on their own? It’s very, very low yield anyway. At that point Aave failure would mean existential risk. At least with D3M we could turn it off if we wanted It’s not impossible, but you’re basically saying take aETH and cETH as collateral ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.002604166666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#14",
                    "likes": "0",
                    "time": "20/06/2022-23:19:36",
                    "content": "Diego - That is partially what I am saying. Its a high-level idea that would need to be tested but in that ETH backed loan example, the borrower would have the option to leave all ETH-collateral funds uninvested or invest a portion at their discretion (5-25% of total locked assets) in MakerDAO vetted ETH investment options that are highly liquid. To ensure DAI’s peg the allowable ETH investment percentage could be limited to only the amount above the borrowed DAI amount. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9904761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#15",
                    "likes": "1",
                    "time": "20/06/2022-23:52:39",
                    "content": "Its low-yield but when there are billions of excess collateral funds, even a few bps could mean millions in net income. Competitive pressure is another risk that this solution could mitigate, as you rightly pointed out AAVE and Compound pay interest on deposited ETH.     AliceinMKRland:  It’s not impossible, but you’re basically saying take aETH and cETH as collateral   Yes thats a way of thinking about it and this would only be if the DAI borrower opted into those investments and accepted the counterparty risks. As mentioned above the allowed ETH collateral investment should only be the portion above the DAI borrowed amount and a small “liquidity” buffer. E.g. 1 ETH = 1,000 DAI, someone borrowed 10,000 DAI and collateralized 20 ETH (20,000 DAI) into a minimum 150% collateral ratio vault.  ETH Liquidation Price: 1 ETH = 750 DAI. In this scenario, 13.3 ETH (13.3 * 750 = 10,000) would be the required ETH amount to repay the 10,000 borrowed DAI and ensure DAI’s peg, if liquidation occurs. The remaining 6.7 ETH, minus a liquidity buffer, is excess and the borrower could “opt in” into aETH, cETH or other ETH-denominated investments. In the case of liquidation, the liquid (13.3) and the invested (6.7) amount would be returned to the borrower. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.846478174603175
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#16",
                    "likes": "0",
                    "time": "18/09/2022-23:52:43",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}