{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip80-mkr-compensation-guideline/17235",
            "title": "MIP80: MKR Compensation Guideline ",
            "index": 17235,
            "category": [
                "Maker Improvement Proposals",
                "RFC"
            ],
            "tags": [
                "mips",
                "mkr-compensation",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#1",
                    "likes": "11",
                    "time": "13/08/2022-19:06:33",
                    "content": " MIP80: MKR Compensation Guidelines  Preamble MIP#: 80 Title: The MKR Compensation Guidelines Author(s): @CodeKnight Contributors: @CodeKnight Tags:  Type: Process Status: RFC Date Proposed: 2022-08-13 Date Ratified:  Dependencies:  Replaces: N/A Forum URL: https://forum.makerdao.com/t/mip80-maker-compensation-guidelines/17235 Ratification Poll URL:   References  MIP53: The MKR Compensation Guidelines    Sentence Summary MIP80 describes how MKR will be used to recruit, retain and align interest in the Maker community.  Paragraph Summary MIP80 details the annual amount of MKR each Core Unit will get for internal distribution among its members. The Guideline seeks to replace individual proposals from Core Units for MKR compensation. The guideline intends to fulfill the requirement of offering globally competitive compensation for critical Core Units, but also reward all contributors with a share of the Maker protocol.  Component Summary MIP80c1: How the MKR Compensation Guideline work Describes the MKR Guideline proposal. MIP80c2: Proposed Compensation Describes the proposed amounts of MKR used for Compensation. MIP80c3: Recommended best practice MIP80c4: Amending the MKR Compensation Guideline Describes how Maker can change the MKR Compensation Guideline’s details by use of a MIP80c4 subproposal.  Motivation MKR compensation provides a safe way to compensate employees in a deferred manner. It additionally aligns incentives across the community. While budget proposals involving MKR could be proposed by each Core Unit separately and customized for each Core Unit, such an approach has the downside of consuming considerable time and resulting in much complexity. There is also the aspect of avoiding creating diverging incentives as these could lessen the cohesion of the community. Additionally, the discrete yes/no nature of voting meant that some Core Units might get everything they ask for while others end up with nothing. As such, a common guideline for MKR compensation is highly preferable. This proposal focuses on the question of “What percent of total CU member compensation should be in vested MKR tokens?”.  It does not intend to address “What should total CU member compensation be?”.  Specification / Proposal Details MIP80c1: How the MKR Compensation Guideline work The guideline proposes that MKR is transferred to the Core Unit Facilitator based on the total salary of each Core Unit as specified in their MIP40 Budget. The Facilitator will then distribute the compensation to their team based on the situation that is most applicable to that specific unit. This method was chosen to allow for simplicity for the Community as well as flexibility for the Core Units. Any funds not spent should be returned to the community. The MKR will be transferred to the Core Unit upon ratification on a pro-rated basis, and every 6th of July and 6th of January thereafter. To minimize disruption, Core Units currently using an alternative MKR compensation plan may choose to continue that plan until their next budget adjustment or budget cycle. MIP80c2: Proposed Compensation 75% of Core Unit salaries will be given as compensation, with a four-year vesting schedule plan. The amount of MKR to be streamed to the CU is set at the beginning of the vesting period, with the price based on the six-month trailing average. MIP80c3: Recommended best practice   Core Units receiving MKR are advised to adhere to this guideline when possible.   Core Units should include expected MKR vesting in budget requests.   Core Units may choose to receive less than 75% if they would prefer to focus on Dai compensation for example. In this case, they should state this in their budget requests.   If any Core Unit member is likely to receive over 200,000 USD worth of MKR, that should be disclosed in their budget request.   MIP80c4: Amending the MKR Compensation Guideline Example for clarity A Core Unit has budgeted 2M a year for salaries. That is 1M per 6 month period. July 6th passes. Assuming the previous 6 month average price of MKR is worth 1K, the CU is assigned 750 MKR , which is vested over a 4 year period. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/10",
                        "https://forum.makerdao.com/t/weekly-mips-update-105/17999",
                        "https://forum.makerdao.com/t/governance-and-risk-208-thursday-september-15-at-17-00-utc/17887",
                        "https://forum.makerdao.com/t/weekly-mips-update-102/17511",
                        "https://forum.makerdao.com/t/weekly-mips-update-103/17674",
                        "https://forum.makerdao.com/t/weekly-mips-update-104/17861",
                        "https://forum.makerdao.com/t/weekly-mips-update-101/17392",
                        "https://forum.makerdao.com/t/relay-semanal-09-15-de-agosto-del-2022/17353",
                        "https://forum.makerdao.com/t/weekly-mips-update-100/17265",
                        "https://forum.makerdao.com/t/mip40c3-sp48-strategic-finance-unit-mkr-compensation-sf-001/12060/14",
                        "https://forum.makerdao.com/t/weekly-mips-update-107/18199",
                        "https://forum.makerdao.com/t/weekly-mips-update-108/18310",
                        "https://forum.makerdao.com/t/weekly-mip-update-106/18103"
                    ],
                    "GPT-summary": "The post describes MIP80, which proposes guidelines for using MKR to recruit, retain, and align interests in the Maker community. The proposal details the annual amount of MKR each Core Unit will receive for internal distribution among its members. The post explains how the MKR Compensation Guideline works, the proposed compensation, recommended best practices, and how the guideline can be amended. The post also mentions that Core Units may choose to receive less than 75% if they prefer to focus on Dai compensation and that any Core Unit member likely to receive over 200,000 USD worth of MKR should disclose it in their budget request.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Board composition",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.512777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/08/2022-19:08:28",
                    "content": "This is my draft proposal for standardizing compensation. I appreciate questions and feedback. I am trying to create a simpler long term system, while minimizing short term disruption. I went with a typical startup vesting schedule, although I am open to arguments for a different schedule as I understand working in crypto has its own unique issues. Ultimately, I want to create a system that is clear and fair to all CUs, while also being easily understood by MKR holders. A straightforward salary based compensation system seemed like the best way to achieve that. Edit: Additional context, I primarily view MKR compensation as a way to safely defer costs for the protocol in return for higher potential salaries for CUs. The expectation should be that you are accepting a lower short term salary, but in return if MKR at least stays stable then you will earn a higher long term salary. Additional benefits are aligning incentives of CUs and MKR holder and generally putting MKR in the hands of people who care about the protocol. If there are additional considerations or ways that my proposal can be improved to meet these factors, please explain how. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.015151515151516
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#3",
                    "likes": "3",
                    "time": "13/08/2022-21:45:30",
                    "content": "A salary sheet and vesting schedule with ranges based on level might be useful to include in this proposal. Not sure it will apply across all CUs, but having a standardized salary range would provide transparency to voters, community, attract talent and receive feedback about compensation levels. Just some high level thoughts on what those standard levels may look like below. CU Facilitator CU Director CU Core Member CU Analyst CU Intern One of the best companies I worked for had a published salary sheet with ranges based on department and title that refreshed annually. It provided its employees with comfort about being paid fairly but there was also a range wide enough to compensate for higher performance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.144444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#4",
                    "likes": "3",
                    "time": "15/08/2022-16:15:53",
                    "content": "Appreciate the willingness to take on such a historically difficult and divisive initiative. Would highly recommend reading up on the history of a standardized MKR compensation plan as outlined in the Starknet thread. I believe the DAO would benefit immensely from a standardized plan and hope that a delegate taking the lead on this subject will break the dam on the issue and the community can finally align on a plan. Few questions:     CodeKnight:  To minimize disruption, CUs currently using an alternative MKR compensation plan may choose to continue that plan until it is fully distributed.   Why not use this plan to replace all existing plans? If Core Units are given an option between the new MIP and their existing Governance approved plans, they will simply pick the higher of the two. It will indeed be controversial to replace existing plans, but it may be in the DAOs best interest to level the playing field and reduce envy.     CodeKnight:  75% of CU salaries will be given as compensation, with a four-year vesting schedule plan with a one-year cliff. The MKR price used to determine compensation will be adjusted on the 6th of January and July.   Could you clarify this? The way it’s written it sounds like 100K salary would mean 75K DAI of MKR compensation over four years, or 18.75K DAI. Could you please confirm?     CodeKnight:  MIPXc2: Proposed Compensation 75% of CU salaries will be given as compensation, with a four-year vesting schedule plan with a one-year cliff. The MKR price used to determine compensation will be adjusted on the 6th of January and July.   Only PE and Oracles have a four-year vesting schedule at the moment, why was this chosen over the more typical three-year vesting schedule? How will the compensation be adjusted? Please share any formula and example calculations. If the plan is repricing the MKR every six months, it could create an adverse incentive for contributors to lower the price of MKR so they get a larger % of supply in the short-term. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.347369528619529
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#5",
                    "likes": "1",
                    "time": "15/08/2022-16:46:11",
                    "content": "    CodeKnight:  MIPXc2: Proposed Compensation 75% of CU salaries will be given as compensation, with a four-year vesting schedule plan with a one-year cliff. The MKR price used to determine compensation will be adjusted on the 6th of January and July.   To the community: One of the challenges here is to find the correct amount of incentives, on a yearly basis, to award contributors. MKR incentives feel more like RSUs. I think Maker is an early stage company and there are industry best practices that would define how other tech companies allocate RSUs. We currently have a number of VCs as MKR holders and my vote would be to model a plan based upon current best practices for early stage companies. We can get that information. I feel as if we’re trying to reinvent the wheel. These issues have been resolved elsewhere. Let’s use that learning and move on. As Maker matures, the incentive model will mature. Right now, I think morale and retention are key priorities so erring on the side of generosity would be my recommendation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.345779220779221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#6",
                    "likes": "2",
                    "time": "15/08/2022-17:43:11",
                    "content": "Another element that’s important here is the pricing used for MKR calculations. We haven’t found a great consensus in proposed plans at the moment, with Moving Averages ranging from 2 months to 12 months. Getting this “right” is important across a couple key ares. One factor is bear vs bull market (we want a structure that attracts and retains talent regardless of market sentiment), as anything we design we want to be stable for at least the duration of the program. Personally, I think something like a year moving average on the eligibility dates seems reasonable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#7",
                    "likes": "0",
                    "time": "15/08/2022-21:30:07",
                    "content": "    prose11:  Another element that’s important here is the pricing used for MKR calculations   When you do stacking grants (like yearly), this becomes less of a concern. You get what you get…I have a few worthless stock option grants.   There are limited cases where early, early stage companies reprice stock options or make adjustments on a down round. In my experience, I’ve never been part of that. One thing that is known is the price of the incentive at the time of grant. I’d design around that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.447971781305115
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#8",
                    "likes": "2",
                    "time": "16/08/2022-02:16:30",
                    "content": "    Aes:  Why not use this plan to replace all existing plans   My intent was to not cut pay mid budget. Perhaps it would be better to say until their next budget adjustment. That way CUs like Govalpha who currently run very MKR heavy on compensation can adjust for their next budget application. Edited to reflect this.     Aes:  Could you clarify this? The way it’s written it sounds like 100K salary would mean 75K DAI of MKR compensation over four years, or 18.75K DAI. Could you please confirm?   That is correct.     Aes:  Only PE and Oracles have a four-year vesting schedule at the moment, why was this chosen over the more typical three-year vesting schedule?   4 year vests are standard for startups.     Aes:  How will the compensation be adjusted?   So each January and July, MKR will be assigned to the CU for vesting based on current prices. That amount of MKR will then be vested over 4 years. The only adjustments would come to future MKR vestings. If a rolling 6 month average is preferred for determining the price instead, I could adjust the proposal to that.     monkey.irish:  We currently have a number of VCs as MKR holders and my vote would be to model a plan based upon current best practices for early stage companies. We can get that information.   I would love to see that information if someone can get it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.469246031746032
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#9",
                    "likes": "1",
                    "time": "16/08/2022-02:56:47",
                    "content": "    CodeKnight:  I would love to see that information if someone can get it.   @Porter_Smith Would a16z be willing to share your experiences/insights in helping Maker setup an incentive plan consistent with an early stage company? I bet you guys have done one or two of these…  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Porter_Smith",
                    "index": "#10",
                    "likes": "2",
                    "time": "16/08/2022-15:46:38",
                    "content": "Let me chat with our folks and get back to you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#11",
                    "likes": "2",
                    "time": "16/08/2022-17:12:22",
                    "content": "IIRC, Early stage startups do not have large market caps or liquid incentive compensation. The compensation packages are generally very low on paper, with the expectation of exponential growth. They may not be comparable in this instance. Something in between an early stage startup and FAANG may be a better approximation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.914285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#12",
                    "likes": "0",
                    "time": "16/08/2022-17:27:34",
                    "content": "    MadShills:  Something in between an early stage startup and FAANG may be a better approximation.   Echo this - liquid tokens are a weird hybrid for organization: the early immaturity of a startup and the late-stage scrutiny of a public company. Maker has ca. $1bn in market cap and over 100 contributors - it is an early-stage venture but it is not a small startup. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.270833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#13",
                    "likes": "5",
                    "time": "17/08/2022-18:37:49",
                    "content": "While we wait for @Porter_Smith to get back on us I want to put in an overview on the topic that can help i picking a path forward. I’m very happy this topic is raised as I think the topic has the potential to both cause a lot of internal friction if allowed to develop freely as well as impose a heavy financial impact on MKR holders. Objectives of vesting: One of the never-ending conundrums in organizational theory is how to handle the issue of principal and agent. In short, owners of a thing want to employ someone to work for them and wants the workers to have the best interests of the owners at heart when conducting work. So far, I’ve identified several areas where MKR holders wish to align their incentives with contributors.   Price appreciation. MKR holders get increased value when MKR tokens appreciate. Increasing token price is a signal of successful governance. MKR holders wants contributors to share the goal of appreciating token value. There are however limits to what each individual contributor can do to influence said value.  Retention. Maker is very complex and requires a very specialized set of skills. Introducing someone to the ecosystem can take a lot of time. Getting to know the particulars and then to contribute positively takes even longer. As such losing a contributor constitutes a loss of investment meaning it makes sense to try to incentivize people to stay on longer.  Damage control. To ensure that a contributor working on the protocol doesn’t have reason to harm the project either through malice or incompetence having the success of the token tied to the economic fortune of the contributor can assist in ensuring a high level of focus. It will also influence a contributor leaving the protocol to not damage the protocol in the period before leaving.  Current system – MKR vesting The current MKR vesting system seeks to align the interests of MKR holders and contributors by vesting MKR tokens to be paid into the future, thus creating an incentive for contributors to have appreciating MKR value. The vesting schedule and amount of MKR vested varies considerably between and within the various CUs. Some downsides to MKR vesting from a MKR holder perspective is that firstly it dilutes MKR holders, and secondly that it will most likely put a downwards price pressure on the MKR token when the vesting period matures. This is built on the assumption that contributors will not be financially independent. It will thus be unreasonable to assume that all MKR tokens given to contributors be held, rather we should expect that most of them will be sold to invest in other assets or to be exchanged for goods and services. Some MKR vests allows repricing to be triggered meaning that the total amount of MKR tokens vested will be changed to reflect a new (usually lower) average price. This gives the effect of (more or less) preserving the DAI value of a given MKR vest. Should the price recover from a decrease in value, the value of the vest will be higher compared to a situation where there wasn’t a depreciation in value. This naturally presents a clear upside and risk mitigation to the contributor. Unfortunately, it introduces an incentive that runs directly opposite to MKR holders. To maximize value under these circumstances a contributor would want the MKR price to go down temporarily. Timings between different vests makes a coordinated push in this direction unlikely as a lower price will depend on being early in the vesting period for this to be a viable strategy. Other MKR vests sets the number of MKR as a function of DAI compensation and awards MKR based on a trailing average price of the MKR token. The period of the trailing average price varies. Another common solution is to award a fixed number of tokes at the start of a vest. Pros - MKR vesting without repricing:  Partly aligns contributors with MKR price appreciation Aligns contributors against harming the protocol. Incentivizes retention since you need to stay to receive the vest. Barring a total collapse of the MKR token provides some sort of additional compensation for contributors.  Cons – MKR vesting without repricing  Dilutes MKR holders. MKR vesting increases the total supply of MKR in the market, this happens regardless of whether MKR is pulled from the treasury or minted new. Places a downwards price pressure on MKR tokens from contributors selling their tokens.  Pros – MKR vesting with repricing  If Maker does not become insolvent it guarantees contributors additional compensation, Greatly reduces contributor MKR price risk Provides a lot of value for contributors in an ideal scenario (price dip, reprising and recovery) Somewhat aligns contributors with MKR price appreciation. Incentivizes retention since you need to stay in to receive the vest.  Cons – MKR vesting with repricing  Dilutes MKR holders. Potentially dilutes MKR holders far more than envisioned at the time of vesting. Places a downwards price pressure on MKR tokens from contributors selling their tokens. Introduces incentives running contrary to MKR holders in the short term. Introduces MKR price risk for the protocol.  Alternatives to the current system . The current iteration of MKR vesting covers some of the objectives sought in aligning MKR holders and contributors. However, there are others that are not currently employed in Maker DAO. 2 alternatives are presented below. A compensation package could also consist of a combination of different vests. Possible alternative 1; Synthetic MKR options DeFi is growing but there are tools that exists in TradFi that haven’t been developed for MKR yet. A buy option gives the holder a right to buy an underlying asset at a given price. As an example, an option for MKR could give a holder the right to buy 1 MKR for 1 000 DAI. The price of such an option would be the price difference between 1 000 DAI and whatever the current MKR price is. It would also mean that the option is worthless (simplified by disregarding duration) whenever the price of MKR is bellow 1 000 DAI. It would be possible for Maker to create synthetic options by setting a certain amount a recipient needs to pay in DAI before access to the vest is granted. This would allow Maker to reward contributors for any appreciation of MKR token value after starting the vest instead of handing out value regardless. There would also need to be decided whether these options can be called at any time after the vesting period or just as the period ends. Pros:  Strongly aligns contributors to MKR value appreciation. Strongly aligns contributors against harming the protocol. Incentivizes retention since assets tend to appreciate over time and you need to stay to receive the vest. Avoids payouts for the protocol in the event of depreciating MKR token value which typically depreciates in bear markets. Avoids any draws on the surplus buffer.  Cons:  Introduces negative price pressure on MKR when contributors exchange tokens for alternative investments or goods and services. Introduces a strong price risk for contributors. Worst case the vest can become worthless. Harder to find “right” compensation level since the value is very volatile. Dilutes existing MKR holders.  Possible alternative 2; DAI vesting As an alternative incentive solution, we could introduce DAI vesting. This would be DAI that are paid after a vesting period. Working similarly to existing vests it will promise future payouts if a contributor stays with the protocol. It should also have a clause that if an individual has been deemed responsible for causing harm to the protocol the vest can be terminated. Pros:  Covers the objectives of retention and damage control. No MKR price risk for contributors. Does not create downwards MKR price pressure. No incentive to create temporary lower MKR price. No dilution of MKR holders.  Cons:  Doesn’t give contributors financial incentive for appreciating MKR price. Creates a larger draw on the surplus buffer thus lowering operational runway. Risks being viewed as deferred pay, instead of increased compensation. Incentivizes contributors to focus on safety of the protocol rather than growth.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.306081138129011
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#14",
                    "likes": "0",
                    "time": "17/08/2022-21:44:10",
                    "content": "Does adding MKR, a governance token, to CU’s compensation make sense? We already have a USD pegged stablecoin which reduces the salary volatility, why complicate by adding MKR. As you point out, Maker is not an early stage company whose token (stocks in real world) is private and you join expecting a future life-changing payout. At this point MKR is a liquid token, that can be swapped at any time, and price discovery is dictated by the actions of a collective group (>100 CU members) and market sentiment. MKR token holders shouldn’t be diluted at this stage. Basically I am agreeing with Justin’s DAI vesting proposal.     JustinCase:  Possible alternative 2; DAI vesting As an alternative incentive solution, we could introduce DAI vesting. This would be DAI that are paid after a vesting period. Working similarly to existing vests it will promise future payouts if a contributor stays with the protocol.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#15",
                    "likes": "0",
                    "time": "17/08/2022-23:15:38",
                    "content": "Updated with examples. My proposal does not have any repricing. If CUs wish for greater income stability, then that can be achieved by requesting higher Dai compensation in return for less vested MKR. As for the alternatives     JustinCase:  Possible alternative 1; Synthetic MKR options   This option certainly has potential. It has a much higher risk and complexity level, but if someone wants to put something together I would be interested.     JustinCase:  Possible alternative 2; DAI vesting   Dai vesting is effectively an interest free loan from CUs to the DAO. The benefits of holding onto the Dai for a few years vs paying it now seem minimal. At best, it’s money we can loan out for a few years and earn a few percent on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.822829131652661
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#16",
                    "likes": "0",
                    "time": "02/09/2022-20:21:40",
                    "content": "I edited the proposal to delete the cliff. With how Maker is structured, the cliff can be a lightning rod for controversy and it can cause additional difficulty and overhead for members wishing to move between CUs. If there is a strong reason to include a cliff, I would consider re-adding. In theory, it incentives retention. In practice however, I don’t think it has worked that way and causes a lot of issues you don’t see in a typical startup. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#17",
                    "likes": "8",
                    "time": "04/09/2022-03:51:21",
                    "content": "I appreciate the effort it takes to put these MIPs forward. If you’ve ever done one, it takes on a whole different understanding of the process and time commitment. If you believe the primary incentive vehicle is MKR for paid DAO workers then we need continue to iterate on this plan. If you believe that isn’t the case, we need a different proposal. I don’t believe that MKR is the primary incentive for DAO workers. There are classes of roles in tech companies. Engineers and a few others are over compensated. I don’t make the rules…I’ve only observed them for a long time. Let’s bring a little reality to this discussion. A senior engineer at 350-500k Dai salary (or more…) can get that same amount in salary EACH year in RTUs in established companies bringing the yearly compensation to…you do the math, a lot. When trying to draw comparisons, be careful. We are in an extremely volatile industry so that automatically reduces the vesting schedule window. 4 years is way too long. We are extremely high risk. The higher the risk, the higher the reward. 75% of salary is too low. Imo, there are a small number of people in the DAO that aren’t focused on compensation. There is a much higher number that are. People make everything work and we need to hire the best. If you haven’t been involved with hiring in the DAO or in your past career and want to know more about the challenges, please reach out to those of us who have been building teams in the DAO. We already have an amazing staff and I believe they need to be heavily compensated for their work…especially in the challenging times. Let’s not be penny wise and pound foolish. Investing in people is the best way to spend our Dai right now. We will return to a bull market. The way we handle team building, compensation, and incentives today will influence who will be here when the bull returns. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.907716836734693
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#18",
                    "likes": "0",
                    "time": "04/09/2022-17:07:33",
                    "content": "Reserved for GovAlpha’s summary. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#19",
                    "likes": "0",
                    "time": "16/09/2022-22:01:23",
                    "content": "Amended best practices to add     CodeKnight:   If any Core Unit member is likely to receive over 200,000 USD worth of MKR, that should be disclosed in the their budget request.    Also added some clarification to Motivation that this MIP is focused on guidelines for appropriate compensation ratios and not on setting total compensation. If passed, Dai comps may need adjustments. Which is one reason CUs are allowed to finish out their current budget cycle with their current compensation plan. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.285714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#20",
                    "likes": "0",
                    "time": "17/09/2022-00:16:04",
                    "content": "Edited c2. I am not happy with the wording yet, but want to clarify that the amount of MKR you will receive is determined when you receive your salary(or sometime near it). I am open to suggestions on the most elegant way to word that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#21",
                    "likes": "3",
                    "time": "17/09/2022-13:33:36",
                    "content": "I love this initiative. From our initial research into Pave compensation data:  Not a single company compensates in actual stock Instead compensation is done via options that have a cliff and a strike price Compensation is tied to salary and seniority  Here’s why that is important: 1.) Options have to be bought by employees reducing price for the company and bringing in capital when options are exercised. 2.) Options are worthless when the company isn’t doing well, aligning incentives 3.) Tying equity compensation to seniority incentivizes sticking around. We don’t have MKR options, and MKR is very different than a stock in Maker, which is also not a company. But I suggest:  Honoring prior commitments, no reneging Tying all future MKR compensation to protocol profitability. That would mean no MKR payouts when the protocol is already under water. MKR has to be bought by contributors but is subsidized. The amount of this subsidy is directly tied to either protocol revenue, to MKR price performance, or another parameter (DAI supply, e.g.)  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.965097402597403
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#22",
                    "likes": "0",
                    "time": "22/09/2022-14:50:51",
                    "content": "Reminder that this proposal will enter its Frozen Period on Wednesday, September 28 at 23:59 UTC. Substantive modifications beyond that date will render the proposal ineligible for the upcoming Governance Cycle / reset its Frozen Period, as the case may be. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#23",
                    "likes": "3",
                    "time": "22/09/2022-15:32:46",
                    "content": "I may be delaying this until November. Please leave in RFC for now. I will let you know if it should be submitted this month. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#24",
                    "likes": "2",
                    "time": "22/09/2022-15:39:46",
                    "content": "    Aes:  Why not use this plan to replace all existing plans? If Core Units are given an option between the new MIP and their existing Governance approved plans, they will simply pick the higher of the two. It will indeed be controversial to replace existing plans, but it may be in the DAOs best interest to level the playing field and reduce envy.   I echo this. To make it a smoother transition and more likely to pass, this could include a provision to give unvested MKR to each contributor at time of passing (and thereby fully reset & open the door for this new comp system) as well. There are a couple of benefits (besides making it easier to swallow for some who would be getting compensated worse) of doing so, both of which revolve around the MKR price being low:  The tax burden of receiving the MKR at lows is significantly less Contributors are extremely unlikely to sell their MKR at the lows  Something to consider ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5792540792540795
                }
            ]
        }
    ]
}