{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-long-run-business-strategy-collateral/7547",
            "title": "[Discussion] Long-Run Business Strategy: Collateral ",
            "index": 7547,
            "category": [
                "Governance"
            ],
            "tags": [
                "strategy"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "6",
                    "time": "18/04/2021-00:09:49",
                    "content": "There was a really good thread started last week that fizzled out but I think would benefit from more attention. If you haven’t checked it out and weighed in, please do! I’d also like to have a space to discuss collateral a little more in this thread. Specifically, what can we do to aid those charged with the due diligence and on boarding of new types of collateral? I personally see Maker as well positioned to dominate the real-world collateral —> crypto financing space. Aside from diversification of collateral base just making for us a healthier balance sheet, this seems like a moat that would be quite wide once established. So… ELI5 the process from start to finish to find, evaluate, onboard a collateral type, and what the pain points are for each step of the way. Where can we as a DAO speed up the pipeline, and what new types of collateral do we not even have in the pipeline? Insurance policies? Annuities? Bonds? Municipal government assets? Artwork? Car title loans? You tell me, because I’m sure someone is tokenizing it all somewhere. And if you don’t think we should be heavy on RWA, what’s your line of thinking? Thanks for all thoughts! ",
                    "links": [],
                    "GPT-summary": "The author of the post is asking for feedback and constructive criticism on a proposal related to long-term business strategy. They are specifically interested in discussing collateral and how to onboard new types of collateral. The author is also asking for suggestions on how to speed up the process and what types of collateral should be considered. The post invites collaboration and discussion on the topic.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.228409090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "4",
                    "time": "20/04/2021-18:43:50",
                    "content": "Sorry meant to circle back here sooner! This is probably the best place to start, but the ELI5 is that a collateral journey starts with an application on the forum, that collateral is polled and then added to the collateral onboarding sheet based on how the vote goes. From there the different domain teams (Risk, Oracles, RWF if applicable etc.) start the work of getting everything together to add a new vault type to the system. Depending on the type of collateral, this can be a very intensive process or a fairly straight forward one. But ultimately, once all relevant teams sign off, the Risk Team will propose parameters for the vault type and then those parameters will be voted on by Governance, with the vault type being added upon implementation of the executive vote containing it. Phew. I might have glossed over something, so please correct me if I missed something experience folks! Basically we can onboard as much as we can safely sign off on, so bringing “proven” collateral types is a huge help. Other than that we’re probably talking about proposing additional core units and adding hands to the workforce of people that come together to get a new vault type in action. Hope that is somewhat helpful! ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1IX9e2fyfz7djtDMKn5gMyGsyFxHoY75GncMbAjnSXrM/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.924242424242424
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "21/07/2021-00:44:33",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}