{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-actual-expenses-vs-budget-september-2021/11525",
            "title": "MakerDAO Actual Expenses vs Budget - September 2021 ",
            "index": 11525,
            "category": [
                "Updates"
            ],
            "tags": [
                "expense-reporting"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#1",
                    "likes": "18",
                    "time": "08/11/2021-20:28:42",
                    "content": "All, With core unit onboarding and funding ramping up, the RWF CU wanted to provide visibility to cash flows being distributed and actual expenses vs budgets so the DAO has more confidence in allocating capital with understanding the true burn rate. As most have likely seen, the man himself @makerburn has linked up the on chain transactions from the protocol to the core units. These are not reflective of actual expenses incurred by the core units, but of the approved budgets and associated cash flows. Some of the distributions include emergency/continuous operations wallets (estimated at $2.6M) which I’ve separated out in the ‘Emergency’ column in the below snapshot. Since these wallets require multiple DAO facilitators to move funds, we believe these should be considered ‘protocol-owned.’ I’ve worked with the Core Units to publish the below consolidation of actual expenses incurred. As you can see, our true burn rate is much lower than what is reflected on chain (which as mentioned tracks cash flows), as well as the budgets posted on the forums. Extrapolating September’s expenses, our current annual cash burn rate is $17.3M (note - this excludes the DAI Foundation reserve transfer of $2M). The annualized burn rate will increase for October as DUX, CES, SH, and SNE budgets have been approved ($4.8M in additional spend) and will continue increasing as more Core Units are onboarded.  image1308×517 50 KB  As you can see in the above reconciliation, we were actually $0.9M less profitable than reported in the month of September and $1.4M more profitable on a YTD basis. Next month, I will partner with the Core Units to begin forecasting the subsequent three months of expenses so the DAO has more visibility to upcoming expenses and the community can more confidently review proposals and allocate capital. Additionally, I will work with Core Units to provide vesting schedules so the DAO has visibility to the non-cash expenses being incurred. Lastly, I am working with GovAlpha to standardize the budget return process they’ve pioneered  . Note - Oracle expenses are currently listed as cash flows, as is SES for September ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-4th-november-11th/11591",
                        "https://forum.makerdao.com/t/mip39c2-sp36-modifying-strategic-finance-core-unit-mandate-sf-001/17750",
                        "https://forum.makerdao.com/t/mip39c2-sp27-adding-strategic-finance-core-unit/11938",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/ultraschuppi-delegate-platform/11193/10"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.920289855072464
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Future_of_Finance",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/11/2021-22:20:10",
                    "content": "    Aes:  we were actually $0.9M less profitable than reported in the month of September   Awesome to get an insight on the actual burn rate, thanx! Just one quick question, how can the net protocol income be below the reported protocol income in September when actual expenses for all the CUs was below budget? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#3",
                    "likes": "5",
                    "time": "08/11/2021-22:30:58",
                    "content": "This is pretty huge, so it looks like profits are actually 20 million higher than what it shows on makerburn. Still curious what it will look like if we include MKR bonuses. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.800000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#4",
                    "likes": "0",
                    "time": "08/11/2021-23:01:47",
                    "content": "MKR vesting currently sit’s at 6.04k MKR/annum. At current price $3275.69 that equates to an additional 19.785M dai in cost. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#5",
                    "likes": "1",
                    "time": "08/11/2021-23:03:56",
                    "content": "    Future_of_Finance:  Awesome to get an insight on the actual burn rate, thanx! Just one quick question, how can the net protocol income be below the reported protocol income in September when actual expenses for all the CUs was below budget?   What we’ve been reporting for the monthly financial report is purely cash flows from on-chain transactions which do not reflect actual spend, just the movement from the protocol to the Core Units. Additionally, not all budgets are being drawn each month, mostly due to the burn rate being lower than expected (driven by delays in hiring/onboarding talent). For example, if a CU’s budget is 100K a month but they only spend 50K or less, they will not claim their subsequent month’s budget since they have plenty of money on hand to fund it. You can see the Dai being accrued by the second here and see the fluctuations in cash flows to core units here.     rune:  This is pretty huge, so it looks like profits are actually 20 million higher than what it shows on makerburn. Still curious what it will look like if we include MKR bonuses.   Yes that’s correct - will be working on adding that in for next month’s report. ",
                    "links": [
                        "https://makerburn.com/#/expenses/accounting/GOV-001"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.488988095238096
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Future_of_Finance",
                    "index": "#6",
                    "likes": "0",
                    "time": "09/11/2021-06:04:59",
                    "content": "Thanx! That makes sense. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#7",
                    "likes": "3",
                    "time": "09/11/2021-17:49:59",
                    "content": "Fantastic work @Aes thanks!     Aes:  Next month, I will partner with the Core Units to begin forecasting the subsequent three months of expenses so the DAO has more visibility to upcoming expenses and the community can more confidently review proposals and allocate capital.   Great! Super important to not only to be able to check previous expenses, but project future ones and see if we stay in the path. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.50595238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#8",
                    "likes": "2",
                    "time": "17/11/2021-11:23:46",
                    "content": "I have a suggestion regarding the timing of the repayments of unused budget: MIP40c3-SP45 outlines an increased need of 8,77M DAI in the budget for the Oracle Core Unit. Most of this is one-off expenses. I would propose to time the repayments from other Core Units to be done after the withdrawal from Oracles have been approved and completed. This will allow us to refill the Surplus Buffer faster rather than burn the returning funds and then go into a longer period of no burn. In sum it will make for less volatility in burning. ",
                    "links": [
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.347222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "15/02/2022-11:24:15",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-actual-expenses-vs-budget-october-2021/11886",
            "title": "MakerDAO Actual Expenses vs Budget - October 2021 ",
            "index": 11886,
            "category": [
                "Updates"
            ],
            "tags": [
                "expense-reporting"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#1",
                    "likes": "14",
                    "time": "30/11/2021-00:09:07",
                    "content": "All, Please see below for the October update of the monthly Core Unit expenses, including a rough forecast for the subsequent three months. As you can see from the below table, our expenses decreased by $1.4M month over month. After backing out the one-time $2M Dai reserve transfer to the Dai Foundation, other expenses increased by about $600K, a 43% increase over September. With the onboarding of the Deco, SAS, and Immunify Security CUs, our run-rate increases to approximately $2.4M per month by December, or $28.8M annualized. Adding in estimated annual Oracle costs of $15.6M (Q1 estimate from Nik, annualized), brings us to an annual cash burn rate of $44.4M.  image2566×680 126 KB  Next month, I will work on adding in a table for the MKR Compensation vesting schedules so we have a better sense of all-in expenses. Note - Oracle expenses are currently listed as cash flows ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.671875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "2",
                    "time": "01/12/2021-21:52:40",
                    "content": "Really nice to see this Aes. One thing that might be nice is a link to a spreadsheet so people can play with the data on their own.  (I for example like to look at trends with graphs) As to an initial breakout of CU numbers.   I am curious whether we can break out contractor expenses (time in FTE) vs. all other expenses.   I know Maker with exception of oracles for the most part is contractor expense dominated.   Hence it might be nice to just break the manpower equation out for the monthly on CUs into FTEs billed + other expenses just so we can get a clean look at contractor costs vs. ‘other’. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2689393939393945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#3",
                    "likes": "2",
                    "time": "02/12/2021-03:43:30",
                    "content": "Adding in some trending visualizations is a great idea - can definitely incorporate that into next month’s update as well as a shareable format. I would really like to be able to provide more detailed expenses, including a breakout of headcount expenses vs others, but some CUs are still sharpening their accounting skills so we do not have that detail yet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.714285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "02/03/2022-06:55:28",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "307"
}