{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip41c4-sp15-facilitator-onboarding-cpm-001/8619",
            "title": "MIP41c4-SP15: Facilitator Onboarding, CPM-001 ",
            "index": 8619,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "core-unit",
                "cpm-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#1",
                    "likes": "3",
                    "time": "08/06/2021-07:07:05",
                    "content": " MIP41c4-SP15: Facilitator Onboarding, CPM-001  Preamble MIP40c2-SP#: 15 Author: Kathleen Chu Contributors:   Status: Request For Comment Date Applied: 2021-06-08 Date Ratified: <yyyy-mm-dd>   Specification  Motivation  Individuals’ lives can be improved immensely when they have access to open finance and an unbiased, stable currency. That is what MakerDAO and Dai offer, which is also why I am applying to become a Facilitator. As someone passionate about equality, I want to utilize my expertise in marketing & PR and decades of experience as a former Bloomberg journalist to promote and share MakerDAO and Dai’s benefits.   Core Unit ID  Core Unit ID: CPM-001 Strategic Marcomms Core Unit   Facilitator name and information  Kathleen and Kathleen_Chu on Maker Forum  @kathleen on Rocket Chat 0x21401CCa9b3E237E6c5De9cD227CEC690d566A60   Facilitator Commitment  My commitment to MakerDAO is to fulfill the mandate, which includes protecting and growing the brand of MakerDAO by ensuring cohesive and collaborative marketing and PR initiatives and messaging. Engage in discussions regarding Maker governance, and collaborate with other facilitators and units to contribute to the success of MakerDAO Provide expertise in marketing and PR to support other units We plan to use Objective Key Results (OKR) to set a clear direction for the unit and utilize KRs to gauge our performance. I plan to share monthly updates to ensure the transparency of our progress.   Facilitator credentials  Currently working as Senior Community Lead at the Maker Foundation With the Foundation since 2019 Former Bloomberg journalist and Deputy Bureau Chief Founding member of an advocacy group called Japan DeFi Alliance Co-founded the biggest DeFi meetup group in Japan named Yasashii DeFi (easy DeFi)  Highlights  Secured Bloomberg TV interview with Rune in 2019 Successful marketing campaigns boosted the traffic to Maker’s homepage and blog in H2 2020 by more than 80 percent. Built relationships with organizations such as BGIN, a blockchain group with members including regulators such as JFSA and the Central Bank of India, and the Finance Ministry of Ireland. Finalist of SOPA Award for Editorial Excellence   Related Documents Core Unit MIP Core Unit Budget MIP ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-spx-add-strategic-marcomms-core-unit/8617",
                        "https://forum.makerdao.com/t/mip40c2-spx-add-core-unit-budget-cpm-001/8618",
                        "https://forum.makerdao.com/t/maker-relay-ep-54-en-espanol/9476",
                        "https://forum.makerdao.com/t/maker-relay-ep-54/9437",
                        "https://forum.makerdao.com/t/maker-relay-ep-53-en-espanol/9330",
                        "https://forum.makerdao.com/t/maker-relay-ep-53/9305",
                        "https://forum.makerdao.com/t/maker-governance-review-june-2021/9211",
                        "https://forum.makerdao.com/t/weekly-mips-update-42/9010",
                        "https://forum.makerdao.com/t/weekly-mips-update-41/8892",
                        "https://forum.makerdao.com/t/maker-relay-ep-49-en-espanol/8795",
                        "https://forum.makerdao.com/t/maker-relay-ep-49/8763",
                        "https://forum.makerdao.com/t/weekly-mips-update-40/8759",
                        "https://forum.makerdao.com/t/mip40c2-sp18-add-core-unit-budget-cpm-001/8618",
                        "https://forum.makerdao.com/t/mip39c2-sp14-add-strategic-marcomms-core-unit/8617"
                    ],
                    "GPT-summary": "The post is a proposal by Kathleen Chu to become a Facilitator for MakerDAO. She explains her motivation, commitment, and credentials for the role. The post also includes related documents and information about the Core Unit ID. There is no request for feedback or advertising of the proposal, but positive feedback and constructive criticism are welcome.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.469298245614035
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "2",
                    "time": "09/06/2021-14:22:21",
                    "content": "best of success Kathleen ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#3",
                    "likes": "2",
                    "time": "09/06/2021-14:34:00",
                    "content": "Good luck and I hope you succeed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                }
            ]
        }
    ]
}