{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - CGT (CACHE Gold) - September 21, 2020",
            "index": "3980",
            "option": "No (Defer)",
            "supporting_mkr": "19,800",
            "highest_fraction": 0.91
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/cgt-cache-gold-collateral-onboarding-application/3980",
            "title": "[CGT] CACHE Gold - Collateral Onboarding Application ",
            "index": 3980,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#1",
                    "likes": "10",
                    "time": "04/09/2020-13:22:48",
                    "content": " Who is the interested party for this collateral application?  @cache.gold  Provide a brief high-level overview of the project, with a focus on the applying collateral token.  CACHE Gold tokens are fully regulated, public, transparent, redeemable tokens backed by gold stored in vaults around the world. Each token is backed by one gram of pure, investment grade gold. CACHE Gold is different from other gold backed tokens in several key ways:   Superior transparency: Through the CACHE Gold Explorer, CACHE provides real-time tracking data on all the bars backing CACHE Gold. Tracking data includes location, photograph, serial number, weight, purity, refiner, current valuation and more.  Tracking data is provided directly by the vaults that store the gold (Brink’s, Loomis, Dillon Gage IDS and The Safe House).   Superior redemption options: CACHE Gold provides multiple redemption options in multiple regions: vault pickup, shipping, or sale for USD. CACHE also provides significantly smaller 100 gram ($6,250) and 1 kilogram ($62,500) bars than the 400 toz LBMA good delivery bars (~$750,000+) that competing tokens offer for redemption.   Decentralized: Unlike competing tokens, CACHE limits its role to exchanging physical gold for tokens and vice versa. Liquidity, vaulting and exchange are left to industry leading vaults and liquidity providers. This provides a number of benefits such as eliminating a single point of failure and creating a competitive market place for token holders to sell their redeemed gold or to obtain competitive shipping/fulfillment offers if they wish to take physical delivery.  CACHE is designed such that any reputable industry player (vaults, dealers, retailers, distributors, logistics companies, exchanges, etc.) can participate in and profit from CACHE Gold.   Flexibility: CACHE Gold is backed by pure grams of gold and its asset tracking system (GramChain) can support any type of gold, regardless of weight or purity, as long as it meets industry standards for investment grade gold. CACHE Gold is currently backed by 100 gram and 1 kilogram bars, but this may change over time as demand dictates.   Industry Experience: Unlike other gold backed tokens, CACHE Gold was founded, designed and developed by precious metals industry veterans.    Provide a brief history of the project.  CACHE Private Limited was incorporated in Singapore in August 2018 with the goal of designing and developing a regulated, transparent, freely tradable, fully redeemable gold token that can scale to millions of ounces (billions of dollars USD).  Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  Whitepaper: https://cache.gold/whitepaper GitHub: GitHub - cache-token/docs: CACHE Gold Smart Contract Documentation Etherscan: https://etherscan.io/token/0xf5238462e7235c7b62811567e63dd17d12c2eaa0 Smart Contract Address: 0xf5238462e7235c7b62811567e63dd17d12c2eaa0 Asset Explorer: https://explorer.cache.gold Technical Documentation: GitHub - cache-token/docs: CACHE Gold Smart Contract Documentation Home Page: https://cache.gold Redemption: Redeem Tokens - CACHE Gold  Link any available audits of the project. Both procedural and smart contract focused audits.  Smart Contract Audit: docs/CACHE_Gold_Audit_Zerotrust.pdf at master · cache-token/docs · GitHub  Link to any active communities relating to your project.  Twitter: https://twitter.com/cache_gold Linked-in: http://linkedin.com/company/cache-gold YouTube: CACHE Gold - YouTube Medium: CACHE Gold – Medium Telegram: Telegram: Contact @CACHEGold  How is the applying collateral type currently used?  Each CACHE Gold token is backed by one gram of pure investment grade gold. CACHE Gold is used to track the current spot price of gold and is redeemable on demand for physical gold bars or the equivalent value in USD.  See this video for more details on what CACHE Gold is used for.  Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in?  CACHE Private Limited holds the storage contracts for the underlying gold. CACHE Private Limited was incorporated in Singapore and is licensed and regulated by the Singapore Ministry of Law as a precious stones and precious metals dealer.  Where does exchange for the asset occur?  CACHE Gold is currently traded on centralized (e.g. Bittrex Global) and decentralized (e.g. Uniswap) digital asset exchanges.  Redemption orders can be submitted on CACHE’s website at Redeem Tokens - CACHE Gold.  (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review.  Yes we have. CACHE Gold is not a security, financial instrument or digital payment token, it is an asset backed token.  (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable.  CACHE Private Limited is a licensed precious stones and precious metals dealer by the Ministry of Law in Singapore and holds license number PS20190001508.  (Optional) List any possible oracle data sources for the proposed Collateral type.  The CACHE Explorer provides real-time data for the gold bars backing CACHE Gold. All tracking data is hashed and broadcasted to the Ethereum blockchain to prevent data tampering, manipulation or deletion. In terms of pricing data, any reliable and reputable oracle or feed for the spot price of gold is suitable.  We can also provide our own.  (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type.  If accepted, CACHE Private Limited (and perhaps some of its shareholders independently) would be interested and willing to provide significant additional collateral as well as to participate in liquidations. We are happy to answer any additional questions the community has. Thanks for reading. ",
                    "links": [
                        "https://brinks.com",
                        "https://www.loomis.us/",
                        "https://www.dillongage.com/",
                        "https://thesafehouse.sg",
                        "https://gramchain.net",
                        "https://cache.gold/physical-gold-standards",
                        "https://cache.gold/about",
                        "https://cache.gold/whitepaper",
                        "https://github.com/cache-token/docs",
                        "https://etherscan.io/token/0xf5238462e7235c7b62811567e63dd17d12c2eaa0",
                        "https://explorer.cache.gold",
                        "https://github.com/cache-token/docs",
                        "https://cache.gold",
                        "https://cache.gold/redeem",
                        "https://github.com/cache-token/docs/blob/master/CACHE_Gold_Audit_Zerotrust.pdf",
                        "https://twitter.com/cache_gold",
                        "http://linkedin.com/company/cache-gold",
                        "https://www.youtube.com/c/CACHEGold",
                        "https://medium.com/@cache.gold",
                        "https://t.me/CACHEGold",
                        "https://www.youtube.com/watch?v=3FuK6yytfSc",
                        "https://cache.gold/regulations-and-compliance",
                        "https://cache.gold/redeem",
                        "https://cache.gold/regulations-and-compliance",
                        "https://explorer.cache.gold",
                        "https://forum.makerdao.com/t/collateral-calls-calling-all-projects/3715/10",
                        "https://forum.makerdao.com/t/maker-relay-ep-15/4574",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/maker-relay-ep-14/4450",
                        "https://forum.makerdao.com/t/maker-relay-ep-13-pt-br-portugues/4328",
                        "https://forum.makerdao.com/t/maker-relay-ep-13-en-espanol/4313",
                        "https://forum.makerdao.com/t/relay-ep-14-en-espanol/4457",
                        "https://forum.makerdao.com/t/maker-relay-ep-15-en-espanol/4576",
                        "https://forum.makerdao.com/t/week-14-dai-distributions-sourcecred-trial/4044",
                        "https://forum.makerdao.com/t/maker-relay-ep-15-pt-br-portugues/4597",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/61",
                        "https://forum.makerdao.com/t/maker-relay-ep-13/4310"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Interoperability and Scaleability",
                        "Law and regulations",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75062292358804
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "3",
                    "time": "04/09/2020-14:06:17",
                    "content": "Hi @cache.gold and welcome to the community! It has been a busy week regarding real world assets so why not round it of with some gold tokens. This is a highly interesting application. I have some questions:  How is Cache Gold audited? From your Youtube videos it appears you can tokenize gold for other parties as long as the gold resides in certain vaults - is this correct? May I ask if you have a marketing plan of sorts for your product? Who is this aimed at? How is the 0.25% annual fee applied? It might be difficult to reduce tokens locked up in Maker Vaults.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.799603174603174
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#3",
                    "likes": "4",
                    "time": "04/09/2020-15:14:28",
                    "content": "Hi Planet_X, Thanks for your questions:  How is CACHE Gold audited?  CACHE Gold is designed to be “auditable”, in real-time, by anyone using publicly available data. CACHE Gold’s smart contracts do not allow tokens to be minted unless there is what we call “CACHE Locked Gold” in excess of the current number of tokens in circulation. When new gold is deposited, it is not CACHE but the vault operators that add the gold to the system using GramChain RFID scanners.  Once the gold has been scanned into the system, vault operators have verified the gold and CACHE has double checked the related documents and the GramChain data, the gold is “locked” and tokens can be minted.  CACHE has no ability to add gold to the system, only vault operators can do this and these are separate audited, insured entities that manage billions of dollars of precious metals holdings for other commercial clients as well. Similarly CACHE has no ability to remove gold from the system unless an equivalent number of tokens are removed from circulation and locked in CACHE’s smart contract in the CACHE Unbacked Treasury. Gold bars must be “unlocked” before vault operators are allowed to withdraw them, GramChain scanners and the smart contracts they interact with would not allow the vault operators to withdraw a locked bar.  Although it’s impossible to fully eliminate “trust” from a system that handles physical assets, we seek to minimize the trust requirement by clear separation and distribution of duties and by making it impossible for CACHE to mint tokens that are not backed by gold or to remove gold that is currently backing circulating tokens. Users are not just trusting CACHE or the vaults alone on the backing but that CACHE and the vault have verified the gold, its purity, its ownership (and lack of other encumbrances) and agree on the data before tokens can even be minted. A token audit takes about 1 minute for anyone with access to a web browser:   Get the number of CACHE Locked gold grams: 34,301.57 (as of 04-09-2020 ~14:46 UTC)   Get the number of unbacked tokens that are locked in the CACHE Unbacked Treasury: 0.0   Get the total number of CACHE Gold Tokens (“Total Supply” on Etherscan.io) ever minted: 34,301.57   Calculate CACHE Gold tokens in circulation:   Total Supply (34,301.57) - CACHE Unbacked Treasury (0.0) = 34,301.57 Are the tokens in circulation greater than or equal to CACHE Locked gold grams? If so CACHE has passed its token audit.  In this case: 34,301.57 CACHE Gold in Circulation <= 34,301.57 Toal CACHE Gold minted (“Total Supply”) Compare this to what happens when we try to perform a similar exercise on some other gold tokens. All of the vaults we use are independently audited and insured, The Safe House is audited by Bureau Veritas (quarterly) and EY (annually)., Loomis uses Deloitte, Brink’s uses Deloitte and Dillon Gage I will have to check on. Although third-party audits are a useful and valuable tool, they are merely a piece of paper signed by a trusted third-party that attests to the existence of the assets as of a given moment in time - there is no guarantee those assets were not moved or encumbered after the audit was completed. With GramChain asset tracking, we seek to increase transparency and reduce risk by providing more information than a typical audit would provide to the general public in very near real-time as of any moment in time.  From your Youtube videos it appears you can tokenize gold for other parties as long as the gold resides in certain vaults - is this correct?  Users that want to tokenize gold can deposit (or transfer it if it is already in the vault) to vaults that have testing facilities to verify the purity and provenance of the gold - currently this is Dillon Gage IDS and The Safe House.  May I ask if you have a marketing plan of sorts for your product? Who is this aimed at?  Like DAI, CGT has many markets and uses.  CGT provides a safe haven asset for cryptocurrency investors that prefer gold to fiat currency.  CGT is a more efficient (total fees are less than most typical ETFs), more portable, more transparent way to own gold than many other gold backed instruments that is convertible on demand.  CGT can help reduce the need for shipping gold. CGT could be used as a building block to create more transparent gold-backed investment vehicles that can always provide proof of their holdings in real-time. CGT can be used as real-world physical collateral to back defi products. CGT can be used to back a gold savings account that would allow retail investors to buy gold in smaller units than a single bar but still provide them with 100% gold backing and eventual physical redemption when they accumulate enough. There are undoubtedly many more use cases we haven’t even thought of yet.  We are actively working on many different avenues to market these various use cases.  One of the cases we are most excited about is integration with defi platforms such as MakerDAO. Defi lending is also very exciting, historically it would have been difficult or impossible for retail investors to save in gold and earn a yield on that gold, defi platforms now make that possible.  How is the 0.25% annual fee applied? It might be difficult to reduce tokens locked up in Maker Vaults.  The accrued storage fee is deducted upon each transfer.  However, if this breaks the Maker contract(s), we have a way to exempt storage fees. That said, the reason for the storage fee is that we feel it is critical for a gold-backed tokens that are to be 100% backed at all times, scalable and sustainable. Insured, audited storage of gold costs money. There is no way around this simple fact.  If a gold token has no mechanism for storage fees, then hoarding that token would effectively allow the token holder to own physical gold for free, while the token issuer would have no revenue with which to pay the ongoing storage costs. We feel this creates bad incentives and potentially an unsustainable project.  However, as long as there is some inflow and outflow to/from the Maker Vaults, transfer fees will cover the storage fees. We think that as asset backed tokens become more popular, this will be an issue the industry will have to face. It’s simply not possible to store physical assets in insured, secure warehouses or vaults for free. We believe there will probably be advances made in how storage fees can be tracked, collected and managed (particularly on defi platforms) and we would like to be a part of that ongoing development and discussion. We are committed to supporting and working with defi projects and are certain we can find a workable solution. Absent other solutions we can just exempt the relevant addresses from storage fees. A detailed explanation of fees can be found here: https://github.com/cache-token/docs/blob/master/FEES.md Please let us know if you have any more questions. Thanks. ",
                    "links": [
                        "https://gramchain.net",
                        "https://explorer.cache.gold/",
                        "https://etherscan.io/token/0xf5238462e7235c7b62811567e63dd17d12c2eaa0?a=0xD4033ea2eC53A26d6295f6f375D5C6afBe788660",
                        "http://Etherscan.io",
                        "https://cryptoresearch.report/crypto-research/discrepancies-identified-in-the-transparency-data-provided-by-pax-gold-and-tether-gold/",
                        "https://www.thesafehouse.sg/documents",
                        "https://www.loomis.com/sites/default/files/documents/202007241053-1_0.pdf",
                        "http://s21.q4cdn.com/938716807/files/doc_financials/2019/annual/Brink\\'s-2019-Annual-Report-on-Form-10-K-12312019.pdf",
                        "https://www.youtube.com/channel/UCZ671q5tE2NUReOFsaWPExQ",
                        "https://github.com/cache-token/docs/blob/master/FEES.md"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.595734848484849
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#4",
                    "likes": "2",
                    "time": "04/09/2020-17:42:08",
                    "content": "    cache.gold:  The accrued storage fee is deducted upon each transfer.   Have you considered applying an inflation rate instead of transfer fee? You could reduce the exchange rate of tokens to gold by 0.25% per year and get the some effect without a transfer fee. This breaks the 1:1 model of 1 token being worth a constant amount of gold, but it seems more fair to break the 1:1 exchange rate than the penalize transfers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#5",
                    "likes": "1",
                    "time": "05/09/2020-06:09:22",
                    "content": "Hi Joshua, While that would be possible, it would make the pricing very confusing and it would look as though the token doesn’t actually track the price of gold for anyone that didn’t carefully read all the documentation. The transfer fee is very small and helps to cover all the costs of running the system. It is not designed to penalize transfers, but rather to cover costs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/serrynaimo",
                    "index": "#6",
                    "likes": "2",
                    "time": "05/09/2020-09:12:20",
                    "content": "Hi @cache.gold, I’m a big fan of Gold as well as Bitcoin and I’m dying to create “hard money ratio” asset that trades between Bitcoin and Gold whenever certain ratios are reached. I’m trying to decide on a Gold token to do this with and there are many properties I like about Cache that the other tokens don’t have. My main question is, what are your plans to really grow your overall liquidity/markets so that I can always comfortably switch from say BTC or WBTC? (What are your growth plans?) Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.646825396825397
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#7",
                    "likes": "2",
                    "time": "05/09/2020-09:17:42",
                    "content": "    serrynaimo:  I’m trying to decide on a Gold token to do this with and there are many properties I like about Cache that the other tokens don’t have   Could you maybe provide more information/comparison about such properties vs other gold tokens. Which other tokens did you consider (i will assume PAXG is one of them). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#8",
                    "likes": "1",
                    "time": "05/09/2020-09:18:12",
                    "content": "@serrynaimo Glad to hear that. So far we have listed on Bittrex Global, Bithumb Global and Uniswap. We will be announcing new exchange listings shortly. We are also seeking to integrate CACHE Gold with as many DeFi platforms as possible. In addition to trading on exchanges you can always redeem CACHE Gold tokens for physical gold or USD with live 24/7 bids very close to the spot price of gold. ",
                    "links": [
                        "https://www.bithumb.pro/en-us/spot/trade?q=CGT-BTC",
                        "https://uniswap.info/token/0xf5238462e7235c7b62811567e63dd17d12c2eaa0",
                        "https://cache.gold/redeem"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.714876033057851
                },
                {
                    "author_link": "https://forum.makerdao.com/u/serrynaimo",
                    "index": "#9",
                    "likes": "3",
                    "time": "05/09/2020-10:00:42",
                    "content": "Hey @jernejml, sure. One thing I look for in a good stable coin is the liquidity of markets on both sides. Liquidity of the token and liquidity of the pegged asset. Cache claims to be build by industry veterans and at least from where I’m standing, it shows: The Gold side of things is very well designed. What I like:  CGT is the only coin I’ve found so far that is redeemable from as low as 100g and in multiple countries with a well explained and architected redemption process (See whitepaper) which should mean a vastly higher rate of physical Gold liquidity over time and hence much higher price certainty. I do hope they continue to build that infrastructure further. CGT has a storage fee. That seems somewhat counter intuitive of a feature, but if you’ve ever dealt with physical Gold, you know it’s not like a Dollar in a bank account that pays you for putting it there: Storing Gold costs money and insuring it costs money. Storing it safely and insuring it well costs more money. A coin that doesn’t charge for storage does NOT add to my comfort of there actually being Gold behind it. Trying to pay for storage and insurance with low transaction fees might back-fire at some scale and creating an incentive for the issuer to only maintain some Gold backing instead of 100% of the Gold backing. What Cache has done here just feels a lot more scalable and sustainable. The PAXG and XAUt Gold (and many other Gold token) lookup seems like a quickly thrown together prop compared to the Cache Explorer. At least from the looks it seems Cache has put a software stack all the way into the commercial vault providers’ processes. (Hope they can make that GramChain software open source, too, at some point! ;))  Now on the token side, things can still improve. Considering the current market cap of just over $2M, Cache has comparably deep liquidity in the markets they’re operating. It is still very small, so hence my question around the growth plans. @cache.gold if you can share more on that, please do  If you can keep the thoughtfulness and liquidity up while growing, it’s going to be a winner! Hope this helps! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.562825520833333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#10",
                    "likes": "2",
                    "time": "05/09/2020-10:35:19",
                    "content": "@serrynaimo Great answers. We will be adding more exchanges and more gold soon. We would be happy to speak with Maker DAO about providing additional liquidity specifically for Maker DAO and we are definitely willing to participate in liquidations. Gold token adoption looks like it will be a marathon rather than a sprint. As you may see if you analyze on chain data, the majority of the supply of all gold tokens is not very widely distributed yet.  We think one of the best initial use cases for CGT (and asset backed tokens in general) is as real, tangible, physical collateral on DeFi platforms. We hope to work with Maker DAO to make this a reality. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.881118881118881
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Egon2",
                    "index": "#11",
                    "likes": "1",
                    "time": "05/09/2020-12:17:00",
                    "content": "Hi why would I hold Cache instead of a synthetic token? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Egon2",
                    "index": "#12",
                    "likes": "0",
                    "time": "05/09/2020-12:17:42",
                    "content": "Synthetic gold that is ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#13",
                    "likes": "1",
                    "time": "05/09/2020-12:32:54",
                    "content": "Hi @Egon2, A synthetic token is not backed by physical gold and could not be redeemed for actual gold bars. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#14",
                    "likes": "4",
                    "time": "05/09/2020-13:17:54",
                    "content": "Well, I think it’s just a matter of time before somebody forces the issue by creating a wrapper that allows transfers without paying the transfer fee. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#15",
                    "likes": "1",
                    "time": "05/09/2020-13:24:17",
                    "content": "That’s why there are storage fees and why they are critical to have. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#16",
                    "likes": "3",
                    "time": "05/09/2020-14:02:08",
                    "content": "How can you collect storage fees if there are no transfers? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#17",
                    "likes": "5",
                    "time": "05/09/2020-14:09:10",
                    "content": "@psychonaut Normally the accrued storage fees are collected automatically on every transfer. However, if an address becomes inactive (doesn’t send any tokens or call the payStorageFee() function) and accrues significant storage fees, we can trigger the smart contract to collect the fees. This may feel a little bit like “taking your tokens” but those tokens would never have been spendable in the first place and would have been transferred to the fee address automatically whenever any transfer was made.  We cannot take more than the accrued fees, we cannot freeze or blacklist any address and we cannot confiscate tokens, we can only collect accrued fees. You can read more about how this works in detail here: https://github.com/cache-token/docs/blob/master/FEES.md This is a necessary feature, otherwise a large token holder could hold tokens without transferring them and deprive CACHE of the revenue it needs to pay the storage fees on the physical gold. We do not think asset-backed tokens that lack a mechanism to collect storage fees can be scalable and sustainable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916396103896105
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#18",
                    "likes": "4",
                    "time": "05/09/2020-16:24:18",
                    "content": "How would this apply to a Maker Vault? If Gold tokens that were backing DAI were removed by the CGT smart contract, that could trigger liquidation on the Vault. This would be less of an issue if this was called regularly, but if for example it was called on a long-standing vault and removed ~5% of the balance, this has the potential to trigger a liquidation. How is the payStorageFee function permissioned, and does it apply to a single holder, or does it charge fees on all existing balances? Can any address call this function and send the fees to the rightful destination. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.976190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#19",
                    "likes": "4",
                    "time": "05/09/2020-16:54:25",
                    "content": "That function is called by the token holder. We would never force collect fees on the Maker contract if it would break something. It could be setup to be automatically called regularly if necessary. However, the storage fee is only 0.25% annually so 5% would take 20 years to accrue. It isn’t like a credit card bill where it would accrue penalty interest if unpaid. There is another function to provide the balance of fees accrued - balanceOf() returns the balance net of accrued fees and balanceOfNoFees() returns the total balance. Fees are accrued in an entirely predictable way and there is never any ambiguity about what will be deducted. balanceOf() returns the balance net of fees so that the send all/send max feature in ERC-20 wallets won’t break. If fees break a contract we can exempt it if necessary and find another solution.  Generally as long as there are regular inflows and outflows transfer fees can cover the costs of the storage fees. We are happy to work with Maker to find the right solution. The only thing we need to avoid is the situation is where a significant proportion of the total CGT supply is locked in a contract and never moves so it pays no storage and no transfer fees. One way or another we think this will be an issue that needs to be solved not just for our particular token but any asset backed token that has to pay storage fees for a physical asset. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4639355742296924
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#20",
                    "likes": "1",
                    "time": "05/09/2020-18:27:21",
                    "content": "I kinda wonder if these storage fees would be better accrued by allowing the redeemability ratio to decrease slightly, then “rebasing” at the end of each month for example back to the 1:1 gold backing. This would then deduct the fees directly from all token holders continuously without tying the collection mechanism to transfers. The only downside is within the month you do diverge from 1:1 gold backing for by about .02%, but this is a tiny deviation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.361111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#21",
                    "likes": "3",
                    "time": "05/09/2020-18:48:01",
                    "content": "This unfortunately makes the whole system a lot more complicated, harder to audit and the pricing would no longer match the spot price. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#22",
                    "likes": "2",
                    "time": "05/09/2020-18:55:40",
                    "content": "Would automatically calling the payStorageFee function on a periodic basic (monthly, quarterly, yearly, whatever you think is correct) for all token holders be cost prohibitive in gas fees? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#23",
                    "likes": "3",
                    "time": "05/09/2020-19:32:42",
                    "content": "Extremely cost prohibitive.  It only makes sense to do it if a given address is dormant and has accrued significant fees. However, the balanceOf() function always shows the current balance net of storage fees. You could think of it as your balance as if you’d already paid the storage fees. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Egon2",
                    "index": "#24",
                    "likes": "4",
                    "time": "06/09/2020-02:58:53",
                    "content": "Are you also planning a Silver token and can it operate in the same way as CGT? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#25",
                    "likes": "4",
                    "time": "06/09/2020-07:20:17",
                    "content": "Hi @Egon2, Yes we do have plans for this, however right now we are focused on CACHE Gold. One thing to note, a silver token (at current market prices) would have quite high storage fees because silver takes up a lot of space as compared to an equivalent value of gold. Gold requires a higher security vault (more expensive) but it is still cheaper in terms of the percentage of value stored. We in fact founded CACHE Private Limited and developed GramChain asset tracking  with the plan to eventually tokenize many different physical assets, including other precious metals. ",
                    "links": [
                        "https://gramchain.net"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.571173469387754
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#26",
                    "likes": "3",
                    "time": "06/09/2020-15:03:13",
                    "content": "I would love to see a silver token, platinum, etc. Even industrial metals, although these all are probably even worse when it comes to storage fees. From talking with a representative from Paxos a bit, it seemed there were no plans for them to move past gold, and I have not seen any other organizations discussing other metal backed tokens. So, you could potentially have first mover advantage here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.892857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#27",
                    "likes": "2",
                    "time": "07/09/2020-08:06:40",
                    "content": "@Egon2 We are definitely planning to add more assets but we don’t have a firm timeline yet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#28",
                    "likes": "1",
                    "time": "07/09/2020-10:19:26",
                    "content": "Ampleforth has a nice way to have the quantity fluctuate that could be used to have management fees reducing the amount of token for everyone with only one parameter that can be updated every day or week. But in any case, I don’t think 0.25% per year on a volatile asset is really impactful. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#29",
                    "likes": "1",
                    "time": "07/09/2020-10:57:16",
                    "content": "That’s interesting but wouldn’t it still make pricing and redemption more confusing without a consistent value for the token? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#30",
                    "likes": "6",
                    "time": "07/09/2020-11:52:33",
                    "content": "I have read your contract more carefully, and in fact you are already doing something similar. balanceOf is already net of fees (fees since the last activity). So it’s always accurate (the contract use a daily precision) and taking the fees when token are retrieved from the vault don’t change anything. The number of tokens in a wallet decrease every day if I’m correct. The Ampleforth way is to have an internal balance and a global divisor (updated every day) that increase of 0.25% per year. balanceOf would be internal_balance / global_divisor. Maybe it would be more gas effective. In any case, Maker Vault should work just fine as I guess they depend on balanceOf. In any case, it’s a huge step forward compared to GLD (main gold ETN) that has fees of 0.40% and no explorer. Now with the ability to secure a vault with Maker? Just awesome. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.338541666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#31",
                    "likes": "1",
                    "time": "07/09/2020-12:54:19",
                    "content": "@SebVentures Thanks for your comments. Yes balanceOf() shows you the balance net of fees. The tokens don’t actually decrease unless you call the payStorageFee() function or make a transfer, however this shows you what your spendable balance is and it’s necessary so that the send all/max function on ERC-20 compatible wallets will work correctly.  If you ever need to know the blockchain balance we have balanceOfNoFees() to display that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jrharbor",
                    "index": "#32",
                    "likes": "2",
                    "time": "08/09/2020-07:30:12",
                    "content": "I really like CACHE. I think they have a superior system and integrity. In a world awash with financial uncertainty, CACHE looks to be the cream of the crop! Very transparent. Scalable. Fully backed by gold and very easy for owners to track and redeem their holdings. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.663333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#33",
                    "likes": "0",
                    "time": "08/09/2020-08:01:15",
                    "content": "No to all new assets until we fix the peg (+2.5%, Curve). Instead of commenting to this post, we could have been working on fixing the peg. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#34",
                    "likes": "3",
                    "time": "08/09/2020-10:33:38",
                    "content": "    bit:  No to all new assets until we fix the peg   This could be its own separate thread including a poll. Are you up for it? In the meantime we should try to stick to the topic (insert friendly pat on the shoulder) - in this case Cache.Gold. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.852272727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#35",
                    "likes": "0",
                    "time": "08/09/2020-11:38:56",
                    "content": "I think it’s not off the topic to be against adding CGT due to no benefit to DAI/MKR holders. Regarding the poll - I don’t see the point because everyone is against it. Assume that every interested party has 2 forum accounts and that we have 20 potential assets to be added - that’s 40 votes against my proposal. We don’t have that much reputable (“verified”) forum users that regularly vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#36",
                    "likes": "2",
                    "time": "08/09/2020-13:40:27",
                    "content": "I like the idea! Uploaded it to the makerdao reddit channel @cache.gold check it out! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#37",
                    "likes": "5",
                    "time": "08/09/2020-15:00:40",
                    "content": "have you considered that adding new collateral, particularly uncorrelated collateral, is a huge part of the solution to the peg? This certainly seems to be the consensus from community members. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.146645021645022
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#38",
                    "likes": "0",
                    "time": "08/09/2020-18:27:58",
                    "content": "    befitsandpiper:  have you considered that adding new collateral, particularly uncorrelated collateral, is a huge part of the solution to the peg?   Have you seen the impact of such policy to the peg ($1.024 today, Curve) for the last 6 months? Why expect a different outcome now? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5858585858585865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#39",
                    "likes": "4",
                    "time": "08/09/2020-18:49:02",
                    "content": "There has only been 1 uncorrelated collateral type added, usdc. And I think it’s fair to say that usdc has prevented the peg from being much worse ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/serrynaimo",
                    "index": "#40",
                    "likes": "2",
                    "time": "10/09/2020-15:39:48",
                    "content": "Without fully knowing all the details of pegging DAI: Gold since the year 1920 has gained on average about 4% per year in nominal USD terms or about 100x. In real terms it has gained 4x. The USD in that period lost about 99% of its purchasing power or 0.01x in real terms. A little bit of Gold can stabilise almost anything  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.078125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#41",
                    "likes": "4",
                    "time": "18/09/2020-14:34:59",
                    "content": "If added as collateral, CACHE Gold will pledge to mint DAI against a minimum of 10 KG of gold (10,000 CGT ~$630,000) and keep the contract open for at least 6 months. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Famorectos",
                    "index": "#42",
                    "likes": "1",
                    "time": "17/12/2021-21:13:07",
                    "content": "To say the truth, Cache plan is a brilliant and huge one. It’s very rare to see a platform that pairs crypto with gold and Cache is doing that. From some of their reply to people’s comment, I also noticed they are working tirelessly to get listed on as many DeFi platform as possible. This is a great move. I’m looking forward to seeing many people on your platform. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.492857142857144
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cache.gold",
                    "index": "#43",
                    "likes": "0",
                    "time": "21/12/2021-12:28:31",
                    "content": "@Famorectos thank you for your kind words. Now, more than a year later PAXG and XAUT have ballooned to new all time highs but have done little to nothing to increase transparency and reporting detail or to resolve the discrepancies that have been outstanding for more than one year.  Another project, Kinesis Money, now also claims substantial holdings but simply stopped doing audits in November 2020. ",
                    "links": [
                        "https://twitter.com/cache_gold/status/1462754861557202946?s=20",
                        "https://cryptoresearch.report/crypto-research/discrepancies-identified-in-the-transparency-data-provided-by-pax-gold-and-tether-gold/",
                        "https://twitter.com/cache_gold/status/1458109625727864843?s=20"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2805397727272725
                }
            ]
        }
    ],
    "group_index": "2665"
}