{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/a-balance-sheet-approach-to-executing-an-aggressive-growth-strategy-the-road-to-300m-revenues/14818",
            "title": "A Balance Sheet approach to executing an Aggressive Growth Strategy - The road to 300M revenues ",
            "index": 14818,
            "category": [
                "Core Units",
                "Strategic Finance"
            ],
            "tags": [
                "alm",
                "sf-001",
                "longform"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "21",
                    "time": "26/04/2022-16:25:34",
                    "content": " Roadmap to 300M revenues end of year: A Balance Sheet approach to executing an Aggressive Growth Strategy  All models are wrong, but some are useful  Summary Previously, we defined an Asset-Liability Management framework for MakerDAO and analyzed some assets in which MakerDAO could invest This paper shows the importance of balance sheet design to define the path towards 300M revenues and prioritization.  Our current balance sheet is slightly underinvested and leaving ca. 9-11M DAI in annual revenues on the table   We explore short-term bonds and ETH investment as those asset don’t depend on external factors Both would increase the MKR holder profitability but will be constrained by the Surplus Buffer size   Trying to model the Aggressive Growth Strategy, we learn that capital raise could be accretive and that scalable asset types are importants   Even with a significant growth plan (+2B crypto-backed loans, +300M RWA, +1B crypto D3M), it is not enough to deploy all our asset base if we can’t rely on scalable asset types (short-term bonds, ETH, …)   Assuming full deployment of our asset base (through the expected plan or with only short-term bonds), the capital raise (issuing MKR tokens) is accretive for MKR holders (i.e. increasing their earnings) Using a debt offering at 10% is accretive as well. Structure of the debt issuance is not discussed but assumed to be equity-like (which might not be the case)   Adopting a diversified and liquid balance sheet approach would lead to 300M revenues   This would give 304M annual revenues vs the current 76M  We conclude that having a high-level model is good to focus the protocol on what balance sheet it wants to target, and how  We should focus first on what mix of asset type are are targeting Then focus on starting with asset items that are scalable so we can allocate the balance sheet quickly in a focused way Then optimize the mix by adding non-scalable assets   image908×599 16.9 KB   Introduction Previously, we defined an Asset-Liability Management framework for MakerDAO and analyzed some assets in which MakerDAO could invest. This paper will provide an analysis of different scenarios to provide some inputs for MakerDAO Governance decisions. We will start by analyzing the current MakerDAO balance sheet, then providing ways to improve it without relying on external assumptions. Then we shift gears and move towards quantifying the proposed Aggressive Growth Strategy and proposing concrete targets. We will end with a top down balance sheet allocation based on some high level guidelines.  Methodology The methodology is mainly based on the Asset-Liability Management framework. We divide the MakerDAO balance sheet in homogenous categories and assign for each a return over asset (RoA, the expected return of the asset over a 1-year period) and Capital at Risk metric (CaR, not very different from Value at Risk) which represents a significant worst case loss that such asset can generate (which will be discussed for each asset). 1/CaR is the maximum leverage that is safe to be taken based on the existing equity part of the balance sheet (which will be defined narrowly as the Surplus Buffer) The Return over Equity, defined as RoA / CaR will provide the expected return of 1 DAI of equity. Assuming the Surplus Buffer is fixed, the goal is to optimize the RoE metric. Nevertheless, one should keep the following things in mind:  This model only optimizes solvency and not liquidity of the protocol. This will be taken in account while designing the balance sheet but isn’t the main consideration here; Not all asset types can be expanded/contracted. The only asset types that can fluctuate in size without constraint or significant work are stablecoins (PSMs), short-term bonds and buying crypto assets (like ETH); The model doesn’t take concentration risk in account. All things being equal, a diversified exposure might be preferable. Operating costs are not taken into account in this analysis.  For simplicity we will discard the impact of liabilities. Indeed, currently the DAI Saving Rate (DSR) is only 1bps which has no meaningful impact. This shouldn’t be taken as a given and as competition intensifies in the sector, we should expect an increasing need to bring the DSR back up again. In this light, higher RoA opportunities are better to prepare the protocol to face the need for a higher DSR. Indeed, in this analysis we use RoE = RoA / CaR but in practice we should consider RoE = (RoA - DSR) / CaR. Hence, while a low RoA (e.g. 0.5%) but very low CaR could provide a high RoE, it would not be the case if the DSR is enabled (if RoA is below DSR, the RoE is negative). The following table lists all asset types under consideration for this study. We are adding a liquidity metric which represents the expected relative ease of an investment (from 1 to 10, the higher the more liquid) to meet a sudden liquidity need.   Stablecoins Stablecoins represents the PSM that MakerDAO currently uses (USDC, USDP and GUSD). Capital at Risk is set to 0% as the main risk is a tail one (i.e. blacklisting, smart-contract bugs). There is no Return over Asset expected. While the idea to ask for profit sharing from those stablecoin issuers was floated, nothing seems concrete currently. Therefore, Return over Equity is 0%. Liquidity is intrablock as all the exposure can be used for peg support within a block. This asset type is fully scalable.  ETH In Toward asset risk, we showed that investing in ETH could be of significant strategic value. The CaR used here is 94%. This might be viewed as quite conservative but it is up to the community to voice a disagreement (using post-2018 history or the change in nature of ETH with the institutions coming or the merger). RoA is set at 100% which again is welcome to be contested by the community. The current assumptions provide a 106% RoE. Liquidity is given at 4 as while it might be easy to sell ETH on the market, it is unclear if it would be wise while ETH is down significantly from the buy price. This asset type is fully scalable (at least for a few billions).  Short-term bonds Short-term bonds are off-chain investments in public markets remaining under the control of MakerDAO governance. MakerDAO provided a declaration of intent on the topic. The CaR is taken from the last assets study while the RoA was updated with the recent yield to maturity (YTM) of one treasury and one corporate ETF (50-50 mix). Those are SHY for treasuries with a 2.62% YTM and a 1.86 effective duration, and SLQD for corporates with a 3.39% YTM and a 2.34 duration. This leads to a 3.01% RoA, a 3.40% VaR and, therefore, a 89% RoE. It should be mentioned that structure costs are not taken in account here (neither for the RWA benchmark). They could be between 10-50bps and remain to be defined. Short-term bond liquidity can be easily achieved within a week beside some specific market-related issues. Furthermore, they shield protocol revenues from pure crypto-related market risk and volatility.The governance part being less clear for now as Signal Requests are quite slow. It should also be noted that transaction fees can be quite significant. Therefore, while short-term bonds are quite liquid, they can’t be the first line of defense. This asset type is fully scalable.  Crypto-backed loans Crypto-backed loans are the current bread and butter of MakerDAO with vault facilities like ETH-A, WBTC-A and so on. The CaR is coming from Risk CU with a simpler version of their published CaR which is using a 1.7% VaR. This shouldn’t be interpreted as a definitive measure as it depends on many external inputs like market liquidity. Nevertheless, it is a reasonable assumption for now.  1200×600 34.5 KB  RoA is the weighted average Stability Fees, i.e. 2.24% currently. Liquidity is good as increasing fees will remove much of the demand quickly. Yet, it is unwise commercially to increase SF quickly. Therefore, it is not expected to be a first line of defense of the peg and shouldn’t be used in normal times. Crypto-backed loans are driven by borrower demand. It was illustrated in the past that elasticity of the product is quite limited regarding Stability Fees (SF). We can reduce the borrower demand by increasing SF but hardly generate demand even with SF quite below competition. There is a limited demand for DeFi crypto-backed lending. Nevertheless, the space is evolving with the introduction of Institutional Vaults and the introduction of TradFi bank through tri-party repo. It is unclear where we are headed. Moreover, it is not impossible that the space will be anchored on SOFR rates plus a crypto premium at some point. SOFR is currently around 30bps, significantly lower than DeFi rates. It should be noted that Liquidity Position-backed loans are not taken in account at all in this analysis… Most of the exposure is on DAI-USDC Gelato LP which are more an alternative to the PSM than anything else (SF are 0-5bps).  DeFi Money Markets DeFi Money Markets are defined as liquid and riskless onchain investments of DAI. Aave and Compound D3M fall into this category (only Aave being live currently). CaR could be derived from the Gauntlet Aave risk dashboard. The risk on DAI is currently $0 which would lead to a CaR of 0%. While liquidations are safer at Aave (lack of OSM delay), it is still unconstructive to favor Aave over MakerDAO crypto loans. Moreover, using Aave is exposing MakerDAO to external risks. Therefore, a made up 2% CaR is used in this analysis. It is slightly higher than our own vault as it is an external protocol even if the lack of OSM delay makes them possibly safer. It doesn’t impact the analysis too much. RoA is taken with the Aave rewards which stands at 2.57% as of writing. The resulting RoE is 129%. Liquidity of DeFi Money Markets is quite high as all the exposure is accessible within a block (with the exception of specific conditions). Yet, it can’t be used for liquidity directly as it needs a governance vote (which will take a few days). The D3M should probably be updated to reduce exposure when liquidity inside the PSM is below a given threshold. This would probably allow liquidity within an hour. DeFi Money Markets are not scalable and depend on the needs of borrowers. The possible end of liquidity mining might decrease their usage.  RWA Real-World Assets are defined as illiquid loans given to real-world businesses. They can be formalized on-chain with an ERC20 or off chain. They are currently quite heterogeneous in type, underlying, stability fees (3->7%) and risk. The CaR is currently set at 5%. The suggested RoA, 4.79%. This 4.79% is decomposed with 3.39% which is the SLQD ETF (short-term corporate bonds) yield to maturity (2.34 effective duration) and a 140bps illiquidity premium taken from diverse sources (1, 2, 3). RWF will have the latitude to provide more meaningful numbers. Nevertheless, the outcome RoE is 96% which is a bit higher than short-term bonds showing the value of pursuing RWA. Being above short-term bonds is quite important because otherwise there would be no reason to invest in RWA. There are also other benefits of RWA like the Clean Money initiative which are not accounted for in this model. RWA are by design quite illiquid, and while selling the underlying is possible for some RWA, it is not clear yet on how it will be done and at which cost. On scalability, there is plenty of RWA in the real-world, yet each onboarding is currently taking quite some time and is tailored to each borrower. When we model the balance sheet with the current exposure, we will use 3.5% as RoA as it is the current number. The following balance sheet data can be found in this spreadsheet.  1. The current balance sheet is slightly underinvested and leaving 8-10M DAI in revenue on the table We will start by modeling the current balance sheet. As you can see, the main exposure (62%) is currently stablecoins which don’t need capital nor bring revenues. The next item is crypto-backed loans that are bringing 90% of revenues while being only 35% of the exposure and 88% of the needed capital. DeFi Money Markets are far behind as well as RWA.  772×319 14 KB  Using the current methodology, the CaR is 59M currently while we have a 69M Surplus Buffer. This is below, but not far, from the actual Surplus Buffer. Crypto-loans demand fluctuates over time, therefore having an unused buffer is not dramatic. Moreover, the model is not perfect either, therefore having additional safety is good. Nevertheless, we will suggest two scenarios, keeping the same Surplus Buffer but optimizing it at 100%. Both don’t rely on external demand.  1a. Optimize current activity by investing excess capital in short-term bonds We will now model what would happen if we invest the excess capital (i.e. current Surplus Buffer - Capital at Risk of the previous model) in short-term bonds. As shown below, it would allow a 373M DAI investment in short-term bonds. This investment would provide 9M DAI of additional revenues, push the RoE to 122% and Price to Sales to 5.3%.  779×417 14.8 KB   1b. Optimize current activity by investing excess capital in ETH Another scenario that we can explore is to allocate the current excess Surplus Buffer to investing in ETH. ETH is quite intensive in equity, therefore we would be able to invest only 13M in ETH to keep the CaR within the current Surplus Buffer. Yet, as the RoA is quite big, it would lead to a 11M DAI increase in annual revenues. The reader should keep in mind that the ETH RoA will be quite volatile compared to short-term bonds.  780×419 14.6 KB  Overall, it would lead to an RoE increase to 126% and a price to sale of 5.4%.  What asset mix is optimal for investing excess capital? As we have seen the impact of investing the excess capital into short-term bonds and ETH, it is time to have a discussion of which is best. If we start by looking at the stablecoin exposure, we can see that both solutions are keeping quite a large exposure in stablecoin (58% for short-term bonds and 61% for ETH). There is a strong advantage on liquidity for short-term bonds but it isn’t that important in such a case. The return profile of ETH and short-term bonds is different. While it is predictable with short-term bonds, ETH is by construction more speculative and volatile. Some of that can be improved by using stETH or an ETH-DAI LP investment, but it would still be quite volatile and unpredictable. We have a preference for a mixed allocation of short-term bonds and ETH. As with all strategic choices in the DAO, the final mix would be up to community preference. Different mixes are all possible and would all represent a substantial improvement on current asset productivity.  2. Trying to model the Aggressive Growth Strategy, we learn that capital raise could be accretive and scalable asset types are the key to success A proposal was made to raise capital and debt to finance growth for MakerDAO but left open the question of how much growth to finance and what amount to raise to achieve it. The proposal suggests increasing exposure with three levers:  Institutional Vaults: Those are tailored crypto vaults (ETH, WBTC) for institutions. We will categorize those in Crypto-backed loans. RWA Multi-chain expansion: This is about deploying Maker MCD on L2 or other L1 and/or providing D3M style liquidity to crypto-lending platforms. We will put this initiative under crypto-backed loans in our model.  We will assume that the Growth scenario is applied for the end of 2022. We keep the balance sheet size constant (as an approximation of keeping the DAI outstanding constant). One could challenge this assumption but it feels the safest to start with. Indeed, DAI demand can increase, some significant liquidity farming like 3pool on Curve or Aave on Avalanche can end. We will start by using the following hypothesis to model  Increase of 2B DAI in crypto-backed loans through Institutional Vaults and L2 MCD deployments Increase of 1B DAI in DeFi Money Markets with new D3M for Compound, Fuse and others Increase of 300M DAI in RWA Keeping a 15% buffer in stablecoins The remaining is invested in short-term bonds. The gap between the current surplus buffer and the Capital at Risk of this allocation is raised on the market at the current MKR price.   784×465 19 KB  As we can see in the table above, such an increase in risky exposure will push the required Surplus Buffer to 157M DAI, meaning 87M DAI to be raised. If we raised it 100% in equity, it would cost the protocol around 48k MKR (assuming the price stays the same) which corresponds to a 5.4% dilution for current MKR holders. Meeting these targets would increase revenues to 187M DAI annually. This represents a Sales to Price of 11%, where previous scenarios only achieved up to 5.4%. The Return over Equity is down to 119% which is decreasing as we rely less on high RoE crypto-backed loans. The apparent divergence between Sales to Price and RoE is due to the fact that the Price to Book (MKR Market cap / Surplus Buffer) is around 23x making additional equity quite cheap in this model. Another way to look at it is that the MakerDAO equity yields 119% (RoE, again without operating cost in this analysis), yet investors are assigning such a premium over equity that they are buying those revenues at a 11.6% capitalization rate. From a liquidity perspective, the highly liquid exposure (Stablecoin, DeFi Money Markets and Short-term bonds) would be below the 50% threshold (39%). While this is still a good liquid position, it is something to be discussed. This capital raise could also be done with debt (in part or in full). The next table illustrates the same scenario as the previous one but with raising debt at 10% instead of issuing MKR tokens. We have updated the RoE, Sales to Price and P/S to make use of the cost of the debt (17M DAI annually).  778×463 18.8 KB  The RoE is obviously lower than before as we add the cost of debt. Yet, the Sales to Price (and the inverse P/S) is higher than before. Raising debt instead of equity is beneficial (financial leverage). Assuming significant growth going forward, the cost of debt (as ratio of all revenues) will become less important while the MKR dilution would remain the same. This is another positive for debt. Yet, it is unclear at this stage how debt could provide the same guarantees to DAI holder safety as equity. Same goes for the rate the market will command. The community’s view should prevail here over the ideal financing mix.  2a. Extending exposure to short-term bonds is favorable even under a no-growth scenario A worst case modelization below shows a scenario where the only thing we achieve is investing in short term bonds and essentially limit ourselves to investing our excess float for our current debt capacity. Short-term bonds don’t depend on external factors and can be scaled almost limitlessly relative to the size of our balance sheet. Failure to even implement that would obviously show that the capital raise (equity or debt) would be destroying value for MKR holders. As you can see in the table below, that would lead to a 2.8B exposure in short-term bonds. The newly raised capital would still be fully used. It would even still need more capital to be able to decrease Stablecoin exposure to the targeted 15% (it leave 29% in Stablecoins)  783×398 18.2 KB  It is interesting to note that, even in this case, the capital raise would be favorable for current MKR holders (Sales to Price of 9.6%). 53% of the revenues would come from short-term bonds which is probably not ideal as nothing prevents the rates from going down to 0% again in the future (but that would give us more than a year to find a solution).  2b. Adding ETH to the mix is even more favorable The last model we will study is starting from a successful aggressive growth strategy and adding a 100M DAI ETH investment. Therefore the following hypothesis to model will use the following assumptions:  Increase of 2B DAI in crypto-backed loans through Institutional Vaults and L2 MCD deployments Increase of 1B DAI in DeFi Monet Markets with new D3M for Compound, Fuse and others Increase of 300M DAI in RWA Investing 100M DAI in ETH Keeping a 15% buffer in stablecoins The remaining is invested in short-term bonds. The gap between the current surplus buffer and the Capital at Risk of this allocation is raised on the market at the current MKR price.   776×485 20.2 KB  As you can see in the table above, adding 100M DAI worth of ETH is increasing the capital raise by 91M. An interesting feature of this targeted balance sheet is that no single line of asset type is above 50% in terms of revenues or above 50% of CaR. Nevertheless, the amount of liquid assets, Stablecoin, DeFi Money Market and Short-term bonds, while still good, is again below 50% (38%). In the table below, we perform an impact analysis of some environmental changes. We are analyzing 3 environmental factors:  an increase/(decrease) of the ETH price by 10%. This is impacting only ETH investment; an increase/(decrease) of the DeFi rates (SF for MakerDAO and supply rate for DeFi Money Markets) by 50bps; an increase/(decrease) of the TradFi rates (impacting short-term bonds and RWA) by 50bps.  Some are impacting future expected revenues (DeFi and TradFi rates) while the ETH price fluctuation is impacting directly the balance sheet (one can argue that a 10% fluctuation affects the expected future return of ETH but that would be quite hard to model). We are not impacting the interest rate risk on the Surplus Buffer as it would be far lower than revenues.   3. Further optimization of the balance sheet by diversifying more broadly and strong liquidity In this section, we will target a balanced balance sheet allocation between factors (ETH price, DeFi rates and TradFi rates).  50% allocated to liquid items (Stablecoins, DeFi Money Markets and Short-term bonds) Diversified revenues sources between ETH price (29%), TradFi (37%) and DeFi (34%)   776×459 19.7 KB . As you can see in the table below, the impact of macro environment changes are more balanced with this scenario.  Such a scenario would require a 214M DAI capital increase which is more than the previous scenario, a better diversification and higher expected revenues. The RoE is still at 107%. Sales to Price is increasing to 16.6%.  Conclusion As we have seen, modeling a targeted balance sheet can provide significant insight. It allows us to focus on the global outcome for MakerDAO instead of being narrowly focused on a specific project. At the end of the day, our goal is to maximize MKR token-holder value and protect DAI holders. Currently, most of the asset side of the balance sheet is uninvested (stored in stablecoins). Simultaneously, the Surplus Buffer is underutilized (from a CaR perspective) and too small (as its size doesn’t allow a complete investment of the balance sheet).  Next Steps  Refine the model with updated input from CUs (Risk, RWF) Define objectives of growth for each CU (Growth, PE, RWF) Define capital need to implement those growth targets safely (SF) Implement scalable asset types (short-term bonds and ETH) Raise capital (debt or equity depending on community wants) GROW TO 300M REVENUES  ",
                    "links": [
                        "https://forum.makerdao.com/t/towards-taking-asset-risks-a-primer/14265",
                        "https://forum.makerdao.com/t/alm-framework-for-makerdao/12994",
                        "https://forum.makerdao.com/t/towards-taking-asset-risks-a-primer/14265",
                        "https://forum.makerdao.com/t/alm-framework-for-makerdao/12994",
                        "https://forum.makerdao.com/t/towards-taking-asset-risks-a-primer/14265",
                        "https://forum.makerdao.com/t/mip13c3-sp12-declaration-of-intent-invest-in-short-term-bonds/13084",
                        "https://forum.makerdao.com/t/towards-taking-asset-risks-a-primer/14265",
                        "https://www.ishares.com/us/products/239452/",
                        "https://www.ishares.com/us/products/258098/",
                        "https://maker.blockanalitica.com/risk/",
                        "https://seekingalpha.com/news/3776615-goldman-sachs-explores-bitcoin-backed-loans-through-tri-party-repo-deals-coindesk",
                        "https://www.newyorkfed.org/markets/reference-rates/sofr",
                        "https://gov.gauntlet.network/aave",
                        "https://www.bvai.de/fileadmin/Themenschwerpunkte/Private_Debt/Statistiken_Marktperformancedaten/The_components_of_private_debt_performance.pdf",
                        "https://pembertonam.com/wp-content/uploads/2020/05/pemberton_perspectives_illiquidity_premium.pdf",
                        "https://www.hermes-investment.com/uki/wp-content/uploads/2019/12/bd004539-harnessing-the-illiquidity-premium-report.pdf",
                        "https://docs.google.com/spreadsheets/d/10oXk5a83wWw-idGyCWNJMW9uyaVEnEpuaB7iIbgLF_w/edit#gid=0",
                        "https://forum.makerdao.com/t/maker-growth-strategy-we-must-act-now/14501",
                        "https://forum.makerdao.com/t/a-north-star-dai-as-the-destination/14838",
                        "https://forum.makerdao.com/t/makerdao-alm-forecast/16881",
                        "https://forum.makerdao.com/t/una-estrella-del-norte-dai-como-un-destino-traduccion/16326",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-16-22-de-junio-del-2022/16204",
                        "https://forum.makerdao.com/t/endgame-plan-4-understanding-metadaos/15974/12",
                        "https://forum.makerdao.com/t/kickoff-governance-from-first-principles-building-a-resilient-decentralized-and-uncensorable-stablecoin/15978",
                        "https://forum.makerdao.com/t/discussion-capital-raise/15448/32",
                        "https://forum.makerdao.com/t/makerdao-long-term-growth-strategy-for-the-future-of-defi/15457",
                        "https://forum.makerdao.com/t/discussion-capital-raise/15448/15",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-12-18-2022/15280",
                        "https://forum.makerdao.com/t/relay-semanal-3-9-de-mayo-de-2022/15157",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-5-11-2022/15154",
                        "https://forum.makerdao.com/t/reporting-for-strategic-finance-core-unit-april-2022/15146",
                        "https://forum.makerdao.com/t/mip40c3-sp69-modify-core-unit-budget-strategic-finance-sf-001/15090",
                        "https://forum.makerdao.com/t/weekly-relay-may-3-9-2022/15084",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-5/15049",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-28-may-4-2022/14981",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-abril-02-de-mayo-de-2022/14970",
                        "https://forum.makerdao.com/t/weekly-relay-april-26-may-2-2022/14939",
                        "https://forum.makerdao.com/t/signal-request-deploy-the-balance-sheet-in-eth/14834/16",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-21-27-2022/14839",
                        "https://forum.makerdao.com/t/signal-request-deploy-the-balance-sheet-in-eth/14834"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.437518585956086
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "7",
                    "time": "26/04/2022-16:47:35",
                    "content": "I am a bit confused why there’s a push toward volatile ETH as well as LPs like ETH-Dai. In fact, if the team deployed this way recently, it could already result in $ millions in loss. Sure, there’s upside but then I feel like the SF CU is not looking at downside as much to give a fuller picture. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#3",
                    "likes": "1",
                    "time": "26/04/2022-16:48:41",
                    "content": "Just curious, is the 10% cost of debt a conservative estimate or something that has actually been explored? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#4",
                    "likes": "1",
                    "time": "26/04/2022-17:13:20",
                    "content": "What can be scaled up quickly and probably delivers the most output are the US bonds in terms of the amount that can be invested, flexible and attractive rates, but how are a concrete implementation, I mean it would only be realised via an organisation, do these revenues have to be taxed via the organisation before the income goes to the DAO, is there already experience with this, I think in principle we should act faster and, above all, safely. With rising interest rates and inflation, we are highly capital inefficient. We can do a lot with ETH, you don’t have to invest 100% of the planned amount directly, but over a short period of time DCA and then with the ETH stake it or LP etc. also partly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.014015151515152
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#5",
                    "likes": "3",
                    "time": "26/04/2022-18:43:30",
                    "content": "    Doo_StableLab:  I am a bit confused why there’s a push toward volatile ETH as well as LPs like ETH-Dai. In fact, if the team deployed this way recently, it could already result in $ millions in loss. Sure, there’s upside but then I feel like the SF CU is not looking at downside as much to give a fuller picture.   It shouldn’t be taken as a push, governance decide what it wants. If you look at the previous paper, it is exactly written about 94% drops. That’s not really avoiding to look at downside. Moreover, TribeDAO and Celo have pushed in this direction so it would be odd not to study it. You have a good point that we should do a signal request to get community/MKR feedback on that and know if it should be pursued or not. I will do that.     Traster_Tray:  Just curious, is the 10% cost of debt a conservative estimate or something that has actually been explored?   No market research was done on that front. In an earlier draft with other parameters (risk updated the formulas) the rate was important, on this one it is not. The bottom line is that even 10% is better than a capital raise. I feel truth will be between 5-12% but really depend (I would not consider locking DAI for a long period and take a capital risk for less than 10% personally). @makercaesar as you point, what can be scaled still demand more work both on the short-term bonds and ETH investing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.517857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#6",
                    "likes": "6",
                    "time": "26/04/2022-21:16:21",
                    "content": "So first, it’s great to have a model to think through investment targets and goals.  My opinion is that the numbers are constantly changing and there’s a lot of uncertainty in the capital at risk numbers so probably more important than optimization is making the processes around actually doing this efficient while still satisfying demands for transparency and decentralization. I think CaR for short term bonds is a little misleading since there’s basically no capital at risk if held to maturity and the values calculated are based on an annual basis.  I understand that the capital might be needed before maturity but as you stated, it wouldn’t be first line of defense.  And what about ultra short duration bonds if they start to become more attractive and we want to put even more capital in play? The other thing is that CaR from crypto backed loans should decrease to nothing as the markets mature and this is by far where CaR is allocated currently.  In reading risk’s methodology, I believe it all comes down to the probability of a sudden and severe drop in crypto prices.  This is just something that is extremely difficult to predict accurately. In terms of Eth, I think the uncertainty is even greater because of the volatility and it shouldn’t be discounted how volatility could affect community perceptions of mismanagement.  I think it’s safer to err on the conservative side here even if the RoE looks good.  Maybe a better way to frame Eth investments is that they are less investment and more large buffers to make future fees the protocol will need to pay in Eth more predictable. Anyway, those are the random thoughts I had in reading this.  But in general, great work and helpful for the community to understand how capital allocation decisions are being thought through.  Maybe one last question that’s not as immediate is just how often the numbers should be run and capital reallocated.  Or maybe a better course of action is to have theoretical allocation goals for each investment type and hopefully grow into the targets as the surplus increases and enables more capital to become available for investment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.066195436507936
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hasu",
                    "index": "#7",
                    "likes": "11",
                    "time": "27/04/2022-11:35:51",
                    "content": "Thanks for the great work which I think adds data-support to many of our existing intuitions about balance sheet design, revenue growth, and DAI holder protection. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#8",
                    "likes": "1",
                    "time": "27/04/2022-13:10:19",
                    "content": "This is a great post with a lot of good substance. I can tell much thought has been put into this and look forward to the growth that is coming! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.916666666666668
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#9",
                    "likes": "4",
                    "time": "27/04/2022-19:16:58",
                    "content": "    Traster_Tray:  And what about ultra short duration bonds if they start to become more attractive and we want to put even more capital in play?   That’s a very good point. The current yield curve is very steep in the first 2 years so currently it would be an hard sell (but will evolve end of the year). Having treasuries with duration (interest rate risk) and corporate without (only credit risk) should bring better diversification benefits. Being involved in many projects to onboard short-term bonds, I can tell fees are a real matter. Again without an actual structure and the costs associated, it would be an early optimization. You are also right that all that are just a framework, which is why the first line is all model are wrong but some are useful  For instance, before this analysis, I was thinking that a capital raise would be bad for results. Actually it is not. this is the case if, and only if, we are able to achieve investing the assets, which is why scalable assets are importants.     Traster_Tray:  The other thing is that CaR from crypto backed loans should decrease to nothing as the markets mature and this is by far where CaR is allocated currently.   Sadly RoA will decrease as well in my view. I refreshed the model on Monday with up to date numbers and a new Risk model for crypto-loans. previously, the diversified model (the last one) was way better than anything else. I think we should be robust and therefore diversified in term of external factors (factor impacts in the analysis). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.639521263050675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/eka",
                    "index": "#10",
                    "likes": "5",
                    "time": "27/04/2022-23:06:11",
                    "content": "Hello all - I’m a MKR holder, but this is my first post, so apologies if my format doesn’t follow appropriate norms and feel free to correct/guide me. I had a few questions/thoughts around the Short Term Bond approach: -Would the exposure come through ETFs? If that is the case I would note that there is no ‘hold to maturity’ option to eliminate CaR as the ETFs constantly roll holdings - you would be holding equity backed by a portfolio of bonds. I don’t think such an option was assumed in your analysis, but it was mentioned in the comments. -Similarly, corporate bonds still do have duration/interest rate risk, they just also have credit risk (and in theory an associated premium). -Perhaps this is a better question for the ‘Towards taking asset risks’ post, but since it is part of this analysis… Have you looked at total return (TR) for short term bonds (STB) in a rising-interest rate environment? I note that the TR analysis performed was from 1996-now, which was generally a period of falling rates. I wonder what a similar analysis of STB from 1970-1980 would yield. -Finally, how are you thinking about the use of current yield from STB? The TR analysis assumes yield is reinvested in the STB, which might be what is done. However, if you split the return streams up with current yield going to burn MKR, pay expenses, invest in growth, etc, then the principal (price of SHY/SLQD) may look more volatile on the balance sheet. I’m not sure I’m thinking about this one the right way, but wanted to bring it up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#11",
                    "likes": "6",
                    "time": "27/04/2022-23:08:30",
                    "content": "I am scratching my head here over how investing $1 DAI in ETH yields $1 DAI/yr of return. As to the rest of it.   I believe the returns are significantly aggressive and liquidity can become a real issue.   I think if you look at the PR optics on how much value appears ‘when’ for DAI holders as a result of an ES that their immediate claimable value is 20-40% (depending on the model) is probably going to be a significant turn off to DAI holders.   In such a circumstance the DAI value would immediately drop reflecting the drop in claimable value and the added long term component. One of the biggest points about Maker was that collateral backing DAI was there and is liquid.   I think this is one of the prime reasons @Risk-Core-Unit suggested when MakerDAO ‘do anything’ investment wise with the assets we are stewarding that we should be careful not to exceed certain thresholds. Not dealt with in this model is exactly is how the cash is coming back to Maker - both when the system is in normal operations (presumption there is DAI) where as if there is an ES my expectation is all this capital is going to come back ‘over time’ as USDC. The 2B DAI on L2 MCD is also overly ambitious as I suspect Maker is likely to have a few more hiccups than expected in managing these MCD deployments that will preclude massive growth there. Finally the 84M raise either from debt at 10% (seems excessive here), or by selling what 48K MKR (would be lucky to get that raise with 5.4% dilution - VCs are going to want a 10-20% premium backed in, and the markets just can’t handle that liquidity). The only assumption here is D3M which perhaps could handle the growth and if Maker were to move into USDC D3M management as well perhaps might be a better way to earn return, still have reasonable liquidity, and manage risk. Going to keep saying this - if one is going to invest in ETH - do it with Uni v2 ETHUSDC and/or ETH/DAI.   If the DAO would start thinking about the fact we have a huge gas budget here and how to manage the needs of that against an investment portfolio that earns return and can be used in the protocol as liquid collateral to borrow DAI - this would be a much more prudent strategy than just buying ETH.   These can even be modulated with some decently planned Uni v3 positions btw. My biggest issue with the above analysis is the whole 100% RoA on ETH justifying the 84M DAI raise either by borrowing or by selling MKR.   Unless I am missing something obvious, or there is some magical 100% ROI on ETH out there I need to know about, the analysis above doesn’t seem to be consistent.  I mean hell if the we could earn $1DAI for every $1 worth of ETH every year I’d be the first one to say why aren’t we plowing $10M from the SB into this instantly?   We’d get a $10M/yr boost on revenues… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.718177655677655
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#12",
                    "likes": "0",
                    "time": "28/04/2022-05:50:25",
                    "content": "Welcome @eka!     eka:  -Similarly, corporate bonds still do have duration/interest rate risk, they just also have credit risk (and in theory an associated premium).   Ah you are right, I didn’t catch that corporate bonds were part of the equation and thought only treasury bonds were being analyzed.  Yes, corporate bonds would have credit risk.     eka:  -Would the exposure come through ETFs? If that is the case I would note that there is no ‘hold to maturity’ option to eliminate CaR as the ETFs constantly roll holdings - you would be holding equity backed by a portfolio of bonds. I don’t think such an option was assumed in your analysis, but it was mentioned in the comments.   I am curious about your ETF question as well.  SHY and SLQD were mentioned explicitly as examples but I also don’t expect implementation details have been figured out.  Also agree that an ETF’s rolling holdings mean you’ll always have something that hasn’t matured.  But rising rates still only temporarily reduce present value of underlying holdings and if you are able to mostly hold the ETF, you should eventually get your value back once rates inevitably stop rising.  Anyway, it is interesting that if the exposure is large enough, it starts to turn us all into bond investors that are trying to read the macro environment.     eka:  -Perhaps this is a better question for the ‘Towards taking asset risks’ post, but since it is part of this analysis… Have you looked at total return (TR) for short term bonds (STB) in a rising-interest rate environment? I note that the TR analysis performed was from 1996-now, which was generally a period of falling rates. I wonder what a similar analysis of STB from 1970-1980 would yield.   1970-1980 was certainly a completely different environment.  I would think that for short term treasury bonds, the drag from rising interest rates made less impact on the total return than the actual rates themselves (which got quite high by 1980-1981). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.395442708333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/eka",
                    "index": "#13",
                    "likes": "3",
                    "time": "28/04/2022-20:29:49",
                    "content": "    Traster_Tray:  1970-1980 was certainly a completely different environment. I would think that for short term treasury bonds, the drag from rising interest rates made less impact on the total return than the actual rates themselves (which got quite high by 1980-1981).   Yes I agree the 70’s were a different environment, although there are a fair number of parallels. In particular the absolute rates and rate moves were much higher. But of course, on a percentage basis smaller interest rate moves can still be meaningful to price when the yields are already so low. I also agree that short-term bonds are less impacted than longer duration bonds by interest rate moves, ceteris paribus - this is generally captured in the effective duration of the bonds and is a good reason why balance sheet bond holdings should be short duration, not long duration. That being said, my point here is that a risk analysis on the total return for bonds that is based on a dataset/environment that was overall favorable to bond prices may give a skewed sense of risk, when in fact the chances of being in the opposite environment (rising rates) is growing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.607986111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rob",
                    "index": "#14",
                    "likes": "2",
                    "time": "28/04/2022-22:00:24",
                    "content": "    eka:  That being said, my point here is that a risk analysis on the total return for bonds that is based on a dataset/environment that was overall favorable to bond prices may give a skewed sense of risk, when in fact the chances of being in the opposite environment (rising rates) is growing.   Underappreciated quote of the whole thread ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#15",
                    "likes": "0",
                    "time": "29/04/2022-07:48:33",
                    "content": "    eka:  That being said, my point here is that a risk analysis on the total return for bonds that is based on a dataset/environment that was overall favorable to bond prices may give a skewed sense of risk, when in fact the chances of being in the opposite environment (rising rates) is growing.   I would say it’s a bad time now (numbers are derived with guarantee of being correct).  image1004×554 29.6 KB  It is not the time to optimize as currently it’s just a dream. I believe a sweet spot is with 2-yr treasuries to get a interest rate risk premium and very short-term corporates to get a credit risk premium. Same thing for ETF vs SMA vs anything else. Each asset class is on a total return basis. Each one will have associated cost (which are unclear for STB or RWA). Next, if RoA is accrued, spend on operations or to burn MKR doesn’t change much. @MakerMan Regarding ETH, it’s expected price appreciation that is obviously volatile. “RoA is set at 100% which again is welcome to be contested by the community.” The framework is simple and open so anyone can propose a different balance sheet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.220588235294118
                },
                {
                    "author_link": "https://forum.makerdao.com/u/josolnik",
                    "index": "#16",
                    "likes": "6",
                    "time": "29/04/2022-10:48:34",
                    "content": "To bring more context on the above chart of crypto-collateral Capital at Risk: as mentioned, the Surplus Buffer is currently higher than the crypto-collateral Capital at Risk. Meanwhile, this is taking into account the dominance of whales which were mostly already stress-tested through different market shocks (consequently, the model assumes they will most likely protect themselves from liquidations). This decreases the CaR and also the slope (1.7%), derived from recent protocol/ecosystem state when estimating marginal effect of Debt Ceiling on Capital at Risk. This is our minimum recommended Surplus Buffer size (56M at current 3.3B debt collateralized by volatile assets). Previously proposed 150M Surplus Buffer is a more conservative estimation of the necessary size and represents average CaR in Q4 2021, before the exposure decrease in Q1 2022 and January stress-test. This can be seen as a forward-looking benchmark against what kind of protocol/ecosystem state we can be protected against. Additionally, our research has shown that there are other factors that have a stronger impact on CaR than Debt Ceiling (ie. liquidity, estimated share of vaults protected). To provide an example, stronger retail adoption on L2s could significantly increase the above marginal slope given that they have historically shown to be less versed in protection against liquidation compared to institutional clients / whales. To summarize, balance sheet optimization brings more revenue, but this is done at the expense of additional existential risk. While from a risk perspective it makes more sense to build a significant Surplus Buffer for protection against significant market drawdowns, it’s up to the community to decide in which direction to move into on the revenue optimization/risk mitigation trade-off spectrum. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-restart-the-burn-v2/14918/8",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-april-2022/14979",
                        "https://forum.makerdao.com/t/signal-request-restart-the-burn-v2/14918/3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.949275362318841
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#17",
                    "likes": "1",
                    "time": "29/04/2022-18:38:04",
                    "content": "    josolnik:  To summarize, balance sheet optimization brings more revenue, but this is done at the expense of additional existential risk. While from a risk perspective it makes more sense to build a significant Surplus Buffer for protection against significant market drawdowns, it’s up to the community to decide in which direction to move into on the revenue optimization/risk mitigation trade-off spectrum.   This is true but put another way, as long as that catastrophic event doesn’t occur, using the balance sheet to generate revenue actually reduces existential risk and provides more opportunity for growth.  I think based on the vision presented here, the balance sheet should eventually be mostly used for RWA.  Maybe the real question is how quickly we think those endeavors and the necessary demand will ramp up.  If we simply have avenues to lend out Dai for short term bonds and we have the demand for increasing debt ceilings, I would then agree that the Surplus buffer could simply be seen as nothing more than a reserve.  Maybe you could even have a vault that lends out Dai to buy Eth and stake it.  As opposed to direct holdings, perhaps this is a more natural way for MKR to optimize the balance sheet? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.258771929824562
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RogueTortoise",
                    "index": "#18",
                    "likes": "3",
                    "time": "31/05/2022-14:02:16",
                    "content": "I am new to the forum and trying to catch up on everything, so forgive me if this is off base. Have you considered creating an in-house treasury/asset allocation team for the surplus buffer investments? Do you currently have a team like that or are people on other committees collaborating on investment ideas? Over time as this fund scales, it might be more cost effective and provide better results. Someone could be doing due diligence on individual investments and monitoring the macro risks. For example, bond ETFs do have interest rate risks that individual bonds could alleviate because redemptions from the fund and rebalancing of the fund could force sales of bonds under par as interest rates rise. For example, the referenced iShares treasury fund above appears to be down this year over 2% and is slightly above even the past 3 years. It could be worth exploring a bond ladder structure of individual bonds at different durations that are held to maturity so that principle isn’t lost as interest rates rise. There are also other ladder structures that could be done with ETFs grouped by maturity. If cash is needed, the investment professional can help decide at the time which investments are the best place to take funds from, considering factors like taxes and losses. If there’s a person managing this portfolio, they could also be looking at hedging strategies for risks to the surplus portfolio, Maker’s business model, or risks to the crypto-backed loan portfolio (inflation, duration, geopolitical, regulation, credit risk for small businesses in the crypto-backed loan portfolio etc). Having an in-house investment person or team also carries other benefits like having research talent for ad hoc projects and updating stakeholders on what’s going on in the markets and in the portfolio. There can be a formal investment policy committee that presents periodic performance, portfolio changes and market updates. Further thoughts, if there is an in-house investment team, other assets could be explored as well for the purposes of diversification. While I personally think ETH is a great investment and should be one of the investments, it’s kind of like investing your retirement funds in the company you work for. It concentrates risk. If your company struggles, then you have risks to both your employment and your retirement funds at the same time. If ETH performs well, Maker will perform well because it means the collateral will have more value in the vaults and the ecosystem is doing well. Bonds are a good diversifier/safe haven, but it’s possible bonds are at the top of a 30 year bond bubble caused by declining interest rates. Is there any appetite for diversifying the surplus fund into a mix of assets like bonds, crypto, stocks, and liquid real estate funds? Each of those could be diversified within by risk and geography so Maker is not too concentrated in any one asset or geography/regulatory region. If there is a cash need, the team could pick the best assets to liquidate at the time and also explore margin capabilities (depending on the custodian) if they want to stay long. Just throwing out a lot of brainstormed ideas in case they seem interesting. The big picture is that if you had an in-house team, they could dynamically invest the surplus fund based on the macro environment and the risks/goals/constraints of Maker. As the fund gets bigger, the in-house team becomes more cost effective rather than paying a constant % of AUM on ETFs, funds, or 3rd party managers (although a 3rd party manager could be an idea if in-house seems unappealing). I think if you’re going to have a big surplus fund with securities it should be managed like any other institutional fund. Thoughts, criticisms, reactions? Thanks for reading. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.700085966043414
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#19",
                    "likes": "1",
                    "time": "31/05/2022-14:25:36",
                    "content": "Interesting points, thank you for your comments! For what it’s worth, there is an open MIP to request the creation of a Special Purpose Fund: MIP55c3-SP4: Adding a Special Purpose Fund - Makershire Hathaway Really intrigued by some of your ideas, particularly if some of these financial instruments start to come on-chain and therefore easier to manage for a DAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.253720238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#20",
                    "likes": "2",
                    "time": "31/05/2022-15:44:41",
                    "content": "@RogueTortoise also, check out Maker Improvement Proposal 65 (MIP65) which will allow professional money managers like Baillie Gifford to invest in Gov Bonds. Although not “in-house” it’s an improvement over what was previously available. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#21",
                    "likes": "0",
                    "time": "01/06/2022-01:41:26",
                    "content": "    adcv:  if some of these financial instruments start to come on-chain and therefore easier to manage for a DAO   “Basically, if you’re a bank president or CEO, you purchase bank owned life insurance, BOLI, for certain employees to provide for them in their eventual retirement, earn a better return on Tier 1 assets, as well as to hedge against financial failure.” If Bacon Protocol can turn a lien on a house into an NFT, then MakerDAO should be able to turn a collateral assignment of life insurance into an NFT. In fact, core unit members should have a key man policy and generate equity-like returns for the DAO while hedging mortality risk. The amount of capital that can be absorbed by this collateral alone is nearly limitless and outsources all the dynamic hedging of options and duration risk onto the insurance company’s balance sheet which is where it should be.   insurancenewsnet.com    Indexed Life Sales Smash More Records During 4Q 2021, Wink Reports Non-variable universal life sales for the fourth quarter were $861.5 million, up 20% compared to the third quarter and 16.25% over 4Q 2021, according to Wink’s Sales & Market Report.      ",
                    "links": [
                        "https://insurancenewsnet.com/innarticle/indexed-life-sales-smash-more-records-during-4q-2021-wink-reports",
                        "https://insurancenewsnet.com/innarticle/indexed-life-sales-smash-more-records-during-4q-2021-wink-reports"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.642006802721089
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#22",
                    "likes": "0",
                    "time": "30/08/2022-01:41:43",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}