{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/words-from-the-wise-perhaps-you-should-slow-down-maker-community-youre-killin-em-softly/5485",
            "title": "[Words From The Wise] Perhaps You Should, Slow Down Maker Community -- You're Killin em' Softly ",
            "index": 5485,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "6",
                    "time": "04/12/2020-04:05:20",
                    "content": "In the words of Charlie Munger, investing requires a latticework of mental models. From the Farnam Street blog: In a famous speech in the 1990s, Charlie Munger summed up the approach to practical wisdom through understanding mental models by saying: “Well, the first rule is that you can’t really know anything if you just remember isolated facts and try and bang ’em back. If the facts don’t hang together on a latticework of theory, you don’t have them in a usable form. You’ve got to have models in your head. And you’ve got to array your experience both vicarious and direct on this latticework of models.\" From the wisdom of Charlie Munger–to “words of wisdom” from our Community Member Chris Mooney – who today preached to the community during the G&R call, dated December 3, 2020 about the need to be very careful. If you did not attend or were twiddling your thumbs during the meeting ( I space out like Walter Mitty all the time)  Here’s a quick breakdown:  Down 3 engineers on the Foundation side since our beloved Mariano left (adding 1 more engineer next week) We are definitely Bottleneck on our Technical Capabilities Need to revisit the priority on the MIP-6 collateral index  Maker is a cornerstone of DeFi—would be harmful if we cut corners. At the rate DeFi is moving (oh and Rug Pulls per day) very concern Maker should be focus on being a solid protocol/backstop Maybe we should pump the breaks? Bound to make a mistake. So true IMO. We are building a rocket ship with a “community” (that was priceless @brianmcmichael), hence it’s a difficult thing to do    Here’s the Vid of the segment where Mooney drops some def lyrics–a.k.a. words from the wise:     What do we make of this? What do we do as a community? Do we listen to the wise, or run like the wind? BTW–credit to @MakerMan for asking the tough uncomfortable questions. I guess now, it’s time to ask ourselves some tough questions… EDIT: 4/12/2020 or 12/4 if you’re a Yankee—misunderstood: Down 3 engineers TY @lollike for the correction ",
                    "links": [
                        "https://www.youtube.com/watch?v=gadMkrlm5dY",
                        "https://forum.makerdao.com/t/maker-relay-ep-26-en-espanol/5768",
                        "https://forum.makerdao.com/t/maker-relay-ep-26/5759",
                        "https://forum.makerdao.com/t/discussion-are-we-moving-too-fast-reevaluating-risk-in-anticipation-of-maker-foundation-hand-off/5748"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.576748971193416
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#2",
                    "likes": "3",
                    "time": "04/12/2020-05:28:34",
                    "content": "I guess looking at the same breakdown, I personally think it’s a sign to make the process more efficient and more resource allocated to move faster. If there’s a bottleneck, then it’s best to solve them sooner than later. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#4",
                    "likes": "2",
                    "time": "04/12/2020-09:55:36",
                    "content": "    flipflopflapdelegate:  Down to 3 engineers on the Foundation side since our beloved Mariano left (adding 1 more engineer next week)   I just deleted a message I wrote above, which can be summed up as:  “omg, only 3 engineers ? tha’ts crazy, let’s hurry up to fund some more, quickly!, with the DAI earned in surplus”.  Then I just re-read the title of this post. Thanks @flipflopflapdelegate. MakerDAO has grew so much in the last 6 months, >1billion DAI, etc, that it is sometime natural to keep pushing the accelerator. But the basis is still fragile/experimental, we need to keep this in mind. E.g., in the call of 03-Dec-2020, https://www.youtube.com/watch?v=gadMkrlm5dY @NikKunkel discusses how recently there was a complete outage in the Oracles communication protocol, fortunately without (known) consequences. This has been dealt with quickly by the few Engineers at the Foundation. But with the numbers being so low, we will not always be so luckly. YES. We probably need to slow down a bit and reinforce that base layer of MakerDAO, which is definitely technical and engineering-oriented. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.258101851851852
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#5",
                    "likes": "8",
                    "time": "04/12/2020-10:34:38",
                    "content": "focus is needed less ‘stuff’ but more ‘value’ the top 3 collateral types are 90% of the system:  ETH: 40% WBTC: 12% USDC: 38%  almost all of the remaining 10% is split across similies of the above, e.g. TUSD and PAX there is a natural desire to think more collateral types = more diversification = less risk but the data on daistats.com shows that unless an asset can back 50-100+ million DAI it’s not significant on the other hand, black thursday showed clearly that the current system can face an existential threat in under 24 hours of market volatility every new collateral added makes the black thursday problem worse because:  engineers have less time to work on shoring up known risks, e.g. stressed auctions, flash loans, etc. low-value (sub 50 million DAI at current scale) projects can all trigger a significant MKR minting event (anything over 1 million DAI) without contributing much to either revenue (more engineers) or the DAI peg complexity is a risk in and of itself, the goal of diversification is to introduce uncorrelated price action from liquid assets not to create a rube goldberg portfolio full of illiquid, correlated assets  if a billion dollar project that wants to be a 10 billion dollar project cannot maintain a technical team larger than 3-4x people, and cannot effectively derisk existing collateral while bringing on high value new collateral, then the only explanation i can come up with is lack of focus. with 4x FTE (40 hours per week) engineering = 160 hours per week = 640 hours a month if one engineer spends just half a day a month maintaining any given asset that’s 4/640 hours which is about 0.6% of the team’s time which is more than the current DAI % backed by any of:  LINK MANA ZRX KNC BAT COMP LRC BAL GUSD  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.55076871657754
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#6",
                    "likes": "7",
                    "time": "04/12/2020-10:49:06",
                    "content": "I just want to clarify that Chris Mooney said that they are down 3 engineers, not down to 3 engineers, and in this case he referred to smart contract engineers specifically. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.227513227513228
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#7",
                    "likes": "0",
                    "time": "04/12/2020-12:07:29",
                    "content": "thanks for the clarification! makes a huge difference  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#8",
                    "likes": "1",
                    "time": "04/12/2020-12:12:08",
                    "content": "I agree but, Concretely, after UNI, UNI-V2-ETH-X, UNI-V2-WBTC-X tokens and 2 or 3 more, there is not much high value tokens to add. I believe also once PSM is out, the pressure will go down as it will sort out the two main issues, at least temporarily. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.234259259259259
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#9",
                    "likes": "1",
                    "time": "04/12/2020-13:55:02",
                    "content": "Thanks for bringing this topic @flipflopflapdelegate it’s a bit odd to see Munger referenced in the crypto space without the “bitcoin is a worthless speculation” memes, but I am a big fan of looking at smart people and taking their wisdom while dropping their bias. In this case you have done just that, because we are trying to build a revolution here, and if we stumble that’s fine, but if we breakdown, or lose the trust of the community it’s all over. I agree we should be narrowing the scope a bit, as from my prospective there’s no way a risk management team of any size can properly access so many proposals when they are all interconnected and the passage of some will lead to more outsize risk on another. Perhaps a focus on our prioritization list could prove most helpful, allowing time and resources to be spent on doing the top priorities well while we try to draw in more community members to help with the work load of the rest of the list. Just my two cents. As to your post @iammeeoh I like the sentiment, but I’m a little confused where it means you think we should be headed. Portfolio theory suggests that the most efficient portfolio is a “market portfolio” where assets are held in direct relation to their size of the market capitalization, with “risk-less assets” being used to to push the curve toward the owner’s personal risk tolerance.  Obviously this would be hard to do on a lending platform, but I do think we should start looking into correlating our DC’s with the market share as to keep the system from taking on too much single asset risk. As it stands now, we are overexposed to ETH, which I assume is why so many new tokens are being pushed for collateral. However, I think simply lowering the SF on a couple of the other assets could accomplish the same thing and take way less work from the engineers. Is this the type of solution you think we should be pointing toward or are you suggesting that we need to come up with a better way to manage projects? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4669633527392145
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#10",
                    "likes": "3",
                    "time": "04/12/2020-15:07:31",
                    "content": "    prose11:  As to your post @iammeeoh I like the sentiment, but I’m a little confused where it means you think we should be headed.   If you are talking about my final line:     iammeeoh:  YES. We probably need to slow down a bit and reinforce that base layer of MakerDAO, which is definitely technical and engineering-oriented.   What I meant is that perhaps we should define the focus of 2021 more towards:  Moving away from the Foundation as much as possible, i.e., create Domain teams that are independent of the Foundation (so, for example, we know EXACTLY how many engineers/groups are working on something), and 100% under the scrutinity of the the DAO community Keep growing the community, rewarding contributors (in all domains/direcitons/fields) and community management tools. Soon we will reach the Dunbar’s number, and that will surely determine great complications. reach maturity until the DAO can really call itself ‘self-sustained’ for at least 6 months, without any help from the Foundation.  rather than simply trying to grow the number of DAI as fast as possible towards 10billions. Of course we can develop all the points above and also try to reach 10b DAI. But I see a risk in running too fast before having established solid foundaitons. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.327596618357488
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#11",
                    "likes": "1",
                    "time": "04/12/2020-15:10:07",
                    "content": "Gotcha and I totally agree on the perspective. Better to move safely than quickly IMO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#12",
                    "likes": "3",
                    "time": "04/12/2020-16:18:40",
                    "content": "Maybe looking at what YFI is doing would be instructive for MakerDAO. They have created symbiotic relationships with other protocols so as to eliminate redundancy and increase the amount of human capital under one shared vision. They knew that at the rate that they are iterating they would need smart contract auditors. Instead of focusing on raising funds over and over again to pay a third party, they decided to invest in yAcademy to onboard smart contract auditors which will pay off in the long term by auditing their contracts in-house and possibly generating revenue from auditing other protocols’ smart contracts. I think MakerDAO can likewise create synergies and increase the personnel that is helping build the protocol by aligning the interests of everyone involved. For example, B. Protocol and Yearn should be more closely tied to the fate of MakerDAO by creating a symbiotic partnership with whitelisted leveraged vaults and a dedicated pool of capital as a backstop for liquidations. It would benefit everyone. We should also be looking at protocols that can help scale the protocol using cross-chain interoperability like REN, PERP, RUNE, etc. I have had contact with the founder of CrescoFin who is equally interested in bringing RWAs to DeFi. He runs a regulated quasi-bank from Switzerland whose securities are listed on Bloomberg Terminal. It seems to me that someone with his expertise would be an invaluable partner in our effort to diversify the concentration risk of cryptocurrency assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.496753246753246
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "05/03/2021-22:18:42",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}