{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/b-protocol-en-espanol-y-para-dummies/8993",
            "title": "B. Protocol en Espa\\xc3\\xb1ol y para Dummies ",
            "index": 8993,
            "category": [
                "Latin America"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#1",
                    "likes": "6",
                    "time": "28/06/2021-14:28:43",
                    "content": "Gracias a Hippie4Crypto en twitter, que me dio permiso de publicarlo por aqui. B. Protocol (@bprotocoleth), hace poco lanzó su v2, y afirma complementar a MakerDAO y Compound ofreciéndonos participar de las ganancias de las liquidaciones. Dato de color, su fundador y CEO, es ex CTO de Kyber Network y fue co-diseñador de WBTC. Primero, ¿Cómo funcionan las liquidaciones? Si quisiéramos pedir un préstamo en MakerDAO, deberíamos depositar un colateral (x ej ETH), el cual quedará bloqueado y esto nos permitirá emitir $DAI. Por ej: Si depositamos 2000USD de ETH y pedimos 500USD, estaríamos al 50% de nuestra deuda máxima (debt max= el 50% del valor de nuestro ETH), ¿y si excedemos nuestra deuda máxima? El colateral Se liquida, ahí en donde entra B Protocol como liquidador, ¡y con ello obtiene ganancias, las cuales nosotros como usuarios vamos a recibir un porcentaje! ¿Si tengo posiciones en Maker/Compound, tengo que desarmarlas para migrar? No, con un click podes importar(y exportar, excepto Compound) tus tenencias de MKR / Comp.  image875×470 57.7 KB  ¿Que son los mScore y cScore? Los mScore (MKR) y cScore (COMP) son puntos que se obtienen con el uso de a B Protocol (depósitos/préstamos) y mientras más tengamos, más ganancias recibiremos de las liquidaciones. ¿B Protocol tiene token? Sí, $BPRO actúa de gobernanza, el cuál se distribuirá a sus usuarios durante 3 meses (termina a fines de Julio, pero en el discord -link al final del post- se debatirá como continuar con el programa de minado) ¿Y la seguridad? auditados por Solidified (links audit en la web, sector FAQ) Sus Smart Contracts están ",
                    "links": [
                        "https://twitter.com/bprotocoleth",
                        "https://twitter.com/search?q=%24DAI&src=cashtag_click",
                        "https://twitter.com/search?q=%24BPRO&src=cashtag_click"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/06/2021-15:23:44",
                    "content": "Excelente esta muy bien explicado, me intereso demasiado cuando pueda ingreso allí jeje por los beneficios, pero hay que hacer un depósito en vault de la plataforma para recibir a juro los beneficios?? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sebix",
                    "index": "#3",
                    "likes": "0",
                    "time": "28/06/2021-18:23:19",
                    "content": "Buenísimo. Mil gracias. Apenas tenga un segundito lo voy a ver bien. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "0",
                    "time": "28/06/2021-19:00:44",
                    "content": "Por su puesto ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#5",
                    "likes": "1",
                    "time": "28/06/2021-19:00:53",
                    "content": "Excelente broder! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}