{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/why-do-you-think-dai-is-one-or-the-most-important-stablecoin-in-the-defi-arena/7331",
            "title": "Why do you think DAI is one or the most important stablecoin in the DEFI arena? ",
            "index": 7331,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "latin-america"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#1",
                    "likes": "1",
                    "time": "05/04/2021-20:05:48",
                    "content": "More than once I see DAI being among the first coins to be integrated into different DEFI protocols, be it Ethereum, sidechains or even Proprietary Networks like AVAX and BSC. Then my question arises, what do you think is the interest of supporting DAI by those protocols. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#2",
                    "likes": "3",
                    "time": "06/04/2021-04:21:54",
                    "content": "There are lots of stablecoins out there and they broadly fall into two categories   Centrally backed: These are always redeemable for $1 from their parent company. Good for some uses, always on peg but you must trust the parent company (Coinbase, Tether, etc.) to not play foul.   Decentralized: In this case, you don’t need to trust anyone except the open source smart contract and the design of the stablecoin. The biggest issue with this type of stablecoin is that they struggle to maintain the peg of $1.   Some caveats aside (such as DAI’s excessive use of USDC collateral), DAI falls in category 2 but has proven that it more or less stays pegged to $1. This has worked through crypto bull markets, crypto bear markets, flash crashes and so on. So these protocols don’t support DAI out of the goodness of their hearts. They recognize that DAI is still the only reliable stablecoin that is not centrally controlled. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.481872294372295
                }
            ]
        }
    ]
}