{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/estado-de-dai-17-al-23-de-mayo-de-2022-traduccion/15349",
            "title": "Estado de DAI | 17 al 23 de Mayo de 2022 [Traducci\\xc3\\xb3n] ",
            "index": 15349,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "state-of-dai",
                "translate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#1",
                    "likes": "7",
                    "time": "24/05/2022-18:19:53",
                    "content": " image1727×624 42.7 KB  Hola a todos, gracias por visitar el Estado de DAI. Ahora separado del Relay Semanal con el objetivo de escalar y mejorar toda la información que necesitas para tus aventuras con DAI! Descargo: Ésta actualización está reunida por un grupo de miembros que contribuyen en la comunidad de MakerDAO. Ésto no sirve como asesoramiento financiero o para inducir a votar de una forma específica. Ésta actualización es meros propósitos de información y comunicación…  ¡Hey, tú! Sí tú. ¡Tenemos un par de preguntas! Encuesta muy breve de evaluación La versión pública del PDF está disponible aquí   El peg de DAI en los pares de ETH se han mantenido en calma ésta semana, en comparación con la carnicería del anterior Estado de DAI.   24 horas vs. 7 días tiene un amplio rango fuera del peg. El rango superior y el inferior principalmente provienen del arbitraje a través de  Uniswapv2 vs Sushi.   La reducción de los vaults causa a una leve caída del valor total bloqueado: 10.5 billones.   El PSM de USDC tuvo un leve envión por encima de los 3 billones.   Continúan las reducciones semanales de los vaults. Se estuvieron relajando principalmente desde ETH-A y WBTC-A.   Bajan los números de vaults, pero los préstamos semanales han superado a las quemas por primera semana en mucho tiempo. 120 millones netos de acuñación.  Visita Makerburn por un desglose al minuto de cambios, gastos y actualizaciones de Ilk.   Vaults de muy bajo riesgo donde se necesita una caída del 25% para desencadenar cascadas. El actual capital en riesgo de sólo 23 millones (al momento de escribir ésto). El promedio mensual de capital en riesgo ha sido de  43 millones.   Visualización de la hipotetica retracción al 25%  daistats.com | makerburn.com | maker.blockanalitica.com. Créditos: @twblack88  Ésta es una traducción libre del topic State of DAI | May 17 - 23, 2022 de @Artem_Gordon ",
                    "links": [
                        "https://pdfhost.io/v/TAR5TWFgy_State_of_DAI_May_17_23_2022",
                        "https://makerburn.com/#/rundown",
                        "http://daistats.com",
                        "http://makerburn.com",
                        "http://maker.blockanalitica.com",
                        "https://forum.makerdao.com/t/state-of-dai-may-17-23-2022/15345"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "3",
                    "time": "24/05/2022-20:32:55",
                    "content": "Muy gran aporte Marian, sin embargo, Maker de la mano del programa de embajadores, tiene un personal dispuesto para traducir este tipo de cosas. Aunque tus traducciones claramente son más rápidas se deberían pensar en ver como se te incluye en ellas. cc: @kat @Sebix @Joserjimz ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#3",
                    "likes": "3",
                    "time": "25/05/2022-04:03:51",
                    "content": "@Saludiego_201 me disculpo, realmente no sabía que estaba infringiendo alguna norma o regla del foro, simplemente me motivó realizar la traducción como un aporte a la comunidad LATAM e hispana, porque me pareció un topic super interesante. Te parece correcto que lo borre? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "4",
                    "time": "25/05/2022-04:11:30",
                    "content": "Ah mi para nada es muy buen aporte y la traducción más completa en cuanto a calidad, tiempo y velocidad. Creo que se puede confundir con la misión, visión y valores por el cual se creó la categoría de latam. Es un término ambiguo, pero las cosas de gobernanza, ejemplo, maker relay, state of day u demás en ese sentido corren a mano de los embajadores. Las demás propuestas y los MIPs si tengo entendido quedan a su disposición querida comunidad de entusiastas. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#5",
                    "likes": "2",
                    "time": "27/05/2022-01:18:40",
                    "content": "Creo que la gran mayoría de nosotros, me incluyo entre ellos, no teníamos muy en claro estas normas. Se agradece el señalamiento y aclaración de las mismas para poder seguir aportando a la comunidad latina acorde a la misión, visión y valores que persigue en su fundación esta categoría. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#6",
                    "likes": "3",
                    "time": "27/05/2022-01:28:32",
                    "content": "Estoy ideando algo para ustedes comunidad, lo trabajaré con @Joserjimz, esta iniciativa me abrio la idea algo interesante. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#7",
                    "likes": "2",
                    "time": "27/05/2022-03:08:07",
                    "content": "Buena noticia! Ansioso de ver que iniciativa están ideando, porque como verás, existe un grupo con mucho entusiasmo y ganas de activar para participar y colaborar con mucha mas intensidad. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#8",
                    "likes": "4",
                    "time": "27/05/2022-16:53:31",
                    "content": "Excelente Diego, si podemos colaborar de alguna forma en la generación o desarrollo de esta iniciativa nuestros DMs siempre están abiertos. Por lo pronto espero que esto sea el comienzo de una nueva etapa para el foro LATAM donde pueda ser mas dinámico y participativo, creo que es evidente que potencial y ganas sobran. Estaremos atentos a las novedades. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}