{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - WFIL (Wrapped Filecoin) - January 18, 2021",
            "index": "5480",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "30,413",
            "highest_fraction": 0.6
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/alsowfil-wrapped-filecoin-mip6-collateral-onboarding-application/5480",
            "title": "[alsoWFIL] Wrapped Filecoin MIP6 Collateral Onboarding Application ",
            "index": 5480,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/naszam",
                    "index": "#1",
                    "likes": "3",
                    "time": "04/12/2020-01:23:50",
                    "content": "1. Who is the interested party for this collateral application? wfil.network 1. Provide a brief high-level overview of the project, with a focus on the applying collateral token. Wrapped Filecoin (WFIL) is the First Filecoin Wrapped Token on Ethereum. WFIL is an ERC20 wrapper over Filecoin backed by Filecoin deposits on a custodian wallet (1:1 ratio). WFIL is implemented using OpenZeppelin ERC20 Library and controlled by a Factory contract, set as minter by a DAO multisig contract (Gnosis Safe), to allow merchants and custodians to add mint/burn requests via ad-hoc APIs that interact with OpenZeppelin Defender Relay. Merchants and Custodians are approved by DAO members via Multisignatures. WFIL Labs Team anticipates a low-risk analysis for the token that will be compliant for integrations with lending platforms such as MakerDAO, Compound and Aave and other services like Uniswap, Curve, Balancer, … 1. Provide a brief history of the project. Wrapped Filecoin (WFIL) was born during HackFS where the first prototype was released. Afther HackFS, WFIL was been selected for APOLLO by Gitcoin where it has been awarded for Best Protocol Bridge at the Apollo Hackathon by Textile and joined ETHOnline as well. Currenly, WFIL Labs is one of the companies in the Filecoin Launchpad Accelerator powered by Tachyon (ConsenSys). 1. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  815×746 53.7 KB  Portal GitHub WFIL DAO (Mainnet): 0x44443407e196298a0aD68207Aa93eA919df53961 WFIL Token (Mainnet): 0xd187C6C8C6aeE0F021F92cB02887A21D529e26cb WFIL Factory (Mainnet): 0x97A995E8b36A14C5586a19a99a282e9B53Ad890D 1. Link any available audits of the project. Both procedural and smart contract focused audits. WFIL Token Quantstamp Audit WFIL Factory Quantstamp Auidt The final audit report for the WFIL Token contract show a low risk:  well documented all tests executed successfully mitigation for Allowance Double-Spend Exploit via increaseAllowance and decreaseAllowance functions.  * An internal soft-audit has been conducted prior the external audit via Crytic CI (Trail of Bits) using Slither tool. 1. Link to any active communities relating to your project. Twitter Discord Telegram Substack Medium 1. How is the applying collateral type currently used? Currenly WFIL is used in the Merchant Demo App (Testnet) to show the wrap/unwrap process to onboard merchants and custodians and on Uniswap (Rinkeby) to allow users to play with the app by providing liquidity and swap on Uniswap. WFIL Labs is currently working with Textile to bring Ethereum Users the possibility to use WFIL to buy storage directly on Filecoin and use it to build DApps on Ethereum. 1. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? WFIL Labs Inc., a Delaware Corporation, USA. 1. Where does exchange for the asset occur? WFIL Labs is currently onboarding merchants and custodians to distribute the token, allowing the users to wrap/unwrap Filecoin, as well as launching its own merchant service. * The Token name (Wrapped Filecoin) and symbol (WFIL) was been first used during HackFS for the first release (v0.1.0) of the token prototype deployed on Kovan Ethereum Testnet (Jul-26-2020 12:52:28 PM +UTC) ",
                    "links": [
                        "https://github.com/naszam/wfil/releases/tag/v0.1.0",
                        "https://hack.ethglobal.co/showcase/wfil-recCwbCnY2rnipjcR",
                        "https://blog.textile.io/wfil-best-protoco-bridge-apollo/",
                        "https://hack.ethglobal.co/showcase/wrapped-filecoin-wfil-recHEoUa9GgSZWZ02",
                        "https://wfil.network",
                        "https://github.com/wfil",
                        "https://etherscan.io/address/0x44443407e196298a0aD68207Aa93eA919df53961#code",
                        "https://etherscan.io/address/0xd187C6C8C6aeE0F021F92cB02887A21D529e26cb#code",
                        "https://etherscan.io/address/0x97A995E8b36A14C5586a19a99a282e9B53Ad890D#code",
                        "https://github.com/wfil/wfil-token/blob/main/Quantstamp_Audit_Report.pdf",
                        "https://github.com/wfil/wfil-factory/blob/main/Quantstamp_Audit_Report.pdf",
                        "https://twitter.com/wrappedfil",
                        "https://discord.link/wfil",
                        "https://t.me/WrappedFIL",
                        "https://wfil.substack.com",
                        "https://medium.com/@wfil",
                        "https://app.wfil.network",
                        "https://www.youtube.com/watch?v=FYAZ798GkfA&feature=emb_logo",
                        "https://app.uniswap.org/#/swap",
                        "https://bistrot.wfil.network",
                        "https://kovan.etherscan.io/address/0x1962d20b37B9FBD4f2E2e4A250905157BcADeAC5#code",
                        "https://kovan.etherscan.io/tx/0x1eebae64650543ee582f18a5e40831c8835f606036a5ceffc45775c8ed40718b",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-19-b-protocol-wfil-network-tuesday-december-8th-19-00-utc/5503",
                        "https://forum.makerdao.com/t/maker-relay-ep-29-en-espanol/6220",
                        "https://forum.makerdao.com/t/collateral-calls-calling-all-projects/3715/21",
                        "https://forum.makerdao.com/t/weekly-mips-update-24/6052",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-19-b-protocol-tuesday-december-8th-19-00-utc/5503/9",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/weekly-mips-update-25/6092",
                        "https://forum.makerdao.com/t/maker-relay-ep-28/6118",
                        "https://forum.makerdao.com/t/maker-relay-ep-28-en-espanol/6124",
                        "https://forum.makerdao.com/t/alsowfil-wfil-dao-maker-community-representative-proposal/5651",
                        "https://forum.makerdao.com/t/maker-relay-ep-29/6214",
                        "https://forum.makerdao.com/t/weekly-mips-update-23/5914"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Interoperability and Scalability",
                        "Smart contract updates"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9061986863711
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MaxRoszko",
                    "index": "#2",
                    "likes": "3",
                    "time": "04/12/2020-10:49:35",
                    "content": "Hey thought I’d let you know that there is another wrapped Filecoin with the same ticker (WFIL), that has been out for a month already, by the wrapped.com team. So there will probably be some confusion with the tickers here. ",
                    "links": [
                        "http://wrapped.com"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "1",
                    "time": "04/12/2020-11:31:59",
                    "content": "Yeah, I’ll second this. I’m not sure you can say this is the first wrapped Filecoin token when another already exists and has claimed the ticker on mainnet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/naszam",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/12/2020-13:42:54",
                    "content": "I’d like to invite the community to open a discussion around the differences of the two solutions, focusing on the security and transparency of the implementation architecture with a particular focus on maintaining the peg to the backed crypto asset, in this case Filecoin and the risk level for the collateral onboarding into MakerDAO protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "3",
                    "time": "04/12/2020-16:01:19",
                    "content": "At this stage it’s not easy to discuss the two solutions because they have the same name. It’s just going to end in confusion and misunderstanding. I would strongly recommend that you resolve that issue before pursuing this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.361111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#6",
                    "likes": "1",
                    "time": "07/12/2020-16:47:36",
                    "content": "I have changed the ticker temporarily to avoid confusion. From my side, I would say that we need to see the token on mainnet and listed on multiple aggregator sites like https://www.coingecko.com/en before giving this asset the WFIL ticker and removing it from the other WFIL. Edit: The token is in fact already on mainnet. To clarify we would need to see a non-zero supply and for it to be recognised by other entities. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/naszam",
                    "index": "#7",
                    "likes": "0",
                    "time": "07/12/2020-17:06:11",
                    "content": "@LongForWisdom  The WFIL token is currently live on Mainnet: WFIL Token: 0xd187C6C8C6aeE0F021F92cB02887A21D529e26cb (as specified in the MIP6) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "0",
                    "time": "07/12/2020-17:08:44",
                    "content": "That’s fair, I should have been more specific. It’s on mainnet but it has zero supply and as far as I can tell no one else is currently referring to it as wFIL. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3
                },
                {
                    "author_link": "https://forum.makerdao.com/u/naszam",
                    "index": "#9",
                    "likes": "0",
                    "time": "07/12/2020-17:11:31",
                    "content": "@LongForWisdom   twitter.com    Filecoin (Filecoin)  Congratulations to the @WrappedFIL team on your Mainnet launch 🎉 Bridges from Filecoin to Ethereum will enable the next generation of storage and financial applications. twitter.com/NazzMass/statu…Nazzareno Massari | nazzareno.eth @NazzMassJust released @WrappedFIL $WFIL token contract @ethereum #Mainnet!!! 👨‍💻🤩🎉  #Blockchain #Ethereum #Eth2 #Filecoin #WrappedFIL #DeFi @Filecoin   https://t.co/ioJHf1Gp25  11:44 PM - 3 Dec 2020     32          4            ",
                    "links": [
                        "https://twitter.com/Filecoin/status/1334644694102532096",
                        "https://twitter.com/WrappedFIL",
                        "https://twitter.com/NazzMass/status/1334629204265197568",
                        "https://twitter.com/NazzMass/status/1334629204265197568",
                        "https://twitter.com/Filecoin/status/1334644694102532096"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "1",
                    "time": "07/12/2020-17:19:18",
                    "content": "I mean, that tweet is from your account. Look, I’m sympathetic to the problem you’re having. If crypto as a whole comes to consensus that your version of wrapped Filecoin is the ‘correct’ one and should be referred to as WFIL then I’ll happily update both applications and start hassling the other WFIL team. However, at this point, they have a token on mainnet with a non-zero number of tokens distributed. Coingecko, CoinMarketCap and Etherscan all refer to their token as WFIL. It does no one any favours to cause confusion by referring to this as WFIL right now. If the launch goes well, and other sources refer to this token with the WFIL ticker, then I’ll happily revisit the issue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.264508928571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/naszam",
                    "index": "#11",
                    "likes": "1",
                    "time": "07/12/2020-17:42:33",
                    "content": "@LongForWisdom The Tweet is a RT by the Filecoin Official Twitter Account. As mentioned before, I would invite to open a discussion around the differences of the two solutions, in terms of architecture and security, in particular looking at the peg stability of the token and the risks associated with it for MakerDAO protocol. WFIL Labs solution has launched on Mainnet last week (Dec-03-2020 09:31:02 PM +UTC), and it requires some time to onboard liquidity providers and get verified on Etherscan and other aggregators like coingecko, and so on. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.052083333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MaxRoszko",
                    "index": "#12",
                    "likes": "2",
                    "time": "08/12/2020-12:56:46",
                    "content": "    naszam:  @LongForWisdom The Tweet is a RT by the Filecoin Official Twitter Account.   The Filecoin team are supporters of many wrapped Filecoin projects. Here they are showing support for WFIL by Wrapped: https://twitter.com/Filecoin/status/1334950619745030145?s=20 Here they are showing support for HFIL by Huobi: https://twitter.com/juanbenet/status/1318216458292191233?s=20 Here they are showing support for renFIL by Ren: https://twitter.com/Filecoin/status/1334238712838959105?s=20 All of these projects have already been on Ethereum mainnet for a while, and there probably will be some kind of “competition” for which tokens gets most of the liquidity. Having the same ticker name as one of the other projects will cause a lot of confusion, and debating the differences won’t solve any of the confusion the naming will bring, that’s a separate topic. ",
                    "links": [
                        "https://twitter.com/juanbenet/status/1318216458292191233?s=20",
                        "https://twitter.com/Filecoin/status/1334238712838959105?s=20"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/naszam",
                    "index": "#13",
                    "likes": "0",
                    "time": "09/12/2020-08:25:02",
                    "content": "@LongForWisdom WFIL Token by WFIL Labs has been successfully verified on Etherscan on Mainnet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/naszam",
                    "index": "#14",
                    "likes": "1",
                    "time": "21/12/2020-01:52:16",
                    "content": "@LongForWisdom WFIL Factory by WFIL Labs has been deployed on Mainnet. Note: just updated the info relative to the WFIL Factory in the MIP6. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#15",
                    "likes": "0",
                    "time": "14/04/2022-03:39:41",
                    "content": "Collateral Engineering Services (CES) is following up with Greenlit collateral applications that have been open for some time. I want to notify you of some changes we have made in the past month. If you are interested in continuing the collateral onboarding process, we ask that you update your application using the most current template, MIPs Portal. Note the current recommended guidelines for onchain collateral, MIP6 Recommended Guideline Metrics for Onchain Collateral Onboarding. Please reply within a week as to your intention. If we do not hear back from you, your collateral application will be marked as inactive and you will need to reapply. To reapply, please start with a new MIP6 application. The collateral onboarding process is documented here, https://collateral.makerdao.com/ Thanks alsoWFIL! ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-recommended-guideline-metrics-for-onchain-collateral-onboarding/14503",
                        "https://collateral.makerdao.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.448347107438016
                }
            ]
        }
    ],
    "group_index": "3033"
}