{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mkr-holders-now-is-your-time-to-shine-memes-inside/7579",
            "title": "MKR holders, now is your time to shine! (memes inside) ",
            "index": 7579,
            "category": [
                "Governance"
            ],
            "tags": [
                "voting",
                "risk",
                "executive"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "18",
                    "time": "20/04/2021-18:23:28",
                    "content": " Rise and Shine MKR Holders! With the Smart Contracts Team disclosing some important bugs, getting this executive passed in a timely manner is of great importance. The SC team has been working double duty to come up with patches and keep us on on track for Governance, the least we can do is hunker down, grit our team and push past these high gas prices. The safety of the protocol is of the upmost importance and these fixes can’t go live until we push them through.  Voting to Say Thank You Moreover, this executive represents over a year of hard work from the SC team, designing a complete overhaul of our liquidations system to combat the events of another Black Thursday. In addition to thanking the all-stars working tirelessly on the protocol (and maybe agreeing to pay them as a core unit while you’re at it) one great way to show your appreciation is to vote this executive through. Sure it would be nice to get a couple of whales to take care of this, but while we work on that, how about we send a message with voter participation and show how grateful we are to have such a strong team behind the protocol?  Motivating Memes If my words aren’t enough  hope a few choice memes are     image1000×1000 125 KB   Thanks Again SC Team   What do you say we get this passed today? (maybe @flipflopflapdelegate can use this as a jumping off point  ) ",
                    "links": [
                        "https://vote.makerdao.com/executive/liquidations-2-0-contracts-increase-emergency-shutdown-threshold?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/polling/QmTxRwyh?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-april-25th-2021/7744"
                    ],
                    "GPT-summary": "The author of the post is asking MKR holders to vote for an executive that represents a year of hard work from the Smart Contracts Team. The post also encourages voters to show their appreciation for the team by participating in the vote. The post includes memes to motivate voters and suggests collaboration with a specific delegate. The author is not explaining the proposal, but rather asking for feedback and advertising it.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.614308046450903
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "3",
                    "time": "20/04/2021-19:44:28",
                    "content": "Let’s Get It Maker Fam!!! We be like, two peas in a pod   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amyjung",
                    "index": "#3",
                    "likes": "6",
                    "time": "21/04/2021-00:54:58",
                    "content": "from Imgflip Meme Generator ",
                    "links": [
                        "https://imgflip.com/memegenerator"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Anna",
                    "index": "#4",
                    "likes": "8",
                    "time": "21/04/2021-12:37:22",
                    "content": "from Imgflip Meme Generator from Imgflip Meme Generator ",
                    "links": [
                        "https://imgflip.com/memegenerator",
                        "https://imgflip.com/i/56jv1z",
                        "https://imgflip.com/memegenerator"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#5",
                    "likes": "2",
                    "time": "21/04/2021-12:52:59",
                    "content": " ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "5",
                    "time": "21/04/2021-14:35:44",
                    "content": " image511×507 62.2 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "3",
                    "time": "21/04/2021-19:45:04",
                    "content": "Not for nothing, but the ladies– @Anna  and @amyjung  got some serious meme game   https://media.giphy.com/media/ZxKbss8PcztyVD4fUf/giphy.gif(image larger than 4096KB) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 3.7777777777777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#8",
                    "likes": "3",
                    "time": "22/04/2021-14:12:28",
                    "content": "I don’t often vote on executives if I see they are reasonably secure as my I don’t feel my <10 MKR does much in this respect.   Perhaps if delegation comes on line but then who knows.    Given I might want to be a delegate (then again once I get into this I may not) it seems prudent.   I was looking at making a commentary on my own votes - to elaborate my choices - and then defend my reasoning for how I voted.  I started on this and after an hour of trying to set up a reasonable format and start commenting on the polls as well as the aspects of the Executive (there probably was 20+ things in there I could comment on) I gave up realizing it might take a good 1/2 a day just to do this one task.  For what exactly?   Some hope that it would be important and Maker ‘some day in years’ might determine is has value to compensate me in some minimal way.   All this thinking does is discourage - not encourage. My biggest problem here are entities that hold vast amounts of MKR that won’t even communicate.  Heck we didn’t even pass the letter to a16z.   I mean if entities that hold 10K’s of MKR are not going to participate doesn’t it behoove the remaining in the protocol to mint MKR and issue it to those who will?   Even if this is via a set of vesting type wallets. We still are piddling around with compensating key core contributors with MKR so they can actually secure and influence the system beyond the work they do.    Want to maybe get these players to vote well lets see them vote down some proposals to mint and distribute MKR to vesting contracts for our working/contributing people can put their actions into votes to secure and direct the system.   MKR gini coefficient I expects stinks.  What we really want to do is improve this - but to do it in direct response to participation. I wanted to take my BT compensation and buy another 13MKR when the price was low.  I got that compensation when after the price rose 4x.    so I could buy what 3MKR to get above 10.   It kinda hurt. I can’t imagine all the other folks working for MKR being paid in DAI and holding no MKR.   @LongForWisdom  do you even have a single MKR for all the work you have done for the protocol? There are a lot of active people here who probably don’t have hardly any MKR that really should… So while we can talk about MKR not voting or participating and try to ‘whip’ them into action.  Let’s talk about the active people here with a pittance or no MKR that would love to have a real reason to continue participating and to have a real stake to secure and direct this system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.709879785247432
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#9",
                    "likes": "1",
                    "time": "22/04/2021-19:59:57",
                    "content": "    MakerMan:  I wanted to take my BT compensation and buy another 13MKR when the price was low. I got that compensation when after the price rose 4x. so I could buy what 3MKR to get above 10. It kinda hurt.   Ya, in retrospect I think we All wished we had bought more after the BT events–but yes, the BT working group did have to wait quite a long time to be compensated. Unfortunately Financial Markets are impossible to time. What can you do–you win some, you lose some.     MakerMan:  I can’t imagine all the other folks working for MKR being paid in DAI and holding no MKR. @LongForWisdom do you even have a single MKR for all the work you have done for the protocol?   IMO I don’t think its fair to ask anybody how much MKR they own, or that people should own MKR, or not own any specific amount. This is after all scientific governance and we don’t know if this will work, or one day perish. And to be fair, lots of folks here like to learn, enjoy the Financial Nerdiness, and love the wisdom that folks like LongForWisdom and others bring to the table. I know I do–I get a ton of knowledge which has help me create a bunch of opportunities that I am thankful for. And besides, a MKR Vote is a MKR Vote, whether you can only afford 0.00001 MKR, or if you’re just being an active community member–also, it does matter if your dream is to become the next Jay Powell, or Beyonce Knowles–just as long as you know that everything around you that you call life–was made by people that are no smarter than you. After all, we are All somehow connected. So, I hope you stay onboarded MakerMan and help create and shape the future of this DAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.840714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#10",
                    "likes": "3",
                    "time": "23/04/2021-03:22:01",
                    "content": "    MakerMan:  I don’t feel my <10 MKR does much in this respect.   I just wanted to say that this is a bit analogous to saying your vote in your country’s elections also doesn’t matter. In some sense, yes but it’s people like you voting regularly that keep mischievous whales in check! You are right that voting needs to be easier though. As easy as it is to vote on signal requests here on the forum. But I think with delegation and a possible move to L2, we should get there in a few months. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.59920634920635
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#11",
                    "likes": "1",
                    "time": "23/04/2021-06:27:28",
                    "content": "    flipflopflapdelegate:  IMO I don’t think its fair to ask anybody how much MKR they own, or that people should own MKR, or not own any specific amount.   I 100% agree with this. Knowing these things does not add anything useful, and can only possibly create negative vibes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#12",
                    "likes": "1",
                    "time": "23/04/2021-10:19:54",
                    "content": "    AstronautThis:  I just wanted to say that this is a bit analogous to saying your vote in your country’s elections also doesn’t matter. In some sense, yes but it’s people like you voting regularly that keep mischievous whales in check!   What you’re describing is people being rational. Governance in general and voting in particular is a shared good, but has privatized costs. Not only is there a transaction cost, but I think it’s also unfair to expect people to vote when mathematically there is little reason to expect it to change the outcome. In many countries this isn’t ameliorated by an appeal to innumeracy, but with finding other reasons for people to vote — civic pride, seeing your neighbors, a sticker that many businesses will take as a signal and offer you free doughnuts/biscuits/ice cream/whatever. We have badges available, but need more of these reasons beyond actual decision-making to vote. Even delegation/voting blocs won’t solve the “why bother voting if I control X votes, but it would take 4X votes to alter the outcome?” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.801388888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#13",
                    "likes": "0",
                    "time": "25/04/2021-10:02:47",
                    "content": "While Maker voting will probably always be dominated by the whales, the plankton votes are an important security feature to (as a bloc) prevent a whale from getting a harmful vote through. Agreed about the lack of sufficient incentive to vote and the costs involved. Both are of course problems that are being worked on through delegation, voting rewards, etc and hopefully, that will be enough to bring out most small MKR holders too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#14",
                    "likes": "2",
                    "time": "25/04/2021-14:33:29",
                    "content": " Maker Community and Sai1140×1600 234 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tedh",
                    "index": "#15",
                    "likes": "0",
                    "time": "25/04/2021-15:08:15",
                    "content": "As an avid DeFi user, I’d love to be able to vote in MKR voting, but the Uniswap yield is too good atm to pass up.  I’ve posted before, but I’d definitely be willing to stake my LP tokens to vote though! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.262500000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#16",
                    "likes": "0",
                    "time": "25/04/2021-15:13:31",
                    "content": " That’s hilarious!!!  We need more of these ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.69140625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#17",
                    "likes": "3",
                    "time": "25/04/2021-15:33:24",
                    "content": "I will happily generate Wojak and Pepe-themed memes for the DAO gratis. Just doing it for the lulz. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#18",
                    "likes": "5",
                    "time": "25/04/2021-18:59:52",
                    "content": " MakerDAO Oracles500×1026 368 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#19",
                    "likes": "5",
                    "time": "27/04/2021-01:59:44",
                    "content": "In about 3.75 days:  image715×349 96.5 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#20",
                    "likes": "4",
                    "time": "27/04/2021-14:41:16",
                    "content": "cat.bite() => dog.bark() ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#21",
                    "likes": "0",
                    "time": "27/07/2021-20:41:57",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}