{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/campaign-mip39c2-sp9-vote-yes-on-inclusion-poll-for-strategic-marcomms-core-unit-mip-set-may-10-2021/7958",
            "title": "[CAMPAIGN: MIP39c2-SP9] Vote YES on \\xe2\\x80\\x9cInclusion Poll for Strategic Marcomms Core Unit MIP Set \\xe2\\x80\\x93 May 10, 2021.\\xe2\\x80\\x9d ",
            "index": 7958,
            "category": [
                "Governance"
            ],
            "tags": [
                "cpm-001",
                "polls",
                "core-unit-budget",
                "campaigning"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "10",
                    "time": "10/05/2021-18:20:56",
                    "content": "Maker Community, it’s that time of the week to decide to express your support or opposition of the newly posted Governance Polls. One inclusion poll that you will be ask to select is whether to approve the Strategic Marcomms Core Unit, or not. Marketing Distribution. When you vote—I ask that you think about one of the keys to success: Distribution, Distribution, Distribution. Products that achieve greatness get this one thing right. Value Proposition. We All know that the BD team has had tremendous distribution success and they have brought value to the South American market with DAI. Now ask yourself a question, what is it about DAI that will cause people in ASIA to spread the word about our product? We have yet to nail this mechanism of vitality in this region. Market effects theory. Creating a mechanism for network effects in Asia and other continents is not an easy task. Sure, we all want to build and create DAI as the next big thing—and the easiest thing we can say is, “if we build it, they will come.” The biggest mistake we can do is not having an original approach in our distribution hacks. We need to get more creative and at the same time be aware that we need to create a value proposition for DAI Distribution. “A good product with great distribution, with always beat a GREAT product with poor distribution” –Reid Hoffman “Never treat distribution like an afterthought. If you can’t get your product that want to use on a startup budget, then ultimately you’re doom.” With that in mind I urge the Maker Community to Vote YES to the Strategic Marcomms inclusion poll based on their experience, commitment, and what I believe is a passion for bringing growth to the Maker ecosystem. I urge you to ponder the question as to why a former Team of talented Foundation Employees is asking for a budget with flair, and a budget that brings an appetite for taking DAI to the next level? I also ask that at this very moment that you measure their success by future results and not by past performance. We need to measure the success of certain Core Unit by what they will deliver, and not what they have written, including—but not limited to the success of DAI in Asia—a continent we have yet to successfully triumph in. Here are more details to their approach. If you truly believe that Maker and DAI are household names and every person in your neighborhood knows Maker and DAI, inside and out—then by all means, vote “NO”. But if you are like me, and know that DAI needs more Marketing and more adoption, than do as I will do and Vote YES. Do not let the opposition sway you in a direction/narrative that they personally want and are also not satisfied with. Think for yourself. Do not let them influence the MakerDAO process. ",
                    "links": [
                        "https://forum.makerdao.com/t/campaigning-vote-no-on-inclusion-poll-for-strategic-marcomms-core-unit-mip-set-may-10-2021/7951/11",
                        "https://forum.makerdao.com/t/are-we-having-a-loud-minority-problem/7972",
                        "https://forum.makerdao.com/t/mip40c3-sp9-modify-core-unit-budget-cpm-001/7190/34",
                        "https://forum.makerdao.com/t/maker-relay-ep-44-en-espanol/7998",
                        "https://forum.makerdao.com/t/call-for-makerdao-facilitators-to-share-a-multisig/7977",
                        "https://forum.makerdao.com/t/maker-relay-ep-44/7974",
                        "https://forum.makerdao.com/t/are-we-having-a-loud-minority-problem/7972/2"
                    ],
                    "GPT-summary": "The author of the post is explaining a proposal for the Strategic Marcomms Core Unit and urging the Maker Community to vote yes on the inclusion poll. The post discusses the importance of distribution and creating a value proposition for DAI in Asia and other continents. The post also asks the community to measure the success of the Core Unit by future results and not past performance. The post may receive constructive criticism and questions from third parties, and it also serves as an advertisement for the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.12035187035187
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "3",
                    "time": "10/05/2021-18:46:14",
                    "content": "    flipflopflapdelegate:  We All know that the BD team has had tremendous distribution success and they have brought value to the South American market with DAI   I have watched with great pride and affection, seeing DAI grow little by little in the region and being part of it, and in response to that the use of DAI in other networks and even sidechains, is the way forward for DAI to be the best form of money that little by little is being planted on many Latinos. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9356060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#3",
                    "likes": "3",
                    "time": "10/05/2021-19:03:46",
                    "content": "Thank you for those words @flipflopflapdelegate Defi brought endless possibilities to Latinos, countries like Venezuela and Argentina are fully on this new path to financial freedom. DAI needs to adapt to the new times, to be promoted as the best option and this path needs to be re-launched. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1477272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "3",
                    "time": "11/05/2021-01:10:07",
                    "content": "Our opponent claims the following (snapshot from the “NO” campaign post)  image703×132 7.52 KB  When it comes to MakerDAO, the only hill worth dying on, is the MakerDAO hill.  Because we all know this MakerDAO hill is beyond invisible, undamaged, high and very steep, perpendicular wooded, remarkable and steep, conical, and in simple words an unstoppable protocol that will achieve and exceed our wildest expectations. Do the right thing, and Vote Yesssssss. Trust the process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0598214285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#5",
                    "likes": "2",
                    "time": "11/05/2021-08:21:38",
                    "content": "I’m in favour. Trust the process. Put the protections in place that should be in place anyway (multi-sig for the Moonshot fund etc). And trust governance to be smart enough to vote on what’s in front of them. The idea that MKR holders need to be protected with a change of process to avoid making the “wrong” decision because they don’t read the proposals properly is insulting. It’s also a precedent that will only make an already complex governance process messier in the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.095238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#6",
                    "likes": "2",
                    "time": "11/05/2021-10:13:53",
                    "content": "The multi-sig was proposed after the proposal had moved on-chain and therefore wouldn’t actually be binding if the vote passed. I do think it’s a valid means to mitigate some concerns moving forwards though ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "2",
                    "time": "11/05/2021-11:19:54",
                    "content": "Sometimes a MOONSHOT pays off, and sometimes it does not. But if you’re FTX, it seems every MOONSHOT is currently firing on all cylinders. Or, maybe they’re just built that way. I guess they live by the concept that Risk is Real, but Fear is Not…  image300×509 46.2 KB  Or maybe it’s just that, when you know, you know.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.5606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "0",
                    "time": "11/05/2021-13:54:39",
                    "content": " image1021×372 40.9 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#9",
                    "likes": "3",
                    "time": "12/05/2021-23:51:02",
                    "content": "Facebook and DIEM are here folks. And they won’t have a Marcomms Core Unit worrying about 5M DAI. Believe that! It’s Go Time.    CoinDesk – 12 May 21    Facebook-Backed Diem Plans Dollar Stablecoin With Silvergate - CoinDesk The Facebook-backed Diem Association plans to issue a U.S. dollar stablecoin issued by Silvergate Bank as it moves out of Switzerland.      ",
                    "links": [
                        "https://www.coindesk.com/facebook-backed-diem-partners-with-silvergate-bank-to-issue-us-dollar-stablecoin"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#10",
                    "likes": "0",
                    "time": "13/05/2021-09:33:27",
                    "content": "Folks, more and more products will be arriving—the competition is getting healthier: Gateway’s main unit of account (CASH) will be used to pay for transaction fees and is created through borrowing, much like MakerDAO’s DAI. CASH will be pegged to the dollar. —Messari ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.708333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "0",
                    "time": "14/05/2021-17:42:12",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}