{
    "poll_list": [
        {
            "title": "Adjust the Dust Parameter - November 16, 2020",
            "index": "5122",
            "option": "500 DAI",
            "supporting_mkr": "28,476",
            "highest_fraction": -1
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-increasing-dust-value/5122",
            "title": "[Signal Request] Increasing `dust` value ",
            "index": 5122,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted",
                "dust"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "5",
                    "time": "13/11/2020-08:02:48",
                    "content": "Hey all, dust parameter is the minimum possible debt of a vault. Currently all vault types have 100 DAI dust value. The last time governance increased dust from 20 DAI to 100 DAI was in mid August when gas prices started to rise due to the liquidity mining craze. We saw how gas price increased over 200 Gwei on Black Thursday and even above 700 Gwei during the summer due to hype around yield farming opportunities. @monet-supply made this really nice table a while ago, which shows what is the minimum debt (dust) size tolerated if gas price increases and we want auctions to clear without a loss for Maker. For instance, when liquidating a 150% collateralized position in a distressed scenario where gas price increases to 500 Gwei, auction costs (kick, tend, dent, deal, trade) for keepers amount to about $160 of gas fees. This means the debt size (or dust) can not be below 323 DAI in case the keeper makes such a transaction with zero profit or loss and no loss is made for Maker. If you assume about 10% profit for the keeper, minimum tolerated debt size already increases to 462 DAI. Also note that unwinding of a vault costs approximately 400k gas which again, in extreme events of gas price around 500 Gwei, costs can amount to $90. We propose governance to increase dust above current 100 DAI level due to concerns mentioned above. There are also other negative effects that low dust levels may cause, particularly related to keepers’ reduced incentive to bite smaller vaults. The fixed gas costs compared to small dusty positions they bid on might outweigh their expectation of profits in a competitive bidding strategy that takes 6 hours. The question of course is what amount of dust is still tolerated by governance, since we know increasing dust has downsides related to excluding part of retail users. Furthermore, according to our knowledge other platforms such as Compound and Aave don’t use dust equivalent debt limits. Few reference data points:  There are currently around 1.700 Vaults opened having debt less than 500 DAI, which sums up to 180.000 DAI in total. Some of them might be abandoned. There are currently around 2.000 Vaults opened having debt less than 1000 DAI, which sums up to 400.000 DAI in total. Some of them might be abandoned.  What should be the new dust level?     100 DAI (no change) 250 DAI 500 DAI 750 DAI 1000 DAI Abstain     0 voters     This poll will close on Sunday 15th November. ",
                    "links": [
                        "https://forum.makerdao.com/t/small-vaults-liquidations-incentives/5166",
                        "https://forum.makerdao.com/t/week-24-dai-distributions-sourcecred-funding-mip13c3-sp6/5223",
                        "https://forum.makerdao.com/t/maker-relay-ep-21-en-espanol/5199",
                        "https://forum.makerdao.com/t/maker-relay-ep-21/5181"
                    ],
                    "GPT-summary": "The author proposes to increase the dust parameter, which is the minimum possible debt of a vault, due to concerns related to gas prices and keepers' reduced incentive to bite smaller vaults. The author provides data points and a table to support the proposal and asks for feedback from governance on what the new dust level should be. The post also invites questions and constructive criticism from third parties and sets a deadline for the poll.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.646805896805897
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#2",
                    "likes": "2",
                    "time": "13/11/2020-09:30:04",
                    "content": " it would be probably wise that frontends should warn smaller users about modifiable dust parameter and related problems in general. how does dutch auction/LIQ2.0 changes the economics/calculation? Is there significant change? could “canonical”  keeper implementation add (optional) gas token usage?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#3",
                    "likes": "1",
                    "time": "13/11/2020-10:08:06",
                    "content": "Why there is no debate on L2 development instead of fixes like this one? Is there anyone reading this forum willing to work on a new DAI development provided he/she got funding? We cannot count on the Foundation to provide the funding. I’ll take the silence as no. Now, back to the current issue - we cannot make an educated answer unless the risk team provides the expected gas fees for the next 1 month. Today, the “normal” gas price is 45-60 Gwei. IMO, the liquidations should be profitable with 150 Gwei gas price which could happen anytime and for a prolonged period of time. I’m sure that there will be periods with 200+ Gwei price in the coming days, but we cannot cover the peaks unless we want to make MKR a whale-only system. I’m voting for 100 and 1000 because all “middle” values are just kicking the can down the road without dealing with the problem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.39425505050505
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#4",
                    "likes": "0",
                    "time": "13/11/2020-11:37:07",
                    "content": "I’m not sure how to think about this. You are saying that at current ETH price and 500Gwei, dust has to be > 500 DAI for keeper activity to be profitable, but that gas prices only went up to 200 Gwei on Black Thursday. And we are nowhere near 200 Gwei today. I’m not sure what yardstick I should use to decide on the dust today. Do I want to prevent today the creation of vaults that are below dust when the gas is at 1000Gwei? 5000Gwei? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.527777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#5",
                    "likes": "1",
                    "time": "13/11/2020-14:48:01",
                    "content": "    jernejml:  how does dutch auction/LIQ2.0 changes the economics/calculation? Is there significant change?   Yes, good point, I think Liq 2.0 are less gas intensive but somebody from SC team should correct me if I am wrong and let us know what are estimated costs when making auction transaction in Liq 2.0.     bit:  I’m voting for 100 and 1000 because all “middle” values are just kicking the can down the road without dealing with the problem.   Fair.     swakya:  Do I want to prevent today the creation of vaults that are below dust when the gas is at 1000Gwei? 5000Gwei?   This is why signals are useful, the best way is to crowdsource. Nobody can reliably forecast gas prices during liquidation events. They are definitely higher during liquidation events than what you observe on average. But imagine having some intense farming going on and at the same time crypto crashing. Also DeFi is growing and protocols are becoming more and more interdependent. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.33425925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "1",
                    "time": "13/11/2020-16:16:04",
                    "content": "    Primoz:  There are currently around 1.700 Vaults opened having debt   It took like 2 minutes to figure out you meant 1,700 Vaults–not: 1.7 in American terms  I guess the only downside I see here is innovation–perhaps some Dev in Belarus is right now working on an App that will allow everyday people to borrow, 100, 200, 300 DAI to pay their rent because their employer has not paid them his/her allowance/wages. I don’t know–I’m always thinking about how the product can be expanded to the masses. But I totally understand why you wrote this post/poll Primoz… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "2",
                    "time": "13/11/2020-16:17:39",
                    "content": "Similar to the YFI debt ceiling signal, given my post here, DsChief 1.2: Flash Loan Protection for Maker Governance. I think we should move up the timeline on this signal request. As a TL;DR the governance contract migration means that we may not have a regular executive on either the 27th November and the 4th December. I think we should consider this poll to end on Sunday 15th November, such that it can go on-chain on Monday and potentially be included in next weeks executive. I realize this is a less obvious change than the YFI debt ceiling, but between proposing a change next week and in 4 weeks time - having discussed with @Risk-Core-Unit - I think we want to lean towards proposing a change next week given the potential for market volatility. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.916666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#8",
                    "likes": "1",
                    "time": "13/11/2020-17:16:25",
                    "content": "Quick question before I vote - Is this issue mitigated by liquidations 2.0 and will we therefore be able to reduce it to a lower amount after that is in production? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.083333333333332
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lucasmanuel",
                    "index": "#9",
                    "likes": "3",
                    "time": "13/11/2020-18:20:04",
                    "content": "Hi everyone, going to give an update on how LIQ-2.0 will affect this issue. Since we are moving to a dutch auction system for liquidations, there is no longer an inherent incentive for keepers to trigger auctions. To combat this, we are introducing two new governance params that will be configureable for each collateral type: uint256 chip;  // Percentage of due to suck from vow to incentivize keepers uint256 tip;   // Flat fee to suck from vow to incentivize keepers  When bark() is called by a keeper to trigger a liquidation, tip + due * chip amount of DAI is printed and given to the keeper as an incentive, where due is the amount out for liquidation before the liquidation penalty is accounted for. This allows for a good degree of flexibility for incentivizing keepers:  If chip is set to zero, it is just a flat fee. If tip is set to zero, it is just a linear increase with vault size.  tip can be configured to be above dust in extreme scenarios where the protocol is willing to incentivize liquidations at a loss.  Regarding gas, I just compared gas used by the current LIQ-1.2 bite() vs. the upcoming LIQ-2.0 bark(): bark() gas used: 360644 bite() gas used: 343711 difference:       16933  bark() currently does use slightly more gas than bite(), but because of the explicit incentive from the protocol, that should not cause any issues. We also must note that LIQ-2.0 is still a work in progress so this number could change. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.398601398601398
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#10",
                    "likes": "2",
                    "time": "13/11/2020-18:27:49",
                    "content": "Thanks @lucasmanuel. So to make sure I’m understanding, we’ll still need to keep dust sufficiently high to deter “fee farming” from Keepers…am I thinking of that correctly? Edit: I’m not sure if this is correct at all upon second though. I still don’t understand what liq2.0 means for dust ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.609999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lucasmanuel",
                    "index": "#11",
                    "likes": "1",
                    "time": "13/11/2020-18:34:29",
                    "content": "This is an interesting area that we’ve been thinking about. We have to be careful in setting the incentive params so that the system doesn’t get abused (i.e. a malicious keeper opens a bunch of dusty vaults and liquidates themselves). The ideal scenario is that the incentives are set in a way that all vaults (regardless of size) would be profitable for keepers to liquidate, but not profitable for someone to liquidate themselves. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#12",
                    "likes": "0",
                    "time": "13/11/2020-18:37:55",
                    "content": "Can this be handled via the liquidation penalty? E.g. set liquidation penalty at 13%, set tip to 5 Dai (assuming this covers gas fees), set dust to 40 Dai so that the liquidation penalty is greater than tip in all scenarios. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lucasmanuel",
                    "index": "#13",
                    "likes": "1",
                    "time": "13/11/2020-18:54:36",
                    "content": "That’s a good point, the issue is when we start to have higher gas fees. Right now with the 360,644 gas needed to call bark() it would cost:  $5.77 at 34 gwei (current state) $118.90 at 700 gwei (extreme case)  The $13 dollars from the liquidation penalty of a dusty vault would cover us for the current scenario, but at higher gas prices, the protocol would have to start considering incentivizing at a loss. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.600446428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#14",
                    "likes": "3",
                    "time": "13/11/2020-18:56:23",
                    "content": "I think this is a good argument for higher dust. To account for changes in gas fees that may make tip unprofitable. So maybe 100 Dai dust is the right number once liq2.0 is in place? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.05952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#15",
                    "likes": "5",
                    "time": "13/11/2020-23:02:00",
                    "content": "Increasing too much this parameter will not allow lot of people to use MakerDAO, some people have just 1 ETH on their wallets and want to do some payments with DAI, then in some way pay back the loan and that’s it. Increasing the dustparameter will exclude lot of people. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chonghe",
                    "index": "#16",
                    "likes": "4",
                    "time": "14/11/2020-02:39:32",
                    "content": "500 DAI can be a lot of money to many people. We want many people to use DAI, increasing the minimum will prevent people using Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#17",
                    "likes": "2",
                    "time": "14/11/2020-06:44:18",
                    "content": "I am against the dust of 500DAI, it is not conducive to expanding the user base. I prefer to use dust of 500DAI or higher only for large user groups. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.580357142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#18",
                    "likes": "1",
                    "time": "14/11/2020-07:02:36",
                    "content": "It’s a fine balance as even 100 Dai is a large amount for most people in the world. As healthy critic Bit mentioned, do think there needs to be alternatives in the long term. Maybe it’s L2, maybe some technology to lump dusts together to allow them to be liquidated or allow big vaults to be divided to smaller vaults for users to use. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.129251700680271
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#19",
                    "likes": "3",
                    "time": "15/11/2020-14:57:35",
                    "content": "I am closing the poll. There is no clear winner and three options have almost equal amount of votes so I think it makes sense to have ranked choice on-chain vote tomorrow. Thank you for participating. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#20",
                    "likes": "1",
                    "time": "16/11/2020-08:24:00",
                    "content": "I have a question, what is so costly in the contract? At the end of the day we just need a swap. Can we change the liquidation process based on the amount. Let s say if under 1000 use LP, other cases use Dutch action. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#21",
                    "likes": "7",
                    "time": "16/11/2020-14:36:39",
                    "content": "Further information to help inform your vote when the ranked choice on-chain vote gets published later today:  “The Keeper’s dilemma: Game theoretic analysis of liquidation incentives, with preliminary empirical results” - B.Protocol: https://medium.com/b-protocol/the-keepers-dilemma-game-theoretic-analysis-of-liquidation-incentives-with-preliminary-b588e82e4d67  Small Vaults Liquidations & Incentives: Small Vaults Liquidations & Incentives   ",
                    "links": [
                        "https://forum.makerdao.com/t/small-vaults-liquidations-incentives/5166"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#22",
                    "likes": "1",
                    "time": "27/11/2020-10:53:34",
                    "content": "The dust parameter was increased to 500 DAI as part of this executive vote. Thanks to all vote voting both on-chain and off. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#23",
                    "likes": "0",
                    "time": "04/12/2020-10:53:41",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2930"
}