{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/huntingdon-valley-bank-transaction-documents-on-permaweb/16264",
            "title": "Huntingdon Valley Bank: Transaction Documents on Permaweb ",
            "index": 16264,
            "category": [
                "Updates"
            ],
            "tags": [
                "rwa",
                "reporting",
                "hvb",
                "rwa-009"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#1",
                    "likes": "15",
                    "time": "01/07/2022-14:21:05",
                    "content": "As we proceed to finalize the transaction agreements for Huntingdon Valley Bank, I will be posting links to the executed agreements (redacted) in this thread. The agreements below are executed in advance of the Governance Poll - see HVB Update - and are a necessary precondition to finalization of the definitive transaction agreements. The other transaction agreements will be executed subsequent to the Governance Poll. RWA Master Participation Trust Certification of Formation Certificate of Formation File ID: 918730e2-09e8-458c-b4c6-7f44d0fee382 RWA Master Participation Trust - Short Form Trust Agreement Short-form Trust Agreement File ID: 9965a8d7-d384-4dc8-a1b8-0067c5ae0874 As a side note, the RWA Master Participation Trust - Short Form will be amended to reflect the final transaction structure detailed in the RWF Risk Assessment. RWF Risk Assessment This short-term is a necessary condition to forming a Delaware statutory trust. ",
                    "links": [
                        "https://app.ardrive.io/#/file/918730e2-09e8-458c-b4c6-7f44d0fee382/view",
                        "https://app.ardrive.io/#/file/9965a8d7-d384-4dc8-a1b8-0067c5ae0874/view",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-hvb-rwa-collateral-onboarding-risk-assessment/15828",
                        "https://forum.makerdao.com/t/mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14482",
                        "https://forum.makerdao.com/t/this-week-in-governance/16382/2",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-04-de-julio-del-2022/16381",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/7",
                        "https://forum.makerdao.com/t/mip39c2-sp34-creating-rwf0x-from-a-split-of-rwf-001/16967",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-julio-01-de-agosto-del-2022/17049",
                        "https://forum.makerdao.com/t/relay-semanal-28-de-junio-05-de-julio-del-2022/16473"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.171875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#2",
                    "likes": "7",
                    "time": "01/07/2022-14:27:31",
                    "content": "Now CP, let me ask you two questions:   To your knowledge, have commercial deal documents for a multi million dollar participation facility ever been enshrined on the Permaweb before?   How are you this much of a savage?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#3",
                    "likes": "2",
                    "time": "01/07/2022-15:44:38",
                    "content": "    teej:  To your knowledge, have commercial deal documents for a multi million dollar participation facility ever been enshrined on the Permaweb before?   My knowledge is limited. And I will credit @g_dip and @mrabino1 for the idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.821428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#4",
                    "likes": "0",
                    "time": "01/07/2022-17:42:10",
                    "content": "    teej:  How are you this much of a savage?   I wonder the same thing on an hourly basis! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#5",
                    "likes": "10",
                    "time": "18/07/2022-23:18:27",
                    "content": "The links below provide access to redacted versions of the transaction documents for the HVB transaction. I have redacted individual names and the account details for the Participation Funding Account, the Participation Receipts Account, the Authorized Investments Income Account and the Escrow Account. I have omitted, due to confidentiality limitations, the letter agreement with Genesis Trading, Inc and the letter agreement with Ankura Trust Holdings. Master Participation Agreement Servicing Agreement Amended and Restated Master Participation Trust Escrow Agreement Escrow Agreement Standing Instructions Trust Investment Instructions - Authorized Investments RWA Foundation Amended and Restated Articles of Association [Stamped] Resolution Approving Amended and Restated Articles of Association [Stamped] RWA Foundation Board Resolution RWA Foundation Deed Poll Genesis Trading The letter agreement between RWA Foundation and Genesis Trading accomplishes the following:   Creates a legally binding obligation of the exchange broker to convert DAI received from the vault into USD and transfer the USD to the escrow account held by Wilmington Savings Fund Society   Creates a legally binding obligation of the exchanger broker to convert USD received from the escrow account into DAI and transfer the DAI to RWA Jar.   Obligates the exchange broker not to accept any change to the destination of USD (i.e., escrow account) or DAI (i.e., RWA Jar) without Maker governance approval via an executive vote; provided that, Ankura Trust Holdings may change the destination for the DAI to RWAUrn. [Note: This change will occur after Maker governance determines to dissolve the Trust.]   The exchange broker recognizes that Ankura Trust Company will be the custodian of the username, password and secondary authentication for RWA Foundation portal access with the exchange broker.   Ankura Trust The Ankura Trust letter agreement sets forth Ankura Trust’s services and fees. The services include: review of each proposed loan participation (calculation agent), roll-up of the various value chain transactions in a report (crypto servicer), agent to receive notices for RWA Foundation under the various agreements, and custodian of the username, password and secondary authentication for RWA Foundation portal access with the exchange broker. ",
                    "links": [
                        "https://app.ardrive.io/#/file/efaea7b9-ac80-4706-a716-6b207df070f4/view",
                        "https://app.ardrive.io/#/file/b8c09b57-bac0-4735-95f1-73c22f80cfc8/view",
                        "https://app.ardrive.io/#/file/fc20dc77-a513-4758-bcc0-adcb8389908c/view",
                        "https://app.ardrive.io/#/file/f59377e9-475c-4d17-9923-61744c190cbc/view",
                        "https://app.ardrive.io/#/file/038baaea-486b-4486-a9d2-ea43cb245d10/view",
                        "https://app.ardrive.io/#/file/54ca36f7-a547-4d20-9d92-98f228116df8/view",
                        "https://app.ardrive.io/#/file/9280e803-9225-493b-83b4-50e22c7f5bc5/view",
                        "https://app.ardrive.io/#/file/450ef04d-560c-45e3-ab0f-f646f6c30bc8/view",
                        "https://app.ardrive.io/#/file/ad381e41-c642-4b0f-8041-8569357b3a01/view",
                        "https://forum.makerdao.com/t/poll-inclusion-request-hvbank-legal-update/17547/9"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.819444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#6",
                    "likes": "0",
                    "time": "18/07/2022-23:46:13",
                    "content": "Excellent stuff. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/itsjake007",
                    "index": "#7",
                    "likes": "2",
                    "time": "19/07/2022-01:29:42",
                    "content": "let’s goooooo!!! Amazing to see all the transaction documents neatly organized here. Super helpful for compiling the data. For reference I am putting it all here! HVB Path Forward - Google Docs ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.541666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#8",
                    "likes": "5",
                    "time": "27/07/2022-18:40:39",
                    "content": "As noted Here, due to a change in the smart contract addresses for the HVB transaction, the Maker token holders are specifically requested, as part of the executive spell, to approve certain amendments to the existing agreements for the HVB transaction to reflect the new smart contract addresses. The detailed amendments and related authorizations in respect of the agreements between RWA Foundation and each of Genesis Global Trading and Ankura Trust Company are set forth here MKR Token Holder Approvals and Authorizations. These amendments and authorizations require the affirmative approval of the Maker token holders in accordance with the terms of the underlying agreements. Please let me know if you have any questions or concerns. ",
                    "links": [
                        "https://app.ardrive.io/#/file/9e1d6a2b-0adc-45ac-af51-fd7780273469/view",
                        "https://forum.makerdao.com/t/relay-semanal-02-08-de-agosto-del-2022/17223",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/9",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-julio-01-de-agosto-del-2022/17049",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/7"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9190115440115445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#9",
                    "likes": "0",
                    "time": "27/07/2022-19:53:10",
                    "content": "Thank you, Christian. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#10",
                    "likes": "4",
                    "time": "05/08/2022-17:52:20",
                    "content": "As part of the Maker token holders approval of the 1st HVB executive spell and to implement the change of wallet addresses approved by that executive spell - see Delay of Executive - here is the link to the RWA Foundation directors resolution approving the required changes to the legal agreements. RWA Foundation Resolution - August 4, 2022 The RWA Foundation resolution was executed in accordance with the RWA Foundation Articles of Association after the Executive Spell passed. ",
                    "links": [
                        "https://app.ardrive.io/#/file/c7b9a86c-909c-4bb9-b7e5-325de2ebb7f2/view"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#11",
                    "likes": "3",
                    "time": "09/09/2022-20:03:19",
                    "content": "In anticipation of the Maker token holders voting on the proposed Amendment No. 1 to the RWA Master Participation Agreement Annexes and for purposes of the Executive Spell, @collateral-core-unit has requested that I upload the proposed amendment to Arweave – Form of Amendment No 1 I will upload the signed copy once approved and executed as well. ",
                    "links": [
                        "https://forum.makerdao.com/t/nov-16-2022-executive-contents/18747"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#12",
                    "likes": "1",
                    "time": "28/09/2022-14:27:29",
                    "content": "Amendment No. 1 to the RWA Master Participation Agreement, as approved by Maker governance, has been signed and can be found via the link below, together with the RWA Foundation signed board resolution. Amendment No. 1 to Master Participation Agreement RWA Foundation Board Resolution ",
                    "links": [
                        "https://app.ardrive.io/#/file/d5656b01-1a7e-40d9-85fe-13c0376fd508/view"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#13",
                    "likes": "3",
                    "time": "11/11/2022-14:39:06",
                    "content": "An update on HVB. We received the communication below from Genesis Trading this morning. As the Maker community knows, Genesis Trading will be responsible for the conversion of USD into DAI as funds are paid to RWA Urn and RWA Jar.  Screen Shot 2022-11-11 at 8.34.55 AM938×900 294 KB  @collateral-core-unit ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#14",
                    "likes": "0",
                    "time": "09/02/2023-14:39:38",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}