{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/uso-de-jokedao-para-consenso-suave-en-la-gobernanza-traduccion/17679",
            "title": "Uso de jokedao para consenso suave en la gobernanza [Traducci\\xc3\\xb3n] ",
            "index": 17679,
            "category": [
                "Latin America"
            ],
            "tags": [
                "governance",
                "proposal-ideas",
                "espa\\xc3\\xb1ol",
                "translate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/brigith238",
                    "index": "#1",
                    "likes": "6",
                    "time": "06/09/2022-12:44:00",
                    "content": "jokedao: La historia corta jokedao está construyendo experimentos de gobernanzas dirigidos por la comunidad para que las DAO construyan un consenso suave. Lo lanzamos el mes pasado y ya está siendo usado por Tally, Aave, Packy Mccormick (Not Boring), Austin Griffith (BuidlGuidl), Juicebox y muchos más. ¿Tienes 5 minutos? Aquí hay un tweet explicativo: https://twitter.com/jokedao_/status/1549053081266008065 ¿Qué es Jokedao? http://www.jokedao.io jokedao permite una gobernanza on-chain ascendente, permitiendo a los holders de tokens presentar propuestas y votar por sus favoritos, lo que permite una gobernanza comunitaria para los roadmaps generados por los usuarios, las subvenciones, los apoyos, las recompensas, la curación y los concursos. Cambia la manera en que la gobernanza se ha estado haciendo: ahora es la comunidad misma que puede responder a prompts presentando ideas y votando sobre ellas. Por primera vez, la comunidad está incentivada a alzar su voz, y la gobernanza se vuelve realmente descentralizada así como lúdica y divertida. Los concursos de jokedao se realizan en dos periodos. Durante el periodo de presentaciones, las comunidades pueden responder a prompts con propuestas.   Durante el periodo de votación, las comunidades pueden votar en sus propuestas favoritas para medir la priorización relativa de cada una.   La gobernanza descentralizada es particularmente útil para incentivar casos de uso para constructores y creadores, incluyendo:  Subvenciones Avales Recompensas Competencias Giveaways Roadmaps generados por usuarios Encuestas de usuario Fans escogiendo el próximo topic, invitado de podcast, etc, de los creadores de contenido.  Propuesta: Uso de jokedao para construir consenso suave en MakerDAO que va a:  formalizar las ideas y preferencias de la comunidad permitir a los builders desarrollar propuestas que estén más en línea con la visión de la comunidad dejar a la comunidad presentar versiones alternas de las propuestas para construir consensos alrededor de la mejor versión generar mayor consenso y alineamiento alrededor de las propuestas  Tres casos de uso: Caso 1: Pulse Checks y Marco de Priorización MakerDAO podría tener “pulse checks” regulares para ver qué tipo de proyectos querría priorizar la comunidad, por ejemplo, RWAs, diversificación de colateral, adición de comités, etc. La comunidad podría presentar y votar sus favoritos para obtener un pulse check adelantado de que tipo de propuestas prioriza MakerDAO y probablemente aprobaría. En lugar de que solo los buiders propongan proyectos que ellos mismos planean desarrollar, ahora toda la comunidad podría participar y sugerir los proyectos que les gustaría ver. Los builders también tendrían una idea de en qué proyectos construir propuestas más completas, con una probabilidad mucho mayor de consenso y éxito dado el pulse check previo. Para hacerlo, podríamos lanzar a los holders de MKR un Prio Token que luego pueden usar para enviar hasta tres propuestas para prioridades a corto plazo o ideas de proyectos. (Lo mismo también podría haerse para los holders de DAI, para contrastar los deseos de los DAI holders con los de los MKR holders, o superposición de superficies y sinergias.) Los pulse check de múltiples concursos podrían incluso servir para diferenciar entre objetivos estratégicos y tácticos, ya que una primera ronda podría centrarse en las prioridades estratégicas (por ejemplo, stability fees de vault más bajos) y una segunda ronda de seguimiento podría centrarse en los objetivos tácticos para cumplir con estas. Caso 2: Construir Iniciativas Comunitarias Luego de que un pulse check ha sido llevado a cabo, MakerDAO tendrá una visión sólida de las prioridades de la comunidad y podrá realizar un concurso para que los miembros envíen una propuesta sobre la principal prioridad. Por ejemplo, supongamos que la comunidad votó que “diversificar el colateral” era su principal prioridad. Ahora, MakerDAO podría realizar un concurso a la mejor propuesta para diversificar el colateral. Los miembros podrían presentar propuestas más completas sobre la mejor manera de diversificar los colaterales y luego votar por sus favoritos, alcanzando un consenso suave a través de la gobernanza sobre cómo avanzar. En lugar de que los builders tengan que generar la idea completa y el alcance de cómo proceder, la comunidad podría generar ideas sobre lo que querrían ver, y los builders podrían avanzar para trabajar en proyectos que ya tenían un apoyo claro. Caso 3: Presentar Versiones Alternas a las Propuestas Finalmente, la propuesta ganadora podría presentarse en un concurso final para recibir feedback y mejoras. Actualmente, los diferentes objetores de una propuesta a menudo formarán un bloque de no votantes, aunque pueden objetar partes diferentes. Algunos pueden objetar el cronograma, otros el presupuesto, otros el equipo. Cuando estas propuestas fallan inevitablemente, las DAO a menudo experimentan disidencias polémicas mientras los core teams se esfuerzan por volver a presentar una versión que tenga más probabilidades de ser aprobada. En cambio, con nuestra gobernanza, el creador de un concurso podría enviar una propuesta como aviso y la comunidad podría enviar versiones alternativas en respuesta, algunas cambiando el cronograma, otras el presupuesto, otras ambas. En última instancia, la comunidad formaría un consenso sobre la mejor versión de la propuesta que tendría más probabilidades de ser aprobada en una votación final, y el builder también tendría que aceptar los términos de la comunidad.  Propuesta Realizar un community pulse check para sacar a la superficie las prioridades de los holders de MKR. En conjunto con los delegados de Maker @twblack88 y @rspa (quienes contribuyeron a esta propuesta), proponemos lanzar 1 PrioToken a cada dirección holdeando MKR. Cada trimestre un nuevo snapshot de direcciones holdeando MKR será realizado y un nuevo PrioToken será lanzado. El costo del airdrop correrá a cargo de los proponentes hasta que se pueda establecer un valor claro y actual para la comunidad. Solo entonces los proponentes solicitarán un special purpose found para compensar los costos de gas y personal (~$400/trimestre). La cantidad de 1 PrioToken por dirección fue elegido a propósito para aplanar las distribuciones de ley de potencia existentes y amplificar las voces de los holders de MKR más pequeños. El airdrop será realizado en la red MATIC de Polygon, para que la participación sea menos costosa. Los precios actuales de gas en MATIC son menos del 1% de la red principal de Ethereum. Proceso de PulseCheck: 1ra Ronda (duración de 1 semana): Presentar propuestas de prioridades estratégicas para MakerDAO. Holders de 1 PrioToken puede presentar una prioridad amplia para MakerDAO. Estos objetivos deben ser propuestas de nivel superior, de alta abstracción y a más largo plazo. (Por ejemplo: Aumentar al doble el uso de la vault). 2da Ronda (duración de 1 semana): Votación de los objetivos tácticos. Cada tokenholder puede votar sobre una sola propuesta con su PrioToken. Los votos de token holders indican su prioridad número 1 o preferencia por objetivos tácticos.  Esta es una traducción libre del topic Using jokedao for soft consensus in governance de @divine_economy Créditos: Traducción @Brigith238 - Revisión @FuchoCrypto ",
                    "links": [
                        "http://www.jokedao.io",
                        "https://forum.makerdao.com/t/using-jokedao-for-soft-consensus-in-governance/17673"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.828571428571428
                }
            ]
        }
    ]
}