{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/endgame-plan-timeline-to-free-floating-dai/17529",
            "title": "Endgame Plan timeline to free floating Dai ",
            "index": 17529,
            "category": [
                "Governance"
            ],
            "tags": [
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "25",
                    "time": "30/08/2022-13:18:53",
                    "content": "In this post I will go over the the basic timeline of the Endgame Plan, including when and under what conditions it is possible that Dai could go free floating. The most important takeaway is this:  Dai will remain 1:1 with USD for at least 3 years The timeline for free floating away from 1:1 with USD would be delayed if there is no immediate authoritarian threat The 1:1 peg with USD would remain indefinitely if the protocol can reach and maintain 75% decentralized collateral During the initial 3 years the protocol will actually double down on RWA in order to accumulate as much ETH as possible, increasing the ratio of decentralized collateral  The “collateral strategy” is what determines the makeup of Dai’s collateral assets, and decides how much RWA exposure Dai will have, including whether going free floating will be necessary. The Endgame Plan proposes 3 different collateral strategies, called Stances, that lie on a spectrum of high RWA exposure to 0 RWA exposure. More RWA exposure enables higher growth, but at the cost of less resilience. The three stances are called Pigeon Stance, Eagle Stance and Phoenix Stance  pigeons1124×619 338 KB  The protocol begins in Pigeon Stance, and the earliest it can switch to Eagle Stance is after 3 years. During Pigeon Stance the protocol uses all of its RWA to maximize its profit potential, and uses all generated surplus to accumulate as much ETH as possible. The protocol by default automatically switches out of the vulnerable Pigeon Stance and into the more balanced Eagle Stance after 3 years, to reduce risk based on the assumption that the authoritarian threat against RWA collateral will grow over time. This is implemented as a “Difficulty Bomb” - it is automatically triggered, but the community can choose to delay it by replacing it with a new difficulty bomb that is further out in the future. Delaying the switch to Eagle Stance and remaining in Pigeon Stance is safe if there is clear evidence that Dai is not in immediate danger of an authoritarian attack to seize its RWA collateral. This will allow the protocol to accumulate even more ETH and is the best choice for long term resilience, if the short term risk will allow it. If the protocol reaches 75% decentralized collateral organically from the accumulation of ETH during Pigeon Stance, then it can switch to Eagle Stance without resulting in Dai going free floating. Phoenix Stance which eliminates all vulnerable RWA exposure is triggered if there is clear evidence of an incoming authoritarian attack, or if one has already happened and all of Dai’s RWA collateral has been seized. In the long run, the protocol can still do RWA collateral even if Phoenix Stance, but it has to be “Physically Resilient RWA” that is not possible to simply seize through a legal or political order by a global authority. This can either be achieved through technical means, such as blockchain-connected, remote-controlled drone ships, or by achieving deep political integration in a stable democracy that ensures protection from selfish political moves through a voter backlash. For this reason, Maker should never stop attempting to do RWA projects, and should always maintain active efforts to evangelize DeFi, RWA and their benefits to people, as this will both enable it to remain in Pigeon Stance longer and become more resilient from ETH accumulation, and it will also enable to eventually deploy Physically Resilient RWA that is long term viable even in a world of severe authoritarian threats and instability. ",
                    "links": [
                        "https://forum.makerdao.com/t/a16z-endgame-thoughts/18412",
                        "https://forum.makerdao.com/t/timeline-del-endgame-plan-para-la-libre-flotacion-de-dai-traduccion/17540",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/14",
                        "https://forum.makerdao.com/t/sourcecreds-bi-weekly-happenings-13/17677",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-13-traduccion/17681",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/15",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-25-31-de-agosto-del-2022/17644"
                    ],
                    "GPT-summary": "The post explains the Endgame Plan timeline for freeing Dai from its 1:1 peg with USD. It proposes three different collateral strategies, called Stances, that lie on a spectrum of high RWA exposure to 0 RWA exposure. The post also discusses the conditions under which Dai could go free floating and the steps that would be taken to ensure its resilience. The post is open to constructive criticism and questions, and it can be audited and reviewed by third parties.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.5037098255280075
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#2",
                    "likes": "0",
                    "time": "30/08/2022-13:51:13",
                    "content": "What about accumulating (smaller portion of Assets) other L1 tokens (Atom, Sol) were DAI and crypto vaults can be created in the future (as part of the L1/L2 strategy). ETH today is an a dominant position but crypto moves fast and maybe in the future it will share market cap with other projects. E.g. today we are unable to serve a large population of smaller ETH holders due to cost-prohibitive vault creation dynamics. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 4.769642857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "0",
                    "time": "30/08/2022-14:12:53",
                    "content": "Endgame Collateral Categories include miscellaneous decentralized assets—including but not limited to Maker Teleport building blocks, sharded vault engines, and synthetic assets. Check out the v3 write-up for more details. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.3392857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#4",
                    "likes": "5",
                    "time": "30/08/2022-14:29:57",
                    "content": "Appreciate this clear and concrete plan/timeline. On this point (emphasis added):     rune:  In the long run, the protocol can still do RWA collateral even if Phoenix Stance, but it has to be “Physically Resilient RWA” that is not possible to simply seize through a legal or political order by a global authority. This can either be achieved through technical means […] or by achieving deep political integration in a stable democracy that ensures protection from selfish political moves through a voter backlash.   This latter possibility is genuinely plausible if DAI/Maker (and other DeFi protocols) is able to grow and eventually achieve widespread adoption. There are plenty of examples of this occurring with other technologies, both in the present and historically - it’s a phenomenon in law and technology known as the Collingridge Dilemma. Essentially, when technologies are new and novel, governments struggle to regulate them because of information asymmetries - they don’t understand the technology or its future impacts. When technologies become widely used, governments then struggle to regulate because social and political support for that tech becomes entrenched. Collingridge’s own example of choice was the automobile. Maker has a long way to go, of course, but I agree with Rune that the possibility alone is a strong reason to continue work on RWA, and extolling the benefits of decentralized finance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.2936259143155695
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#5",
                    "likes": "7",
                    "time": "30/08/2022-14:39:47",
                    "content": "Some consequences of capping RWAs at 25%.   Dai’s ability to scale will be constrained by the amount of decentralized collateral we can safely liquidate.   In the event of a crypto market crash, we could be forced to liquidate quite a bit of RWAs. This will make us less reliable as a business partner and means Dai cannot be a safe haven for capital during unstable markets.   If Dai loses market share in decentralized collateral(for example, Aave outcompetes us on providing leverage), then we will be forced to scale down the protocol instead of pivoting to RWAs.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.841269841269841
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#6",
                    "likes": "1",
                    "time": "30/08/2022-14:59:26",
                    "content": "Thanks Pro. Was going based of the visual.  Screenshot_20220830-105848_Chrome1037×1587 117 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#7",
                    "likes": "2",
                    "time": "30/08/2022-15:52:33",
                    "content": "Thanks for this very easy to grasp timeline. Can you elaborate a bit more on choosing three years as the minimum amount in Pidgeon stance? What if authoritarian RWA seizures happen earlier, or if the protocol can develop attractive solutions to free-float DAI? Can Eagle Stance be activated before the three year mark, or is that a hard cap? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.388541666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Khan",
                    "index": "#8",
                    "likes": "10",
                    "time": "30/08/2022-16:09:03",
                    "content": "Thanks for this clarification and updated perspective Rune. I’ve said it before, but I’ll say it again: I strongly believe that there is an opportunity for Dai to use the Endgame to start commanding a presence at a larger global level without compromising on core principles. The risks of government overreach can’t and shouldn’t be dismissed. And there are certainly other business opprotunities outside of real-world assets that matter. Building foundational system resilience, while pursuing growth through RWA, and with a mitigation strategy in place is exactly the model I think that is needed to get to the next level. Centrifuge has been beating this drum for a long time. We are here for this!  ",
                    "links": [
                        "https://forum.makerdao.com/t/centrifuge-maker-a-partner-s-view-of-real-world-assets/17439",
                        "https://forum.makerdao.com/t/the-path-of-compliance-and-the-path-of-decentralization-why-maker-has-no-choice-but-to-prepare-to-free-float-dai/17466/69"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.386574074074074
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#9",
                    "likes": "3",
                    "time": "30/08/2022-16:17:08",
                    "content": "Hi everyone, have some questions:  Pidgeon instance begins with MetaDAOs? You see this initiating this very same year? Where does the Core Units fit in this instance? What’s the plan for accumulate ETH, negative rates right? In Eagle and Phoenix instances, how do you see people being interested in DAI? Cuz if people are going to be exposed to a “stablecoin” that doesn’t follow any certain value, don’t you think DAI just will lose all its impact?  Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.7857142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#10",
                    "likes": "2",
                    "time": "30/08/2022-19:23:13",
                    "content": "Thanks for the article, there was a lot of FUD over this, especially the potential depegging of DAI, mostly based on lack of knowledge of how Maker works and inaccurate information circulating on the press. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#11",
                    "likes": "4",
                    "time": "30/08/2022-21:04:58",
                    "content": "    Leandro:  mostly based on lack of knowledge of how Maker works and inaccurate information circulating on the press.   You’re too nice. It’s a combination of people being toooo lazy to read a long Forum Post and drill down,  and/or too lazy to attended the DVC calls. Worst, too lazy to watch the replays on YouTube. What can you do brother. People gonna do what people do.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.465277777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xbocaJ",
                    "index": "#12",
                    "likes": "4",
                    "time": "31/08/2022-01:07:37",
                    "content": "I honestly think there would have been more hysterical headlines if reporters had listened through the DVC calls. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/westie",
                    "index": "#13",
                    "likes": "1",
                    "time": "31/08/2022-12:02:42",
                    "content": "Thanks for succinctly clarifying the stance here. I summarized the points in a Twitter thread to share around! https://twitter.com/WestieCapital/status/1564946088037081088?s=20&t=qG0rtYgqyBORbqBHDRu5Lw ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rachel_G",
                    "index": "#14",
                    "likes": "4",
                    "time": "31/08/2022-14:58:06",
                    "content": "    RoFz:  In Eagle and Phoenix instances, how do you see people being interested in DAI? Cuz if people are going to be exposed to a “stablecoin” that doesn’t follow any certain value, don’t you think DAI just will lose all its impact?   I’m wondering about this as well.  I think in DeFi there will be a divergence in protocols as regulators catch up - protocols may either be “super clean” (i.e., pegged to USD, for white-listed / KYC clients only, “regulator-friendly”) or totally algorithmic / agnostic to “TradFi” norms (i.e., not pegged to USD, for any client regardless of capital source).  To the extent regulators lay down the law on DeFi protocols, the former will outperform.  It could be worth maintaining the USD peg in the medium-term (longer than three years), since that’s been core to Maker for so long anyway, and could end up leading to market share grab as other DeFi protocols fall behind. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.016865079365079
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#15",
                    "likes": "1",
                    "time": "01/09/2022-01:08:50",
                    "content": "Free floating DAI? wouldn’t that basically make minting/borrowing DAI through crypto backed vaults obsolete. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#16",
                    "likes": "1",
                    "time": "01/09/2022-02:47:34",
                    "content": "Yeah, I know what you mean. I was thinking more about the people who maybe use DAI but don’t participate at Maker. Your point is even more relevant, for those who are or should be involved the situation is way more serious. IMO, human issues like these are a bigger challenge than financial or regulatory issues. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.696759259259259
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#17",
                    "likes": "2",
                    "time": "01/09/2022-13:27:24",
                    "content": "    rspa:  Thanks for this very easy to grasp timeline. Can you elaborate a bit more on choosing three years as the minimum amount in Pidgeon stance? What if authoritarian RWA seizures happen earlier, or if the protocol can develop attractive solutions to free-float DAI? Can Eagle Stance be activated before the three year mark, or is that a hard cap?   I have the same question that I would love to know the answer to. Three years is a long time, regulations will probably come before that time. What would be Maker’s plan of action in case these regulations become too aggressive? Is there a contingency plan for this case? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.154861111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#18",
                    "likes": "2",
                    "time": "01/09/2022-13:41:23",
                    "content": "    Marian:  What would be Maker’s plan of action in case these regulations become too aggressive? Is there a contingency plan for this case?   The full Eagle Stance / Phoenix Stance dynamic can be understood as a proposed contingency plan. This might help, from the Endgame v3 overview (emphasis added):    Endgame Plan v3 complete overview   Eagle Stance is becomes active after 2.5 years of Pigeon Stance, or in a rare situation where it provides a clear regulatory benefit to not have a 1:1 pegged stablecoin. It is named after the Theodore Roosevelt quote: “speak softly and carry a big stick” Eagle Stance guarantees that Maker’s exposure to seizable RWA is limited to no more than 25%, and to achieve this Dai in unpegged from the dollar if necessary. The result is that Dai is able to survive even the most severe regulatory crackdown or physical attack, but at the same isn’t severing its ties with the real world and is still able to take advantage of RWA liquidity and Clean Money projects that demonstrate the positive impact of letting DeFi flourish.   I’m still thinking about these questions and the extent to which Maker can truly shield itself from regulators (if even 20-25% of Maker RWA was ‘seized’, that still seems like a probable death blow to the protocol). But that’s an answer to your question, still. ",
                    "links": [
                        "https://forum.makerdao.com/t/endgame-plan-v3-complete-overview/17427/1"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.722294372294372
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#19",
                    "likes": "1",
                    "time": "01/09/2022-13:55:20",
                    "content": "25% RWA exposure seems too high for eagle/phoenix stance, today RWAs are less than 2% and we see the community already concerned with this level of exposure. Even a 5% seizure would produce a death spiral. It could be mitigated with concentration limits (counterparty exposure caps) but seems that each deal aims to be larger. Generating yield is important to the protocols liquidity buffer so I think its a great product just pointing out the same risks exist between pigeon and eagle/phoenix stances… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.9944444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#20",
                    "likes": "2",
                    "time": "06/09/2022-23:28:16",
                    "content": "Thanks for this post. Helps to provide some clarification on a topic that has recently received a lot of attention but not always in a precise manner. Let’s go pigeons! I have a couple questions: -Is 25% RWA exposure a realistic goal? I mean, is it achievable in 3 years? -This 3 year minimum window for the depeg to take place, can we get some more clarification on how it was determined? Were the upcoming legal restrictions taken into consideration? I suppose they were, but 3 years seems to me to be a very long time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.743229166666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ClausClowes",
                    "index": "#21",
                    "likes": "1",
                    "time": "07/09/2022-06:21:00",
                    "content": "Is this a one-way street? Say an authoritarian power forces us into a phoenix stance, then by some happenstance that power/threat dissipates completely, would it then make sense to go back to a more vulnerable but growth-oriented stance? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#22",
                    "likes": "0",
                    "time": "07/12/2022-12:21:33",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}