{
    "poll_list": [
        {
            "title": "Ratification Poll for Offboarding Content Production Core Unit (MKT-001) - January 10, 2022",
            "index": "12058",
            "option": "Yes",
            "supporting_mkr": "43,217",
            "highest_fraction": 0.49
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip41c5-sp3-facilitator-offboarding-mkt-001/12058",
            "title": "MIP41c5-SP3: Facilitator Offboarding (MKT-001) ",
            "index": 12058,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "core-unit",
                "cu-offboarding",
                "archive-mkt-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#1",
                    "likes": "4",
                    "time": "08/12/2021-00:51:38",
                    "content": " MIP41c5-SP3: Facilitator Offboarding (MKT-001)  Preamble MIP41c5-SP#: 3 Author(s): Deimos Contributors: Tags: core unit, cu-mkt-001, facilitator, personnel-xboarding Status: Accepted Date Applied: 2021-12-08 Date Ratified: 2022-01-24 Ratification Poll URL: https://vote.makerdao.com/polling/QmYk1XN5   Sentence Summary This subproposal is to offboard the current Facilitator of the Content Production Core Unit (MKT-001).  Specification  Motivation Experiments are great in every organisation. This becomes truer for web3 and truest for MakerDAO. That being said, when an experiment is not killed on time, it becomes a money pit. Several strong reasons indicate that this is a good time to release this team from their duties:  Lack of Quality This point might be hard to qualify or quantify. If anyone is astonished by the quality of this team, please let know. Several examples of great videos can be provided if needed. World-class. The quality that Maker deserves.  Lack of Speed This team has produced two (arguably unremarkable) original videos since they started: Wormhole and How To Vote. The rest is just the G&R call remixed and rebranded in 7 different flavors. The Meme Wizard has several Xs impact with a fraction of the budget.  Lack of Accountability and Understanding A myriad of examples can be presented where this team has not stepped up to the occasion and offered yet another reason. Missing all the important cryptoevents is one that was mentioned in the past. If necessary, an “anon box” can be set in place to allow others to share experiences.  Lack of OKRs No transparency, no Objectives, no Key Results, nothing to evaluate this team against. This has been going for months and they haven’t changed (or even acknowledged this). Their content has no metrics attached. They aren’t judging what works and what doesn’t. They aren’t trying new things.  Lack of Proactivity They aren’t reaching out to other Core Units to produce content that matters. No videos from all the features coming out from PE-001, or ORA-001, nothing from the partnerships from Growth (and most likely several are being left out: because we don’t know what a good MKT team could achieve).  Lack of Trust This team seems to be getting trust and support from David U (assumption: they are friends from their times together at the Foundation) and from LongForWisdom (no assumption here: as any non matter-of-factly comment will be heavily frowned upon and also they are really really nice). Have yet to find a team that relies on them.  Not a Social Club These are great friendly guys, but we need to look past our friendships and seek what’s best for the DAO.  Not a New Team This Core Unit wasn’t new to the DAO when they started their mandate. The Foundation spent thousands bootstrapping their activities and funding the different members. This means that they have had their fair share of time to get the show running, to hire the needed people, and to start delivering results.  Conclusion After over a year of what many consider a lukewarm attempt, we need to remove this team to allow for space so that other teams can grow into it. This team representing Maker is enough to discourage new talent from joining the DAO. The quality bar needs to be several feet higher.  Core Unit ID MKT-001 ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-december-2-9-2021/12119",
                        "https://forum.makerdao.com/t/content-production-core-unit-offboarding-post-mortem/13756",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/21",
                        "https://forum.makerdao.com/t/relay-semanal-11-al-17-de-enero-2022/12712",
                        "https://forum.makerdao.com/t/weekly-relay-january-18-24-2022/12829",
                        "https://forum.makerdao.com/t/relay-semanal-18-24-de-enero-de-2022/12876",
                        "https://forum.makerdao.com/t/monthly-governance-review-january-2022/13052",
                        "https://forum.makerdao.com/t/a-letter-to-the-cus-on-community-impatience-and-trust/14560/18",
                        "https://forum.makerdao.com/t/deprecated-mip4c2-sp15-core-unit-offboarding-process-amendments/12920",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/11",
                        "https://forum.makerdao.com/t/mip4c2-sp15-core-unit-offboarding-process-amendments/15291",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-10-de-enero-de-2022/12561",
                        "https://forum.makerdao.com/t/weekly-relay-january-4-10-2022/12544",
                        "https://forum.makerdao.com/t/weekly-mips-update-68/12460",
                        "https://forum.makerdao.com/t/weekly-mips-update-67/12387",
                        "https://forum.makerdao.com/t/weekly-mips-update-66/12190"
                    ],
                    "GPT-summary": "The post is a subproposal explaining the offboarding of the current Facilitator of the Content Production Core Unit (MKT-001) due to several reasons such as lack of quality, speed, accountability, understanding, OKRs, proactivity, and trust. The author provides constructive criticism and negative feedback on the team's performance, and the post can be considered an audit and review of the Core Unit's activities.",
                    "GPT-proposal-categories": [
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.966966173361522
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#2",
                    "likes": "4",
                    "time": "08/12/2021-05:10:33",
                    "content": "I haven’t seen any content that stands out off the top of my head right now, or that made me take time out of my day to watch, which I believe would be the goal of a content team. That said, I’m open to rebuttal if there are explanations for the lack of performance here and a plan to improve going forward. Otherwise this makes sense to me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.309523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "7",
                    "time": "28/12/2021-16:30:50",
                    "content": "So I was waiting for Seth to respond, but based on his comment on the other thread, I don’t think he will. Here’s my 2 cents; I care little about friendship and more about supporting a team who is working hard and establishing their way of making impact. I support the team because I think it’s more valuable to help guide and build rather than tear down and replace. That being said, the primary thing I think the team needs to do better is transparency around their mandate, roadmap, OKRs, and addressing performance concerns. In fact, I think some of those same things about my own team, COM-001, and we are working towards it as I imagine MKT-001 is too. I understand where the frustration is coming from and I think several things should be considered:  Facilitators have a disproportionately large and complex role. Not only do they have to handle the administrative work to service their Core Unit, but they also have to develop and lead the vision for their team both internally and externally, they have to oversee the various projects and help problem solve within each of them, they also oversee each individual team member’s performance and professional development, and they have to plan ahead with regard to proposals and team expansion or reduction. The content team started with the assumption that a parallel Marketing team would be born, with seasoned ex-foundation Marketing and BD folks, who could partner and guide Content Production to some extent. When that didn’t happen I believe a lot of undue expectations began to fall on Seth and his team. Good work takes time. Shifting a mandate takes time. Deciding how to clearly present it takes time, especially given the first point I made. Although some people aren’t “new”, other members of their team are. Not only that, but the Core Unit itself is quite new and I believe needs a solid few quarters to get into a healthier groove.  Personally I think there should be intermediate steps before offboarding Core Units and their facilitators. I’ve long been in support of a sort of “Oversight” core unit that can help address/audit performance concerns and serve as a general accountability function. Anyway, happy holidays! I think we all have a lot of growing to do this coming new year and I’m excited for it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.61179604929605
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#4",
                    "likes": "3",
                    "time": "29/12/2021-00:05:07",
                    "content": "My observations from reading through this thread and hearing rumblings around the DAO re the Content Production CU – people are upset because, as they believe, there have been little, if any, “impactful” results reported on the CU’s activities or accomplishments. For instance, there’s no blog with updates; there are no coordinated campaigns on Twitter (Content CU is not involved in Maker Growth’s tweets afaik); there are no conference focused campaigns that I know of; and there seems to be a black hole when it comes to what exactly it is this team does all day. Couple these impressions with the considerable funds allocated for the CU, and, accordingly, it’s easy to understand why some people may be angry, frustrated and ready for change. Although I agree with what Deimos writes, I think there is a minor correction of note: I do not believe the Content Production CU had anything to do with the Foundation. That’s important since there is no “continuity” between the Foundation’s efforts and what this team is doing (or aims to do). But, in my opinion, this development is positive because the Content CU should find a voice for MakerDAO separate and apart from what the Foundation established. If anything, doing so will reiterate our independence from that group. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.002926997245179
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#5",
                    "likes": "3",
                    "time": "29/12/2021-03:27:59",
                    "content": "The senior Content Production team members, Seth and Jerry, were contributors working with the community development team at the Foundation. Their work was primarily around the content and design of Makerdao.world, now they are rebuilding a part of the site to fit the team’s(and Maker’s) blog and content output needs. They also participated in a weekly call with Foundation marketing and comms folks for knowledge sharing and wisdom seeking. They were not members of the Foundation in a full time capacity, but did receive compensation for various contributions and working with foundation members. I’ll let them share what else I might be missing, I wasn’t facilitating their contributions at the time; rather Amy Jung was, so I have a fuzzy memory about all the details of their contributions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#6",
                    "likes": "2",
                    "time": "29/12/2021-04:24:16",
                    "content": "Thanks, and I stand corrected. But knowing this information actually makes Deimos’s concerns ring more true: the Content CU has had incredible advantages vis-a-vis anyone simply starting a new CU and appears to have squandered what they were given (at least that seems to be an ongoing concern from some people). I suppose we’ll see how this plays out when the governance poll is up. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.116477272727272
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#7",
                    "likes": "2",
                    "time": "04/01/2022-18:45:23",
                    "content": "    Davidutro:  So I was waiting for Seth to respond, but based on his comment on the other thread, I don’t think he will.   For reference, I believe David’s referring to this post and yes, based on the fact that our most recent budget passed with 100% support and no delegates have expressed concerns to me since these were posted, I haven’t felt it was appropriate. With regard to the points that have been expressed around OKRs/KPIs/etc., what CU has published these in a detailed manner? I remember there being discussion around this around the time that some of the early CUs were getting off the ground and got the impression it went unresolved because no CU wanted to be the first to make a commitment: “Why should I take responsibility if nobody else is going to?” This isn’t to say that CUs shouldn’t take responsibility or be strategic in their operations, but it’s worth taking into account the places where incentives make it systemically difficult to do so. If anyone has ideas about how CUs should collectively navigate this issue, we’re happy to help work toward a reasonable solution.     Davidutro:  The senior Content Production team members, Seth and Jerry, were contributors working with the community development team at the Foundation. Their work was primarily around the content and design of Makerdao.world, now they are rebuilding a part of the site to fit the team’s(and Maker’s) blog and content output needs. They also participated in a weekly call with Foundation marketing and comms folks for knowledge sharing and wisdom seeking.   To clarify a couple of points here, Jerry and I both worked on grants from the Community Development team that was funded by the Foundation but neither of us have ever been employed or contracted by the Foundation. We participated in several calls coordinated by @twblack88 to try and communicate with the Foundation’s MarComms team but legal restrictions kept them from sharing anything of substance. As far as transparency goes, the Content team does just as much any other Core Unit to provide transparency and offer opportunities for community members to learn more about what we’re doing, ask questions, and make suggestions. We will continue to address any concerns or constructive criticism when raised in a reasonable manner. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.075
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#8",
                    "likes": "2",
                    "time": "05/01/2022-16:48:49",
                    "content": "    Davidutro:  The content team started with the assumption that a parallel Marketing team would be born, with seasoned ex-foundation Marketing and BD folks, who could partner and guide Content Production to some extent.   what?  if govalpha goes dark govcomms could still survive i hope?     Davidutro:  I believe needs a solid few quarters to get into a healthier groove   how many quarters do you propose to get into groovy mode? by estimate over 1MM has been given to MKT-001 to find groove     Davidutro:  Personally I think there should be intermediate steps before offboarding Core Units and their facilitators.   this screems like corporate hr for underperformer core units if maker wants to be a social club or charity than yes thank you for your comments @seth and clarify that you weren’t employ     seth:  “Why should I take responsibility if nobody else is going to?”   imo this attitude summarieses the attitude maker can’t accept this is not personal other core units aren’t perfect and i’ll rise awarenes if this vote pass if vote doesn’t pass i know that it is not wanted by community i want to formally submit the 2 subproposals @blimpa ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.580128205128205
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#9",
                    "likes": "5",
                    "time": "12/01/2022-03:30:57",
                    "content": "    seth:  We participated in several calls coordinated by @twblack88 to try and communicate with the Foundation’s MarComms team but legal restrictions kept them from sharing anything of substance.   I think it might be helpful to articulate some of the ways this unit has overcome being set up for failure from the beginning, due to the decentralization of our particular initiatives. Some of which lies squarely on my shoulders and most of which was actually circumstance/timing.     Davidutro:  Their work was primarily around the content and design of Makerdao.world, now they are rebuilding a part of the site to fit the team’s(and Maker’s) blog and content output needs.   This is the part that’s my fault. We put almost a year into designing a git-based CMS portal for community-generated content that required significant overhead. This would have been great for this team with the adjacent support: tech ops fully running, a marcomms team owning makerdao.com/blog, and gov comms fully humming along with twice the staff. That’s the environment the portal was designed to function in. I lead the creation, build-out, launch, and curation of the tech and content really polished the thing into a useable website. Had we nailed the transition, the portal would have served and been a resource for the community to create content; specifically aimed at growing and speaking from/to the community.  Wha happen? Sadly, we moved a little quickly closing the department and in that grinding process stuck content with an almost unusable tech stack, a lead engineer who quit, and a designer who moved on. I’d be remiss if I didn’t admit that my failures to transition that project doesn’t weigh heavily on my shoulders. Yet, this team took it in stride. Because its completely revamped version isn’t ready they just keep getting called out, which is annoying, to say the least.  Supporting Our Teams… not roasting them I think this thread has some wake-up calls and should the content team wish to become the marketing team there is some hand waving at possible metrics to show the community that they can execute in that capacity ( I’m really stretching here trying to be polite). This would require so much more facilitator work, and that really needs acknowledgment. Facilitating is SO MUCH WORK, pivoting your team’s mandate?!?!? Yeesh. I’ve spoken with this team at length about work visibility, they’re well aware and have been working to make their initiatives and progress more obvious. Maybe try reading their updates? Again… they got hamstrung by many different forces, yet continued to soldier on in their mandated capacity for much cheaper than any agency, department, or team would have. Meanwhile, our community did little to nothing to support them along the way. Who here can say they have provided actionable feedback? subscribed to their newsletters? Shared wild ideas for new content streams? Reached out to partner around their Core Unit activities?  Sent them ideas to post on twitter? Or even followed their accounts? Looks like not many, which is a shame and that’s on all of us. You could steelman that argument and say it’s on content to ask for this engagement, and that would be somewhat fair… Yet, it’s a pareto principle if we all want this project to grow. I’m seeing where the 80% lands, are you anon?  Let’s define offboarding better. Both of our offboarding threads so far have been poorly handled (well, until @bainpm came in for a graceful handover…) I’m quite disappointed I have to waste gas and my time on this offboarding. ",
                    "links": [
                        "https://forum.makerdao.com/tag/cu-update",
                        "https://forum.makerdao.com/t/content-production-bi-weekly-update-1-3-1-14/12693"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.391121581670362
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#10",
                    "likes": "7",
                    "time": "12/01/2022-05:24:08",
                    "content": " My observations from reading through this thread and hearing rumblings around the DAO re the Content Production CU – people are upset because, as they believe, there have been little, if any, “impactful” results reported on the CU’s activities or accomplishments. For instance, there’s no blog with updates; there are no coordinated campaigns on Twitter (Content CU is not involved in Maker Growth’s tweets afaik); there are no conference focused campaigns that I know of; and there seems to be a black hole when it comes to what exactly it is this team does all day. Couple these impressions with the considerable funds allocated for the CU, and, accordingly, it’s easy to understand why some people may be angry, frustrated and ready for change.  This is correct. Scientific Governance and Core Unit Management Maker has always distinguished itself in its desire to manage through science or scientific governance. Science itself is the pursuit of understanding. In the natural sciences, science focuses on acquiring an understanding as the empiric. The empiric uses empiricism, which is built on the idea that knowledge is valid and can be acquired through observation, or direct sense experience that can be agreed upon mutually by numerous observers (consensus). What this looks like in MakerDAO is an agreement to using Data or more “objective” measures to arrive at an understanding to support decisions and action. The interpersonal benefit of the empiric is that it helps us all align on common bases of information, potentially leading us all into agreement and more natural conclusions. The benefit to management is that it helps groups navigate, coordinate resources, and avoid conflict. Data and scientific governance also provides us a way to make sense of disagreements and in the event of disagreement, come to a mutual understanding of respective positions and the reasoning/logic. This helps create a polis or a common center for discourse. Of course, data does not always lead us perfectly to our conclusions, data itself is subject to interpretation or story by the scientist and their unique individual perspective. We will put that aside for now. Scientific governance was a novel idea in crypto. Maker first applied it to peg management. The various community members would convene and evaluate where the peg is (under/over), what the end goal is (to get on peg), and then agree on chain to implement the various levers with an anticipated outcome ( supply or demand adjustments via SF Rates/ DSR/ etc) . If the outcome was not as desired or expected, another attempt could be made the following week to help bring the peg back to par. There was agreement and disagreement, but everyone would understand the logic and recommendations made by each party. The experience was fundamentally collaborative and all incentives were aligned (keep the peg!). This was scientific governance in the sense that, “knowledge is tentative and probabilistic, subject to continued revision and falsification.” Again, the objective of science here was to use available information and reasonable predictions to evaluate an outcome. A hypothesis was made and either invalidated, or not. The benefit of this process is that it helps us understand what we expect, and if things do go as planned, to interpret the results and revise our hypothesis. In the same way, KPIs are scientific governance, they allow us to negotiate what we expect ( a hyopthesis) and if things go as planned, okay, if not, they allow us to look at results, revise, draw inferences and conclusions, and then direct our next course of action. A major issue is that these support core units have failed to establish clear mandates, objectives, and KPIs, hence evaluating their performance is near impossible. With an issue like content production, it is serious because the spend is high and the absence of a strategy and metrics, problematic. KPIs and Core Unit Management KPIs are data. They are “key performance indicators.” What does this mean? They are objective metrics, either quantitative or qualitative, that can be agreed upon and observed. A set of different observers can arrive at a consensus and agreement as to whether or not they were met. For example, a KPI could be : Launch a Dai bridge to Starknet. This goal, can be defined, a milestone and date can be assigned, and we can agree if it happened as planned, or not. By the same token: Have 10mm Dai use the stark bridge this year allows us to easily review the KPI. Did this happen, did we hit our mark? If not, why not? KPIs provide data, and data provides common ground for discussion and the evaluation of performance and scientific governance. Said again a different way: KPIs allow for an agreement and understanding of performance and expectations. It allows for analysis as to the source of underperformance or failure, or in positive cases, allows management to evaluate overperformance. KPIs are negotiated. There are two stakeholders, one performing the work (the core unit) and one requesting the work (community/DAO). The CU pushes to make sure they can deliver, the community is responsible for negotiating ambitious KPIs, pushing the teams to be more aggressive (while also creating risk they fail to deliver). Once the KPIs are agreed upon, they can be evaluated. Some less ambitious ones may be met, some more ambitious KPIs may fail. This is part of the negotiation between the management and the team. Both sides are responsible for selecting reasonable goals and communicating expectations on each KPI to each other. After the performance cycle, scientific governance may then occur. A CU may be retained or dismissed, KPIs may be adjusted for next cycle, etc. Content Production KPIs While content production has been delivering work and various events, AMAs, etc. The work, in practice, is for naught, which adds to their frustration. The main reason is the absence of a strategy and KPIs. Without understanding what they are moving toward and how they will be measured, their work is unable to be sold as clearly progressing their program. A program which should be agreed upon and negotiated between CU and DAO. Now, the DAO is unable to ascertain their performance (or under-performance) because they did not set a strategy or KPIs and the DAO did not accept and agree with their proposed plan and benchmarks. It would be appropriate to review and discuss what Content Production promised to do upon funding and what KPIs they established at their Core Unit inception:  Roadmap The primary focus of our first three months will be to [sic] During this period, team members will continue lending support to projects like: •\tMaker Relay (Written 4 and Audio 4) •\tThe Community Portal •\tThe Community Blog (coming soon)   Month 1: Setup and Coordinate •\tIncorporate and set up administrative operations (payroll, etc.) •\tImplement a Request For Content (RFC) process •\tWork with the Legal Core Unit to determine legal limitations on content and needs with regard to IP (copyright/trademark/TOS). •\tWork with other Core Units to surface content-related needs and coordinate the management of MakerDAO’s digital properties, including, but not limited to: o\tMakerDAO.com o\tMaker Blog o\tYoutube o\tTwitter   Month 2: Strategize, Execute, and Renew •\tDevelop a content strategy based on organizational goals, define KPIs to measure the effectiveness of our efforts, and determine staffing needs •\tHire content creators and onboard them with Opolis •\tStart producing and distributing content •\tReport on our progress submit a budget proposal to continue our work   Month 3: Produce, Report, and Renew •\tProvide feedback to RFC on the budget proposal •\tContinue producing content and reporting results  I have not done an in depth review on each line item. To be fair, few of the support core units have clear strategy and KPIs. However, content production explicitly promised to produce KPIs and a strategy as a central deliverable.  Further funding was to be contingent on this strategy and the costs were supposed to be tied to the explicit delivery of this strategy and its milestones. This was a reasonable path forward amidst uncertainty. Unfortunately, it does not look like negotiation and acceptance of a strategy and KPIs occurred. Both the community and content production forged ahead with funding despite lacking an understanding and agreement as to what was to be delivered. Ideally, the concerns raised above regarding KPIs would have been addressed by the end of month two as proposed (June 2021) and agreed upon at the renewal of funding (July 2021). Though no KPIs were produced and agreed upon, the budget spend was approved and significantly increased through May 2022. It is now January 2022, and we find a recurring large budget spend (~140,000.00/month with contingency) with no strategy and no way of measuring the success or utility of the spend. The core unit has been operational since May 2021, with approximately 8 months live. From a management perspective, operating a group with no strategy nor KPIs is problematic, regardless of the whether content production is retained or dismissed. At the same time, the community must hold itself somewhat responsible for failing to press on content prod for KPIs and a clear strategy prior to renewing the funding. The best course of action seems to fund content production through February, with the expectation they deliver on all the deliverables originally promised at “Month 3” at time of funding (Originally June 2021, Now February 2022). This would provide them two months of funding, as was done on inception, to deliver on work products previously promised, most importantly:  •\tDevelop a content strategy based on organizational goals, define KPIs to measure the effectiveness of our efforts, and determine staffing needs.  At that time, a further budget proposal could be approved for March and April to support executing on the strategy until May 2022. This proposal would include, objectives and KPIs agreed upon by both the DAO and the community. This would allow the community and Content Production to measure their performance. First, it would allow for DAO to determine if content production performed through February and be confident funding its next proposal. Is there a clear and coherent strategy with clearly measurable KPIs for Content Production? Second, It would also allow the DAO to determine performance for the following quarter (Q2 2022) using the agreed upon KPIs in the strategy. This format would allow for the DAO to approve a new budget proposal in Feb 2021 for additional funding to cover Q2 2022. Under such a structure, it would be clear whether this is a good fit, and both sides could squarely carry their own responsibility. At the same time, the DAO gets valuable experience negotiating KPIs with core units and holding them accountable for their performance, regardless of a positive or negative outcome. By doing the above, we could re-align incentives and avoid any future conflict as there are no surprises or emotional reactions, and everything is instead data driven as the empiric. In short:   By Feb 2022, content production either has the capabilities to produce a strategy and clear KPIs, or not.   If they are able to produce the KPIs and strategy, they can make their case for funding to execute on them in Q2 2022. If not, they were well paid the entire time for their work, no hard feelings and everyone has been treated fairly with no surprises.   If content production is funded through Q2 2022, prior to approval of a Q3 2022 budget there would be appropriate measures to evaluate performance, which remedies the current unfortunate situation.   At the same time, during this process,  Content Production may realize Maker is not a good fit for them or their skillset and capabilities, or maybe that the increased accountability in the DAO doesn’t work for them. They could always opt to restructure their core unit, join another CU, or even decide Maker is not the best place for them and find work elsewhere. The goal is to be fair, charitable, and responsible. Conflict is to be avoided, as is waste. Transparency and accountability are vital. Let’s go. ",
                    "links": [
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform/9366/42",
                        "https://forum.makerdao.com/t/mip4c2-xx-core-unit-offboarding-process-amendments/12920/3",
                        "https://forum.makerdao.com/t/video-producing-under-mip41c5-sp3-facilitator-offboarding-mkt-001/12654/6"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.501786072646999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#11",
                    "likes": "1",
                    "time": "13/01/2022-00:50:03",
                    "content": "Excellent. I like responses like this. Forward-thinking, objective, and solution-focused. Thank you for the metered and well-articulated response @MadShills . A bit of accountability on all ends and recognition of learnings is the best outcome. I think your response strikes a happy medium of getting all three directions articulated. The DAO needs to speak up earlier about things in an objective way while moving back towards the scientific governance that we’ve built this community on. We’ve lost our way, myself included. Your post strikes this amicable path forward, which is much preferred.     MadShills:  The goal is to be fair, charitable, and responsible. Conflict is to be avoided, as is waste. Transparency and accountability are vital.   Plus one on this approach, what do you think @flipflopflapdelegate? just saw your thread and I think this strikes a happier middle ground. ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-and-risk-198-thursday-july-07-at-17-00-utc/16370/3",
                        "https://forum.makerdao.com/t/weekly-mips-update-94/16330",
                        "https://forum.makerdao.com/t/weekly-mips-update-88/15329"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.571428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#12",
                    "likes": "2",
                    "time": "13/01/2022-02:02:12",
                    "content": "    twblack88:  Plus one on this approach, what do you think @ElProgreso? just saw your thread and I think this strikes a happier middle ground.   Hello Tim, After some deep soul searching and thoroughly thinking about the individuals of MKT-001, Flip Flop Flap Delegate has already made the decision to Vote YES to off-boarding because of the reasons posted here. Assuming more MKR token owners vote in the same direction, we continue to support the individual team members and urge them to talk to SES and seek a path forward. However, there are MANY MKR token owners that can still vote in the opposite direction. We believe MKT-001 is composed of team members that have an abundance of talent. But at the moment we believe their talent is not being showcased correctly. And believe me, we know that we could be totally wrong and MKT-001 members will go on to become some of the most talented & productive Content producers & Marketing influencers on planet Earth. But when thinking in bets, we are betting that the moment is not right now. Again, if MKR token owners decide to off-board MKT-001, we recommend that team members of MKT-001 consider incubating via SES, or consider reinventing the team that they originally had envisioned and help MakerDAO exceed and excel beyond greatness. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.805059523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#13",
                    "likes": "0",
                    "time": "15/01/2022-19:08:43",
                    "content": "@ultraschuppi can u provide insight in your vote please it’s not sarcasm ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#14",
                    "likes": "1",
                    "time": "20/01/2022-16:00:06",
                    "content": "There are still 4 days until the end of this vote. Seeing as the vote is very close and has a chance at passing, is there an identified/recommended Interim Facilitator who would replace Seth? My understanding is that although the Facilitator may be removed, the Core Unit itself cannot be removed while having an active budget implementation.  A Core Unit can only be removed if it has no active budget implementations (see MIP40) and no active facilitators (see MIP41). (From MIP39c3)  So the next step if it passes is for the existing facilitators to select an Interim Facilitator and to wind down the team or to consult the community about what the transition should be? Just confirming the order of operations if this vote passes based on the MIPs    The Fallback Decision Process must occur. This is where a simple majority of all currently active Facilitators have to reach an agreement on the Interim Facilitator.  A Transition Process happens where the Community must work together to “transition over the critical responsibilities that must be maintained to continue operations.” I assume this also means deciding whether to repair or remove the CU via…Signal Polls? In parallel, to continue paying the existing team members a Budget Implementations Transition needs to happen. This involves a handover of the budget implementation access to the interim facilitator or some other workable solution. How would this work in the case of MKT-001?   @LongForWisdom @prose11 ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP41#interim-facilitators",
                        "https://mips.makerdao.com/mips/details/MIP39#MIP39c3",
                        "https://mips.makerdao.com/mips/details/MIP41#the-fallback-decision-process",
                        "https://mips.makerdao.com/mips/details/MIP41#the-transition",
                        "https://mips.makerdao.com/mips/details/MIP41#budget-implementations-transitions"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.91087962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#15",
                    "likes": "1",
                    "time": "20/01/2022-16:59:49",
                    "content": " MIP40c3-SP49 removes all and any active budgets for the Content Production Core Unit — Dai or MKR. MIP41c5-SP3 offboards the current Facilitator of the Content Production Core Unit (MKT-001).  If these MIPs  pass the executive, it appears both criteria are met to offboard, no facilitator and no active budget. No transition process or budget transition is required since no replacement is contemplated as part of these MIPs since it is clearly a set of offboarding proposals. It would also appear there are no business critical functions that need to be transitioned from this core unit, if so, there appear to be both contingency and excess funds that could be used to compensate during a short bridge if needed. If incorrect someone from GovAlpha can come in, but it is pretty clear if this goes through content production as composed is no more. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.074074074074074
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#16",
                    "likes": "2",
                    "time": "20/01/2022-18:35:45",
                    "content": "Ah yes, I didn’t realize there was also the budget removal proposal in there. My bad.     MadShills:  It would also appear there are no business critical functions that need to be transitioned from this core unit, if so, there appear to be both contingency and excess funds that could be used to compensate during a short bridge if needed.   COM-001’s emails will need to be transitioned to our own server or an alternative (maybe @makerdao.network). We currently use the @makerdao.world email server which is managed by MKT-001. We will likely transition to our own anyway. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#17",
                    "likes": "0",
                    "time": "20/04/2022-18:35:47",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/video-producing-under-mip41c5-sp3-facilitator-offboarding-mkt-001/12654",
            "title": "Video Producing under MIP41c5-SP3: Facilitator Offboarding (MKT-001) ",
            "index": 12654,
            "category": [
                "Core Units",
                "Core Unit Archive"
            ],
            "tags": [
                "cu-offboarding",
                "archive-mkt-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/jmarshall",
                    "index": "#1",
                    "likes": "14",
                    "time": "14/01/2022-18:24:36",
                    "content": "@Recognized-Delegates @GovAlpha-Core-Unit As the video producer in content production I cannot remain silent on this situation. First, because this has become an incredibly frustrating environment to work in and I do not blame my CU facilitator @seth one bit for that, and second, that this situation is going to lead to an significant loss of opportunity and resources for the DAO and I do not see anyone, anywhere on these forums addressing this. . . @flipflopflapdelegate  Screen Shot 2022-01-14 at 10.53.02 AM1418×208 28.3 KB  We are literally about to film the very content we were criticized for not providing and you’re going vote to offboard us right before ETHDenver less than two months after approving our six month budget? We have planned and set in motion the following content to be filmed in 4 weeks: promotional video showcasing Maker’s presence at ETHDenver including highlighting growth’s offsite event and our CU’s offsite event, sit down interviews for short documentaries and social media cutdowns, and photography. I already have crew and transportation booked, equipment quotes and commitments from vendors, an off site venue for filming interviews secured, shot lists, shooting schedule, question lists etc.). This is in addition to the venue and offsite event booked, planned, and catered by our CU with efforts lead by @JerryAG. Personally, this whole situation has the potential to hurt my reputation with the filmmakers I’ve hired for this content, something I take very seriously. I know this isn’t going into anyone’s decision and it’s not personal, but it is important to point out the work situation this is putting me in as an example of what it’s like on the inside. Since on the outside, there’s a lot of talk on the forums that these situations are harmless, or even productive. This entire MIP is a lose-lose. If it gets voted NO: Yay we get to keep our jobs! But with a serious impact on our productivity. We’re in a complete hiring freeze, I still have no assistant, and it’s impacting our ability to plan for ETHDenver content. It also gives our core unit legitimate leverage against complaints of our performance at the next budget cycle, and who wants that? I loathe excuses. If it gets YES: then all the money and resources poured into the ETHDenver content goes down the toilet and a wonderful opportunity goes with it. @flipflopflapdelegate  Screen Shot 2022-01-14 at 10.48.58 AM1424×170 18.1 KB  That’s a kind offer to some of our members and I appreciate that our talent is recognized. However, even if another CU would like to retain any of our talents, it still leads to this massive loss of content and resources at ETHDenver. There’s no way around it. I fail to see how this offboarding proposal benefits anyone. Offboarding proposals are not a painless process for CUs and have consequences for their work. The benefits of putting units in the hot seat are already laid to bare everytime they’re on the chopping block with their budget proposals. There comes a time to allow a group space to work and grow. Criticism does not need to come in the form of offboarding proposals and could be addressed in positive, constructive ways. If the DAO decided to not renew our next budget proposal and offboard us at that time, I can understand that. Obviously, it’s up to MKR holders and delegates to decide which CUs bring value and which do not. At least at that point in time, we had the chance to complete a large amount of the content we sought out to create and were requested to create, and overall, the DAO would have a much better amount of content to judge our unit against. This is literally clipping our wings just as we are about to fly. Let alone that this is the very type of content I’ve been looking forward to producing since I started. Video production takes money and time. For reference, see my previous post. I would also like to add that I believe our unit’s work is mischaracterized by certain individuals and myopically viewed by others. Before commiting to a decision, I recommend looking at our unit holistically as we are talentally diverse and provide value in very different ways, often beyond the definition of “content production”. I fear this value will only be apparent in our absence. Despite the claim there are core units who do not trust us to my dismay, there are most definitely core units who do value our work and support. And much of that support is not getting translated. I’m proud of the work we do, the hurdles we overcome, and every member of our unit. I stand by all of them. Since we’re staring down the barrel of an offboarding proposal, I do not want to end on a negative note or coming off disgruntled. I’d be remiss without saying thank you to all the wonderful people I have worked with in the DAO and those who have stuck up for us. Despite this situation and no matter how it turns out, I was still happy to have time here at Maker. No regrets. It challenged me in new ways and forced me to think radically different from traditional media and I got to meet some great people along the way. This is a special community; everyone here knows it. So sincerely thank you to everyone for that. ",
                    "links": [
                        "https://forum.makerdao.com/t/delegate-compensation-calibrate-to-a-single-person/12679"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Change to proposal pipeline",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6235076772186146
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "9",
                    "time": "14/01/2022-18:48:36",
                    "content": "Really, REALLY appreciate this post @jmarshall as it puts some real personal and business color on the people and professional level effects of ‘offboarding’ in this fashion.     jmarshall:  This entire MIP is a lose-lose. If it gets voted NO: Yay we get to keep our jobs! But with a serious impact on our productivity. We’re in a complete hiring freeze, I still have no assistant, and it’s impacting our ability to plan for ETHDenver content. It also gives our core unit legitimate leverage against complaints of our performance at the next budget cycle, and who wants that? I loathe excuses. If it gets YES: then all the money and resources poured into the ETHDenver content goes down the toilet and a wonderful opportunity goes with it.   This I think is a critical point which shows how much damage was done bringing these offboarding MIPs out of the blue.   Honestly it is going to make me want to suggest changes to the process on these.   Meaning no offboarding MIP should be taken seriously by any CU until some sort of forum post is put up explaining issues someone may have with a CU unit that allows the unit or person to address.   Literally unless a CU is affecting critical business operations in a negative way MakerDAO needs to stay the course with onboards (EVERY SINGLE ONE OF THEM being allowed a fixed amount of time (determined in advance in the onboarding MIP) to prove themselves.  Sure governance or anyone can be critical but literally once MakerDAO makes a choice to onboard these people need to have a reasonable amount of time to get up to speed and a reasonable and mutually agreed set of goals to be met in the alloted period. This means:  Onboarding anything should undergo a stringent vetting process including a time frame and mutually agreed set of performance goals. When nearing the end of the agreed time frame a CU performance review should be undertaken by the community to determine if the CU has met expectations and whether it can reasonably be expected to continue or whether the unit or particular members have failed and need to be offboarded.  From my own delegate comments:    MakerMan delegate platform   ABSTAIN - As one who has friends and peripherially worked in media production in the past I realize that 6 months probably isn’t a fair look at what this group can accomplish   At this point given the statements above I am not even sure me switching to NO will change this.  But in light of my own comments above - and what we saw with @SebVentures as well I think MakerDAO should take a serious look at what kind of timelines and performance metrics are going to be laid out for onboarding CUs because frankly if I am looking to onboard as a CU at Maker the above activities would scare the hell out of me, and should scare the hell out of every CU at MakerDAO because if anyone can for whatever reasons propose a MIP to offboard without a single poll or at least a reasonable objective fair and critical discussion of performance or lack thereof Maker is going to get quiet and unproductive very quickly. This literally creates a passive aggressive work environment which we all should want to avoid at all costs. We need a much nicer process to bring CUs under performance examination lights and a well defined process for how to first have a critical objective discussion (for how long), and then to poll the community (for how long), before we finally move to a formal MIP to remove a person or a CU and removal (with certain exceptions) should not be even possible until near the end of the trial/performance period. If there was one discussion I think MakerDAO needs to have at the next Governance Call it would be how we as a collective group want to handle this as a process so everyone ends up with equitable treatment, and anyone can bring up questions in a way that is healthier for everyone involved and MakerDAO generally vs. this attack defend approach that is now being employed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.537287903667214
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "7",
                    "time": "14/01/2022-19:47:13",
                    "content": "Hey J–thank you for posting a response to the Delegate Pre-Vote Notice I posted this week. Please note that there is over 850,000++ MKR that is currently not voting and can dictate the outcome of the current Poll. Including a lot of Recognized Delegates, and MKR token holders who actively vote. I truly understand your frustration and appreciate the work that you are currently performing for the upcoming ETH Denver event. You know… I think about things like, why has it taken more than 6-months to finally produce Content for the many events that were showcased across the World in the same 6-month time-frame. Last month I attended DeFi Con and a good amount of DeFi protocols were there. I didn’t see any “Marketing” for MakerDAO, and the same occur at other events throughout Europe. In fact, MakerDAO is rarely represented at any of these events. But okay. I get it. Folks can’t travel because of the pandemic, or personal reasons, things happen, humans sometimes like to tackle things, “tomorrow”.  image1242×826 43.8 KB  I believe that MKT-001 has had a sufficient Budget allocated to their Core Unit. If my memory serves me correctly MKT-001 operated on 50% of the budget and it failed to scaled up. What happen to the the MKT-001 roadmap and the game plan for a product-driven viral growth theme? Also, as MakerDAO moves to a Clean Money Initiative, we need to campaign, market, push for DAI driven-viral-scale, hence: we need a marketing leader that can create a brand vision. Don’t you agree?     jmarshall:  We have planned and set in motion the following content to be filmed in 4 weeks: promotional video   I can tell you that I have a friend who is  a Video Producer that was hired to work for Harmony One blockchain, and within 1.5 weeks of being hired, he envisioned, produced, and release this promotional video:      And I’m not going to compare your Skill Set to others, but MKT-001 has had ample time to produce results–and for the Budget that was allocated by MKR token owners, I am willing to bet that many don’t believe they are getting the results they expected.     jmarshall:  I’d be remiss without saying thank you to all the wonderful people I have worked with in the DAO and those who have stuck up for us. Despite this situation and no matter how it turns out, I was still happy to have time here at Maker.   I URGE to continue to push forward and achieve greatness. SES is looking to incubate a Marketing CU–the opportunity is there! Don’t give up because we believe this Core Unit needs to be revamped. There is nothing wrong with reinventing yourself. Push forward JMarshall. ",
                    "links": [
                        "https://www.youtube.com/watch?v=lYoL5mQciFA"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7716666666666665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#4",
                    "likes": "2",
                    "time": "15/01/2022-19:04:58",
                    "content": "    flipflopflapdelegate:  I have a friend who is a Video Producer that was hired to work for Harmony One blockchain, and within 1.5 weeks of being hired, he envisioned, produced, and release this promotional video   may be he can the next content production core unit? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jmarshall",
                    "index": "#5",
                    "likes": "7",
                    "time": "16/01/2022-19:45:11",
                    "content": "    flipflopflapdelegate:  And I’m not going to compare your Skill Set to others,   Actually, in an indirect backhanded way you are and I have to address it. . . One reason I’ve worked exclusively with production companies, agencies, and internal corporate marketing departments my entire career is to avoid conversations like this. “Why does this cost $xx,xxx when my friend who just graduated film school can do it for $1000?” type conversations. I like to be insulated to just focus on doing my work. But with the good comes the bad, and this is something I need to learn to get used to in the DAO. If this situation has revealed anything to me, managing community expectations for video content is something I have to find a solution to.     flipflopflapdelegate:  I can tell you that I have a friend who is a Video Producer that was hired to work for Harmony One blockchain, and within 1.5 weeks of being hired, he envisioned, produced, and release this promotional video:   This is an apple to oranges straw man, and I sincerely have to address this as well, because 1.5 weeks turnaround for a Branding Advertisement is ridiculous. Just by saying that, you’re now placing that expectation from everyone who does not understand what kind of work and resources go into this kind of content. There’s not a production company or agency that would ask a producer to start with a blank canvas, produce it, push it through post, push it through revisions and then release it in that amount of time for a global brand. Why? Because there’s a proper professional process to creating this content that inhibits it from being rushed. Here’s a general order of operations: Concept creation → Treatment/Boards → Pitch → Preproduction (location scout, securing permits, production insurance, hiring crew, selecting and hiring talent, selecting and renting equipment, shot lists, shooting schedules, catering, logistics, contingency plans) → Production (Can take multiple days depending on the number of pickups and locations scheduled) → Post Production (Edit, Color, Vocal Talent Recording, Music licensing or scoring, VFX, Graphics, Sound Mix, Master) → Revision, feedback → Release Does that sound like a 1.5 week turnaround to you? With all of these moving pieces and complexity, Murphy’s Law proves itself; which is why producing is a lot of clever contiguity plans and damage control. Projects often get trapped in a loop during the treatment pitch process and the revision feedback process after the initial edit. Also, if we’re talking about some of the biggest brands in the world, that simple process is even more complex. Advertising agencies will work for months crafting a campaign and image they want to project. The agency comes up with the entire spot and then asks multiple directors to pitch on their concept to bring to life. The agency and brand select their favorite pitch. Then that director and production company are hired to make it. There’s intense oversight on set and lots of revisions and oversight in post. General Production Cost Reference Also for cost reference, here’s what an average film crew can cost assuming I’m included as producer/director. All crew rates are based on 10 hour day: DP $1100/day Subject to Negotiation (“STN”) Key Grip $750 Gaffer $750 Assistant Camera “Focus Puller” $700/day Makeup Artist $600/day Production Designer $1000/day STN Production Assistant $250/day SAG Talent ~$500/base (these are incredibly varied and complex. It requires an entire article to really breakdown the complexities of on-screen talent) And this is considered a small crew. A commercial camera and equipment package can run another $2500-$10000/day depending on the production’s needs. Not to mention costs of a grip truck, potential overtime, catering, insurances, permits, and locations. This also doesn’t include the cost of post production. A solid VFX/Coloring/Finishing house alone can easily charge $1000’s for a commercial. There is nowhere in our proposed budget to handle these types of productions. Realistically, they will most likely have to come in the form of a SPF. So what is a reasonable amount of time? About 4 weeks is fairly standard. Pitching process can be about a week, sometimes less. Many filmmakers work brutal hours just to get a good pitch in. At the higher levels, they have a personal assistant to help them. About a week of pre-pro, a week for production, a week for post, and then a revision cycle which can be a few days or well over a month. And that content is literally the director’s baby during the entire process. Bare in mind, there is often a concept already developed for the pitch. The pitch is the filmmaker’s vision to bring it to life. How 1.5 weeks? How could your friend do it in such a short time with probably little money? Well they cut some corners some of which there’s nothing necessarily wrong with. I do not know the context, but here’s some options: leaning on licensing stock footage thus skipping huge amounts of production and pre production time and costs, but consequently not having unique content, using non-union talent, a bare-bones crew, having the concept already developed before even starting, working extreme unsustainable hours, guerilla filmmaking, and/or avoiding proper revisions and community feedback. Internal vs. External Content There’s a big difference in producing internal community content and external advertisements. This type of content informs your audience and clients of your brand in deep and subconscious ways. Who are your clients? What does your brand represent? Would that example really be good for Maker? It might seem like it, to get a quick hype boost, but does it inform an audience of a brand in a deep and effective way? Maker is a Global Brand I view Maker as a sophisticated global brand and believe it should be treated as such. It takes a lot of minds to come together for that content. Sure you could push it out quickly, but if done incorrectly it could damage our brand and dilute it’s message. It’s better to have no advertising than sloppy, rushed advertising. The world’s biggest brands know this, and spend obscene amounts of money creating that content. For some reason in the crypto world, it’s a foreign concept. No Room for Failure It should be pointed out that in this hyper critical environment we are operating in, we have no room to fail. Sure, I can have some delays or an unsuccessful social media video, but if I swing for the fences big and miss once, we’re gone. So in addition to the complexities and resources for this type of content, there’s an internal fear to even touch it. Different Content has Different Timelines So clearly 1.5 weeks is not a wise or repeatable pattern for output for a Branding Advertisement. In addition, different content has different timelines. The animated educational content that is 5-10 minutes long has a 2-4 week timeframe, from writing, animating, and revisions. There’s a lot of bottlenecks in the process, many that are out of my control. A short documentary takes weeks of work, most of that work is done in the editing process, sifting through hours of interviews to compile a story. One thing even producers forget, is the longer the content, the more complex the editing process because editors have to keep watching the piece over and over as they craft it plus it requires a much more sophisticated file management than say a 60 sec spot. Unfair Content Comparison No one, at any point has mentioned to me that they want branding advertisements from our core unit.    # MIP40c3-SP33: Modify Core Unit Budget, MKT-001   Feel free to reach out anytime if you have any questions about video content or have any ideas, I’d love to hear them.   I directly asked if there was a type of content you wanted to see and you never once mentioned this or any other content to me. As a matter of fact, no one did. The last time we were criticized for not making promotional content at Lisbon, well here I am producing it for ETHDenver and I’m getting my legs taken out while I do it. Now, you’re indirectly criticizing us for not making a whole different type of content, that we were never asked to make, never said we would make, and that quite honestly, our unit is severely crippled from executing. This constantly shifting metric of what we should be creating is not a fair way to judge any group. What’s next? At the next budget cycle, is someone going to complain that we haven’t made a superbowl ad with Matt Damon? Severely limited resources We are regularly being pushed and pulled to fill in everyone’s different ideas of what we should be, with only 5 team members and constant headwinds. My production budget is so razor tight for ETHDenver, I am donating over $5000 of my personal equipment to it (Photography Camera, Zeiss Lenses, MatteBox, and Filters). I never do that for companies. Attempting to Fill Marketing Gap Against Direct Attacks Our unit was not set out to be the Marketing core unit for the DAO, we were the content production unit assuming there would be a Marketing core unit. We are doing our best to fill that need, but we cannot even onboard the necessary talent to even assist with that. The number one reason our budget to output is not making sense to budget scrutiny is that we have the following unfilled positions.    # MIP40c3-SP33: Modify Core Unit Budget, MKT-001   People (Proposed)     Role Name     Full-Time    Marketing Strategist TBD   Press Relations TBD   Part-Time    Video Production Assistant TBD   Podcast Host TBD   Writer TBD       One of the positions we tried to hire was directly sabotaged. I was genuinely excited to bring him onboard because he filled a major gap in our group. This is the tip of the iceberg, but I will leave it there. I will touch upon this again delicately towards the end. My Concept for an Ideal Model in the DAO Based on Real-World Corporate Models In my opinion, under the current structuring of the DAO, it would be ideal to have both a Marketing core unit and a Content Production Core unit. These units would work closely together. This models the real world external option: Ad Agency + Production Company or internal option at a large corporation: Marketing Department and Video Production Department. I should also point out that a production department typically will have a producer/video production manager like me, and multiple editors, animators, or production people to assist in productions. Often these productions are only for internal use only and are much larger and more expensive units than ours. For example, one previous corporate client of mine, had a massive multi-layered marketing department, two independent video production departments, and a design department. They also had an advertising agency client and they would independently contract production companies to produce commercials. In addition to all these resources, they still would contract me for additional video, motion graphics, and photography services. And they were not a global brand or a Fortune 500. I’ve worked with them as well, and their resources for video content can be astounding. To boot, these organizations all have a human resource department, and I see their value after this environment. Do we want Branding Advertisements? And what Priority? If branding ads are something you and other MKR holders want to see, then I need to know. And I need to know which types of content should be prioritized. I cannot do everything all at once. Over 20% of my work week goes to internal stakeholder content and meetings. The rest currently goes to working on educational content and pre-production for ETHDenver. We intended to add an editing assistant this budget cycle so I can start to focus more on the bigger things, but situations like this have made that impossible. One Person Video Production Company Do I want to make advertisements for the DAO? YES! But I’m incredibly short on resources to pull them off. Do I neglect the educational videos or the internal stakeholder content or the promotional ETH Denver content and documentary content? I said it once and I will reiterate, I am a one person video production company by myself. I produce, direct, edit, animate, color, and do some design. And at ETHDenver I will be doing some cinematography and photography on less eventful days to stretch our budget. When I’m doing one thing I can’t do something else. And someone wearing this many hats is not a standard situation in my industry either. You have someone who has been contracted professionally for each of these unique skill sets individually and it’s completely taken for granted. Please Communicate Content Needs @flipflopflapdelegate Even if you continue to decide to vote against our unit and our unit does survive. I kindly ask that you communicate the kind’ve content that you and other MKR holders feel we need. This method of criticism is not productive or the proper way to communicate with creatives. For example, you could say, my friend over at HarmonyOne produced this content I really like, is this something you could do? Then we can have a discussion and find a solution. We’re supposed to be one team here, and I am a professional. I feel like I work on an island that’s constantly being attacked. Pre/Post ETHLisbon  Pre-ETHLisbon, this was the best work environment of my career; Post-ETHLisbon it has become one of the worst. I would say the worst, but I’ve worked some real terrible, humbling jobs in my life. My team and my passion for both Maker and the concept of the DAO are the only things holding me on. I tell colleagues and mentors in my industry about the situations I’m going through here and their minds are blown.They’re horrified to hear that we have to spend time out of our busy day discussing how to battle these passive-aggressive interoffice political attacks. It’s both unproductive and quite honestly, demoralizing. I point out the positives about working in a DAO and how they outweigh all this negative, but this MIP and its reaction is approaching the tipping point. Mob Rule     flipflopflapdelegate:  SES is looking to incubate a Marketing CU–the opportunity is there!   Quite frankly, the environment that is currently being cultivated in the DAO leaves that as the only option for someone of my skill set. This situation is devolving into Mob rule; those in the in crowd, and those who are not. If you aren’t, your only chances for survival are to be insulated in a cushy core unit or to be so mission critical you are untouchable. If that’s the environment everyone wants, then stay on course. What a Coincidence. . .     flipflopflapdelegate:  Also, as MakerDAO moves to a Clean Money Initiative, we need to campaign, market, push for DAI driven-viral-scale, hence: we need a marketing leader that can create a brand vision. Don’t you agree?   If this is something you do want, then you will be happy to hear that after the holidays, I literally pitched a branding advertisement concept for MakerDAO privately to my team members involving clean money and the brand research we did. Prior to the holidays, we subscribed to an excellent stock footage site to license b-roll for the ETHDenver content and to cover some of the intended conversations involving the clean money initiative. Over the holidays, I started procuring shots and playing with the idea that we could make a compelling, mature, and interesting branding Ad for the DAO with it. I have no intention of turning it around in 1.5 weeks. First, I have to finish the 3 educational animations I’m juggling and get this ETHDenver content in the can. Then I can start to develop this concept with my team and gradually get feedback from key members in the community so I can really hone the message and see if it’s really something we all want. Since I intend to use stock footage, I can avoid costly and timely pre-production and production resources as I wouldn’t even dare to ask for them at the moment. For the reasons I mentioned above, I also wanted to keep this idea of mine quiet until I felt like the concept was solid enough to execute.     flipflopflapdelegate:  I URGE to continue to push forward and achieve greatness.   You give me the proper work environment, resources, and communication, and you’ll see it. But I will not stand for unfair and unethical treatment of my team members, no matter what anyone thinks about them or their competencies. And this EXTREME passive-aggressive work environment needs some light shed on it or this pattern will repeat itself. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp33-modify-core-unit-budget-mkt-001/10150/1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4630120607194845
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#6",
                    "likes": "3",
                    "time": "16/01/2022-21:08:36",
                    "content": "Thanks for the cost breakdown of film production. It is illustrative and is content that would be beneficial to walk through during a budget RFC period. Doing so would help to better understand the budget ask, as well as the work going into the proposed deliverables. This walkthrough helps the community understand why the OKRs and objectives are set the way they are. We can all agree the conflict on this thread is counter-productive and that there is a way to move forward productively, even if all sides are displeased at this moment. The concerns on this thread are valid on both sides and were addressed in a post on the offboarding thread. The main issues are a lack defined work products and a budget appropriate to fund the agreed upon work. The remedy is an agreement on a vision, a scope of work, and deliverables between the CU and the DAO. Of principal concern is the funding model:  content production has been funded indefinitely without agreeing or defining the scope of work they were to perform, how these tactics support a broader strategy, and how the performance or its absence are to be measured and evaluated. Still, the core unit has continued to grow their budget despite this uncertainty. I appreciate this budget growth may be a reaction to the criticism and a solid effort to create more value to address the criticism.  Without remedying the underlying source of the mismet expectations  it seems folly to continue along as before; these issues will recur. The concerns were raised here in October, and a broad strategy was mentioned, but not concretized. There may have been a feeling of implicit understanding, but again, the OKRs and KPIs that were promised in June have not materialized. This has led to conflict and confusion; it looks less and less likely that the core unit management is capable of creating a vision and appropriate documentation, and then delivering on a strategy. A cohesive and well articulated vision was the promise that MKR holders funded. That is not to speak ill of any individual contributors or even the Core unit facilitator themselves, it just suggests the current structure and resource allocation is not working for all sides in the arrangement. MKR holders feel they are not receiving the value they are expecting for the spend and would like to re-establish expectations. This could mean trimming and defining the responsibilities of a marketing core unit so they may better deliver. Agreement upfront avoids uncertainty. I think all sides further agree that this is not an ideal work environment or structure for content production, hence the desire to re-structure the core unit with a clear mandate, OKRS, KPIs and possibly a new facilitator. This would be near impossible to do under the current circumstances, a large perpetual budget, ongoing work that does not clearly contribute to a strategy, and expectations on both sides going unmet resulting in resentment, etc. The decentralized workforce operates where CU facilitators are ultimately held responsible for core unit performance and have complete discretion with their budget. Due to this freedom, they are also at risk of replacement. This requires executive management skills from CU facilitators and the ability to establish vision, metrics, and communications with the DAO. It also requires CU members have ultimate trust in the CU facilitator to effectively manage the relationship with the Funder (the DAO). I see Frank as being charitable in his post in the sense that he wants you to find a way to bridge your work in an effective way into a new core unit. You may not agree with some of the content of his message and maybe it could be expressed a bit better, but I think he simply intended to express his dissatisfaction with a lack of coordination and alignment, as well as a genuine desire to retain and restructure the talent. If  your concern is delivering on obligations you have already made, that could be worked out between your current CU budget and the potential reformulation of the CU. Important to note, there are contingency funds set aside in the content production core unit budget, there was also a large budget increase in the last budget cycle, and I do not believe you have yet hired the headcount to draw down that budget. Simply put, if you can establish an objective and specific issues and costs you want remedied against your available budget in the event of an unwind, I imagine they can be addressed. It does unfortunately look like the community is to reject both the facilitator and the current structure of the core unit. If I understand correctly, content production has approximately ~130K available in your stream and other previous contingency funds set aside, so if there are issues with the continuity of your engagements, these funds including the contingency funds can likely address obligations you have made to date. We appreciate you taking the time to write up and help us better understand the process. In the future, it is safe to assume the community knows nothing about professional video production and go from there. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp33-modify-core-unit-budget-mkt-001/10150/20",
                        "https://forum.makerdao.com/t/mip41c5-sp2-facilitator-offboarding-rwf-001/11306/32"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.580593700470749
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#7",
                    "likes": "1",
                    "time": "17/01/2022-09:44:29",
                    "content": "I do not have a strong personal take on the whole offboarding discussion, because I haven’t followed enough. But I haven’t seen any MakerDAO content… so there must be a problem indeed.     jmarshall:  This is an apple to oranges straw man, and I sincerely have to address this as well, because 1.5 weeks turnaround for a Branding Advertisement is ridiculous. There’s not a production company or agency that would ask a producer to start with a blank canvas, produce it, push it through post, push it through revisions and then release it in that amount of time for a global brand.   I agree with both:   this is apple to oranges: @flipflopflapdelegate with all respect for your friend (amazing work for 10days!) this is not they type of product I’d expect from the Content CU of MakerDAO. It feels like this video was produced by some AI: it does not deliver any visual message, it does not have ‘character’, it just seems to be a template instantiated with a specific vocal message etc. I’d expect much higher quality.   @jmarshall you are right that you are not expected to create in a white canvas, and that there should be a protocol to follow. But this protocol should not be suffocating. What has been done so far following the protocol?   ",
                    "links": [
                        "https://forum.makerdao.com/t/deprecated-mip4c2-sp15-core-unit-offboarding-process-amendments/12920",
                        "https://forum.makerdao.com/t/relay-semanal-11-al-17-de-enero-2022/12712",
                        "https://forum.makerdao.com/t/weekly-relay-january-11-17-2022/12699"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.482142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "16/02/2022-09:45:07",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "417"
}