{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-increasing-surplus-buffer/4644",
            "title": "[Discussion] Increasing Surplus Buffer ",
            "index": 4644,
            "category": [
                "Governance"
            ],
            "tags": [
                "discussion"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "11",
                    "time": "08/10/2020-08:57:29",
                    "content": "Hey all, We know that at a current 4% interest rate on debt from stablecoin collateral we have about 2.5 months before accrued fees start causing stablecoin vaults to become undercollateralized. In practice, losses from potential undercollateralization are simply offset by increased Surplus buffer by the same amount. This means that Maker could be charging those fees as long as it wants, but only needs to set aside reserves inside the Surplus Buffer for impairments needed. However, there are two important questions that need to be addressed:  What is the best strategy for disabling fees on stable coin debt? How long is it sustainable to have Surplus Auctions (FLAPs) running after Surplus Buffer is reached (estimated in about a day)?  To get an answer on the first question it would probably require a long discussion about some of the trade-offs which I don’t want to go into in this post. Also, it is likely not optimal to be disabling those fees very soon and we don’t need a decision right now. A post on this topic is following soon though, as we still need the community to agree on general strategy in the near future. To get an answer on the second question, let us look at some numbers first. As of now, about 600.000 DAI has been accrued from fees on debt from stablecoin collateral to the Surplus buffer and we know they will be hard to actually collect if DAI price doesn’t fall below $1.01. Additional 50.000 DAI accrues daily from these assets at a current rate of 4%. All these fees from stablecoin vaults are worth something if they can be collected and this only happens if DAI goes below $1.01. Even if DAI goes under that price, we are unsure how many of the vaults will need to be liquidated and what the outcome will be. This means that in the current situation every cash flow from those fees is essentially unbacked DAI if being conservative. These fees are already part of Surplus Buffer, which itself is not an issue if being unbacked until used (or not until at least you have FLOPS or spending it for other costs). But once the Surplus buffer is filled and these fees are used for MKR burn it becomes an issue “slowly”, because you should be making impairments for the same amount in the Surplus buffer, which is already showing inflated value. At some point you are effectivaly reducing the Surplus buffer to zero, even though it still shows 2m value. And once it goes below zero (by applying impairments calculations), you effectively have an unbacked DAI scenario, not to mention the system doesn’t have any protection against losses. So what does this mean in relation to recently voted Signal to continue with FLAP auctions after the Surplus buffer is filled? It means that we will be spending about 50.000 DAI daily from stablecoin fees for MKR burn, money that isn’t necessarily collected in the future. Therefore our Surplus buffer should be each day decreased by 50.000 DAI, together with an additional 600.000 DAI impairment needed from currently accrued fees. This means that in about a month, our Surplus Buffer effectively becomes drained in “DAI backing” terms, a situation we want to avoid. This means we would likely need to very soon either a) disable stablecoin fees or b) Increase Surplus buffer soon after continuing to FLAP auctions. Since disabling fees on stablecoins currently may not be optimal for maximizing their potential collection in the future I think it may be more wise to increase the Surplus buffer. The increase should be done by an amount that makes Maker save until we disable fees on debt from stablecoin collateral. A 2m increase would mean we would have the same situation as today in about 1 month. By then, we should already have a more clear view on the timeline regarding disabling fees. Please discuss the pros and cons of this approach before we potentially increase the Surplus buffer next Friday. I know there was a Signal already, but I think this issue wasn’t properly addressed in the past. As explained above, the more we delay the increase, the more we are effectively draining the current Surplus buffer (fees collected from other collateral) and governance needs to decide about tolerance here. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-114-thursday-october-15-16-00-utc/4657/5",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-113-thursday-october-8-16-00-utc/4505/3",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-113-thursday-october-8-16-00-utc/4505/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-16-pt-br-portugues/4722",
                        "https://forum.makerdao.com/t/maker-relay-ep-16-en-espanol/4719",
                        "https://forum.makerdao.com/t/signal-request-increase-the-auction-surplus-buffer-by-2m-system-surplus-october-2020/4716",
                        "https://forum.makerdao.com/t/maker-relay-ep-16/4710",
                        "https://forum.makerdao.com/t/week-19-dai-distributions-sourcecred-trial/4707",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-113-thursday-october-8-16-00-utc/4505/5",
                        "https://forum.makerdao.com/t/signal-request-increase-the-auction-surplus-buffer-system-surplus-september-2020/4469/18",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-114-thursday-october-15-16-00-utc/4657/2",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782"
                    ],
                    "GPT-summary": "The author of the post is explaining the current situation with stablecoin fees and the potential risks of continuing with FLAP auctions after the Surplus buffer is filled. The author proposes increasing the Surplus buffer to avoid draining it in \"DAI backing\" terms and asks for feedback on the approach. The post also includes questions about the best strategy for disabling fees on stablecoin debt and how long FLAP auctions can be sustained. The post may receive constructive criticism and questions from third parties, and may be audited and reviewed by others.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.434257285003554
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "3",
                    "time": "08/10/2020-09:55:31",
                    "content": "    Primoz:  What is the best strategy for disabling fees on stable coin debt?   I don’t want to disable fees on stablecoin debt. Maker Vaults enable holders of GUSD, TUSD, USDC etc etc to exchange their centralized coins for decentralized DAI. This is a valuable service that Maker should charge for so let’s keep the fees. Vault undercollateralized? Well auction it off just as if it was ETH. If none of this is doable we should rather discuss how to reduce stablecoin share of outstanding DAI.     Primoz:  How long is it sustainable to have Surplus Auctions (FLAPs) running after Surplus Buffer is reached (estimated in about a day)?   Preferably I would like to keep surplus auctions running constantly. Continuously increasing the buffer is in my eyes unsustainable. I would much prefer a plan for reducing stablecoin Vaults. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.65
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#3",
                    "likes": "4",
                    "time": "08/10/2020-12:33:14",
                    "content": "A middleground of 2% or lower stability fees on stablecoin vaults make sense. That’s my suggestion, less aggressive collection of stablecoin stability fees, more incentives for vaults to self liquidate.     Primoz:  All these fees from stablecoin vaults are worth something if they can be collected and this only happens if DAI goes below $1.01.       Primoz:  And once it goes below zero (by applying impairments calculations), you effectively have an unbacked DAI scenario, not to mention the system doesn’t have any protection against losses.   Yes, there’s impairment if we liquidate but we don’t need to liquidate. If you use the 1 USD target settlement price at ES, going under 101% CR, does not result in unbacked DAI. So I do agree that stablecoin stability fees could cause unbacked DAI, but it’s not as bad as calculating impairment to $1.01. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.444444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#4",
                    "likes": "1",
                    "time": "08/10/2020-13:29:12",
                    "content": "    Planet_X:  If none of this is doable we should rather discuss how to reduce stablecoin share of outstanding DAI.   Massive amounts of stablecoins were introduced as collateral to protect the peg (at 1:1.01). We can’t just get rid of them: from what I have read in the discussions in this forum, we can really ‘live’ without stablecoins at the moment. I guess one hope is that we will have some RWA soon enough to further help with the peg. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#5",
                    "likes": "2",
                    "time": "08/10/2020-14:52:31",
                    "content": "I am not suggesting we get rid of them overnight. We have spent 7 months building up stablecoin as collateral, we will probably spend 7 months building them down to something less. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.296296296296297
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#6",
                    "likes": "2",
                    "time": "08/10/2020-15:04:37",
                    "content": "Yes I think everybody here would be happy to get rid of (high amounts of) centralised stablecoins. My previous post was basically pointing to the fact that we still need to find how to do that. But I am optimistic that in the medium/long term, RWA will do good to the peg. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.866666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#7",
                    "likes": "1",
                    "time": "08/10/2020-15:13:59",
                    "content": "    Jiecut:  If you use the 1 USD target settlement price at ES, going under 101% CR, does not result in unbacked DAI.   Agree, but this implies ES as the final state. In case we would unwind them before ES (presumably we should be aiming this) there is uncertainty about actual collection of these fees. But I do agree that if we let stablecoins be part of portfolio until a point there is a high probability of collecting all the fees, everything is fine. But me being on more conservative side, I wouldn’t count on best outcomes in this particular case. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.602380952380953
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#8",
                    "likes": "11",
                    "time": "08/10/2020-18:45:01",
                    "content": "One (maybe a little bit crazy) idea: Once some stablecoin vaults start to get near to 100% collateral ratio, reduce the debt ceiling and stability fee for that vault type to 0. At the same time, create a Stablecoin-B vault type with 101% collateral ratio, same 4% stability fee etc. This could allow Maker to continue earning money from new stablecoin vault users without pushing existing stablecoin vaults into under-collateralized positions. ",
                    "links": [
                        "https://forum.makerdao.com/t/week-19-dai-distributions-sourcecred-trial/4707"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.540719696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#9",
                    "likes": "2",
                    "time": "08/10/2020-20:58:12",
                    "content": "The system looks horribly broken and we always must choose between two bad options. We changed the definition and purpose of every system parameter (the surplus buffer is the current victim) and it still doesn’t work. Now it seems that even the signal vote won’t be honored and that an unwanted change will be bundled in the executive with a bunch of “regular” changes. The method of keeping the peg with 101% USDC LR is broken and we should abandon it. The surplus buffer was artificially filled anyway - no SF other than 0% makes sense for USDC (and ETH). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#10",
                    "likes": "1",
                    "time": "08/10/2020-23:18:50",
                    "content": "Maybe @monet-supply idea was presented as “a bit crazy”, but sounds like a real solution if applied somehow directly to the Vaults (not needed Stablecoin-B in my opinion). If user A has a Vault 101 with 100k USDC and due to fees accrued it goes to 100%, then disable the fee collection for user A  Vault 101. The DAI will be perfectly backed 1:1 with that USDC. In a far far future , if the PEG falls below 1, all those users will have a reason to buy the DAI in the open market and pay their DAI back (to get the 100k USDC which worth more in that moment than the 100k DAI). That user will be happy because it actually earned something doing this! we will be happy since the DAI was all the time backed and we collected that 1% of fees there, plus that moment the users are buying the DAI is the right moment!!, when the PEG is below 1!!, ensuring that it goes back to $1.00 (we’re then building a big reserve to keep the PEG in 1 in the future!) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.242373511904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#11",
                    "likes": "1",
                    "time": "09/10/2020-02:44:43",
                    "content": "I think the current system is more stable and balanced than before, so I think the current measures are completely correct. Now, I think increasing the surplus buffer is the right choice, which will help the system become more stable and safe. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.346938775510205
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#12",
                    "likes": "4",
                    "time": "09/10/2020-08:34:13",
                    "content": "    monet-supply:  Once some stablecoin vaults start to get near to 100% collateral ratio, reduce the debt ceiling and stability fee for that vault type to 0. At the same time, create a Stablecoin-B vault type with 101% collateral ratio, same 4% stability fee etc. This could allow Maker to continue earning money from new stablecoin vault users without pushing existing stablecoin vaults into under-collateralized positions.   Not crazy at all, this is definitely one of the best solutions. The only problem is that once majority of those Vaults reach 100% CR or some level, there might still be a large chunk of them inside this vault type with much higher CR that you may not vault to disable fees immediately… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.000324675324675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#13",
                    "likes": "2",
                    "time": "09/10/2020-09:11:32",
                    "content": "The @monet-supply solution is one of the best. As @Primoz note it may work less effectively when those subsequent vault take time to be filled. Therefore we need to balance the vault DC. Smaller vaults will capture more value but would add more management work. While I hope work in this direction will continue, we need to address the short term. Either disable SF for stablecoins, increase the surplus buffer size or take the risk that DAI between 100% and 101% CR will become larger than the surplus buffer and trigger a MKR minting if something turn sour. I think the risk is really small and I think increasing the surplus buffer is not great for many reasons. But overall, increasing the surplus buffer will allow us to sleep better and is a simple fix. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.892156862745098
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#14",
                    "likes": "0",
                    "time": "09/10/2020-16:26:34",
                    "content": "If we are taking about creative ideas, another one would be to first increase Surplus Buffer, apply a SF of 50% for about a week on existing stablecoin Vaults, push average CR down to 100% and then disable fees right afterwards, limit DC to 0 and create new stable coin vault types with positive SF. But I think there is a lot of coordination needed and it also may not be the best strategy in case we aim for Vaults to self unwind in case DAI price drops faster than CR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.308621933621934
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#15",
                    "likes": "3",
                    "time": "09/10/2020-17:13:20",
                    "content": "To echo my comments on the governance call… I don’t see anything wrong with allowing “bad” fees to accumulate so long as we don’t use them to burn MKR. I would like to advocate that we just keep an eye on these and increase the surplus buffer as needed. When Dai inevitably goes back below $1, these vaults will be easy to unwind/liquidate if need be. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.883333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#16",
                    "likes": "0",
                    "time": "09/10/2020-23:50:21",
                    "content": "Another option if the flapper proposal comes through would be to burn 25% (rule of thumb) and accumulate the remnant in the surplus buffer, we could update the % as we move along on a monthly basis. Any need of funds from the community would be substracted from the surplus & if needed eventually mkr tokens would be minted if stablecoin revenue was non existent but at least we would keep burning & make use of the funds for development at the same time. This of course needs more fine tunning as per flapper eta , what would be the process to determine & approve fund allocations & other technical complexites that I may not be taking into account ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.409722222222221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#17",
                    "likes": "2",
                    "time": "10/10/2020-00:18:38",
                    "content": "    Primoz:  So what does this mean in relation to recently voted Signal  to continue with FLAP auctions after the Surplus buffer is filled? It means that we will be spending about 50.000 DAI daily from stablecoin fees for MKR burn, money that isn’t necessarily collected in the future.   As long as we burn MKR with these fees, we will just need to mint an equivalent amount of MKR (in USD terms) once the vaults get liquidated.  I don’t see a good reason to increase the surplus buffer- as long as we keep burning MKR with it to compensate for future MKR inflation, the system will remain in equilibrium assuming the peg is stable at 1.01. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.34375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#18",
                    "likes": "0",
                    "time": "10/10/2020-01:57:22",
                    "content": "By doing that we would be exposed to mkr price volatility which could imply that the amount of mkr minted > mkr burned. Also the dai auctioned for mkr burning would probably be done at a higher price than market while the dai being minted at a lower one. By keeping the revenue within the surplus buffer we can mitigate the price risk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#19",
                    "likes": "1",
                    "time": "17/10/2020-11:02:24",
                    "content": "I have to admit I maybe haven’t followed everything around this topic, but since we are going to have a poll about raising the SB despite there is a reasonable and (at least from my limited PoV) unrisky solution (put DC and SF of the currently risky 101% ratio vaulttypes to 0, start a new vault type with the former parameters, repeat a couple of weeks later as long as this is needed) - why should I vote for raising the SB? Because, right now: I will for sure vote against that. We need to burn more MKR ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.545749704840613
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#20",
                    "likes": "3",
                    "time": "17/10/2020-12:15:03",
                    "content": "I don’t think there was any conclusion so far to set SF on 101% LR stablecoins to zero? As discussed in Surplus poll thread, setting SF to zero right now doesn’t really maximize potential fee collection in the future for Maker.     ultraschuppi:  We need to burn more MKR   I personally think there is better argument for “we would need to increase Surplus Buffer anyway”. MakerDAO debt exposure increased 10x in last 6 months. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.880952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#21",
                    "likes": "2",
                    "time": "18/10/2020-10:59:51",
                    "content": "thanks @Primoz for clarifying - so the main reason to raise SB is the 10xed debt exposure and not the risk of 101% LR vaults going undercollateralized. will vote for yes given that  is there any thread i haven’t found yet where the latter problem is dicusses, especially the crazy idea of @monet-supply (which i like a lot)?     [Discussion] Increasing Surplus Buffer Governance       One (maybe a little bit crazy) idea:  Once some stablecoin vaults start to get near to 100% collateral ratio, reduce the debt ceiling and stability fee for that vault type to 0. At the same time, create a Stablecoin-B vault type with 101% collateral ratio, same 4% stability fee etc. This could allow Maker to continue earning money from new stablecoin vault users without pushing existing stablecoin vaults into under-collateralized positions.     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.6434228650137745
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#22",
                    "likes": "1",
                    "time": "19/10/2020-08:58:55",
                    "content": "I have another potential solution to the stablecoin Vault issue. Basic idea: Autoliquidation of Vaults after a certain time. Let’s face it, the current setup we have going with stablecoin Vaults is a temporary measure enacted to keep the peg following Black Thursday events and the DeFi craze. It is far from optimal, possibly not even sustainable, so let us change how it works. The proposed action sequence:  For existing stablecoin Vault types (USDC A etc etc) we introduce upwards creeping liquidation ratios, the suggested pace is 0.25% increase per week until approximately 103% is reached. The increase is to ensure that if liquidations happen they do not eat into Maker buffers. Exact figures will of course be as per the Risk team’s recommendation. This slow pace of increase will allow Vault owners time to close maxed-out Vaults. We reduce the Debt Ceiling to 0 for the existing stablecoin Vault types, effectively ensuring no new Vaults of this type. At the same time we open a new Vault type especially for stablecoins. It works as before but with the added feature that the Vault will be auto-liquidated after a certain amount of time (blocks) has passed. How long? Some months to a year to start, but these are suggestions. This fully eliminates the potential issue of unbacked DAI in buffer/burner. As the new Vaults will be auto-liquidated anyway we could have a spectrum of Vault types, some with extremely low liquidation ratio or other experimentation to help with the peg. After the new Vault type is introduced we keep raising both the stability fee and the liquidation ratio for the older stablecoin Vaults, creating clear incentive to migrate to the new auto-liquidating Vault type.  Not everyone is going to like this proposal. It is tough love on the stablecoin Vault holders and it forces them to be more proactive with their Vaults. But for Maker it solves the potential issue of unbacked Dai in the buffers and it allows for more creativity with regards to Vault types as they will be closed after some time anyway. Feedback appreciated. EDIT: grammar ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.341707895279324
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#23",
                    "likes": "0",
                    "time": "19/10/2020-11:41:32",
                    "content": "it feels a bit too harsh from my PoV. while i would love to see DAI working (especially w.r.t keeping the peg) without having any centralized collateral, we would be in a far worse position if we wouldn’t have onboarded USDC and others i don’t think we need to grind more fees out of the 101% vaults then necessary. what is the advantage of your proposal vs just  set DC + SF to 0 for e.g. USDC-A as soon as some vaults hit 100% CR create USDC-B with the same parameters as the old USDC-A repeat  the latter approach is just some governance, your approach needs to be implemented (and we know of the scarce resource of dev-hours) regarding “making sure we offboard all stablecoin vaults” (assuming this is even something we want to achieve): we can force this later too without any special code (just activating liquidation and setting up the SF again) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.56043956043956
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#24",
                    "likes": "4",
                    "time": "19/10/2020-12:13:27",
                    "content": "    Planet_X:  For existing stablecoin Vault types (USDC A etc etc) we introduce upwards creeping liquidation ratios, the suggested pace is 0.25% increase per week until approximately 103% is reached. The increase is to ensure that if liquidations happen they do not eat into Maker buffers.   Not sure I get the idea. Most USDC-A could be liquidate already but we can’t because DAI is too expensive. It’s not that we are kind to our customers, is that we can’t do otherwise. Maybe I missed something. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.95
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#25",
                    "likes": "0",
                    "time": "19/10/2020-12:25:05",
                    "content": "Well I do not say it out loud but I do not expect the peg to be fixed as long as the DeFi craze makes people pay a premium for Dai. This proposal is not about the peg. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#26",
                    "likes": "1",
                    "time": "19/10/2020-14:21:39",
                    "content": "    [Discussion] Increasing Surplus Buffer Governance       Well I do not say it out loud but I do not expect the peg to be fixed as long as the DeFi craze makes people pay a premium for Dai. This proposal is not about the peg.     so this proposal is to make the stablecoin-vaults more and more irrelevant? don’t you think this will actually hurt the peg? wasn’t that the whole idea we onboarded them?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.53125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#27",
                    "likes": "1",
                    "time": "19/10/2020-14:41:59",
                    "content": "The issue from what I can see is that Dai is over $1.01 and it needs to be lower in price so that these stablecoins can be removed from the system.  The system currently is in the process of creating unbacked Dai. Unbacked Dai lowers the Dai price in the market…  Since this is what the desired outcome is, I see no problem with letting it persist and then inevitably self correct as the Dai price falls and then the coins get removed from the system.  Once that occurs the price will naturally rise above $1.00 again because the system at that point will be backed properly again rinse and repeat. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lix",
                    "index": "#28",
                    "likes": "2",
                    "time": "19/10/2020-15:27:16",
                    "content": "Where will keepers get the Dai to buy 400M worth of stablecoins if we liquidate them like you are suggesting? I disagree with you on fixing the peg in this defi craze - it is possible. Actually, it is essential. Integrations have made it very clear that we need to be much closer to 1 than we have been the past 7 months. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.316666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#29",
                    "likes": "0",
                    "time": "19/10/2020-16:05:44",
                    "content": "This is a slow process. Will take several months. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lix",
                    "index": "#30",
                    "likes": "5",
                    "time": "19/10/2020-16:31:08",
                    "content": "Even if it takes several months, liquidating the stablecoin vaults will put unnecessary upwards pressure on the peg. To get back to 1, we need people to sell between 1 - 1.01. If we liquidate the stablecoin vaults according to your strategy, then who will be motivated to sell below 1.01? Liquidating these vaults is the same as saying 1.01 is the new peg (like it has been +/- .15% for 4 weeks now). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.736363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#31",
                    "likes": "1",
                    "time": "19/10/2020-16:35:09",
                    "content": "I would be afraid to short Dai if I could reasonably be liquidated, because chances are I will, seeing how much trouble it was managing the peg last few months. Turning on liquidations is not too far off from removing USDC vault types altogether and will only make the peg problem worse. I still think we should explore QE so we can bring the peg below 1.01 and actually give stablecoin vault holders a chance to unwind. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#32",
                    "likes": "0",
                    "time": "19/10/2020-16:54:48",
                    "content": "    lix:  Liquidating these vaults is the same as saying 1.01 is the new peg   No this is not the case as we need to protect Maker from selling at a loss. There is always some slippage involved so there must be a safety factor built in. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lix",
                    "index": "#33",
                    "likes": "2",
                    "time": "19/10/2020-17:40:12",
                    "content": "I prefer the future where the protocol realizes gains instead of being concerned with selling at a loss. We can realize gains and get Dai to 1 if we leave some meat on the bone for the stablecoin vault owners. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#34",
                    "likes": "1",
                    "time": "19/10/2020-17:47:25",
                    "content": "Best that these stablecoins are liquidated (just transferred really) into a MakerDao controlled account and then sold off when the Dai price is under $1.00. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#35",
                    "likes": "1",
                    "time": "19/10/2020-23:59:31",
                    "content": "There is no need to clean the stablecoin library, let it slowly grow old until DAI <1. At a critical moment, we can let the old stable currency library SF = 0, and at the same time gradually reduce the DC, thereby forcing people to switch to the newly created new stable currency library B\\D\\C, etc., and reset the parameters. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.337121212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#36",
                    "likes": "0",
                    "time": "20/10/2020-06:40:09",
                    "content": "    FourthStreet:  Best that these stablecoins are liquidated (just transferred really) into a MakerDao controlled account and then sold off when the Dai price is under $1.00.   It’s quite similar then to the Quantitative Easing solution that governance voted against: [Signal Request] Quantitative easing to fix the peg (aka Manual PSM) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#37",
                    "likes": "0",
                    "time": "20/10/2020-13:12:45",
                    "content": "I suppose you are correct.  I was unable to vote on that particular poll because I was away that week, but I would be in support of something being done along those lines should it come up in a future poll. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.444444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#38",
                    "likes": "0",
                    "time": "19/01/2021-19:12:46",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}