{
    "poll_list": [
        {
            "title": "Add USDC-B as a Collateral Type - May 25, 2020",
            "index": "2582",
            "option": "Yes",
            "supporting_mkr": "32,002",
            "highest_fraction": 1.0
        },
        {
            "title": "Add TUSD as a Collateral Type - May 25, 2020",
            "index": "2402",
            "option": "Yes",
            "supporting_mkr": "28,140",
            "highest_fraction": 0.86
        },
        {
            "title": "Should we add tBTC to the Maker Protocol? - May 25, 2020",
            "index": "2328",
            "option": "Yes",
            "supporting_mkr": "24,511",
            "highest_fraction": 0.8
        },
        {
            "title": "Should we add DMM to the Maker Protocol? - May 25, 2020",
            "index": "2141",
            "option": "No",
            "supporting_mkr": "36,898",
            "highest_fraction": 0.68
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/tusd-proposal-for-collateral-onboarding/2402",
            "title": "[TUSD] Proposal for Collateral Onboarding ",
            "index": 2402,
            "category": [
                "Collateral Onboarding",
                "Domain Work"
            ],
            "tags": [
                "collateral-onboard",
                "tusd",
                "risk-domain-work"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#1",
                    "likes": "10",
                    "time": "07/05/2020-04:00:01",
                    "content": "Hey guys, last week TUSD submitted a MIP6 application and as a result we have done a risk evaluation for governance to consider onboarding it into the Maker Protocol. Tomorrow we’ll do a presentation on the governance call as well. Overview The primary use case of stablecoin collateral types is to increase Dai liquidity, particularly in times of distress or when Dai is trading at a significant premium. Stablecoin collateral helps generate Dai that is then used to push the market price down, supply liquidity to secondary lending platforms, or provide keepers with adequate liquidity during auctions. As a result, the appetite for stablecoin collateral tends to be conditional on market environments. Based on USDC vault usage, we can infer that Dai is not typically generated unless there is a sufficiently high premium on Dai or when there are short term bursts of Dai demand (i.e., collateral auctions, Vault deleveraging in distressed situations, or debt auctions). Otherwise, the debt ceiling is likely to remain unutilized. Oracles and Liquidations Similar to USDC, we are proposing that TUSD maintain a fixed oracle price of $1. Until a more robust keeper ecosystem emerges, it is potentially risky to liquidate stablecoin collateral. Due to what would likely be a very narrow distribution of collateralization ratios, large blocks of collateral could be auctioned off in short periods of time and overwhelm keepers. Additionally, on-chain liquidations may not even be desirable at this stage, and therefore we propose disabling liquidations altogether from the start. Until the community has a better understanding of counterparty risks and the potential off-chain mechanisms that may be needed to resolve any disputes, auctions might accidentally result in unnecessary firesale prices. Liquidity Analysis and Metrics A volume analysis shows that TUSD has low volumes on decentralized exchanges, both in absolute terms and in comparison to USDC. Volume is more competitive on centralized exchanges, however. This introduces a risk when users would potentially need to acquire Dai by exchanging their collateral to close out their Vaults. However, we note that such an event may be unlikely given that stablecoins are generally not expected to trade away from $1. Nonetheless, liquidations would be disabled, mitigating liquidity risks.      USDC TUSD     Marketcap 708,112,192 137,882,778   Daily Volume CEX - median 90d 39,708,401 17,932,161   Daily Volume DEX - median 90d 1,337,859 59,995   Supply + Borrow DeFi 48,500,500 1,597,564    TUSD has also slowly been losing market share compared to USDC photo_2020-05-06 22.46.331212×748 96.2 KB photo_2020-05-06 22.48.221200×737 90.5 KB Daily volume for various DEX protocols vs other stablecoins  Secondary Lending activity for TUSD vs other stablecoins  Counterparty Risk Given that USDC already exists in the Maker Protocol, the primary benefit of adding alternatives such as TUSD is the diversification of the stablecoin set. However, it is difficult to quantify the extent of the diversification benefit without a comprehensive due diligence of the issuing parties. Due to lack of relevant legal precedent, we omit a counterparty risk analysis. However, we encourage the community to consider the following discussion points:  If USDC and TUSD are issued from the same jurisdiction, the diversification benefits might be limited. From that perspective, could other stablecoins such as USDT provide better utility? What are the mandates for blacklists, freezes, or seizure of TUSD? Would stablecoins tied to currencies other than USD provide better diversification?  Risk Parameters Given the significantly lower volumes, DeFi presence, and relative usage compared to USDC, we are proposing a debt ceiling of 2 million for TUSD. This amount could be raised in the future based on improved liquidity metrics or Vault adoption. Additionally, governance may want to consider putting a cap on total debt ceiling exposure to stablecoins (and potentially reduce the USDC debt ceiling simultaneously). The stability fee would normally be a function of the counterparty risk and liquidity. Given that we are ignoring counterparty risk, the stability fee should track higher than USDC due to reduced liquidity. However, given the current campaign of easy monetary policy, we propose a stability fee of 0% until the Dai peg concerns have been fully alleviated. Afterward, governance may charge a stability fee comparatively higher than USDC. We propose the same liquidation ratio as USDC for TUSD: 120%. Lastly, for auction parameters, we propose the same set as USDC. However, as noted above, liquidations will be disabled for the foreseeable future. ",
                    "links": [
                        "https://forum.makerdao.com/t/usdc-b-proposal-for-collateral-onboarding/2582",
                        "https://forum.makerdao.com/t/signal-request-should-we-add-new-psms/8337",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-may-14-9am-pst-4-00-pm-utc/2497/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-may-14-9am-pst-4-00-pm-utc/2497",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-may-7-9am-pst-4-00-pm-utc/2406",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/11"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Law and regulations"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.232914462081128
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#2",
                    "likes": "3",
                    "time": "07/05/2020-18:16:59",
                    "content": "Firstly, thank you Cyrus and risk team for this analysis!     cyrus:  If USDC and TUSD are issued from the same jurisdiction, the diversification benefits might be limited. From that perspective, could other stablecoins such as USDT provide better utility?   I don’t think USDT reserves being held outside the US provides meaningful regulatory risk diversification. The US Treasury can blacklist foreign entities, which prevents any other financial institutions from transacting with the affected Tether reserve holders or acting as correspondent bank to process USD wire transfers. This would lead to immediate halt of USDT creation and redemption, and the underlying Tether banks would probably default almost immediately due to being unable to issue or repay USD debts. For context: https://www.reuters.com/article/us-huawei-tech-usa-treasury-exclusive/exclusive-white-house-considered-kicking-huawei-out-of-u-s-banking-system-sources-idUSKBN1Y717U ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.08609693877551
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#3",
                    "likes": "5",
                    "time": "08/05/2020-18:56:31",
                    "content": "    cyrus:  Counterparty Risk Given that USDC already exists in the Maker Protocol, the primary benefit of adding alternatives such as TUSD is the diversification of the stablecoin set. However, it is difficult to quantify the extent of the diversification benefit without a comprehensive due diligence of the issuing parties. Due to lack of relevant legal precedent, we omit a counterparty risk analysis. However, we encourage the community to consider the following discussion points:   Hi Cyrus, I can address some of these concerns.     cyrus:   If USDC and TUSD are issued from the same jurisdiction, the diversification benefits might be limited. From that perspective, could other stablecoins such as USDT provide better utility?    One distinction I’d make here, and more generally, is that the counterparty risk of TUSD is relatively low given that the money is held in escrow for the benefit holders of the tokens and not by our company. This is a distinguishing feature of our token versus some other US $ stablecoins. We work with multiple trust company and banking partners to custody the respective USD. Our company does not have a legal claim on their funds     cyrus:   What are the mandates for blacklists, freezes, or seizure of TUSD?    You can review our Terms of Use  for our AML-CTF standards and our prohibited uses to get the clearest answer to this question. I addressed this question in my initial post on the forum. You can find the answer here.     cyrus:   Would stablecoins tied to currencies other than USD provide better diversification?    We do also have tokenized versions of HKD, GBP, CAD, AUD, though they have limited usage compared to TUSD. We’d love to speak further about how we could collaborate on these, as well. ",
                    "links": [
                        "https://forum.makerdao.com/t/tusd-adding-as-collateral-to-mcd/435/11"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.381181318681318
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#4",
                    "likes": "1",
                    "time": "08/05/2020-23:43:33",
                    "content": "    RyanRodenbaugh:  We do also have tokenized versions of HKD, GBP, CAD, AUD,   These are ranked fairly well in uniswap liquidity among the stablecoins. There is no superior non-USD token in terms of dex liquidity and volume, unfortunately. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#5",
                    "likes": "4",
                    "time": "09/05/2020-01:39:10",
                    "content": "There’s quite a bit of on-chain stablecoin liquidity for TUSD via the curve y pool. https://beta.curve.fi/y ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#6",
                    "likes": "3",
                    "time": "22/05/2020-23:15:22",
                    "content": "Saw @rune comment on twitter: https://twitter.com/RuneKek/status/1263937698953416704?s=20 Seems like we are trying to go out of MIPs process (I.E. Community Greenlight and the like) to get this on-boarded and I am curious to the reasons why. Basically if you check the recent presentation from the risk team there are several concerning metrics in the way of market cap growth stagnation and low trading volumes that sort of all roll together to be a bit of a cause for concern pertaining to TUSD’s long term viability. For pretty much every metric that they showed TUSD basically was ranked last among the stablecoins they presented. Based on that presentation I’m a bit surprised to see that we seem to be fast tracking this app. Especially given that based on the fact that the risk team seemed to imply that the main risk here is a non-diversifiable regulatory one. Is there some bit of context that I am missing on this? I understand that we are saying that the debt ceiling will be set appropriately low, but that still doesn’t seem to explain why we are going outside of the established process for a particular asset that we don’t even feel THAT bullish on. ",
                    "links": [
                        "https://www.youtube.com/watch?v=jkVNeI3-rWs&t=3467s"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.229166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mike.wyre",
                    "index": "#7",
                    "likes": "0",
                    "time": "23/05/2020-02:54:07",
                    "content": "While personally I disagree this Rune’s call on this being the next collateral to onboard, I’m not against it as the downside risk is small, the upside opportunity is there (they’re banking in HK afaik, and establishing multiple fiat coins in different geographies which may be a larger story to Rune’s support!). The only reason I don’t 100% like this play is that the fragmented mentality already existing surrounding off-chain assets means that any misstep will have 3x the weight on the public sentiment of DAI/Maker as a whole, and with the spotlight getting brighter on Maker as it’s gaining ground with the non-DeFi space and on the radar of a lot of the established fintech teams (Robinhood/Cash App/Etc…). Either way, I 100% support Rune’s call on this, and if it’s not the right call, we can learn from it as a community which right now is not bad. Any mistakes made now/lessons learned are cheaper than they’re going to be in 6 months, 12 months, etc…  (me showing my smaller MKR holdings than I’d like voting support)  “I disagree, and commit.” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.335164835164835
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mike.wyre",
                    "index": "#8",
                    "likes": "0",
                    "time": "23/05/2020-02:56:46",
                    "content": "    Andy_McCall:  Is there some bit of context that I am missing on this?   +1 on this Given that MIPS are still in their infancy, I think it could be probable it was already discussed and considered? In which case, and for the near term I personally don’t mind the premise of discussions being “grandfathered in”. It’d be good for the community to formalize them into MIPS (even if just for the result of following process. Sets a good example for the community. I’m literally filling up screen real estate with word salad and not answers to your questions. Sorry! Stopping now!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.44921875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#9",
                    "likes": "4",
                    "time": "23/05/2020-03:20:07",
                    "content": "Yeah I mean I’m all over this forum being bullish for off-chain assets, and I agree that the downside is small given the $2MM debt ceiling that I think we are talking about. That is not really my holdup here. What I am trying to point out is that we seem to have sidestepped the governance process established by the whole MIPS framework (and ratified via executives for that matter) for seemingly dubious diversification benefits, and a minimal overall benefit in terms of DAI generated. My question here is why are we doing this? What is the benefit that the foundation seems to be pursuing? If it isn’t diversification and it isn’t DAI liquidity what’s the point? Hell hard to even make the argument that we need more liquidity to bring dai back to peg these days (trading on coinbase currently @ ~$0.002 over peg atm). If HK banking is the reason then let’s hear the justification. Ultimately, my point here is that unless the foundation has a strong reason for expediting this it just seems like it should be going through the MIPs process just like any other asset, and by not doing that they are SORT OF acting in bad faith as that is the process that was ratified via executive vote. Just seems like they should have to abide by the MIPs process the same as the rest of the community. All of that said, there might be something that I am missing here. I would love to hear any thoughts from the foundation concerning why we are planning on polling for this collateral next week as opposed to the many others that have been suggested. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.013541666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#10",
                    "likes": "3",
                    "time": "23/05/2020-17:21:10",
                    "content": "Thanks for your question (and attentiveness) Andy. Here’s how this situation played out. The MIPS process as far as I’m concerned is still a work in progress. We cannot hold up all aspects of governance until this becomes really robust. (For example, the proposal for USDC-B is something that we want in there sooner rather than later. I don’t think we should sacrifice safety for the sake of governance right now.) One of my jobs (literally) is to help bootstrap collateral onboarding and get the flywheel spinning, which is why TUSD and USDC-B are coming this month as part of a “pseudo-MIPs” process. But to the broader question of “Why TUSD in the first place?” Well, the Maker philosophy from the start has been to add any and all collateral types so long as they are not literal scams. We do not try to be gatekeepers and pick between good or bad collaterals, but rather price the risk appropriately. Hope that clears up some of your questions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.742857142857143
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/usdc-b-proposal-for-collateral-onboarding/2582",
            "title": "[USDC-B] Proposal for Collateral Onboarding ",
            "index": 2582,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "usdc",
                "usdc-b"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#1",
                    "likes": "8",
                    "time": "21/05/2020-15:45:14",
                    "content": "Given the pre-MIPs extensive community discussions and apparent interest in and request for this collateral type, we are proposing to add a second USDC collateral type to the Maker Protocol (‘USDC-B’). The purpose of this additional variant of USDC is to act as an emergency credit facility during times when keeper liquidity is overwhelmed (such as busy liquidation periods with large amounts of collateral being auctioned). This is in contrast to how USDC-A is currently being utilized (primarily as a tool to arbitrage the Dai price back down to $1.00). Ideally, the USDC-B collateral type should remain unused unless there is a severe and acute liquidity issue in the Dai markets. To incentivize this behavior, an abnormally high stability fee is being proposed to discourage long-term usage. There have been numerous prior discussions in the community regarding the risks of USDC as a collateral type. Here is a compiled list of prior analysis for governance to review. Original USDC discussion thread: Onboarding USDC as collateral to mitigate liquidity risk Original USDC onboarding proposal: Proposal for Collateral Onboarding of USDC Discussions on the need for both a USDC-A and USDC-B collateral types: USDC: Peg Arbitrage vs. Auction Liquidity Governance call discussing USDC risk: https://www.youtube.com/watch?v=YZFfGlp01q0 Other related threads: Summary of USDC protocol risk [USDC plus additional Stablecoins] Risk Parameter Request for Comment What's the point of adding stablecoins as collateral? As is the case for USDC-A, liquidations will be disabled for this proposal, and the oracle price would be fixed at $1. Metrics for USDC can be found in our TUSD proposal [TUSD] Proposal for Collateral Onboarding Risk Parameters We propose a 120% liquidation ratio for the same reasons as USDC-A. Specifically, the goal is to strike a balance between keeper capital efficiency and debt ceiling abuse through recursive leverage (which is made easier at lower liquidation ratios). We propose a debt ceiling of 10 million. This number is slightly lower than what we might have preferred, but due to a) the OSM risk, and b) the 20 million debt ceiling of USDC-A, we are wary of the total counterparty exposure towards USDC. Additionally, for the time being the unutilized portion of USDC-A can also be used for emergency liquidity. In the future, the usage of Instant Access Modules will allow governance to keep this debt ceiling low, only to be increased on the go as needed. We propose a stability fee of 50%. This high stability fee is designed to discourage long term sustained usage of USDC-B. Otherwise, during a liquidity crunch the keeper community may come to find that their emergency credit facility has already been used up for other purposes. At the same time, the stability fee should not be so high such that keepers’ Vaults would quickly become undercollateralized and liquidated. Even though liquidations would be disabled at the start, there is always the possibility that they will be enabled at any moment. The USDC-A Vault behavior shows a median collateralization ratio of ~125%, implying that Vault owners are targeting roughly a 5% buffer over the liquidation ratio. If we assume USDC-B Vault owners will also keep a 5% buffer, then we would be interested in knowing how quickly Vaults would become undercollateralized at various stability fees. Screen Shot 2020-05-21 at 10.44.27 AM1248×258 33.3 KB At the proposed stability fee of 50%, keepers would have roughly 1 month to close out their Vaults before liquidation would occur (assuming they begin with at 125% CR and do not add additional collateral). This proposal will go up for a governance vote this Monday. ",
                    "links": [
                        "https://forum.makerdao.com/t/proposal-for-collateral-onboarding-of-usdc/1588",
                        "https://forum.makerdao.com/t/usdc-peg-arbitrage-vs-auction-liquidity/1695",
                        "https://www.youtube.com/watch?v=YZFfGlp01q0",
                        "https://forum.makerdao.com/t/summary-of-usdc-protocol-risk/2330",
                        "https://forum.makerdao.com/t/usdc-plus-additional-stablecoins-risk-parameter-request-for-comment/2119",
                        "https://forum.makerdao.com/t/whats-the-point-of-adding-stablecoins-as-collateral/453",
                        "https://forum.makerdao.com/t/tusd-proposal-for-collateral-onboarding/2402",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-may-21-9am-pst-4-00-pm-utc/2579/3",
                        "https://forum.makerdao.com/t/the-history-of-a-dai-at-par-value-what-can-we-learn-from-it/12310"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.302696608946609
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "5",
                    "time": "21/05/2020-15:49:34",
                    "content": "I recommend that this special vault type should be excluded from [Signal Request] Change the Stability Fee Structure That is, the stability fee should be kept at 50% regardless of where we move the stability fee for other vault types. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.580357142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#3",
                    "likes": "1",
                    "time": "21/05/2020-15:52:16",
                    "content": "    psychonaut:  I recommend that this special vault type should be excluded from [Signal Request] Change the Stability Fee Structure That is, the stability fee should be kept at 50% regardless of where we move the stability fee for other vault types.   I disagree with this. Is 50% really that different from say 55% with a 5% Base Rate? Why make an exception already? I would also like to add that if the Base Rate is higher than 0% then likely the USDC vaults will be at or close to 0 anyways. USDC only comes into play during bear markets / Dai liquidity crunches. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.490079365079366
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "5",
                    "time": "21/05/2020-15:59:35",
                    "content": "Imo it should be excluded from the base rate changes. Base rate changes are supposed to be monetary policy changes, and this Vault type is not intended to be used to affect monetary policy. It’s solely designed to be a liquidity backstop in the case of a market crash, so I don’t think it makes sense to have it affected by the base rate. The base rate changes would have little to no affect anyway, and it’ll be an additional line of executive code to validate every time the base-rate changes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.6125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#5",
                    "likes": "0",
                    "time": "21/05/2020-16:07:46",
                    "content": "    LongForWisdom:  The base rate changes would have little to no affect anyway, and it’ll be an additional line of executive code to validate every time the base-rate changes.   So I think we should be optimizing for governance and not for executive code simplicity. I expect the dev team will be generating fee changes with a script soon if they aren’t already. As you say yourself the Base Rate changes would have little effect, so why make an exception to the rule if we don’t have to? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.53125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#6",
                    "likes": "5",
                    "time": "21/05/2020-16:49:45",
                    "content": "So @Jiecut had mentioned using an y=ax+b setup for applying base rate changes (x) to collateral total stability fee in percent (y):     [Discussion] Change the Stability Fee Structure Governance       Another thing is that a flat risk premium may be too simplistic. It may work better in a ax + b form.  A 3% vault fee with a base rate of -2%, makes a big difference with a 3% vault fee with a base rate of 10%. (Assuming ETH-A has a 2% vault fee).     I think it would be reasonable for USDC-B to set parameters a=0 and b=50, which would keep this collateral package engaged with the base rate framework without any actual fluctuation from base rate changes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.2403846153846154
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#7",
                    "likes": "0",
                    "time": "22/05/2020-10:12:26",
                    "content": "    [Signal Request] Change the Stability Fee Structure Governance       So I had this thought earlier in this forum discussion, but didn’t want to complicate the current vote.  For refence, our soon to be system for determining Vault stability fees is:  SFv = Base Fee + Risk Premium  Say there exists a class of collaterals in the future that we want to remain at a set SF.  We could introduce a third parameter to the equation:  SFv = Base Fee * Fixed Rate Factor + Risk Premium  On normal collaterals, FRF would remain at 1. On collaterals where a fixed rate is desired…     I made a comment on this earlier in the [Signal Request] Change the Stability Fee Structure post. I’ll paraphrase it here. For refence, our soon to be system for determining Vault stability fees is: SFv = Base Fee + Risk Premium So for USDC-B or any other collateral that we want to remain at a set SF, we could introduce a third parameter to the equation: SFv = Base Fee * Fixed Rate Factor + Risk Premium On normal collaterals, FRF would remain at 1. On collaterals where a fixed rate is desired, FRF would be set to 0, and the Stability Fee would rely solely on the Risk Premium. Innitially I would see the FRF either being set at 0 or 1. But it could be later set to any positive (or negative) value. Note that this is still a y = ab + x model, just that the a in the equation is usually set at either 1 or 0. When it’s set at 1 the equation becomes SF = base fee + risk premium. When set at 0 it becomes SF = risk premium. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.148243801652892
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#8",
                    "likes": "1",
                    "time": "22/05/2020-14:13:11",
                    "content": "Before going down this rabbit hole of how we implement a fixed Stability Fee, I think everyone should be clear on their reasons for wanting to override the new norm. There is governance overhead in overriding norms, and I want to be sure that making the override is worth it. Those who voiced support for a fixed 50% Stability Fee regardless of the Base Rate above, what are your reasons? @LongForWisdom has cited executive contract code reduction. This is true there will be one less line of code to set the USDC-B Stability Fee each week, but it is my understanding that the executive contract team is already using code to generate those contracts to avoid mistakes. (Dev team: correct me if I’m wrong) I’m curious of the other reasons. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.906836219336219
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "3",
                    "time": "22/05/2020-14:20:35",
                    "content": "My main reason is actually just that it isn’t directly applicable in the same way the base rate is applicable to other collateral packages. It makes sense to use a base rate for packages that are intended to be used to affect monetary policy, less so for anything else. The USDC-B package is not intended to be used for monetary policy, it shouldn’t really even be considered a collateral package in the same way as the others are. It’s sole purpose is to provide emergency liquidity in the case of a market crash. It has no bearing on monetary policy. My understanding was always base rate = primary monetary policy lever. There is no monetary policy advantage to modifying the stability fee on USDC-B, nor should there be (because that isn’t its purpose.) For the reason it doesn’t make sense to me to have it affected by the base rate. What Lev posted in the other thread made sense to me, we’re going to need to move to a world where different collateral packages fall under different categories depending on asset and intention. I don’t think it makes sense to have emergency auction liquidity packages subject to base rate, monetary policy type changes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.021929824561403
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#10",
                    "likes": "1",
                    "time": "22/05/2020-14:29:39",
                    "content": "So I guess we are looking at the same point of moving the Stability Fee around 50% doesn’t change the behaviour really at all, and taking opposing view points. I’m saying if it doesn’t matter then why care if it moves up 5% or down 5%, and you are saying if it doesn’t matter why bother moving it up and down with the Base Rate changes. I get your point, and honestly I don’t have strong feelings beyond “let’s not break the governance paradigm until we have to” for this specific case. What may be more problematic is a fixed rate collateral type where the Stability Fee is low enough that the Base Rate overtakes it. We then may get some weird DSR minting behaviour that is undesirable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.7936507936507935
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "4",
                    "time": "22/05/2020-14:35:20",
                    "content": "    hexonaut:  So I guess we are looking at the same point of moving the Stability Fee around 50% doesn’t change the behaviour really at all, and taking opposing view points.   Pretty much. I actually don’t think it matters a huge amount for that reason. My feeling towards breaking the governance paradigm is that it makes sense for cases like this in general (packages that aren’t intended to be modified to support monetary policy objectives), but in this specific case it doesn’t actually make a huge amount of difference. Not wanting to change it until we have to is also a reasonable position though. I still think that it should be exempt, but it’s not going to break my heart if it’s subject to the base rate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#12",
                    "likes": "2",
                    "time": "22/05/2020-21:38:34",
                    "content": "    hexonaut:  What may be more problematic is a fixed rate collateral type where the Stability Fee is low enough that the Base Rate overtakes it. We then may get some weird DSR minting behaviour that is undesirable.   For this reason, I don’t think it is the best idea to add collateral types with a hard coded fixed stability fee. I also don’t think we should be moving to a SF = ab + x system anytime soon, but see this as a good solution later in time (let’s say 6-12 months from now). The USDC-B SF can be kept fixed by adjusting the Risk Premium in step with the Base Rate if desired. But I would propose setting the initial SF to 45% and be content as long as it stays between 45% and 55%. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.019444444444444
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/dmm-proposal-for-collateral-onboarding-of-dmm-mtokens/2141",
            "title": "[DMM] Proposal for Collateral Onboarding of DMM mTokens ",
            "index": 2141,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ZacharyDMM",
                    "index": "#1",
                    "likes": "2",
                    "time": "22/04/2020-21:21:19",
                    "content": "1. Who is the interested party for this collateral application? The DeFi Money Market Foundation (DMMF), consistenting of Gregory Keough, Derek Acree, Corey Caplan, Adam Knuckey, Matthew Finestone, and Zachary Rynes on the behalf of the DMM DAO. 2. Provide a brief high-level overview of the project, with a focus on the applying collateral token The DeFi Money Market (DMM) Ecosystem is a protocol built on Ethereum that brings interest-generating real world assets on-chain into Ethereum in a transparent and trust-minimized manner enabling DeFi users to earn a stable uncorrelated yield (currently 6.25% APY). Users gain exposure to these assets by depositing their Ethereum digital assets (e.g. DAI USDC) into the DMM Ecosystem and receive back a corresponding mToken (e.g. mDAI mUSDC) representing a claim on their deposit (like Compound cTokens). A portion of these deposited funds are then used to purchase interest generating real-world assets and the rest is left in the contract for withdrawal liquidity. Users can hold, transfer, and trade mTokens in any Ethereum wallet as tokens are fully ERC20 compliant. There is a blacklist, but there is no whitelist for mTokens. Users can redeem their mTokens to withdraw their share of the underlying digital asset that was originally deposited plus interest generated. mTokens are overcollateralized in terms of both the valuation of real-world assets (collateral worth ≥100% of mToken value) and in the interest streams those assets generate (generates more than 6.25% APY). As such, mTokens are stable and predictable in value compared to cryptocurrencies such as ETH, making it an excellent addition to the MakerDAO credit system as an uncorrelated collateral option for users and the DMMF to mint DAI against real world assets. mTokens are currently overcollateralized with $8.5M in automobiles within the United States. More information can be found on-chain or on our Explorer page. 3. Provide a brief history of the project The DeFi Money Market (DMM) was launched in March 2020 in partnership with Chainlink to bring real world assets into Ethereum’s DeFi ecosystem. DMM has also been backed by Billionaire Tim Draper’s Venture Studio who purchased a stake of the DMM DAO. Since release, over $245k worth of mTokens have been purchased on the Swap app with mTokens now supported on the Trust Wallet and Coinbase Wallet. The DeFi Money Market is built to enable anyone to earn a stable yield on their digital assets in a permissionless and borderless manner, requiring nothing more than an internet connection and an Ethereum address. The DeFi Money Market Foundation (DMMF) is currently overseeing the DMM protocol, but ownership of the protocol, real world assets, and off-chain fiat holdings will be transferred to the DMM DAO which will be run and managed by a distributed group of DMG governance token holders. Decentralization of DMM is a continual work in progress, but we are working to ensure DMM is as transparent and trust-minimized as possible. 4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. Whitepaper Github Swap page Explorer page  DMM1.PNG1336×790 141 KB   DMM2.PNG1405×909 237 KB  DMM Controller Contract: 0x4CB120Dd1D33C9A3De8Bc15620C7Cd43418d77E2 mDAI Token: 0x06301057D77D54B6e14c7FafFB11Ffc7Cab4eaa7 mUSDC Token: 0x3564ad35b9E95340E5Ace2D6251dbfC76098669B Off-chain Assets Valuator: 0xAcE9112EfE78D9E5018fd12164D30366cA629Ab4 Underlying Token Valuator: 0x693AA8eAD81D2F88A45e870Fa7E25f84Ca93Ca4d Blacklistable: 0x516d652E2f12876F5f0244aa661b1C262a2d96b1 DelayedOwner: 0x9E97Ee8631dA9e96bC36a6bF39d332C38d9834DD 5. Link any available audits of the project. Both procedural and smart contract focused audits. DMM is currently undergoing a Smart Contract security audit which is being performed by the security firm SECBIT who previously audited Loopring, DDEX, and more. The audit process thus far has been positive with no critical issues found and the final report will be published publicly once complete. 6. Link to any active communities relating to your project. Discord Telegram Twitter 7. How is the applying collateral type currently used? mTokens (mDAI mUSDC) are currently being used by Ethereum users to earn 6.25% on their digital assets by gaining exposure to interest-generating real world assets. As mTokens are ERC20 compliant, they can be transferred using any regular Ethereum wallet. We are working with various DeFi protocols, aggregators, and portals so mTokens can be utilized by the most users. We believe adding mTokens as collateral in the MakerDAO credit system (Vaults) can boost the overall liquidity of DAI and help act as a peg stabilizer as these assets are uncorrelated to cryptocurrencies such as ETH and have minimal opportunity cost as mTokens are interest generating enabling users to get the most utility out of their deposited funds, namely stablecoins. 8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? Currently the DeFi Money Market Foundation (DMMF) holds and owns the contractual rights to the underlying collateral (real world assets) through a first lien, senior-secured position meaning it is above all other rights and has first priority in the event of lack of payment. The DMMF was established and has an office in the United Arab Emirates in cooperation with the UAE government’s Dubai International Financial Centre (DIFC). The DIFC is home to an internationally recognized, independent regulator and a proven judicial system with an English common law framework being the leading financial hub for the Middle East, Africa, and South Asia regions. However, ownership of the protocol, its real world assets, and fiat currency reserves will be transferred from the DMMF to the DMM DAO which will substantially reduce any single points of failure. The beginning process to the decentralization of governance, starts with a transitional DAO acting as custodian, essentially the role the DMMF’s core team fulfilled in the ecosystem at implementation. This initial transition will remove central points of control and help ensure that the protocol is unable to be captured or censored, while also moving control of the treasury from the core team members to a DAO. Functionally, this will look like multiple independent teams financed by revenue from the DAO to maintain critical functions for the ecosystem’s protocol. The DMM DAO will be established after the transitional DAO, and while the structure is to be determined, the core team’s initial view is to develop a representative democracy. The ultimate goal is to decentralize control of the DMM Ecosystem and its collateral as much as possible. 9. Where does exchange for the asset occur? Wrapping and unwrapping of mTokens occurs on the DMM Swap app, but we are working with 1inch.exchange to get listed and enable any token <-> mToken swapping capability. The underlying digital assets that can be wrapped in mTokens or redeemed from mTokens like DAI and USDC are already highly liquid in DeFi applications and exchanges. The redeeming process is subject to the digital asset liquidity available in the mTokens contract (portion not sold for real world assets), but secondary markets can be created on various decentralized exchanges to fuel extra liquidity as needed. An easy way to bootstrap this is with uniswap v2 pools, e.g. DAI/mDAI and USDC/mUSDC pairings. 10. (Determined by Legal Domain Team) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. We do not have a legal opinion or memoranda at this time. 11. (Determined by Legal Domain Team) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. We do not have any regulatory registrations for mTokens at this time. 12. (Optional) List any possible oracle data sources for the proposed Collateral type. A simple oracle to use would be the exchange rate built into each mToken that relays how much underlying digital assets each mToken can be redeemed for. For example mDAI can be redeemed for DAI, mUSDC to USDC, and then the stablecoins can either be assumed to be $1 in value or can be priced by using a price feed such as Chainlink’s DAI/USD reference network. In summary, valuation can be calculated by multiplying the built-in exchange rate in the mToken contract by how many mTokens are used as collateral and then multiplied by either a static value 1 or by the Chainlink/Maker price feeds for DAI/USD and USDC/USD. 13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type. This is a function that the DMM Foundation could help perform and bootstrap, but a distributed set of liquidators would be the ideal solution. Liquidations of mTokens have the interesting property that the liquidator can redeem their received mTokens for the underlying digital asset (DAI for mDAI, USDC for mUSDC) given that there is enough reserve liquidity of digital assets that haven’t been withdrawn. Initially the reserve ratio for withdraw liquidity is currently set at 50%, but is currently residing at 100% as to grow liquidity. If there is too little liquidity in the mToken’s digital asset reserve (due to user withdraws), liquidators can then either trade their mTokens on secondary markets or redeem their mTokens at a later date when the liquidity has returned due to either user deposits or the Foundation (eventually DMM DAO) liquidating a portion of the real world assets to purchase back the underlying digital asset and deposit it into the mToken contract. We’re excited to work with the Maker community as we believe adding DMM’s mTokens would be a mutually beneficial relationship for both projects. If you have any questions, feel free to comment below or contact us directly. Thank you! ",
                    "links": [
                        "https://www.linkedin.com/in/derekacree/",
                        "https://www.linkedin.com/in/corey-caplan/",
                        "https://www.linkedin.com/in/adam-knuckey-720612108/",
                        "https://www.linkedin.com/in/matthew-finestone-cfa-7bb8ba51/",
                        "https://www.linkedin.com/in/zachary-rynes-a98417173/",
                        "https://defimoneymarket.com",
                        "https://etherscan.io/address/0x4cb120dd1d33c9a3de8bc15620c7cd43418d77e2#readContract",
                        "https://explorer.defimoneymarket.com",
                        "https://chain.link",
                        "https://cointelegraph.com/news/billionaire-tim-draper-sees-potential-in-defi-and-backs-new-dao",
                        "https://defimoneymarket.com/DMM-Ecosystem.pdf",
                        "https://github.com/defi-money-market-ecosystem/protocol",
                        "https://app.defimoneymarket.com/",
                        "https://explorer.defimoneymarket.com/",
                        "https://discord.gg/nTSgC9h",
                        "https://t.me/DmmOfficial",
                        "https://twitter.com/DMMDAO",
                        "https://fintechhive.difc.ae/",
                        "https://app.defimoneymarket.com",
                        "https://feeds.chain.link/dai-usd",
                        "https://forum.makerdao.com/t/informal-poll-should-makerdao-require-american-vault-owners-to-also-stake-insurance-protection/9674/9"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Board composition",
                        "Change to proposal pipeline"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.463446340481224
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#2",
                    "likes": "4",
                    "time": "22/04/2020-22:30:46",
                    "content": "Hi DMMF Team, Thank you for submitting this proposal! I have a background in consumer lending and securitization so I have a few questions about your underlying product:  In your explorer, a value is listed for each underlying asset. It looks like this is the value of the loan, not the vehicle value. Is this correct? What sort of loan to value ratios do you allow into your underlying loan portfolio? What sort of credit and income underwriting requirements? What is the weighted average interest rate, FICO, DTI, and LTV of the portfolio of underlying assets? If you can point me to any further resources where this information is available that would be appreciated. Do you originate the loans yourself, or service and collect on the loans? If not your organization, how is this managed? How do you mitigate the risk of loan contracts being invalidated due to violations of US consumer lending regulations? What concrete ownership rights or legal claims do mToken holders have on the underlying collateral pool (loans and liens)? Is there an SPV or trust structure in place to ensure that the Tokens are “bankruptcy remote” in the even that DMMF or DMM DAO became insolvent? mTokens would clearly be considered securities by US authorities, yet you do not preform any KYC before directly offering tokens to users. How are you mitigating the risk of selling unregistered securities to US persons? Could you conceivably be forced to retroactively require KYC before permitting redemptions? Auto loans are a fundamentally illiquid asset. How would you be able to meet large redemption requests on short notice if most of your funds are invested in loans?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.465401785714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#3",
                    "likes": "10",
                    "time": "22/04/2020-22:51:52",
                    "content": "My understanding of DMM in it’s current highly-centralized iteration:   DMM allegedly owns liens on used vehicles in the US (although proper proof has not been provided to the public)   Users purchase mTokens from a pre-minted amount owned by DMM using ETH, DAI or USDC   DMM converts the crypto to USD which is allegedly used solely to service the used car loans, and repurchases the crypto when the user/depositor wants to redeem their mTokens (supposedly on demand)   DMM manually purchases ETH options from Deribit to protect against volatility in ETH after they convert it to USD.   Among the areas of major concern that I would like to see DMM satisfactorily address before this application goes anywhere:   DMM has not provided proof that it actually owns the liens on the used cars. This is critical since it is supposedly the way that APY is being generated for users/depositors. There are scans of car titles posted on their website however all personal info is redacted and “DMM Foundation” is photoshopped on to each scan (example).   It has not been proven that 100% of user deposits are used to service the actual car loans. There is no transparency offered into the usage of the funds after they are converted to USD.   No additional info has been provided about these loans, including the creditworthiness of the lendees, if the loans are even being paid off, or DMM’s ability to repossess vehicles if loans go unpaid. It is highly likely that a large number of the loans are delinquent, but users have no idea how that may affect their ability to earn interest or get their ETH/DAI/USDC deposit back.   The conversion of ETH/DAI/USDC to USD and vice versa, as well as the purchasing of ETH options, are currently being done manually. This system has not been thoroughly tested and has a high likelihood of failing in periods of major volatility.   With its (alleged) direct connection & interaction with real-world assets, it seems highly likely that DMM will face regulatory issues in the very near future that could force major changes in the way that it is structured and the way that mTokens are sold/redeemed.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1857886904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ZacharyDMM",
                    "index": "#4",
                    "likes": "1",
                    "time": "27/04/2020-20:24:20",
                    "content": "Thank you for the great questions everyone! I will compile these so our team can provide answers in a new document and provide an update here at a later time ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.893939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#5",
                    "likes": "5",
                    "time": "15/05/2020-04:10:58",
                    "content": "Oracle Team Collateral Onboarding Evaluation V1.0.5 Author: Niklas Kunkel (Oracle Team) Contributors: Date: 05/14/20 Explanation of the Oracle Team Collateral Onboarding Methodology Economic Impact How much Dai can be expected to be generated against mDAI and mUSDC? Concrete Data: Token Contract Address: mDAI - 0x06301057D77D54B6e14c7FafFB11Ffc7Cab4eaa7 mUSDC - 0x3564ad35b9E95340E5Ace2D6251dbfC76098669B Circulating Token Supply:  13,916.2556* mDAI 136,084.893* mUSDC  Token Market Cap of Circulating Token Supply ( TMC ):  mDAI => 15,419.50 mUSDC => $138,886.40.  Total Number of Holders:  mDAI: 33 mUSDC: 22  Token Distribution:  mDAI: Top 5 holders hold 89.6% of Circulating Token Supply mUSDC: Top 4 holders hold 90% of Circulating Token Supply  Avg Collateralization Ratio of Maker Protocol ( avgCR ): 361.38% *this excludes: DMM mDAI Token Contract DMM mUSDC Token Contract Assumptions:   Assume a reasonable minimum collateralization ratio ( minCR ) based off empirical values in collateral portfolio. Since mDAI and mUSDC is likely to be at least as risky as ETH/BAT, let’s assume minCR = 150%. Note that the reason the risky isn’t on the same level as USDC with a minCR of 120% is that the issuer can withdraw the DAI and USDC deposited in the contract to purchase loans and as such there’s no guarantees there will be sufficient liquidity to redeem and mDAI/mUSDC into its DAI/USDC counterpart.   Market Cap Utilization ( MCU ), the amount of the TMC that can reasonably expect to be deposited in the Maker Protocol, is bounded by empirical values in collateral portfolio. Currently the lowest and highest MCU in the Maker Protocol are [0.73%, 3.73%]   Formulas: Estimated Lower Economic Impact = TMC * MIN(MCU) / avgCR  Estimated Lower Economic Impact  = $154,305.90 * .0073 / 3.6138 = 311.70 DAI  Estimated Upper Economic Impact = TMC * MAX(MCU) / minCR Estimated Upper Economic Impact  = $154,305.90 * .0373 / 1.5 = 3,837.07 DAI  Due to the average of the estimated lower and upper economic impact, the Oracle Team is assigning DMM a Low Economic Impact label Given the distribution of token holders relative to the total number of token holders, how many users with significant sums of the proposed collateral are we reasonably targeting with this integration? ~8 people (90th percentile) Technical Complexity Determine how complex integrating Oracles for this collateral type would be and how long it would take to implement such a solution. Is a solution currently not possible because of a key missing component? Coming up with a way to price mDAI and mUSDC would be exceedingly difficult as the Oracle Team could not identify and reputable exchanges trading significant volume of mDAI nor mUSDC. Are there enough high quality data sources available to construct a reliable, resilient, and secure Oracle for the proposed collateral asset? No, see above. Can the current tooling support the types of data sources that are needed? N/A Can the current tooling support the types of data modeling that are needed? N/A Does adding these features interfere with ongoing or planned development of new tooling on the Oracle Team roadmap? R&D to develop a secure and reliable data model given the lack of exchange liquidity would require significant resources which would detract from Oracle protocol development and other collateral onboarding applications. What dependencies (both technical and system), risks, costs, and latency are added to the Oracle Protocol as a function of these added features? High Oracle risk would be associated mDAI and mUSDC given the constraints mentioned above. Does adding these features require work from other stakeholders such as the Smart Contracts Team(s)? No. How long would it take to design, implement, test, and deploy such a solution? 2 months to develop and test. Given the complex nature of the mDAI and mUSDC integration the Oracle Team considers these a High Technical Complexity project. Evaluation The combination of Economic Impact mapped against the Technical Complexity of onboarding a new collateral type can paint a picture of whether an Oracle Team ought to accept, decline, or defer a collateral onboarding application.      Low Technical Complexity High Technical Complexity     Low Economic Impact maybe decline   High Economic Impact accept maybe    Low Economic Impact x High Technical Complexity => decline Reccomendation Considering this project is fairly new it’s not surprising that it hasn’t accumulated a critical mass of users yet. As it stands at the moment, the amount of Dai that could be generated from the inclusion of mDAI and mUSDC is extremely low, while the complexity of creating Oracles for tokens that haven’t gained much if any liquidity on exchanges is significant and comes with high risk of Oracle failure or manipulation. The combination of extremely low economic impact and high technical complexity to implement an Oracle inclines the Oracle Team to decline the mDAI and mUSDC colalteral onboarding application. ",
                    "links": [
                        "https://etherscan.io/token/0x06301057D77D54B6e14c7FafFB11Ffc7Cab4eaa7",
                        "https://etherscan.io/token/0x3564ad35b9E95340E5Ace2D6251dbfC76098669B",
                        "https://etherscan.io/address/0x06301057d77d54b6e14c7faffb11ffc7cab4eaa7",
                        "https://etherscan.io/address/0x3564ad35b9e95340e5ace2d6251dbfc76098669b",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/8"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.40009293242989
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#6",
                    "likes": "1",
                    "time": "15/05/2020-09:26:01",
                    "content": "    NikKunkel:  CHZ   Ahem, assuming you meant DMM here  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/shuttlenaut",
                    "index": "#7",
                    "likes": "0",
                    "time": "15/05/2020-09:29:33",
                    "content": "why is CHZ mentioned here? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#8",
                    "likes": "5",
                    "time": "15/05/2020-09:40:28",
                    "content": "Apologies for the misnomer, I copy paste the template to get the formatting the same but I can assure you the numbers and descriptions are for mDAI and mUSDC. Have also expanded the description a bit to explain why the mDAI/mUSDC minCR can’t be treated like other stablecoins such as USDC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#9",
                    "likes": "1",
                    "time": "17/05/2020-15:47:01",
                    "content": "Hi Zach @ChrisBlec did a nice job summarizing the high level issues this token will have, especially on the ultimate ownership and liquidations/auctions issues. Has your team  prepared its responses yet? I’ll also note that I have written extensively about these issues for two other collateral on-boarding applications (Paperchain and Consulfreight). The community is seeing that these tokens are problematic if the real-world legal/regulatory questions aren’t answered correctly (like deciding on a means to white list auction participants). That said, I hope the teams do not interpret the push back as anti-security token. Far from it, I think those, in part, are vital to the system’s growth and ability to thrive. But we will shoot ourselves in the foot early if not done cautiously. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#10",
                    "likes": "6",
                    "time": "05/02/2021-23:11:18",
                    "content": "Just wanted to note this here:   twitter.com    DMM DAO (DMMDAO)  As a result of regulatory inquiries, DMM is ceasing operations. mTokens can be redeemed with interest accrued to-date through the following link: app.defimoneymarket.com  10:05 PM - 5 Feb 2021     84          48            We must remain vigilant against low quality assets. ",
                    "links": [
                        "https://twitter.com/DMMDAO/status/1357812538084360196?s=20",
                        "https://app.defimoneymarket.com/",
                        "https://twitter.com/DMMDAO/status/1357812538084360196?s=20"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#11",
                    "likes": "5",
                    "time": "05/02/2021-23:26:00",
                    "content": "So. Much. This. We have to scrutinize the hell out of RWA. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#12",
                    "likes": "4",
                    "time": "06/02/2021-03:21:54",
                    "content": "Not happy to see any project go down in flames but clearly this one had issues…this development is ever more reason for us to look critically at every RWA project continuously and question the assumptions built into each one. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.044444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#13",
                    "likes": "4",
                    "time": "07/08/2021-04:06:59",
                    "content": "As Monet said last February, it’s key to stay vigilant on any collateral type coming into the Protocol (like DMM of course). The SEC order  is an interesting one and should give us pause with other RWA that lack the involvement of regulated intermediaries (such as regulated trust companies). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.229166666666667
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/proposal-for-collateral-onboarding-of-usdc/1588",
            "title": "Proposal for Collateral Onboarding of USDC ",
            "index": 1588,
            "category": [
                "Governance"
            ],
            "tags": [
                "stablecoin",
                "emergency-response",
                "usdc",
                "covid-crash"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#1",
                    "likes": "10",
                    "time": "16/03/2020-19:54:17",
                    "content": "Hey all, Due to the on-going liquidity situation and Dai price instability, we need to make a quick decision on risk parameters such that the executive can go on-chain as quickly as possible. We are targeting getting the executive vote on-chain as soon as the GSM delay is changed to 4 hours. The contents of said executive vote will be influenced by the outcome of these polls. First, the Interim Risk Team presents a note on oracles and liquidation given the nature of USDC as collateral. Then we follow with a brief summary of the tradeoffs for each of the major risk parameters (Stability Fee, Debt Ceiling and Liquidation Ratio) with respect to the emergency onboarding of USDC collateral as part of the effort to increase Dai liquidity. Following a description of the tradeoffs, the Interim Risk Team presents a number of polls that will be used to gather community sentiment and feed into the risk parameters included in the executive vote. Initially, the plan was to present combined risk parameter packages, however, after consideration, separate polls for each of the key risk parameters were determined to be more appropriate. The main goals that MakerDAO should aim to achieve with the introduction of USDC as an emergency collateral type are as follows:  Increase Dai liquidity specifically for keepers taking part in both FLIP and FLOP auctions. Increase Dai liquidity such that the Dai peg moves closer towards $1.  Oracles and Liquidation Due to the nature of the collateral and the time constraints, it is proposed that the oracle price of USDC be set to $1 for the purposes of this Vault. The governance community can consider migrating to another oracle solution in the future. Under normal circumstances setting the oracle price to $1 would still allow liquidations due to accrual of stability fees. However, the collateral type will launch with the new “collateral liquidation freeze” component switched on. Vault users will not be subject to any liquidations in the short term, even with the accrual of stability fees. Please note, however, that Vault users may be at risk when the liquidation freeze is removed in the future. As always in a non-custodial, permissionless and decentralized system, users alone are responsible for their Vaults. Debt Ceiling There are three main drivers to consider for the USDC debt ceiling. The primary use case is to provide keepers with access to Dai liquidity should they need it to participate in ETH flip auctions. Based on an analysis of the current structure of the Vault portfolio, if Eth were to fall into the $60-$80 range, the set of keepers would collectively need to raise ~20 million Dai amongst themselves. The secondary use case is to provide liquidity for Dai markets, where the Dai price has been trading as high as $1.10. A high debt ceiling would allow market makers to absorb the excess Dai demand seen on centralized exchanges as well as on supply shortages seen on secondary lending platforms such as Compound and dYdX. Thirdly, the community may want to allow additional debt ceiling room to facilitate DeFi users to refinance their outstanding positions from secondaries back to Maker Vaults. The benefit of this is that Maker governance would be able to more directly influence the liquidity situation for the broader ecosystem. A final consideration for debt ceiling is the risk of “blacklisting” by the issuer of USDC or another entity in control of this function. If such a situation were to arise, MKR holders could conceivably need to mint additional MKR via the debt auction in order to cover any potential shortfall from a blacklisting event. Depending on how aggressively the community wants to address these three issues, the debt ceiling could conceivably range anywhere from $10 million to $40 million. Please keep in mind that a more conservative or more aggressive debt ceiling can always be increased / decreased through governance (subject to the 4 hour GSM delay). This will allow the Interim Risk Team and MKR Holders to reevaluate a highly evolving situation, at a tradeoff of governance overhead. Liquidation Ratio Liquidation ratios are typically expected to be fairly low for fiat-backed stablecoins due to their low volatility. However, in this particular instance, governance is targeting highly specific use cases, and the community may be susceptible to a rationing risk. For example, a 102% LR allows for 50x recursive leverage. This means that a user with only 1 million USDC could deliberately soak up the entire debt ceiling through recursive leverage. Spreading the USDC over multiple users should mean that on average more of it will go towards the intended use-cases. Similarly, too high of a liquidation ratio (such as the 150% LR for ETH) is a potentially inefficient use of collateral. As a comparison, secondary lending platforms typically target a 125%-135% range. As a result, a 125% LR is suggested. Stability Fee The stability fee should be set with the community’s specific use cases in mind (auction keeper liquidity and Dai peg management). The primary consideration is that the stability fee should be set high enough so that the limited debt ceiling is not utilized for any alternative use cases that don’t alleviate keeper liquidity or the Dai peg. Too low of a stability fee could cause just a few Vault owners to utilize the entire debt ceiling. Therefore, a high stability fee can price out these Vault owners. Another consideration is secondary lending platforms, which currently carry a 17%-45% lending rate for Dai due to the high utilization rate. If the stability fee is below these amounts, then a significant amount of Dai will be generated to immediately lend to these other platforms. This is not necessarily undesirable, but it is not one of our primary goals, and the debt ceiling could be hit very quickly. At the same time, too high of a stability fee may cause fewer Vault owners to take advantage of this collateral type, reducing the effectiveness of the collateral type. Due to the competing dynamics, governance should be vigilant in adjusting the stability fee appropriately based on changing market environments. The community should be aware, however, that it will be easier to start high and lower the stability rather than the opposite. Liquidations would be disabled at the launch of the collateral type. However, the following are proposed auction parameters subject to the removal of the liquidation freeze. Liquidation Penalty The liquidation penalty is suggested to remain at 13% for similar reasoning as other Vault types. The liquidation penalty cannot be too low due to the auction grinding attack vector. Auction Lot Size An auction lot size of 50,000 USDC is proposed for similar reasoning as other Vault types. Lot sizes that are too low cause significant friction with respect to network congestion and usage. Lot sizes that are too high price out many individual smaller keepers. To strike a balance between network congestion and participation, a 50,000 USDC lot size is suggested. Auction Bid Duration A bid duration of six hours is suggested for similar reasoning as other Vault types. Too low of a bid duration can be dangerous due to potential network congestion issues. Too long of a bid duration means the keeper will incur additional price volatility risk Minimum Bid Increment A bid increment of 3% is suggested for similar reasoning as other Vault types. Maximum Auction Duration A maximum auction duration of 3 days is suggested since liquidations might occur under uncertain circumstances. For example, if the market price of USDC is trading at $0.50 (yet the fixed oracle is still displaying $1), then Vault owners are incentivized to max out their Dai generation, which would lead to mass liquidations soon after. In such a scenario, the community might want to keep auctions running for several days in order to facilitate the liquidation process. Dust Limit A dust limit of 20 is suggested for similar reasoning as other Vault types. This decreases the risk of spam Vaults being created. ",
                    "links": [
                        "http://makervaults.descipher.io/",
                        "https://github.com/livnev/auction-grinding/blob/master/grinding.pdf",
                        "https://forum.makerdao.com/t/usdc-b-proposal-for-collateral-onboarding/2582",
                        "https://forum.makerdao.com/t/onboarding-usdc-as-collateral-to-mitigate-liquidity-risk/1570",
                        "https://forum.makerdao.com/t/informal-poll-curve-basepool-composition/15347",
                        "https://forum.makerdao.com/t/the-history-of-a-dai-at-par-value-what-can-we-learn-from-it/12310"
                    ],
                    "GPT-summary": "The post presents a proposal for the collateral onboarding of USDC. The proposal includes a discussion of the risk parameters, such as the stability fee, debt ceiling, and liquidation ratio, and how they relate to the emergency onboarding of USDC collateral. The post also includes a number of polls to gather community sentiment and feed into the risk parameters included in the executive vote. The proposal is open to feedback and constructive criticism, and the author provides detailed explanations for each of the proposed risk parameters.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.238220457228722
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "5",
                    "time": "16/03/2020-20:04:05",
                    "content": "Hey guys, here are the polls that Cyrus suggested would be appropriate given the above post and risk considerations for USDC. Based on the ongoing liquidity risk and variable market, these polls will be live for at least an hour before the executive goes on-chain. Anything past that is bonus time. I would urge everyone to signal as soon as possible. Poll 1 - Initial USDC Debt Ceiling     $10 million $20 million $30 million $40 million     0 voters     Poll 2 - Initial USDC Stability Fee     15% 20% 25% 30%     0 voters      For both of these polls, you can vote on multiple options. Please vote for anything you would vote for in an on-chain executive vote.  Edit: By request, here is a yes/no poll for USDC. Poll 3 - Should we emergency onboard USDC as a collateral type to help mitigate Dai liquidity issues?     Yes No     0 voters     Please note that I think there will be an executive regardless of the outcome of poll 3, it is mainly serving as a barometer for off-chain community sentiment at this time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.126515151515152
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#3",
                    "likes": "7",
                    "time": "16/03/2020-20:22:18",
                    "content": "There is a significant amount of urgency related to this exec. A large number of ecosystem actors and liquidity providers need to coordinate in a timely manner in order to further secure the system. The community may not have more than an hour to collect signals before this proposal needs to be moved into the portal. There is a possibility that if the OSM price remains constant over the course of the next hour we might be able to extend the debate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.105158730158731
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#4",
                    "likes": "1",
                    "time": "16/03/2020-20:33:17",
                    "content": "    cyrus:  A final consideration for debt ceiling is the risk of “blacklisting” by the issuer of USDC or another entity in control of this function. If such a situation were to arise, MKR holders could conceivably need to mint additional MKR via the debt auction in order to cover any potential shortfall from a blacklisting event.   Is there any legal opinions/analysis on the likelihood of this happening? Another 10 mil via debt auctions would be bad. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "1",
                    "time": "16/03/2020-20:37:39",
                    "content": "In the early part of the Governance and Risk Call this was discussed. Check it out:  https://www.youtube.com/watch?time_continue=1&v=YZFfGlp01q0&feature=emb_logo I Like when Chris P. points out that Tornado Cash uses USDC haha ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#6",
                    "likes": "0",
                    "time": "16/03/2020-20:38:13",
                    "content": "Perfect, watching now ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/EthWarrior",
                    "index": "#7",
                    "likes": "2",
                    "time": "16/03/2020-20:48:23",
                    "content": "Rather simply encourage Dai holders to sell Dai for USDC and also impose negative SF than using USDC as a collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#8",
                    "likes": "2",
                    "time": "16/03/2020-20:48:56",
                    "content": "As I stated in governance and risk - using one option here and not doing a second or even third one at the same time centralizes blacklisting risk.   It increases this as a hazard and basically kills the whole scenario as a valid option.  Doing two more means one of them should work (TUSD since they applied and maybe PAX as possible options) same parameters but spread DC’s should suffice. If we see they all go we can manage the DC’s appropriately. Secondly with respect to starting up liquidations - please make sure to give enough warning time before turning those on - 48hrs minimum. I have a problem with 15% SF but honestly want this to start low vs. high as suggested.  You guys actually want people to use this don’t you? I also want to urge to start the DC on the low side vs. going high immediately and to urge putting up a new executive with MCD DC going from 100M to say 80M to limit any sort of MCD minting attacks.   Even $75M would not be unreasonable. The other hazards is that PEG quickly reverses hard and the hope is the users of the facilities will mop up the excess DAI at profit…   This will need to be watched carefully and is a real risk here.  This is particularly true if markets fall and collateral is auctioned at some point when/if vault collateral is cleared in auction the need for DAI will dry up faster than it is being created the reversal move here is going to have to be swift as well - probably by using the USDC SF to mop it up and a looming turning on liquidations announcement which may whipsaw liquidity again. I want to urge the community here.  Start and try to move slower than you think because fast moves could just drive this system to an unmanageable state. MKR market cap is $170M, TOTAL outstanding here is $83M  If I have correct number - even if all collateral liquidates at 50% the hook here for MKR is at most $30M and falling.   EDIT ADD: 83M*.63 = 52.3 which leaves about $30M potential gap.  .63=.5(avg sale price) - .13 liquidation fee. I also would urge a better control over auction mechanics and an absolute minimum floor on ETH price that Maker would rather choose to ride the collateral with vault owners than liquidate it. I have this price around $30 ETH but have no clue where MKR cap will be then perhaps $50-60M frankly at that point most people are en effect pretty wiped out except everyone trying to participate in a growing USDC/DAI fund to stabilize these markets and MKR will have ~10M or so of USDC in coffers to cover as well. I also want to note from what I’m seeing it looks like ES is completely off the table here - so basically no-one is talking about conditions for ES which is the alternate approach to consider here while the OSM and market prices are still rather ‘intact’ and not ‘dis-located’ - thinking one can do an ES with OSM live market price dislocation is probably the worst time to ES this. Maybe rather than go through all these convolutions an ES is better.  Honestly on the fence here and about all I have to say at this point.   Seriously consider adding at least one more stable coin to this endeavor than USDC to spread the blacklist event risk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.628999295278366
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#9",
                    "likes": "3",
                    "time": "16/03/2020-20:55:12",
                    "content": "Hey, Ryan from TUSD here. We would love to re-open the conversation about TUSD being added as a form of collateral. We submitted an application in September of 2019 (Link). Let me know what we can do to support ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "0",
                    "time": "16/03/2020-20:57:28",
                    "content": " Edit: Now closed, thank you to all who signalled.  5 minute warning. These are closing on the hour. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#11",
                    "likes": "1",
                    "time": "16/03/2020-21:02:02",
                    "content": "If Circle can freeze the whole pool this basically will give Circle power to end Maker in this situation right? Atleast initiate another deep mkr minting event. I have no idea about the relationships with that group, but DAI is still a competitor right? Maker is different than compound, tornado, dy/dx ect. Dammit wanted to get rid of my vote… oh well probably doesn’t make a difference ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.771428571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#12",
                    "likes": "0",
                    "time": "16/03/2020-21:03:01",
                    "content": "    MakerMan:  I also want to urge to start the DC on the low side vs. going high immediately and to urge putting up a new executive with MCD DC going from 100M to say 80M to limit any sort of MCD minting attacks. Even $75M would not be unreasonable.   What are the current ceilings? ETH at 100m, BAT at 3mil, Dai at ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.370454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#13",
                    "likes": "0",
                    "time": "16/03/2020-21:08:48",
                    "content": "Most of us know this but for the new viewers: the dust hasn’t settled on this process yet but we operate on a weekly voting cadence. Let’s consider improvements and/or fixes the community may want to see for the regularly scheduled vote on Friday. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "0",
                    "time": "16/03/2020-21:15:38",
                    "content": "Hey Ryan, thanks for not kicking off about this. We recognise you guys were one of the first to apply. We may want to onboard more stablecoins in the coming days - things are moving pretty fast. Thanks for confirming you are still interested  On a happier note, the first (as yet unratified) version of the collateral onboarding process was posted. Maybe take a look if you haven’t seen it. Collateral Onboarding Process (v1) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dawson",
                    "index": "#15",
                    "likes": "0",
                    "time": "16/03/2020-21:21:07",
                    "content": "    MakerMan:  MKR market cap is $170M, TOTAL outstanding here is $107M - even if all collateral liquidates at 50% the hook here for MKR is at most $30M and falling.   @MakerMan I’m not sure I understand what you mean. What is “total outstanding” in this context?  How did you come to $30M     MakerMan:  This is particularly true if markets fall and collateral is auctioned at some point when/if vault collateral is cleared in auction the need for DAI will dry up faster than it is being created the reversal move here is going to have to be swift as well - probably by using the USDC SF to mop it up and a looming turning on liquidations announcement which may whipsaw liquidity again.   I think this is a really important point. Dai is trading above peg because of abnormally high demand. Could we lower price by decreasing demand instead of increasing supply? We could decrease demand by slowing the auctions down, and should probably base the auction rate on the average volume of Dai markets under “normal” conditions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.06741452991453
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#16",
                    "likes": "0",
                    "time": "16/03/2020-21:25:11",
                    "content": "The executive is now live: https://vote.makerdao.com/executive-proposal/proposal-for-collateral-onboarding-of-usdc ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#17",
                    "likes": "0",
                    "time": "16/03/2020-21:25:24",
                    "content": "I agree with dawson. Let’s reduce liquidations of ETH for a while. The high Dai price is almost all people with large vaults dumping their ETH to push down their liquidation point. Actual demand for Dai with a significant bid behind it begins around $1.02. The rest is arb driven with thin books. We don’t need to panic about the Dai price right now given the macro environment, IMO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.049652777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#18",
                    "likes": "3",
                    "time": "16/03/2020-21:26:07",
                    "content": "I also recommend postponing the MKR auction until global markets stabilize. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#19",
                    "likes": "2",
                    "time": "16/03/2020-21:30:27",
                    "content": "dawson The $30M rough number is based on liquidating at 1/2 outstanding value.  Basically what I leave the SCD alone here as this requires SAI not DAI and everyone was warned to get out of that long ago.   SO if I just look at the MCD we are basically at 83M including the SCD.   Liquidate at 1/2 value - apply 13% liquidation fee and one lands around $30M max Maker is on the hook for here.   Sorry the 107M was just incorrect. Also the only way to deal with a liquidity crunch is to supply liquidity - we want to decrease demand not increase it.   When markets are falling people and there is a confidence crisis in the system everyone will be trying to find DAI to close their loans.   It really is a real hazard with these systems is that one has to find liquidity in only a single thing to pay back a loan vs. having multiple options for how to pay down a loan - particularly when liquidity in what one needs to pay with is low. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.996031746031746
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#20",
                    "likes": "1",
                    "time": "16/03/2020-21:32:10",
                    "content": "As an additional recommendation, we can let people know that if they sell their DAI for USD, USDC or other depository dollar token, they can make $1.05 (more than a half year’s interest) if they do it now. This will free up lots of supply. Lots of people bought Dai to get 8% interest. That’s dead until the bull market returns. In the meantime, some of them can get a really fat bonus payment right now by selling their Dai for 5% more than it cost them. You should also be having conversations with Compound and the other secondaries and see what they can do to free up Dai. All of this seems more apropos than rushing in a new collateral type with a kill switch. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.960588023088023
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#21",
                    "likes": "0",
                    "time": "16/03/2020-21:35:18",
                    "content": "@IslandHunting Most of the secondaries have no DAI reserves. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dleonard00",
                    "index": "#22",
                    "likes": "2",
                    "time": "16/03/2020-21:35:25",
                    "content": "UNISWAP LIQUIDITY TOKENS AS COLLATERAL In our urgency we may be overlooking a more decentralized solution right under our nose. I may be too late to the conversation to be considered. But I’ve long felt that the perfect collateral would be Uniswap Liquidity Tokens. They are redeemable for a reasonably stable value after you factor in for the impermanent loss. You also could create some novel feedback loops if, for example, ETH-DAI were to be selected as the accepted liquidity token. Each minting of new tokens adds additional price stability to the ecosystem. Then regardless of what happens to the price, approximately the same value can be recovered at scale. One other consideration would be to use USDC-ETH pair, then you get the stabilizing aspects of USDC without the centralized tradeoffs of USDC. It’s like adding a DeFi wrapper to USDC. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.62353896103896
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#23",
                    "likes": "0",
                    "time": "16/03/2020-21:39:03",
                    "content": "Speaking of SAI, I would imagine that most of the CDPs there are held by people who want to hold open their ETH margin position. So if a timeline for SAI global settlement came out, they would be likely to migrate their positions over to Dai. This seems to me that it would create a lot of new Dai, correct? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving an opinion on the proposal"
                    ],
                    "Sentiment": 5.636363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#24",
                    "likes": "0",
                    "time": "16/03/2020-22:05:13",
                    "content": "I don’t know much about Uniswap liquidity tokens. Can you provide more info? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/oldschool",
                    "index": "#25",
                    "likes": "0",
                    "time": "16/03/2020-22:17:36",
                    "content": "Just created an account to say how much I love this idea and totally support it. Especially the point about which tokens to use. Understand its probably too late, but this is a great idea. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#26",
                    "likes": "0",
                    "time": "17/03/2020-01:27:21",
                    "content": "I have concerns about the USDC minting process. Unlike TrueUSD, which has on-chain ratification of large mints, multisig governance, and a tiered pool system to limit risks, USDC is issued from a private key of unknown security. There are no limits on this key, and it is possible or even likely that a disgruntled employee could mint an unbounded amount of it. ",
                    "links": [
                        "https://etherscan.io/address/0x285d362e41ccc116192a17d21a87f41fc26d32f9",
                        "https://ratifier.trusttoken.com/",
                        "https://etherscan.io/token/0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48?a=0x0000000000000000000000000000000000000000",
                        "https://etherscan.io/address/0x55fe002aeff02f77364de339a1292923a15844b8"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.081632653061225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#27",
                    "likes": "0",
                    "time": "17/03/2020-01:29:03",
                    "content": "I’m strongly in favor of using Uniswap liquidity tokens for collateral we already support. I previously proposed it in this thread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#28",
                    "likes": "4",
                    "time": "17/03/2020-01:39:42",
                    "content": "Yes, Circle has the ability to freeze funds at any address. They have promised to use this functionality in a large variety of situations:  you will not be using the USDC Services for any illegal activity, including, but not limited to, illegal gambling, money laundering, fraud, blackmail, extortion, ransoming data, terrorism financing, other violent activities or any prohibited market practices, including, but not limited to, those listed under Sections 23 and 24  This can also mean that a future US administration could find things some DAI holders are doing is illegal, and they may consider sabotaging DAI to fight that activity, or to purify USDC in the eyes of regulators. DAI is likely already in use for “prohibited market practices”, so we could be setting ourselves up for catastrophe. Edit: Just gonna paste this here. I have bolded the things I am sure DAI is already used for.  24. Prohibited Transactions Using the USDC Services for transfers related to the following is prohibited, and Circle reserves the right to monitor for transactions that relate to: a) any Restricted Persons or persons or entities located in Restricted Territories (as each term is defined in Section 38); b) weapons of any kind, including but not limited to firearms, ammunition, knives, explosives, or related accessories; c) controlled substances, including but not limited to narcotics, prescription drugs, steroids, or related paraphernalia or accessories, unless licensed and authorized by the jurisdiction in which the customer is based as well as by the jurisdiction in which the transaction takes place; d) gambling activities including but not limited to sports betting, casino games, horse racing, dog racing, games that may be classified as gambling (i.e. poker), or other activities that facilitate any of the foregoing, unless licensed and authorized by the jurisdiction in which the customer is based as well as by the jurisdiction in which the transaction takes place; e) money-laundering or terrorist financing; f) any sort of Ponzi scheme, pyramid scheme, or multi-level marketing program; g) goods or services that infringe or violate any copyright, trademark, or proprietary rights under the laws of any jurisdiction; h) credit repair services, or other services that may present consumer protection risks; i) court ordered payments, structured settlements, tax payments, or tax settlements; j) any unlicensed money transmitter activity; k) layaway systems, or annuities; l) counterfeit goods, including but not limited to fake or “novelty” IDs; m) wash trading, front-running, insider trading, market manipulation or other forms of market-based fraud or deceit; n) purchasing goods of any type from “Darknet” markets, or any other service or website that acts as a marketplace for illegal goods (even though such marketplace might also sell legal goods); or o) any other matters, goods, or services that from time to time we communicate to you that are unacceptable and which, for example, may be restricted by our and your bank or payment partners (such transactions, “ Prohibited Transactions ”). In the event that Circle learns you are making any such Prohibited Transactions, Circle will consider it to be a violation of this Agreement and may suspend or terminate your USDC Account, which can result in the potential forfeit of any US Dollar funds otherwise eligible for redemption.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.6645408163265305
                },
                {
                    "author_link": "https://forum.makerdao.com/u/haydenadams",
                    "index": "#29",
                    "likes": "3",
                    "time": "17/03/2020-04:30:26",
                    "content": "me too although Uniswap V2 is coming soon enough that I don’t think its worth the technical effort to get this working for V1  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#30",
                    "likes": "0",
                    "time": "17/03/2020-04:36:12",
                    "content": "    haydenadams:  Uniswap V2 is coming soon enough that I don’t think its worth the technical effort to get this working for V1   I wasn’t aware that UNI-V2 would have ETH pairs; I thought it was just going to be token-to-token. The gas-efficiency of UNI-V1 is fairly critical. UNI-V1 is strong collateral because of its high yield. It can support a much higher DSR than its underlying components. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.870833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tarpmaster",
                    "index": "#31",
                    "likes": "0",
                    "time": "17/03/2020-05:08:01",
                    "content": "Ok, this is rather sobering.  I guess they can kill it by address. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aeno",
                    "index": "#32",
                    "likes": "0",
                    "time": "17/03/2020-06:34:59",
                    "content": "This is exactly the kind of risk I was trying to warn for in the chat (and why I requested for the 3rd option to be put in the poll)   . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#33",
                    "likes": "1",
                    "time": "17/03/2020-11:33:29",
                    "content": "There are lots of posts on social media complaining about USDC. It would be really great if Maker committed to adding more stablecoins (e.g., TrueUSD @RyanRodenbaugh) as soon as the protocol is recapitalized and out of immediate danger. I believe a blog post announcing this intent would be a welcome step. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Daa",
                    "index": "#34",
                    "likes": "6",
                    "time": "17/03/2020-11:47:15",
                    "content": "Hi, let us join this discussion from Japan. I’m one of the community member of Japan. This topic is hot in Japanese community related with 2 issues. Please note that my intension is improve communication.   We have no time to have discussion about this matter because it decided very quickly. Especially we have time difference and I think other Asian country have same problem.   There is some misunderstanding to include USDC. The back ground is complicated.   I know this was the urgent matter but Making a decision in such a short time didn’t give us in Asian region enough time to understand. I ask those who feel the same way join us in Japan in supporting this suggestion/or recommendation going forward. Also this is the first time for me to post here. Please let us know if I have some mistake😉 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0390625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#35",
                    "likes": "3",
                    "time": "17/03/2020-12:09:07",
                    "content": "    Daa:  We have no time to have discussion about this matter because it decided very quickly. Especially we have time difference and I think other Asian country have same problem.   Yes, geographical distribution of all the decision makers (devs, foundation, community members) - Western Europe/Americas -  is a problem. It was one of the things i wanted to bring up when we will start seriously discussing what we learned from this black swan. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.553571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Daa",
                    "index": "#36",
                    "likes": "0",
                    "time": "17/03/2020-14:32:57",
                    "content": "Thank you for prompt reply and your kind understanding! Of course speed is most important thing for black swan. And we can understand thanks to Kathleen that your team do the best in difficult situation. But the fact of “Community was included and understanded” is important factor as a process. We wish your team and us make it as a good experience from black swan to golden duck🐣 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.553030303030303
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/tbtc-proposal-for-collateral-onboarding-tbtc/2328",
            "title": "[TBTC] Proposal for Collateral Onboarding - tBTC ",
            "index": 2328,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "tbtc"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#1",
                    "likes": "31",
                    "time": "02/05/2020-20:08:42",
                    "content": "Bringing Bitcoin (and Bitcoiners) to Maker Hello everyone, I’m Matt Luongo, the project lead for tBTC. We’ve built a Bitcoin sidechain to Ethereum, meant to give Bitcoin the full superpowers of Ethereum and bring additional collateral to DeFi. While I believe BTC can be great collateral for DAI, more importantly, I believe a native BTC on-ramp into the ecosystem can grow the protocol’s user base. An on-ramp into DAI and Ethereum that avoids centralized gatekeepers and unnecessary third parties is the best way to introduce Bitcoiners to the Ethereum ethos en masse and bridge the two cultures. I’m excited to share what we’ve been working on for the past year and a half, tailored to the usecase of MCD. I’m looking forward to feedback from the community on how we can best serve the protocol, strengthen the peg, and work together to build our new financial system. Application  Who is the interested party for this collateral application?  Matt Luongo of Thesis and the Keep project is interested in submitting the following tBTC collateral application.  Provide a brief high-level overview of the project, with a focus on the applying collateral token.  tBTC is an ERC-20 pegged 1:1 to Bitcoin. Instead of relying on a single custodian like wBTC or federation of custodians like Liquid, tBTC is supported by a decentralized bonded multi-federated peg model. The system is a supply peg designed so that tBTC can be minted or redeemed for BTC at any time without 3rd party friction. Each time a Bitcoin is deposited into the system, the underlying Keep network’s random beacon selects a new random set for signers to form a federation. This signers set is bonded 150% the value of the deposit in ETH. The signers generate a key, BTC is sent, and after 6 block confirmations, depositors can post a BTC SPV proof to the Ethereum chain and mint TBTC. Redemption is the reverse: TBTC is sent to the system along with a small fee (5 bps) to pay the signers and once received, BTC is released and the TBTC is burned.  Provide a brief history of the project.  The Keep team grew out of Fold, a popular Bitcoin app first launched in 2014. Keep has been building a system for decentralized signing and custody since 2017, and in late 2018 started building tBTC as the first app to launch on the Keep network. The tBTC technical spec was released in August 2019 by Keep, Summa, and the Cross-Chain Group. tBTC has been live on the Ropsten testnet since January 2020, and will launch live on the Ethereum mainnet on May 11th, 2020.  Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  Technical spec: https://docs.keep.network/tbtc/ Developer documentation: https://tbtc.network/developers/ Ropsten demo dApp to mint TBTC from testnet BTC: http://dapp.test.tbtc.network tBTC contracts: http://github.com/keep-network/tbtc JS library to build on the dApps atop tBTC: https://github.com/keep-network/tbtc.js SPV relays: https://github.com/summa-tx/relays Bitcoin SPV library underlying the relays: https://github.com/summa-tx/bitcoin-spv  Link any available audits of the project. Both procedural and smart contract focused audits.  tBTC and Keep underwent a 6 week audit by ConsenSys Diligence, and is entering into an additional audit with Trail of Bits. ConsenSys audit report: https://diligence.consensys.net/audits/2020/02/thesis-tbtc-and-keep/ For context, check out our head of engineering’s summary of the results, and one of our auditor’s reflections on the system design and process. We’ll share the additional audit results from Trail of Bits when they’re available.  Link to any active communities relating to your project.  Keep & tBTC Discord: https://discord.gg/wYezN7v Cross-Chain Group Telegram: https://t.me/crosschaingroup  How is the applying collateral type currently used?  At launch tBTC will be used as BTC-pegged collater in a number of DeFi apps like Compound, Nuo, Set, and Aave. tBTC allows native BTC to be used directly in these projects, without any redirects or special places to mint or burn.  Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in?  tBTC as a protocol enables any KEEP holder to act as a partial custodian of the underlying BTC. No single organization bears legal responsibility for the collateral.  Where does exchange for the asset occur?  After May 11th 2020, tBTC will be listed on OasisDEX, Uniswap, Radar Relay, Loopring, and Kyber, among other exchanges and DeFi projects. tBTC can also be directly minted and redeemed using the BTC and ETH chains.  (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review.  It has, but providing private legal memos risks waiving attorney-client privilege. Intuitively, our understanding is that as a commodity-backed token, TBTC appears to be favorably treated in the US and similar jurisdictions. Additional Consideration We recognize that tBTC hasn’t existed for as long as candidate collateral like WBTC, and of course agree that confidence in security and market behaviour that comes with time must be a factor in approving assessing collateral MIPs. Because we believe that a non-custodial model for Bitcoin collateral better fits the risk profile of Maker’s design, we’re proposing an additional guarantee on tBTC’s safety as collateral. If tBTC is accepted as collateral, the Thesis team will additionally escrow $15M in KEEP (~12.5% of the supply) for the first 6 months to further backstop tBTC collateral for a debt ceiling up to 10M DAI. We’ll also pursue additional insurance for that period covering up to 500K DAI. ",
                    "links": [
                        "https://thesis.co",
                        "https://keep.network",
                        "https://tbtc.network",
                        "https://tbtc.network/",
                        "https://keep.network/",
                        "https://foldapp.com",
                        "https://docs.keep.network/tbtc/",
                        "https://summa.one",
                        "https://crosschain.group/",
                        "https://docs.keep.network/tbtc/",
                        "https://tbtc.network/developers/",
                        "http://dapp.test.tbtc.network/",
                        "http://github.com/keep-network/tbtc",
                        "https://github.com/keep-network/tbtc.js",
                        "https://github.com/summa-tx/relays",
                        "https://github.com/summa-tx/bitcoin-spv",
                        "https://diligence.consensys.net/audits/2020/02/thesis-tbtc-and-keep/",
                        "https://twitter.com/lightfiend/status/1255185389360418818",
                        "https://diligence.consensys.net/blog/2020/05/tbtc-navigating-the-cross-chain-conundrum/",
                        "https://discord.gg/wYezN7v",
                        "https://t.me/crosschaingroup",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/14",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-mips-6-12-discussion-and-review-of-collateral-onboarding-process/2008/15",
                        "https://forum.makerdao.com/t/collateral-calls-calling-all-projects/3715/15",
                        "https://forum.makerdao.com/t/agenda-discussion-collateral-onboarding-call-10-wednesday-october-7-17-00-utc/4368/3",
                        "https://forum.makerdao.com/t/tbtc-erc20-token-smart-contract-technical-assessment/5399",
                        "https://forum.makerdao.com/t/tbtc-collateral-onboarding-risk-evaluation/6014",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-10-balancer-tbtc-wednesday-october-7-17-00-utc/4368"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Change to proposal pipeline"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.557726172132952
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#2",
                    "likes": "13",
                    "time": "02/05/2020-22:17:43",
                    "content": "I would definitely prefer tBTC to wBTC ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#3",
                    "likes": "5",
                    "time": "03/05/2020-00:29:31",
                    "content": "Thanks for posting @mhluongo! The main reservation I have is the risk of tBTC having problems if the ETH/BTC price drops. This means tBTC vaults would be vulnerable to 3 types of price action (instead of 1 for typical vault):  BTC price drop ETH price drop BTC price increase  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.85
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#4",
                    "likes": "7",
                    "time": "03/05/2020-00:45:00",
                    "content": "Great point, though I’m not sure it plays out the way you’d expect. ETH drops relative to USD don’t matter here, only drops in ETH relative to BTC. If ETH does drop severely relative to BTC, deposits will be redeemed or signer bonds will be seized. Any drop under 33% in ~3 hours won’t have an opportunity to threaten the peg, and a bigger drop than that won’t impact the peg unless signers are also malicious and aren’t worried about losing their work token. Happy to put together a spreadsheet to show what I mean if that’s helpful  EDIT: To put a finer point on it, tBTC isn’t a synthetic. The same design can work without the ETH if signers are assumed honest or if the work token is valuable enough- the ETH is a “second layer of defense”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6298076923076925
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#5",
                    "likes": "1",
                    "time": "03/05/2020-10:21:52",
                    "content": "tBTC is the best when it comes to security and decentralization I hope it can scale ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/andytudhope",
                    "index": "#6",
                    "likes": "4",
                    "time": "03/05/2020-10:58:51",
                    "content": "Hey @mhluongo - really excited to see this application too. I have read the audits in particular, and like the design. I agree that it seems more in line with Maker’s principles than other types of collateral (though I am all for multiple kinds/approaches). I have two questions:  I’m not sure you answered @monet-supply’s actual question (s/he did also specify ETH/BTC, not USD). This spreadsheet would certainly help plebs like me.      mhluongo:  Happy to put together a spreadsheet to show what I mean if that’s helpful    Why the rush? I’m inclined to agree with some of the Foundation devs that letting the contracts exist for ~3months on mainnet is a good way to provide at least some surety that they won’t get hacked. The CD audit is thorough, but it does show up the inherent complexity in the system, and time is a much better test of this than any human, no matter how gifted. I suppose that the MIP process properly executed is at least 3 months, so that could be a vlaid reason for starting now…  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.685681216931217
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#7",
                    "likes": "5",
                    "time": "03/05/2020-11:14:06",
                    "content": "    andytudhope:  I’m not sure you answered @monet-supply’s actual question (s/he did also specify ETH/BTC, not USD)   It was a muddled response- I’ll see if I can put a couple clean examples together. My point though is that the peg isn’t “held” by ETHBTC stability like a pure synthetic- it’s held by signer honesty, and the additional ETH helps ensure that.     andytudhope:  Why the rush?   Just starting the discussion- it’s on the MKR holders to judge risk and timing here, but the sooner we hear concerns, the more time our team has to address them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.692460317460317
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#8",
                    "likes": "1",
                    "time": "03/05/2020-17:39:03",
                    "content": "    mhluongo:  the peg isn’t “held” by ETHBTC stability like a pure synthetic- it’s held by signer honesty, and the additional ETH helps ensure that.   This makes sense. However, I’d assume the risk of signer dishonesty would be greater during the launch phase (lower value of work token / stakedrop period where KEEP is not required / fewer independent signers participating), so ETH does seem like an integral part of the system for the time being ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.190476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Three_Cents",
                    "index": "#9",
                    "likes": "2",
                    "time": "04/05/2020-13:16:34",
                    "content": "I’ve been following this project for a while and looking forward to it possibly being included in MKR.  We should strongly consider it for inclusion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.722222222222221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#10",
                    "likes": "0",
                    "time": "05/05/2020-01:19:45",
                    "content": "The token isn’t launched yet. Is its code available somewhere? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#11",
                    "likes": "2",
                    "time": "05/05/2020-01:32:11",
                    "content": "Indeed! Check out https://github.com/keep-network/tbtc ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#12",
                    "likes": "1",
                    "time": "05/05/2020-02:10:29",
                    "content": "Thanks. I think I found an issue with the code. Good luck on your launch! Interesting that there could be more than 21m BTC via collateralized synthetics. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.59375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#13",
                    "likes": "3",
                    "time": "05/05/2020-12:11:14",
                    "content": "    wjmelements:  I think I found an issue  with the code.   Thanks for the report! I don’t think it’s an issue- signers have plenty of selfish motivation for courtesy calls- but I’m happy to be proven wrong if you want to demonstrate on Ropsten or give more details.     wjmelements:  Good luck on your launch! Interesting that there could be more than 21m BTC via collateralized synthetics.   Appreciate it! A core goal of this project is to prevent “extra” BTC from being put into circulation, but sBTC and co are all over it  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LebedevAP",
                    "index": "#14",
                    "likes": "2",
                    "time": "06/05/2020-10:09:28",
                    "content": "I’m worried about the rush. You are in such a hurry to start that it can be dangerous. Some aspects of the system’s operation are still unclear. I am concerned about such discussions when the official documentation says one thing and the official Twitter account says another   twitter.com    Christael (Krzyszt51912412)  @keep_project @renprotocol @defiprime @defipulse @MakerDAO This is from your docs site. Source: docs.keep.network/tbtc/index.htm… https://t.co/2CYTIJCfVy   3:27 PM - 5 May 2020        tBTC is definitely needed for MakerDAO, but you can not rush with someone else’s Bitcoins. Can it be reasonable to start the network first and add tBTC for MakerDAO after some time? Not the other way around. ",
                    "links": [
                        "https://twitter.com/Krzyszt51912412/status/1257693449173831683",
                        "https://twitter.com/keep_project",
                        "https://twitter.com/renprotocol",
                        "https://twitter.com/defiprime",
                        "https://twitter.com/defipulse",
                        "https://twitter.com/MakerDAO",
                        "https://docs.keep.network/tbtc/index.html#request",
                        "https://t.co/2CYTIJCfVy",
                        "https://twitter.com/Krzyszt51912412/status/1257693449173831683"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.803571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#15",
                    "likes": "8",
                    "time": "06/05/2020-10:51:17",
                    "content": "Just saw this on the Keep twitter: https://blog.keep.network/keep-tbtc-launch-supported-by-more-than-40-industry-partners-ae5a2f0689be Seems a little misleading with regards to Maker. Some quotes:  Here is the full list of launch partners announced to date: tBTC integrations:  MakerDAO and OasisDEX   I don’t think we’re a launch partner? While it’s difficult to estimate consensus, from what I’ve seen it looks like there is a well-supported undercurrent of ‘let’s wait 3 months to make sure it works as advertised.’  MakerDAO, Compound and Uniswap are among the decentralized platforms with plans to integrate tBTC as their choice for BTC  Again, this is misleading, claiming tBTC is ‘our choice’ of BTC collateral completely disregards the fact that we added wBTC, and that it seems likely we will support multiple BTC-on-ethereum tokens. Don’t get me wrong, I’m excited to see tBTC added but this sort of blogpost promises a lot of stuff on our behalf, which I don’t like. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.076388888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#16",
                    "likes": "1",
                    "time": "06/05/2020-11:23:59",
                    "content": "    LongForWisdom:  Seems a little misleading with regards to Maker. Some quotes:   Long, that wasn’t our intent at all.     LongForWisdom:  I don’t think we’re a launch partner? While it’s difficult to estimate consensus, from what I’ve seen it looks like there is a well-supported undercurrent of ‘let’s wait 3 months to make sure it works as advertised.’   These posts were reviewed by the Foundation, and went out before the community added WBTC outside normal collateral governance. Everyone mentioned in these posts gave sign-off. I’d never try to speak for the entire community - just the MKR holders and Foundation we’ve been working with. I’m happy to revise to make the distinction between the Foundation and community more clear. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.65625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#17",
                    "likes": "0",
                    "time": "06/05/2020-11:38:12",
                    "content": "    LebedevAP:  I’m worried about the rush.   Anton, please stop astroturfing. I’ve mentioned above that there is no rush- the Maker community has an established risk function to make this decision. That said, the fact that you’re a Ren partisan harassing us across multiple social media channels is making a good faith discussion difficult.     LebedevAP:  I am concerned about such discussions when the official documentation says one thing and the official Twitter account says another   We’re working to improve our documentation, but the best possible documentation is an audited, open source system. You’re welcome to review the code and docs and open a pull request with improvements- we’d love to get you involved.     LebedevAP:  but you can not rush with someone else’s Bitcoins   Of course, we would never  That’s why we have started a second audit, and will be limiting the dApp to small amounts at launch to protect users. That’s why we’ve gone out of our way to publish risks and a security model that won plaudits from our auditor. The only way to be confident about a system like this is time and additional collateral. That’s why we’ve offered to backstop the collateral and pursue additional insurance. The Maker risk team and community are in the best place to judge the risks and benefits here ",
                    "links": [
                        "https://twitter.com/mhluongo/status/1255475746434408448",
                        "https://tbtc.network/developers/tbtc-security-model/",
                        "https://diligence.consensys.net/blog/2020/05/tbtc-navigating-the-cross-chain-conundrum/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.112745098039216
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#18",
                    "likes": "3",
                    "time": "06/05/2020-11:46:31",
                    "content": "    mhluongo:  Long, that wasn’t our intent at all.   Fair enough. For future reference: MakerDAO = amorphous blob that is incredibly poorly defined. Maker Foundation = The Maker Ecosystem Growth Foundation Maker Community = Amorphous blob - Foundation (Some contention around this too, should the Foundation be considered part of the community?) MKR Token Holders = People with MKR Maker Governance = People with MKR that vote + Community members involved in governance.     mhluongo:  These posts were reviewed by the Foundation, and went out before the community added WBTC outside normal collateral governance. Everyone mentioned in these posts gave sign-off.   Cool, I probably need to be complaining elsewhere then. Regarding revision, that’s your call. I am just worried this sets up expectations which seems unlikely to be met, namely:  That tBTC will be the only BTC token in the Maker Protocol. That tBTC will be available to borrow against in the Maker Protocol at the launch of tBTC.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.295454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#19",
                    "likes": "1",
                    "time": "06/05/2020-11:50:50",
                    "content": "    LongForWisdom:  Regarding revision, that’s your call. I am just worried this sets up expectations which seems unlikely to be met, namely:   Agreed. I’ll take a pass at it with more accurate language and make it clear this isn’t exclusive. Thanks for the catch! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/snoopy",
                    "index": "#20",
                    "likes": "3",
                    "time": "06/05/2020-12:22:46",
                    "content": "I also found the article that Long linked to to be misleading and exaggerated. The same issue goes for Compound; there are no “plans to integrate” before a governance vote can be had, let alone as “their [singular] choice for BTC.” This is simply inaccurate. Price feed approvals and testnets are not mainnet integrations. A public retraction would be appropriate and appreciated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.107142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#21",
                    "likes": "0",
                    "time": "06/05/2020-13:12:22",
                    "content": "Hey @snoopy, as stated above there was signoff from all parties listed here. Being more clear about distinctions between entities and communities is worthwhile, but this isn’t a retraction.     snoopy:  there are no “plans to integrate” before a governance vote can be had   I’d like to see your evidence here, or even just understand what gave you that impression. There are development teams that need to build things and do diligence, before governance- and in Compound’s case the employees and investors in the company are the primary governance participants EDIT: I’d also appreciate a disclosure that you’re a REN holder- I see that you and the folks liking your post are new to the forum, and have also been following us around social media. Not sure on the astroturfing policy in the forum, but transparency and disclosures are usually a good idea when we’re talking about money. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.059848484848485
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LebedevAP",
                    "index": "#22",
                    "likes": "1",
                    "time": "06/05/2020-14:02:29",
                    "content": "We are discussing tBTC here, not REN. It really seems to me that you are in a great hurry and I do not understand the reasons for the hurry. And I think I have a reasonable right to ask: “Why are you in a hurry, Matt?” Seriously, my questions have nothing to do with my love for RenBTC/pBTC/imBTC/wBTC…etc I think that all people see this hurry and it cannot but raise questions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3769841269841265
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#23",
                    "likes": "1",
                    "time": "06/05/2020-14:18:42",
                    "content": "    LebedevAP:  And I think I have a reasonable right to ask: “Why are you in a hurry, Matt?”   If you are an MKR holder and a real part of the Maker community, you are welcome to ask whatever you’d like! If you’re here primarily to disrupt the conversation, well, I don’t owe you anything- and it appears that’s what’s happening right now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.976190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LebedevAP",
                    "index": "#24",
                    "likes": "0",
                    "time": "06/05/2020-14:31:32",
                    "content": "If I use DAI as my primary stablecoin - I can’t ask you questions? Does this mean that you do not accept (in the future, if something goes wrong with tBTC) liability to all DAI holders ? I want to trust DAI, and your answers disappoint me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.484375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#25",
                    "likes": "4",
                    "time": "06/05/2020-14:33:56",
                    "content": "You can ask questions if you remain polite. Seems fairly clear there is some history between the two of you, please keep the discourse civil and polite in this forum. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#26",
                    "likes": "1",
                    "time": "06/05/2020-14:38:19",
                    "content": "    LebedevAP:  If I use DAI as my primary stablecoin - I can’t ask you questions?   Cool your jets, there’s no need to be dramatic here. I’ve addressed your question multiple times, above - you’re not actually looking for an answer in good faith, and the political rhetoric you’re engaging in doesn’t move the conversation forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.787037037037037
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LebedevAP",
                    "index": "#27",
                    "likes": "0",
                    "time": "06/05/2020-14:48:56",
                    "content": "I wish you good luck and a smooth launch of the network in the announced timeframe. I wish that your project (“not synthetic” bitcoin) it became a good experience for the entire community With respect and courtesy! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#28",
                    "likes": "1",
                    "time": "07/05/2020-00:02:42",
                    "content": "One thing that I thought was interesting with the WBTC onboarding is that the community allowed a 10 million cap (which is the entire supply of wtbc), and there has only been one new minting of WBTC since it went live (50+ today). I’m curious what kind of volume TBTC will have out of the gates (there must be some feel for the demand) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.909090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#29",
                    "likes": "0",
                    "time": "07/05/2020-00:19:45",
                    "content": "Definitely a feeling. In the first two weeks the dApp will be limited to small amounts, but I expect 100-200 TBTC to be minted directly with the contracts. The team is helping depositors to mint another ~1k, and I’d be surprised if the system didn’t have 2k in deposits by the end of 2020. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.107142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Three_Cents",
                    "index": "#30",
                    "likes": "6",
                    "time": "07/05/2020-01:32:28",
                    "content": "I’m excited about the potential of tBTC.  decentralized link between btc and eth chains.  I’m in favor of using risk mitigation in the very early stages (ie: smaller DAI ceiling) than sitting on the sidelines for months.  First mover advantage is really important.  If Matt is saying 2k ($20mm) by the end of 2020 and 100-200 ($1mm-2mm) in intial phases why not start with a $500k DAI cap and see how it works.  We adjust it weekly so we can evaluate in real time.  It keeps the downside really small.  And to be fair we should really be shrinking the wBTC cap as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0024999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#31",
                    "likes": "9",
                    "time": "16/05/2020-02:22:55",
                    "content": "Hey everyone, quick update- we’re on mainet and welcome you to play with minting. We’ve taken a protocol-first approach so the dApp is rough- we’re limiting it to 0.001 BTC deposits for a few days for testing, though if you’re feeling brave you can also mint larger amount against the contracts. Looking forward to your feedback! ",
                    "links": [
                        "https://dapp.tbtc.network"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.361111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#32",
                    "likes": "9",
                    "time": "18/05/2020-17:30:06",
                    "content": "For awareness, tBTC minting has been temporarily halted: https://twitter.com/mhluongo/status/1262261372714455042 I think we should be patient and allow Keep to put the system through its paces before adding it as collateral to MCD. 3+ months live on mainnet without incident would make me feel more comfortable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7272727272727275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#33",
                    "likes": "1",
                    "time": "19/05/2020-12:42:51",
                    "content": "Has their been a post mortem yet on the issue? Does it seem fixable? Pity for it to hiccup so soon after it began. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#34",
                    "likes": "8",
                    "time": "19/05/2020-15:10:11",
                    "content": "Thanks @monet-supply for the update here – it’s been a hectic 48 hours.     The_Ratj:  Does it seem fixable? Pity for it to hiccup so soon after it began.   On the contrary – I’m very happy the team found this over the weekend, and that it was so early in tBTC’s life on mainnet, leaving room for a redeploy. A couple details, though I’ll leave the rest to the post-mortem.  This was a vulnerability the team found from odd behavior one of our signers was experiencing. We found it ~11:30P ET Sunday, and had mitigated if by ~2:45A ET Monday. No funds were lost. In fact, it appears no depositor funds were ever at risk, and TBTC holders were fully able to redeem. Instead, one of our signer’s funds was put at additional risk. That risk has been mitigated on mainnet, but it remains in the code base… … which is why the the emergency pause was invoked. We don’t believe the existing contracts should continue to be used, and plan a full re-deploy.      The_Ratj:  Has their been a post mortem yet on the issue?   We’ll have a full post-mortem out later today – I’ll update the thread with details. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.240740740740741
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#35",
                    "likes": "2",
                    "time": "20/05/2020-02:52:06",
                    "content": "    mhluongo:  We’ll have a full post-mortem out later today – I’ll update the thread with details.   We’ve published an extensive incident analysis, as promised, including the description of the vulnerability, a timeline of the discovery and mitigation, and a review of the processes that led to its inclusion in the mainnet release. Tomorrow, we’ll share our plan to redeploy the contracts, including moving to a “release candidate” deployment model that we hope better sets user expectations than the current dApp restrictions and alpha label, as well as expanding our bug bounty to raise payouts by 10x, conducting our second audit with Trail of Bits, and seeking a third audit from a Bitcoin-focused firm. As for our MIP, I propose that we continue the discussion, picking back up once a release candidate has graduated to a final release. Thanks everyone for the kind words and patience over the last 48 hours. Please feel free to ask any questions about the vulnerability, our process, our response, or anything else on your mind. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.660714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LebedevAP",
                    "index": "#36",
                    "likes": "0",
                    "time": "20/05/2020-05:27:53",
                    "content": "    mhluongo:  Please feel free to ask any questions about the vulnerability, our process, our response, or anything else on your mind.   I want to clarify: You wait until the end of the second audit, make all the corrections based on the results of the second audit, and only then will you launch Mainnet a second time… or… do you launch Mainnet (very soon) a second time and do a second audit in parallel? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#37",
                    "likes": "3",
                    "time": "20/05/2020-05:47:11",
                    "content": "Neither.     mhluongo:  including moving to a “release candidate” deployment model   We’re going to redeploy to mainnet as RC1, likely with a restricted cap (rather than the dApp-only deposit restriction we launched with). Then we’ll try to break it, pull the lever if we do, and repeat with RC2 if necessary. We aren’t able to catch a whole slew of attack vectors against Bitcoin’s testnet, and real money brings out a different kind of attacker. It’s also let us pull in more outside Bitcoin developers. As the vulnerability was Bitcoin-specific (which is why I think the auditors missed it as well), we need all the help on that side we can get. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.111111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LebedevAP",
                    "index": "#38",
                    "likes": "0",
                    "time": "20/05/2020-05:53:50",
                    "content": "    mhluongo:  We’re going to redeploy to mainnet as RC1   Then call it testnet or call it chaosnet. I wonder why you name RC1 as Mainnet ? I think it misleads a lot of people…     mhluongo:  We aren’t able to catch a whole slew of attack vectors against Bitcoin’s testnet, and real money brings out a different kind of attacker   You are playing with other people’s bitcoins. This has a negative impact on the reputation of the DeFi ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.767857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#39",
                    "likes": "5",
                    "time": "20/05/2020-09:57:58",
                    "content": "Appreciate the update @mhluongo . I’m looking forward to seeing how RC1 fares. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhluongo",
                    "index": "#40",
                    "likes": "6",
                    "time": "20/05/2020-12:45:51",
                    "content": "    LebedevAP:  Then call it testnet or call it chaosnet. I wonder why you name RC1 as Mainnet ? I think it misleads a lot of people…   Release candidates are an established software deployment methodology. I don’t know what a “chaosnet” is- but I know what an RC is, because it’s an industry standard term and process used by eg Linux.     LebedevAP:  You are playing with other people’s bitcoins. This has a negative impact on the reputation of the DeFi   We’ll have to agree to disagree here. I’m in this space to empower consenting adults and their money, not nanny. None of the depositors impacted by the recent vulnerability were surprised or unhappy- they had to run a modified version of the dApp with a bunch of alpha warnings about loss of funds to even mint what they had, as we restricted the hosted dApp to 0.001 BTC. Please lay off the narrative so we can have a productive discussion here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.229166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarkOSullivan94",
                    "index": "#41",
                    "likes": "2",
                    "time": "15/12/2020-11:51:51",
                    "content": "What’s the status on getting tBTC added as collateral? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "1267"
}