{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/initial-thoughts-and-questions-for-including-real-world-assets-in-the-maker-protocol/3511",
            "title": "Initial Thoughts and Questions for Including Real World Assets in the Maker Protocol ",
            "index": 3511,
            "category": [
                "Governance"
            ],
            "tags": [
                "collateral-onboard",
                "real-world-finance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#1",
                    "likes": "39",
                    "time": "03/08/2020-19:15:45",
                    "content": "Introduction: For the past year, the Maker Foundation has been researching and experimenting how to generate additional value from the Maker Protocol by providing collateral which does not originate on the blockchain. This post intends to kick-off discussions on including “real world assets” (“RWA”) in the Maker Protocol and highlight questions we believe projects should consider if they are interested in seeing these assets on-boarded. An important thing to remember is that any approach involving RWA – be they securities, commodities or otherwise – will touch on regulated products, players and markets. Therefore, a regulatorily compliant framework is the critical feature to successfully expand the collateral types available for Vault users. But given the complexity involved, we want to start the Community off with the incipient points below. What kind of “RWA” are we talking about? In the simplest terms, an RWA is anything that does not originate from a blockchain and uses the recourse of the relevant legal apparatus to maintain consensus over its ownership. A hybrid of a blockchain native and an RWA are fiat-backed stablecoins like USDC. They use the blockchain to track account balances but ultimately rely on the judiciary of the United States, or another jurisdiction of issuance, for recourse. Other more “vanilla” assets include tokenized equities and treasury bonds. This simple definition, however, does not accomplish much for the Maker Protocol. To source assets that contribute to a robust, large and healthy financial ecosystem, the Maker Community should focus on their economics as well. RWA that are most useful to Maker should have large supplies, predictable demand for credit and a cost of capital over LIBOR/Fed Funds. Potential users that hold assets with these characteristics may be able to use the Maker Protocol to establish or replace credit lines and supplant private sources of capital by locking their RWA into Vaults and generating Dai. In the legacy economy, bank credit is the source for nearly all of the money supply. Borrowers interact with originators and these originators sell or pledge their assets to banks. The originators then draw on these credit facilities to originate more loans, with banks creating new money in the process. Originators are essential because they act as middlemen with aligned incentives - they price individual loans and allow the bank to analyze a diversified portfolio when setting their risk parameters. In doing so, the calculus of originators is simple - interest paid in by the loans they extend minus the interest paid to the bank or to private investors equals their net interest margin. It’s important to note that since this calculus is predictable and scalable (in the sense that it reflects the current money creation process), these economic actors’ assets could fit well in the Maker Protocol. Decentralization vs Diversification There have been many comments in the forums and on social media that Maker should be targeting assets by how decentralized they are. This is an inaccurate premise and belies a misunderstanding of what makes a stablecoin resilient in the face of malicious actors. In contrast, the Maker holders should likely focus on developing a maximum level of diversification in the collateral portfolio in order to make Dai as resilient as possible. In this context, diversification refers to the minimization of any single type of risk, which goes well beyond volatility risk and centralization (illicit seizure) risk. To use an example, imagine that Dai was only backed by digitally native assets like ether. This means that no one can illicitly seize the collateral in the protocol – users have total independent control of their assets (unless one’s Vault is liquidated). But relying solely on ether, or a similar asset, forces the Protocol to depend heavily on trading and liquidity from centralized exchanges, some more reputable than others. But the Maker Protocol depends not only on user’s custodying their assets, but also on those assets’ liquidity and price stability. If 100% of the protocol’s assets are based upon secondary fiat markets on centralized exchanges, a whole new host of risks emerges that can only be mitigated by diversification of marketplaces. In an ideal future, the DAO would minimize any single risk to Dai through diversifying asset types, price sources, liquidity venues and regulatory regimes. None of this is to say that Dai itself will become any less decentralized in the process. It will always be true that no one can seize or freeze Dai. This concept is specific to the collateral portfolio which is abstracted away from Dai holders. Potential Types of Asset Portfolios Available for the Maker Protocol Conceptually there are two ways two think of the structuring process that allows a token to represent a claim on an asset in the Maker Protocol:  Tokenize a claim on a particular underlying asset itself Create and tokenize a debt instrument which represents a claim on proceeds of the underlying asset in the event of a liquidation  Method number one involves properly classifying and/or registering the instrument (e.g., some assets could be securities and require registration with the appropriate authorities) before its inclusion in the Protocol. Price discovery would need to happen on appropriately licensed secondary markets and, in countries such as the United States, be subject to the various transfer restrictions of a security offering. One can envision a future where users may access a regulated UI (a “walled garden”) operated by an appropriately registered entity and lock their equity tokens in a Vault to generate Dai. This example assumes several developments, such as regulated markets/portals and user’s willingness to register and submit KYC information, but is not beyond the imagination. Method number two is another possible means for on-boarding RWA to the Maker Protocol. In this construct, an asset originator (e.g., a loan originator or receivables holder) would identify, isolate and collect assets (e.g., loan revenues or receivables) they wish to onboard into an entity they controlled called a Special Purpose Vehicle (SPV). This SPV would serve the limited purpose to custody the specific assets being entered into the Maker Protocol. The originator could then mint an NFT that represents each asset in the SPV (not equity in the SPV or a right to the asset’s cash flows) and contains enough metadata to price the asset independent of context. Though the NFT is not a claim on the asset, it is a way for Oracles and Keepers to price the portfolio in the event of a liquidation. If the asset holder does not wish to mint NFTs, they likely will need to publish this data in a readily accessible format. Finally, the SPV would mint tokens representing a pro rata share to the pool of assets held by the SPV. Those tokens would be placed as collateral into the Vault and subject to the same parameters and rules as all other collateral, including liquidation. The NFTs (or supplied data) would be used by an Oracle to continuously price the collateral tokens and inform the Protocol’s parameters and rules. This process can also be done manually by governance, should digital price feeds not be available. For liquidation, more likely than not, an intermediary like a registered broker-dealer or Futures Commission Merchant would have to administer the token auctions. Auction winning Keepers, or other holders, would then seek redemption on their collateral tokens from the SPV. In a perfect world, the originator would use the SPV and Vault, continuously exchanging assets, to create Dai to fund its operating costs until it no longer had liquidity needs. When complete, the asset holder would return the borrowed Dai funds to the Vault and close it, via the SPV, and then dissolve the SPV. With these steps done, the process would conclude. The above is a high level, simple review of two asset types that could be considered for inclusion in the Maker Protocol, so please do not take this post as gospel. In combination with these initial thoughts, we want to elaborate on questions the token issuers may consider when deciding whether to proffer their assets for inclusion as Maker collateral. The following are not exhaustive, though, and please feel free to add your thoughts and inquiries in the comments:  Q: Does the Protocol provide a benefit to the asset or originator and will the asset provide a benefit to the Protocol? Q: What is the underlying asset to be included in the Protocol and then how will it be included in the Protocol? Q: Are there ready and secure price feeds available for the proposed asset? Q: How will a trusted Oracle or Price Data Feed be established and what will be the requirements of its duties? Q: Does the asset attempt to separate cash flow from the entity looking to borrow (generate Dai from a vault)? If so, how will that be accomplished – legally, functionally? Q: Does the asset trade on secondary markets? Is it typically sold in private placements? Q: What is the legal classification of the asset? What is the legal structure within which the asset was issued (e.g., securities offering, e-money issuance, factoring, etc.)? What would be the legal classification of a bespoke method for including the asset in the Protocol (e.g., Method 2 above)? Q: Based upon the legal classification of the underlying asset or its representative token, what are the additional requirements for its inclusion in the Protocol (e.g., regulated intermediaries like broker-dealers, specific registration with a regulator of the token, limitations of Keepers, reporting requirements, etc.)? Q: What are the specific risks associated with the asset: technological (e.g., transfer restrictions), legal (e.g., AML/KYC requirements), economic (e.g., availability of real-time performance data) and regulatory (e.g., asset classification as a security or derivative)? Q: Who will bear those risks and how will that be accomplished?  Our next post will cover a potential design for on-boarding a RWA and review the glaring gaps we believe need to be filled. ",
                    "links": [
                        "https://www.theblockcrypto.com/linked/19815/arca-files-for-a-tokenized-treasury-bond-product",
                        "https://community-development.makerdao.com/makerdao-mcd-faqs/faqs/liquidation",
                        "https://forum.makerdao.com/t/maker-relay-ep-7/3630",
                        "https://forum.makerdao.com/t/signal-request-should-real-world-asset-collateral-onboarding-be-prioritised-in-the-short-term/4075",
                        "https://forum.makerdao.com/t/maker-relay-ep-09/3793",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-104-thursday-august-6-4-00-pm-utc/3469/2"
                    ],
                    "GPT-summary": "The post discusses the inclusion of \"real world assets\" in the Maker Protocol and highlights questions that should be considered if interested in seeing these assets on-boarded. The author explains the two ways to structure a token to represent a claim on an asset in the Maker Protocol and elaborates on the questions that token issuers may consider when deciding whether to proffer their assets for inclusion as Maker collateral. The post also discusses the benefits of diversification in the collateral portfolio to make Dai as resilient as possible.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.700125135281385
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafael.cosman",
                    "index": "#2",
                    "likes": "4",
                    "time": "04/08/2020-00:48:20",
                    "content": "@g_dip thank you for the detailed post on RWAs- we at TrustToken would like to support here. We already have an active discussion around adding TUSD, TGBP, TAUD, and TCAD as collateral types (see below) and down the road could work together to create more collateral types the maker community would be interested in.     TUSD Update: TrustToken Response to Implementation Concerns Governance       Hey all,  The TrustToken team has completed a refactor of our true currencies smart contracts and plan on upgrading the TrueAUD, TrueCAD, TrueGBP, and TrueHKD contracts. A refactor for TrueUSD is also in the works and will be announced as soon as it is complete.  These upgrades are meant to simplify our stablecoin code in order to increase transparency and compatibility. Below are the proposed implementations, which are currently undergoing audit:  TrueAUD:  https://etherscan.io/address/0x6b4305…   ",
                    "links": [
                        "https://etherscan.io/address/0x6b43055a996eCBeB43b7458401f12655240DcEb5"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.847442680776014
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "3",
                    "time": "04/08/2020-12:40:34",
                    "content": "Happy to see your contributions @rafael.cosman, but I believe @g_dip’s post is aimed at assets which are not fiat currencies. For example, Centrifuge has proposed  [NS-DROP] MIP6 Application: New Silver DROP: Real Estate-Backed Loans [HTC-DROP] MIP6 Application: Harbor Trade Credit DROP: Short Term Trade Receivables [CF-DROP] MIP6 Application: ConsolFreight DROP: Tokenized Freight Shipping Invoices [PC-DROP] MIP6 Application: Paperchain DROP: Tokenized Music Streaming Invoices  It will be great to onboard the usual foreign exchange fiat currencies, but Centrifuge real world assets would open up a whole new category of Maker vaults. ",
                    "links": [
                        "https://forum.makerdao.com/t/htc-drop-mip6-application-harbor-trade-credit-drop-short-term-trade-receivables/3502",
                        "https://forum.makerdao.com/t/cf-drop-mip6-application-consolfreight-drop-tokenized-freight-shipping-invoices/2214",
                        "https://forum.makerdao.com/t/pc-drop-mip6-application-paperchain-drop-tokenized-music-streaming-invoices/2215"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.953512396694215
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "1",
                    "time": "04/08/2020-14:17:02",
                    "content": "On point I don’t get is that the direction seems to be toward low size, low volume, low liquidity NFT. Am I wrong here? The overall idea seems to avoid (or not being able to get) regulated financials products and allow anything to be used as collateral to create liquidity in the form of DAI. Shouldn’t other actors deal with such assets? Take those collaterals and provide prime assets that can be deposited at MakerDAO. Not having a clear opinion on that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.986111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#5",
                    "likes": "1",
                    "time": "04/08/2020-14:38:09",
                    "content": "Could you expand on this? I’d like to provide clarity but I don’t understand what you’re saying. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#6",
                    "likes": "0",
                    "time": "04/08/2020-15:00:45",
                    "content": "Sure. Let’s take Real Estate-Backed Loans case. We are talking about <200k$ per loan each being tokenized by one NFT. Am I correct here? I’m not sure if a vault would get one NFT or a set of similar NFT but it doesn’t change much the rest. We are, in any case, talking about something very small (<1B$), illiquid (<1B transaction a day), risky (a default will lead either to a 0$ value in one go) and complex. I think that maybe MakerDAO should manage a currency and let other people manage credit risk (players that build on top of MakerDAO). It’s already complex enough. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.045454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafael.cosman",
                    "index": "#7",
                    "likes": "4",
                    "time": "04/08/2020-15:17:57",
                    "content": "@psychonaut - while our current products are tokenized fiat currencies, we have all the infrastructure to go beyond that, and only haven’t because we haven’t found assets that we think have enough demand (other than fiat currencies). We are actually evaluating some additional assets right now but would like to have input from communities such as Maker about what assets you’d be most interested in supporting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.580357142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#8",
                    "likes": "0",
                    "time": "04/08/2020-15:20:35",
                    "content": "Ah sorry I think you misunderstood. The primary concept is to work with originators that manage credit risk, and then let them generate Dai against their entire portfolio (not individual assets). For example, let’s say a mortgage originator has 1,000 mortgages on its book right now, they would pledge all of these to the SPV and generate Dai against the aggregate and diversified portfolio (where the specific parameters of diversification and credit risk they need to meet are stipulated by MKR holders). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.154761904761904
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#9",
                    "likes": "0",
                    "time": "04/08/2020-15:21:39",
                    "content": "Have you not seen demand for short term/high quality debt instruments (e.g. municipal bonds)? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#10",
                    "likes": "0",
                    "time": "04/08/2020-15:39:19",
                    "content": "@g_dip I was mislead by the “Each NFT represents one unique real-world asset, a loan, with a unique default risk that is priced by an off-chain oracle.”  In any case, it’s still a small amount and illiquid. If it’s a loan and yielding like a junk bonds, how can it be a good collateral for money creation ? I have the same feeling for EURS. There is more than 5 000 B$ of corporate investment grade bonds in the US alone. Why start complicated? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#11",
                    "likes": "6",
                    "time": "04/08/2020-15:46:51",
                    "content": "I think corporate debt is a great idea. The purpose of this post is to begin ideating on a process that makes it possible for holders/issuers of that debt to engage with the Maker Protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/markobarko",
                    "index": "#12",
                    "likes": "0",
                    "time": "04/08/2020-18:05:04",
                    "content": "So, lets say we take a bunch of real estate from someone like RealT.co and put it in an Aragon DAO. Then we are talking about tokens of that DAO being collateral in Maker? This kind of use case seems to make sense, especially given the relative stability of real estate as underlying. What would be the kind of due dilligence in this case? Can you imagine a whole bunch of real estate collateral piling into defi! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.069444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#13",
                    "likes": "6",
                    "time": "04/08/2020-21:02:15",
                    "content": "The MAKER Protocol should not have any direct interaction with the assets. The MAKER Protocol is a PLATFORM, which allows professionals to generate value from real world assets. MAKER Protocol handles only:  NFT Generator System, ETH safety deposits from third party, ETH collateral deposits, NFT collateral deposits, DAI generator, Vault rating system for rebates  and incentives, Professional third party asset evaluator and liquidator rating system for rebates  and incentives.  Whatever Asset CDP1000×1712 145 KB The drawing doesn’t have the liquidation process. But it is self-explaining. There is little room for drawing on the phone  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.151785714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Blake_Vertalo",
                    "index": "#14",
                    "likes": "4",
                    "time": "04/08/2020-22:57:59",
                    "content": "Thank you @g_dip for starting the conversation. Vertalo is similarly developing a framework for bridging between DeFi ecosystems and regulated financial services. We’re supportive of the Maker community and Foundation efforts here, and we look forward to the community reaction/questions. Perhaps it’s helpful to share how we’re thinking about this in the context of the two examples provided. 1 - tokenizing a claim on a particular underlying asset. Given the applicability of US securities law, there are a few pieces that’d need to move in lockstep here.  @g_dip mentioned KYC/AML, regulated venues for pricing oracles, and a partitioned environment for registered entities and eligible users. In our view, there’s also a question of custody of the token, establishing a satisfactory control location for sovereignty over the custodied token, and compliant liquidation mechanisms in line with existing auction process. 2- tokenized debt instrument representing claim on proceeds. Given the standing of debt in the eyes of US regulators, this SPV cashflow structure appears more favorable.  We view SPV’s of single-tranche credit instruments as one of the lower-hurdle approaches, with few additional parties involved.  The complexity in this model appears would be primarily driven by liquidation mechanisms, and ensuring value is returned to the Maker ecosystem in a compliant manner. Additional thoughts & questions  We like to think about potential collateral asset classes across a spectrum of simple single-tranche credit, structured credit, royalty/rev shares, and equity or fund interest.  These buckets have varying levels of complexity in terms of regulatory requirements, valuation, and risk management.  Choosing the right asset class/instrument can significantly raise or lower barriers. Outside of RWA’s with trading venues, we’d expect there to be a cost associated with pricing the collateral asset on an ongoing basis.  Who bears this cost? How can the protocol mitigate information superiority of those pledging their assets? What is the community’s position with regards to interacting with regulated entities? and could that be improved with a new ecosystem role designation for this profile of user?  @Kukkio , your image reflects a very similar model to what we’re working on.  We believe the ‘professional third party and liquidator’ you’ve outlined may additionally require a number of third parties across some or all following roles (again, varying by specific underlying asset class and approach): KYC/AML provider, custodian, broker dealer, transfer agent, debt servicing company, valuation expert.  Given the nuance of each potential collateral asset class, it’s difficult to offer any particular detail at this stage of the conversation as to what an ideal model looks like.  However, we look forward to contributing as this discussion continues in the comments and in subsequent posts, and as our own thinking sharpens with community input. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.6020021645021645
                },
                {
                    "author_link": "https://forum.makerdao.com/u/allanca",
                    "index": "#15",
                    "likes": "4",
                    "time": "04/08/2020-23:20:55",
                    "content": "We’re looking closely at this to use mortgages as collateral for DAI using an approach like @g_dip suggests as “Method Number Two”. And also more generally interested in the problem of how to create a process for getting RWA included as collateral. It’s got to cover the same bases a traditional lender would cover wrt price risk, credit risk, counter party risk, etc. But, with the benefit of being publicly transparent, generalized, and decentralized. I think the trick will be finding a generalized model that can handle the nuances @Blake_Vertalo describes without relying too heavily on centralized expertise that may be hard to verify. Some details on the specific mortgage case: Mortgage origination is a highly regulated and well-litigated industry. It clearly falls into the bucket of RWA that’s easy to tokenize and has to rely on the judicial systems of the given jurisdiction to enforce collateral rights. Given the many centuries mortgage deeds have been around, how well enforced and consistent the rights are in almost every country on earth, and the incredible size of the market, it’s a decent place to start. When a mortgage originator funds a loan, there is a buyer who has already agreed to purchase the loan. But, it takes about a week to get the purchase settled. The price is already set within 24 hours of the loan funding and can’t change afterwards. This is almost identical in practice to invoice factoring (which would also be a really interesting asset to look into getting as DAI collateral). Lending against the mortgages while they’re waiting for settlement is already a very common practice (known to banks as Mortgage Warehouse lending) that banks love because the collateral is a super short term, real-estate backed, and well diversified, so the risk is low and the prices are very stable. Most lines have 99% collateralization rates. In terms of volume, there’s almost $10B per day in mortgages originated in the US right now that could be used. If each loan stays in the pool for the average 10 days, that’s $100B in possible collateral with effectively zero price variability and high collateralization rates. My question is what data are MKR holders interested in seeing exposed about the loans to be able to evaluate the risk in real-time? Our current warehouse lenders know the loans are only high-quality Qualified Mortgages and see top-level credit information and loan details like principal and term. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.946465773809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#16",
                    "likes": "0",
                    "time": "04/08/2020-23:35:42",
                    "content": "Micro management of the CDP’s should be put in the hands of professionals, likewise all sorts of KYC/AML. MAKER is only a value redistributer, like the public roads in Rome. No KYC/AML needed. MAKER is THE dezentralised national bank of the crypto world. Keep it simple. When a critical mass will be reached- no more voting every week for every detail. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#17",
                    "likes": "0",
                    "time": "04/08/2020-23:55:41",
                    "content": "    allanca:  real-time   The price feed comes from the professional&liquidator. Price feed may not exceed the professional&liquidator safety deposit value. Only ETH price oracles needed. Nothing else. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Blake_Vertalo",
                    "index": "#18",
                    "likes": "1",
                    "time": "05/08/2020-04:30:53",
                    "content": "@allanca You bring up a good point with regards to generalizable models. Acknowledging @Kukkio 's comment on professionals handling the external stuff, there would still be information asymmetry in favor of these trusted external parties. To this extent, I’d be curious as to the community’s comfort level - either broadly in the protocol as is, or in a partitioned ‘regulated’ markets environment (as OP notes) - with leveraging a trusted external 3rd party or diversified group of parties for pricing/valuation both upfront and ongoing. Another consideration with generalization is the MIP6 application process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.473214285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#19",
                    "likes": "1",
                    "time": "05/08/2020-10:45:13",
                    "content": "@Blake_Vertalo, With regards to the pricing of real estate I think there are few alternatives to external third parties. There is no way the Maker community can first develop and thereafter maintain the level of expertise needed for such a task in-house.  The information asymmetry can hopefully be managed by having multiple sources of real estate valuation and be slightly conservative with regards to parameter settings. MIP6 is currently set up to handle the onboarding process of crypto assets and will need a revision for real world assets, you are correct about that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.21969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#20",
                    "likes": "0",
                    "time": "05/08/2020-17:28:10",
                    "content": "    Planet_X:  multiple sources   No need for multiple sources. In fact multiple sources do not make any sense! Contract3000×1600 370 KB Only the Professional third party asset evaluator/liquidator is feeding the price because he is the one who has to get his money back after liquidation. In all cases the CONTRACT FEEDS THE PRICES. The contract  between the Professional and Vault owner can set a FIXED ASSET PRICE. Other price models are possible. Market price can always be a different reality. That is one of the incentives to close CDP’s. MAKER has only the technical risk. The Professional third party asset evaluator/liquidator and the vault holder have all the market risks and KYC/AML risks. I will make a more detailed schematic this weekend. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.326388888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafael.cosman",
                    "index": "#21",
                    "likes": "1",
                    "time": "05/08/2020-19:09:47",
                    "content": "@g_dip while working with originators that manage a portfolio of mortgages may make sense in the future, I think in the short term it may make more sense for Maker to work with RWA debt instruments that are highly commoditized and very well understood, such as US treasury bonds. This would just require a trustworthy tokenizer to tokenize the assets and then they could be supported using the existing Maker infrastructure with little to no changes. Unlike with simple tokenized treasury bonds, it would require a lot of very careful work for Maker to work with an originator with a book of mortgages, and it would be much less transparent for DAI holders to know what assets their DAI is borrowed against. A more complex setup like this might be possible in the long term but I think there are several natural stepping stones before that point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.195572916666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#22",
                    "likes": "1",
                    "time": "09/08/2020-10:54:33",
                    "content": "The MAKER Protocol is a PLATFORM, which allows professionals to generate value from real world assets. Assets can be everything. Air, water, fire, dreams, restricted assets, futures, whatever you like. Vault and professional can be the same person or organization. Maker is a trust layer. It is not mandatory to enter a CDP. The NFT`s can also be traded on the open market. MAKER Protocol handles only: 1. NFT Generator System, 2. ETH, DAI, USDC safety deposits from professional, 3. ETH collateral deposits, 4. NFT collateral deposits, 5. DAI generator, 6. Vault rating system for rebates and incentives, 7. Professional rating system for rebates and incentives, 8. Fee system. Whatever asset CDP2728×1530 1.02 MB ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#23",
                    "likes": "1",
                    "time": "09/08/2020-17:57:17",
                    "content": "    rafael.cosman:  Unlike with simple tokenized treasury bonds, it would require a lot of very careful work for Maker to work with an originator with a book of mortgages, and it would be much less transparent for DAI holders to know what assets their DAI is borrowed against. A more complex setup like this might be possible in the long term but I think there are several natural stepping stones before that point.   The problem is you need find someone who wants to borrow against these bonds. Of course you can tokenize treasury bonds but it’s a long way for crypto to be able to compete with the existing capital markets for such instruments. With the current DAI volatility who would want to deposit treasuries into MCD instead of just leveraging their position with their broker? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.21547619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafael.cosman",
                    "index": "#24",
                    "likes": "1",
                    "time": "13/08/2020-12:51:11",
                    "content": "But you could ask the same question about stablecoins such as TUSD, USDC, or TAUD. These products provide a lot of value for the maker platform even though there are ways of leveraging the equivalents in traditional markets as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#25",
                    "likes": "0",
                    "time": "13/08/2020-22:32:11",
                    "content": "    Kukkio:     I’ll do some math for this thing. I think many things will be more obvious … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#26",
                    "likes": "2",
                    "time": "14/08/2020-02:58:43",
                    "content": "This is a tangent, but it would be cool to see the other currencies supported by Trust Token try to take on FOREX trading in a user friendly platform (where you could use Maker for leverage if governance on-boards them). It may not make sense for small traders, but at scale I think the only costs would be gas fees? If that’s the case, it would probably be pretty competitive. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafael.cosman",
                    "index": "#27",
                    "likes": "1",
                    "time": "14/08/2020-03:36:41",
                    "content": "Yes, that’d be awesome. Nothing like that exists for forex in DeFi today. But we’d like to do it by partnering with Maker, DEXs, and other projects, rather than building it ourselves. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party wanting to collaborate on proposal",
                        "3rd party extending proposal",
                        "3rd party advertising proposal"
                    ],
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#28",
                    "likes": "0",
                    "time": "14/08/2020-05:20:31",
                    "content": "I think this is a very interesting idea, but it would be possible to see some research? Forex trading is currently centralized and competitive, meaning slippages and spreads are quite low. It would be most interesting to see a breakdown of how a decentralized alternative would stack up against a conventional forex website with regards to cost. There are several ways such a service could work: there could be a plain token vs token exchange, there could be a hedging service, it could be pvp or using defi curves etc etc. It is also of course the question if it is in the interest of Maker to have such a site, it would possibly be better if Maker did not own it. A third alternative is of course to just ask Curve or some other team to just include the TrustTokens in their pools. It is after all not Maker’s task to do marketing for Trust Tokens… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4559523809523816
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#29",
                    "likes": "0",
                    "time": "14/08/2020-15:57:18",
                    "content": "Atm it seems like gas fees would eat alive all but the largest players. But I do like the idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafael.cosman",
                    "index": "#30",
                    "likes": "4",
                    "time": "20/08/2020-23:43:57",
                    "content": "@Planet_X we work with the folks at Curve.fi and are working with them to develop pools for other TrueCurrencies, we currently have several for TUSD. I’m not proposing that Maker build out any special functionality specifically for forex- merely, for now, that Maker supports TrueAUD, TrueCAD, and TrueGBP. This’ll enable a bunch of new use-cases, especially when combined with the work we’re doing with Curve.fi and others. ",
                    "links": [
                        "http://Curve.fi"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.9060760667903525
                }
            ]
        }
    ]
}