{
    "poll_list": [
        {
            "title": "Ratification Poll for RWA Foundations (MIP58) - September 13, 2021",
            "index": "9680",
            "option": "Yes",
            "supporting_mkr": "51,163",
            "highest_fraction": 0.55
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip58-rwa-foundations/9680",
            "title": "MIP58: RWA Foundations ",
            "index": 9680,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "real-world-finance",
                "rwa",
                "rwa-foundation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "4",
                    "time": "04/08/2021-10:24:04",
                    "content": " MIP58: RWA Foundations  Preamble MIP#: 58 Title: RWA Foundations Author(s): @SebVentures, @christiancdpetersen Contributors: N/A Type: General Status: Formal Submission Date Proposed: 2021-08-04 Date Ratified: n/a Dependencies: n/a Replaces: n/a   References MIP58c4-SP-Template MIP58c5-SP-Template MIP58c6-SP-Template MIP58c7-SP-Template MIP58c8-SP-Template MIP58c9-SP-Template MIP58c10-SP-Template MIP58c11-SP-Template MIP58c12-SP-Template  Sentence Summary MIP58: RWA Foundations MIP defines the RWA Foundation concept, its scope and formalizes how MakerDAO can guide a RWA Foundation.  Paragraph Summary MIP58: The RWA Foundation is a Cayman Islands legal entity whose purpose is to manage Real-World Assets investments using the Maker Protocol. The Foundation is administered by one or more supervisors, one or more directors, optional committees and optional authorized signers. This MIP defines how MakerDAO can communicate with the supervisors and the directors of such a Foundation. MakerDAO could use multiple Foundations to achieve its goals.  Component Summary MIP58c1: The RWA Foundation Describes the legal structure of the RWA Foundation MIP58c2: The DAO Resolution Describes the DAO Resolution with which MakerDAO can instruct the RWA Foundation to act. MIP58c3: List of active RWA Foundations List the RWA Foundations that recognize this MIP. MIP58c4: Generic DAO Resolution Describes the process of issuing a generic DAO Resolution. MIP58c5: Adding a Supervisor Process Describes the process of adding a supervisor at the RWA Foundation. MIP58c6: Removing a Supervisor Process Describes the process of removing a supervisor at the RWA Foundation. MIP58c7: Addition of a Director Process Describes the process of adding a director at the RWA Foundation. MIP58c8: Removal of a Director Process Describes the process of removing a director at the RWA Foundation. MIP58c9: Addition of a Committee Describes the process of adding a committee at the RWA Foundation. MIP58c10: Removal of a Committee Describes the process of removing a committee at the RWA Foundation. MIP58c11: Addition of an Authorized Signer Describes the process of adding an authorized signer at the RWA Foundation. MIP58c12: Removal of an Authorized Signer Describes the process of removing an authorized signer at the RWA Foundation.  Motivation MakerDAO has a strategy to diversify its supported collateral types by adding Real-World Assets (RWA). For this MIP, RWA are defined broadly as any kind of security, bonds, shares, tokens, loans, notes, mortgage, security interests (the list is not exhaustive). This MIP aims to solve two issues limiting the ability of MakerDAO to implement its strategy:  holding of traditional RWA need to enforce KYC/AML rules (Know Your Customer/Anti-Money Laundering) that the Maker Protocol can’t satisfy in its current shape and with the current regulatory framework; enforcing RWA holding rights like suing in a court of law. The Maker Protocol can’t defend its rights in its current shape and with the current regulatory framework.   Specification / Proposal Details  MIP58c1: The RWA Foundation The RWA Foundation legal structure is based on the Cayman Islands Foundation Companies Law, 2017. The Foundation Company is a very flexible structure that allows for its organization and administration to be modified for specific needs. In the case of the RWA Foundation, this flexibility is used to balance the needs of rigidity in the Foundation management and the need of getting things done. As defined in the following diagram. The RWA Foundation itself is not intended to directly hold any RWA but to have SPV (Special Purpose Vehicle) subsidiaries that hold the actual RWA. RWA Foundation should only hold equity interests in subsidiaries in order to qualify as a “Pure Equity Holding Company” under the “International Tax Co-Operation (Economic Substance) Act” of the Cayman Islands While there could be one Foundation per collateral type, it can also be a SPV per collateral type (or any hybrid combination). This allows to select the right jurisdiction/legal structure for each SPV and define a set of rules (e.g. Articles of Association) for each. As an example, investments in the U.S. may be carried out through a member-managed Delaware LLC (with RWA Foundation as the sole member) or through a Delaware Statutory Trust (with RWA Foundation as the trust sponsor). MakerDAO will lend (or contribute) DAI to the RWA Foundation which will contribute (or lend) the proceeds to the SPV for investment in the RWA. For illustrative purposes, the objects for which the RWA Foundations are established could be the following:  to act as a borrower of a decentralized autonomous organization; to carry out the mandates of a decentralized autonomous organization; to act as a holding company and an investment company, with no restriction on the objects or operations of its subsidiaries or on the nature of its or their investments; to make capital contributions or loans to subsidiaries of the company; to provide financial assistance or benefits to beneficiaries as designated or determined under the articles of association; and to do all such things as in the opinion of the directors are or may be incidental or conducive to the above objects or any of them.   image592×511 5.95 KB  In case this MIP conflicts with the Cayman Islands laws, the Articles of Association or the Memorandum of Association of the RWA Foundation, the latter shall prevail. The RWA Foundation MIP applies to any compatible Cayman Foundation regardless of the name of such Foundation. The parties involved in a RWA Foundation are the following:  members and supervisors who vote at the general meeting and whose main purpose is to appoint/remove directors; directors that are managing the Foundation and can also appoint/remove supervisors; the secretary which is a licensed service provider required by the law; the beneficiary, which, if set, is MakerDAO; committee members, which are advising the directors on specific topics; authorized signers, which is a way for directors to delegate some actions.  While having a member at the creation, this membership is terminated, and a special resolution is passed to irrevocably prohibit the appointment of a member in the future. The RWA Foundation will not have members and is not expected to have one in the future. It is an orphaned entity. The supervisors are independent third-party service companies. The supervisors are voting at the general meeting. The purpose of the supervisor is to act as an “interested person” to enforce the rights of the Foundation and enforce the rights and liabilities of the directors. The RWA Foundation supervisors will be authorized to appoint and remove the directors (but require a DAO Resolution, MIP58c6 or MIP58c7). The supervisors can also change the Articles of Associations by issuing a Special Resolution (but require a DAO Resolution, MIP58c3). The supervisors can be appointed or removed by the directors with by MakerDAO (MIP58c4 and MIP58c5). It is intended to have one supervisor, being a reputable servicing company. The directors are independent third-party service companies. The directors are managing the Foundation. They are appointed or removed by the supervisors with an ordinary resolution of the general meeting (MIP58c6 and MIP58c7). While they can manage the day to day administratives part of the Foundation, more impacting actions need to be initiated and ratified by MakerDAO (MIP58c3). It is intended to have one director, being a reputable independent third-party service company. It is intended that the director service company is different from the supervisor independent third-party service company. This provide a better redundancy. The committee is a group of MakerDAO appointed people through a DAO Resolution to the directors (MIP58c9 and MIP58c10). The DAO Resolution will set forth the size, composition and authorities of the Committee. The Committee, if adopted, is intended to have some defined level of authority to instruct the directors to carry out certain predefined actions in respect of RWA without having to revert to Maker on every administrative detail. The directors will still have to accept to act on the guidance and follow their fiduciary duty to the RWA Foundation and obedience to the Cayman laws. This provide some additional safety versus appointing those MakerDAO people as directors. It also reduce the need of paperwork and scrutiny on MakerDAO people, possibily allowing pseudonymous committee members. A potential list of delegations that can be left to the committee is the following:  Notifify the borrower of a default; Take any time sensitive measures to protect lender rights; Immaterial (non-monetary) waivers under financing agreements; Immaterial (non-monetary) amendments under financing agreements; Administrative matters to maintain SPV security (UCC filings, renewals); Authorize payments of administrative fees, costs and expenses for loan management.  The autorized signers are appointed by the directors following a DAO Resolution. They are given the power to represent the RWA Foundation on a set of limited topics. For instance, they can be appointed to open a bank account to the benefit of a RWA Foundation SPV (one time event) or to issue a default notice when there is a need to (ongoing authorization). That can be used when the directors is not willing to convey the action (for instance because he is not competent in the designed jurisdiction) or to save cost and time (each director action being an expense). Both the committee and the authorized signers are optionals and can be set up or removed by the directors following a DAO Resolution.     Actor Direct power Indirect Power Required Trust Exemples of actions (issuance)     Supervisor High High High Administrative tasks (if any)   Director High High High Day to day administration of the Foundation   Committee None Custom Limited Custom   Authorized signer Custom Custom Limited Administrative task of RWA administration at the SPV level   MakerDAO None Very High Absolute Anything    This MIP manage only the actors power in respect to the Cayman Foundation and its subsidiaries. The flow of DAI and, if applicable, other currencies should be secured by separated MIPs. One solution is to use the RwaConduit smart contract from MIP21 and/or escrow accounts. To summarize, there are 3 levels of decision making (origination of the decision):  For administrative tasks (like paying the annual registration fee), those are done directly by the directors. By construction, the servicing companies will not take more elaborate decisions; For significant tasks (creation of a SPV, selling an asset of a SPV, …), directors will act on the basis of a DAO Resolution; For time sensitive and/or low to medium impact tasks (like sending a notice of default to a borrower):  the committee can be delegated the power to instruct the directors to act; an authorized signer can be delegated the power to act.    This MIP doesn’t define the limits of those decision making types. That can be defined for each RWA Foundation and changed over time by MakerDAO.  MIP58c2: DAO Resolution The RWA Foundation recognizes the concept of DAO Resolutions by which MakerDAO can instruct the RWA Foundation to act and ratify such a decision when taken. The following components of this MIP formalize those DAO Resolutions. DAO Resolutions don’t have to follow this MIP process, but DAO Resolutions not following this MIP should be avoided and are discouraged. It is understood that the recipients of the DAO Resolution (supervisor or directors of the RWA Foundation) might alter the instructions to comply with law, regulations, and formal processes. They are not allowed to alter the representation of the intent. MakerDAO can take the following type of instructions:  Ordinary Resolution to be issued and approved at the next General Meeting of the RWA Foundation Special Resolution to be issued and approved at the next General Meeting of the RWA Foundation Instruction to directors   MIP58c3: List of active RWA Foundations This list can be amended by any interest party providing evidence that the provided legal entity is compatible with this MIP or no longer active. It is provided for reference and usage of DAO Resolution is not limited to this list. Entries into this list should follow the following template: Legal entity name: Address:  Active RWA Foundations List  MIP58c4: Generic DAO Resolution This subproposal is used to issue a DAO Resolution. Such subproposal has a validity of 30 days from the execution date. MIP58c4 subproposals have the following parameters:  Feedback Period: 2 weeks Frozen Period: 2 weeks  MIP58c4 subproposals must use the template located at this link. This template is considered ratified once this MIP moves to Accepted status.  MIP58c5: Adding a Supervisor Process This subproposal is used to instruct the RWA Foundation directors to appoint a supervisor (and ratify such appointment). Such subproposal has a validity of 1 year (365 days) from the execution date. If added by the directors and not removed, the supervisor appointment survives the validity of the subproposal. The supervisors should be reputable service providers entities. There are not expected to take any decision beside acting on DAO Resolutions. therefore, the risk of appointing a rogue supervisors is quite limited. It is the intent of the MIP to add a supervisor only to replace a defaulting or resigning supervisor. Having more than one supervisor doesn’t bring significant benefits but increases the costs. MIP58c5 subproposals have the following parameters:  Feedback Period: 2 weeks Frozen Period: 2 weeks  MIP58c5 subproposals must use the template located at this link. This template is considered ratified once this MIP moves to Accepted status.  MIP58c6: Removing a Supervisor Process This subproposal is used to instruct the RWA Foundation directors to remove a supervisor (and ratify such removal). Such subproposal has a validity of 1 year (365 days) from the execution date. MIP58c6 subproposals have the following parameters:  Feedback Period: 2 weeks Frozen Period: 2 weeks  MIP58c6 subproposals must use the template located at this link. This template is considered ratified once this MIP moves to Accepted status.  MIP58c7: Adding a Director Process This subproposal is used to instruct the RWA Foundation supervisors to appoint a director (and ratify such appointment). Such subproposal has a validity of 1 year (365 days) from the execution date. If added by the supervisors and not removed, the director appointment survives the validity of the subproposal. The supervisors should be reputable service providers entities. There are not expected to take any decision beside acting on DAO Resolutions and managing the day to days administrative operations of the Foundation. While not expected to act on significant matters without a DAO Resolution or a Committee guidance, it is always a possibility that external actors would act in good faith on directors’ resquest (without a DAO Resolution) incuring a liability for the Foundation. This should be a quite remote issue with any service provider. It is the intent of the MIP to add a director only to replace a defaulting or resigning director. Having more than one director doesn’t significantly reduce the issue mentioned above. MIP58c7 subproposals have the following parameters:  Feedback Period: 2 weeks Frozen Period: 2 weeks  MIP58c7 subproposals must use the template located at this link. This template is considered ratified once this MIP moves to Accepted status.  MIP58c8: Removing a Director Process This subproposal is used to instruct the RWA Foundation supervisors to remove a director (and ratify such removal). Such subproposal has a validity of 1 year (365 days) from the execution date. MIP58c8 subproposals have the following parameters:  Feedback Period: 2 weeks Frozen Period: 2 weeks  MIP58c8 subproposals must use the template located at this link. This template is considered ratified once this MIP moves to Accepted status.  MIP58c9: Creation of a Committee This subproposal is used to instruct the RWA Foundation director to create a committee (and ratify such creation). Such subproposal has a validity of 1 year (365 days) from the execution date. If appointed by the directors and not removed, the committee survives the validity of the subproposal. It is important to be careful when defining the committee members and the authority they would have. MIP58c9 subproposals have the following parameters:  Feedback Period: 2 weeks Frozen Period: 2 weeks  MIP58c9 subproposals must use the template located at this link. This template is considered ratified once this MIP moves to Accepted status.  MIP58c10: Termination of a Committee This subproposal is used to instruct the RWA Foundation director to terminate a committee (and ratify such termination). Such sub proposal has a validity of 1 year (365 days) from the execution date. MIP58c10 subproposals have the following parameters:  Feedback Period: 1 week Frozen Period: 1 week  MIP58c10 subproposals must use the template located at this link. This template is considered ratified once this MIP moves to Accepted status.  MIP58c11: Creation of an Authorized Signer This subproposal is used to instruct the RWA Foundation director to create a committee (and ratify such creation). Such sub proposal has a validity of 1 year (365 days) from the execution date. If appointed by the directors and still valid, the signing authorization survive the validity of the subproposal. It is important to be careful when delegating powers to authorized signers as they can create liabilities to the Foundation. The mandate should be limited in scope and, if possible, limited in time. MIP58c11 subproposals have the following parameters:  Feedback Period: 2 weeks Frozen Period: 2 weeks  MIP58c11 sub proposals must use the template located at this link. This template is considered ratified once this MIP moves to Accepted status.  MIP58c12: Termination of an Authorized Signer This subproposal is used to instruct the RWA Foundation director to terminate an authorized signer (and ratify such amendment of termination). Such sub proposal has a validity of 1 year (365 days) from the execution date. MIP58c12 subproposals have the following parameters:  Feedback Period: 1 week Frozen Period: 1 week  MIP58c12 subproposals must use the template located at this link. This template is considered ratified once this MIP moves to Accepted status.  MIP58c4: Subproposal Template for Generic DAO Resolution  Preamble MIP58c4-SP#: # Author(s): Contributors: Status:  Date Applied: <yyyy-mm-dd> Date Ratified: <yyyy-mm-dd>   Sentence Summary  One liner for this subproposal   Specification  Motivation  Why are you proposing this Generic DAO Resolution   RWA Foundation designation  Specify the designation of the RWA Foundation in order to identify it without doubt. You can refer to MIP58c3 for the list of possible RWA Foundations.   DAO Resolution type  Specify the type of resolution  Ordinary Resolution to be issued and approved at the next General Meeting of the RWA Foundation Special Resolution to be issued and approved at the next General Meeting of the RWA Foundation Instruction to directors     DAO Resolution instruction  Describe the action to be done.   MIP58c5: Subproposal Template for Adding a Supervisor DAO Resolution  Preamble MIP58c5-SP#: # Author(s): Contributors: Status:  Date Applied: <yyyy-mm-dd> Date Ratified: <yyyy-mm-dd>   Sentence Summary  One liner for this subproposal   Specification  Motivation  Why are you proposing this Adding a Supervisor DAO Resolution   RWA Foundation designation  Specify the designation of the RWA Foundation in order to identify it without doubt. You can refer to MIP58c3 for the list of possible RWA Foundations.   Supervisor to add  Specify the supervisor that need to be appointed by the RWA Foundation directors.   MIP58c6: Subproposal Template for Removing a Supervisor DAO Resolution  Preamble MIP58c6-SP#: # Author(s): Contributors: Status:  Date Applied: <yyyy-mm-dd> Date Ratified: <yyyy-mm-dd>   Sentence Summary  One liner for this subproposal   Specification  Motivation  Why are you proposing this Removing a Supervisor DAO Resolution   RWA Foundation designation  Specify the designation of the RWA Foundation in order to identify it without doubt. You can refer to MIP58c3 for the list of possible RWA Foundations.   Supervisor to remove  Specify the supervisor that needs to be removed by the RWA Foundation directors.   MIP58c7: Subproposal Template for Adding a Director DAO Resolution  Preamble MIP58c7-SP#: # Author(s): Contributors: Status:  Date Applied: <yyyy-mm-dd> Date Ratified: <yyyy-mm-dd>   Sentence Summary  One liner for this subproposal   Specification  Motivation  Why are you proposing this Adding a Director DAO Resolution   RWA Foundation designation  Specify the designation of the RWA Foundation in order to identify it without doubt. You can refer to MIP58c3 for the list of possible RWA Foundations.   Director to add  Specify the director that need to be appointed by the RWA Foundation supervisors at the next general meeting.   MIP58c8: Subproposal Template for Removing a Director DAO Resolution  Preamble MIP58c8-SP#: # Author(s): Contributors: Status:  Date Applied: <yyyy-mm-dd> Date Ratified: <yyyy-mm-dd>   Sentence Summary  One liner for this subproposal   Specification  Motivation  Why are you proposing this Removing a Director DAO Resolution   RWA Foundation designation  Specify the designation of the RWA Foundation in order to identify it without doubt. You can refer to MIP58c3 for the list of possible RWA Foundations.   Director to remove  Specify the director that needs to be removed by the RWA Foundation supervisors at the next general meeting.   MIP58c9: Subproposal Template for Creation of a Committee DAO Resolution  Preamble MIP58c9-SP#: # Author(s): Contributors: Status:  Date Applied: <yyyy-mm-dd> Date Ratified: <yyyy-mm-dd>   Sentence Summary  One liner for this subproposal   Specification  Motivation  Why are you proposing this Creation of a Committee DAO Resolution   RWA Foundation designation  Specify the designation of the RWA Foundation in order to identify it without doubt. You can refer to MIP58c3 for the list of possible RWA Foundations.   Committee identifier  Provide a unique identifier for this committee so it can be referenced for termination.   Committee composition  Specify the members of this committee. They could be pseudonymous but need a defined way to be publicly identified (a forum or chhat handle). They might need to have an email shared with the directors to sign.   Committee quorum  Specify the quorum needed for the committee to be able to make a recommendation to the directors.   Committee minimum affirmative votes  Specify the number of affirmative votes needed for a committee decision to be recognized by the directors as legit.   Committee mandate  Specify the items on which the committee can give instruction to the directors.   MIP58c10: Subproposal Template for Removing a Committee DAO Resolution  Preamble MIP58c10-SP#: # Author(s): Contributors: Status:  Date Applied: <yyyy-mm-dd> Date Ratified: <yyyy-mm-dd>   Sentence Summary  One liner for this subproposal   Specification  Motivation  Why are you proposing this Removing a Director DAO Resolution   RWA Foundation designation  Specify the designation of the RWA Foundation in order to identify it without doubt. You can refer to MIP58c3 for the list of possible RWA Foundations.   Committee to remove  Identification of the committee to be removed. This can be found in the corresponding MIP58c9 subproposal.   MIP58c11: Subproposal Template for Creation of an Authorized Signer DAO Resolution  Preamble MIP58c11-SP#: # Author(s): Contributors: Status:  Date Applied: <yyyy-mm-dd> Date Ratified: <yyyy-mm-dd>   Sentence Summary  One-liner for this subproposal   Specification  Motivation  Why are you proposing this Creation of an Authorized Signer DAO Resolution   RWA Foundation designation  Specify the designation of the RWA Foundation in order to identify it without doubt. You can refer to MIP58c3 for the list of possible RWA Foundations.   Authorized signer identification  Provide the name of the authorized signer and all information needed so the directors can identify the authorized signer. The authorized signer should be able to pass KYC.   Signing delegation  Specify the signing delegation to be set in place. It is important to be specific (in scope and in time).   MIP58c12: Subproposal Template for Removing an Authorized Signer DAO Resolution  Preamble MIP58c12-SP#: # Author(s): Contributors: Status:  Date Applied: <yyyy-mm-dd> Date Ratified: <yyyy-mm-dd>   Sentence Summary  One liner for this subproposal   Specification  Motivation  Why are you proposing this Removing a Director DAO Resolution   RWA Foundation designation  Specify the designation of the RWA Foundation in order to identify it without doubt. You can refer to MIP58c3 for the list of possible RWA Foundations.   Signing delegation to remove  Identification of the authorized signer to be removed. This can be found in the corresponding MIP58c11 subproposal.  ",
                    "links": [
                        "https://forum.makerdao.com/t/centrifuge-an-update-on-rwa-in-defi/9854/6",
                        "https://forum.makerdao.com/t/informal-poll-using-the-cayman-foundation-to-invest-in-financials-assets-at-scale/9790/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-63-en-espanol/10443",
                        "https://forum.makerdao.com/t/informal-poll-do-we-want-legal-representation-advice-for-the-whole-dao/10260/20",
                        "https://forum.makerdao.com/t/maker-relay-ep-63/10400",
                        "https://forum.makerdao.com/t/maker-relay-ep-62-en-espanol/10399",
                        "https://forum.makerdao.com/t/weekly-mips-update-54/10398",
                        "https://forum.makerdao.com/t/maker-relay-ep-62/10311",
                        "https://forum.makerdao.com/t/weekly-mips-update-53/10310",
                        "https://forum.makerdao.com/t/weekly-mips-update-52/10192",
                        "https://forum.makerdao.com/t/real-world-finance-core-unit-report-2021-08/10123",
                        "https://forum.makerdao.com/t/weekly-mips-update-51/10079",
                        "https://forum.makerdao.com/t/weekly-mips-update-50/9992",
                        "https://forum.makerdao.com/t/solar-x-collateral-onboarding-risk-assessment/9977",
                        "https://forum.makerdao.com/t/maker-relay-ep-58-en-espanol/9949",
                        "https://forum.makerdao.com/t/maker-relay-ep-57-en-espanol/9948",
                        "https://forum.makerdao.com/t/maker-relay-ep-58/9892",
                        "https://forum.makerdao.com/t/weekly-mips-update-49/9890",
                        "https://forum.makerdao.com/t/paxos-makerdao-partnership-usdp-psm/19469",
                        "https://forum.makerdao.com/t/centrifuge-an-update-on-rwa-in-defi/9854/4",
                        "https://forum.makerdao.com/t/know-your-mip-10-mip58-rwa-foundations/9864",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-153-thursday-august-5-17-00-utc/9671/2",
                        "https://forum.makerdao.com/t/informal-poll-using-the-cayman-foundation-to-invest-in-financials-assets-at-scale/9790",
                        "https://forum.makerdao.com/t/maker-relay-ep-57/9760",
                        "https://forum.makerdao.com/t/weekly-mips-update-48/9757",
                        "https://forum.makerdao.com/t/centrifuge-an-update-on-rwa-in-defi/9854/9",
                        "https://forum.makerdao.com/t/rwa-foundation-hvb-disclosure/16267/10",
                        "https://forum.makerdao.com/t/real-world-finance-decision-making-and-delegated-committee-proposal/15276/38",
                        "https://forum.makerdao.com/t/mip65-project-clydesdale-monetalis-arrangement-i-liquid-bond-strategy-execution/13148/73",
                        "https://forum.makerdao.com/t/mip41c5-sp1-facilitator-offboarding-rwf-001/11306/2",
                        "https://forum.makerdao.com/t/signal-request-p1-drop-change-of-covenants-for-p1-drop-farmlands/11236/17",
                        "https://forum.makerdao.com/t/rwa-foundation-001-rwa-foundation/11066",
                        "https://forum.makerdao.com/t/investing-our-liquidity-in-short-term-etf-managing-psms-exposures/10891",
                        "https://forum.makerdao.com/t/real-world-finance-core-unit-report-2021-09/10825",
                        "https://forum.makerdao.com/t/weekly-mips-update-55/10539",
                        "https://forum.makerdao.com/t/mip55c3-sp01-adding-special-purpose-fund-for-feasibility-study-for-securitisation-framework-in-singapore/10493/4",
                        "https://forum.makerdao.com/t/rwa-foundations-jersey-edition/10477"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4756544534912415
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#2",
                    "likes": "0",
                    "time": "04/08/2021-10:30:23",
                    "content": "This MIP follows the Pre-MIP discussion on RWA Foundations. The Articles of Associations of the initial RWA Foundation will be linked here (and probably also in the MIP), they are still being edited by our Cayman counsels and should be available by the end of next week. We will also be able to provide the names of the initial service companies for the supervisor role and the director role. It is our intention to create such a Foundation before the end of the MIP process in accordance with the timeline for SolarX. The RWF CU budget does have an item for such expense. This structure will most likely be used even if SolarX is not voted by MKR holders. ",
                    "links": [
                        "https://forum.makerdao.com/t/solarx-mip6-application-uprets-solarx-industrial-real-estate-backed-loans/6718/36",
                        "https://forum.makerdao.com/t/mip40c3-sp12-modify-core-unit-budget-rwf-001/7985"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.777777777777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "1",
                    "time": "06/08/2021-13:22:26",
                    "content": "Update on the legal documents of such Foundation:  Memorandum of Association Articles of Association  It’s still a work in progress but the end result should be pretty close. In the Articles of Association, 4.17 to 4.20 are concerning the Committees and 4.21 to 4.22 for the Authorized Signers. Articles 1.5 to 1.8 are considering the fact that MakerDAO can “go dark”. This is not expected to happen but still leaves some options to manage such a scenario. Currently, the wording is to rely on the Maker Governance Voting Portal. Probably better to use the on-chain and reference the portal as no more than a UI. That remains to be discussed with the servicers and can be updated in the future. For the name of the company, we can go as easy as RWA Foundation but any other idea is welcome. Regarding the Committee, it would make sense that the RWA Committee PPG related to the collateral handled by the RWA Foundation would also be the RWA Foundation committee (as defined in this MIP and in the Articles of Associations). This will have nothing to do with the MIP57 RWA Committee. The new composition of the RWA Committee PPG should be announced shortly by @prose11. ",
                    "links": [
                        "https://drive.google.com/file/d/1H1pbZ2PpW05mnr4E0DtUyyi93Pq6EBO_/view?usp=sharing",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-rwa-committee/7893",
                        "https://forum.makerdao.com/t/mip57-rwa-committee/9304",
                        "https://forum.makerdao.com/t/centrifuge-an-update-on-rwa-in-defi/9854/6"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.576467803030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#4",
                    "likes": "3",
                    "time": "06/08/2021-16:56:57",
                    "content": "Is there a way for this structure to separate the cash flow from the management aspect? So that the DAI can be withdrawn/repaid by the ultimate borrower rather than having to flow through a Foundation + SPV. Decisions about whether and how much to finance for a proposed asset are made at the DAO level, so it seems like it would streamline things to let the end borrower access a RWA-style vault. That then leaves any legal entity with just management and monitoring duties without the liability of handling large sums of DAI going back and forth. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-58/9892"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.614285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#5",
                    "likes": "2",
                    "time": "06/08/2021-17:05:57",
                    "content": "Yes, the flow of cash should be separated as much as we can. There is a part on that:     SebVentures:  This MIP manage only the actors power in respect to the Cayman Foundation and its subsidiaries. The flow of DAI and, if applicable, other currencies should be secured by separated MIPs. One solution is to use the RwaConduit smart contract from MIP21 and/or escrow accounts.   But you still have all the “asset” management part, like going after the borrower in case of default, selling the asset to a third party, signing the documents, … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.289285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "2",
                    "time": "16/08/2021-14:59:04",
                    "content": "One small thing I like to point out–most of the language in your proposal sounds singular, as oppose to plural. It reads as one (1) RWA Foundation, as oppose to many RWA Foundations. Hence, why it can be interpreted as a centralized entity, one (1) Foundation. But that is just my interpretation of reading such, and others might understand it correctly. Just my 2 Gwei. So, I was reading-up on Cayman Foundation Companies as “Not-for-Profit Enterprises”–and an article I came across described the roles of “Founders”, Directors, Supervisors, etc. – in this scenario (MIP58) the “Founders” are MKR token holders, correct? If so, who is the legal person responsible for establishing the structure? Also, will the governing documents specify what (if any) powers the Founder (legal person) will retain? Maybe you pointed that out and I missed it. Thanks in advanced. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-58/9892"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.90625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#7",
                    "likes": "0",
                    "time": "16/08/2021-16:00:53",
                    "content": "    flipflopflapdelegate:  One small thing I like to point out–most of the language in your proposal sounds singular, as oppose to plural.   I see, and I used “The” instead of “a”. Thanks. Still remains an open question on how many we need. Makes sense that none is having more than 5% of MakerDAO assets, should it be 1%? Something else, like one per asset? I don’t know. Having 10 Foundation with exactly the same articles and the same people is not really helping neither.     flipflopflapdelegate:  the “Founders” are MKR token holders   There is no Founder role in the articles of the current implementation of the Foundation (but could be added in this one or others and still work under MIP58). Founder is an option (not defined so no right by default) in the Cayman Foundation Company Law. The initial member (establishing the structure) will most likely be the secretary but it will be removed to have an orphaned entity. No new members are possible. MakerDAO could be designed as the Beneficiary (and/or as a Founder I guess). We choose not to in order to limit MakerDAO importance in the constitution. I like to avoid putting MakerDAO to much in the spotlight for no reason. This can be changed in the articles or after the creation by a DAO Resolution. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.467341482047364
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#8",
                    "likes": "3",
                    "time": "26/08/2021-18:11:39",
                    "content": "We have discussed with the RWF CU to let the Asset Originator deploy Foundation + LLC (following the template). On one hand, that will look like more decentralized. This will also remove work on our side for the same result. On the other hand, this might move the problem as we need to be sure that they are well managed and funded (able to pay for their operating expenses). It might also remove borrowers that don’t want to deal with setting the structure (which could be a good thing or not). As a follow-up we have asked our counsel to update the Memo of the Foundation to enable investment through a Trust (like a Delaware Statutory Trust). I want to highlight item (e) that seems too wide but is needed as trusts will not be subsidiaries but third parties (that’s the whole point of orphaning them). Directors will still need a DAO Resolution to do something with that and usage of MIP21/escrows accounts will make that they don’t have much to control anyway. Nevertheless, if the community is concerned we can remove those additions (but that will remove the ability to use a Trust).  image708×407 83.5 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.079545454545454
                }
            ]
        }
    ],
    "group_index": "3977"
}