{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip104-the-decentralized-collateral-scope-framework/19685",
            "title": "MIP104: The Decentralized Collateral Scope Framework ",
            "index": 19685,
            "category": [
                "Maker Improvement Proposals",
                "Formal Submission"
            ],
            "tags": [
                "mips",
                "impact-:-high",
                "endgame",
                "scope-framework",
                "constitution-mip-set"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "1",
                    "time": "06/02/2023-14:55:33",
                    "content": " MIP104: The Decentralized Collateral Scope Framework  Preamble MIP#: 104 Title: The Decentralized Collateral Scope Framework Author(s): @rune Contributors: Tags: endgame, scope-framework Type: General Status: Formal Submission Date Proposed: 2023-02-06 Date Ratified: <yyyy-mm-dd> Dependencies: Replaces: Forum URL: https://forum.makerdao.com/t/mip104-the-decentralized-collateral-scope-framework/19685 Ratification Poll URL:   Sentence Summary The Decentralized Collateral Scope Framework provides the core principles, rules and regulation regarding Decentralized Collateral in the Endgame.  Paragraph Summary MIP104 establishes the Decentralized Collateral Scope Framework. This includes both decentralized collateral offered directly in Maker Core Vaults, as well as lines of credit to other entities that are collateralized only by decentralized assets. All rules for Decentralized Collateral for the DAO are contained in this framework, including the procedures of the Decentralized Collateral Scope Framework Advisory Council.  Component Summary MIP104c1: Preamble Contains the Preamble to the Decentralized Collateral Scope Framework. MIP104c2: Scope Framework Articles Contains the Scope Framework Articles for the Decentralized Collateral Scope Framework. MIP104c3: Decentralized Collateral Facilitators Contains details on the Decentralized Collateral Facilitators for the Decentralized Collateral Scope Framework. MIP104c4: Scope Framework Articles Modification Subproposal Process Contains details of how the Decentralized Collateral Scope Framework can be amended.  Motivation The Decentralized Collateral Scope Framework is necessary to define the Scope as per the Maker Constitution.  Specification  MIP104c1: Preamble The Decentralized Collateral Scope defines the principles and processes for all activity related to Decentralized Collateral Management. This includes both decentralized collateral offered directly in Maker Core Vaults, as well as lines of credit to other entities that are collateralized only by decentralized assets. The Decentralized Collateral Scope Framework is constrained by the elements of MIP101: The Maker Constitution article 10.2: Constitutional Boundaries of the Decentralized Collateral Scope Framework and tied to Benchmark Yields defined in MIP103: The Stability and Liquidity Scope Framework.  MIP104c2: Scope Framework Articles  1: The Decentralized Collateral Advisory Council  1.1: The Decentralized Collateral Advisory Council definition The Decentralized Collateral Advisory Council is a group of Ecosystem Actors that have been approved by Maker Governance to carry out advisory work related to improving the content of the Decentralized Collateral Scope Framework.  1.2: Decentralized Collateral Advisory Council membership management Members of the Advisory Council are directly approved by Maker Governance through a governance poll, and must fulfill specific criteria.   1.2.1: The Decentralized Collateral Facilitators must ensure that potential Advisory Council Members can apply to be approved by Maker Governance, using an open process with clear instructions.     1.2.2: During the early stages of the Pregame Launch, Decentralized Collateral Advisory Council Members can also be Decentralized Collateral Facilitators and can also use Advisory Council project funds to perform other tasks related to the Decentralized Collateral Scope.     1.2.3: The Decentralized Collateral Facilitators must periodically, when it is relevant, review the Advisory Council Applications, and if they find applications that are suitable, bring them to a vote through an MKR governance poll. Approved Advisory Council Members are added to 10.2.3.1.     1.2.4: The Decentralized Collateral Facilitators may, if they deem it necessary, hold a vote to remove an Advisory Council Member. If an Advisory Council Member has not done any paid work for the Scope for at least 1 year, then the Decentralized Collateral Facilitators can choose to remove them at will, if they deem it necessary.     1.2.5: The current approved Avisory Council Members are recorded in 1.2.5.1A.  1.2.5.1A:  ¤¤¤ Current list of Advisory Council Members:     Advisory Council Member ETH Address     BA Labs 0xDfe08A40054685E205Ed527014899d1EDe49B892     ¤¤¤    1.3: Decentralized Collateral Advisory Council projects and funding The Advisory Council is paid on a project basis to do specific work that improves all or specific parts of the Scope Framework.   1.3.1: Each Quarter, if they deem it necessary, the Decentralized Collateral Facilitators must solicit proposals and find one or more suitable Advisory Council Members to perform a project that will result in output that can be used to improve the Scope Framework. This work output will be presented to the CVC Subcommittee Meetings as the starting point for the CVC Scope Framework Position Documents. As many CVCs as possible should be supported this way, prioritized by the Decentralized Collateral Facilitators.     1.3.2: In case an ambiguous, uncertain or challenging situation arises related to the Scope Framework, the Decentralized Collateral Facilitators may approach one or more Advisory Council Members to perform a reactive project that aims to specify the language of the Scope Framework to take into account the specific situation. The Decentralized Collateral Facilitators can then directly propose the change to the Scope Framework in a weekly governance poll, quickly resolving the challenge.     1.3.3: The Advisory Council may not produce work output that is directly compatible with the formatting of the Scope Framework. In this case the Decentralized Collateral Facilitators must either transcribe it themselves, or hire an Ecosystem Actor to perform the transcription. This role does not require pre approval by Maker Governance.     1.3.4: The Decentralized Collateral Facilitators may also produce advisory input on the content of the Scope Framework themselves, as long as it is focused on improving process and governance content. They are prohibited from providing unilateral input on expert subject matter content.     1.3.5: The Decentralized Collateral Facilitators have a budget available to pay for Advisory Council Projects per quarter. All spending must be limited to only what is deemed necessary and with a high probability of producing clearly measurable value, and this must transparently be accounted for in a forum post at least a week before any transaction occurs.   1.3.5.1: ¤¤¤ Advisory Council project budget:     Maximum Monthly Amount (DAI) Maximum Monthly Amount (MKR) Implementation Start Date Notes     207,000 N/A DssVest 2023-03-01 (Backdated) N/A   73,000 15 DssVest 2023-04-01 For Data Related Expenses     ¤¤¤      2: The Implementation of the Decentralized Collateral Scope Framework through Software The Decentralized Collateral Facilitators must in collaboration with the CVC Subcommittees, periodically review possibilities of integrating DAO toolkit innovation into the processes and content of the Scope Framework.  3: Ordinary Core Vault Type management  3.1: Risk parameters of Core Vaults The Decentralized Collateral Facilitators can propose risk parameter changes to Core Vaults that help increase the income of the protocol and mitigate risk of loss. The Risk parameters must be within the boundaries defined in the subelements of this section. Changes to the Stability Fee and Liquidation Ratio parameters cannot be proposed unless it is based on explicit instructions provided in the Scope Framework, or it is due to a solvency or liquidity emergency. Instead, the Scope Framework must first be changed in order to define the process for making further changes to the Stability and Liquidation Ratio.   3.1.1: All Core Vaults must have a Stability Fee at least equivalent to the Yield Collateral Benchmark Yield defined in MIP103: The Stability and Liquidity Scope Framework 3.3.5.1. The Decentralized Collateral Facilitators must use the weekly governance cycle to submit executive votes that increases the Stability Fee of Core Vaults that are below the minimum Stability Fee.   3.1.1.1: The Decentralized Collateral Facilitators can trigger a Governance Poll to designate a Core Vault Type as exempt from the Yield Collateral Benchmark Yield requirement. If the Governance Poll succeeds, no further governance polls are required to attempt to increase the Stability Fee of the exempted Core Vault Type.     3.2: Minimum net surplus requirements for Ordinary Core Vaults Core Vault Types which do not contain Strategic Collateral Asset Types as defined in Article 4, or Transitory Collateral Asset Types as defined in Article 5, must generate an amount of net surplus after direct related expenses (maintenance, oracle and other) combined across all Vault Types including same Collateral Type, that is equivalent to at least 10% of the average net surplus of the 4 largest Core Vault Types containing Strategic Collateral Assets measured by debt exposure. The absolute minimum net surplus generation permitted for a specific Ordinary Core Vault Type is 100,000 Dai per year.   3.2.0: Example: WBTC is a Centralized Transitory Collateral Asset Type which is included in WBTC-A, WBTC-B, WBTC-C Vault Types, and must generate 10% of surplus in aggregate relative to the average surplus generation of ETH-A, ETH-B, ETH-C and WSTETH-A. (In current state on Feb 23th the requirement is 235k Dai)   3.2.1: If an Ordinary Collateral Type is not generating the necessary minimum net surplus for longer than 180 days, or if a specific Ordinary Core Vault Type fails to meet the requirement of the absolute minimum net surplus generation for longer than 180 days, it must enter the offboarding process. The offboarding process consists of two phases.   3.2.1.1: In the first phase, the Decentralized Collateral Facilitators must initiate an on-chain governance process to increase Stability Fees of the respective Vault Types to the level at which the conditions in 3.2 are met. If this increase would make the Stability Fee of the Core Vault Type become more than 5 times as high as the highest Stability Fee of any other Core Vault Type, the Core Vault Type is instead immediately offboarded according to 3.2.1.2. An Ordinary Collateral Type or specific Ordinary Vault Type can be in the first offboarding phase for a maximum of 60 days. The Responsible Facilitator has the ability to reduce the specified duration of the first phase or entirely skip it, and must make a public forum post to notify when this ability is used.  3.2.1.2: Once the 60 day maximum period passes (or the modified time period defined by the Decentralized Collateral Facilitators passes), or if it was not possible to raise the Stability Fee of the Core Vault Type, the Core Vault Type enters the second phase, which follows the process defined in the MIP62: Collateral Offboarding Process.     4: Strategic Collateral Asset Types  4.1: Strategic Collateral Asset Types Core Vaults containing Strategic Collateral Asset Types are not subject to the requirements of 3.2.   4.1.1 Strategic Collateral Asset Types are specified in 4.1.1.1A and can be changed based on a Governance Poll by MKR holders initiated by the Decentralized Collateral Facilitators.   4.1.1.1A: ¤¤¤ The list of Strategic Collateral Asset Types is:  ETH STETH RETH ¤¤¤       4.2: Loss-making Strategic Collateral In case a Strategic Collateral Asset Type is causing net losses to the protocol after maintenance, oracle and other expenses are accounted for, the Decentralized Collateral Facilitators must periodically make a Governance Poll for MKR holders to remove the Strategic Collateral Asset Type from the list in 4.1.1.1A. The frequency of the removal Governance Polls should be based on the strategic importance of the Collateral Asset Type.  5: Transitory Collateral Asset Types  5.1: Transitory Collateral Asset Types Definitions Collateral Asset Types in Transition (i.e. Transitory Collateral Asset Types) are either (i) assets that have a high potential to be transitioned to SubDAOs once SubDAOs are established and functioning (i.e. SubDAO Transitory Collateral Asset Types) or (ii) Collateral Asset Types that are deemed too centralized to be included in the Decentralized Collateral Scope Framework, and hence will instead likely be further defined in future iterations of MIP105: The Real-World Asset Collateral Scope Framework (i.e. Centralized Transitory Collateral Asset Types). Once an asset is either (i) defined as part of MIP105: The Real-World Asset Collateral Scope Framework, or (ii) transitioned into a SubDAO, its definition and presence in Article 5 in the Decentralized Collateral Scope Framework immediately becomes null and void and the Responsible Facilitator must remove it from 5.2.1.1 and 5.3.1.1.  5.2: SubDAO Transitory Collateral Asset Types SubDAO Transitory Collateral Asset Types are not subject to the requirements of 3.2.   5.2.1: SubDAO Transitory Collateral Asset Types are specified in 5.2.1.1A and can be changed based on a Governance Poll by MKR holders initiated by the Responsible Facilitator.   5.2.1.1A: ¤¤¤ The list of SubDAO Transitory Collateral Asset Types is: GNO ¤¤¤     5.3: Centralized Transitory Collateral Asset Types Centralized Transitory Collateral Asset Types are not subject to the Benchmark Yield requirements of 3.2. However, the net surplus requirement still applies.   5.3.1: Centralized Transitory Collateral Asset Types are specified in the soft element 5.3.1.1A and can be changed based on a Governance Poll by MKR holders initiated by the Responsible Facilitator.  5.3.1.1A: ¤¤¤ The list of Centralized Transitory Collateral Asset Types is: WBTC ¤¤¤   6: Decentralized Collateral Direct Deposit Module management  6.1: Decentralized Collateral Direct Deposit Modules (DDM) minimum yield Decentralized Collateral DDMs must provide a yield at least equivalent to the Yield Collateral Benchmark Yield defined in MIP103: The Stability and Liquidity Scope Framework 3.3.2, and must earn the protocol a net surplus of at least 1 million Dai per year after maintenance, oracle and other expenses.  6.2: Decentralized Collateral Direct Deposit Module minimum net surplus Decentralized Collateral DDMs must provide the Maker Protocol a net surplus at least equivalent to the minimum requirement defined in 3.2.  6.3: SubDAO Decentralized Lending Module subsidy SubDAO Decentralized Lending Modules can be subsidized with Decentralized Collateral DDMs in order to ensure an active market with a minimum level of users exists. Such Decentralized Collateral DMMs can have up to 200 million Debt Ceiling at the Subsidized rate. The subsidized rate is equivalent to the benchmark return of very low risk collateral as defined in MIP103: The Stability and Liquidity Scope 3.2.3. During the Pregame this section can be applied to lending protocols that are under the control of Maker Governance, are regulated by the Ecosystem Scope, and are being incubated for adoption by a future SubDAO as a part of an Incubated Ecosystem Actor.   6.3.1: If the SubDAO Decentralized Lending Module supports WBTC as collateral, it must ensure that borrowers using WBTC as collateral pay at least the full Yield Collateral Benchmark Yield, and that Maker is paid a yield equivalent to the Yield Collateral Benchmark Yield. The WBTC borrows do not count towards the 200 million subsidy limit.  6.3.2: If the Decentralized Lending Module supports any centralized asset other than WBTC, it is not eligible for the SubDAO Decentralized Lending Module subsidy.   7: Decentralized Fixed Rates Module management  7.1: Decentralized Fixed Rates Module management The Decentralized Fixed Rates Module must be developed and managed through this article.  MIP104c3: Decentralized Collateral Facilitators The Decentralized Collateral Facilitators of the Decentralized Collateral Scope Framework are defined in MIP113c2.6.1.2.1A.  MIP104c4: Scope Framework Articles modification Sub Proposal process During the pregame the Scope Framework articles can be modified through the Monthly Governance Cycle using a MIP102c2 subproposal. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-125/19812",
                        "https://forum.makerdao.com/t/mip116-d3m-to-spark-lend/19732",
                        "https://forum.makerdao.com/t/weekly-mips-update-130/20226",
                        "https://forum.makerdao.com/t/weekly-mips-update-124/19706",
                        "https://forum.makerdao.com/t/weekly-mips-update-129/20172",
                        "https://forum.makerdao.com/t/4-boletin-de-noticias-febrero-de-2023/20078",
                        "https://forum.makerdao.com/t/weekly-mips-update-128/20070",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-february-2023/20011",
                        "https://forum.makerdao.com/t/weekly-mips-update-127/20001"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.129362117981521
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "06/02/2023-23:18:24",
                    "content": "This post has been reserved for GovAlpha’s proposal summary on proposal MIP104: The Decentralized Collateral Scope Framework ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/02/2023-16:23:03",
                    "content": "    rune:  4.2: Loss-making Strategic Collateral In case a Strategic Collateral Asset Type is causing losses to the protocol after maintenance, oracle and other expenses are accounted for, the Responsible Facilitator must periodically make a proposal for MKR holders to remove the Strategic Collateral Asset Type from the list in 4.1.1.1   Leaving the period undefined makes the statement pointless, as the facilitator can proclaim that the period is 100 years, and we’ll get around to it in 99 years and 11 months time. Either:  Explicitly define the period as part of 4.2 Explicitly state that the responsible facilitator is recommended to propose removal at a cadence they deem appropriate.  Maybe it’s also worth stating that removal from the strategic collateral asset type in this case also leads to offboarding per 3.2?     rune:  Decentralized Collateral Direct Deposit Modules (DCDDM)   More acronyms and jargon is not ideal. Also the commonly used acronym was D3M (Dai direct deposit module / direct deposit dai module) rather than DDM. Admittedly DCD3M is also horrible. If you insist on a single acronym DCM (decentralized collateral module) is less accurate, but probably just better for general use. That said, why add DCDDM as a general term for D3M + DLM (SubDAO Decentralized Lending Module) at all? They are different things with different rules. Why do we need a common term? Actually, is this even intended as a general term? Or is it just an arbitrary change from D3M for reasons unexplained? Edit: After reading further, I don’t think I actually understand what’s what with D3M’s / DLM’s / DCDDM’s. So eh, just gonna ignore that part and hope it makes sense to someone.     rune:  DCDDMs must provide a return at least equivalent to the low risk collateral benchmark rate defined in The Stability and Liquidity Scope Framework 3.3.2, and must earn the protocol a net surplus of at least 1 million Dai per year after maintenance, oracle and other expenses.   I’m going to go on record early and state that I think referencing other scopes directly in a scope framework is a bad idea. Reasoning:  It creates dependencies between the scope documents, this increases maintenance cost. For example, if the ALM scope changes in such a way that implies a new article is inserted in position 2, the choices are: a) Break the dependency link to what is currently article 3. b) Modify multiple other scopes to update the article reference. c) Change the structure in a less-optimal way. It creates the requirement for detailed knowledge and monitoring of other scopes for a scope’s advisory council / responsible facilitators. In an ideal world, you should try to reduce the amount of knowledge required to the scope in question. It opens the potential to create cyclic graphs of dependencies between more than two scope frameworks, this massively increases potential complexity. It requires that scopes that have dependencies actively monitor the entire contents of other scopes for changes that may affect them.  We had/have this system of dependencies in the existing MIPs framework, and frankly it doesn’t work very well. It’s very easy to accidently break dependencies without anyone noticing until later. The solution to this is to allow MIPs to exist outside of scopes with the same (or different) requirements for modification. In this way scopes can be dependent on the contents of external MIPs which may be managed by a different scope, but are not dependent on the contents of the scopes themselves directly. In this example, the ‘low risk collateral benchmark rate’ would not be defined in the ALM scope, it would be defined in a separate MIP that the ALM scope had write-access to, and other scopes have read-access to. The other scopes that are using that read-access can then be explicitly listed, such that impacts are more likely to be considered when the value is changed. An alternative is to have a single MIP that acts as a KeyValue store for these sorts of parameter-like pieces of data. Each value could be a structure that includes both the data-value, and a list of consumers with read-access, and a list of scopes with write-access. This data could also be inserted on-chain / on IPFS as part of a KeyValue map, and referenced directly by key in relevant scopes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.137805621608439
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#4",
                    "likes": "3",
                    "time": "24/02/2023-15:34:23",
                    "content": "Proposed improvements to the Decentralized Collateral Scope - the diff available here - Untitled Diff - Diff Checker  MIP104: The Decentralized Collateral Scope Framework  Preamble MIP#: 104 Title: The Decentralized Collateral Scope Framework Author(s): @rune Contributors: Tags: Type: General Status: RFC Date Proposed: 2023-02-06 Date Ratified:  Dependencies: Replaces: Forum URL: MIP104: The Decentralized Collateral Scope Framework Ratification Poll URL:  Sentence Summary TBD  Paragraph Summary TBD  Component Summary TBD  Motivation TBD  Specification  MIP104c1: Preamble The Decentralized Collateral Scope defines the principles and processes for all activity related to Decentralized Collateral Management. This includes both decentralized collateral offered directly in Maker Core Vaults, as well as lines of credit to other entities that are collateralized only by decentralized assets. The Decentralized Collateral Scope Framework is constrained by the elements of the MIP101: The Maker Constitution article 10.2: Constitutional Boundaries of the Decentralized Collateral Scope Framework and tied to Benchmark Yields defined in MIP103: The Stability and Liquidity Scope Framework.  MIP104c2: Scope Framework Articles  0: Definitions #TODO  1: The Decentralized Collateral Advisory Council  1.1: The Decentralized Collateral Advisory Council definition The Decentralized Collateral Advisory Council is a group of Ecosystem Actors that have been approved by Maker Governance to carry out advisory work related to improving the content of the Decentralized Collateral Scope Framework.  1.2: Decentralized Collateral Advisory Council membership management Members of the Advisory Council are directly approved by Maker Governance through a governance poll, and must fulfill specific criteria.   1.2.1: The Responsible Facilitators must ensure that potential Advisory Council Members can apply to be approved by Maker Governance, using an open process with clear instructions.   1.2.2: Advisory Council Members must be ecosystem actors that are not involved in any business activity that could result in a conflict of interest, either directly or indirectly. They must also have relevant skills for providing professional expert input on the content that the Decentralized Collateral Scope is covering.   1.2.3: The Responsible Facilitators must periodically, when it is relevant, review the Advisory Council Applications, and if they find applications that are suitable, bring them to a vote through an MKR governance poll. Approved Advisory Council Members are added to 10.2.3.1.   1.2.4: The Responsible Facilitators may, if they deem it necessary, hold a vote to remove an Advisory Council Member. If an Advisory Council Member has not done any paid work for the Scope for at least 1 year, then the Responsible Facilitators can choose to remove them at will, if they deem it necessary.   1.2.5: During the Pregame, RISK-001 will assume the role as a member of the Decentralized Collateral Advisory Council. Once MakerDAO enters Endgame, article 1.2.5 will cease to exist.   1.2.6: The current approved Advisory Council Members are recorded in the soft element 1.2.6.1.  1.2.6.1: ¤¤¤ Current list of Advisory Council Members: RISK-001 (as per 1.2.5) ¤¤¤     1.3: Decentralized Collateral Advisory Council projects and funding The Advisory Council is paid on a project basis to do specific work that improves all or specific parts of the Scope Framework.  1.3.1: Each Quarter, if they deem it necessary, the Responsible Facilitators must solicit proposals and find one or more suitable Advisory Council Members to perform a project that will result in output that can be used to improve the Scope Framework. This work output will be presented to the CVC Subcommittee Meetings as the starting point for the CVC Scope Framework Position Documents. As many CVCs as possible should be supported this way, prioritized by the Responsible Facilitators. 1.3.2: In case an ambiguous, uncertain or challenging situation arises related to the Scope Framework, the Responsible Facilitator may approach one or more Advisory Council Members to perform a reactive project that aims to specify the language of the Scope Framework to take into account the specific situation. The Responsible Facilitator can then directly propose the change to the Scope Framework in a weekly governance poll, quickly resolving the challenge. 1.3.3: The Advisory Council may not produce work output that is directly compatible with the formatting of the Scope Framework. In this case the Responsible Facilitator must either transcribe it themselves, or hire an Ecosystem Actor to perform the transcription. This role does not require pre approval by Maker Governance. 1.3.4: The Responsible Facilitators may also produce advisory input on the content of the Scope Framework themselves, as long as it is focused on improving process and governance content. They are prohibited from providing unilateral input on expert subject matter content. 1.3.5: The Responsible Facilitators have a budget available to pay for Advisory Council Projects per quarter. All spending must be limited to only what is deemed necessary and with a high probability of producing clearly measurable value, and this must transparently be accounted for in a forum post at least a week before any transaction occurs.  1.3.5.1: ¤¤¤ The Advisory Council project budget is up to 0 Dai per quarter. It is accessible as a keg that refills at a linear rate of 0 per 3 months, and has a maximum limit of 0. ¤¤¤     2: The Implementation of the Decentralized Collateral Scope Framework through Software The Responsible Facilitators must in collaboration with the CVC Subcommittees, periodically review possibilities of integrating DAO toolkit innovation into the processes and content of the Scope Framework.  3: Ordinary Core Vault Type management  3.1: Benchmark Yield requirements for Core Vaults All Core Vaults must have a stability fee at least equivalent to the Yield Collateral Yield Benchmark defined in The Stability and Liquidity Scope Framework 3.3.5.1.  3.1.1: The Responsible Facilitator must use the weekly governance cycle to submit executive votes that increase the Stability Fee of Core Vaults that are below the minimum Stability Fee.   3.2: Minimum net surplus requirements for Ordinary Collateral Types and Ordinary Vault Types Collateral Types which are not Strategic Collateral Asset Types as defined in Article 4, or Transitory Collateral Asset Types as defined in Article 5, must generate at least 10% of net surplus after direct related expenses (maintenance, oracle and other) combined across all Vault Types including same Collateral Type, relative to the average of 4 largest Strategic Collateral Vault Types measured by debt exposure. The absolute minimum net surplus generation permitted for a specific Ordinary Core Vault Type is 100,000 Dai per year.  3.2.0 Example: WBTC is a Centralized Transitory Collateral Asset Type which is included in WBTC-A, WBTC-B, WBTC-C Vault Types, and must generate 10% of surplus in aggregate relative to the average surplus generation of ETH-A, ETH-B, ETH-C and WSTETH-A. (In current state on Feb 23th the requirement is 235k Dai)  3.2.1: Offboarding conditions and offboarding process for Ordinary Collateral Types If an Ordinary Collateral Type is not generating the necessary minimum net surplus for longer than 180 days, or if a specific Ordinary Core Vault Type fails to meet the requirement of the absolute minimum net surplus generation for longer than 180 days, it must enter the offboarding process. The offboarding process consists of two phases. In the first phase, the Responsible Facilitator must initiate an on-chain governance process to increase Stability Fees of the respective Vault Types to the level at which the conditions in 3.2 are met, except where the Stability Fee exceeds the 5x of highest Stability Fee among Vault Types including Strategic Collateral Assets. An Ordinary Collateral Type or specific Ordinary Vault Type can be in the first offboarding phase for a maximum of 60 days. The Responsible Facilitator has the ability to reduce the specified duration of the first phase or entirely skip it. The Responsible Facilitator must argue this decision to the CVC and/or CVC Subcommittee. Once the 60 day maximum period passes (or once the modified time period by the Responsible Facilitator passes) the Ordinary Collateral Type enters the second phase, which follows the process defined in the MIP62: Collateral Offboarding Process.  4: Strategic Collateral Asset Types  4.1: Strategic Collateral Asset Types Strategic Collateral Asset Types are not subject to the requirements of 3.2.  4.1.1: Strategic Collateral Asset Types are specified in the soft element 4.1.1.1 and can be changed based on a Governance Poll by MKR holders initiated by the Responsible Facilitator.  4.1.1.1: ¤¤¤ The list of Strategic Collateral Asset Types is: ETH STETH RETH ¤¤¤     4.2: Loss-making Strategic Collateral In case a Strategic Collateral Asset Type is causing losses to the protocol after maintenance, oracle and other expenses are accounted for, the Responsible Facilitator must periodically make a proposal for MKR holders to remove the Strategic Collateral Asset Type from the list in 4.1.1.1.  5: Transitory Collateral Asset Types  5.1: Transitory Collateral Asset Types Collateral Asset Types in Transition (i.e. Transitory Collateral Asset Types) are either (i) assets that have a high potential to be transitioned to SubDAOs once SubDAOs are established and functioning (i.e. SubDAO Transitory Collateral Asset Types) or (ii) Collateral Asset Types that are deemed too centralized to be included in the Decentralized Collateral Scope Framework, and hence will instead likely be further defined in future iterations of MIP105: The Real-World Asset Collateral Scope Framework (i.e. Centralized Transitory Collateral Asset Types). Once an asset is either (i) defined as part of MIP105: The Real-World Asset Collateral Scope Framework, or (ii) transitioned into a SubDAO, its definition and presence in Article 5 in the Decentralized Collateral Scope Framework immediately becomes null and void and the Responsible Facilitator must remove it from 5.2.1.1 and 5.3.1.1. 5.2: SubDAO Transitory Collateral Asset Types SubDAO Transitory Collateral Asset Types are not subject to the requirements of 3.2.  5.2.1: SubDAO Transitory Collateral Asset Types are specified in the soft element 5.2.1.1 and can be changed based on a Governance Poll by MKR holders initiated by the Responsible Facilitator.  5.2.1.1:    ¤¤¤ The list of SubDAO Transitory Collateral Asset Types is: GNO ¤¤¤ 5.3: Centralized Transitory Collateral Asset Types Centralized Transitory Collateral Asset Types are not subject to the Benchmark Yield requirements of 3.2. However, the net surplus requirement still applies.  5.3.1: Centralized Transitory Collateral Asset Types are specified in the soft element 5.3.1.1 and can be changed based on a Governance Poll by MKR holders initiated by the Responsible Facilitator.  5.3.1.1:    ¤¤¤ The list of Centralized Transitory Collateral Asset Types is: WBTC ¤¤¤  6: Decentralized Collateral Direct Deposit Module management  6.1: Decentralized Collateral Direct Deposit Modules (DCDDM) DCDDMs must provide a return at least equivalent to the Stability Collateral Benchmark Yield defined in The Stability and Liquidity Scope Framework 3.2.3, and are subject to the net surplus requirements as Ordinary Core Vaults defined in Article 3.  6.2: SubDAO Decentralized Lending Module subsidy SubDAO Decentralized Lending Modules can be subsidized with DCDDMs in order to ensure an active market with a minimum level of users exists. Such DCDDMs can have up to 200 million Debt Ceiling at the Subsidized rate. The subsidized rate is equivalent to the Stability Collateral Benchmark Yield as defined in The Stability and Liquidity Scope 3.2.3. During the Pregame this section can be applied to lending protocols that are under the control of Maker Governance, regulated by the Ecosystem Scope, and is being incubated for adoption by a future SubDAO as a part of an Incubation Cluster.  7: Decentralized Fixed Rates Module management  7.1: Decentralized Fixed Rates Module management The Decentralized Fixed Rates Module must be developed and managed through this article.  MIP104c3: Responsible Facilitators The Responsible Facilitators of the Decentralized Collateral Scope are responsible for adhering to the contents of the Scope Framework elements. The Responsible Facilitators also have the governance privilege to interpret, trigger or use any of the processes described in the Scope Framework elements. During the Pregame, the Responsible Facilitators are defined as the Core Unit facilitators of the Core Units that are listed as Responsible Facilitator Core Units. The Responsible Facilitator Core Units for the Decentralized Collateral Scope are defined in MIP104c4.  MIP104c4: Active Responsible Facilitator Core Unit list The current active Responsible Facilitator Core Units of the Decentralized Collateral Scope are:  RISK-001   MIP104c5: Active Responsible Facilitator Core Unit list modification sub proposal process This component is a sub proposal process component that, if approved by Maker Governance, modifies the state of MIP104c4.  MIP104c6: Scope Framework Articles modification Sub Proposal process During the Pregame the Scope Framework articles can be modified through the Monthly Governance Cycle.   Attached commentary and argumentation of the proposed Scope rewrite Below is the overview of how the MIP104 will affect existing Decentralized Collateral Vault Types and DCDDMs, assuming the rewrite takes effect in April and most recent MOMC parameter recommendations are accepted by the governance. The figures also include the recently announced increase to GUSD PSM Yield to 2%, which will take effect in April. The main goal of the language, definitions of Vault & Asset Types and proposed Requirements including the Net Surplus generation and the Benchmark Yields defined in MIP103: Stability and Liquidity Scope Framework are specific to the April iteration of the MIP104, so that we do not make any drastic change which would immediately result in substantial reduction in overall surplus generation from Decentralized Collateral. Basically the goal of April iteration is to mitigate instant damage to current users and MakerDAO such as currently unnecessary offboardings and loss of surplus generation which is not related to risk, which would result from the current language in the skeleton draft. As we proceed through Pregame where language and specific parameters and definitions in all Scopes and the Constitution are more developed and MakerDAO will achieve higher surplus generation from other sources, we will recommend further alterations to the MIP104, accompanied by and based upon research and analyses which can be clearly explained to the Community and Governance. For clarity, below is a list of Requirements which are used in the Scope and list of Asset Types based on the new definitions. Each Asset Type group is subject to some or all of the Requirements. The stablecoin LP Asset Types (GUNIV3DAIUSDC1-A, GUNIV3DAIUSDC2-A & UNIV2DAIUSDC-A) are defined in the MIP105: The Real-World Asset Collateral Scope Framework and thus not subject of MIP104. Net Surplus Requirements & Benchmark Yields  Yield Collateral Yield Benchmark (US 3 Month T-Bill Yield); 4.807% (Feb 24) Stability Collateral Benchmark Yield (GUSD Yield); 2% (in Q2, April) Net Surplus Requirement is defined as 10% of the average surplus generation of the 4 largest Strategic Collateral Vault Types by debt (235k Dai in Current state). This applies to sum of Vault Types which use same Collateral Asset Type Minimum Surplus Requirement is defined as 100k Dai. This applies to a specific Vault Type  Asset Types per methodology defined by the Scope and their corresponding requirements based on numerical order above  Strategic Asset Type (ETH, rETH, stETH); not subject to any requirements Core Asset Type (MATIC-A, CRVV1ETHSTETH-A, LINK-A, UNIV2USDCETH-A, YFI-A); subject to requirement 1, 3 and 4. Centralized Transitory Asset Type (WBTC-A,B,C); subject to requirement 3 and 4. SubDAO Transitory Asset Type (GNO-A); not subject to any requirements Decentralized Collateral Direct Deposit Module (DCDDM) a.k.a. D3M in existing methodology (DIRECT-COMPV2-DAI, DIRECT-AAVEV2-DAI); subject to requirement 2, 3 and 4. Spark Lend is subject to requirement 2.  Below is a numerical representation of the effects described above. Note, that projected exposure is equal to the current state which will likely decrease once stability fee increases take effect and in some cases we expect increase, such as rETH-A due to decrease in stability fee and higher available debt ceiling. In the table, blue color indicates changes due to MOMC proposals and red color indicates changes as a result of Scope Frameworks.  994×400 19.1 KB  Immediate application of the parameter changes is thus initiation of the offboarding process for Aavev2 DDM and LINK-A. Due to expected debt unwinding, several other Vault Types will likely also fail to meet the requirements and thus enter the offboarding process. We expect that CRVV1ETHSTETH-A, UNIV2USDCETH-A and YFI-A will lose debt exposure and thus fail to reach requirements, resulting in the offboarding initiation process. Total expected decrease to surplus generation is 648k Dai per year. As we want to be as clear and transparent as possible, we are proposing to change some of the Benchmark Yields chosen for specific Asset Types, mainly DCDDM will use the 2% instead of 3 month T-Bill yield, assuming it is incorporated in the language of the MIP. Main reason is that we would immediately lose 1.7M Dai surplus generation, which is a substantial amount in the current state, especially as the DSR rate will increase due to language in Stability and Liquidity Scope and its usage is ramping up by existing Dai holders. We are also proposing for WBTC to be exempt from the Benchmark Yield requirement, as it is also currently generating a substantial surplus - 1.35M Dai, until it is defined in the RWA scope. We also noticed that WBTC will be a collateral asset in Spark Lend, so it doesn’t make sense to remove it from the Core, or substantially increase rates, if it will be cheaply available in the Spark Lend with high leverage. We also named RISK-001 as a member of the Decentralized Advisory Council during the Pregame in 1.2.5. Once we enter Endgame, our team will likely transition into Ecosystem Actor, but since we do not want to self-serve, the 1.2.5 will cease to exist once Endgame is reached. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip104-the-decentralized-collateral-scope-framework/19685",
                        "https://mips.makerdao.com/mips/details/MIP62",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-22-february-2023/19936",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-update/19428/14",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-february-2023/20011"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2049832967641185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#5",
                    "likes": "0",
                    "time": "28/02/2023-11:56:07",
                    "content": "A small update to above effect on current surplus generation; mainly CRVV1ETHSTETH-A had seen a substantial increase to debt minted, as it had increased for 152% in recent days, the main contributor is Antalpha. Since this vault now produces about 743k (~1.6% of total annualized) dai surplus per year, perhaps it would be reasonable to also exempt it from the 3-month T-Bill Benchmark Yield requirement; as it is very likely that the SF increase to ~4.8% would significantly impact demand based on the current LP yield (~4.97%). The easiest way to fix the issue would be to add it on the list of Strategic Collateral Assets for the April iteration of the Scope. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-february-2023/20011"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.299242424242424
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#6",
                    "likes": "0",
                    "time": "01/03/2023-20:11:13",
                    "content": "The Strategic Collateral Asset Types are not exempt from the minimum yield requirement. In general I don’t see any justification to provide lower Stability Fee than what we can earn from money market funds, with the only exception being the incubation of SubDAO related products since that directly turns into a large growth upside through the token farming if the SubDAO can gather a community with critical mass. Overall the way I would characterize the collateral strategy specified in the Constitution and Scope Frameworks is that we are always maximizing yield, and only in very few and very well justified situations are willing to accept lower, subsidized yields because there is an obvious advantage to us from doing so. The age of Maker being the free money tree that “helps out” is over, because in the end the best way we can support the entire ecosystem is to just make as much surplus as we possibly can, and then use that surplus to buy MKR/DAI LP tokens and accumulate good old decentralized ETH reserves that we can stake. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.838571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#7",
                    "likes": "2",
                    "time": "01/03/2023-21:39:28",
                    "content": "    rune:  In general I don’t see any justification to provide lower Stability Fee than what we can earn from money market funds   Sharing some personal opinions here. Risk adjusted return of lower yielding decentralized collaterals (eg ETH-C) may well be comparable or even better than MMFs, considering all of the novel legal risks involved in MMFs. I feel it’s also important to maintain minimum viable product capacity across core decentralized vaults considering that the current spike in off chain rates may not persist long term given strong disinflationary forces in the broader economy (eg reshoring/nearshoring tapering off, AI, continuing demographic transitions in advanced economies, etc). If we kill off a large part of our decentralized collateral base with unattainable yield requirements, it may be difficult or impossible to win back market share in these areas in the future when it becomes necessary either due to macroeconomic changes (lower or zero risk free rates) or rising external risks (censorship of off chain assets). I feel we may be overindexing to like-for-like yield comparisons that are not completely valid. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.287131519274376
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#8",
                    "likes": "1",
                    "time": "01/03/2023-21:51:20",
                    "content": "I disagree, but I don’t think the decision should be made at this last moment and just come down to whatever is edited in to the Scope Framework, so I am adding some language so that the Decentralized Collateral Facilitators can trigger a governance poll to suggest a Vault Type becomes exempt, so this discussion can be continued then. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#9",
                    "likes": "1",
                    "time": "08/03/2023-15:56:57",
                    "content": "Formally submitting as part of the Constitution MIP Set. Adding some extra words to get past the spam filter: while the shining sun gently caressed the sleepy fields below ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.916666666666667
                }
            ]
        }
    ]
}