{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip41c4-sp17-facilitator-onboarding-maker-portfolio-core-unit/8997",
            "title": "MIP41c4-SP17: Facilitator Onboarding, Maker Portfolio Core Unit ",
            "index": 8997,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "mpcu-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "1",
                    "time": "28/06/2021-16:01:20",
                    "content": " MIP41c4-SP17: Facilitator Onboarding, Maker Portfolio Core Unit  Preamble MIP41c4-SP#: 17 Author(s): PaperImperium Contributors: N/A Status: RFC Date Applied: 2021-06-28 Date Ratified: Forum URL: https://forum.makerdao.com/t/mip41c4-sp17-facilitator-onboarding-maker-portfolio-core-unit/8997   Sentence Summary Onboards PaperImperium as the facilitator of the Maker Portfolio Core Unit (MPCU).  Paragraph Summary The Maker Portfolio Core Unit (MPCU) will be tasked with onboarding partnered legal entities that can provide the Maker Protocol with exposure to securities of its choice. The MPCU’s role is to find and implement workarounds for Maker’s inability to join legal agreements or pass KYC requirements of counterparties. The MPCU’s priorities will be to safely scale upwards the supply of DAI, lock in long-term and predictable revenues for the protocol, and generate goodwill through a substantial charitable giving component to minimize tax payments.  Core Unit Name Maker Portfolio Core Unit (MPCU)  Motivation I see Maker as unique in terms of both its potential and its capabilities. I want to see the protocol grow into a leading role in guiding and stabilizing the world economy, while also growing profitability for MKR holders. To achieve both of these goals, the Maker Protocol needs to scale much larger. Safely adding to DAI circulation, providing positive-yield real-world collateral, and minimizing risk of both capital losses and disruption to DAI’s USD peg are always top of my mind. My track record with personal, family, and business finances is one of searching for low-risk opportunities that can still yield large returns. Those familiar with my activities within the Maker community also know me as an advocate of strong cost controls, systemic risk management, and continuous marginal improvement. The MPCU is a perfect fit for my skillset, as I help Maker grow a low-risk income source that can be used to rapidly scale supply of DAI, provide higher quality collateral than the protocol currently has access to, and grants some level of stability in earnings to properly cover operational expenses.  Facilitator Name and Information Name: Chris Cameron Forum:@PaperImperium R/C: @PaperImperium ETH Address: TBD  Facilitator Credentials   More than 12 years of securities investing experience in personal and family accounts, with annualized returns (before tax, after other expenses) of ~20%.   Former general partner of a small investing LP for family members’ assets.   A founding member of the Maker RWA Committee.   Bachelor’s Degree in Economics from UNC-Chapel Hill.   Successful small business owner since 2013.    Related Documents MIP39c2-SP16: Adding Maker Portfolio Core Unit - MPCU-001 MIP40c3-SP22: Modify Maker Portfolio Core Unit Budget ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp15-modify-maker-portfolio-core-unit-budget/8998",
                        "https://forum.makerdao.com/t/weekly-mips-update-47/9648",
                        "https://forum.makerdao.com/t/ama-proposing-the-maker-portfolio-core-unit-with-chris-cameron/9062",
                        "https://forum.makerdao.com/t/mip39c2-sp16-adding-maker-portfolio-core-unit-mpcu-001/8996"
                    ],
                    "GPT-summary": "The post is an RFC proposal for the Maker Portfolio Core Unit (MPCU) and its facilitator, PaperImperium. The proposal outlines the role of the MPCU in onboarding legal entities to provide the Maker Protocol with exposure to securities of its choice, and the facilitator's credentials and motivation for the role. The post does not advertise the proposal, but rather explains it and invites feedback. A related document is also provided.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Smart contract updates",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 6.0754676870748305
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/06/2021-17:15:55",
                    "content": "idk… you are here for not even 3 months and already propose a CU consisting only of you? of course one might say I am super-biased, but I would rather take it slow btw: what happened to your delegate post? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "0",
                    "time": "28/06/2021-17:17:45",
                    "content": "    ultraschuppi:  btw: what happened to your delegate post ?   The category is apparently not public yet. Which makes sense so everyone’s profile can be made public together. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "26/09/2021-17:17:48",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}