{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-on-inactive-makerdao-blog/17991",
            "title": "Discussion on inactive MakerDAO blog ",
            "index": 17991,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "discussion",
                "blog"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Emily_Davis",
                    "index": "#1",
                    "likes": "1",
                    "time": "19/09/2022-13:11:09",
                    "content": "I was going through the MakerDAO blog and noticed that there is no content posted there for so long. A blog is a valuable asset for every organisation whether it is centralised or decentralised, so I would like to ask some questions regarding the MakerDAO blog. Who is responsible for writing the articles? Why blog is inactive for so long? What steps can be taken to reactivate the blog? ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/18"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "1",
                    "time": "19/09/2022-13:35:44",
                    "content": "Hi Emily, Our team posted a discussion thread regarding this topic back in July.     MakerDAO Blog Update & Discussion Updates   [image] The Situation The Makerdao.com blog is an unused resource that can be a valuable asset if appropriately managed. Benefits include but are not limited to;   Access to an established external audience. Better control over Maker’s narrative. Access to a platform where we can reinforce Maker’s brand. Paves the way for inclusion in a larger marketing funnel. Increase overall exposure. Improves ties with the extended community of interested people. New channel for  Product Releases Product …         Emily_Davis:  Who is responsible for writing the articles?   Currently noone.     Emily_Davis:  Why blog is inactive for so long?   After the Maker Foundation dissolved, the failure to onboard a marketing/external comms function left the blog dead in the water.     Emily_Davis:  What steps can be taken to reactivate the blog?   Governors should either look to onboard a marketing team or they should grant resources to an existing team for staffing the blog (my estimation is that it needs 1 full-time and 1 part-time contributor at a minimum) ",
                    "links": [
                        "https://blog.makerdao.com/",
                        "https://forum.makerdao.com/t/makerdao-com-performance-overview/15168"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.351803751803752
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Emily_Davis",
                    "index": "#3",
                    "likes": "1",
                    "time": "19/09/2022-16:59:19",
                    "content": "I didn’t knew that this has been discussed before, by the way Thankyou for the information  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#4",
                    "likes": "1",
                    "time": "20/09/2022-15:20:35",
                    "content": "    Davidutro:  Governors should either look to onboard a marketing team or they should grant resources to an existing team for staffing the blog (my estimation is that it needs 1 full-time and 1 part-time contributor at a minimum)   Who are the Governors? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#5",
                    "likes": "1",
                    "time": "20/09/2022-15:21:58",
                    "content": "I believe he is referring to MKR Holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#6",
                    "likes": "1",
                    "time": "20/09/2022-15:26:11",
                    "content": "Delegates & active MKR holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#7",
                    "likes": "1",
                    "time": "20/09/2022-15:27:05",
                    "content": "It’s kind of a rhetorical question. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#8",
                    "likes": "3",
                    "time": "20/09/2022-15:32:38",
                    "content": "    Davidutro:  Delegates & active MKR holders.   Neither of these has the title of “Governor” as far as I know, so I think we need to be careful about labels and not use titles that imply certain obligations, responsibilities and roles that have not specifically been articulated and adopted by the DAO. ACREinvest does not consider our role as an Executive/CEO/manager function which is what might be implied by the title “Governor.” While we participate in governance by voting on behalf of MKR holders, this is not the same as being a “Governor” in our opinion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.080952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#9",
                    "likes": "1",
                    "time": "20/09/2022-15:43:30",
                    "content": "I appreciate the careful treatment of the semantics @ACREinvest I wrote it in the general sense, since delegates and MKR holders, in my view, are the ones governing the protocol. I did not write it in a way that implies any specific obligations as traditionally defined by the “Governor” title elsewhere. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#10",
                    "likes": "2",
                    "time": "20/09/2022-15:53:44",
                    "content": "Okay - we’re aware that semantics are everything in the delicate gray space of legal and regulatory determinations of what this organization is. Particular words in various contexts can accumulate to decide facts and circumstance that point to one conclusion vs another as to who is responsible/liable for what at the end of the day. Thus, stating for the record what our understanding is of our role in the organization. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.680555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#11",
                    "likes": "2",
                    "time": "20/09/2022-16:08:55",
                    "content": "    Davidutro:  After the Maker Foundation dissolved, the failure to onboard a marketing/external comms function left the blog dead in the water.   So, is it the case that the current workforce is not capable of handling that dead blog (which is quite bad in terms of PR as it gives the impression of a dead project) or closing it? It’s a rhetoric question of course. So the real question is: why nobody in the workforce has taken an active action towards doing something with the blog (or at least closing it for the time being until we decide to do something with it)? EDIT: @Davidutro I am quoting your sentence, but not at all targetting you specifically in this message. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.229166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#12",
                    "likes": "4",
                    "time": "20/09/2022-19:34:03",
                    "content": "    iammeeoh:  EDIT: @Davidutro I am quoting your sentence, but not at all targetting you specifically in this message.   No worries, I do my best not to take things personally here. I appreciate the edit.     iammeeoh:  …is it the case that the current workforce is not capable…   In terms of bandwidth, I don’t think the current workforce is capable. In terms of mandate, no Core Unit has this responsibility in their mandate. In terms of skill, I’m sure several people would be capable of running it if directed to do so. It is bad PR and a totally wasted potential, I agree.     iammeeoh:  why nobody in the workforce has taken an active action towards doing something with the blog (or at least closing it for the time being until we decide to do something with it)?   I can’t speak for others, but GovComms did take a few actions:  In March, we proposed a Public Relations Project Manager hire as part of a proposed budget expansion. This was formally rejected in April. We even made a short video explaining that such a hire would enable us to take on the external comms side of our initial mandate. The voters decided they did not want to go in this direction and so our Core Unit pivoted away from the PR support. We prepared a MIP 60 for blog ownership in late May, motivated by our goal to improve the reach of our stakeholder publications. After consulting a handful of stakeholders, we decided not to go in this direction because of the lack of PR expertise within the team and the need for additional staff to handle such a responsibility. In closure, we notified the DAO by creating a discussion thread pointing out the potential of this unused resource and our view on the situation .     MakerDAO Blog Update & Discussion   Our View We believe the right course of action is to wait for a proper marketing team. Running the blog should require professional public relations oversight, which the DAO currently has no capacity for. The teams who currently come closest are the Growth CU and the incubating Brand CU. However, the responsibility seems out of scope for both in their current forms.   EDIT:  The ball is rolling around, untouched, in the court. None of our CUs, delegates, or active MKR holders have taken action since then. Perhaps a declaration of intent or some sort of request for proposal would be nice but no one has done it and understandably so. In this climate of uncertainty and budget conservatism we’re in a tough spot. ",
                    "links": [
                        "https://youtu.be/nCHMuAC58g0",
                        "https://docs.google.com/document/d/1OV28I8dSEombaT44YVf9sIFP_lJVLLQ_HeCno-2plYA/edit?usp=sharing",
                        "https://forum.makerdao.com/t/makerdao-blog-update-discussion/16829",
                        "https://forum.makerdao.com/t/makerdao-blog-update-discussion/16829/1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.11859410430839
                }
            ]
        }
    ]
}