{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/introduction-centrifuge-gc/13002",
            "title": "Introduction - Centrifuge GC ",
            "index": 13002,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "centrifuge"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/elidco",
                    "index": "#1",
                    "likes": "11",
                    "time": "02/02/2022-20:36:35",
                    "content": "I want to officially introduce myself to the Maker forum, although I’ve posted and visited before. My name is Eli Cohen. I joined Centrifuge 2.5 weeks ago as General Counsel. I have a combined transactional and regulatory legal expertise and have worked in the US, Europe and Asia. In private practice, I was with Baker & McKenzie in Moscow and Chicago offices working on project finance, securitizations and syndicated lending deals. I then moved in-house to Euroclear Bank in Brussels and worked on a very large number and range of debt offerings in the run-up to the financial crisis. In 2007, Euroclear sent me to Hong Kong to act as Asia regulatory lawyer and head of compliance for the just opened Euroclear Bank Hong Kong Branch. I moved from there to Singapore Exchange to head a new regulatory unit focusing on derivatives and commodities futures. I then joined CME Group as their Asia regulatory counsel and was drawn into the crypto world with the launch of the CME BTC futures in 2017. With that launch, I began to follow the regulatory developments in the crypto world closely and discussed these often with various government authorities across APAC. Most recently before joining Centrifuge, I have been with Block.One in Hong Kong handling the legal work for the recently launched Gibraltar-regulated CEX Bullish as well as the planned and still upcoming Bullish SPAC listing. I was keen to join Centrifuge as I have been following the RWA space for some time. I think RWA is the future of the crypto space. RWA brings together the transactional and regulatory legal worlds – which creates unique challenges but also immense opportunities. Please feel free to reach out if you would like to discuss any legal or regulatory points related to RWA or crypto more generally. I am always interested to compare notes and learn more about this field. I hope I can help move us forward together. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.834768492377188
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "03/05/2022-20:36:38",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}