{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/centrifuge-maker-trust-structure-progress-update-dec-2021/12188",
            "title": "Centrifuge: Maker Trust Structure Progress Update Dec 2021 ",
            "index": 12188,
            "category": [
                "Governance"
            ],
            "tags": [
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/roollie",
                    "index": "#1",
                    "likes": "10",
                    "time": "14/12/2021-02:03:48",
                    "content": "Hi everyone, As we head into the holiday season, I want to give an update on the latest legal work that we are doing on the Delaware Statutory Trust (DST) Structure. The work is far from being done, but we are making good progress. As mentioned in my previous post, we are committed to sharing these updates more frequently and transparently along our journey. Firstly, I would like to give credit to 6S and RWA Co for their structure, from which we are drawing inspiration for the Centrifuge Trust structure (and @g_dip for sharing the draw.io file there! I will share a version of it once we get clarity on a few more things below)  Current Progress On this topic, we have been in close contact with the members of the RWF CU, in particular @christiancdpetersen, and with our external counsel, Manatt, and the work on the legal structure for Centrifuge pools to tap into Maker vaults is still ongoing. We currently believe:  A DST will be involved somewhere in the structure, although we are not sure where yet. We commit to finding the right trustee that understands crypto/is crypto aware and agrees to serve in that role. We don’t need a broker dealer. There is no Dai/USD fiat on/off ramping needed between the Maker and the Centrifuge protocol: that is the Maker smart contract talking to the Centrifuge smart contract. Our pools receive Dai, instead of USD.  We are considering a few other key things at the moment:  If the DROP subscription agreement (in its current form or an updated form) can replace the revolving Credit Agreement and/or the Security Agreement, or vice versa. Of course the use of any of these will be subject to MakerDAO approval. A difference between 6S’ trust structure and Centrifuge pools is that Centrifuge pools typically have other external investors besides MakerDAO. We are currently discussing whether it would need another entity (SPV) and how to create appropriate legal structure there. There are a few options we are looking at and expect to arrive at a solution soon. Part of the Centrifuge core team is spinning off as an entity called DeFi Capital Markets (DCM), where the Arranger will sit. We have hired/are hiring for credit expertise and experience to evaluate high quality asset originators. We will be coming to the DAO with more details on DCM soon.   Next Steps In the immediate term, at the request of @christiancdpetersen and @eumenes, we are working with Manatt to beef up the DROP subscription agreements for the existing Centrifuge pools and to evaluate and implement steps to achieve an investment-grade quality transaction structure. We will continue to work closely with the RWF CU, delegates, mandated actors and community members to come up with an appropriate and elegant legal structure that protects the interests of the DAO. Once that is completed, we and Manatt will work on a memo describing the legal structure. An important aspect is that we will be able to share this legal opinion with the community. Once that is completed, we will work on setting up the structure. @mrabino1 and @g_dip have kindly agreed to provide feedback to our proposal as well. In parallel, we will get guidance from the Maker community, before we publish our final proposal on the Maker forum. We will share the structure and the memo, and any documentation in future posts. As usual, please don’t hesitate to reach out if you have any questions. ",
                    "links": [
                        "https://forum.makerdao.com/t/a-walkthrough-of-the-6s-capital-trust-structure/8594",
                        "http://draw.io",
                        "https://forum.makerdao.com/t/centrifuge-update-march-2022-legal-rwa-pipeline/14595",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-december-2021/12692"
                    ],
                    "GPT-summary": "The author of the post provides an update on the legal work being done on the Delaware Statutory Trust (DST) Structure for Centrifuge pools to tap into Maker vaults. The post explains the progress made so far and the next steps to be taken. The author also mentions the involvement of external counsel and the need to find the right trustee that understands crypto. The post also mentions the consideration of a few other key things, such as the replacement of the revolving Credit Agreement and/or the Security Agreement. The author invites feedback and questions from the community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.729090678824722
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/03/2022-08:04:33",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}