{
    "poll_list": [
        {
            "title": "Ratification Poll for OUSD Decentralized Rewards (MIP87) - November 14, 2022",
            "index": "18216",
            "option": "No",
            "supporting_mkr": "51,939",
            "highest_fraction": 0.66
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip87-ousd-decentralized-rewards/18216",
            "title": "MIP87: OUSD Decentralized Rewards ",
            "index": 18216,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "rfc",
                "mips",
                "psm",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/pete",
                    "index": "#1",
                    "likes": "3",
                    "time": "04/10/2022-23:38:19",
                    "content": " MIP87: OUSD Decentralized Rewards  Preamble MIP#: 87 Title: OUSD Decentralized Rewards Author(s): @pete Contributors: @joshfraser Tags: PSM Type: General Status: Rejected Date Proposed: 2022-10-04 Date Ratified: Dependencies: MIP86, MIP81, GUSD PSM, MIP13c3-SP12 Forum URL: https://forum.makerdao.com/t/mip87-ousd-decentralized-rewards/18216 Ratification Poll URL: https://vote.makerdao.com/polling/QmZKwbhJ   References   MIP86: CoinShares Active Treasury Management   MIP81: Coinbase USDC Institutional Rewards   https://mips.makerdao.com/mips/details/MIP13c3SP12#specification   GUSD & MakerDAO Partnership Announcement   https://makerdao.world/en/learn/MakerDAO/core-principles/   https://ousd.com/   https://analytics.ousd.com/   OUSD Apy   https://docs.ousd.com/   GitHub - OriginProtocol/origin-dollar: OUSD is a new kind of stablecoin that passively accrues yield while you are holding it   Snapshot   Audits - OUSD   Presented by MakerDAO & Origin: Applications of DAI in the Decentralized Sharing Economy | by Anna Wang | Origin Protocol   Pay with DAI on Origin — Announcing Our First Stablecoin Integration | by Nick Poulden | Origin Protocol   Doo Wan Nam Discusses Origin’s Partnership with MakerDAO | by Josh Fraser | Origin Protocol   https://blog.originprotocol.com/urgent-ousd-has-hacked-and-there-has-been-a-loss-of-funds-7b8c4a7d534c   Origin Dollar (OUSD) Detailed Compensation Plan | by Micah Alcorn | Origin Protocol   security/README.md at master · OriginProtocol/security · GitHub   What We’ve Changed Since the OUSD Attack | by Daniel Von Fange | Origin Protocol   [OGN / OUSD] MIP6 Collateral Onboarding Application - Origin Protocol & Origin Dollar   MakerDao Growth OUSD Tweetstorm    Sentence Summary MIP87 will enable MakerDAO to deploy 100M of Maker’s idle USDC into the Origin Dollar (OUSD) to earn constant daily yield without going through a centralized service or giving up custody of the funds.  Paragraph Summary MIP87 was written in response to Maker’s request for proposals on how to earn revenue on idle capital. In its current form, Maker holds USDC and earns nothing; its purchasing power will decrease over time due to inflation now running over 8%. OUSD is the first stablecoin that grows directly in your wallet using yield that is generated from battle-tested DeFi protocols. It will assist Maker in reaching its investment goals through 2022 and beyond, while maintaining the highest level of decentralization possible.  Component Summary MIP87c1: Background on Origin Protocol Defines the background of Origin Protocol since its inception in 2017. MIP87c2: The Origin Dollar Defines the background and mechanics of the Origin Dollar. MIP87c3: Investing in OSUD Provides the steps for how Maker can invest in the Origin Dollar. MIP87c4: Deal Terms Defines the length of time for Maker’s OUSD investment. MIP87c5: Legal Structure Defines the legality of doing business with Origin. MIP87c6: Aligning with Maker’s Core Principles Defines how Origin’s decentralization principles align with the MakerDAO ethos. MIP87c7: The Elephant in the Room Defines how Origin is mitigating risks and addresses the previous exploit.  Motivation MIP87 responds to MakerDAO’s request for proposals on how to earn revenue on idle capital. Maker governance states that a large portion of the balance sheet is in a stablecoin that does not earn any yield. Origin Protocol believes that OUSD falls within Maker’s criteria for investment regarding safety, cost structure, and flexibility, all while aligning with Maker’s decentralization principles. MIP87 was created in response to the recent interest in generating yield for the DAO; it is significantly different from the unsuccessful MIP6 application to onboard OUSD as DAI collateral. Through tremendous community engagement and involvement, new integrations and partnerships, and multiple additional security features, OUSD has only become stronger since MIP6. Origin recognizes that Maker revenue has fallen 86% since Q2’22, due to a combination of factors, and believes that an investment in OUSD can help Maker reach its investment goals for the endgame plan. Maker will earn a continuous yield with OUSD and retain full custody of the investment, without exposure to risky or volatile assets or going through a centralized service. 2022 has given us multiple reminders of what can go wrong when placing too much trust in centralized counterparties, no matter how safe they may initially seem from the outside, as funds are never truly secure when keys are handed to a third party.  Specification / Proposal Details  MIP87c1: Background on Origin Protocol Origin Protocol is an established, well-funded, registered business in the Cayman Islands that provides fully decentralized, risk-averse stablecoin yields and custom NFT marketplaces. Origin was founded by Web3 veterans Josh Fraser and Matthew Liu in 2017 and is one of the most venerable projects in the space. Josh and Matthew are joined by the fully doxxed Origin team and community, which includes hundreds of thousands of members and open-source contributors. Origin has raised $38.1M from top investors including Pantera, Spartan Group, Foundation Capital, BlockTower Capital, Steve Chen, Garry Tan, and Alexis Ohanian, and currently maintains a $100M+ treasury. On the NFT front, Origin has worked with top crypto and mainstream talent, including Paris Hilton, Trevor Jones, Alotta Money, KSHMR, Don Diablo, SpaceX, 3LAU, and Jake Paul. Much of this information can also be found in our previous Vault collateral proposal on the Collateral Onboarding Application forum subcategory. Origin has a long and ongoing history of working with the MakerDAO team across multiple initiatives.  MIP87c2: The Origin Dollar OUSD is a yield-generating stablecoin that rebases positively to distribute yield directly to user wallets in the form of additional units of OUSD. OUSD is fully collateralized and is backed 1-to-1 by DAI, USDC, and/or USDT. Yield is generated by supplying the underlying stablecoins to blue-chip DeFi protocols, such as Compound, Aave, and Curve/Convex. Interest, fees, and incentives are converted into additional units of OUSD and are distributed proportionally to each OUSD holder daily, or within 24 hours of converting into OUSD. OUSD holders maintain full custody and control at all times and can convert back to the underlying stablecoins at any time. OUSD holders do not need to monitor or do any work to maintain their OUSD position, as OUSD collateral is automatically reallocated each week across the highest yield-generating protocols. By deploying funds into a diversity of strategies, OUSD is able to scale with minimal APY compression even as TVL grows into hundreds of millions of dollars. The current OUSD stablecoin allocation and APY can be viewed and verified in real-time on-chain at all times on the OUSD analytics page. Origin exclusively deploys on protocols that have been carefully audited and battle-tested with significant capital over an extended period of time. Compound has been audited by Trail of Bits and OpenZeppelin and formally verified by Certora. Aave has been audited by Trail of Bits, OpenZeppelin, ConsenSys Diligence, Certik, MixBytes, and PeckShield, and has also been formally verified by Certora. Curve has been audited by Trail of Bits and Quantstamp. OUSD itself has undergone multiple security audits by Trail of Bits, OpenZeppelin, Solidified, and Certora. A retainer was recently signed with OpenZeppelin to provide continuous auditing and the next audit reports should be released by the end of October. Security reviews are always prioritized over new feature development, and multiple engineers are required to review each code change with a detailed checklist before deployment. Origin is also doing deep dives into the exploits of other protocols, making sure the same vulnerabilities don’t exist on Origin contracts. The OUSD source code is publicly available and accessible via the OUSD Github repository. To further mitigate risk, Origin has been actively reducing the OUSD exposure to USDT, as we are aware of the controversy around Tether’s failure to provide a promised audit showing adequate reserves. USDT now makes up 0.1% of our total holdings, with the vast majority 59% being in DAI, and the remaining holdings in USDC.  MIP87c3: Steps for Investing in OUSD After speaking with Maker’s CES-001 Facilitator and CES-001 members, it has been determined that a new module will have to be built to enable Maker’s OUSD investment on-chain. The Origin engineering team will collaborate with Maker’s Collateral Engineering Services to write the code to build this module, utilizing and referencing Maker code from resources such as this Github repository on the D3M structure if necessary. CES-001 will include a function in the module that will allow Maker to send USDC to this contract, and likewise to call that function on-chain at any time to return the USDC to the PSM - without the need to have any off-chain transactions. The proper code will also be included in the module to make the module capable of receiving the daily rebase rewards from OUSD. OpenZeppelin is currently on retainer to audit all Origin smart contract changes. We would be happy to cover the costs for OpenZeppelin to also review any additional changes that are required to the MakerDAO contracts in order to accept OUSD.  MIP87c4: Deal Terms Maker will invest $100M USDC from PSM in OUSD. As a token of appreciation for taking a bet on OUSD and to align incentives over the long term, Origin will give MakerDAO up to 3% of the current total supply of OUSD’s governance token, OGV. Origin will provide MakerDAO a payment of 1% of the initial OGV supply (40m OGV) over 4 years on this schedule, should Maker continue and not dissolve or reduce below its $100M OUSD allocation at which point all pending OGV payments described in this section would be removed: $100m OUSD OGV allocation schedule 10m OGV after year 1 0.833333m OGV per month for the 36 months following year 1 If during the first 3 months of initial deployment into OUSD, Maker has an average balance greater than $100M OUSD, there will be a linear increase to the amount of OGV provided to Maker up to a maximum of 3% initial OGV supply (120m OGV) at $600M OUSD allocation. If Maker decides to dissolve or reduce its OUSD position below the initial 3-month average established, the future OGV payment schedule will be recalculated based on the reduced allocation rather than the initial 3-month average. By holding OGV, Maker will have the opportunity to participate in OUSD governance and will have a say in OUSD’s future. Additionally, OGV recognizes that Maker could be a key strategic partner and would like to offer an aligned incentive structure that encourages mutual success. If the contract in MIP87c3 holds less than $100M OUSD, it will still receive the daily OUSD rebase rewards, but will not be allocated any OGV tokens.  MIP87c5: Legal Structure Although Origin Protocol operates in a decentralized fashion, Origin has taken every possible step to be fully compliant with the laws and regulations of the countries utilizing Origin products. Available upon request, are legal documents including Origin’s business licenses, AML policy, Terms of Service, and token legal opinions for the USA and Cayman Islands from reputable counsel. There are no lockups, terms, contracts, conditions, or vesting periods with OUSD - withdrawal control is completely in the hands of the Maker team, Maker governance, and MKR holders. MakerDAO can unwind its investment, including in stressed market situations, at the speed of the Ethereum blockchain, without having to involve the Origin team.  MIP87c6: Aligning with Maker’s Core Principles We believe that this proposal aligns well with MakerDAO’s five core principles: Scientific Governance - Origin is not looking to skip the line or cut corners with this OUSD proposal. We are striving to play by the rules and go through the entire MakerDAO governance process as it is intended. Serving The Underserved - Origin did not develop OUSD to be exclusive to institutions and accredited investors - it is permissionless and open to anyone without having to go through gatekeepers. Origin envisions and strives towards financial opportunity for all. Sustainable Finance - The Origin Dollar is built completely on-chain within the EVM ecosystem. Origin is not burning fossil fuels through mining or any other energy-intensive action. OUSD yields generated are not dependent on speculative assets; they are real yields and will always be 100% backed by the largest stablecoins in the world. Gradual Decentralization - Origin aligns with Maker and is actively striving for full decentralization. The OUSD stablecoin allocation strategy is weekly voted on by OGV governance token holders and any OGV holder is able to participate regardless of status or jurisdiction. Driving DAI Adoption - Origin has been a supporter of DAI since before the creation of the Origin Dollar. We fully believe in DAI’s success, hence why DAI is one of the three assets backing OUSD. Origin and MakerDAO have a long and ongoing history of working together:   Pay with DAI on Origin — Announcing Our First Stablecoin Integration (2019)   Doo Wan Nam Discusses Origin’s Partnership with MakerDAO (2019)   MakerDAO & Origin: Applications of DAI in the Decentralized Sharing Economy (2020)   OUSD launches with DAI as backing collateral (2020)   MakerDao Growth Tweetstorm on how OUSD generates organic DAI demand (2022)    MIP87c7: The Elephant in the Room In November 2020, OUSD was exploited for $7M in funds. The DApp at the time included a clear disclaimer warning that the product was in BETA and that the contracts had not been audited. Nonetheless, the Origin treasury opted to cover the losses for these early OUSD holders. A compensation plan was put in place which ended up paying victims above and beyond their losses. This sobering event galvanized Origin’s security processes, and thankfully OUSD has not suffered another security failure since relaunching in January 2021. We published a full post-mortem on the attack and what we changed afterwards on our blog. A variety of safeguards and precautions have since been implemented to prevent future exploits, including constant audits and code reviews. Origin code reviews are incredibly rigorous; we require at least two engineers to review each change with a detailed checklist and we prioritize security reviews over new feature development. We have also formalized an engineering rotation for reviewing attacks on other projects. Origin is currently one of only six projects to receive a AAA rating on the decentralized insurance protocol, InsurAce. We invite the full MakerDAO community to comment on this MIP as we strive to follow Maker’s decentralized principles and enable financial opportunity for all. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip81-coinbase-usdc-institutional-rewards/17703",
                        "https://mips.makerdao.com/mips/details/MIP13c3SP12#specification",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140",
                        "https://makerdao.world/en/learn/MakerDAO/core-principles/",
                        "https://ousd.com/",
                        "https://analytics.ousd.com/",
                        "https://dune.com/queries/1204952",
                        "https://docs.ousd.com/",
                        "https://github.com/OriginProtocol/origin-dollar",
                        "https://vote.ousd.com/#/",
                        "https://docs.ousd.com/security-and-risks/audits",
                        "https://blog.originprotocol.com/presented-by-makerdao-origin-applications-of-dai-in-the-decentralized-sharing-economy-195ca7e20f01",
                        "https://blog.originprotocol.com/pay-with-dai-on-origin-announcing-our-first-stablecoin-integration-43f86d5d7982",
                        "https://blog.originprotocol.com/doo-wan-nam-discusses-origins-partnership-with-makerdao-c89461572cf0",
                        "https://blog.originprotocol.com/urgent-ousd-has-hacked-and-there-has-been-a-loss-of-funds-7b8c4a7d534c",
                        "https://blog.originprotocol.com/origin-dollar-ousd-detailed-compensation-plan-faa73f87442e",
                        "https://github.com/OriginProtocol/security/blob/master/incidents/README.md",
                        "https://blog.originprotocol.com/what-weve-changed-since-the-ousd-attack-5894f2bd77cf",
                        "https://forum.makerdao.com/t/ogn-ousd-mip6-collateral-onboarding-application-origin-protocol-origin-dollar/12205",
                        "https://twitter.com/makergrowth/status/1559525171186339841?s=21&t=6lfhywpJlmnWRr86KpdfOA",
                        "https://vote.makerdao.com/polling/QmcWD91Z#vote-breakdown",
                        "https://www.originprotocol.com/en/team",
                        "https://forum.makerdao.com/t/ogn-ousd-mip6-collateral-onboarding-application-origin-protocol-origin-dollar/12205",
                        "https://forum.makerdao.com/c/collateral-onboarding/co/17",
                        "http://ousd.com/",
                        "https://analytics.ousd.com/",
                        "https://www.trailofbits.com",
                        "https://openzeppelin.com/",
                        "https://www.certora.com/",
                        "https://www.trailofbits.com",
                        "https://openzeppelin.com/",
                        "https://consensys.net/diligence/",
                        "https://certik.io/",
                        "https://mixbytes.io/",
                        "https://peckshield.com/",
                        "https://www.certora.com/",
                        "https://www.trailofbits.com",
                        "https://quantstamp.com/",
                        "https://github.com/OriginProtocol/security/blob/master/audits/Trail%20of%20Bits%20-%20Origin%20Dollar%20-%20Dec%202020.pdf",
                        "https://github.com/OriginProtocol/security/blob/master/audits/OpenZeppelin%20-%20Origin%20Dollar%20-%20October%202021.pdf",
                        "https://github.com/OriginProtocol/security/blob/master/audits/Solidified%20-%20Origin%20Dollar%20-%20Dec%202020.pdf",
                        "https://www.certora.com/wp-content/uploads/2022/02/OriginFeb2021.pdf",
                        "https://github.com/originprotocol/origin-dollar",
                        "https://github.com/makerdao/dss-direct-deposit/tree/v2",
                        "https://vote.ousd.com/#/",
                        "https://blog.originprotocol.com/pay-with-dai-on-origin-announcing-our-first-stablecoin-integration-43f86d5d7982",
                        "https://blog.originprotocol.com/doo-wan-nam-discusses-origins-partnership-with-makerdao-c89461572cf0",
                        "https://blog.originprotocol.com/presented-by-makerdao-origin-applications-of-dai-in-the-decentralized-sharing-economy-195ca7e20f01",
                        "https://blog.originprotocol.com/meet-ousd-the-first-stablecoin-that-earns-a-yield-in-your-wallet-96e7aafaa24e",
                        "https://twitter.com/makergrowth/status/1559525171186339841?s=21&t=6lfhywpJlmnWRr86KpdfOA",
                        "https://blog.originprotocol.com/origin-dollar-ousd-detailed-compensation-plan-faa73f87442e",
                        "https://blog.originprotocol.com/what-weve-changed-since-the-ousd-attack-5894f2bd77cf",
                        "https://app.insurace.io/coverage/buycovers",
                        "https://forum.makerdao.com/t/growth-cu-monthly-update-september-2022/18686",
                        "https://forum.makerdao.com/t/actualizacion-mensual-de-la-cu-de-growth-septiembre-del-2022-traduccion/18691",
                        "https://forum.makerdao.com/t/relay-semanal-20-de-octubre-28-de-octubre-del-2022/18703",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/31",
                        "https://forum.makerdao.com/t/weekly-mips-update-111/18610",
                        "https://forum.makerdao.com/t/weekly-mips-update-112/18708",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/22",
                        "https://forum.makerdao.com/t/growth-cu-end-of-2022-review/19194",
                        "https://forum.makerdao.com/t/know-your-mip-index/6768",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/137",
                        "https://forum.makerdao.com/t/growth-cu-update-north-america-nov-2022/18762",
                        "https://forum.makerdao.com/t/pvl-delegate-platform/16022/42",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/40",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191/33",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/24",
                        "https://forum.makerdao.com/t/calblockchain-delegate-platform/18407/6",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/31",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/112",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/9",
                        "https://forum.makerdao.com/t/mip81-coinbase-usdc-institutional-rewards/17703/247",
                        "https://forum.makerdao.com/t/mip81-coinbase-usdc-institutional-rewards/17703/243",
                        "https://forum.makerdao.com/t/know-your-mip-15-mip87-ousd-decentralized-rewards/18457",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/29",
                        "https://forum.makerdao.com/t/relay-semanal-29-de-septiembre-6-de-octubre-de-2022/18363",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/19"
                    ],
                    "GPT-summary": "The post is a proposal (MIP87) that suggests MakerDAO invest $100M of its idle USDC into the Origin Dollar (OUSD) to earn constant daily yield without going through a centralized service or giving up custody of the funds. The proposal explains the background of Origin Protocol, the mechanics of the Origin Dollar, and the steps for how Maker can invest in the Origin Dollar. The post also includes deal terms, legal structure, and how the proposal aligns with MakerDAO's core principles. The post has received entirely positive feedback from a 3rd party, who extends to the proposal and wants to collaborate on it. The proposal is also being audited and reviewed by 3rd parties.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Privacy, Security and risk management",
                        "Interoperability and Scaleability",
                        "Law and regulations"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party is auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.50167867412393
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#2",
                    "likes": "9",
                    "time": "05/10/2022-10:47:25",
                    "content": "Thank you for posting this proposal. There’s a bit of work required here to improve this proposal. Remember a MIP is the top-level governance process at MakerDAO. You are asking MKR voters to approve the text and instruct Core Units to carry out the instructions/processes contained within the MIP. Because of this, the expected outcome of the author should be as precise and as clear as possible. The following is my (hopefully constructive feedback) on this proposal: First, I would urge you to reflect on why the previous MIP6 application to onboard OUSD was unsuccessful. If there has been any appreciable change since then I would highlight that as part of the Motivation section.     pete:  MIP87c8: Our view on MIP81, MIP86, and GUSD PSM   It isn’t necessary/beneficial to include your views on alternative proposals as part of a MIP component. A shortened version of this section could be incorporated into the Motivation section, or you could post it as a comment in the thread, or I would remove it entirely.     pete:  MIP87 responds to the ratified Statement of Intent to Invest in Short-Term Bonds MIP13c3-SP12    This is a stretch at best. Could you elaborate on how investing in DeFi yield-bearing strategies is equivalent to investing in short-term bonds as specified in MIP13c3-SP12?     pete:  MIP87c5: Checking the boxes of MIP13c3-SP12   See above. I don’t think you can claim your proposal checks those boxes when it doesn’t involve investing in short-term bonds, which is the entire point of MIP13c3-SP12. That doesn’t mean it isn’t a valid proposal or shouldn’t be considered, but definitions are important, and this could be interpreted as an attempt to mislead voters.     pete:  MIP87c4: Fees and earning interest   This section is largely unnecessary, it could be rolled into the previous component.     pete:  MIP87c3: Steps for investing in OUSD   I strongly advise you to rework this section. As the  MIP author you should be proposing a method for Maker to obtain the OUSD, or, you should be indicating which team at Maker will be responsible for assessing the options and recommending a path to Maker Governance. At this is written, it is foreseeable that this might pass and no further action would occur as there is a lack of specificity regarding next actions.     pete:  Maker will store the OUSD in a rebase-capable wallet, such as MetaMask, Ledger, Coinbase Wallet, MEW, etc.   Are you suggesting that Maker should store a potentially 1 billion DAI investment on a Metamask wallet or a ledger? I suggest you change this section to recommend a more secure method of securing funds, or remove it entirely.  cc: @collateral-core-unit @strat-fin-core-unit - your comments on the appropriateness of this deal will be useful here. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP13c3SP12#declaration-detail"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.636574074074074
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pete",
                    "index": "#3",
                    "likes": "0",
                    "time": "05/10/2022-20:29:15",
                    "content": "Hi @Patrick_J, thank you for taking the time to comment on the RFC. We will be updating the proposal based on your feedback, please allow us a bit of time. It would be greatly appreciated if some of those who commented on MIP81 and MIP86 could take a look at this MIP87 and provide your thoughts, such as @ChrisBlec @adcv @dbkcan @TRUEMAKER @SebVentures ! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ekryski",
                    "index": "#4",
                    "likes": "1",
                    "time": "05/10/2022-22:53:31",
                    "content": "    Patrick_J:      pete:  MIP87 responds to the ratified Statement of Intent to Invest in Short-Term Bonds MIP13c3-SP12    This is a stretch at best. Could you elaborate on how investing in DeFi yield-bearing strategies is equivalent to investing in short-term bonds as specified in MIP13c3-SP12?   I completely agree. However, to stay intellectually honest, this could also be said for MIP81 and arguably for MIP86 as well. It’s still unclear how those meet all (if any) of the original MIP13c3-SP12 specifications. Agree with everything else you said @Patrick_J!     pete:  This year has given us multiple reminders of what can go wrong when placing too much trust in centralized counterparties, no matter how safe they may initially seem from the outside. With examples from 3AC, Celsius, and BlockFi, funds are never truly secure when keys are handed to a third party.   While I am a big long term believer in DeFi and in these specific instances also believe that DeFi faired much better due to the transparency, composable DeFi at its current maturity level is both exciting and inherently risky. Given there is no legal recourse, the amount and sophistication of hacks we have recently seen, and how new most of the protocols and mechanics are, the devil is in the details and appropriate audits and throttling of AUM is critical to the responsible development of this technology. Something that has been lacking at large (not pointing at OUSD, just a general comment).     pete:  We suggest Maker start with a modest 1% allocation. This can be increased over time as confidence grows.   I do appreciate this sentiment in that regard and is what I would have advocated for.  I’ve seen enough hidden risk papered over in DeFi and haven’t done enough digging into the OUSD yield generating activities and rebasing mechanics to feel comfortable supporting or critiquing the risk/reward profile of this proposal at this time. I’ll monitor for updates and further clarification as per @Patrick_J’s fair constructive criticism but I’m also left wondering why Maker couldn’t just earn yield from the same sources itself. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.856119574869575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#5",
                    "likes": "3",
                    "time": "06/10/2022-03:18:34",
                    "content": "This is a summary of the contents of this proposal and its impact, from GovAlpha’s perspective:  This proposal seeks to invest USDC from Maker’s PSM into the Origin Protocol. The Origin Protocol’s primary product is the yield-bearing stablecoin OUSD. OUSD is backed primarily by USDC and DAI, along with a small amount of USDT. Users can mint OUSD by supplying USDC, USDT, or DAI. Yield is generated by supplying the stablecoin collateral to blue-chip DeFi protocols, such as Compound, Aave, and Curve/Convex. Interest, fees, and incentives are converted into additional units of OUSD and are distributed proportionally to each OUSD holder daily via a rebasing mechanism. This proposal requires technical work from Collateral Engineering Services and Origin’s engineering team to design a smart contract with the following features:  Maker Governance can deposit USDC from the PSM into the contract. Maker Governance can withdraw USDC from the contract to the PSM unilaterally. The contract is capable of receiving the daily rebase rewards corresponding to holding OUSD.   If Maker holds over any amount of USDC in this contract, it will receive the corresponding OUSD yield. OGV is OUSD’s Governance Token. If there is over 100M USDC in the contract, then Maker will receive approximately 40M OGV tokens over four years. Further rewards are possible if higher amounts of USDC are deposited into the contract. MIP87c4 details different scenarios and the corresponding amounts and schedule of the OGV rewards. This proposal has been assigned High-Impact based on the methodology listed here. This proposal is eligible to the November Governance Cycle.  Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. Updated 2022-10-28 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.142857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#6",
                    "likes": "7",
                    "time": "06/10/2022-14:47:17",
                    "content": "Recently, a number MIPs have been posted to this forum relating to collateral onboarding. Collateral onboarding is considered to be the creation of a new vault using the proposed asset, the use of an existing vault, or the minting/deployment of Dai for strategic value, e.g. earning short term interest for the Maker protocol. There is a team of collateral stakeholders responsible for these activities and it requires a fair amount of coordination and collaboration between the teams to onboard and manage Maker collateral. In early 2022, Maker had a situation where collateral applicants submitted self-contained MIPs to bypass the collateral onboarding process, https://collateral.makerdao.com/. History is short and we’ve repeated the same onboarding issues resulting in confusion and a lack of clarity with collateral proposed in the current MIPs. Most if not all of the current collateral MIPs posted to the forum are incomplete in a variety of aspects and based upon replies and comments from the Maker collateral stakeholders. There is a big difference in posting an idea in the forum about the use of assets/collateral (to get feedback and develop the idea) and sharing a complete proposal to the Maker community. Most of the current collateral MIPs would be more effective if started as a forum post to develop the idea with the community. A complete proposal will outline, specifically, the deal terms, legal structure(s), regulatory issues, technical implementation, and a request for individual Maker Core Units to do the work. It’s important to describe the proposal and provide background information but this is insufficient on its own. Working directly with the collateral stakeholders to develop a collateral concept then present it to the community is highly recommended. There are several teams that are available to work in an advisory capacity when preparing a collateral MIP: Growth, Strategic Finance, Protocol Engineering, Risk, Legal, and Collateral Engineering Services. It is not possible to publish a complete MIP without consulting the appropriate teams. And, it’s polite to ask and gain a commitment for help before saying, X team will provide Y work.  As far as guidance, the below might be a little dated (or might be removed) due to changes in MakerDAO, the content is still valid as a guide to prepare a collateral MIP. Please do not ignore this. I encourage any collateral applicant to reach out to me personally if you have any questions on the process or who to work with inside of MakerDAO.    collateral.makerdao.com    Introduction to MakerDAO Collateral Onboarding The Collateral Onboarding Handbook is designed to be the one-stop-shop for all things related to collateral onboarding at MakerDAO         MIPs Portal    MIPs Portal Maker Improvement Proposals are the preferred mechanism for improving both Maker Governance and the Maker Protocol.         MIPs Portal    MIPs Portal Maker Improvement Proposals are the preferred mechanism for improving both Maker Governance and the Maker Protocol.      In no way do my opinions or guidance override the Maker Governance process. If you have any questions regarding Maker governance, please reach out to @GovAlpha-Core-Unit. ",
                    "links": [
                        "https://collateral.makerdao.com/",
                        "https://collateral.makerdao.com/",
                        "https://mips.makerdao.com/mips/details/MIP6",
                        "https://mips.makerdao.com/mips/details/MIP6",
                        "https://mips.makerdao.com/mips/details/MIP67",
                        "https://mips.makerdao.com/mips/details/MIP67"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.795116707616708
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pete",
                    "index": "#7",
                    "likes": "0",
                    "time": "06/10/2022-16:53:40",
                    "content": "Hi @monkey.irish, we appreciate the information shared, Origin’s MIP6 did involve collateral onboarding, but this MIP87 proposal does not. This proposal is a response to MIP13c3-SP12, MIP81, and MIP86. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#8",
                    "likes": "2",
                    "time": "06/10/2022-17:01:36",
                    "content": "Hi Pete, It’s based upon resources you are requesting from MakerDAO. If none are needed from any of the Core Units, all good. Right now, we assume Maker resources needed and therefore track it on our Collateral Status Index and will discuss it during our Monday meetings. If you are not requesting Maker resources, please confirm if this and I’ll remove it from our internal collateral processes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.642857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pete",
                    "index": "#9",
                    "likes": "0",
                    "time": "06/10/2022-23:25:41",
                    "content": "Got it, thanks. We are building out the specific steps for PSM to move USDC into OUSD and will update MIP87 with these steps once finished. If I am not mistaken I believe the task will fall within the responsibilities of CES. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#10",
                    "likes": "1",
                    "time": "07/10/2022-15:45:34",
                    "content": "For the technical implementation, CES would be involved, maybe Protocol Engineering. Risk is another Core Unit that would be involved and maybe Oracles. If you are working on a solution, it might be best to post your thoughts in the forum so the different groups can give you feedback. That way, when you go to formal submission, the MIP is an accurate representation of the implementation. This also saves time since well-defined scopes move through the process faster. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#11",
                    "likes": "0",
                    "time": "07/10/2022-17:22:04",
                    "content": "    ekryski:  I’ve seen enough hidden risk papered over in DeFi and haven’t done enough digging into the OUSD yield generating activities and rebasing mechanics to feel comfortable supporting or critiquing the risk/reward profile of this proposal at this time.   I personally feel the same way. I also think if we wanted to generate yield in defi, we would do it ourselves & avoid adding an additional layer of risk by doing so. I’m almost certain the vast majority of MKR holders will agree as well ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.387566137566138
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pete",
                    "index": "#12",
                    "likes": "0",
                    "time": "25/10/2022-22:44:23",
                    "content": "Thanks @ekryski and @Patrick_J for your comments and suggestions. We have made several updates to the proposal and would appreciate any additional feedback ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twocommapauper",
                    "index": "#13",
                    "likes": "2",
                    "time": "26/10/2022-04:12:09",
                    "content": "I think MakerDao would benefit from investing in yield strategies in the DeFi space like OUSD in addition to CeFi.   Private parties conducting professional due diligence are not immune to contagion effects while on-chain DeFi lending platforms were able to manage risk very effectively thanks to the transparent nature of the blockchain. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pete",
                    "index": "#14",
                    "likes": "0",
                    "time": "27/10/2022-00:37:17",
                    "content": "Hi @Gala, will GovAlpha be making a comment before the formal submission week begins? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#15",
                    "likes": "0",
                    "time": "27/10/2022-21:19:52",
                    "content": "Thank you for your proposal. I was reviewing it on behalf of GovAlpha and noticed this comment.     pete:  Maker Core Units Collateral Engineering Services and Protocol Engineering will build a D3M for Maker’s OUSD investment. Maker will invest $100M USDC in OUSD after the D3M build process is complete.   I believe you have the wrong mechanism here. The D3M is for Maker to supply DAI to protocols that lend out DAI to their users. This mechanism would not be able to take USDC from the PSM and use that to purchase OUSD. If I misunderstood, could you please clarify this section? If not, you may wish to use the mechanisms being discussed in MIP81, particularly the more recent posts, and MIP86 to decide how you would like to acquire the USDC from the PSM. Also, this section may have an error     pete:  Origin will provide MakerDAO a payment of 1% of initial OGV supply (40m OGV) over 4 years on this schedule, should Maker continue and not dissolve or reduce below its $100m OUSD allocation at which point all pending OGV payments described in this section would be removed: $100m OUSD OGV allocation schedule 10m OGV after year 1 0.83m OGV per quarter for the 36 months following year 1   The total OGV payments work out to 10M + 0.83M*12 = 19.96M. Could you clarify if this is the figure or if it is 40M? Finally, if the contract in MIP87c3 holds less than 100M USDC, is it still eligible for the daily  OUSD rebase rewards for that smaller amount? If so, is the sentence below necessary?     pete:  Maker will invest $100M USDC from PSM in OUSD.   If not, could you clarify in the MIP that the rewards accrue only if the contract holds over 100M USDC? ",
                    "links": [
                        "https://forum.makerdao.com/t/mip81-coinbase-usdc-institutional-rewards/17703",
                        "https://forum.makerdao.com/t/mip81-coinbase-usdc-institutional-rewards/17703/226",
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pete",
                    "index": "#16",
                    "likes": "1",
                    "time": "27/10/2022-23:03:25",
                    "content": "Hi @AstronautThis, thank you for your suggestion. We have added some additional color to this section and are still communicating with CES regarding the best options to keep the investment entirely on-chain. The remaining sections have also been updated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pete",
                    "index": "#17",
                    "likes": "1",
                    "time": "06/11/2022-20:12:21",
                    "content": "Hello, we would like to formally submit this proposal for the November governance cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CalBlockchain",
                    "index": "#18",
                    "likes": "0",
                    "time": "07/11/2022-08:54:26",
                    "content": "The current market cap for OUSD is around 45M according to Coinmarketcap. Is this accurate or what is the TVL? This means that this 100M Maker USDC deal will be double the current treasury for OUSD. What effects do you envision that the large addition in fund will bring for OUSD in the short and long run? Is there a issuance composition sheet and timeline for the OGV tokens for all investors? Will Maker governance participate in the OGV governance like a recursive action to decide investment? I know this sounds like a long list of questions, but we want to make sure that we understand the interest parties and why using OUSD as the vehicle can be more efficient than MKR directed or proposal based investments. Thanks in advance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.7559523809523805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#19",
                    "likes": "5",
                    "time": "07/11/2022-09:25:18",
                    "content": "Hey guys, I have a few questions and observations, hope you can address them. (i) Origin Protocol structure and legal background     pete:  Origin Protocol is an established, well-funded, registered business in the Cayman Islands that provides fully decentralized, risk-averse stablecoin yields and custom NFT marketplaces   Can you please explain the legal background and relationship between the entity incorporated in Cayman Islands and tokens with the following tickers; ORIGIN, OGN, OGV, OUSD. Is this company on Crunchbase you are referring to as a Cayman Island entity? Who conducted the ORIGIN ICO and which entity raised money from VCs, or is this related to the ICO? Who is managing the mentioned $100M treasury, is this on-chain and what is the source of these assets. Why is this point of data relevant to this MIP, are you implying, the entity will cover possible losses from the OUSD product in case they occur (hack, economic exploit)? To my understanding you have pivoted from decentralized Uber to NFTs and yield farming, or are all of these products under one umbrella? Did you rebrand the token from ORIGIN to OGN? What are the functions of these tokens and who has control over OUSD? What are the different controls over the OUSD between the Cayman Island entity and presumably governance tokens OGN, OGV? Is this MIP a proposal between Maker and some other DAO or some incorporated entity. Why are there so many tokens in your ecosystem? (ii) Origin Protocol marketing strategy     pete:  On the NFT front, Origin has worked with top crypto and mainstream talent, including Paris Hilton, Trevor Jones, Alotta Money, KSHMR, Don Diablo, SpaceX, 3LAU, and Jake Paul   How is this relevant to this MIP and OUSD? What was the intent of providing this information? Paying money for promotion is something anyone can do, and other projects usually try to hide such things, you seem to be proud of this for some reason. Jake Paul according to this source is a well known crypto scammer who made a lot of money promoting crypto schemes and NFTs. I am not implying you are one of such projects, but still would appreciate some clarity since you are providing this information, as I wouldn’t want Maker to be associated with such instances. (iii) Governance of OUSD (OGV token) and current holders structure What is the purpose of this token and how can it impact OUSD decision making? For example, who is adding new acceptable stablecoins as underlying capital and who is selecting possible farming strategies, and capital allocation to strategies, can they be added or removed from the list? Can a majority OGV holder in some way rug OUSD investors via OGV governance? How can you just freely give these tokens away? Who controls this, can you mint new ones or you for some reason hold a large amount? What is the difference between circulating and total supply, did you just give 89% of supply to yourself and you can now freely give it away? How do OGV holders decide such decisions, or who and how is this done? What does Maker get from this, because based on liquidity, we can’t really sell them. Maybe I am misunderstanding the whole concept of OGV, but usually one project has one token, you seem to have two for some reason. Circulating (11%) market cap of OGV is currently $2.73M according to Coingecko, but due to extremely low on-chain liquidity (the whole liquidity you can sell into is 36 ETH) and CEX liquidity (only present on Kucoin, Gateio, Huobi global with empty orderbooks; whole aggregate bid market depth is less than 100k USD) this valuation is very fragile and for proper valuation purposes, a large haircut should be applied. To be clear, to my understanding as a token of appreciation you are offering MakerDAO 3% of illiquid token over 4 years with questionable regulatory status and governance rights, of which you control 89%, for the ask of investing 100M USDC into OUSD, increasing your AUM for 2.2x. Basically Maker would own 70% of capital allocated in OUSD, yet we would only receive 3% of the token over 4 years… Compared to liquidity mining schemes which occurred in crypto to date and some of them are still ongoing, this might be the worst liquidity mining reward deal ever done in the history of crypto. If we consider your advertised OUSD 365 APY of 9%, you would charge us $900k per year and additional $250k once we exit due to 0.25% redemption fee, which given that these are PSM reserves might happen more than once. Given that you hold $100M treasury, and that all possible other liquidity mining schemes which ever existed would allocate much more than 3% of token to the 70% of capital allocated to the project over 4 years, you do not seem appreciate Maker much and this seems like a typo, certainly not a “token of appreciation”. (iv) Lack of investment product description and associated fees Since this MIP is clearly an investment offering according to authors, you might want to address the investment product a bit more in detail. You didn’t explain what the product actually does in the background and also failed to mention it is associated with fees. In essence, it farms Compound, Aave and Curve 3Pool (potentially via Convex), for example currently, the product only supplies assets to Compound - see the whole position here. The position is not even optimized, as recursed leveraged (folded) dai-dai and usdc-usdc would yield more than just supplying assets to the contract. To my understanding, the products includes fees (please correct me if I am wrong, information is not displayed in a visible way, one must look into docs);  10% performance fee (applied on what OUSD underlying assets earn) 0.25% redemption fee (applied when assets are withdrawn from the OUSD contract)  Both fees are quite bad for Maker’s case, as there are better alternatives. One of them is Maker supplying assets on our own and not paying this fee at all. The redemption fee is unacceptable because the assets in question are PSM reserves, which must be available all the time, given this is on-chain investment, meaning that it can occur that Maker will redeem the assets on multiple occasions depending on peg stability.     pete:  automatically reallocated each week across the highest yield-generating protocols   Automation is a planned feature, not something which currently exists?     pete:  By deploying funds into a diversity of strategies, OUSD is able to scale with minimal APY compression even as TVL grows into hundreds of millions of dollars.   What do you mean here, all of the involved farming strategies yields diminish with more capital deployed? In lending markets, you reduce utilization and therefore reduce the yield, and in Curve, with more capital deployed to the pools, the rewards are also diluted. (v) Lack of offering alternatives or comparison This is the first MIP of its kind, as it suggests that PSM reserves are invested on-chain. There are many different options available in the space and it would be great for governance to get a feeling of what else is available on the market. Without any research, what comes to mind is Yearn, which is the first project to develop farming vaults and is likely the most robust and battle tested with most excellent developers. Another obvious alternative to OUSD is that Maker develops a similar solution on its own, based on existing contracts such as Yearn. Supplying stablecoins to lending markets is not a complex operation worth paying fee for since we are discussing millions of dollars. Would be great if you can offer a comparison of OUSD with different products, including governance, strategies, yield, risks and fees. This way you can help convince Maker governance, why Origin is superior and why should it be considered at all. (vi) Lack of risk description The MIP doesn’t address the risks involved, in my opinion it even tries to downplay them. For example look at the following statement.     pete:  To further mitigate risk, Origin has been actively reducing the OUSD exposure to USDT, as we are aware of the controversy around Tether’s failure to provide a promised audit showing adequate reserves. USDT now makes up 0.1% of our total holdings, with the vast majority 59% being in DAI, and the remaining holdings in USDC.   What measures did Origin take to reduce USDT exposure, or what exactly do you mean with “actively reducing the OUSD exposure towards USDT”? To my knowledge, Origin didn’t do anything in this matter, the fact that USDT supplied decreased was due to randomness and not Origin actions. There is nothing preventing anyone from supplying an unlimited amount of USDT into OUSD currently. Half of the strategies OUSD uses are exposed to Curve 3Pool, which is exposed to USDT. List of risks involved, probably there is more;   Smart contract risks of all protocols and tokens involved   Counterparty risk of USDT   Market risk of collateral backing borrowed assets which OUSD supplies to lending markets   OGV/Origin governance specific risks   Underlying lending market specific risks, such as 100% market utilization, price oracle manipulation risk, risk of their governance failing such as accepting bad parameter changes, etc   Curve specific risks, such as bank run on one of the stablecoins which could result into 3Pool becoming almost entirely allocated into that asset, bad parameter changes, etc   Risks associated with multisigs related to underlying protocols and their governance   Chainlink risk   (vii) Lack of consideration of conflict with existing MIPs The MIP does not consider possible conflicting outcomes with the existing MIP environment. Currently MIP50: D3M is mainly being used to deploy dai to Aave and soon Compound, where the main goal is to increase supply of dai which makes borrowing dai more attractive on these secondary lending markets compared to other stablecoins. Doing the same thing with USDC on the same markets would further decrease USDC rates and contradict the whole D3M endower in this regard. Obviously D3M’s purpose is not only to lower relative dai rates compared to other stablecoins, but is a big part of it and should be addressed by this MIP. Conclusion We think this proposal is suboptimal for Maker as we could achieve higher returns with more control and minimize risk exposure otherwise. There are other alternatives available which Maker should consider before committing to anything in our opinion. Ultimately, Maker governance has to consider that the current on-chain rate environment is quite low and in terms of risk-reward, is possibly one of the worst times to engage in farming activities. The current 1-2% APY in our opinion does not compensate for various risks involved and we also need to consider that PSM reserves should never produce a loss. They are not reserves available for speculation and should not be treated as such. ",
                    "links": [
                        "https://www.coingecko.com/en/coins/origin-protocol",
                        "https://www.coingecko.com/en/coins/origin-dollar-governance",
                        "https://www.coingecko.com/en/coins/origin-dollar",
                        "https://www.crunchbase.com/organization/originprotocol",
                        "https://www.youtube.com/watch?v=CAyE2NIhbDo&t=41s&ab_channel=Coffeezilla",
                        "https://info.uniswap.org/#/pools/0xa0b30e46f6aeb8f5a849241d703254bb4a719d92",
                        "https://debank.com/profile/0x9c459eeb3fa179a40329b81c1635525e9a0ef094",
                        "https://docs.ousd.com/core-concepts/supported-stablecoins",
                        "https://docs.ousd.com/core-concepts/supported-strategies",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-november-2022/19046",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/29",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/75"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.483710733710733
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#20",
                    "likes": "0",
                    "time": "07/11/2022-19:21:43",
                    "content": "Hey @pete Sorry for my late reply! What do you mean by “comment”? Our summary was posted. Let me know if you need anything else! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.890625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pete",
                    "index": "#21",
                    "likes": "0",
                    "time": "07/11/2022-20:30:57",
                    "content": "    rema:  Can you please explain the legal background and relationship between the entity incorporated in Cayman Islands and tokens with the following tickers; ORIGIN, OGN, OGV, OUSD. Is this company on Crunchbase  you are referring to as a Cayman Island entity? Who conducted the ORIGIN ICO and which entity raised money from VCs, or is this related to the ICO?   Thank you for pointing out the ORIGIN Chainbits link - this is misinformation from Chainbits and we have reached out to Chainbits to have this fixed. We’ve never used that ticker. Origin Protocol Institute is the token issuing entity for OGN, OUSD, and OGV. OGN was previously sold via SAFTs to VCs, angels, and accredited individuals. There was never a public ICO. We did a direct listing on Binance in January 2020. OUSD never did a sale. OGV never did a sale.     rema:  Who is managing the mentioned $100M treasury, is this on-chain and what is the source of these assets. Why is this point of data relevant to this MIP, are you implying, the entity will cover possible losses from the OUSD product in case they occur (hack, economic exploit)?   The $100M treasury is managed by the Origin Foundation and some of the funds are easily tracked onchain while others are not. Although we have done so in the past, we are not making any guarantees about covering any future loses or exploits.     rema:  To my understanding you have pivoted from decentralized Uber to NFTs and yield farming, or are all of these products under one umbrella?   Origin started as a decentralized marketplace protocol. We eventually found product market fit with two products, an NFT launchpad/marketplace and a new business line, OUSD. Because the two products are so different, there are two different governance and value accrual tokens associated with them.     rema:  Did you rebrand the token from ORIGIN to OGN? What are the functions of these tokens and who has control over OUSD?   This is a relic from ICO websites creating pages to track our project before we’d even decided on which ticker we were going to use. OGN is the governance token for Origin Story, and OGV is the governance token for the Origin Dollar. Both tokens are used with Snapshot voting. For the purposes of this proposal, please focus on OUSD and OGV.     rema:  What are the different controls over the OUSD between the Cayman Island entity and presumably governance tokens OGN, OGV?   The Cayman entity has no control over the protocol as OUSD is governed entirely by OGV voters. We only mentioned the Cayman entity for the benefit of any lawyers who insist on having a named corporate entity as a counterparty. However, the only real counterparty is the smart contracts powering the protocol.     rema:  Is this MIP a proposal between Maker and some other DAO or some incorporated entity.   OUSD is entirely permissionless, but this proposal is from the core team at Origin. The OGV incentives will need to be voted in by OGV holders, but it has the support of the core team.     rema:  Why are there so many tokens in your ecosystem?   The two Origin products are under the same umbrella, but operate as separate business units, which is why there are two different governance tokens. It did not make sense to have one governance token for two different products.     rema:  How is this relevant to this MIP and OUSD? What was the intent of providing this information? Paying money for promotion is something anyone can do, and other projects usually try to hide such things, you seem to be proud of this for some reason.   This was added to the MIP as background information on Origin, to showcase that Origin has been in the space for several years and is not a rugpull project. Origin launched the NFT marketplaces for all of these projects, we did not pay these people to promote Origin.     rema:  Jake Paul according to this source is a well known crypto scammer who made a lot of money promoting crypto schemes and NFTs. I am not implying you are one of such projects, but still would appreciate some clarity since you are providing this information, as I wouldn’t want Maker to be associated with such instances.   We helped power Jake’s NFT drop as the technology provider. This was definitely not a scam. Guest artists included RTFKT.     rema:  What is the purpose of this token and how can it impact OUSD decision making? For example, who is adding new acceptable stablecoins as underlying capital and who is selecting possible farming strategies, and capital allocation to strategies, can they be added or removed from the list?   OGV is the governance and value accrual token of the Origin Dollar. It is used to:  vote on how the collateral backing OUSD is deployed through current whitelisted strategies vote on new stablecoins to back OUSD vote on new strategies for deploying the OUSD collateral earn a portion of the yield generated by OUSD, through staking OGV on https://governance.ousd.com/stake       rema:  Can a majority OGV holder in some way rug OUSD investors via OGV governance?   No, there is a timelock in front of all governance actions. In the unlikely event that a malicious actor was able to secure enough OGV to rug the protocol, OUSD holders would have enough time to redeem their funds before the rug could be executed.     rema:  How can you just freely give these tokens away? Who controls this, can you mint new ones or you for some reason hold a large amount? What is the difference between circulating and total supply, did you just give 89% of supply to yourself and you can now freely give it away?   We have budgeted OGV tokens for situations like MIP87. Please see this blog post on the OGV tokenomics: https://blog.originprotocol.com/tokenomics-retroactive-rewards-and-prelaunch-liquidity-mining-campaign-for-ogv-1b20b8ab41c8     rema:  How do OGV holders decide such decisions, or who and how is this done? What does Maker get from this, because based on liquidity, we can’t really sell them. Maybe I am misunderstanding the whole concept of OGV, but usually one project has one token, you seem to have two for some reason.   MakerDAO has both DAI and MKR. OGV is analogous to MKR (although we understand the tokenomics and mechanics are different). In the short term, Maker gets meaningful voting power. In the long term, this is a way for Maker to share in the financial success of the protocol.     rema:  Circulating (11%) market cap of OGV is currently $2.73M according to Coingecko, but due to extremely low on-chain liquidity (the whole liquidity you can sell into is 36 ETH) and CEX liquidity (only present on Kucoin, Gateio, Huobi global with empty orderbooks; whole aggregate bid market depth is less than 100k USD) this valuation is very fragile and for proper valuation purposes, a large haircut should be applied. To be clear, to my understanding as a token of appreciation you are offering MakerDAO 3% of illiquid token over 4 years with questionable regulatory status and governance rights, of which you control 89%, for the ask of investing 100M USDC into OUSD, increasing your AUM for 2.2x. Basically Maker would own 70% of capital allocated in OUSD, yet we would only receive 3% of the token over 4 years… Compared to liquidity mining schemes which occurred in crypto to date and some of them are still ongoing, this might be the worst liquidity mining reward deal ever done in the history of crypto. If we consider your advertised OUSD 365 APY of 9%, you would charge us $900k per year and additional $250k once we exit due to 0.25% redemption fee, which given that these are PSM reserves might happen more than once. Given that you hold $100M treasury, and that all possible other liquidity mining schemes which ever existed would allocate much more than 3% of token to the 70% of capital allocated to the project over 4 years, you do not seem appreciate Maker much and this seems like a typo, certainly not a “token of appreciation”.   OGV is a new token at a $20M valuation which is similar to investing in a seed round, except Maker would be getting a free allocation. Just like MKR has become a DeFi darling, we hope that OGV will follow a similar trajectory in performance, holder count, and governance impact. We believe the yields that the protocol provides should be attractive enough on their own, but we were advised by one of your delegates that it would help to “add a sweetener”. We’re more than happy to entertain counterproposals as well. It’s worth noting that the exit fee can often be avoided by swapping on an AMM instead of redeeming from the protocol. MakerDAO can reclaim a good portion of the $900k fee by staking the OGV.     rema:  You didn’t explain what the product actually does in the background   Please see section c2 of MIP87. Additional information can be found in the OUSD docs page here: Yield Generation - OUSD     rema:  failed to mention it is associated with fees.   This was mentioned section c4 of the first version of MIP87 but it was removed it because of the comments from Core Unit Facilitator (Patrick_J) on October 5.     rema:  In essence, it farms Compound, Aave and Curve 3Pool (potentially via Convex), for example currently, the product only supplies assets to Compound - see the whole position here. The position is not even optimized, as recursed leveraged (folded) dai-dai and usdc-usdc would yield more than just supplying assets to the contract. To my understanding, the products includes fees (please correct me if I am wrong, information is not displayed in a visible way, one must look into docs);  10% performance fee (applied on what OUSD underlying assets earn) 0.25% redemption fee (applied when assets are withdrawn from the OUSD contract)  Both fees are quite bad for Maker’s case, as there are better alternatives. One of them is Maker supplying assets on our own and not paying this fee at all. The redemption fee is unacceptable because the assets in question are PSM reserves, which must be available all the time, given this is on-chain investment, meaning that it can occur that Maker will redeem the assets on multiple occasions depending on peg stability.   As mentioned in MIP87 section c3, the Origin team would be happy to help write the code and contracts for the deposit module with Maker’s Collateral Engineering Services. Exit fees were not an issue when we spoke with Maker’s CES-001 Facilitator and CES-001 members, but it is possible that we can create some unique privileges into the contracts to avoid the exit fees. We believe this can be done securely if we build per address locked, coin specific deposits into OUSD. For example, address X deposits $100 USDC into OUSD, and gets $100 non transferable OUSD in return. They can can 1-1 redeem this $100 OUSD for USDC at any time, without oracles or or exit fees. Yield earned still shows up as additional OUSD, and any amount over the locked amount can be transferred out.     rema:  Automation is a planned feature, not something which currently exists?   The code currently follows the guidance of OGV voters on the desired allocations between different strategies. We plan to use more automation over time. Security is prioritized over new features.     rema:  What do you mean here, all of the involved farming strategies yields diminish with more capital deployed? In lending markets, you reduce utilization and therefore reduce the yield, and in Curve, with more capital deployed to the pools, the rewards are also diluted.   The peak TVL of OUSD was $300m, at this point the OUSD yield was around 5%, which can be seen here: https://dune.com/queries/1204952 There is yield compression in every strategy, so it’s better to allocate funds across a basket of strategies than just Aave.     rema:  This is the first MIP of its kind, as it suggests that PSM reserves are invested on-chain.   Given it is the first of its kind, we would appreciate the opportunity to work with Maker on making the MIP and investment as robust as possible.     rema:  There are many different options available in the space and it would be great for governance to get a feeling of what else is available on the market. Without any research, what comes to mind is Yearn, which is the first project to develop farming vaults and is likely the most robust and battle tested with most excellent developers.   Yearn is definitely a viable option for Maker although you should be aware that they also charge fees. We can’t argue with the quality of their work. The Yearn team are great. OUSD has higher historical yields than the yearn stablecoin vaults and has some nice benefits. For example, OUSD makes it easy for your users to quickly verify how much you are holding by checking your token balance instead of having to calculate your balance based on the total value of the pool and your ownership percentage.     rema:  Another obvious alternative to OUSD is that Maker develops a similar solution on its own, based on existing contracts such as Yearn. Supplying stablecoins to lending markets is not a complex operation worth paying fee for since we are discussing millions of dollars.   Integrating OUSD would be far faster and easier than spinning up something on your own. The superior yield that you earn from OUSD more than covers the fees. Right now those funds aren’t earning anything so it’s worthwhile to focus on a fast and easy integration.     rema:  Would be great if you can offer a comparison of OUSD with different products, including governance, strategies, yield, risks and fees. This way you can help convince Maker governance, why Origin is superior and why should it be considered at all.   We believe OUSD will be the fastest to integrate while returning superior yields. There were several projects that directly forked OUSD on other chains, but it is not necessary to name them in this MIP.     rema:  The MIP doesn’t address the risks involved, in my opinion it even tries to downplay them.   There is an entire section about the hack, and multiple sections about audits and the importance of security, in this MIP.     rema:  What measures did Origin take to reduce USDT exposure, or what exactly do you mean with “actively reducing the OUSD exposure towards USDT”? To my knowledge, Origin didn’t do anything in this matter, the fact that USDT supplied decreased was due to randomness and not Origin actions. There is nothing preventing anyone from supplying an unlimited amount of USDT into OUSD currently. Half of the strategies OUSD uses are exposed to Curve 3Pool, which is exposed to USDT.   This was the relevant governance proposal from the Origin team: https://vote.originprotocol.com/#/proposal/0xb050c5a6dfe1f82401d77d901b47b6b0a85d2337c711495919a19bd423030ac5 Yes, there is still some exposure to USDT both directly and via 3pool. We would like to see OUSD become less dependent on USDT, just as we’d like to see DAI be less dependent on USDC.     rema:  List of risks involved, probably there is more;  Smart contract risks of all protocols and tokens involved Counterparty risk of USDT Market risk of collateral backing borrowed assets which OUSD supplies to lending markets OGV/Origin governance specific risks Underlying lending market specific risks, such as 100% market utilization, price oracle manipulation risk, risk of their governance failing such as accepting bad parameter changes, etc Curve specific risks, such as bank run on one of the stablecoins which could result into 3Pool becoming almost entirely allocated into that asset, bad parameter changes, etc Risks associated with multisigs related to underlying protocols and their governance Chainlink risk    It’s a fair list and most of these points are covered in depth in the risk section of our docs with the steps we have taken to mitigate these risks as much as we can. That page can be viewed here: Risks - OUSD     rema:  The MIP does not consider possible conflicting outcomes with the existing MIP environment. Currently MIP50: D3M is mainly being used to deploy dai to Aave and soon Compound, where the main goal is to increase supply of dai which makes borrowing dai more attractive on these secondary lending markets compared to other stablecoins. Doing the same thing with USDC on the same markets would further decrease USDC rates and contradict the whole D3M endower in this regard. Obviously D3M’s purpose is not only to lower relative dai rates compared to other stablecoins, but is a big part of it and should be addressed by this MIP.   Building a new D3M module for the investment is what was recommended to us from Maker’s CES-001 Facilitator and CES-001 members. We took their recommendations into consideration, and the requirements of MIP13, and Maker’s decentralization principles, when writing this proposal.     rema:  We think this proposal is suboptimal for Maker as we could achieve higher returns with more control and minimize risk exposure otherwise   We attempted to speak with the risk CU weeks ago to get their input, prior to formally submitting MIP87, but were told: “We do not think its worth our time to discuss your MIP.” ~ mar#9661, Maker Discord, 10/21/2022 This was disappointing, as we could have used the input from the risk CU to strengthen and improve MIP87.     rema:  There are other alternatives available which Maker should consider before committing to anything in our opinion.   This is somewhat contradicting to your earlier comment, that MIP87 is the first of its kind.     rema:  Ultimately, Maker governance has to consider that the current on-chain rate environment is quite low and in terms of risk-reward, is possibly one of the worst times to engage in farming activities.   Maker revenues are down 86% this quarter. From our perspective, generating revenue wasn’t a priority for Maker in the past, but now it is. Maker might have missed DeFi summer, but the time to prepare for the next bull market is now.     rema:  The current 1-2% APY in our opinion does not compensate for various risks involved and we also need to consider that PSM reserves should never produce a loss. They are not reserves available for speculation and should not be treated as such.   There should be no loss of reserves. We would be willing to cover the $250k exit fee, one time, if the Maker investment is over $100m. Had the risk CU given us opportunity to speak prior to the formal submission date, this would have been an integral part of MIP87. ",
                    "links": [
                        "https://www.coingecko.com/en/coins/origin-protocol",
                        "https://www.coingecko.com/en/coins/origin-dollar-governance",
                        "https://www.coingecko.com/en/coins/origin-dollar",
                        "https://www.crunchbase.com/organization/originprotocol",
                        "https://story.xyz/",
                        "https://www.youtube.com/watch?v=CAyE2NIhbDo&t=41s&ab_channel=Coffeezilla",
                        "https://www.google.com/url?q=https://governance.ousd.com/stake&sa=D&source=docs&ust=1667864358974123&usg=AOvVaw0_KkFVEAHUpXFypWnguKpX",
                        "https://www.google.com/url?q=https://blog.originprotocol.com/tokenomics-retroactive-rewards-and-prelaunch-liquidity-mining-campaign-for-ogv-1b20b8ab41c8&sa=D&source=docs&ust=1667864358975170&usg=AOvVaw3qM2ZDcnj2ofV7A39Q3h21",
                        "https://info.uniswap.org/#/pools/0xa0b30e46f6aeb8f5a849241d703254bb4a719d92",
                        "https://docs.ousd.com/core-concepts/yield-generation",
                        "https://debank.com/profile/0x9c459eeb3fa179a40329b81c1635525e9a0ef094",
                        "https://www.google.com/url?q=https://dune.com/queries/1204952&sa=D&source=docs&ust=1667929356489833&usg=AOvVaw2JlLuLvMznXg_kZgooSpxO",
                        "https://docs.ousd.com/core-concepts/supported-stablecoins",
                        "https://docs.ousd.com/core-concepts/supported-strategies",
                        "https://www.google.com/url?q=https://vote.originprotocol.com/%23/proposal/0xb050c5a6dfe1f82401d77d901b47b6b0a85d2337c711495919a19bd423030ac5&sa=D&source=docs&ust=1667929356415941&usg=AOvVaw0SXSj6vSvdcmzQ-xcnBTTV",
                        "https://docs.ousd.com/security-and-risks/risks",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/30"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.661088023088023
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pete",
                    "index": "#22",
                    "likes": "0",
                    "time": "07/11/2022-20:32:40",
                    "content": "Response updated below. thanks ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pete",
                    "index": "#23",
                    "likes": "0",
                    "time": "08/11/2022-22:29:03",
                    "content": "    CalBlockchain:  The current market cap for OUSD is around 45M according to Coinmarketcap. Is this accurate or what is the TVL?   This is accurate - due to market conditions, OUSD TVL is lower now than the peak on 12/30/21, where TVL reached $300m. OUSD yield at the peak was around 5%, which can be seen here: https://dune.com/queries/1204952     CalBlockchain:  This means that this 100M Maker USDC deal will be double the current treasury for OUSD.   It is important to clarify that this is not OUSD treasury. It’s all user deposits and Origin the company never touches the funds.     CalBlockchain:  What effects do you envision that the large addition in fund will bring for OUSD in the short and long run?   It is hard to model because every action causes counter-reactions. For example, if you add a lot of stables to Compound, the advertised APY will go down, which attracts new borrowers increasing yields again. While yields tend to get compressed as more funds are deployed, OUSD is able to able to minimize yield compression by spreading the funds across a diverse set of strategies instead of putting everything into a single strategy like Aave.     CalBlockchain:  Is there a issuance composition sheet and timeline for the OGV tokens for all investors?   Please see this page from the Origin blog on OGV: https://blog.originprotocol.com/tokenomics-retroactive-rewards-and-prelaunch-liquidity-mining-campaign-for-ogv-1b20b8ab41c8     CalBlockchain:  Will Maker governance participate in the OGV governance like a recursive action to decide investment?   This would be up to Maker and Maker governance to decide. Origin is providing Maker the OGV to give Maker the tools to participate in regular allocation votes, as well as the option to propose or voting on any other upgrades or changes to the protocol. ",
                    "links": [
                        "https://www.google.com/url?q=https://blog.originprotocol.com/tokenomics-retroactive-rewards-and-prelaunch-liquidity-mining-campaign-for-ogv-1b20b8ab41c8&sa=D&source=docs&ust=1667860116049574&usg=AOvVaw16XnO4czGu6McIGe4dgmqK"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.579047275475847
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#24",
                    "likes": "1",
                    "time": "15/11/2022-20:36:36",
                    "content": "This proposal is currently being voted on. Its Ratification Poll will run from 2022-11-14 to 2022-11-28. Please vote here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pete",
                    "index": "#25",
                    "likes": "0",
                    "time": "17/11/2022-04:16:44",
                    "content": "In light of everything that has happened recently, we would like to reiterate that OUSD has zero exposure to FTX, SBF, Alameda, Gemini, and Genesis. Funds held within Origin and OUSD contracts are held 100% on-chain and are withdrawable at any time for the stablecoins backing OUSD. Despite these unfortunate events, OUSD continues to generate yield at a trailing APY of 8+%. We continually encourage self-custody and advise everyone to vote “Yes” on the current vote happening here: Maker Governance - Ratification Poll for OUSD Decentralized Rewards (MIP87) - November 14, 2022 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pete",
                    "index": "#26",
                    "likes": "0",
                    "time": "23/11/2022-00:15:46",
                    "content": "@ekryski and @Patrick_J do you have any additional feedback to share since we have updated the proposal? On-chain transparency and self-custody should be pretty important right now ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.559523809523809
                }
            ]
        }
    ],
    "group_index": "1803"
}