{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/no-executive-2021-07-09/9264",
            "title": "No Executive - 2021-07-09 ",
            "index": 9264,
            "category": [
                "Updates"
            ],
            "tags": [
                "executive"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "18",
                    "time": "08/07/2021-19:07:31",
                    "content": "Hello all! There will be no executive this Friday (2021-07-09.). The mandated actors discussed bringing items forward, but in general both Protocol Engineering and myself would prefer to complete the outstanding work mentioned below before deploying. In doing so, we are operate according to the rule: “Is there anything that we feel is ready to include in an executive vote this week?” Rather than this one: “We need to push an executive this week, what do we have that can go in?” We’re in a situation where there are lots of ‘irons in the fire’ so to speak, and we’ve made progress across a wide range of projects, but nothing is at the point where it is quite ready for implementation.  Here are some of the projects that are on the go (not exhaustive), and a brief summary of what we’re waiting for. SushiSwap Pairs - Blocked on Sushi deployments Centrifuge Assets - Awaiting Kovan Deployment and testing from Centrifuge. 6s Debt Ceiling Raise - Awaiting green light from 6s. Additional PSMs - Awaiting negotiations from the @Growth-Core-Unit Dss-vest - Awaiting audit results Optimism - Deployed on Optimism L2, awaiting Optimism Launch Matic - Awaiting Oracle Evaluation. Institutional / Conditional Vaults - Awaiting discussions with Nexo + Protocol Engineering work. Vox - Awaiting review from Protocol Engineering. stETH - Awaiting Oracle and Protocol Engineering Evaluations. D3M - Awaiting Protocol Engineering review, risk evaluation, governance actions. Gelato UniV3 DAI-USDC token - Awaiting Oracle and Risk evaluations. We recognize that we’re suffering from ‘target saturation’ in some respect, and making incremental progress on lots of projects, rather than significant progress on any individual effort. This week in the mandated actors coordination meeting, we discussed providing some more organization and transparency around on-going projects. @Derek will be taking point on this effort and produce a summary sheet of current projects, though it will take on-going buy-in from all the Core Units to keep this up to date. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-53/9305"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.778846153846154
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "23/07/2021-09:47:09",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}