{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-brand-update-august-2022/18158",
            "title": "Maker Brand Update - August 2022 ",
            "index": 18158,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "update",
                "gro-001",
                "brand"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#1",
                    "likes": "13",
                    "time": "30/09/2022-13:34:02",
                    "content": "Hi Maker Fam, Here’s the Brand team monthly post to keep you updated with our job last month and all the efforts regarding marketing and brand awareness, here you’ll see the best in terms of PR, Twitter and more. You can check past updates here:  July June May   Highlights of the month  HVB Bank Video In August we released an AMAZING video about the HVB Bank integration, being as we know the first commercial loan participation between an U.S. Regulated Financial Institution and a Decentralized Digital Currency. This integration involves a 100 million DAI participation facility to support HVB growth, a Bank founded back in 1871,this application proposed a legal structure wherein Huntingdon Valley Bank enters into a Master Purchase Agreement with a trust for the benefit of MakerDAO. For further information will leave you the direct link to the Twitter announcement + video: HVB Video.   Pre-Merge comms As the merge was approaching people started to wonder about all the risks that the merge implies. With the help of the MakerDAO Twitter account we began a series of tweets to inform our community and people on Crypto Twitter how probably the merge would affect Maker Vaults and Dai users. Our first thread focused on the potential fork risks that could impact Maker, such as: Futures Backwardation & Negative Funding, stETH Discount and External Asset Fork Choice. Then in a second thread we did a little recap of the Risk Core Unit publication named “Merge Risks and Market Impacts.\" The threads continued all over until September when we delivered our official communication towards The Merge and what should do Maker Vaults and Dai users in this event. We hope all our efforts helped everyone to make a good decision as The Merge was successful and all the Ethereum Community, including us, were really happy with this milestone.   Top 3 tweets with partners  Origin USD + DAI Now going with some BD + marketing actions, we share with our Audience the work being done with Origin Protocol and their stable OUSD, within the tweet we communicate how through its yield-capturing power, Origin is now backing 28 million OUSD with DAI — +58% of all its circulating supply. For further information here is the tweet.  Arbitrum Nova Bridge Following all MakerDAO efforts towards the Multichain Strategy and DAI on top of every major L2s, we were pleased to announce that the official Canonical Dai bridge was deployed on Arbitrum Nova. We look forward to have more and more canonical Dai all over the crypto sphere, and with the Multichain Strategy and the upcoming Maker Teleport we will  For further information here is the tweet.   twitter.com    Maker @MakerDAO  The gates of Arbitrum Nova are now open.  And Dai has been enabled to be transferred through this gate!  The Protocol Engineering Core Unit just deployed the Dai bridge on @Arbitrum Nova 🌌  ➡️ bridge.arbitrum.io/?l2ChainId=421… https://t.co/X8cdk1wUIc   3:59 PM - 16 Aug 2022           110                27             Gains Network And last but not least we were amazed to know that DAI pools were PUMPING on Gains Network, being the GNS/DAI pool 1st place and the single DAI pool the 2nd place. Cheers!   twitter.com    MakerDAO Growth @MakerGrowth  The $DAI and $GNS / $DAI pools are pumping on @GainsNetwork_io 🚀  Current APYs:  🥇 67% for the $GNS / $DAI pool 🥈 14% for the $DAI pool  Available via gainsnetwork.io/pools/ on @0xPolygon! twitter.com/GainsNetwork_i… https://t.co/2m69bNJ4on    Gains Network 🍏 @GainsNetwork_io  Our synthetic architecture uses a single $DAI vault for ALL trading pairs.  This means:  ✅ Maximum capital efficiency ✅ Support for high leverage without more liquidity ✅ Quick creation of new pairs ✅ Across all markets - crypto, stocks, forex  gTrade makes liquidity easy 🍏    8:11 PM - 10 Aug 2022           98                44             Twitter Metrics August was a tough month, the drag downs of the market and events with other crypto companies have punished everyone in the ecosystem. The market was recovering a bit but fell down some points again. Still we stayed strong and focused on communicating our biggest news regarding the Argent Campaign, the HVB announcement and the pre-Merge tweets for our community. Let’s go with some charts:  Monthly impressions: July was our best month till the date, as you can see August suffered a little bit but we still manage it out to maintain our media above the million impressions.  Chart1199×742 17.8 KB   Monthly Engagements As the impressions, the engagements lowered a little bit as well, leaving the engages (clicks, views, shares, etc) with our tweets a little below the 30k media.  Chart1199×742 19.2 KB   Monthly Avg. Engagement rate The good news is that on average, our engagement rate maintains its trending going UP!  Chart1199×742 30.3 KB   New Followers In the month of August we gained the decent amount of over 2.5k new followers, leaving the MakerDAO official account in a nice 229k followers count, super close to the 230k milestone.  Chart1199×742 17.7 KB   Top 3 tweets 1st. HVB Video Announcement - 130k impressions 2nd. Arbitrum Nova Bridge - 49k impressions 3rd. Dai on Optimism update - 42k impressions  MakerDAO Public Announcements To all our community members, remember that here in the MakerDAO Public Announcements Table you can check the status of all major communications for our Twitter and broader media audience. This is a constant work in progress table alongside all MakerDAO contributors!  1227×733 78.5 KB   Media Coverage As always big thanks to our PR Agency, in August the star of the month was the HVB Bank Announcement, having an amazing coverage in places like:  Blockworks - MakerDAO Opens $100M DAI Loan to Huntingdon Valley Bank   Axios - MakerDAO strikes real-world asset deal with Huntingdon Valley Bank   Crowdfund Insider - Huntingdon Valley Bank to Access Up to $100M of DeFi Funding via MakerDAO   American Banker - Pennsylvania bank taps into crypto cash to boost lending   Global Newswire - HV Bancorp, Inc. Participates First Commercial Loan to the MakerDAO Protocol and the DAI Stable Coin   Including three high impact coverages with Forbes, NASDAQ and L’AgeFi.  Coverage Analysis The graph below shows the trending topics MakerDAO has been related with in the past month, being NA and Asia the regions with more impact, followed by Africa, Europe, Ocenia and South America. Thanks to the HVB announcement we had a huge presence in NA this past month, and great to see Africa being super interested in MakerDAO related issues.  740×435 122 KB  For more info you can check the: MakerDAO Coverage & Activity Report August 2022.  MakerDAO website - Update After the successful website request and answering the questions regarding the intangible assets (see here), we are advancing towards the bootstrapping of the MakerDAO website following the already known map (see below). Having weekly sessions to improve the way users might see the MAkerDAO website in the future and sessions with web development agencies helping us with this difficult but incredible task. As a community we deserve a very nice, fresh and good looking website, and we will have it!  1600×775 110 KB  — Thanks to everyone in the community for your feedback and support on twitter and other places, also thanks to the team members who make this possible. Remember that as a DAO we all should keep up spreading good news around Maker and Dai. Let’s keep building together! ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-brand-update-june-july-2022/16858",
                        "https://forum.makerdao.com/t/maker-brand-team-monthly-update-may-2022/15980",
                        "https://twitter.com/MakerDAO/status/1562045115828412417?s=20&t=BOwkr38BBf3M5I5c1MViqw",
                        "https://twitter.com/MakerDAO/status/1555626931034415104",
                        "https://twitter.com/MakerDAO/status/1555626931034415104",
                        "https://twitter.com/MakerDAO/status/1567212004561092609?s=20&t=YA9RBOOK-cJHsXYp2UcMEQ",
                        "https://twitter.com/MakerGrowth/status/1559525171186339841?s=20&t=kLoKEgPvN1KbTxP2FQjwqw",
                        "https://twitter.com/MakerGrowth/status/1559594665149702145?s=20&t=v9ibmxY8qfS-MTFy_bmMog",
                        "https://twitter.com/MakerDAO/status/1559570668353720321",
                        "https://twitter.com/MakerDAO/status/1559570668353720321",
                        "https://twitter.com/MakerDAO/status/1559570668353720321",
                        "https://twitter.com/Arbitrum",
                        "https://bridge.arbitrum.io/?l2ChainId=42170",
                        "https://t.co/X8cdk1wUIc",
                        "https://twitter.com/MakerDAO/status/1559570668353720321",
                        "https://twitter.com/MakerGrowth/status/1557459680775098369?s=20&t=evTukYV37XjFryeqyBuzdA",
                        "https://twitter.com/MakerGrowth/status/1557459680775098369?s=20&t=evTukYV37XjFryeqyBuzdA",
                        "https://twitter.com/MakerGrowth/status/1557459680775098369?s=20&t=evTukYV37XjFryeqyBuzdA",
                        "https://twitter.com/GainsNetwork_io",
                        "https://gainsnetwork.io/pools/",
                        "https://twitter.com/0xPolygon",
                        "https://twitter.com/GainsNetwork_io/status/1557358386555019266",
                        "https://t.co/2m69bNJ4on",
                        "https://twitter.com/GainsNetwork_io/status/1557358386555019266",
                        "https://twitter.com/MakerGrowth/status/1557459680775098369?s=20&t=evTukYV37XjFryeqyBuzdA",
                        "https://twitter.com/MakerDAO/status/1562045115828412417",
                        "https://twitter.com/MakerDAO/status/1559570668353720321",
                        "https://twitter.com/MakerDAO/status/1557077982807744514",
                        "https://www.notion.so/makergrowth/MakerDAO-Announcement-Table-d0b985e511f34b0392741e4f3d1cd406",
                        "https://blockworks.co/makerdao-opens-100m-dai-loan-to-huntingdon-valley-bank/",
                        "https://www.axios.com/pro/fintech-deals/2022/08/25/makerdao-huntingdon-valley-bank",
                        "https://www.crowdfundinsider.com/2022/08/195184-huntingdon-valley-bank-to-access-up-to-100m-of-defi-funding-via-makerdao/",
                        "https://www.americanbanker.com/news/pennsylvania-bank-taps-into-crypto-cash-to-boost-lending",
                        "https://www.globenewswire.com/news-release/2022/08/19/2501764/0/en/HV-Bancorp-Inc-Participates-First-Commercial-Loan-to-the-MakerDAO-Protocol-and-the-DAI-Stable-Coin.html",
                        "https://forbesbaltics.com/lv/viedokli/raksts/vienkarsi-dao-%28nevis-dari%29-to",
                        "https://www.nasdaq.com/articles/defis-role-in-bringing-real-world-assets-into-the-21st-century",
                        "https://www.agefi.fr/tech-finance/actualites/quotidien/20220726/course-aux-stablecoins-decentralises-est-lancee-347615",
                        "https://drive.google.com/file/d/1ur7zFJsWw4PZMNdMImh3VTkDmblUjBhv/view?usp=sharing",
                        "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2022-08-23-makerdao-com/17400",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-august-2022/16955",
                        "https://forum.makerdao.com/t/maker-brand-update-september-october-2022/18842"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.957971698780522
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "0",
                    "time": "30/09/2022-14:21:24",
                    "content": "    Lozadaluis12:     No regular Vaults in the product tab? or Dai?!  image860×1024 53.9 KB   u guys are killing it, keep it up! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#3",
                    "likes": "2",
                    "time": "30/09/2022-14:48:22",
                    "content": "Fear not my friend. They will be there. This was just an initial idea. It is expanding! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/12/2022-14:48:42",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}