{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/suggestions-for-multiply-oasis-interface/10676",
            "title": "Suggestions for Multiply Oasis interface ",
            "index": 10676,
            "category": [
                "Miscellaneous",
                "Site Feedback"
            ],
            "tags": [
                "oasis"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/chonghe",
                    "index": "#1",
                    "likes": "2",
                    "time": "04/10/2021-11:45:09",
                    "content": "Recently Maker has a new Multiply function which allows vaults to leverage in one step. But I found that the interface is not user friendly. When going to the multiply tab, it says there is a 1-way transition to the “new multiply” interface. I don’t understand why there needs to be a 1-way transition to the multiply interface. After transition, the interface for simple DAI minting, adding collateral action becomes “other actions”. They also important actions to manage vaults, “other actions” seem to diminish the functions.  A nice way is to just keep the original Collateral and DAI tab, and the multiply tab will just functioning without the “transition”. Just like Defisaver keeps, one for Boost & Repay, one for collateral, one for DAI. Simple and clear. In conclusion, some suggestions to Oasis interface on Multiply:  The “1-way transition” to multiply user interface is confusing, and may scare people off with the “1-way transition” word and therefore users may not proceed. Can just put the notes on multiply as it is now, and once users read and click “ok, I understand”, then can start to multiply After click “ok, I understand” note, then can keep it as 3 tabs: Collateral, DAI and Multiply. Just like below, but the multiply tab is for leverage/deleverage. Simple and clear   ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.478056426332288
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#2",
                    "likes": "4",
                    "time": "04/10/2021-12:37:22",
                    "content": "Hi @chonghe, Frank here Product Manager at Oasis.app, Thanks for trying out the multiply functionality, and for taking the time to write this feedback for us. I understand your feedback and agree that we can make some improvements here. First - we are working on creating an easy option to go back to a ‘borrow’ vault from the vaults opened as or transitioned to Multiply. So, that will hopefully solve most of this feedback right away. At the moment you are able to deposit/withdraw collateral/dai in the other actions tab as you said, so in that sense there is no loss in functionality there. If you would like to have your vaults switched right now from Multiply to Borrow, you can reach out to our support - [email protected] The reasoning for why we try to provide a completely separate experience, is that we really want to give focus in our UI to the two very separate use cases: borrowing, and multiplying. We like to keep the information needed for those use cases as relevant as possible. Especially were trying to help users who are not fully aware of the inner workings of the Maker protocol to eliminate learning about all possible features straight away, if the user only wants to increase their exposure. As an example: the ‘buying power’ metric on the Multiply side is not the same as the ‘Dai available to generate’ on the Borrow side, and therefore having both of those metrics on the screen can be very confusing to users of Oasis.app. Thus we decided to really separate the use cases. Again thanks for your feedback, it is very helpful, and please let us know if you have any other points you would like to see addressed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681994047619048
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chonghe",
                    "index": "#3",
                    "likes": "4",
                    "time": "04/10/2021-15:16:08",
                    "content": "Hi Frank, thanks for the detailed reply.  we are working on creating an easy option to go back to a ‘borrow’ vault from the vaults opened as or transitioned to Multiply.  That is absolutely great to have the option to transition back I got your point. So the main focus is to separate the borrow and multiply for the end users. I just have a thought that since it already occurred in my mind, I might as well type it out. In the future, if Oasis developers decide to show both Borrow and Multiply together, it can be just these 2 tabs: Borrow and Multiply (instead of 3 tabs of collateral, DAI and Multiply) under Borrow, have 2 smaller tabs for “collateral” and “DAI” under Multiply, remains or can further improve to something more intuitive or user friendly That way, it also separates to just borrow and multiply, while eliminating the need to “transition” between Borrow to Multiply. Just my 2 cents. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chichi1",
                    "index": "#4",
                    "likes": "3",
                    "time": "19/10/2021-18:15:23",
                    "content": "Some more suggestions. I just tried to change a vault to multiply. “Great, now you will go the new Mutiply interface”. That is grammatically incorrect and has a spelling mistake. Looks super unprofessional.  2021-10-1907 12.13466×616 39.8 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.212121212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "3",
                    "time": "19/10/2021-19:52:41",
                    "content": "How about suggesting improvements instead of just complaining? “Great, now you will go to the new Mutiply interface”. Spelled wrong: “Mutiply” How about “Welcome to the new Multiply interface”? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.143939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#6",
                    "likes": "1",
                    "time": "20/10/2021-12:05:36",
                    "content": "Thanks for notifying us of this grammatical error & typo. This has now been fixed and is released to Oasis.app. We’ve added more to Today’s release, like EIP-1559 type transactions for all connection methods, checkout the patch notes in the Oasis.app Discord: Discord Announcement Invite link to the discord: discord.gg/Kc2bBB59GC ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chonghe",
                    "index": "#7",
                    "likes": "1",
                    "time": "07/11/2021-02:03:09",
                    "content": "Current Oasis interface does not show collateralisation ratio anymore. I thought that is a very important parameter to display? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3
                }
            ]
        }
    ]
}