{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-governance-review-november-2020/5453",
            "title": "Maker Governance Review: November 2020 ",
            "index": 5453,
            "category": [
                "Updates"
            ],
            "tags": [
                "governance",
                "monthly-gov-review"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Anna",
                    "index": "#1",
                    "likes": "8",
                    "time": "02/12/2020-21:41:09",
                    "content": "The Community is taking over this Monthly Governance Review post from the MakerDAO blog and from now on it will be posted here on the forum. The discussion is open in the comments, let us know how we can structure this monthly update to provide the most value to the Community between the weekly Maker Relay updates, MIPs Updates, and Governance at a Glance! The Maker Governance Review is a monthly recap of all Governance activity, from Governance blog posts and polling/voting history to Governance Cycle progress. Each review is written to keep the Maker community informed of Governance developments.  Top Governance News In November, Governance officially onboarded YFI, BAL, and GUSD as new collateral types to the Maker Protocol. An executive vote passed to approve the November 2020 Governance Cycle Bundle, which included subproposal MIP3c4 stating that there will be no monthly Governance Cycle in December. Also, to facilitate more community involvement in the collateral onboarding process, the Maker community launched its Collateral Onboarding Handbook, a one-stop-shop for anyone interested in learning all about the collateral onboarding process at MakerDAO.  November’s Governance Polls and Executive Votes  Nov 30: Governance Polls: Oracles and Collateral Onboarding  Nov 27: Executive Vote: Increase ETH-A Debt Ceiling  Nov 23: Executive Vote: Approve November 2020 Governance Cycle Bundle  Nov 23: Governance Poll: Accelerate the Peg Stability Module Launch  Nov 20: Increase YFI-A Debt Ceiling, Increase Dust Parameter for all Vault-Types  Nov 13: Executive Vote: Onboard GUSD  Nov 6: Executive Vote: Onboard YFI and BAL, Debt Ceiling and Stability Fee Adjustments  Nov 2: Governance Polls: Rates and Debt Ceiling Adjustments    Governance Cycle Updates  Key Outcomes of the Seventh Governance Cycle The Seventh Governance Cycle, which began on November 2 and ended on November 27, included proposals for better defining and managing emergency situations for the Maker Protocol, decentralizing Debt Ceiling control to the broader community, and improving distributed operations and cross-domain coordination with a new Operational Support Domain.  Maker Improvement Proposals (MIPs) The November 2020 MIPs Executive Vote, which was published on Monday, November 23, passed the following day, and was executed on Friday, November 27. Four proposals and three subproposals were bundled in the vote:  MIP24: Emergency Voting System MIP25: Flash Mint Module  MIP27: Debt Ceiling Instant Access Module MIP28: Operational Support Domain Definition   Subproposals  MIP4c2-SP6: Calendar Exceptions  MIP13c3-SP6: SourceCred Funding MIP28c7-SP1: Subproposal for Operational Support Domain Facilitator Onboarding  Notably, MIP28 defined the Operational Support Domain team’s focus on the development and management of distributed operations at MakerDAO. Subproposal MIP28c7-SP1 onboarded @amyjung  as the Operational Support Domain team’s first facilitator.  MIPs in Progress Seven proposals, listed below, are in the Request for Comments (RFC) phase. This means it is now time for the Maker community to provide feedback on each or request changes from the Proposal Authors. MIPs  MIP17: Weekly Actual Debt Ceiling Adjustments MIP26: DssGov - Governance Contract Redesign MIP29 - Peg Stability Module MIP30: Farmable cUSDC Adapter (CropJoin) 1  Subproposals  MIP13c3-SP7: Governance Communications (Declaration of Intent) MIP13c3-SP8: Maker Protocol Cover with Nexus Mutual (Declaration of Intent) MIP28c7-SP2: Subproposal for Operational Support Domain Facilitator Onboarding  There are also three new discussions at the pre-MIP stage:  Real estate tokenization protocol: A Pre-MIP Discussion 1 Pre-MIP discussion: Incentives to align interests of Maker workers with MKR holder 1 Ideas on DAI PEG, USDC-A vault, fees, etc. A basic analysis + suggestions   Collateral Onboarding Community Greenlight Polls Community Greenlight Polls are Governance Polls that are specific to gauging community sentiment for collateral onboarding. Specifically, Greenlight Polls allow MKR token holders to inform the Domain Teams (Risk, Smart Contracts, and Oracles) of their preferences for collateral types that have been proposed through Collateral Onboarding Applications. These polls run for a period of two weeks, starting the third week of the Governance Cycle. Check the progress of all proposed collateral types in the Collateral Status Index. While Domain Teams are free to choose their workloads, it is important to gather the opinions of MKR token holders before the full domain work takes place, as a matter of efficiency.  November Collateral Onboarding Community Polls ended on November 30, with the following results: Two collateral types were considered—YFII (DFI.money) and NEXO (NEXO)—and both were deferred.  1203×96 6.28 KB   What’s Ahead? As a result of subproposal MIP3c4 passing, there will be no monthly Governance Cycle in December. The community will continue to discuss proposals in the RFC stage and plan for the next Governance Cycle in January. In addition, the Smart Contract domain team revealed the migration timeline for DsChief 1.2, along with recommended solutions to protect Maker Governance in case of a flash loan attack. Follow along with the 2020 End Of Year Schedule to see the backlog of work that domain teams are focusing on in December. Keep an eye out for the Weekly MIPs Update, typically posted in the Maker Forum on Sundays or Mondays. The update summarizes the most recent events in the world of MIPs, the previous week’s activity, what to expect from the current week, and what’s on the agenda for the next week. It also covers updates with respect to Governance polls and votes, collateral onboarding, and rate adjustments.  Resources To stay current on Governance, risk, and community issues, bookmark the MakerDAO Public Events Calendar. Newcomers to Maker might want to review our series of posts on the MakerDAO Governance Risk Framework. Also, remember to review the Maker Improvement Proposals category in the Maker Forum and visit the #mips rocket.chat channel to discuss topics related to MIPs, the Self-Sustaining MakerDAO Initiative, and long-run Governance. To learn more about the Governance activities that occur during the Monthly Governance Cycle, see MIP3 for a week-by-week breakdown. For the most current MIP-related activity, see the official MIPs Github page.  About Maker Improvement Proposals MIPs support the organic growth that further expands MakerDAO’s self-sustainability by providing the Maker community and all stakeholders with a standard approach to proposing improvements, specifications, and process and state changes to the Maker Protocol and MakerDAO. ",
                    "links": [
                        "https://collateral.makerdao.com/",
                        "https://blog.makerdao.com/governance-polls-november-30-2020/",
                        "https://blog.makerdao.com/executive-vote-november-27-2020/",
                        "https://blog.makerdao.com/executive-vote-november-23-2020/",
                        "https://blog.makerdao.com/governance-polls-november-23-2020/",
                        "https://blog.makerdao.com/executive-vote-november-20-2020/",
                        "https://blog.makerdao.com/executive-vote-november-13-2020/",
                        "https://blog.makerdao.com/executive-vote-november-6-2020/",
                        "https://blog.makerdao.com/governance-polls-november-2-2020/",
                        "https://vote.makerdao.com/executive/approve-november-2020-governance-cycle-bundle?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/mip24-emergency-voting-system-replaces-mip-5/4009",
                        "https://forum.makerdao.com/t/mip25-flash-mint-module/4400",
                        "https://forum.makerdao.com/t/mip27-debt-ceiling-instant-access-module/4625",
                        "https://forum.makerdao.com/t/mip28-operational-support-domain-definition/4627",
                        "https://forum.makerdao.com/t/mip4c2-sp6-calendar-exceptions/4546",
                        "https://forum.makerdao.com/t/mip13c3-sp6-sourcecred-funding/4545",
                        "https://forum.makerdao.com/t/mip28c7-sp1-subproposal-for-operational-support-domain-facilitator-onboarding/4628",
                        "https://forum.makerdao.com/t/mip28c7-sp1-subproposal-for-operational-support-domain-facilitator-onboarding/4628",
                        "https://github.com/makerdao/mips/blob/master/MIP0/mip0.md#mip0c3-the-mip-lifecycle",
                        "https://forum.makerdao.com/t/mip17-weekly-actual-debt-ceiling-adjustments/4312/3",
                        "https://forum.makerdao.com/t/mip26-dssgov-governance-contract-redesign/4589/28",
                        "https://forum.makerdao.com/t/mip29-peg-stability-module/5071/16",
                        "https://forum.makerdao.com/t/mip30-farmable-cusdc-adapter-cropjoin/5163",
                        "https://forum.makerdao.com/t/mip13c3-sp7-governance-communications-declaration-of-intent/5028/2",
                        "https://forum.makerdao.com/t/mip13c3-sp8-maker-protocol-cover-with-nexus-mutual-declaration-of-intent/5056/4",
                        "https://forum.makerdao.com/t/mip28c7-sp2-subproposal-for-operational-support-domain-facilitator-onboarding/5309/4",
                        "https://forum.makerdao.com/t/real-estate-tokenization-protocol-a-pre-mip-discussion/5169",
                        "https://forum.makerdao.com/t/pre-mip-discussion-incentives-to-align-interests-of-maker-workers-with-mkr-holders-around-burning-mkr/5162",
                        "https://forum.makerdao.com/t/ideas-on-dai-peg-usdc-a-vault-fees-etc-a-basic-analysis-suggestions/5147",
                        "https://forum.makerdao.com/c/MIPs/co/17",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://github.com/makerdao/mips/blob/formal-submission/MIP4/MIP4c2-Subproposals/MIP4c2-SP6.md",
                        "https://forum.makerdao.com/t/dschief-1-2-flash-loan-protection-for-maker-governance/5115",
                        "https://forum.makerdao.com/t/2020-year-end-schedule/5218",
                        "https://forum.makerdao.com/",
                        "https://calendar.google.com/calendar/embed?src=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com&ctz=America%2FLos_Angeles",
                        "https://medium.com/makerdao/makerdao-governance-risk-framework-38625f514101",
                        "https://forum.makerdao.com/c/MIPS/14",
                        "https://forum.makerdao.com/",
                        "https://go.rocket.chat/invite?host=chat.makerdao.com&path=invite/NPEuhW",
                        "https://forum.makerdao.com/t/the-maker-foundation-s-vision-of-a-self-sustaining-makerdao-initiation-of-maker-improvement-proposals-mips-framework/1882",
                        "https://github.com/makerdao/mips/blob/master/MIP3/mip3.md#week-by-week-breakdown-of-the-monthly-governance-cycle",
                        "https://github.com/makerdao/mips",
                        "https://blog.makerdao.com/the-first-13-maker-improvement-proposals-to-further-decentralization-of-makerdao/",
                        "https://forum.makerdao.com/t/maker-relay-ep-24-en-espanol/5574",
                        "https://forum.makerdao.com/t/maker-relay-ep-24/5534"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.790162073698659
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "09/12/2020-21:41:12",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}