{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/puritydai-a-potential-solution-to-the-real-world-collateral-controversy/526",
            "title": "PurityDai: a potential solution to the real world collateral controversy ",
            "index": 526,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "concerns",
                "alignment"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "16",
                    "time": "24/09/2019-09:00:58",
                    "content": "There’s been a lot of discussion about the inclusion of real world assets as collateral in Dai. While the core MKR governance community has long thought about and discussed the risks and benefits of real world assets as collateral, there is a wider community of Ethereum enthusiasts who love Dai and Maker, but have not followed governance closely and were shocked to learn that real world assets might be included in Dai. The result is that a lot of people have voiced their opinion and tried through various means to discourage MKR governance from including real world assets as collateral as the revelation spread through reddit and twitter. But from the depths of crypto twitter a potential solution also emerged: PurityDai As you might know, on the roadmap after Multi-Collateral Dai launch is the ability for Maker Governance to launch new Synthetic Assets, so that other Dai Stablecoins can also be created. This includes things like EuroDai, YuanDai, YenDai and even SP500Dai, GoldDai etc. But! Turns out the same concept can also be used to solve the real world asset controversy by allowing Maker Governance to press ahead with its plans to include real world assets in Dai, while also using the Synthetic Asset capability to create a version of Dai that does not have real world assets backing it, but is instead backed purely by ETH: PurityDai. What’s really cool about this approach is that PurityDai would be a very unique asset in that it would have both the benefit of being backed only by ETH, and thus have no chance of having its collateral seized, but it would actually still also be protected against black swan events in the price of ETH, because it would share the same MKR with Dai and other synthetic assets, and thus would still benefit from the highly diversified black swan protection that real world assets offer. There would of course be a cost to this. Since PurityDai would have very restricted collateral in the long run - only ETH would be accepted - then there would be little room for supply growth. And because it has very unique security properties, then at the same time there might be a lot of demand for it. The result is high demand and low supply, which the Dai Credit System can only deal with in one way: Low, or even negative Dai Savings Rate. Where the rate ends up depends entirely on the market dynamic of this kind of unique asset. There’s still some technical building blocks, and even greater risk and governance barriers that would need to be in place before something like this can be built, and it would for sure have to come after e.g. EuroDai and YuanDai as they are a lot simpler to create. But it is certainly possible to create this eventually if the demand is really there, and for now, the existence of this concept should be able to alleviate everyones concerns on both sides of the debate: Maker Governance gets to chug on with carefully adding real world collateral to Dai without vocal opposition, and sceptical ETH enthusiasts have a unique asset to look forward to around the time real world assets start to be included in the collateral portfolio. And PurityDai will not only give them what they like about SCD, it will also come with the additional level of black swan protection afforded by MCD and the real world assets, making it amongst the most robust cryptoassets imaginable. Everybody wins, and what started as a controversy ends up as a great story and concrete proof that innovation in Ethereum is truly driven by the community. ",
                    "links": [
                        "https://forum.makerdao.com/t/discussion-eurodai/6521",
                        "https://forum.makerdao.com/t/what-core-units-does-the-dao-need-next/13594/44",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-october-17-9am-pst-4-00-pm-utc/660/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-september-26-9am-pst-4-00-pm-utc/531/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-october-31-9am-pst-4-00-pm-utc/708/2",
                        "https://forum.makerdao.com/t/mip13c3-sp10-declaration-of-intent-eurdai/6766"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.648870633676668
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ginworkflow",
                    "index": "#2",
                    "likes": "0",
                    "time": "24/09/2019-10:52:54",
                    "content": "Sounds like a good idea. But I think it should be called CryptoDai or at least something else than PurityDai  Edit: one could maybe also consider to not globally settle SCD until purityDai is operational. Think that it would make some people happy to not have to use MCD in the interim period. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#3",
                    "likes": "0",
                    "time": "24/09/2019-12:14:41",
                    "content": "Sure, maybe have a twitter poll to let the community pick once we get to it. While SCD won’t shut down until quite a while after MCD has launched, it wouldn’t make any sense not to upgrade, both because there won’t be any real world assets in MCD at launch, and it has some critical security upgrades such as the Governance Security Module and the Oracle Security Module. Then with MCD in hand users could easily migrate to any other synthetic asset they like once it launches. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.609126984126984
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ginworkflow",
                    "index": "#4",
                    "likes": "0",
                    "time": "24/09/2019-13:01:54",
                    "content": "That makes sense. Then MTHs could maybe consider not approving centralized collateral until purityDai is available. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jeffshaw",
                    "index": "#5",
                    "likes": "2",
                    "time": "24/09/2019-13:09:20",
                    "content": "Good idea @rune. Regarding naming convention, for consistency and clarity, why not name the Dai by the sole asset collateralizing it? Then ETHDai would be consistent with EuroDai, YenDai, SP500Dai, etc. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#6",
                    "likes": "0",
                    "time": "24/09/2019-14:45:30",
                    "content": "I believe ETHDai name will be reserved for synthetic ETH. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Svante",
                    "index": "#7",
                    "likes": "0",
                    "time": "26/09/2019-10:42:41",
                    "content": "What is “quite a while”? According to your latest blog post, we’re talking “months”, which I’d not call quite a while: “After a grace period, expected to last at least some months pending an MKR Governance vote, the current version of Maker Protocol (SCD) will be shut down and any existing Dai and SCD CDPs remaining will be settled.”    The Maker Blog – 23 Sep 19    Looking Ahead: How to Upgrade to Multi-Collateral Dai from Single-Collateral Dai Users and partners working with existing single-collateral Dai (or Sai) in the CDPs, or any other aspect of the Single Collateral Dai (SCD) system must upgrade to MCD upon its release.       ",
                    "links": [
                        "https://blog.makerdao.com/looking-ahead-how-to-upgrade-to-multi-collateral-dai/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.842509920634921
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#8",
                    "likes": "0",
                    "time": "26/09/2019-10:47:24",
                    "content": "Depends on your definition of quite a while and how many months, I guess. The main concern for keeping SCD running is to ensure that it doesn’t shut down before e.g. long term old dharma protocol loans mature. In the end this is a question that will be decided by MKR governance after MCD launch and the migration has been successful. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.007936507936508
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "4",
                    "time": "26/09/2019-14:02:35",
                    "content": "    rune:  As you might know, on the roadmap after Multi-Collateral Dai launch is the ability for Maker Governance to launch new Synthetic Assets, so that other Dai Stablecoins can also be created. This includes things like EuroDai, YuanDai, YenDai and even SP500Dai, GoldDai etc.   It might be too early to ask this, but how will such synth assets be backed? My understanding of this was that these assets would be backed by Dai itself, so you have a system of. (All the diversified Collateral) -> Dai -> EuroDai, YuanDai, etc. But your suggestion to have PurityDai backed by only Eth would seem to belie this structure. Is the plan to have these synths backed by the assets they represent, like PurityDai? Or would PurityDai be a special case synth?     rune:  But it is certainly possible to create this eventually if the demand is really there, and for now, the existence of this concept should be able to alleviate everyones concerns on both sides of the debate: Maker Governance gets to chug on with carefully adding real world collateral to Dai without vocal opposition…   This feels very optimistic. It doesn’t seem likely to me that opponents to real world collateral going to stop arguing their side due to the possible eventual existence of this concept when they have what they want right now in SCD and the assumption of real world collateral in MCD threatens that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.563672438672439
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ginworkflow",
                    "index": "#10",
                    "likes": "0",
                    "time": "26/09/2019-14:45:16",
                    "content": "    LongForWisdom:  This feels very optimistic. It doesn’t seem likely to me that opponents to real world collateral going to stop arguing their side due to the possible eventual existence of this concept when they have what they want right now in SCD and the assumption of real world collateral in MCD threatens that.   Agree. This is why I suggested MTHs consider not adding centralized assets until PurityDai is available. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.725446428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#11",
                    "likes": "0",
                    "time": "26/09/2019-15:44:41",
                    "content": "    ginworkflow:  Agree. This is why I suggested MTHs consider not adding centralized assets until PurityDai is available.   Personally I’d want a re-issuance of the asset priority poll including TUSD or whatever real world assets are proposed soon, and if interest shows we can debate the findings from the risk teams eventual reports. I don’t see how treating real world assets differently their early in the process makes sense, risk is risk, and its the job of the risk teams to help elucidate the potential pitfalls. We need to trust the process. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.642857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ginworkflow",
                    "index": "#12",
                    "likes": "1",
                    "time": "26/09/2019-20:07:55",
                    "content": "    Mitote:  We need to trust the process   Agreed. We should add centralized collateral to the priority list. What I meant was MTH should consider prioritizing those collateral types the lowest/last until purityDai. Not because of technical/risk details but because that would maybe be a pragmatic approach considering the reactions lately. Imo it would be nice to keep the entire Dai community on board and not lose part of the community because of centralized collateral if possible. Having a large an diverse community is pretty valuable imo. So I’m just hoping MTH will do what they can to keep it that way. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.636904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#13",
                    "likes": "0",
                    "time": "26/09/2019-20:41:39",
                    "content": "I regard centralized stablecoins as top priority for MCD. Centralised stablecoins are the gateway between crypto and the fiat banking system that is bulging with low-return funds. Enabling this link is key to DAI growth. We will manage risk using the debt ceiling. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ginworkflow",
                    "index": "#14",
                    "likes": "2",
                    "time": "26/09/2019-21:25:34",
                    "content": "That’s also my personal opinion. However judging from the reason reactions from the Dai community I would probably prioritize purityDai above centralized collateral for the sake of not fracturing the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#15",
                    "likes": "0",
                    "time": "26/09/2019-23:13:54",
                    "content": "I definitely see where your coming from and really appreciate the concern about alienating parts of the wider community. As noted in the governance call today I agree education seems essential to try and repair whatever rift is forming. It just looks like people are emotionally or philosophically reacting to something they haven’t fully or coolly considered. Until I see a detailed thorough assessment clearly showing the increased risk of specific proposed real world assets I see zero reason to change the trajectory we are on. Puritydai being more complicated than say eurodai or yendai (which themselves seem to be years away) kinda puts it off the table in the near term as we near MCD launch. Not saying its a bad idea or anything, just at this point discussing it takes away valuable energy from MTHs considering safest systematic avenues to maximize growth. Delaying things gives competitors (libra or other projects) more time to establish themselves. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.24264705882353
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ginworkflow",
                    "index": "#16",
                    "likes": "0",
                    "time": "27/09/2019-08:03:40",
                    "content": "    Mitote:  education seems essential to try and repair whatever rift is forming. It just looks like people are emotionally or philosophically reacting to something they haven’t fully or coolly considered   Agree. But if one can support those philosophically against centralized collateral that would be great imo.     Mitote:  which themselves seem to be years away    was hoping to see eurdai relatively soon after MCD      Mitote:  Delaying things gives competitors (libra or other projects) more time to establish themselves.   Yes that’s not good. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.652777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#17",
                    "likes": "6",
                    "time": "27/09/2019-08:12:47",
                    "content": "Synthetic asset and this potential solution aren’t that far away. We might be able to commit to keeping SCD running until PurityDai is out (not sure yet, but we will know soon after MCD launch once the Foundation can spend some time creating the future roadmap). It’s important we don’t harm the broader majority and the rest of the ecosystem by refusing to include real world collateral in MCD just in order to appease a vocal minority. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.678571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chaser",
                    "index": "#19",
                    "likes": "0",
                    "time": "24/10/2019-13:48:59",
                    "content": "    rune:  There would of course be a cost to this. Since PurityDai would have very restricted collateral in the long run - only ETH would be accepted - then there would be little room for supply growth. And because it has very unique security properties, then at the same time there might be a lot of demand for it. The result is high demand and low supply, which the Dai Credit System can only deal with in one way: Low, or even negative Dai Savings Rate.   If Purity’s DSR is negative, that just means that people won’t put their Purity into the local savings contract, doesn’t it? No rational actor would choose to deposit to lose money without any other gain. So I doubt a negative DSR will be really meaningful. But what then will be the price of this purity? Super-high SF? Built-in holder tax? Or something else?     rune:  Since PurityDai would have very restricted collateral in the long run - only ETH would be accepted - then there would be little room for supply growth.   I’d add that there’s a scenario where this is not a serious constraint. Right now it seems unlikely, but in case ETH’s rate of appreciation keeps up or surpasses the demand for Purity, the expansion of the supply wouldn’t be an issue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.999974120082816
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#20",
                    "likes": "0",
                    "time": "28/10/2019-02:10:16",
                    "content": "phrasing things like “we just need to educate everyone” comes across as arrogant, as though anyone who disagrees with you for any reason is simply less educated somehow… IMO that attitude is unlikely to result in a less fractured community @rune is there a technical reason to force an end of life date for single collateral DAI? i’m personally very happy with what i have right now, and will carefully reconsider holding DAI if i am forced into it becoming backed by non-ETH (i.e. not trustless) assets on freshly deployed smart contracts right now i feel i understand the risks in the system (MKR counterparty risks, ETH liquidity risks, smart contract hacking risks), but i don’t feel that way about the new system because it is much more complicated by design i’d love for the existing contract to continue to operate as-is, and am happy for MCD people to do what they want also in parallel, why should that prevent me from doing what i want to do in the system that i feel i understand better and have more day to day experience with? if/when MCD has a solid track record (counted in years, not months), i might consider migrating (lindy effect yada yada) but the current shortness, arbitrariness and fuzziness of timelines is stressing me out tbh i don’t understand why an organisation with so much apparent respect for “black swan” events is force pushing a full update-in-place migration of the whole ecosystem over a short period (several months) rather than create this hypothetical new “purityDAI” thing contingent on “enough interest from the community” (which introduces even more new risks), could MKR continue the thing that already exists and works quite well alongside the new, unproven MCD setup and allow people to choose for themselves which model they prefer? if MCD is a genius idea that is totally necessary and there is no risk at all and everything is awesome we all just need to be educated… well then i expect everyone to come flooding over anyway, so why force things? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.805792891319207
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#21",
                    "likes": "6",
                    "time": "28/10/2019-09:22:11",
                    "content": "DAI was always supposed to be multicollateral DAI. Sheer system size and complexity forced Maker to detour into singlecollateral DAI based on ETH. Now with years of work nearing completion there is a small but vocal community that opposes the whole multicollateral idea. The opponents scale the whole range from not wanting any collateral except ETH, to not wanting any collateral that is not crypto or not wanting any collateral that is partly centralized or not wanting any collateral that is fiat based or not wanting any collateral based on real world securities. Others again have more philosophical arguments based on governance. Multicollateral DAI is however based on a vision. That is DAI for everybody, not just a select group of crypto enthusisasts. And the only way for DAI to scale, and I mean really scale, is to allow for as many types and categories of collateral as the system can manage to support. Governance, or rather the evolution of governance, will be absolutely crucial for this to become reality. Some people feels this is risky, but this is where risk management comes in. There will be setbacks and there will be trouble but we will deal with it within system parameters, learn from the event and move on. People that feel relying on a single crypto currency for collateral is safe just because it has worked for two and a half years have IMHO spent too little time both in crypto and in the real world. Time in crypto moves at the pace of dog-years where every month is at least a year or two for any other industry. Coinmarketcap is full of also-rans that are still around but without a single developer to push it forward. Death by go-to-zero is the only way that can end. Just go back a couple of years and see how the list of top-10 and top-20 coins have changed. Relying on Ethereum for safety is just fine if you want to dabble in DeFi but utterly superficial for any serious attempt at making a stablecoin capable of being a global force for financial stability. Within five years from now Maker could be on the Ethereum chain, on another blockchain, on some DLT-type tangle or even be its own chain. The possibilities are multiple and gluing DAI to a single collateral is in my eyes simply not worth any serious consideration. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.147844272844273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#22",
                    "likes": "1",
                    "time": "28/10/2019-14:02:43",
                    "content": "@Planet_X already replied, but I want to add one more point. I think Rune envisioned PurityDai as another instance of multicollateral DAI, specially configured. So even PurityDai fans will need to do a migration once a proper PurityDai system is established. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#23",
                    "likes": "2",
                    "time": "29/10/2019-21:51:26",
                    "content": "@Planet_X are you responding to me? the things you’ve said don’t line up with my questions or concerns, so i can’t tell… i’m not opposed to MCD at all, i’m asking “why not both?” until real world data shows that SCD organically has become a ghost town (which it naturally will if MCD is great) my salary is paid in SCD, if the MCD migration fucks up then my ability to pay rent goes with it, so i very much agree risk management “comes in”, hence me asking why we’re rushing things and burning bridges to be clear i’m questioning the migration strategy not the concept of MCD itself it’s going to take me a year or so to be comfortable with running my whole salary through any new contract, even if it comes from an established and respected team like MKR i’ll stick to the main philosophical points of MKR as i understand them:  decentralisation (don’t force things on me, the end user, give me info and options then let me make my own decisions) stability and risk management (don’t be rushing to put all eggs in one, untested codebase basket) data driven adoption/usage (avoid laying down timelines like “months” pre-launch) market driven (if users aren’t using MCD it is up to MKR to make it better based on objective measures until people do use it, not just “flick a switch” because it should be better “in theory”)  and re-ask my same question is there a technical reason to force individual end-users to adopt something before they are personally comfortable with it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.107230196703881
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#24",
                    "likes": "2",
                    "time": "29/10/2019-22:43:21",
                    "content": "It costs schelling point clarity to the entire ecosystem, governance attention&work, and some technical maintenance. Re-releasing as PurityDai later would be memetically clear and would happen at a time when governance is not spread (very) thin. Above all: it costs commitment points. As @Planet_X said, there is a plan. The plan is many years old. The plan was always clear. The plan is being executed. In the absence of new, relevant information (“I’m not fond of the preannounced plan” does not count as new information), I hope this is what Maker keeps doing in the future: stick to its commitments. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.335795454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#25",
                    "likes": "1",
                    "time": "29/10/2019-23:27:26",
                    "content": "@swakya ok that helps with some framing, can you link to some kind of reference to the part of the plan that is many years old that shows the short timeframe between MCD launch and SCD forced shutdown? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#26",
                    "likes": "3",
                    "time": "30/10/2019-07:27:58",
                    "content": "@David_Meister  and re-ask my same question is there a technical reason to force individual end-users to adopt something before they are personally comfortable with it?  I will try to answer your question but I doubt you will like it: Neither you, me or anyone else using SAI are end users. Until multi-collateral DAI launches and proves stable we are co-experimenters. That is hard for some people to take in, especially if they have their salary or their savings in SAI, but that is just the reality of it. Now on to the part about being “personally comfortable”. I doubt you will get that in crypto. Not since Bitcoin was invented has the crypto industry ever been about comfort, and especially not personal comfort. Lust, greed, intellectual mastery, victory, defeat, oblivion and conquering the world - yes. But “personal comfort” - no. Just remember what 2018 felt like. The closest thing you will get to comfort in crypto is a good stablecoin and that is what Maker is developing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.753472222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#27",
                    "likes": "1",
                    "time": "30/10/2019-09:36:23",
                    "content": "@Planet_X  that’s helpful I can plan better with real talk like that ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#28",
                    "likes": "0",
                    "time": "30/10/2019-12:05:04",
                    "content": "i’m quite personally comfortable in crypto btw, when i own my keys i only get nervous when someone else’s keys touch something i’m trying to use i don’t relate to all the catastrophising… what was so bad about 2018? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ashwath",
                    "index": "#29",
                    "likes": "0",
                    "time": "03/11/2019-17:35:12",
                    "content": "What exactly is the point of this? Is it just to appeal to the people who want ETH to be the sole form of collateral? In the future, what happens if a group of people say they want DAI to be backed only by cryptoassets - not real-world assets? From how I see it, the main thing is here is leveraging these various forms of collateral to generate a single, fungible stablecoin. If there are multiple types of CDPs with only ETH collateral, or just crypto asset collateral, then fungibility is lost due to there being so many different variants of DAI. I understand this space about inclusivity of ideas, but having multiple variants of DAI just makes things more complex and dispersed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.306746031746031
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ginworkflow",
                    "index": "#30",
                    "likes": "2",
                    "time": "06/11/2019-14:21:16",
                    "content": "I believe eventually there will be multiple versions of Dai anyways. For example DaiEUR etc. So if there is demand for PurityDai I don’t see why not also add that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MicahZoltu",
                    "index": "#31",
                    "likes": "3",
                    "time": "10/11/2019-02:30:09",
                    "content": "    rune:  it would actually still also be protected against black swan events in the price of ETH, because it would share the same MKR with Dai and other synthetic assets, and thus would still benefit from the highly diversified black swan protection that real world assets offer.   This means that it shares at least some of the risks of the real world collateral. Scenario: Governments start seizing real world collateral assets backing DAI, as they have done for basically every other competing currency in history.  The real-world-collateralized DAI systems go deep underwater leaving an MKR mint and sell to cover the losses.  The losses are huge, and people’s confidence in Maker isn’t high enough to cover the system, leaving MKR valueless and DAI worth less than 1 USD (or whatever its target is). PurityDAI is still fully collateralized, but it is not secure.  The following attacks can now be executed at near zero cost:  All forms of governance attacks, including price feed manipulation, contract updates, tuning all of the knobs, etc. If ETH suffers a sudden drop in value and liquidations don’t happen fast enough, MKR is no longer available as the lender of last resort because its value is already effectively zero.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.198148148148149
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MicahZoltu",
                    "index": "#32",
                    "likes": "1",
                    "time": "10/11/2019-02:41:52",
                    "content": "    swakya:  The plan is many years old. The plan was always clear. The plan is being executed.   Ehh… Maker has deviated pretty heavily from the original plan at this point.  For example, “stable coin” has changed to “pegged coin”, governance has gotten much more power than originally intended, etc.  I’m not arguing here that Maker “must stick to the original whole plan”, only that “this was always the plan, it cannot change” is provably a false statement and thus not a good supporting argument for McDAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.741071428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#33",
                    "likes": "0",
                    "time": "10/11/2019-10:22:49",
                    "content": "Then I’m glad it’s not what I said – a more accurate paraphrasing would be “this was always the plan, it should not change”. The second part is not a statement of fact, just me expressing a preference. You are right that over the past years there have been changes, but that does not alter whatever strength “because the plan” has. Even if it’s just the remaining part of the plan, every additional change costs commitment points, which is what my argument was about. I must admit that overall it’s a weak argument and things should stand or fall on their own merit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9226190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chaser",
                    "index": "#34",
                    "likes": "0",
                    "time": "13/02/2020-22:40:08",
                    "content": "    ginworkflow:  I believe eventually there will be multiple versions of Dai anyways. For example DaiEUR etc. So if there is demand for PurityDai I don’t see why not also add that.   Note that synthetics (eurodai, yendai, etc.) won’t function based on a different collateral system. Dai (the dollar-pegged one) will be their collateral. They will be layer 2 currencies, if you will. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chaser",
                    "index": "#35",
                    "likes": "2",
                    "time": "13/02/2020-23:05:41",
                    "content": "One important advantage of having two parallel stablecoin systems (like MCD and PurityDai) would be this: if one needs to be shut down, there will be an alternative, potentially stable, potentially well-embedded similar stablecoin people can flock to.     MicahZoltu:  This means that it shares at least some of the risks of the real world collateral.   Micah’s observation is very relevant. I think sharing the same base (the MKR token) can cut both ways.  If MCD and PurityDai share the same recapitalization and governance token, the overall governance effort is easier and more focused. Also, one can rely on the other’s strength for upholding the value of MKR. On the other hand, as Micah pointed out, one’s catastrophic failure can cause the failure of the other system. If PurityDai is built completely separately with its own recapitalization and governance token (let’s call it PUR), risks will be separated. But benefits will be too: it probably won’t share the same governing expertise MKR already has, and building and maintaining this new system will incur its own additional overhead (e.g. new smart contract deployments).  Given that there will already be a significant extra attention required to run this system inside MKR, it might as well run separately. But I’m not sure there’s currently enough velocity to launch PurityDai as a system separate from MKR. (This might change in the future – e.g. when the first real-world asset is added to MCD.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2372068903318905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cynthiaa",
                    "index": "#36",
                    "likes": "1",
                    "time": "08/04/2020-14:40:32",
                    "content": "    chaser:  Given that there will already be a significant extra attention required to run this system inside MKR, it might as well run separately. But I’m not sure there’s currently enough velocity to launch PurityDai as a system separate from MKR. (This might change in the future – e.g. when the first real-world asset is added to MCD.)   I’m behind DeDAI and DeMKR as a separate system from MKR. I wouldn’t want to bear the risk of fiat-backed collateral being shut down, if I did I would use fiat-backed stablecoins. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.887152777777778
                }
            ]
        }
    ]
}