{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ve-dsr-vs-centralized-stable-coins-as-collaterals/54",
            "title": "-ve DSR vs centralized stable coins as collaterals! ",
            "index": 54,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "analysis",
                "alignment",
                "dsr"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#1",
                    "likes": "1",
                    "time": "29/06/2019-13:38:40",
                    "content": "I think that we have a serious problem with the possibility of losing the peg if we can’t scale the magnitude of available collaterals soon enough. the Dai adoption has been growing in the last few months and it will likely to continue to grow and so should the Dai supply. since we are still working with Ether as the only available collateral. This means we have a limit to which we can grow the Dai supply securely. I mean we can’t expect to have 20% or 30% of Ether supply locked in cpd (this will be very dangerous if we have a significant decrease in the Ether value) that’s why I think that probably 5% is the maximum supply of Ether that can be safely used in cpd. 5% with current prices of Ether will allow us to generate 400m Dai, so this means that currently with SCD 400m Dai is the upper limit. If the adoption and usage of Dai would grow to more than 400m in the coming months (before implementing MCD), we would lose the peg and there is no think we can do except shutting down the system (Global settlement). Now it seems that there is a small possibility that the Dai supply will grow to more than 400 million in the coming months before MCD, so we will be ok in the next few months (probably). after implementing MCD we will have two problematic scenarios: the first problem that we can’t scale soon enough: I mean ERC-20 tokens (which can be used easily with MCD) have a total market cap of 4% to 5% of Ethereum market cap… so it is almost nothing! Building a secured non-custodial bridge between Ethereum and Bitcoin looks like a very difficult task to do… which can delay the usage of bitcoins as collateral for years! I can’t imagine how the system will survive with only 400m Dai as a maximum limit for years especially with the growing usage of stable coins! The second problem is the immature usage of DSR: today we have about 4 billion dollars of centralized stable coins. even if we offer Dai with very low DSR for example 1% to 2% this could increase the adoption and demand for Dai largely and we will very easily hit the 400m ceiling. we could see fast shifting from the increasing 4 billion supply of centralized stable coins into Dai. so I think we have two options to prevent us from losing the peg due to slow scalability solution. first, -ve DSR : which I just don’t like it although it could be better than shutting down the system. second, using a basket of centralized stable coins like Tether, Libra and Usdc… with stability fees of zero and only 100% collateral. this will provide us with a good scalable source of collaterals until we can solve the technical problems and build the infrastructure that will allow us to scale with Bitcoin, security tokens or other significant assets which can be used in the future I know that a basket of centralized stable coins is not an ideal solution but it is probably better than losing the peg and shutting down the system. ",
                    "links": [
                        "https://forum.makerdao.com/t/is-anything-wrong-with-the-dsr-and-stability-rate-calculations-as-planned-for-mcd/39/17"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.376809056956116
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#2",
                    "likes": "0",
                    "time": "10/07/2019-18:56:03",
                    "content": "As far as I’m aware the risk team is nowhere near confident enough in coins with counter-party risk as collateral. What will likely happen is that the DSR will be kept low to avoid mass adoption before we have the collateral to back it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.59375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#3",
                    "likes": "0",
                    "time": "12/07/2019-09:07:47",
                    "content": "As seen on dYdX, there is presently the market possibility for a positive DSR…(as the interest rate offered there is 15+%… )… that said I do take your point… it will come down to what levels we set the RP… however, in the above you make reference to a 400mm ceiling… to my understanding there will not be a ceiling on DAI nor DAI in the DSR… there will only be ceilings on the individual collateral packages that can mint DAI… SO… if the DSR has a positive yield, it will instantly attract participants… the question is how much and to what degree… we want DAI in the hands of as many people and locked in the DSR as possible. We need that do pull down the yield. (think of the US Savings bonds as a corollary) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.351430976430977
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#4",
                    "likes": "0",
                    "time": "12/07/2019-09:38:26",
                    "content": "I am suggesting using central stable coins in cpd as the last tool after we exhausted all other options to buy us time to find and build the infrastructures needed to scale the possible collaterals. I am suggesting using stable coins only when we reach the point where we have 2 options: either Global settlement or adding centralized stable coin as collateral to buy us time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#5",
                    "likes": "0",
                    "time": "12/07/2019-09:47:38",
                    "content": "I didn’t mean an actual ceiling but economic and risk ceiling. It will become increasingly dangerous if we locked more than 5% of Ether supply in cpd, so it should promote us to increase the RP on Ether to decrease the locked supply to a safer level. as I remember Vitalik was worried when we reached 2% of Ether locked in cpd… imagine the risks with 10% or 20% of Ether locked in Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.7875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#6",
                    "likes": "0",
                    "time": "12/07/2019-09:52:01",
                    "content": "excellent point… 100% on the same page… any time there is a material % of a token that is used as collateral, you introduce systemic risk. so other tokens… or ideally off chain assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.21875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "0",
                    "time": "20/07/2019-19:08:51",
                    "content": "While I do expect to see growth in the Dai supply, I don’t think I’m expecting it to be as explosive as you seem to be suggesting. My gut feeling is that we will have time to go through MCD, and ultimately get security tokens on the platform before we hit ~1bn Dai demand. I don’t have any hard evidence for this belief. Does anyone else have thoughts on this, or expect the contrary? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.270833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#8",
                    "likes": "0",
                    "time": "20/07/2019-21:13:54",
                    "content": "I don’t expect any “explosive” demand growth in the near future (1 - 2 years). 200 million at the end of 2020 would be very good result. Ofc my “prediction” is based on nothing drastic to happen in the cryptosphere. Like bitcoin bull run over 20k, libra launching with success,  “killer dapp” or eth2.0 being on track etc. It might be wise to get into the mode of thinking that scaling is imminent, just to put some pressure on ourselves to try to deliver asap - while not avoiding hardest challenges. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.01
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#9",
                    "likes": "1",
                    "time": "22/07/2019-06:05:28",
                    "content": "Hi, to be honest I do not worry lack of collateral to be a problem any time soon.   DAI currently is used mostly for leverage and Stability Fee must be kept crazy high to actually shrink the supply   There are already rising Tokens like WBTC I expect that if there will be need for it It will expand quite soon and that significantly increase possible max supply. I believe super proportionally since any liquidations harm foreign chain (Bitcoin) not a Home chain where MakerDAO sits (Ethereum) so we can go for more than 2-4% of total supply if needed.   DSR will not change much (unless it will be crazy high) since You already can get decent interest rates on holding DAI for example on compound   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5218750000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#10",
                    "likes": "0",
                    "time": "24/07/2019-03:03:58",
                    "content": "I definitely expect the DAI outstanding to grow and way faster than most realize. The limiting implementation will be how much the DSR is used to absorb the excess. More specifically how high it has to go… If the final cost of capital is lower than the existing system, hold on to your hats… (Emphasis on offchain assets). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.328571428571427
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#11",
                    "likes": "0",
                    "time": "24/07/2019-03:35:15",
                    "content": "One comment on the DSR… The rate on compound will stay elevated until demand to hold DAI is expanded. But raw alpha is raw alpha… However it will be particularly interesting to learn how much of their deposit will be placed in the DSR… I suspect quite a bit… Leverage on leverage… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.298076923076923
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ginworkflow",
                    "index": "#12",
                    "likes": "1",
                    "time": "24/08/2019-20:05:08",
                    "content": "    mmoossttaaffaa:  second , using a basket of centralized stable coins like Tether, Libra and Usdc… with stability fees of zero and only 100% collateral. this will provide us with a good scalable source of collaterals until we can solve the technical problems and build the infrastructure that will allow us to scale with Bitcoin, security tokens or other significant assets which can be used in the future I know that a basket of centralized stable coins is not an ideal solution but it is probably better than losing the peg and shutting down the system.   This sounds like a good suggestion to me. As long as risk parameters are set in such a way that MKR dilution is unlikely of course. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.837301587301588
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#13",
                    "likes": "0",
                    "time": "25/08/2019-12:58:59",
                    "content": "The counterparty risk baked into centralized stablecoins will need to be represented in the rate. It will never be 100%CR @ 0%SF The SF covers a risk premium & DSR ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#14",
                    "likes": "0",
                    "time": "25/08/2019-13:55:59",
                    "content": " The counterparty risk baked into centralized stablecoins will need to be represented in the rate. It will never be 100%CR @ 0%SF The SF covers a risk premium & DSR  I am talking about a scenario in which we reach the point that the demand on Dai is too high to the point we don’t have enough supply because we are out of collaterals. in this scenario, it will be crazy to have DSR that is higher than zero! I am suggesting using central stable coins in cpd as the last tool after we exhausted all other options to buy us time to find and build the infrastructures needed to scale the possible collaterals. I am suggesting using stable coins only when we reach the point where we have 2 options: either Global settlement or adding centralized stable coin as collateral to buy us time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.703409090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ginworkflow",
                    "index": "#15",
                    "likes": "0",
                    "time": "25/08/2019-15:32:46",
                    "content": "And you are talking about wrapping a basket of centralized stablecoins into one erc20 right? So that if one of the coins in the basket should go to zero for whatever reason then the combined loss of the basket should be so small that the chance of MKR dilution is still small right? @Davidutro has there been any public discussion/threads of using this concept of putting likewise and centralized collateral into a basket to kind of mitigate the centralization? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.55952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#16",
                    "likes": "0",
                    "time": "25/08/2019-15:51:09",
                    "content": "    mmoossttaaffaa:  I am talking about a scenario in which we reach the point that the demand on Dai is too high to the point we don’t have enough supply because we are out of collaterals.   Why is this a likely scenario? Why plan for it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.266666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#17",
                    "likes": "0",
                    "time": "25/08/2019-16:36:05",
                    "content": "If we get to this point, and we are willing to accept a basket of centralized stable coins and their resulting risk, then we should also consider other custodial cross-chain bridges and real-world assets.  Again, all of this with appropriate risk parameters. To be clear, I would not recommend we use anything with any significant amount of centralization as collateral without careful assessment of risk and risk parameters.  Even if the asset looks strong and risk parameters are set reasonably, centralization makes that asset junk in the defi space.  I am only agreeing that we should evaluate these options if the future @mmoossttaaffaa is envisioning comes to pass, as it would be more desirable solution to scaling than global settlement. I could be convinced otherwise, if someone suggest an alternative that allows for growth without compromising on decentralization. @mmoossttaaffaa, again, great work on the forward thinking.  It had not occurred to me that we would have trouble scaling MCD with quality collateral as early as 400mm DAI, although we could probably stretch that to 800mm DIA in MCD by pulling in ERC20 tokens or creating ETH collateral with more conservative risk parameters. P.S. your fingers want to type CPD, transposing CDP.   I have a similar problem when I type DAI, as there is another acronym in my life that is DIA. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.980392156862745
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#18",
                    "likes": "0",
                    "time": "25/08/2019-16:57:29",
                    "content": " Why is this a likely scenario? Why plan for it?  we can lose the peg in 2 ways: 1- Dai less than 1$, 2- Dai higher than 1$ If Dai goes less than 1$, we can simply raise the SF as much as it is required to restore the peg, however, we can’t do that when Dai goes higher than 1$ because we have limits. the limit is when we reach the SF to 0% if we haven’t restored the peg with 0% SF then we are out of options and that means failure and global settlement. that’s why I am thinking of using centralized stable coins as the last tool to prevent the possible failure Makerdao works in a way that with time it increases the possibility of losing the peg to more than 1$. That’s because of lost DAIs! every time DAI gets lost for any reason we end up with an open CDPwith no corresponding DAI in the market! in years we could end up in a scenario in which millions of DAIs has been lost and with CDP holders can’t find enough DAI in the market to pay back their loans. this systemic imbalance between supply and demand can cause losing the peg to more than 1$. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.252450980392157
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#19",
                    "likes": "0",
                    "time": "25/08/2019-17:15:17",
                    "content": " P.S. your fingers want to type CPD, transposing CDP.   I have a similar problem when I type DAI, as there is another acronym in my life that is DIA.  Thanks a lot for alerting me  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#20",
                    "likes": "0",
                    "time": "25/08/2019-17:43:19",
                    "content": "    mmoossttaaffaa:  if we haven’t restored the peg with 0% SF then we are out of options and that means failure and global settlement.   Hm, I guess there could be a mechanism to mint DAI in exchange for burning MKR.     mmoossttaaffaa:  that’s why I am thinking of using centralized stable coins as the last tool to prevent the possible failure   No way. I’d much rather burn MKR than introduce random collateral into the system. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#21",
                    "likes": "1",
                    "time": "25/08/2019-18:09:06",
                    "content": " Hm, I guess there could be a mechanism to mint DAI in exchange for burning MKR.  Dai quantitive easing! I was thinking about this in the last few days ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#22",
                    "likes": "2",
                    "time": "25/08/2019-18:44:19",
                    "content": "    psychonaut:  No way. I’d much rather burn MKR than introduce random collateral into the system.   Keep in mind, we can easily end up with extremely undesirable incentive alignment anytime we turn to MKR for something like this. Off the top of my head, MKR voters would now be incentivized to arbitrarily limit collateral and push rates to zero just to take advantage of this DAI mint MKR burn.  The extreme iteration of this would be shrinking collaterals while we exploit this mechanism to print DAI.  We also have no risk parameters or tunable knobs around this.  No way to stop us from cycling back on this mechanism as the incentives would just get more and more perverse and the risk in the system growing because of under collateralization.  Seems like we would end up with a fractional reserve and MKR holders supporting the risk in the system with flop auctions.  I haven’t fully thought this through, but it feels off to me like Terra stablecoin feels off.  Like this one mechanism would change DAI from being a collateral backed stable coin to some kind of two gear money printing machine based on nothing more than the current price of MKR. Like I said, I haven’t thought this through fully and I might be missing something?  I do applaud the attempt to keep the system decentralized though, that box is checked. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.811111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#23",
                    "likes": "0",
                    "time": "25/08/2019-19:23:21",
                    "content": "    cmooney:  We also have no risk parameters or tunable knobs around this.   It would only be a sensible thing to do if the SF and DSR are already 0% and DAI is still trading well above 1.0. That’s already a pretty extreme situation.     cmooney:  Like this one mechanism would change DAI from being a collateral backed stable coin to some kind of two gear money printing machine based on nothing more than the current price of MKR.   Yeah, which should decrease the extremely excessive trust in DAI and bring the DAI price down to 1.0. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.455246913580247
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#24",
                    "likes": "0",
                    "time": "25/08/2019-21:20:50",
                    "content": "lost DAI will probably cause an artificial imbalance between the supply and demand of DAI. I think that minting Dai in exchange for locking MKR tokens should be designed carefully to be a mechanism to compensate for the lost DAI. so newly minted DAI should practically be collateralized by the lost DAI + the locked MKR (in case we overprinted DAI) I can imagine 3 possibilities for the lost Dai problem: 1- it will be very small to the point that its effect can be neglected 2- there would be a moderate effect in which we don’t lose the peg but we have near 0% DSR and low fees that are barely cover primer risk fees and governance fees. 3- It would have a severe effect in which we lose the peg to more than 1$ even with 0% DSR and 0% SF in the 1st scenario we should just ignore the minor effect because we don’t need more unnecessary complexity in the system. in the 3rd scenario, I think that minting new DAI with correct parameters would be fairly safe the 2nd scenario would be problematic! because of the lost DAI we could have artificially strong DAI which would prevent us from raising the DSR. yes, we are still keeping the peg but we are giving away a very potent tool, the DSR, which is one of the strongest tools to grow DAI adoption. so we have 2 options here losing DSR or experimenting with a possibly dangerous game! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.107765151515151
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#25",
                    "likes": "0",
                    "time": "25/08/2019-21:34:28",
                    "content": "    cmooney:  Off the top of my head, MKR voters would now be incentivized to arbitrarily limit collateral and push rates to zero just to take advantage of this DAI mint MKR burn. The extreme iteration of this would be shrinking collaterals while we exploit this mechanism to print DAI. We also have no risk parameters or tunable knobs around this. No way to stop us from cycling back on this mechanism as the incentives would just get more and more perverse and the risk in the system growing because of under collateralization. Seems like we would end up with a fractional reserve and MKR holders supporting the risk in the system with flop auctions. I haven’t fully thought this through, but it feels off to me like Terra stablecoin feels off. Like this one mechanism would change DAI from being a collateral backed stable coin to some kind of two gear money printing machine based on nothing more than the current price of MKR.   I think MKR holders need to have 2 priorities 1- keeping the peg, 2- growing DAI adoption using “DAI quantitive easing” for any thing other than correcting the artificial imbalance (caused by the lost DAI) will harm the first or the second goal which will hurt MKR prices more than any short gains from locking some MKR tokens. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.828125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#26",
                    "likes": "0",
                    "time": "28/08/2019-17:47:24",
                    "content": "If we use a basket of centralized stable coins at SF=0% (which we can´t since we should input the risk associated) wouldn´t there be the risk of a “bad agent” minting dai through a Tether CDP and depositing it in DSR therefore maker having a net negative position? The same question comes to mind when I think of off chain assets, basically DSR should equate to the lowest SF of the safest asset to avoid the risk. If so the difference between secondary lending platforms and DSR would be too high Am I missing something here? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.042857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ginworkflow",
                    "index": "#27",
                    "likes": "0",
                    "time": "28/08/2019-21:08:47",
                    "content": "Not sure I follow what you are saying. But isn’t the reason for having a basket wrapped in a Erc20 token that you can not make a Tether cdp? It will be a usdc/tusd/usdt cdp (or something like that). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#28",
                    "likes": "0",
                    "time": "29/08/2019-11:36:10",
                    "content": "    mario:  If we use a basket of centralized stable coins at SF=0% (which we can´t since we should input the risk associated) wouldn´t there be the risk of a “bad agent” minting dai through a Tether CDP and depositing it in DSR therefore maker having a net negative position?   Yes. This would get very bad, very quickly unless we were extremely careful.     mario:  The same question comes to mind when I think of off chain assets, basically DSR should equate to the lowest SF of the safest asset to avoid the risk.   Maybe. It depends how low the lowest SF is, we need some room to move the DSR. The collateralization ratio and debt ceiling settings can help mitigate the loss from the ‘lock collateral -> lock dai in DSR’ path, but ultimately if our goal is to supply more Dai moving the SF below the DSR doesn’t fulfil that goal as the generated Dai will be locked in the DSR immediately (depending on the efficiency of the market) for profit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.461666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#29",
                    "likes": "1",
                    "time": "29/08/2019-12:50:13",
                    "content": "Technically, using volume-weighted curves for the SF or volume-weighted curves for the DSR avoids the issue of being net negative. If DSR is adjusted continuously, I wonder what the equilibrium is then? If we forget that the DSR can be a policy tool and we say it’s approximatively the result of calculating the return given by the total collateral basket of Maker, it just makes sense to have some individual SFs be below that weighted average – temporarily. If we forget about debt ceilings, I guess we will see the DSR permanently decrease ever closer to the lowest SF, until the amount of “free money” isn’t worth it anymore. And so any additional unit of riskier collateral would have a multiplier effect on the total amount of collateral in the system: by increasing the DSR it unlocks free money to be grabbed by anyone with safer assets (until DSR goes back down mechanically). I may come back later and restructure the above, I’m thinking out loud / rambling a bit too much here! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.248366013071895
                }
            ]
        }
    ]
}