{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dschief-v1-2-migration-steps/5412",
            "title": "DSChief v1.2 Migration Steps ",
            "index": 5412,
            "category": [
                "Updates"
            ],
            "tags": [
                "governance-portal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "15",
                    "time": "30/11/2020-18:22:53",
                    "content": "MakerDAO’s official voting portal will facilitate the process of voting on and migrating to the new chief contract. If Governance decides to implement the new chief, MKR holders will need to undertake the following steps for migration: 842×211 32.1 KB Calling out the individual user actions that this process requires;  Voting on a proposal to authorise the new chief and remove permissions from the old chief, Withdrawing MKR from the old chief, Depositing MKR into the new chief, and finally, Voting on the new proposal to activate the new chief.  This document will now walk through what is involved in completing these steps. Part 1: Voting on the new proposal   MKR holders vote on the Wednesday December 2nd proposal at vote.makerdao.com to authorise the new chief and remove permissions from the old chief.   MKR holders wait until the proposal receives a majority of votes and becomes the governing proposal. If this occurs, the following ‘governing proposal’ label will be displayed next to the proposal in the UI.    MKR holders continue to leave their MKR on the winning proposal and wait for the governance pause of 72 hours to pass. Once the pause has passed, the new Chief will be granted authority. MakerDAO will announce through vote.makerdao.com and RocketChat that the old Chief no longer has authority.   Part 2: Withdrawal from the old chief Once it is possible to withdraw from the old chief, the following label will become visible on the vote.makerdao.com frontpage: 943×332 58.1 KB  MKR holders will be able to withdraw MKR from the old Chief to their wallet via the withdraw button on the banner on vote.makerdao.com.  withdraw1382×286 18.9 KB  After withdrawal completes, MKR holders will see their MKR balance in their wallet.  Part 3: Depositing into the new chief  MKR holders should now deposit their MKR into the new Chief. There are two ways of doing this; either by using a single wallet or by creating a hot/cold wallet proxy for extra security. The hot/cold proxy will require the creation of a new vote proxy contract that interacts with the new chief (this allows users to keep their ‘cold’ hardware wallet offline by voting through their hot wallet - more information on this approach is described in the below 2018 blogpost).  The two options are shown below: deposit2874×678 96 KB For MKR holders choosing option 1, Depositing MKR directly into the chief contract - please complete your transaction, skip the following notes and go directly to Part 4 to vote in support of the new activation executive proposal. For MKR holders choosing option 2, Creating a vote proxy the following notes may be helpful: As mentioned above, vote proxy creation will require linking hot and cold wallets together by creating a new vote proxy contract, this will require users to complete a wallet linking flow. It is expected behaviour to be redirected to v1.vote.makerdao com/proxysetup before voting. For more information about this option, please see 2018 Blog: The MakerDAO Voting Proxy Contract. When creating your proxy through the proxy creation flow, it is possible to do so without depositing MKR into the proxy. If you create the proxy without depositing, you will see the following banner asking you to deposit before continuing to vote: deposit11379×283 17.9 KB If you successfully created your proxy and also deposited MKR into the vote proxy as part of the proxy creation flow, you will see the following banner along with the amount of MKR deposited below it: deposit21378×281 16.6 KB Now that the user has deposited MKR either directly into the chief or into the vote proxy contract, it is necessary to complete the final step of migration - voting on the executive that activates the new chief. Part 4: Voting to activate the new chief  The activation proposal will appear in the UI as a typical executive proposal, and will be no different to how governance members vote today. It is however very important that participants place their MKR in support of this proposal to ensure that the new chief is not only authorised but also activated to interact with the Maker protocol.  vote1970×572 52.4 KB Once the activation proposal has 80,000 MKR in support, it can be passed, completing the activation of the new Chief. Edit: adding the G&R call where we walked through the UX: https://youtu.be/gadMkrlm5dY?t=3042 ",
                    "links": [
                        "http://vote.makerdao.com",
                        "http://vote.makerdao.com",
                        "http://vote.makerdao.com",
                        "https://blog.makerdao.com/the-makerdao-voting-proxy-contract/",
                        "https://youtu.be/gadMkrlm5dY?t=3042",
                        "https://forum.makerdao.com/t/weekly-sourcecred-distribution-payout-increase/5546",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-120-thursday-december-3-16-00-utc/5357/3",
                        "https://forum.makerdao.com/t/badges-are-live-in-the-maker-forum/4503/38",
                        "https://forum.makerdao.com/t/dschief-v1-2-pasos-de-la-migracion-autor-original-derek/5507",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/7",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-120-thursday-december-3-16-00-utc/5357/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-24/5534"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.478344832251082
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "0",
                    "time": "30/11/2020-18:23:39",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "0",
                    "time": "02/12/2020-15:40:50",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#5",
                    "likes": "1",
                    "time": "03/12/2020-16:59:52",
                    "content": "I think the small MKR holders are better off withdrawing from the old chief when the gas price is low (<30 Gwei?) than waiting for the suggested period when the fees could be $10+  (@ 70 Gwei gas). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#6",
                    "likes": "2",
                    "time": "03/12/2020-17:41:16",
                    "content": "@bit , yes! definitely important to keep an eye on gas prices, however just a friendly reminder that it is critical to make sure that the old chief maintains its amount of MKR until after the delay is passed at which point the old chief looses its permissions. Similarly, the new chief will not be activated until the activation proposal exceeds 80,000 MKR. Looking forward to everyone participating, we’re almost there  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0071022727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/shane",
                    "index": "#7",
                    "likes": "0",
                    "time": "03/12/2020-17:52:32",
                    "content": "Is it possible to migrate funds without having to send a transaction from the cold wallet of an existing proxy? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#8",
                    "likes": "3",
                    "time": "03/12/2020-18:19:32",
                    "content": "No, that would violate the vote proxy’s main security feature, which is that it can do only 2 things: let you vote with your hot wallet, or send your MKR back to the cold wallet. If it were to allow sending of your MKR to a new contract with the hot wallet, that would mean you can steal that MKR with access to the hot wallet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.07807239057239
                },
                {
                    "author_link": "https://forum.makerdao.com/u/shane",
                    "index": "#9",
                    "likes": "0",
                    "time": "03/12/2020-18:22:47",
                    "content": "Thank you! How often would you expect a migration like this to be happen? More specifically, how often would you expect a required transaction from a cold wallet? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#10",
                    "likes": "1",
                    "time": "03/12/2020-18:38:47",
                    "content": "That’s hard to predict as it depends entirely on which system changes are voted in by governance when, although the goal would of course be to keep it to the minimum. With the current rate of change, I’d say maybe once or twice a year, if I had to guess. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.513888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jason",
                    "index": "#11",
                    "likes": "0",
                    "time": "03/01/2021-17:08:17",
                    "content": "How do you get Metamask to show your new chief balance of MKR? As soon as you deposit MKR into the new chief, Metamask doesn’t see it anymore. Do we need to add a new custom token to our Metamask wallet? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#12",
                    "likes": "0",
                    "time": "03/01/2021-18:02:19",
                    "content": "@Jason this question is better asked here https://chat.makerdao.com/channel/help and yes - sometimes you need to add the MKR token in Metamask. Other times it just pops up after a while. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Northwest_Chefs",
                    "index": "#13",
                    "likes": "0",
                    "time": "12/01/2021-15:13:18",
                    "content": "I’m new here and I haven’t deposited any MKR onto the old chief so I should just wait correct? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.590909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#14",
                    "likes": "0",
                    "time": "12/01/2021-16:23:02",
                    "content": "Hello @Northwest_Chefs welcome .  It depends on what you want to do - if you want to simply hold the MKR token, leaving it in your wallet is fine, otherwise, if you would like to participate in Governance voting you can visit vote.makerdao, where you can either vote directly or setup a proxy contract through which to participate. No need to wait for the Chief migration which we completed in December. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.645833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Northwest_Chefs",
                    "index": "#15",
                    "likes": "1",
                    "time": "12/01/2021-21:01:29",
                    "content": "Thanks Derek, I would like to participate in governance but I will probably wait till the new chief system is in place.  Currently I have right around 19.9 maker.  I have been crusing around the website, blog, YouTube, etc.  I am interested in joining a group that promotes and educates people about MKR.  Could you point me in that direction? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.872077922077922
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#16",
                    "likes": "0",
                    "time": "13/01/2021-03:13:32",
                    "content": "Hey @Northwest_Chefs - the new Chief has been up for a while now, this is an old thread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.590909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Anna",
                    "index": "#17",
                    "likes": "5",
                    "time": "13/01/2021-18:40:54",
                    "content": "Hey @Northwest_Chefs! I’m part of a working group focusing on governance communication and other community generated resources, like Community Development Portal. There’s currently a declaration of intent to formalize this group further. Feel free to reach out to me here and on rocket chat at annaalexak to learn more ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp7-governance-communications-declaration-of-intent/5028/13"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#18",
                    "likes": "0",
                    "time": "18/01/2021-11:48:05",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#19",
                    "likes": "0",
                    "time": "19/04/2021-17:48:07",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}