{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip41c4-sp18-facilitator-onboarding-for-the-dai-foundation-core-unit/9236",
            "title": "MIP41c4-SP18: Facilitator Onboarding for the Dai Foundation Core Unit ",
            "index": 9236,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "dai-foundation",
                "daif-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#1",
                    "likes": "9",
                    "time": "07/07/2021-22:30:40",
                    "content": " MIP41c4-SP18: Facilitator Onboarding for the Dai Foundation Core Unit  Preamble MIP41c4-SP#: 18 Author(s): @sorenpeter   Contributors: @juanjuan Tags: dai-foundation, core-unit, daif-001, facilitator Status: Formal Submission (FS) Date Applied: 2021-07-07 Date Ratified: YYYY-MM-DD   Sentence Summary MIP41c4-SP18 onboards Søren Peter Nielsen as Facilitator for the Dai Foundation Core Unit.  Motivation I have been the formal touchpoint between the Dai Foundation board and Governance. This subproposal intends to formalize this link. I am motivated by enabling software solutions that  Support access to financial services for everyone on equal terms Implement programmable money – the internet unleashed huge value by connecting producer and consumer without middlemen in most industries, but not so much for payments and financial services  I am convinced that technologies and concepts like decentralization, cloud, IoT, social, mobile, open data – and notably the Maker Protocol - can change the way we live, work and play, and I’m convinced that working with skilled, motivated people makes the difference. I recognize that no team/unit can act as an island in our global world, and I have past experience of creating results while working with a complex ecosystem of stakeholders.  Facilitator Commitment The following describes my commitment and actions as the Dai Foundation Core Unit Facilitator, to:  Serve as a point of contact between the Dai Foundation board, the Governance-appointed Maker Asset Use Coordinator, the Governance Community and other facilitators to ensure a cohesive understanding of team deliverables and progress. Represent the Dai Foundation Core Unit  Work with the Community to:  Enable access to Maker intellectual property for the good of the protocol, as frictionless as possible, and evolve the current trademark policy as needed Create awareness of the importance of passing copyright for new Maker intellectual property deliverables to Dai Foundation for safekeeping Foster a good dialogue with the community around the  principles to apply for the safeguarding of the trademarks in case of forks of the protocol   Ensure Dai Foundation representatives are active on the Maker Forum and available as points of contact   Make sure the Dai Foundation board is aware of all relevant developments in the Maker Governance Community   Core Unit Dai Foundation Core Unit  Facilitator Name and Information  Name: Søren Peter Nielsen  Forum handle: @sorenpeter  Discord handle: sorenpeter#2928    Facilitator Credentials  Experience at Maker  Joined Maker Foundation in January 2018 as Head of Product Helped scale the product development organization fast in 2018 Built Product Management team and provided product support for the MCD development Focused on applications utilizing the Maker Protocol post-MCD: Oasis, Token Flow, Decentralized exchange projects, real-world asset projects   Experience prior to Maker  Danish Cleanweb community lead (The Cleanweb non-profit initiative aimed at helping entrepreneurs, innovators, and enterprises leverage information technology to drive massive improvements in global sustainability, economic prosperity, and human well-being.) Approx. 8 years of work in startups in areas of consumer IoT, Industrial IoT, Critical Infrastructure security Worked 8 years for the Danish Government  Established Public Sector architecture process Built shared services, notably in federated identity Published discussion paper about new digital security models  Introduced cloud computing to the public sector Very much involved in the SAML standardization and other cross national IT initiatives   Prior to the above worked 20 years for IBM building solutions across a wide number of industries   Related Documents  MIP39c2-SP18 Dai Foundation Core Unit MIP MIP40c3-SP18 Dai Foundation Core Unit Budget Proposal  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp18-adds-core-unit-daif-001-dai-foundation/9239",
                        "https://forum.makerdao.com/t/mip40c3-sp18-modify-dai-foundation-core-unit-budget/9238",
                        "https://forum.makerdao.com/t/weekly-mips-update-47/9648",
                        "https://forum.makerdao.com/t/weekly-mips-update-46/9532",
                        "https://forum.makerdao.com/t/weekly-mips-update-45/9427",
                        "https://forum.makerdao.com/t/mip40c3-sp74-modify-dai-foundation-core-unit-budget-daif-001/16379",
                        "https://forum.makerdao.com/t/mip40c3-sp24-modify-dai-foundation-core-unit-budget/9238",
                        "https://forum.makerdao.com/t/mip39c2-sp17-adds-core-unit-daif-001-dai-foundation/9239",
                        "https://forum.makerdao.com/t/weekly-mips-update-44/9303"
                    ],
                    "GPT-summary": "The post is a formal submission of a proposal, MIP41c4-SP18, which onboards Søren Peter Nielsen as Facilitator for the Dai Foundation Core Unit. The author explains the motivation behind the proposal, which is to formalize the link between the Dai Foundation board and Governance, and describes the commitment and actions of the Dai Foundation Core Unit Facilitator. The post also includes related documents and information about the author's credentials. A 3rd party could give entirely positive feedback on the proposal, constructive criticism, or ask questions about it.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.661605415860736
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "08/07/2021-00:22:53",
                    "content": "Sounds good Soren! Hope to have you around with the Maker Community for many years. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ElSalvador",
                    "index": "#3",
                    "likes": "2",
                    "time": "08/07/2021-00:49:06",
                    "content": "Thanks for sharing so much detail about your professional experience, it cements the confidence to support your request by knowing that you bring so much value to task ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#4",
                    "likes": "2",
                    "time": "03/08/2021-21:39:00",
                    "content": "I want to formally submit MIP41c4-SP18 Thanks ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#5",
                    "likes": "1",
                    "time": "06/08/2021-14:16:13",
                    "content": "Updated MIP41c4-SP18: Status > Formal Submission @sorenpeter @juan ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}