{
    "poll_list": [
        {
            "title": "Should we add MATIC to the Maker Protocol? - June 22, 2020",
            "index": "2570",
            "option": "No",
            "supporting_mkr": "17,223",
            "highest_fraction": 0.81
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/matic-mcd-application-matic-network/2570",
            "title": "[MATIC] - MCD Application (Matic Network) ",
            "index": 2570,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "matic"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Sandeep_Nailwal",
                    "index": "#1",
                    "likes": "8",
                    "time": "19/05/2020-21:00:40",
                    "content": "Dear All, On behalf of Matic Network community, I would like to submit the application for MATIC token to be accepted as one of MCD collaterals. I am attaching the filled up form in a google doc with all the required details. Form Questions: 1. Who is the interested party for this collateral application?  The interested party here is the Matic foundation Representative from Matic Network is Sandeep Naliwal (Co-founder & COO of Matic Network).  2. Provide a brief high-level overview of the project, with a focus on the applying collateral token.  Matic Network is a Layer 2 scaling solution that aims to provide a generalized Layer2 platform which offers various Layer2 approaches over any Layer1 blockchain to developers to scale their apps for large scale usage. As a first, Matic has launched its Hybrid POS+Plasma sidechains which is already picking up huge traction making Matic one of the fastest growing Dapp platforms in the space. Matic’s key strengths are:  An elegant architecture which has separates Validation layer from execution (eg EVM for Hybrid POS+Plasma chains) Transactions secured by various L2 technologies like Plasma,OR’s Zero effort deployment for existing Ethereum programmers Extremely low-cost transactions High throughput Fast (~1second) confirmation times    Utility - MATIC is the utility token of Matic Network, which has a range of use cases including: participating in the Proof-of-Stake consensus, paying network transaction fees. Additional utilities might include, but not limited to, securing P2P loans (via Constant) and as a payment mechanism on multiple external platforms (Ankr and Play Royal).  Market Volumes - Matic is frequently the top 5 volume altcoins on Binance, and has been the no. 1 volume coin on the world’s largest crypto exchange being ahead of even Ethereum.  Liquidity - Many studies have also said that the actual liquidity on Matic is in the top 25 assets in the space which makes it a very significant candidate for the collateral  Community - Matic Network, even though only 1 year into its public listing already has one of the largest and most loyal communities in space. This can easily be verified via Matic’s twitter handle @maticnetwork or Telegram group @maticnetwork . Matic also regularly features as the topmost assets in terms of social engagement. Matic is backed by Coinbase Venture & Binance  Market Availability - Matic is listed in almost 25 exchanges including top exchanges like Binance, Poloniex, Coinone providing it ample liquidity and potentially reliable pricefeeds. Many other big exchanges are considering listing Matic and others like Binance US have publicly declared intention to list Matic post it’s mainnet.  3. Provide a brief history of the project.  Matic team has been making valuable contributions to the Ethereum ecosystem for a long time, even before it’s public surfacing as Matic Network. This includes working on implementations of Plasma MVP, developing the WalletConnect protocol and the Ethereum event notification engine Dagger. After securing Seed Round funding from Coinbase Ventures, Matic successfully successfully held it’s IEO on Binance in April 2019. In terms of development progress, Matic has previously launched it’s testnet, Alpha-mainnet and Beta-mainnet, and it’s full mainnet, along with staking, is going live by end of may. Along it’s journey Matic has attracted a great deal of attention from the industry, which reflects in it’s adoption rates - there are currently more than 50 DApps building on Matic Network already. This figure is increasing every week. MATIC token has now been listed over 25 exchanges globally, and is trading against more than 40 base pairs. MATIC token has seen unprecedented volumes for a token with it’s size of market capitalization, with volumes consistently surpassing that of many top-30 coins by market cap.  4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  Whitepaper: https://whitepaper.matic.network/  Litepaper: https://matic.network/matic-litepaper.pdf   Documentation  Blockchain basics: https://docs.matic.network/docs/home/new-to-matic  App development on Matic: https://docs.matic.network/docs/develop/getting-started  Validators: https://docs.matic.network/docs/validate/basics/validator  Integration with Matic: https://docs.matic.network/docs/integrate/quickstart   Relevant Ethereum addresses  MATIC token smart contract: https://etherscan.io/token/0x7d1afa7b718fb893db30a3abc0cfc608aacfebb0  Vesting contract: https://etherscan.io/address/0xcbfe11b78c2e6cb25c6eda2c6ff46cd4755c8fca  Foundation contract: https://etherscan.io/address/0xb316fa9fa91700d7084d377bfdc81eb9f232f5ff  Marketing & Ecosystem: https://etherscan.io/address/0xccb04768f3abcf1af1e749085ef67d8ec7c5fdd2  Network mining & seeding: https://etherscan.io/address/0x50d669f43b484166680ecc3670e4766cdb0945ce   Matic Network Code Repositories Root Chain Contract    GitHub    maticnetwork/contracts Smart contracts comprising the business logic of the Matic Network - maticnetwork/contracts      Predicate Contract    GitHub    maticnetwork/contracts Smart contracts comprising the business logic of the Matic Network - maticnetwork/contracts      Childchain Contracts    GitHub    maticnetwork/contracts Smart contracts comprising the business logic of the Matic Network - maticnetwork/contracts      Staking Contracts    GitHub    maticnetwork/contracts Smart contracts comprising the business logic of the Matic Network - maticnetwork/contracts      StakeManager Contracts    GitHub    maticnetwork/contracts Smart contracts comprising the business logic of the Matic Network - maticnetwork/contracts      ValidatorRewards    GitHub    maticnetwork/contracts Smart contracts comprising the business logic of the Matic Network - maticnetwork/contracts      Heimdall (Validator Layer)    GitHub    maticnetwork/heimdall Validator node for Matic PoS  layer. Contribute to maticnetwork/heimdall development by creating an account on GitHub.          GitHub    maticnetwork/heimdall Validator node for Matic PoS  layer. Contribute to maticnetwork/heimdall development by creating an account on GitHub.          GitHub    maticnetwork/heimdall Validator node for Matic PoS  layer. Contribute to maticnetwork/heimdall development by creating an account on GitHub.          GitHub    maticnetwork/heimdall Validator node for Matic PoS  layer. Contribute to maticnetwork/heimdall development by creating an account on GitHub.      Bor (Execution Layer)    GitHub    maticnetwork/bor Official repository for the Matic Blockchain. Contribute to maticnetwork/bor development by creating an account on GitHub.         github.com/maticnetwork/bor         Merge pull request #52 from maticnetwork/dev-roothash            committed 11:47AM - 06 May 20 UTC               jdkanani             +199 -5       new: Add bor.getRootHash(start, end) api method (MAT-1302)       5. Link any available audits of the project. Both procedural and smart contract focused audits.  Smart contract audit: https://medium.com/nomic-labs-blog/matic-network-security-audit-report-c3b2e9d5dcc4    6. Link to any active communities relating to your project.  Telegram global community: https://t.me/maticnetwork  Telegram announcement channel: https://t.me/maticnetwork_announcements  Twitter: https://twitter.com/maticnetwork  Facebook: https://www.facebook.com/maticnetwork/  Reddit: https://www.reddit.com/r/maticnetwork/    7. How is the applying collateral type currently used? MATIC is the utility token which powers Matic Network, and has a range of use cases:   Participating in the PoS consensus mechanism   Paying for transaction fees (gas) on the Matic network sidechains   Other secondary utilities like Lending, collaterals, NFT sales etc. The popularity of MATIC token has attracted interest from third parties which have integrated MATIC into their respective platforms. Additional use cases therefore include:   Securing P2P loans (via Constant)   Payment mechanism on external platforms (Ankr and Play Royal)   Matic used for NFT and in-app game purchase   Some teams, Binance Labs backed and KuCoin Listed have   8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in?  Matic Network (BVI) Ltd is the issuer of Matic Token It resides in British Virgin Islands (BVI)  9. Where does exchange for the asset occur? MATIC token has been listed on over 25 exchanges, and is trading against more than 40 base pairs. Exchanges include: Binance, Poloniex, Coinone, BitMax, Bitrabbit, Bilaxy, TOKOK, BitMart, WhiteBIT, BitForex, CoinEx, Omgfin, DCoin, BW, WazirX, CEX.IO, FatBTC, Bitrue, HitBTC and Binance DEX. Matic is also listed on Coinbase Custody 10. (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. Matic has a legal opinion from it’s legal counsels from Singapore. 11. (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. Not Applicable 12. (Optional) List any possible oracle data sources for the proposed Collateral type. None as of Now. Tellor, Chainlink, Band Protocol, Coinbase Oracle might support Matic as collateral in the short term. Matic team is already working with most of these teams in various forms. 13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type Matic team hasn’t discussed this with any of it’s partners. Additional Question which we think should be a part of the form: What are the risks with using this asset as an MCD collateral Matic being an altcoin is still fairly volatile. Though it’s volatility has slightly reduced off late but Matic had a major price bump in early December when in one day Matic’s price crashed 70% in a matter of few minutes. This, as per one particular unsubstantiated theory, was caused by some large & unknown market actors  taking advantage of it’s small market cap in those early days of it’s existence but yet having Futures and Margins markets enabled for it. It is speculated that these market actors took large short positions on futures markets and sold heavily on spot markets thereby profiting from their leveraged positions. This was resolved by requesting various exchanges to reduce the amount of tokens available on margins and since then such instances have not occurred on Matic’s markets and it’s volatility has moved in correlation to the overall crypto markets but the liquidity and market volumes on MATIC have remained intact. ",
                    "links": [
                        "https://www.ankr.com/",
                        "https://playroyal.com/",
                        "https://whitepaper.matic.network/",
                        "https://matic.network/matic-litepaper.pdf",
                        "https://docs.matic.network/docs/home/new-to-matic",
                        "https://docs.matic.network/docs/develop/getting-started",
                        "https://docs.matic.network/docs/validate/basics/validator",
                        "https://docs.matic.network/docs/integrate/quickstart",
                        "https://etherscan.io/token/0x7d1afa7b718fb893db30a3abc0cfc608aacfebb0",
                        "https://etherscan.io/address/0xcbfe11b78c2e6cb25c6eda2c6ff46cd4755c8fca",
                        "https://etherscan.io/address/0xb316fa9fa91700d7084d377bfdc81eb9f232f5ff",
                        "https://etherscan.io/address/0xccb04768f3abcf1af1e749085ef67d8ec7c5fdd2",
                        "https://etherscan.io/address/0x50d669f43b484166680ecc3670e4766cdb0945ce",
                        "https://github.com/maticnetwork/contracts/tree/master/contracts/root",
                        "https://github.com/maticnetwork/contracts/tree/master/contracts/root",
                        "https://github.com/maticnetwork/contracts/tree/master/contracts/root/predicates",
                        "https://github.com/maticnetwork/contracts/tree/master/contracts/root/predicates",
                        "https://github.com/maticnetwork/contracts/tree/master/contracts/child",
                        "https://github.com/maticnetwork/contracts/tree/master/contracts/child",
                        "https://github.com/maticnetwork/contracts/tree/master/contracts/staking",
                        "https://github.com/maticnetwork/contracts/tree/master/contracts/staking",
                        "https://github.com/maticnetwork/contracts/tree/master/contracts/staking/stakeManager",
                        "https://github.com/maticnetwork/contracts/tree/master/contracts/staking/stakeManager",
                        "https://github.com/maticnetwork/contracts/tree/master/contracts/staking/validatorShare",
                        "https://github.com/maticnetwork/contracts/tree/master/contracts/staking/validatorShare",
                        "https://github.com/maticnetwork/heimdall",
                        "https://github.com/maticnetwork/heimdall",
                        "https://github.com/maticnetwork/heimdall/tree/sidechannel",
                        "https://github.com/maticnetwork/heimdall/tree/sidechannel",
                        "https://github.com/maticnetwork/heimdall/tree/heimdall-slashing",
                        "https://github.com/maticnetwork/heimdall/tree/heimdall-slashing",
                        "https://github.com/maticnetwork/heimdall/tree/delegation",
                        "https://github.com/maticnetwork/heimdall/tree/delegation",
                        "https://github.com/maticnetwork/bor",
                        "https://github.com/maticnetwork/bor",
                        "https://github.com/maticnetwork/bor/commit/27f9dbd14fd6b6577959812d248ced73854da238",
                        "https://github.com/maticnetwork/bor/commit/27f9dbd14fd6b6577959812d248ced73854da238",
                        "https://github.com/jdkanani",
                        "https://github.com/maticnetwork/bor/commit/27f9dbd14fd6b6577959812d248ced73854da238",
                        "https://medium.com/nomic-labs-blog/matic-network-security-audit-report-c3b2e9d5dcc4",
                        "https://t.me/maticnetwork",
                        "https://t.me/maticnetwork_announcements",
                        "https://twitter.com/maticnetwork",
                        "https://www.facebook.com/maticnetwork/",
                        "https://www.reddit.com/r/maticnetwork/",
                        "https://www.myconstant.com/",
                        "https://www.ankr.com/",
                        "https://playroyal.com/",
                        "http://CEX.IO",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/18",
                        "https://forum.makerdao.com/t/matic-erc20-token-smart-contract-technical-assessment/9140"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Interoperability and Scalability",
                        "Smart contract updates"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.634592416512058
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "19/05/2020-21:31:09",
                    "content": "Hi @Sandeep_Nailwal, thanks for the application. Would you mind just pasting the text of the application directly into the forum post? It just makes it a little easier to interact with, and follows the convention that other applications have used. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.984375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sandeep_Nailwal",
                    "index": "#3",
                    "likes": "2",
                    "time": "20/05/2020-11:42:41",
                    "content": "Thanks for the guidance! Have now updated the form details on the forum post itself. Let me know if anything else is required. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-6/2914"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vishalhkothari",
                    "index": "#4",
                    "likes": "0",
                    "time": "23/06/2020-15:56:30",
                    "content": "There is no doubt about the success of the Matic Network being solving problems regarding scalability in the Crypto world. Matic Network is ready to use tool for mass adoption and Decentralised Finance (DeFi) for sure. Best wishes to Matic. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dr_dent18",
                    "index": "#5",
                    "likes": "0",
                    "time": "23/06/2020-16:02:30",
                    "content": "Would be an amazing addition to the maker collaterals… looks like maker can also utilise Matic tech for faster and cheaper transactions… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#6",
                    "likes": "6",
                    "time": "23/06/2020-17:51:41",
                    "content": "If you guys from the MATIC community want to contribute meaningfully to the conversation, be aware that the Maker community is primarily looking for the following qualities in collateral:  Uncorrelated with major cryptocurrencies Large marketcap Lots of demand for credit using that collateral. As decentralized as possible.  I’m not sure that any asset hits all four of these. If you wanted to make arguments for why MATIC would be good to onboard based on one or more of these reasons, please go ahead. Brigading without providing meaningful reasons as to why MATIC should be prioritised is not particularly useful signal, and is unlikely to help the case for onboarding MATIC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.856456043956044
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#7",
                    "likes": "5",
                    "time": "28/04/2021-00:15:54",
                    "content": "I think with Polygon (formerly Matic, still the same MATIC token) may be worth more consideration. The ecosystem is starting to see large scale adoption with AMMs, farming, and an Aave money market deployment. The market cap has also increased considerably since the applications was made - from less than $100M in May 2020 to over $5B currently (and comfortably over $1B even before the recent price increase). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.612554112554112
                }
            ]
        }
    ],
    "group_index": "2364"
}