{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/pecu-2021-2022-financial-year-in-review/13793",
            "title": "PECU 2021 - 2022 Financial Year in Review ",
            "index": 13793,
            "category": [
                "Core Units",
                "Protocol Engineering"
            ],
            "tags": [
                "update",
                "pe-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "5",
                    "time": "09/03/2022-22:46:10",
                    "content": " PECU 2021 - 2022 Financial Year in Review In order to request budget renewal for 2022 - 2023, Protocol Engineering has undertaken a review of the prior year’s budget allocation. The purpose of this is to determine the accuracy of our initial request and therefore to better help define our proposed allocation going forward. We welcome comments and questions on any of the below.  Protocol Engineering Accomplishments The past year has witnessed an amazing evolution from a centralized Foundation to a truly decentralized DAO. Along this journey, Protocol Engineering has grown upon it’s prior successes by maintaining and extending the protocol in a safe and secure manner. This has included extensive research and development across L2 ecosystems, developments in formal verification, and the weekly core protocol operations that have introduced new modules and kept the protocol optimally tuned. These accomplishments have been transparently communicated on a monthly basis and are all present on the forum and so will not be elaborated upon here. Instead, this post will break down the costs and expenses to summarize our expenditure throughout the past year.  2021 - 2022 Expenditure Summary Taking into account actuals from May 2021 to February 2022, and forecasts for March and April 2022, Protocol Engineering’s annual budget of $6.1M was a sensible and fairly accurate bottom line estimation in the early days of the DAO.  774×376 67.2 KB  Auditor expenses, gas costs and 3rd party contractors for tooling & QA came in over budget mostly due to extending our retainers to ensure continued support. On the other hand we didn’t grow the team as much as initially intended, which brought us in under budget for personnel related expenditures. Overall, the core unit is expected to come in approximately $130k under budget. Further explanation as to each line item shall be given below.  Monthly Cost Breakdown The following image shows expense distribution over the year. Apart from the team’s initial ramping up and a rather large auditor retainer payment in January, we hovered around the intended 510k p/month DAI allocation.  1259×664 52.1 KB   Description of Each Budget Category To provide clarity for where funds have been spent, the following illustrates further detail for each budget category;  Employee Salaries & Healthcare Protocol Engineering grew from an initial team of 9 fulltime team members to its current total of 14 individuals. Further team growth to a headcount of 16 was initially considered, yet was delayed as we focused on the evolution of the L2 landscape, our team culture, development processes and the interactions of different engineering teams in Maker. Our upcoming proposal will provide more detail around scaling to meet the DAO’s needs. The following diagram helps to illustrate where people resources were spent (does not include consideration for tooling etc).  Area of Focus722×448 21 KB  A quick note on Healthcare - we maintained a two-tier system; those in the US, and those not in the US to accomodate for respective healthcare costs.  Events & Travel While initially hesitant to travel due to Covid19, the team quickly reaped the benefits of sharing travel opportunities by meeting face to face with a variety of external teams. This engagement with others in the DeFi space directly contributed to launching the Optimism and Arbitrum DAI bridges, our GUNI integration and 3rd party Keeper integrations. Coverage included EthParis, Lisbon, EthDenver, Harvard Blockchain Week and EthAmsterdam. Despite having helped fund MakerDAO events in Lisbon and Denver, we ended the year under budget because there was limited travel during the first half of the year.  Contract Deployment/Gas The previous year saw gas prices spike and remain high for long periods of time. This meant that our ETH purchases for contract deployments were $90k greater than expected. Typically we attempt to mitigate this by purchasing ETH when the price is low, and always retain at least 10-20 ETH on hand in the event we need to deploy contracts during a congestion event. At the time of writing we hold 15 ETH in the team multisig for the deployer addresses.  3rd party Contractors / SC Verification & QA The team worked with a variety of 3rd party tooling providers to ensure that smart contracts operate within the bounds of formal correctness and adhere to defined security rules. 3rd parties have included; Certora, Runtime Verification, Blockscience and Tenderly. This budget category was our largest under-budgeted cost driver due to our agreement to extend formal verification initiatives. There are active initiatives underway to opensource the work being completed and to reduce the ongoing cost.  Auditor costs MakerDAO Smart Contracts have been audited by either ChainSecurity and/or ABDK. Due to the increased difficulty in securing auditor bandwidth, Protocol Engineering has secured a retainer with ChainSecurity to ensure we and others within the Maker community have ongoing access to auditors. As the market demand for auditors has increased so has the cost, which is reflected in the above.  Hardware expenses The team runs a variety of archive and full nodes to assist in contract testing and deployment. Hardware costs were marginally lower than budgeted due to not filling the additional 2 headcount, as well as difficulty in acquiring hardware specs in certain parts of the world.  Contingency Buffer & The Emergency Fund In the original proposal, a contingency buffer of $297k was included to provide cover for unplanned costs. We deemed this to be a risky amount to hold in the monthly multisig and so moved $200k to the Emergency multisig in July 2021 as we were still ramping up the team. This buffer was helpful to have on-hand in the event we needed to cover short-term cashflows (software 3rd parties/contractors). As will be discussed in our upcoming budget proposal, all outstanding budget funds from the monthly multisig will be returned to the protocol at the end of April 2022.  Legal/Accounting & General Operating Expenses Legal advice and consultancy, entity registration fees and financial reporting. This came in just under budget as we did not pursue additional accounting services to manage team payments as these were kept in-house.  Referral & Sign-on Bonus Only one referral bonus was paid during this period as all other hires were sourced through direct contact and discussion.  Bug Bounty No smart contract bugs were claimed as part of any bug bounty program, so the $100k added to our end of year surplus. This line item will be discontinued in the new financial year as responsibility now lies with the Immunefi Core Unit.  Conclusion Despite having both under and over budgeted a number of individual items, overall Protocol Engineering ended the year on budget. The team has learnt a lot with regards to operating efficiently in a new DAO environment which has given us insight into how we can better structure and budget for the upcoming financial year that we look forward to sharing in our future budget proposal request. As always, there is a lot that can be elaborated on here, if you have questions please either DM me or ask openly in the forum, thank you. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp68-modify-protocol-engineering-core-unit-budget-pe-001/13797",
                        "https://forum.makerdao.com/t/weekly-mips-update-83/14673",
                        "https://forum.makerdao.com/t/weekly-mips-update-82/14570",
                        "https://forum.makerdao.com/t/weekly-mips-update-84/14786",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-march-2022/14712"
                    ],
                    "GPT-summary": "Protocol Engineering has reviewed its budget allocation for the 2021-2022 financial year and provided a detailed breakdown of its expenditure. The post explains the accomplishments of the past year, the costs and expenses incurred, and the monthly cost breakdown. The author invites comments and questions on the post. The breakdown includes details on employee salaries and healthcare, events and travel, contract deployment/gas, 3rd party contractors/SC verification and QA, auditor costs, hardware expenses, contingency buffer and the emergency fund, legal/accounting and general operating expenses, referral and sign-on bonus, and bug bounty.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.289426093230442
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "07/06/2022-22:46:29",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/dicu-2021-2022-financial-year-in-review/13961",
            "title": "DICU 2021 - 2022 Financial Year in Review ",
            "index": 13961,
            "category": [
                "Core Units",
                "Data Insights"
            ],
            "tags": [
                "din-001",
                "financial-report"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#1",
                    "likes": "6",
                    "time": "16/03/2022-14:24:05",
                    "content": " Data Insights CU 2021 - 2022 summary In order to request the budget renewal for 2022 - 2023, Data Insights Core Unit (DIN-001, DICU, @data-insights-cu) we present the review of the current 6 month budget allocation (4 out of 6 have elapse a the time of writing). The purpose of this is to determine the accuracy and effectiveness of our initial request and therefore to better help define our proposed allocation going forward. We welcome comments and questions on any of the below. We have made use of the structure that Derek and PECU prepared for their own review, we appreciate their work. We will expand the section of “Core Unit Accomplishments” to better informing the community when it comes to the Request For Comment (RFC) stage of our updated mandate and budget.  Core Unit Accomplishments The Data Insights Core Unit was established to continue the work of the Data team at the Foundation. The initial mandate and budget were revised to focus on validating the value that such CU can provide to the protocol. Here you can find the supporting documentation:  Initial motivation for the CU 2021 - 2022 MIP Mandate 2021 - 2022 MIP Budget Public Roadmap   Datasets The core of our work is the creation and maintenance of datasets that are complete, decoded, clean and contextualised. A main challenge we solve for the community is abstracting away the complexities of querying the blockchain directly. We cover different domains and perspectives. Our main datasets:  Vaults Liquidations (collateral auctions) Surplus auctions Governance votes Governance delegates Protocol parameters  We’re open to build any dataset to empower the community, we encourage anyone to reach out to us. Different perspectives (or views) of the same dataset enable users more direct access to insights. For example, when it comes to querying the Data API for vault data you can:  Get vault actions  Get vault ownership (including origin, such as “DeFiSaver”) Get all vaults historical daily snapshot Get vault’s snapshot at a specific block/time   Data Delivery method In order to make data accessible to everyone, regardless of technical and domain knowledge, we provide access to our datasets through a variety of methods:  API GUIs & Dashboards Google Drive Database shares   API We built a Data API service using a popular python framework called FastAPI. We are constantly updating it, while striving to keep all endpoints well documented with request & response examples. The Data API can be used in a variety of ways, accessing data via a jupyter notebook to perform analyses, as well as using it as a backend service to populate a web-app. Registration is open to everyone, no permission is required. We apply rate limiting so if you require a higher threshold please get in touch with us.  Dashboards For easy digestion of data, particularly for casual users, we have built two web-apps to track Vaults and Governance votes. The data displayed is easy available for download via the UI itself. We have recently added the end-of-day historical snapshots of vaults and the historical change of protocol parameters. We have also been creating dashboards to aid reporting and analyses, particularly Google Data Studio for the Delegates Compensation and Tableau Public for the Governance Overview and Flapper Keeper Activity.  Google Drive We currently provide datasets and analyses through spreadsheets, making it easy for functional stakeholders to interact with them. We can provide any dataset via this method upon request, automatically refreshed.  Database shares We provide access to our hosted database through a “share” feature and read only user roles. This allows users with Snowflake accounts to access data directly using SQL, skipping the API. We want to go further and provide our datasets on the Snowflake Marketplace, thereby allowing anyone to consume our data in a permissionless manner. Related to this, we are looking into tools such as Redash to allow users to access our data using SQL without the need of a Snowflake account.  DAO collaboration We value the benefit of collaborating with stakeholders across the protocol, we have had a special focus on Core Unit collaboration this past period. Aligned with the mission of empowering the entire community, we view our work with other CUs as two fold, it allows to magnify our impact through them and also serves as a experimentation ground for the needs across the community. Below is a selection of the collaboration in this past period: - GovAlpha - Backend for Protocol Parameters UI - Data feed for Delegate Compensation - Analysis of Ranked Polls behaviour - Growth - Reporting metrics for Quarterly Strategy Review - Risk - Data provision through API & Snowflake - StarkNet - Gas Consumption - Strategic Finance - PoC reporting metrics for Quarterly Strategy Review - Data provision through Snowflake - SES - Data feed for MKR Compensation Cookie Cutter We look forward to expanding our collaboration across the protocol, improving existing relationships and fostering new ones. We invite the entire community to reach out to us, particularly delegates as we believe we can help with the increase need to digest massive amounts of data.  2021 - 2022 Expenditure Summary The initial budget started in November 2021 and will end in April 2022, included. Given that the review is being done at the beginning of March, the values for both March and April are estimations and will be confirmed once the period is finalised. The total budget for the running of DICU for 6 months has been of 367,000.00 DAI.  The main difference between the forecast and actuals is driven by a lower than expected cost of infrastructure (overestimation & constant optimization) and operations (no entity incorporation). The excess of funds will be returned to the protocol.  Expenditure Breakdown   Team costs We initiated the CU with 1x Facilitator and 2x Data Engineers. We had planned to hire a part time front-end developer but through the course of the period realised we were able to better serve the protocol by focusing on building the data foundations, collaborating with CUs building front-ends and a preference for multi-displinary, full time collaborators that will help build solid human foundations. We just recently hired a Full Stack Engineer.  Data costs We contract the services of Token Flow for the provision of on-chain data. This is set to a fixed cost, enabling us to have full predictability and the ability to experiment without additional costs.  Infrastructure costs Our services & products are built using a combination of Snowflake (managed database) and AWS (hosting for orchestration service and graphical user interfaces). These services are set to pay-per-use, we monitor and optimize them on an ongoing basis. Budget surplus/excess of funds: driven by the lower than expected Snowflake costs and the optimizations on AWS to reduce overhead. This is also a reflection of lower than expected usage of our services, a topic that we aim to resolve through better commucation and direct engagement with the community.  Operational costs Initially referred to as “Other costs (outsourced)”. This is mainly driven by our professional services company who provides us legal, accounting and payment services. Gas fees for operating the multi-sig are also included. Budget surplus/excess of funds: driven by not incorporating a new legal entity, thereby not necessitating the initial funds and lower ongoing expenses.  Conclusion We are proud of the work we have done in the past period, we believe we have provided tangible value to the protocol. We have much more to do so we look forward to contributing to the protocol in the foreseeable future. Below you can find links to the new mandate and budget submissions, currently at the RFC state. We’d love to hear your feedback and hope for your support.  2022 - 2023 Mandate 2022 - 2023 Budget  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp64-add-data-insights-core-unit-budget/13791",
                        "https://forum.makerdao.com/t/need-for-data-insights-core-unit/8450",
                        "https://forum.makerdao.com/t/mip39c2-sp22-adding-data-insights-core-unit-din-001/10208",
                        "https://forum.makerdao.com/t/mip40c3-sp34-add-data-insights-core-unit-budget-din-001/10210",
                        "https://data.makerdao.network/roadmap",
                        "https://data-api.makerdao.network/redoc#operation/read_vault_history_v1_vaults_vault_history__vault__get",
                        "https://data-api.makerdao.network/docs#/experimental/read_vault_ownership_v1_experimental_vault_ownership_get",
                        "https://data-api.makerdao.network/docs#/experimental/read_vault_history_daily_v1_experimental_vault_history_daily_get",
                        "https://data-api.makerdao.network/docs#/vaults/read_vault_snapshot_v1_vaults_vault_snapshot__vault___timestamp__get",
                        "https://data-api.makerdao.network/docs",
                        "https://tracker-vaults.makerdao.network/",
                        "https://tracker-gov.makerdao.network/",
                        "https://tracker-vaults.makerdao.network/history",
                        "https://tracker-gov.makerdao.network/protocol_parameters",
                        "https://datastudio.google.com/s/onlfAv8Hueo",
                        "https://public.tableau.com/app/profile/tadeo5490/viz/2021MakerDAOGovernance/GovernanceVoting",
                        "https://public.tableau.com/app/profile/tadeo5490/viz/Flapper-KeeperActivity/FlapperKeepers",
                        "https://forum.makerdao.com/t/mip39c2-sp31-update-data-insights-core-unit-mandate/13790",
                        "https://forum.makerdao.com/t/mip40c3-sp64-add-data-insights-core-unit-budget/13791",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-march-2022/14712"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.667987478471349
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#2",
                    "likes": "3",
                    "time": "10/05/2022-16:37:25",
                    "content": "Having finalised the budget period, we have reconciled the accounts and have returned the excess funds, totalling 52,401 DAI (transaction).  Screenshot 2022-05-10 at 2.23.55 PM918×330 44.4 KB  ",
                    "links": [
                        "https://forum.makerdao.com/t/dicu-monthly-updates-thread/14960/7",
                        "https://forum.makerdao.com/t/mip40c3-sp64-add-data-insights-core-unit-budget/13791/43"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/08/2022-16:37:55",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "795"
}