{
    "poll_list": [
        {
            "title": "Add an ETH-B Vault Type - October 5, 2020",
            "index": "4435",
            "option": "Yes",
            "supporting_mkr": "23,577",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-add-eth-b-vault-collateral-type-september-2020/4435",
            "title": "[Signal Request] Add ETH-B Vault Collateral Type - September, 2020 ",
            "index": 4435,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "eth-b",
                "sig-status-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#1",
                    "likes": "12",
                    "time": "27/09/2020-21:28:09",
                    "content": "Hi Everyone, Now that @Primoz has posted his analysis on ETH-B parameters and discussion has taken place, I would like to formally signal to the community whether they would like to implement an ETH-B vault with higher risk parameters. Summary In July I created a signal request to add ETH-B as a new vault type. The reasoning for this was to give vault users another option to create more DAI for a higher stability fee. That poll concluded with the community signalling for our risk team to advise on these new parameters. Now that that has finally been completed we can finally move onto creating it ourselves. Therefore: Should we create an ETH-B vault type?     Yes No Abstain     0 voters     If “Yes”, What should the Liquidation Ratio be?     145% 140% 135% 130% 125% Abstain     0 voters     If “Yes”, What should the Risk Premium be?     4% 6% 8% 10% 12% Abstain     0 voters     If “Yes”, What should the starting Debt Ceiling be?     5 Million 10 Million 15 Million 20 Million Abstain     0 voters     Polling will last until 2020-10-05T04:00:00Z. Please choose all options you agree with. I look forward to your discussion and participation! Next Steps If passed: Polling ends October 5th, Pull Request October 7th, On-Chain Poll October 12th, Executive October 16th. If governance wants to speed up this process, consensus must be reached by September 30th. @LongForWisdom can make a call on this based on past precedent. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-add-eth-b-vault/3349",
                        "https://forum.makerdao.com/t/discussion-eth-b-vault/4316/27",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-112-thursday-october-1-16-00-utc/4391/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-15-en-espanol/4576",
                        "https://forum.makerdao.com/t/maker-relay-ep-15/4574",
                        "https://forum.makerdao.com/t/relay-ep-14-en-espanol/4457",
                        "https://forum.makerdao.com/t/maker-relay-ep-14/4450",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-114-thursday-october-15-16-00-utc/4657/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-113-thursday-october-8-16-00-utc/4505/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-15-pt-br-portugues/4597"
                    ],
                    "GPT-summary": "The author of the post is requesting feedback from the community on whether to implement an ETH-B vault with higher risk parameters. The post includes a poll with questions about the proposed parameters and a timeline for the decision-making process. The post also mentions that a risk team has advised on the new parameters, and the author is seeking consensus from the community before moving forward.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Change to proposal pipeline",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None"
                    ],
                    "Sentiment": 5.181818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/09/2020-11:44:18",
                    "content": "The vault makes no sense to me other than continuing with the roadmap of centralization and taking short term profits. Now we are starting to learn that ETH is riskier than USDC (even though we have no way to liquidate USDC and the black swan event in USDC would be much more devatstating than in ETH) and that it should bear higher and higher SF. If there is a niche for this product (125%/+4%) then there is also a market for 130%/+3%, 120%/5%… The whole system looks like a mess where a handful of people votes and one whale decides. Charging high stability fees while the peg is artificially glued to $1.01 using USDC screams: take profit while you can. I noticed on Twitter that there is more and more complaints/comments from respectable ETH users including Vitalik Buterin about the stablecoin dependance and the road MakerDAO is taking since the Black Thursday. We should start listening to those voices. My suggestion is to stop raising the DC for stablecoins and think about the ways to stimulate minting DAI from decentralized assets like ETH, Uniswap ETH/DAI… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.542222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#3",
                    "likes": "5",
                    "time": "29/09/2020-06:40:09",
                    "content": "I disagree, I think it’s the perfect time to raise fees. People are using their Dai loans to generate massive amounts of yield. In this type of scenario stability fees and borrowing demand are relatively inelastic. It’s not about cashing in for short-term profits, it’s about looking at what the protocol needs to take the next step in its evolution. The protocol needs to scale by onboarding dozens more collateral types in a rapid manner. At the same time the protocol needs to become more decentralized and ween of dependency on the Foundation. Raising the stability fees allows the protocol to build up a treasury which it can use to fund grants for onboarding additional independent domain teams which will scale up collateral onboarding throughput and ultimately Dai supply. To that end, I think an ETH-B vault is a great idea. We capture a segment of the market looking to take on more leverage that has traditionally been alienated to other protocols like dYdX and Compound. Of course increased leverage also means more risk so the debt ceiling will have to be carefully managed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.191666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#4",
                    "likes": "3",
                    "time": "29/09/2020-10:21:54",
                    "content": "I personally have, right now, a BAT-cdp. The fees on BAT were raised from 0% (few weeks ago) to 4% and finally (today) to 4.25%. Question: Will I close my vault now? Answer: No. The DAI from my Vault are producing ~14.5% APY on Yearn, so having a BAT cdp is still profitable. Conclusion: I agree with @NikKunkel . Despite my very limited DeFi skills (I am not constantly scanning the web for the best yields available) I can still make profit with the current SF. Surely more sophisticated investors can do that too and much more. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.205357142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#5",
                    "likes": "0",
                    "time": "29/09/2020-15:15:07",
                    "content": "Knowing that, there’s no reason to have a SF lower than 13%, @NikKunkel. We can also save time/money by relieving the risk team of the duty of evaluating risks for various collateral types. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#6",
                    "likes": "1",
                    "time": "01/10/2020-00:04:43",
                    "content": "I’m voting no for now, but I would change my mind if we had dynamic debt ceilings or a way to prevent Vaults from minting Dai at a stale OSM price. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#7",
                    "likes": "5",
                    "time": "02/10/2020-10:23:01",
                    "content": "The winning vote seems to be to introduce ETH-B vault type with following parameters: Debt Ceiling = 20m Liquidation Ratio = 125% Risk Premium = 6% I’d only recommend to implement 130% LR instead of 125%. The reason is that we want to be a bit more conservative with LR in regards to OSM risk and also because it seems majority of the voters were voting for a LR above 125%. There is also this option to lower it later, once this vault type gets some usage and we see what kind of users it has. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.142857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "3",
                    "time": "02/10/2020-12:11:32",
                    "content": "I’ve closed these polls as the community seems strongly in favour, and both @Aaron_Bartsch and @Primoz want to see ETH-B as soon as possible. The on-chain poll will start on October 5th with the following parameters:  Stability Fee: 6% Debt Ceiling: 20,000,000 Liquidation Ratio: 130% Auction Lot Size: 50,000 DAI Minimum Bid Increment: 3% Bid Duration: 6 hours Max Auction Duration: 6 hours Liquidation Penalty: 13% Dust: 100 Dai  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#9",
                    "likes": "3",
                    "time": "02/10/2020-12:26:39",
                    "content": "Thank you to @LongForWisdom and @Primoz for their input in expediting this poll.  As @Primoz said, even though at the time 125% was winning (130% ended up on top so its no problem) its much easier to start more conservative and lower the LR than the reverse, and since it was so close it makes sense to start with 130% first. All the other parameters were pretty unanimous so hopefully no contention there. I have created a pull request to add this poll and their parameters to the voting module for next week’s governance cycle. I look forward to all of your continued participation on-chain and thank you for your input and participation thus far! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "1",
                    "time": "15/10/2020-11:10:23",
                    "content": "The on-chain poll for ETH-B passed, it will be included in the executive vote this Friday. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "3",
                    "time": "21/10/2020-14:42:11",
                    "content": "The executive vote for ETH-B also passed. ETH-B is now active in the Maker Protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#12",
                    "likes": "0",
                    "time": "28/10/2020-14:42:13",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2773"
}