{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/poll-real-world-assets-using-long-term-loans/6109",
            "title": "[Poll] Real World Assets - Using long term loans? ",
            "index": 6109,
            "category": [
                "Governance"
            ],
            "tags": [
                "real-world-finance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "10",
                    "time": "19/01/2021-09:04:02",
                    "content": "The recent P1-DROP proposal have shown that it is hard to lend against real-world stable assets, have liquidity, short duration risk, and a good yield. This post is a way to discuss longer maturity investments and poll the community about it. With the current rate environment (0.3% on the 12-month LIBOR rate), it is difficult to generate yield without going too low in the credit quality ladder. A short term junk bonds ETF, SHYG, can only offer 3.6% for a 24-month average maturity. We might find some niche assets (trade finance, fix&flip real estate) that provide a good enough yield, but it will not work for more common assets. One option is to move to longer-term financing. This would be reducing liquidity (at least at par price) and increasing the duration risk. Let’s explore some consequences:   Illiquidity when DAI demand increases: We don’t really need to close the vault if the demand for DAI is steady. DAI may break the peg again, but as the borrower doesn’t have to repay and we sure don’t want him to, all is fine.  Illiquidity when DAI demand decreases. If DAI demand decreases, we want to reduce our loan exposure to diminish the amount of DAI outside. Nevertheless, if DAI depegs on the lower side, the borrower, being exposed in $, has now incentive to repay by refinancing elsewhere.  Real-world interest rates falling: If rates continue to drop, it is likely that vault owners will refinance elsewhere and close the vault. I don’t think this is an issue for us at this stage.  Real-world interest rates increasing: In this case, we will have an opportunity cost as having short duration loans would allow us to lend at a higher rate.  DSR rates increasing: In such a case, we might have to pay more on the liability side than what we get on the asset side. Currently, we are hoarding a lot of USDC that yields 0% so it would still be better. Nevertheless, it’s easier to dispose of USDC than loans.  Collateral value decreasing: Many yield-generating assets (like farms, real estate, …) have an inverse correlation with interest rates because the value of the asset is more or less using discounted cash flows (and the discounting parameter matters). I would suggest that what really matters here is the servicing of the loan (i.e., ongoing monthly payments). We might still have the ability to sell if covenants are breached, but that would come at a cost (this will not be black & white and will depend on each collateral).  We have already some asset originators asking us what we are looking for as loan maturity. I would say that committing up to 10% of our assets ($130M) on longer maturity loans would make sense. It is unlikely that we should decrease DAI supply by more than 90% (at least that would be painful in any case). If we stick with a short maturity constraint, we might either have to accept opportunities with low stability fees (something like 2%) and/or higher credit risk. As it might not be acceptable, it might therefore limit our RWA exposure due to the lack of suitable opportunities. Therefore, do you agree on longer maturity loans?     yes, I agree with longer maturity loans no, I want to keep loans below 24 months maturity abstain     0 voters     What would be the minimum stability fees that you would accept for a RWA collateral:     0% 1% 2% 3% 4% Higher Abstain     0 voters     If you agree on longer terms, what would be the maximum duration: you would accept:     let’s keep it to 24 months (2 years) 5 years 10 years 20 years 30 years abstain     0 voters     Those polls will help the RWA team informing prospects on the terms to be provided in the MIP6 application. Please, feel free to comment below. Signed: The RWA team (@Philinje, @williamr, @SebVentures) ",
                    "links": [
                        "https://fred.stlouisfed.org/series/USD12MD156N",
                        "https://www.ishares.com/us/products/258100/ishares-05-year-high-yield-corporate-bond-etf",
                        "https://forum.makerdao.com/t/real-world-finance-core-unit-report-2021-01/6310",
                        "https://forum.makerdao.com/t/mip43-term-lending-module-tlm/6153/14",
                        "https://forum.makerdao.com/t/governance-at-a-glance-january-14-21-2021/6145",
                        "https://forum.makerdao.com/t/poll-rwa-risk-onboarding-sections-most-valuable-insights/6123/8",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-125-thursday-january-21-17-00-utc/6050/3",
                        "https://forum.makerdao.com/t/rwf-ask-me-anything-september-2021/10234/5",
                        "https://forum.makerdao.com/t/guide-navigating-feedback-from-governance-and-the-greater-makerdao-community/8303",
                        "https://forum.makerdao.com/t/p1-drop-mip6-risk-assessment-alternative-equity-advisors-drop-us-agricultural-real-estate/8232",
                        "https://forum.makerdao.com/t/rwf-ask-me-anything-september-2021/10234"
                    ],
                    "GPT-summary": "The post discusses the possibility of using longer maturity investments to lend against real-world stable assets. The author explains the potential consequences of this approach and polls the community for their opinions on the matter. The RWA team is seeking feedback to inform prospects on the terms to be provided in the MIP6 application.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.396258503401361
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "5",
                    "time": "19/01/2021-10:54:21",
                    "content": "Hi @SebVentures, Good poll. Real World Assets often have horribly low yields. Accordingly I regard them more useful for bulk increase of Dai than for profit generation. But if we are to catch up with USDC and Tether we will have to onboard these assets. I voted for 1% and 10 years maturity because I want to include senior notes and T-bills. Please regard these choices as soft. With regards to Real World Assets my concern is much more on the liquidation side compared to what profit we can get from them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#3",
                    "likes": "2",
                    "time": "19/01/2021-11:30:01",
                    "content": "    Planet_X:  Accordingly I regard them more useful for bulk increase of Dai than for profit generation.   I might be naive, but 1% on a BIG number, is more than 10% on a small number. The point of RWA is that it is a huge (huge >> BIG) market. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.861111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "0",
                    "time": "19/01/2021-15:48:31",
                    "content": "With the The fed funds rate pinned to the floor of 0 to 0.25 percent until 2023 or so, and possibly keeping longer-term interest rates low for the foreseeable future–I opted for 30 years–and 2% as a minimum SF. But I think 2% is wishful thinking TBH. I think we can All agree that the Consumer will suffer with Savings Rates–hence, turning-on the DSR will be a hot topic IMO ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#5",
                    "likes": "0",
                    "time": "20/01/2021-23:45:19",
                    "content": "    Planet_X:  I voted for 1% and 10 years maturity because I want to include senior notes and T-bills.   I don’t quite see RWA as equivalent to T-Bills - so lets just get past that. I thought SF was supposed to be related to generating revenue against risk/loss profiles.   The real question becomes what are competitive rates and terms.   My understanding here is that time frames on these loans are short term - no more than 2-3 years.  The point is that DROP basically cycles its invoices within this time frame, and my understanding of 6s is that their projects are expected to complete within 24 months. I don’t have a clear handle on risk nor how rates and time frames are determined in the industry generally.   My guess here is that rates are in the 2-4% range and time frames in the 2-3 year ranges depending on the credit quality of the borrower and the risk profiles of the industry.    One has to look at the business these people are in and what this cash allows them to do.  (i.e. what is their profit model on the cash they are being loaned).   Typically in the two cases we are looking at returns run in the 8-10% range and so depending on their borrow they end up with about a 100-250% profit overhead on the cash they can borrow.   Having a long term facility (i.e. a facility that doesn’t need to be renewed every so many years) is also an expense and headache plus. I think it is important to have a long term facility but I don’t see the point here of having a term facility since we give DC or not and basically set the SF.   If I am going to lean in a direction here it is NOT to have a term and simply to set a reasonably competitive rate.   The best way to do this is to start high on SF and see how much DC our RWAs take (start around 4%)  if they don’t touch it we can just lower it until they do.   Personally I really would like our RWAs borrowers suggest what they would like to see here and then adjust accordingly. The whole problem here is going to be rate setting btw.  The second problem is going to be collateral price oracles and deciding whether risk has grown so SF needs to be raised (to encourage a risky RWA to close) and/or to liquidate.    Lastly managing DC since DC basically doesn’t go down unless a vault/borrower pays down a loan. I think throwing out this as a poll without any comments or feedback from our RWA players though is disingenous to Maker governance as allowing this ‘freedom’ of choice implies there ‘is’ freedom and I would hazard our RWA players would suggest 6-8% is too high, and governance risk would suggest .25-.5% too low on the SF side. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.424485596707819
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#6",
                    "likes": "1",
                    "time": "21/01/2021-09:10:57",
                    "content": "Let’s suppose an asset originator is suggesting a portfolio of high-yield corporates bonds with an average maturity at 5 years and an interest rate of 4%. They are willing to take a TIN tranche of 20% and gives us the remaining DROP tranche for a 3% yield. Let’s assume this makes sense from a risk perspective. Obviously, the 3% SF needs to be fixed for 5 years. Otherwise, this doesn’t work. The same thing for a real-estate portfolio (non-construction), no one will be interested in a Maker Vault if we can change the stability fees every week up to 100%. They will need to have the ability to liquidate (or refinance). That will come at a cost and it will be paid by Maker. Having quick liquidity without any loss on something that is not liquid is not easy. My point is that I don’t think we really need liquidity and we can commit to a term loan (i.e. a vault with a fixed SF for a defined time). This is why we have 2 collaterals that are construction loans. I would personally sleep better with rented mature real estate in which the rent cover way above the stability fees and will repay the loan in the next 10-20 years. The intent of the poll is to get your feeling about this question. We can stick with short terms loans. But wanting the safety of yield-earning long term assets with the near-instant liquidity at no loss is not possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.425438596491228
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#7",
                    "likes": "1",
                    "time": "21/01/2021-09:13:45",
                    "content": "I understand and value the RWA especially for long term and R&D. But economically it doesn’t make sense to go big without first pushing down the rate on the crypto assert to the same level. With all these negative points, don’t we first want to go to the crypto lender until they reach the same rate level at least. Our Dai supply is limited too, and crypto lending seems way more interesting right now in plenty of points. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.402910052910053
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#8",
                    "likes": "0",
                    "time": "21/01/2021-09:19:18",
                    "content": "    alexis:  With all these negative points, don’t we first want to go to the crypto lender until they reach the same rate level at least. Our Dai supply is limited too, and crypto lending seems way more interesting right now in plenty of points.   That’s an option as well that governance can signal. There are pros and cons as all crypto assets are in a bull market. All we need to do a good job is clarity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.8690476190476195
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#9",
                    "likes": "0",
                    "time": "28/01/2021-18:13:59",
                    "content": "Managing duration risk is fairly complicated. All of our obligations are currently floating rate / 0 duration. Long duration asset prices move inversely to yield, so if we add assets with long duration, we will lose a lot of money if DAI demand falls and we need to raise short term rates. We would need to create some sort of DAI locking/term deposit mechanism to help increase the duration of our portfolio liabilities to match longer average asset duration. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#10",
                    "likes": "0",
                    "time": "28/01/2021-18:54:07",
                    "content": "Deposit (i.e. DAI) is usually put as “quasi” long-term funding in banks. The whole business model of MakerDAO is to lend at a higher rate than the one we borrow on. Borrowing short to lend long is what banks are doing. There is plenty of work done in this area. Sure they don’t assume degens and farming (even if farming, the real one, was the main driver of money expansion cycles in the 19th). I believe DeFi is the future of finance and that term loans will still be used to buy a house or finance a factory. Not saying it will be easy or quick. Maker took 5 years from the concept to 1B DAI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8106060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#11",
                    "likes": "4",
                    "time": "29/01/2021-04:33:14",
                    "content": "Good poll @SebVentures … Here is my feedback:   I like the concept of long term, but I wouldn’t want this to be conflated with fixed stability fees. I know this isn’t what you were saying, but I feel like it’s worth specifying. We’d be putting ourselves in a tight corner if we ever offered a fixed stability fee. I don’t think we should ever do fixed stability fees.   I think those voting for 1% are dreaming too small. There’s plenty of high quality yield out there if the community is willing to put in the work. The Prime Rate is 3% over LIBOR, so at the very least we should be targeting that as a floor until we’ve reached a scale where we can’t.   Going back to my first point, I think duration is irrelevant so long as the stability fee remains variable. If we need the borrower to close the Vault, we can use this lever. If they refuse to close and go below their mutually agreed ratios, the assets will be liquidated.   Of course, this all requires proper structuring to ensure that our levers actually function. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.159243697478991
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#12",
                    "likes": "3",
                    "time": "29/01/2021-08:25:10",
                    "content": "    g_dip:  Going back to my first point, I think duration is irrelevant so long as the stability fee remains variable. If we need the borrower to close the Vault, we can use this lever. If they refuse to close and go below their mutually agreed ratios, the assets will be liquidated.   There is a link between duration and interest rate, at least in Maker. Vaults are by default long term and no prepayment penalty. Indeed, if you can set stability fees at 1000% you are no longer lending long term but weekly with a roll-over. My perspective is that we should lend only when we know it’s profitable for both parties. Otherwise, you attract only borrowers that have no other choices. This would be the worst thing to do. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.255681818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#13",
                    "likes": "3",
                    "time": "29/01/2021-12:06:47",
                    "content": "I think you make a good point. The rates in crypto are still significantly higher than in the regular financial market and the market immaturity of crypto is probably the main reason for this. This means a lot of borrowers in the real world are able to get better interest rates and thus are not interested in competing with crypto-borrowers for collateral. However I do believe there are two reasons we shouldn’t wait for rates in crypto to go down overall before we look into real world assets: Long tail lending In traditional finance, rates for asset classes like mortgages and large commodities profit from very low rates. But if you look into smaller asset classes it’s a very different story. These are not well understood by banks and thus they don’t have access to the same cost of capital. Of course they are also higher risk but I think that’s still nothing compared to the risk that we are used to in crypto. These assets can be the beach head we use to onboard traditional finance. Diversification of Collateral We’re in a bull market and the price of DAI is stable so this is probably falling into the background for a lot of people. But I think we often forget & underestimate the damage DAI going off the peg has done to the status of DAI as the defacto DeFi USD stablecoin. Adding collateral that is uncorrelated to crypto will help in making the supply of DAI more stable in crazy market fluctuations which can only help in keeping the DAI peg. Even if we are giving long term stable assets DAI at a cost far lower than what crypto collateral pays the benefit they bring here probably outweighs the missed revenue or even potential subsidy over the DSR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.481554967666079
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#14",
                    "likes": "0",
                    "time": "29/01/2021-12:14:35",
                    "content": "Yes, if you explain this mechanism to people who are used to borrowing in the traditional markets, they will very much look at this as weekly with roll-over. This cuts out anyone from this that doesn’t use extremely liquid collateral or has a very easy alternative source of capital. And the problem is that for people who have these alternative sources it’s very unlikely that Maker can beat the terms they have once you factor in fiat on/off ramp costs (likely around %0.1) and DAI volatility risk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.040277777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#15",
                    "likes": "0",
                    "time": "29/01/2021-17:18:21",
                    "content": "But Vault’s are only this way because the community allows them to be… I’m by no means saying that this should be changed, just that for real world users the community could easily demand a monthly payment as part of their maintenance obligations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.055555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Philinje",
                    "index": "#16",
                    "likes": "0",
                    "time": "02/02/2021-22:48:30",
                    "content": "Another perspective from The Defiant: https://thedefiant.io/engineer-becomes-his-own-lender-in-first-defi-mortgage/ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#17",
                    "likes": "0",
                    "time": "05/05/2021-04:48:32",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}