{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - RAI (Rai Reflex Index) - September 6, 2021",
            "index": "9802",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "68,666",
            "highest_fraction": 0.95
        },
        {
            "title": "Community Greenlight Poll - RARE (SuperRare) - September 6, 2021",
            "index": "9944",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "64,211",
            "highest_fraction": 0.91
        },
        {
            "title": "Community Greenlight Poll - CurveLP-stETH-ETH (Curve stETH-ETH LP Token) - October 4, 2021",
            "index": "10229",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "34,302",
            "highest_fraction": 0.55
        },
        {
            "title": "Add CurveLP-stETH-ETH as a new Vault Type - November 29, 2021",
            "index": "10229",
            "option": "Yes",
            "supporting_mkr": "74,740",
            "highest_fraction": 1.0
        },
        {
            "title": "Community Greenlight Poll - aUST (Anchor TerraUSD) - December 06, 2021",
            "index": "11494",
            "option": "No (Defer)",
            "supporting_mkr": "79,157",
            "highest_fraction": 1.0
        },
        {
            "title": "Community Greenlight Poll - TUSD-PSM (TrueUSD) - January 10, 2022",
            "index": "12192",
            "option": "No (Defer)",
            "supporting_mkr": "81,493",
            "highest_fraction": 0.93
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rai-rai-collateral-onboarding-application-mip6/9802",
            "title": "[RAI] - RAI Collateral Onboarding Application MIP6 ",
            "index": 9802,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "rai"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/James",
                    "index": "#1",
                    "likes": "13",
                    "time": "11/08/2021-19:38:16",
                    "content": " RAI x MakerDAO Collateral Application 1. Who is the interested party for this collateral application?  Fire Eyes DAO Reflexer Labs  2. Provide a brief high-level overview of the project, with a focus on applying collateral token. After launching in February, over $100m worth of RAI has been minted with more than $300M worth of ETH deposited in the protocol. RAI has managed to stabilize using its on-chain PID controller and is now undergoing a governance minimization process with the intention to calcify the protocol. RAI Redemption Price:  image795×447 35.7 KB  3. Provide a brief history of the project. RAI was created as an alternative to USD-pegged stablecoins and as an experiment in peg-less stability. The project began as a ethresear.ch post by Ameen Soleimani, and was then picked up and built into the system we see today by the newly formed Reflexer Labs Team. 4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  Whitepaper Docs Home GEB System Overview Diagram System Contracts Documentation  5. Link any available audits of the project. Both procedural and smart contract focused audits.  OpenZeppelin Quantstamp Solidified  6. Link to any active communities relating to your project.  Discord Twitter  7. How is the applying collateral type currently used? RAI is used in a variety of ways:  Trust-minimized, stable asset used to hedge against volatility Payment mechanism Collateral for DeFi protocols like Aave v2, CREAM and Rari Capital Fuse Interest rate tranching in BarnBridge Reserve asset (Fei Protocol, Metacartel Ventures treasury)  8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? The Reflexer Labs team currently bears legal responsibility for the RAI collateral and is a US based company. 9. Where does exchange for the asset occur? Decentralised exchanges such as Uniswap v2 and v3 as well as Coinbase Pro. 10. (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. N/A 11. (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. N/A 12. (Optional) List any possible oracle data sources for the proposed Collateral type. Chainlink RAI/ETH price feed which can be found here. 13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type. Reflexer team. Additional Explainers:   dune.xyz    Dune Analytics Ethereum Ecosystem analytics by and for the community. Explore and share data from Ethereum Mainnet, Matic, Optimism and xDai for free.        Medium – 15 Jun 21    RAI System Simulations: Part 1 — SAFE Owners Explore how the Money God Controller and SAFE owners’ behavior affects RAI/ETH and ultimately, RAI/USD  Reading time: 8 min read          newsletter.banklesshq.com    DeFi needs trust minimized money Why ETH backed stable asset are the next evolution of DeFi money      ",
                    "links": [
                        "https://reflexer.finance/",
                        "https://docs.reflexer.finance/ungovernance/governance-minimization-guide#level-1-deadline-14-months-post-launch",
                        "https://ethresear.ch/t/announcing-metacoin-the-governance-minimized-decentralized-stablecoin/6897",
                        "https://github.com/reflexer-labs/whitepapers/blob/master/English/rai-english.pdf",
                        "https://docs.reflexer.finance/",
                        "https://viewer.diagrams.net/?target=blank&highlight=0000ff&layers=1&nav=1&title=GEB_overview.drawio#Uhttps%3A%2F%2Fdrive.google.com%2Fuc%3Fid%3D1nIcaY8N8StVCfyAL_ztbmETJX2bvY3a9%26export%3Ddownload",
                        "https://docs.reflexer.finance/system-contracts/core",
                        "https://github.com/reflexer-labs/geb-audits/blob/master/open-zeppelin/core-contracts/oz-geb-protocol-audit.pdf",
                        "https://github.com/reflexer-labs/geb-audits/tree/master/quantstamp/helper-contracts",
                        "https://github.com/reflexer-labs/geb-audits/blob/master/solidified/helper-contracts/Solidified%20Audit%20Report%20-%20Reflexer%20%5B26.01.2021%5D.pdf",
                        "https://discord.com/invite/G6SZSAvX32",
                        "https://twitter.com/reflexerfinance",
                        "https://etherscan.io/address/0x4ad7B025127e89263242aB68F0f9c4E5C033B489",
                        "https://dune.xyz/HggqX/Reflexer-RAI",
                        "https://dune.xyz/HggqX/Reflexer-RAI",
                        "https://medium.com/reflexer-labs/rai-system-simulations-part-1-safe-owners-876a6bd55385",
                        "https://medium.com/reflexer-labs/rai-system-simulations-part-1-safe-owners-876a6bd55385",
                        "https://newsletter.banklesshq.com/p/defi-needs-trust-minimized-money",
                        "https://newsletter.banklesshq.com/p/defi-needs-trust-minimized-money",
                        "https://forum.makerdao.com/t/maker-relay-ep-61/10214",
                        "https://forum.makerdao.com/t/maker-relay-ep-62/10311",
                        "https://forum.makerdao.com/t/maker-relay-ep-61-en-espanol/10376",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-6th-12th/9823",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/maker-relay-ep-62-en-espanol/10399",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-august-15th-2021/9909"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Interoperability and Scaleability",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.770226899537244
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "4",
                    "time": "11/08/2021-20:19:14",
                    "content": "I’m sorry I have to say it, I love RAI.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#3",
                    "likes": "17",
                    "time": "11/08/2021-20:45:43",
                    "content": "I may have had a hand in encouraging this MIP6. At a technical level, Rai is based on a forked version of the MCD codebase. As a “crypto purist” I’ve enjoyed seeing the project take the reflexive approach to peg management envisioned in the original Maker design. This means that while the price of the output token is not stable, it potentially would work as a partially countervailing force to ETH price swings in the MCD system, while providing a stable asset that is not as exposed to regulatory risk as centralized stablecoins. Despite being based on the MCD codebase, Reflexer appeals to a different customer, namely those less sensitive to a hard peg, than Maker’s vaults, but the output is itself a crypto-native asset that can be collateralized into Dai. As far as risks go, I’ll get territorial and say that the risk of reliance on Chainlink oracles within their own liquidation system should be examined. We’d also need to be concerned about getting enough liquidity to make the adoption worthwhile. Reflexer is offering liquidity rewards to it’s own users for providing various liquidity options throughout DeFi protocols, it might be worth requesting that Maker vaults be added to their liquidity mining program to boost Dai generation. In sum, I think that this can help offload a small part of our USDC in a sustainable way. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#4",
                    "likes": "0",
                    "time": "11/08/2021-21:46:23",
                    "content": "    brianmcmichael:  We’d also need to be concerned about getting enough liquidity to make the adoption worthwhile   This was my initial thought as well ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "2",
                    "time": "11/08/2021-21:52:31",
                    "content": "    brianmcmichael:  We’d also need to be concerned about getting enough liquidity to make the adoption worthwhile.   They have been expanding into Olympus, WePiggy, BarnBridge, and even FEI is getting into the act. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ameensol",
                    "index": "#6",
                    "likes": "6",
                    "time": "11/08/2021-21:53:47",
                    "content": "Hello MakerDAO friends, I hope this proposal doesn’t come as a surprise to anyone. RAI’s goal has always been to serve as an alternative collateral to centralized stablecoins, and over the last year MakerDAO has judiciously welcomed USDC collateral in order to maintain DAI’s $1 peg. Of course, we know that RAI won’t replace USDC overnight, but we believe that introducing RAI collateral within MakerDAO is a small step in the right direction—towards a diversity of stablecoin collateral that reduces the risks of depending primarily on any single stablecoin. It would be our great honor for RAI to serve the MakerDAO community.  𝘜𝘚𝘋 𝘚𝘦𝘢 𝘰𝘧 𝘎𝘢𝘭𝘪𝘭𝘦𝘦 𝘤. 2021 To learn more about RAI, please read my RAI launch post (where I do my best to give as much credit to MakerDAO as possible), as well as my recent tweet thread explainer on what we’ve learned about RAI in the ~6 months it has been live. Thank you all for your consideration.  ",
                    "links": [
                        "https://twitter.com/ameensol/status/1420048205127946246"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.250270562770563
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#7",
                    "likes": "5",
                    "time": "11/08/2021-23:08:37",
                    "content": "    brianmcmichael:  risk of reliance on Chainlink oracles within their own liquidation system should be examined   Ick. Is there any possibility of RAI using or switching to MakerDAO oracles? @ameensol Assuming that there is enough demand to back DAI with RAI, I don’t foresee any other reason not to allow it. As a friendly sister project, I wonder if we can figure out a special Oracle deal for RAI? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0059523809523805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#8",
                    "likes": "1",
                    "time": "12/08/2021-02:30:32",
                    "content": "I wanna be an adult about this, but you took a swing at us the same hour this application was posted, @ameensol If DAI is how DeFI went wrong, why are you even here?   twitter.com    ameen.eth @ameensol    looking back at 2020 #DeFi: \"where did it all go wrong?\" twitter.com/ameensol/statu… https://t.co/o0X7xv3nzx   ameen.eth @ameensol  @TheStalwart great article!  it's going to a strange and uncomfortable revelation as #Ethereum wakes up to the fact that @centre_io (USDC) now controls our fork-choice...  https://t.co/EelrGR8klQ    5:48 PM - 11 Aug 2021           93                11            That said, we’re adults and will evaluate the application on its merits. Maybe lay off us while the application is pending? ",
                    "links": [
                        "https://twitter.com/ameensol/status/1425514577836474371?s=21",
                        "https://twitter.com/ameensol/status/1425514577836474371?s=21",
                        "https://twitter.com/search?q=%23DeFi",
                        "https://twitter.com/ameensol/status/1425512842271236099",
                        "https://t.co/o0X7xv3nzx",
                        "https://twitter.com/ameensol/status/1425512842271236099",
                        "https://twitter.com/ameensol/status/1425514577836474371?s=21"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ameensol",
                    "index": "#9",
                    "likes": "14",
                    "time": "12/08/2021-04:08:08",
                    "content": " took a swing at us  I really can’t speak highly enough about MakerDAO. I recall saying in 2018 that if I wasn’t working on my own company, I would be applying for a job at MakerDAO because it was the only thing that actually made any sense. MakerDAO has unequivocally crushed it across the board over the last few years, been the godfather of DeFi, and DAI is now a household name. I even took out the loans for my house using crypto in Maker vaults. I fell in love with DAI when DAI was simple to explain. “It’s cypherpunk money - backed by ETH”. DAI helped my company bank when no one else would. At some point in mid-2018 we held 1.5% of all the DAI. Today the story of DAI is a bit more complicated, which is why I worked on RAI, to preserve that initial vision of simplicity, with a few tweaks to enhance stability without needing centralized collateral.  If DAI is how DeFI went wrong, why are you even here?  MakerDAO made the pragmatic choice at the beginning of DeFi summer—in the face of massive DAI demand—to introduce USDC and the PSM and defend the peg. It was probably the best decision for MakerDAO at the time, and the long-term consequences of USDC dominance were not super clear. Now however, with USDC passing USDT (and on track to keep growing), USDC dominance is increasingly concerning to me, as it could mean abdication of Ethereum’s fork-choice to USDC (Bloomberg wrote about this today). I’m here today because I want to try—however futile it might seem—to help reduce the dependence of MakerDAO and Ethereum generally on centralized collateral like USDC, by providing RAI as an alternative. ",
                    "links": [
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-august-15th-2021/9909"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.231150793650794
                },
                {
                    "author_link": "https://forum.makerdao.com/u/stefan",
                    "index": "#10",
                    "likes": "3",
                    "time": "12/08/2021-08:59:07",
                    "content": "It’s about time for us to harden the oracles so we’re open to explore. We’ve been thinking about having two main price sources (in this case can be Maker & Chainlink) and in case the two prices are far away from each other, the oracle would default to a third feed. In this scheme the problem is picking this third feed which is not easy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.946428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "2",
                    "time": "12/08/2021-09:25:25",
                    "content": "    brianmcmichael:  We’d also need to be concerned about getting enough liquidity to make the adoption worthwhile.   So others have already commented on this. But I’d be curious to get some of the RAI folks (@ameensol @stefan) interpretations here. What is the incentive to use RAI as collateral to mint DAI in both the short-term and the long-term? My understanding is that if RAI supply is not keeping up with RAI demand (measured via market price), then the price of RAI is reduced via the redemption price controller until this is brought back into balance. So if there is too much RAI demand, people are probably not going to lever up on  RAI? In the opposite case, if RAI supply is higher than RAI demand, I can see why people would want to use a RAI vault (to profit on the redemption price increase.) My concern is that (like with DAI) there is far more demand for a stable (or volatility minimized) asset than there is for credit on ETH in most or all market environments, and that means that in most market environments I would expect RAI redemption price to be stable or decreasing - and therefore RAI would not be a collateral people want to mint DAI against. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.113636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/stefan",
                    "index": "#12",
                    "likes": "6",
                    "time": "12/08/2021-11:42:41",
                    "content": "Something that could help this discussion is some data visualization. This is the quarterly redemption rate data:  rai-rate753×455 13.7 KB  It’s helpful to think about the redemption rate over a longer period of time (quarters if not more). We had people freaking out this summer when the rate was going negative but in the end, the rate has been positive over the last 3 months so longs were fine. On the topic of RAI trending down over time, it’s a possibility. Assuming that happens, there are still cases where the rate fluctuations cancel out over many months. One thing that could alleviate this concern and hasn’t been proposed yet is a LP token containing RAI (and DAI?) as collateral. This might also partially address the liquidity concern that @brianmcmichael pointed out. I know Monet tweeted about the focus on LP tokens but I haven’t had the chance to follow progress. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2114898989899
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "5",
                    "time": "16/08/2021-23:44:14",
                    "content": "Looks like the FEI community is proposing a RAI bonding curve with 6 million FEI subsidized. Pretty cool, IMO. https://snapshot.org/#/fei.eth/proposal/QmYB3a41Ytic5nXWVwWrRy4pE2kKSwVxA8SC7bjoT8jaUD ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#14",
                    "likes": "0",
                    "time": "17/08/2021-15:59:31",
                    "content": "I have not had time to read the post, but I have a specific question, how can you measure the parameters of liquidation? I understand that RAI is stabilized according to the needs of people can be at  1 as at  5 and be that your price. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#16",
                    "likes": "3",
                    "time": "18/10/2021-14:30:53",
                    "content": "No progress that I’m aware of.     Quiet:  It could be a major help in reducing usdc reliance with safe (both value stability and governance/existential threat wise) and synergistic eth native alternatives.   I really want this to be true, but…  The market cap of RAI is ~75M. We have ~3B of centralized stables to shift. We need two orders of magnitude more RAI available to completely offset the USDC. One can certainly argue that 75M is better than nothing, but there are other initiatives that can likely deliver more decentral-backed DAI than RAI can at this time. Using RAI in a PSM is dangerous for Maker. If we onboard a huge amount of RAI, unless the CDP’s are there in Reflexer, the RAI will lose its value and cost the protocol money over the long term. Using RAI outside of a PSM doesn’t provide much of an incentive for minting DAI using RAI. The only situation where we end up with large amounts of RAI-backed DAI minted is if people expect RAI value to increase over the long term.  Maybe I’m missing something obvious, but yeah. I don’t see how onboarding RAI makes a dent in the centralized stables backing DAI with exposing Maker to significant losses due to the shift in the RAI peg given its current market cap. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.770727040816327
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#17",
                    "likes": "1",
                    "time": "18/10/2021-15:58:58",
                    "content": "A small additional note: Rai will not reach any sort of scalability relying solely on Eth as collateral. Onboarding them here is an attempt to add functionality for Rai,  which,  given all the negative aspects you highlight above, does not make much sense (aside from virtue signaling about having more “decentralized collateral” in the protocol). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.15
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#19",
                    "likes": "6",
                    "time": "18/10/2021-17:00:55",
                    "content": "I appreciate you engaging with my previous comment, and you make some good points yourself with respect to the markets for DAI and RAI respectively. I hope the RAI market cap does expand significantly in the future, so that it has more potential to make an impact as collateral for Maker. I would comment a little on a point you made regarding RAI’s stability so far though:     Quiet:  but Rai is a unique potential stable collateral type by virtue of having a track record of being stable over a reasonable period   It has a track record of being stable at a marketcap of 75M or so. Because of the way the mechanism works, large imbalances in supply or demand will adjust the price of RAI. It may be that we haven’t seen this yet because there hasn’t been enough of a supply or demand imbalance to trigger this mechanism in a significant way. Currently there is a 3B supply-demand imbalance on DAI which manifests as the PSM marketcap. How will RAI react to 3B supply-demand imbalance, or even a 10th of that amount? I don’t know. I’m not sure anyone will until it happens and we find out. But finding that out when you hold a significant amount of RAI, or a significant amount of Reflexer CDP volume would be pretty stressful, I imagine. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.826163419913419
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#20",
                    "likes": "0",
                    "time": "14/04/2022-03:52:55",
                    "content": "Collateral Engineering Services (CES) is following up with Greenlit collateral applications that have been open for some time. I want to notify you of some changes we have made in the past month. If you are interested in continuing the collateral onboarding process, we ask that you update your application using the most current template, MIPs Portal. Note the current recommended guidelines for onchain collateral, MIP6 Recommended Guideline Metrics for Onchain Collateral Onboarding. Please reply within a week as to your intention. If we do not hear back from you, your collateral application will be marked as inactive and you will need to reapply. To reapply, please start with a new MIP6 application. The collateral onboarding process is documented here, https://collateral.makerdao.com/ Thanks RAI! ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-recommended-guideline-metrics-for-onchain-collateral-onboarding/14503",
                        "https://collateral.makerdao.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.448347107438016
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bacon",
                    "index": "#21",
                    "likes": "0",
                    "time": "05/06/2022-07:47:25",
                    "content": "Sorry, I’m just jumping in here. What’s the current status on this application? I’ll review the linked documents over the next few days but I’d like to pick-up where this left off. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.3
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#22",
                    "likes": "0",
                    "time": "05/06/2022-11:33:21",
                    "content": "Considering we have been off boarding many different types of collateral, unless there’s commitment from Rai protocol itself, this collateral shouldn’t proceed in my opinion ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#23",
                    "likes": "0",
                    "time": "06/06/2022-03:34:15",
                    "content": "Hi @Bacon, At this point, you would need to file a new MIP6 application using the new collateral application template and self assess your project given the published guidelines (this is really important). I’ve listed those links in my prior post. Thanks ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.872727272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bacon",
                    "index": "#24",
                    "likes": "0",
                    "time": "07/06/2022-02:53:55",
                    "content": "Is this worth pursuing? Seems there was poor sentiment last time and the application just died.  . . The liquidity situation certainly hasn’t improved in the meantime. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.142857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#25",
                    "likes": "0",
                    "time": "07/06/2022-03:17:08",
                    "content": "You would have to do a self assessment on these MIP6 Recommended Guideline Metrics for Onchain Collateral Onboarding and see where you landed. If liquidity hasn’t improved then probably best to wait. It’s one of the first things we would look for. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/aust-mip6-aust-collateral-onboarding-application/11494",
            "title": "[aUST] MIP6 aUST Collateral Onboarding Application ",
            "index": 11494,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/yieldtheory",
                    "index": "#1",
                    "likes": "7",
                    "time": "07/11/2021-05:02:24",
                    "content": " Who is the interested party for this collateral application?  @yieldtheory  Provide a brief high-level overview of the project, with a focus on the applying collateral token.  Anchor protocol is an open and permissionless savings protocol that offers a low volatile yield of ~20% APY on UST (Terra Stable coin pegged to USD). Simply, users deposit UST into Anchor on the Terra Blockchain and receive aUST – a token that is redeemable for the initial deposit + accrued interest. Therefore, interest collection is done just by holding onto aUST. Why aUST as collateral? Well, currently users can bridge aUST through terra bridge and receive an ERC-20 version of the token on Ethereum. aUST can then be used as collateral on maker to generate DAI, be sold for UST to leverage their interest earning position in anchor. e.g., UST → Anchor → aUST → Bridge → Deposit into Maker get Dai → Sell for UST → Bridge → Anchor → repeat.  Provide a brief history of the project.  Since 2020, Anchor Protocol has provided a fully decentralized fixed income instrument through diversified staking yields, money markets and the ANC token incentives and governance. Since its launch it has accrued 5.7 billion UST in TVL, of which ~3.7 billion is collateral such as LUNA and ETH and ~2 billion is UST deposits. Additionally, Anchor’s development team has made it exceptionally easy for other projects to leverage the deposit functionality of Anchor through JavaScript SDKs.  Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  Whitepaper: https://anchorprotocol.com/docs/anchor-v1.1.pdf Docs: https://docs.anchorprotocol.com/ Git: Anchor Protocol · GitHub Website: Anchor List of all Terra Blockchain Smart Contracts:   docs.anchorprotocol.com    Deployed Contracts      Contract address for aUST on ETH: 0xa8De3e3c934e2A1BB08B010104CcaBBD4D6293ab Contract address for UST on ETH: 0xa47c8bf37f92aBed4A126BDA807A7b7498661acD  Link any available audits of the project. Both procedural and smart contract focused audits.  Anchor smart contracts: https://anchorprotocol.com/docs/Audit%20Report%20-%20Anchor%20Protocol%20[20210308].pdf EthAnchor Audit:   anchorprotocol.com    Audit%20Report%20-%20EthAnchor%20%5B09.07.2021%5D.pdf 176.03 KB       Link to any active communities relating to your project.  Anchor Gov: https://forum.anchorprotocol.com/ Anchor Discord: Anchor Protocol  How is the applying collateral type currently used?  Currently, the main use case of aUST is on Mirror Finance as collateral to borrow or short mAssets (assets that mirror the price of real-world assets such as stocks etc.). aUST is still widely underutilized and with their recent expansion to aUST on Ethereum I expect protocols to start allowing it as collateral (e.g., abracadabra will be soon)  Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in?  Currently, there is no explicit claim for full legal responsibility of the collateral (my findings), however they make a very big effort towards the security of the protocol with multiple audits, bug bounty programs, and additionally, users are able to purchase smart contract and UST peg insurance through a range of insurance protocols (i.e., Nexus Mutual, InsurAce, Bridge Mutual and Unslashed). Furthermore, the company resides in South Korea and lists Do Kwon and Daniel Shin as their only two employees (Anchor Protocol - Employees, Board Members, Advisors & Alumni)  Where does exchange for the asset occur?  Exchange for the aUST occurs on Anchor protocol itself. However, UST is widely available on multiple blockchains. ",
                    "links": [
                        "https://docs.anchorprotocol.com/",
                        "https://github.com/Anchor-Protocol",
                        "https://anchorprotocol.com/#",
                        "https://docs.anchorprotocol.com/smart-contracts/deployed-contracts",
                        "https://docs.anchorprotocol.com/smart-contracts/deployed-contracts",
                        "https://anchorprotocol.com/docs/Audit%20Report%20-%20Anchor%20Protocol%20%5b20210308%5d.pdf",
                        "https://anchorprotocol.com/docs/Audit%20Report%20-%20EthAnchor%20%5B09.07.2021%5D.pdf",
                        "https://anchorprotocol.com/docs/Audit%20Report%20-%20EthAnchor%20%5B09.07.2021%5D.pdf",
                        "https://anchorprotocol.com/docs/Audit%20Report%20-%20EthAnchor%20%5B09.07.2021%5D.pdf",
                        "https://forum.anchorprotocol.com/",
                        "https://discord.gg/cDzhUMBx",
                        "https://www.crunchbase.com/organization/anchor-protocol/people",
                        "https://forum.makerdao.com/t/maker-relay-ep-74/12035",
                        "https://forum.makerdao.com/t/maker-relay-ep-75-en-espanol/12214",
                        "https://forum.makerdao.com/t/maker-relay-ep-74-en-espanol/12071",
                        "https://forum.makerdao.com/t/maker-relay-ep-75/12187",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/19",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/3"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Interoperability and Scalability",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.525488400488401
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "08/11/2021-14:38:55",
                    "content": "Some things to consider:     yieldtheory:   Where does exchange for the asset occur?  Exchange for the aUST occurs on Anchor protocol itself. However, UST is widely available on multiple blockchains.   You are giving as collateral the wrapped token, not the main token that would be the UST, don’t you think it would be better to list it, mostly for security reasons. Keepers at the time of a settlement process would be talking about other blockchain networks which would be a bit complicated, cumbersome and would make the process a bit more expensive because of the issue of bridges. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.523148148148148
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yieldtheory",
                    "index": "#3",
                    "likes": "0",
                    "time": "09/11/2021-01:31:56",
                    "content": "I wouldn’t consider it a wrapped token in that sense, the only wrapping occurs when it comes from Terra’s blockchain and is wrapped into ERC-20. It is an interest-bearing token, much like all the other interest-bearing tokens already in the ecosystem. Adding UST as collateral defeats the purpose of this proposal. aUST is an interest-bearing asset (~20% APY), therefore, if used as collateral it will allow users to leverage this yield as I discussed in my proposal. Furthermore, Anchor actually has a smart contract set up on ETH which allows you to send UST and receive aUST without having to leave the ETH network. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.289285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "1",
                    "time": "09/11/2021-01:42:26",
                    "content": "Thank you for explaining that part, now if it will accrue in a contract that automatically on the Ethereum mainnet allows me to switch fromUST to UST the final token, it seems appropriate. I said Wrapped because that’s how I see it in Uniswap with the attached photo. And the aUST was what I meant by evuento, as Aave tokens are also envuentos aDAI, aUSDT, aETH, they are guarantees that are there.  image1304×669 66 KB  So if I understand, by having my aUST token set as collateral I am automatically participating in a 20% return? Which allows me over time to increase the collateralisation ratio of my DAI? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yieldtheory",
                    "index": "#5",
                    "likes": "0",
                    "time": "09/11/2021-01:44:37",
                    "content": "Yes this is correct, aUST accrues value when held and can then be swapped back for UST + interest earned. As you can imagine leveraging this position could result in some serious APY! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.958333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ppw",
                    "index": "#6",
                    "likes": "0",
                    "time": "19/11/2021-04:56:40",
                    "content": "This will be very interesting to see this go through. I am always looking for ways to leverage my aUST. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#7",
                    "likes": "11",
                    "time": "07/12/2021-04:53:16",
                    "content": "aUST pays very high yield (currently around 19.5% APY), but on the other hand UST and Anchor lending protocol face substantial risks which may outweigh the stability fees we could earn from onboarding it. UST risks: The peg is maintained via an algorithmic mint/burn mechanism against the native LUNA token. This sounds fancy, but in essence LUNA is using demand debt (able to be called in for repayment by the lender at any time) to finance token buybacks. This is a very unstable financial position, as this process can go into reverse when UST demand falls (eg. if people are worried about Terra solvency). In a worst case scenario, a deluge of user withdrawals could cause a self-reinforcing bank run that tanks both LUNA and UST price to 0. If a bank run did occur, there’s little to no chance of Maker being able to liquidate collateral before the value had collapsed. Anchor risks: Most debt on Anchor is collateralized with bLUNA (liquid staked LUNA token). bLUNA can experience large price discounts during market crashes because there is limited market liquidity and redeeming for LUNA takes 21 days. So Anchor faces significant and concentrated risk from this collateral type. Anchor subsidizes borrowers with ANC token emissions, and also subsidizes aUST holders (UST lenders) with top up payments from a “yield reserve”. Falling ANC token price or lower borrowing utilization could cause depletion of these reserves, which would force Anchor to lower aUST yield. This probably wouldn’t lead to principal losses, but would constrain the amount of risk compensation Maker could earn from aUST collateral. For these reasons, I personally think aUST may be too risky to be onboarded as Maker collateral. ",
                    "links": [
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/29",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/3",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/19",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform/9366/34",
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721/13"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.660424107142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sirverik",
                    "index": "#8",
                    "likes": "0",
                    "time": "14/12/2021-20:18:37",
                    "content": "I agree with this. If aUST were to be onboarded, it would have to be onboarded as a risk asset and not as a stable asset. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/gabrielgarethfoo",
                    "index": "#9",
                    "likes": "1",
                    "time": "15/12/2021-03:26:04",
                    "content": "Hey! I’m Gabe, an active community member in the Terra ecosystem. If you guys have any questions about aUST, UST and Anchor Protocol, I’m open to clarify any concerns. If anyone is interested in knowing how aUST generates ~20% APY from its cash flow sources, I wrote a detailed Twitter thread about this which you can read here: https://twitter.com/GabrielGFoo/status/1469331215295533059?t=w0yEcWdRiUHOAS5Zb3x--Q&s=19 Also the reason why there is a token called aUST is that it is a tokenized IOU consisting of UST and its accruing interest. For gas efficiency, interest does not need to be claimed through an on-chain transaction, instead aUST is a token which appreciates against UST by 20% APY, owning aUST gives holders the right to claim the underlying UST + interest accrued. Do let me know if you guys have any concerns. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.802380952380952
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MungoBlakey",
                    "index": "#10",
                    "likes": "0",
                    "time": "27/12/2021-22:28:42",
                    "content": "Hi Gabe, I read your thread and looked into anchor protocol and I agree with your current summary. However, what happens when the ANC rewards run out? The borrowing will surely move from anchor to say compound or aave as they are much cheaper to borrow on if there is no ANC rewards which actually mean you are being paid to borrow on anchor right now. I mean how sustainable is this whole system? With this massive red flag I am glad the DAO voted to reject aUST as collateral as I am not sure the risk reward is favourable for Maker. Thank you for writing the thread and joining the Maker community! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340097402597403
                },
                {
                    "author_link": "https://forum.makerdao.com/u/R_Schmidt",
                    "index": "#11",
                    "likes": "1",
                    "time": "23/02/2022-12:41:17",
                    "content": "is it possible now to use aUST as collateral… i cannot find it on MakerDao? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#12",
                    "likes": "0",
                    "time": "23/02/2022-12:46:28",
                    "content": "It’s not possible. But the community is in discussion so maybe in the future if it’s approved ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yieldtheory",
                    "index": "#13",
                    "likes": "0",
                    "time": "23/02/2022-13:57:42",
                    "content": "MakerDao’s risk team and team in general absolutely hate UST and the Terra ecosystem. I doubt UST or aUST will ever get listed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#14",
                    "likes": "1",
                    "time": "23/02/2022-15:06:50",
                    "content": "This seems to me to make no sense at all, I think it is practically due to interests. If we were objective and unbiased, UST would already be integrated into the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#15",
                    "likes": "0",
                    "time": "23/02/2022-16:13:08",
                    "content": "Come on folks stop the FUD, there is no hatred of any cryptocurrency. Maker is unfortunately very slow in these processes and in many cases no conclusion is reached like this UST one. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2749999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#16",
                    "likes": "4",
                    "time": "23/02/2022-18:20:02",
                    "content": "To make things absolutely clear, we had an on-chain Greenlight Poll on aUST that ran for two weeks from the 6th of December 2021. The vote can be seen here. As you can see, 79,157.36 MKR voted against the proposal, and 0.24 MKR voted in favour. Consequently, this proposal was unsuccessful. As such, the conclusion is that there are no plans to onboard aUST into the Maker Protocol at this time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#17",
                    "likes": "0",
                    "time": "24/02/2022-14:04:52",
                    "content": "Thanks for the clarification Patrick, in the future all the luck for the inclusion of the aUST. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yieldtheory",
                    "index": "#18",
                    "likes": "2",
                    "time": "24/02/2022-14:30:01",
                    "content": "I could go on with the screenshots. I don’t really care about this anymore, but I’m not ‘fudding’ I’m just stating a common consensus throughout Maker. hexonaut = protocol engineer @ maker monetsupply = risk @ maker  image1172×330 75.9 KB   image1138×118 49.4 KB   image1170×250 38.4 KB   image1920×1031 73.5 KB   image1176×216 44 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#19",
                    "likes": "0",
                    "time": "25/02/2022-14:38:15",
                    "content": "Ok friend I understand your point, but those are personal opinions, I don’t doubt that they can influence and cloud the vision but that’s what the signal request and onchain voting are for, to measure what the community wants . They do not control the decision of the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/tusd-mip6-collateral-onboarding-application/12192",
            "title": "[TUSD] MIP6 Collateral Onboarding Application ",
            "index": 12192,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "psm"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/AnnabelTUSD",
                    "index": "#1",
                    "likes": "0",
                    "time": "14/12/2021-09:04:45",
                    "content": "Dear MakerDAO  Community, TrueUSD would like to propose its application to onboard TUSD as a collateral for DAI. Thank you for your consideration. Annabel Marketing and Business Development at TrueUSD 1. Who is the interested party for this collateral application? TrueCoin, LLC, the entity behind TrueUSD (“TUSD”), and by Techeryx. 2. Provide a brief high-level overview of the project, with a focus on the applying collateral token. TrueUSD (TUSD) is the first independently-verified digital asset redeemable 1-for-1 for US Dollars. It is the first regulated stablecoin fully backed by the US Dollar. Techteryx, an Asia-based conglomerate with businesses in Hong Kong, Singapore, Guangzhou, Shenzhen, Beijing, etc. in the traditional real estate, entertainment, environmental, and information technology industries, is committed to meeting the need for financial innovation globally amongst traditional sectors. All TUSD funds are held by fully licensed and regulated banks and trust companies in the United States and Hong Kong, including PrimeTrust (https://www.primetrust.com/), Silvergate Bank (https://www.silvergatebank.com/) and First Digital (https://1stdigital.com/), Signature Bank (https://www.signatureny.com). TUSD is minted by users initiating a US dollar wire transfer to the banks that TrueUSD has established partnerships with (mentioned above). The US dollars are held in escrow at the corresponding financial institution. For every TUSD minted there is a corresponding US dollar in a bank account subject to ongoing accounting audits by a reputable third-party CPA, Armanino LLP (“Armanino”). TUSD is a fiat-backed stablecoin and honors transparency with 24/7 on-chain attestations by Armanino, making it a great option to diversify the stablecoin selections here on Maker. Diversification is important in investment strategy, and we are confident it would be beneficial for both TrueUSD and the Maker community to support TUSD as collateral on PSM. Through this collaboration, we can jointly welcome new users to experience DeFi on MakerDao, renowned as one of the first DeFi projects established in the industry. 3. Provide a brief history of the project. MAY 2018 - TUSD lists on Binance SEP 2018 - Market cap exceeds $100 million AUG 2019 - TUSD launches on Binance Chain SEP 2020 - Market cap exceeds $500 million MAR 2021 - TUSD launches natively on Avalanche Chain APR 2021 - TUSD launches natively on TRON Chain MAY 2021- TUSD launches natively on Binance Smart Chain JUN 2021- TUSD breaks all-time market cap record at over $1.7 billion OCT 2021- TUSD reaches $300 million in circulating supply on TRON OCT 2021- TUSD launches the TrueUSD Fountain Incentive Plan 4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. White Paper: TUSD_WhitePaper.pdf (trueusd.com) Website: Home | TrueUSD Source Code: https://github.com/trusttoken/smart-contracts Ethereum: https://etherscan.io/address/0x0000000000085d4780b73119b644ae5ecd22b376 TRON: https://tronscan.org/#/contract/TUpMhErZL2fhh4sVNULAbNKLokS4GjC1F4/code BSC: https://bscscan.com/address/0x14016e85a25aeb13065688cafb43044c2ef86784 BC: https://explorer.binance.org/asset/TUSDB-888 Avalanche: https://avascan.info/blockchain/c/address/0x1c20e891bab6b1727d14da358fae2984ed9b59eb  Polygon: https://polygonscan.com/token/0x2e1ad108ff1d8c782fcbbb89aad783ac49586756 Arbitrum: https://arbiscan.io/token/0x4d15a3a2286d883af0aa1b3f21367843fac63e07 Fantom: https://ftmscan.com/address/0x9879abdea01a879644185341f7af7d8343556b7a HECO: https://hecoinfo.com/token/0x5eE41aB6edd38cDfB9f6B4e6Cf7F75c87E170d98 5. Link any available audits of the project. Both procedural and smart contract-focused audits. Link to technical audits from Armanino TrustExplorer - real-time audit 6. Link to any active communities relating to your project. Twitter: TrueUSD (@tusd_official) / Twitter Medium：https://trueusd.medium.com/ Telegram: @TUSDofficial_EN Weibo: https://weibo.com/u/7569099718 7. How is the applying collateral type currently used? TrueUSD is a USD-backed stablecoin. It is used by traders exchanging it for other assets on cryptocurrency exchanges. 8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? More than one organization carries responsibility for the collateral. These entities reside in the US and Hong Kong. 9. Where does exchange for the asset occur? TUSD has trading pairs such as Binance, Huobi, Bittrex, Digifiinex, OKEx, Poloniex, HitBTC, KuCoin, MEXC, for Centralized Exchanges and SushiSwap, Uniswap, Ellipsis, Pangolin, and PancakeSwap, for Decentralized Exchanges. Additionally, TUSD can be exchanged at a fixed 1:1 rate on the TUSD exchange. 10. (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. n/a ",
                    "links": [
                        "https://www.silvergatebank.com/",
                        "https://1stdigital.com/",
                        "https://www.signatureny.com",
                        "https://trueusd.com/pdf/TUSD_WhitePaper.pdf",
                        "https://trueusd.com/",
                        "https://github.com/trusttoken/smart-contracts",
                        "https://etherscan.io/address/0x0000000000085d4780b73119b644ae5ecd22b376",
                        "https://tronscan.org/#/contract/TUpMhErZL2fhh4sVNULAbNKLokS4GjC1F4/code",
                        "https://bscscan.com/address/0x14016e85a25aeb13065688cafb43044c2ef86784",
                        "https://explorer.binance.org/asset/TUSDB-888",
                        "https://avascan.info/blockchain/c/address/0x1c20e891bab6b1727d14da358fae2984ed9b59eb",
                        "https://polygonscan.com/token/0x2e1ad108ff1d8c782fcbbb89aad783ac49586756",
                        "https://arbiscan.io/token/0x4d15a3a2286d883af0aa1b3f21367843fac63e07",
                        "https://ftmscan.com/address/0x9879abdea01a879644185341f7af7d8343556b7a",
                        "https://hecoinfo.com/token/0x5eE41aB6edd38cDfB9f6B4e6Cf7F75c87E170d98",
                        "https://real-time-attest.trustexplorer.io/truecurrencies",
                        "https://twitter.com/tusd_official",
                        "https://trueusd.medium.com/",
                        "https://t.me/TUSDofficial_EN",
                        "https://weibo.com/u/7569099718",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/21",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/weekly-relay-january-11-17-2022/12699",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-10-de-enero-de-2022/12561",
                        "https://forum.makerdao.com/t/weekly-relay-january-4-10-2022/12544",
                        "https://forum.makerdao.com/t/relay-semanal-11-al-17-de-enero-2022/12712"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Board composition",
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.74267500791891
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#2",
                    "likes": "2",
                    "time": "19/12/2021-21:18:46",
                    "content": "Hi @AnnabelTUSD, thank you for your post. Can I just ask you to clarify that you’re applying specifically for a TUSD PSM? TUSD has already been onboarded to the Maker Protocol but currently has a Debt Ceiling of 0. If you were looking to utilise the Vault architecture and not PSM then a Signal Request to raise the Debt Ceiling may be more appropriate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AnnabelTUSD",
                    "index": "#3",
                    "likes": "1",
                    "time": "21/12/2021-06:25:53",
                    "content": "Hello @Patrick_J, thank you for your comment. Thank you for confirming, that is correct we are applying specifically for a TUSD PSM. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#4",
                    "likes": "3",
                    "time": "04/01/2022-10:40:30",
                    "content": "for those being late to the party - there was a bit of turmoil around TUSD a year ago, leading to the Debt Ceiling being set to 0.  If you want to read up what happened last year, here are some good threads:     TUSD is undergoing a material change to its ownership structure. Is there a process for reducing exposure in the event of a material change? Risk       The team behind TUSD announced that ownership of the token will be transferred to another entity:   Today, we’re proud to announce TUSD will enter the next stage of its growth. Ownership of TUSD will be moving over to an Asia-based consortium that will be working with TRON to develop TUSD on Ethereum, TRON, and other blockchain networks.   The TUSD contracts are upgradeable, and this new (and seemingly unknown) entity will be able to update the token at will. Because of this, I would imagine tha…         [Signal Request] Manage TUSD exposure due to ownership change Signal Archive       We had a long discussion those last 2 weeks regarding the change of ownership of TUSD (not to be confused with USDT). You can read all the arguments here.  The current DC is $135M. $53M DAI are borrowed. This is locking 20% of the total amount of TUSD in circulation. It doesn’t generate any revenue for us but helps a bit to keep the peg (but any stablecoin will do).  Now is the time for action.   How do you want to handle TUSD? Please vote below.  If the set DC to 0 wins, no new DAI will be mint…     I have no idea if something happened in the meantime. ",
                    "links": [
                        "https://forum.makerdao.com/t/tusd-is-undergoing-a-material-change-to-its-ownership-structure-is-there-a-process-for-reducing-exposure-in-the-event-of-a-material-change/5691",
                        "https://medium.com/@tusd-social-media/scaling-trust-announcing-tusds-next-stage-of-growth-f1fb58d62b",
                        "https://forum.makerdao.com/t/signal-request-manage-tusd-exposure-due-to-ownership-change/5821",
                        "https://forum.makerdao.com/t/tusd-is-undergoing-a-material-change-to-its-ownership-structure-is-there-a-process-for-reducing-exposure-in-the-event-of-a-material-change/5691"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2547846889952154
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AnnabelTUSD",
                    "index": "#5",
                    "likes": "2",
                    "time": "11/01/2022-07:29:17",
                    "content": "Dear @ultraschuppi and MakerDao community, Thank you for your comment regarding our application as a PSM for MakerDAO. We are more than happy to answer in a clear and transparent way and add to the information you have provided. First and foremost, we would like to address the articles published in December 2020, and confirm that the data originally provided to the community upon TrueUSD’s transition from TrustToken to Techteryx is still accurate:  TrueUSD is still working hand in hand with the Trusttoken team for compliance and operations, and that banking partners are still the ones Trusttoken works with, namely PrimeTrust (https://www.primetrust.com/ ), Silvergate Bank (https://www.silvergatebank.com/), First Digital (https://1stdigital.com/ ), and Signature Bank (www.signatureny.com). The smart contracts remain the same to this day. TrueUSD is still being audited by Armanino, who, in addition to live attestations of stablecoins, also provide “proof of reserves” audits for exchanges (Proof of Reserves | Armanino).  Since those articles were posted, TrueUSD has launched on additional chains (Avalanche, TRON, Binance Smart Chain, Fantom, Polygon, and Cronos), on top of Binance and Ethereum. TUSD user addresses have also exceeded over 400,300 and our market cap reached an all-time high record of over $1.7 billion. We also started working with over 40 DeFi projects that include lending protocols such as AAVE, Venus, and Scream, and all of which TUSD has decently high utilization rates as a collateral asset. We also launched a stablepool on Balancer Protocol, providing rewards and liquidity on Polygon for our users to enjoy. We strive to provide our users with countless opportunities for them to use their TUSD across multiple chains while maintaining our commitment to transparency and security in services and product. And to help develop more DeFi ecosystems, we have launched our Fountain Incentive Plan worth $1 billion. Once again and as it was originally mentioned last year, we would like to assure the Maker community of our commitment to TrueUSD’s transparency and security in our services and product. We appreciate any questions presented and will address them in a timely and explanatory manner. ",
                    "links": [
                        "https://www.silvergatebank.com/",
                        "https://1stdigital.com/",
                        "http://www.signatureny.com",
                        "https://www.armaninollp.com/software/trustexplorer/proof-of-reserves/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.224985883681536
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/rare-collateral-onboarding-application-mip6/9944",
            "title": "[RARE] - Collateral Onboarding Application MIP6 ",
            "index": 9944,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/1confirmation",
                    "index": "#1",
                    "likes": "5",
                    "time": "19/08/2021-17:27:20",
                    "content": "1. Who is the interested party for this collateral application?  1confirmation SuperRare  2. Provide a brief high-level overview of the project, with a focus on applying collateral token. SuperRare is a primary marketplace for high end one of one cryptoart. $88M+ in artwork has been sold on SuperRare this year and the platform has generated $11M+ in fees. On August 17th the RARE token was airdropped to the artists and collectors who contributed to the platform since the beginnning. SuperRare platform fees now go to the DAO treasury and RARE holders govern the platform. Incentives are aligned between team, investors, and the community. 3. Provide a brief history of the project. SuperRare was founded by John Crain, Charlie Crain, and Jonathan Perkins in 2018. The team pioneered cryptoart and the first mint on SuperRare was Robbie Barrat’s AI Generated Nude Portrait #1 on April 5th, 2018. Since then the team has built the SuperRare brand as the leading brand in cryptoart and helped launch hundreds of massively successful artists including Xcopy, Hackatao and Pak. 4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  SuperRare 2.0 docs Etherscan  5. Link any available audits of the project. Both procedural and smart contract focused audits. N/A 6. Link to any active communities relating to your project.  Discord Twitter   7. How is the applying collateral type currently used? RARE is a governance and curation token used to govern the SuperRare platform. 8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? The RareDAO Foundation currently bears legal responsibility for RARE and is a Cayman based non-profit. 9. Where does exchange for the asset occur? Decentralized exchanges such as Uniswap v2 and v3. 10. (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. N/A 11. (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. N/A 12. (Optional) List any possible oracle data sources for the proposed Collateral type. N/A 13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type. N/A ",
                    "links": [
                        "https://superrare.com/",
                        "https://dune.xyz/rchen8/superrare_4",
                        "https://twitter.com/SuperRareJohn",
                        "https://twitter.com/shredcitynation",
                        "https://twitter.com/SuperRarePerks",
                        "https://superrare.com/artwork/ai-generated-nude-portrait-1-1",
                        "https://twitter.com/XCOPYART",
                        "https://twitter.com/Hackatao",
                        "https://twitter.com/muratpak",
                        "https://docs.superrare.com/",
                        "https://etherscan.io/address/0xba5bde662c17e2adff1075610382b9b691296350#code#F1#L1",
                        "https://discord.com/invite/pGeAWrP?ltclid=5d836963-7c60-4664-b39d-5786828384ee",
                        "https://twitter.com/SuperRare",
                        "https://forum.makerdao.com/t/collateral-onboarding/10367/4",
                        "https://forum.makerdao.com/t/maker-relay-ep-62/10311",
                        "https://forum.makerdao.com/t/maker-relay-ep-61/10214",
                        "https://forum.makerdao.com/t/maker-relay-ep-61-en-espanol/10376",
                        "https://forum.makerdao.com/t/laser-focus-of-makerdao-efforts-to-get-from-6b-to-100b-and-1trillion/9957",
                        "https://forum.makerdao.com/t/maker-relay-ep-62-en-espanol/10399",
                        "https://forum.makerdao.com/t/collateral-status-index/2231"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Law and regulations",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.819812925170068
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "0",
                    "time": "20/08/2021-13:33:25",
                    "content": "Is this the etherscan address of RARE token? https://etherscan.io/token/0x93dfaf57d986b9ca77df9376c50878e013d9c7c8 Or perhaps I should ask the question I am trying to answer. What is the entire Market Cap of the RARE token? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "0",
                    "time": "20/08/2021-13:39:18",
                    "content": "MC:  $147M FDV: $1.1B But of course, FDV is just a meme  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "1",
                    "time": "20/08/2021-13:43:50",
                    "content": "    flipflopflapdelegate:  MC: $147M   where did you get this - on coingecko?    I am trying to answer a question of even if we do all the work making a vault here how much DAI will this mint.   Like RARE has to participate in governance, and is used to do what else.   How much of this market can we have any hope of expecting to make it into a vault. Example:  BAT has like MC of 1.155B  and we have only 10.4M locked BAT (1%) minting 1.4M DAI paying 4%.  This vault earns Maker a whopping 56K DAI a year.   Does this even pay for all the costs involved in adding it.? If RARE even gets to 1% of MC locked minting DAI will the revenues generated be worth the effort? We have RWA looking to get on-line here ready to mint 10’s of Millions of DAI.   Should we even be bothering to consider MIP6 applications that can’t justify 10M DAI minted or more? BTW:  At current 6B the idea we get to 10B via MIP6 applications even doing 10M is so out of whack as almost to be funny.   Maker has limited resources,  the DAO really needs to focus these limited resources to actually get to the bigger fruit not at picking up scraps.   I like RARE and a lot of other DAO communities btw but if they are coming to the table here I want to see 100M or above as realistic DAI minting to devote time to bringing forward. I don’t want this to be a slight on any other community but really just a statement of a practical view of Maker and really MakerDAO practicalities at this point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.599378881987578
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "0",
                    "time": "20/08/2021-13:48:26",
                    "content": "    MakerMan:  Like RARE has to participate in governance, and is used to do what else.   Indeed–Coingecko. And you’re right–RARE is use for DAO Governance–for now. I agree–this might be another BAT–we’ll see what Risk, Oracles, etc., report back. IMO we should focus more on ETH, RWAs, and the top 3 Uniswap LP tokens (winding down the USDC risk gradually) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.144444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#6",
                    "likes": "5",
                    "time": "20/08/2021-16:19:08",
                    "content": "I think there’s an opportunity here for the Growth team to use a deeper integration of Dai on SuperRare to  help MakerDAO prioritize the application. Delegates - what level of priority would you advocate for this application if SuperRare allowed Dai transactions on the platform and made it their exclusive stablecoin? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "2",
                    "time": "20/08/2021-16:20:25",
                    "content": "Not really familiar with the platform, but I think any ecosystem that is willing to denominate prices in DAI rather than ETH or USD deserves special consideration. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.699404761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#8",
                    "likes": "0",
                    "time": "20/08/2021-16:23:02",
                    "content": "I don’t think we should force pricing in Dai, for the record. Just offer it as an alternative to ETH and make sure Dai has preference above other stablecoins (whether through exclusivity or another means). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#9",
                    "likes": "1",
                    "time": "20/08/2021-16:29:44",
                    "content": "    g_dip:  if SuperRare allowed Dai transactions on the platform and made it their exclusive stablecoin?   Nice scenario. I like it. No-brainer–high priority, IMO. I’ve seen USDC have a ton of success on the NFT latent FLOW blockchain. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#10",
                    "likes": "2",
                    "time": "20/08/2021-18:28:35",
                    "content": "I’m not a recognized delegate, but my opinion is that NFTs are a ridiculous idea. I’m not in favor of investing resources to support NFTs because I foresee them becoming worthless in the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.145833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#11",
                    "likes": "0",
                    "time": "20/08/2021-18:46:37",
                    "content": "Personally—I’m more of a fanatic of Decentralized Finance—although I do hold some NFTs—but I do see  that there is a sentiment brewing by the Ethereum community—where some agree with you, and others believe NFTs are a good way to grow the network. A good example of this:   twitter.com    DCinvΞstor @iamDCinvestor    so many old school crypto people HATED DeFi, and now they HATE NFTs  what'd you think adoption was going to look like?  decentralized bank accounts where everyone is paying for $1 coffee?  we may get there, but that was never the value proposition of digital decentralized assets   12:58 PM - 20 Aug 2021           160                16            I guess time will tell. IMO, I think it’s 2-1 odds NFTs are a “big deal” 10 years from now. ",
                    "links": [
                        "https://twitter.com/iamdcinvestor/status/1428702928764870657?s=21",
                        "https://twitter.com/iamdcinvestor/status/1428702928764870657?s=21",
                        "https://twitter.com/iamdcinvestor/status/1428702928764870657?s=21"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#12",
                    "likes": "1",
                    "time": "20/08/2021-18:49:35",
                    "content": "I didn’t mean to exclude non-delegate community members, that was a poor choice of words on my part! I would encourage you to consider that regardless of whether NFTs have “value,” there’s clearly some value in the platforms that facilitate their trading. You may not want to buy beanie babies, but you probably wanted to own Ty stock in the late 90s. Fads come and go, but marketplaces have been historically good investments, and it’s my understanding that RARE provides fees from the marketplace transactions. Personally I think that Dai being used in high volume transactions, regardless of what those transactions are for, is a win. But I respect your opinion to the contrary. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.77375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#13",
                    "likes": "3",
                    "time": "20/08/2021-18:54:52",
                    "content": "    flipflopflapdelegate:  so many old school crypto people HATED DeFi, and now they HATE NFTs   That’s not me. I was an early investor in DeFI and continue to love it.     g_dip:  Fads come and go, but marketplaces have been historically good investments   Yeah, I acknowledge that, but I’d prioritize other things first. If we find that we have ample resources to onboard meme tokens and NFTs then why not, I guess? At worst, we can make money on liquidation penalties. However, I don’t see these as long-term investments. “I think it’s 2-1 odds NFTs are a “big deal” 10 years from now.” OK, but 20 years? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.927083333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#14",
                    "likes": "2",
                    "time": "23/08/2021-14:48:07",
                    "content": "I am adding my two dai here. RARE tokens are similar to MKR in that holders set certain parameters on the RARE platform, which is the NFT/digital art equivalent to the Guggenheim, Centre Pompidou or the MOT in Tokyo. I’m not sure what is being planned or discussed for the token’s future functionality, but it can and should begin to earn fees drawn from primary and secondary art sales on the platform. For holders, it starts to look like an equity share in Sotheby’s or Christie’s, so pretty cool. From our standpoint, we have a decentralized crypto asset that offers exposure to a growing marketplace in a hot space (NFTs). Many long-term RARE supporters, like 1Confirmation, are MKR holders, so there is a philosophical alignment among the projects. And the more decentralized valuable assets on the platform, the better diversified we are as far as our primary product offering (vaults). RARE might not be grand slam collateral, but onboarding it is another step in the right direction. Lastly, with Growth’s outreach, I believe we can convince the Superrare team to (i) use vaults for RARE treasury management and (ii) list Dai as a purchasing currency on the platform. Both developments would positively impact Maker and Dai expansion and promote Dai over centralized fiat token alternatives. NB - - I am a digital art collector and RARE holder and plan to open a RARE vault if the opportunity arises. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.056426332288401
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#15",
                    "likes": "0",
                    "time": "14/04/2022-03:53:29",
                    "content": "Collateral Engineering Services (CES) is following up with Greenlit collateral applications that have been open for some time. I want to notify you of some changes we have made in the past month. If you are interested in continuing the collateral onboarding process, we ask that you update your application using the most current template, MIPs Portal. Note the current recommended guidelines for onchain collateral, MIP6 Recommended Guideline Metrics for Onchain Collateral Onboarding. Please reply within a week as to your intention. If we do not hear back from you, your collateral application will be marked as inactive and you will need to reapply. To reapply, please start with a new MIP6 application. The collateral onboarding process is documented here, https://collateral.makerdao.com/ Thanks RARE! ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-recommended-guideline-metrics-for-onchain-collateral-onboarding/14503",
                        "https://collateral.makerdao.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.546401515151516
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/curvelp-steth-eth-mip6-collateral-onboarding-application/10229",
            "title": "[CurveLP-stETH-ETH] MIP6 Collateral Onboarding Application ",
            "index": 10229,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "steth",
                "curve-lp",
                "eth",
                "curvelp-steth-eth"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "8",
                    "time": "08/09/2021-23:12:35",
                    "content": "[CurveLP-stETH-ETH] MIP6 Collateral Onboarding Application for stETh-ETH LP Token  Who is the interested party for this collateral application?  @elprogreso on behalf of the MakerDAO Community  Provide a brief high-level overview of the project, with a focus on the applying collateral token.  Curve finance is a decentralized exchange platform focusing on swaps between like assets (stablecoins, wrapped assets, etc). The Curve AMM formula provides amplified liquidity around 1:1 ratio, which allows for larger trades with low slippage and better capital efficiency.  Provide a brief history of the project.  Curve launched in the beginning of 2020 with USD stablecoin pools. Since then, Curve has moved forward and provided liquidity for other tokens. In January 2021, Curve began supporting the stETH pool–which is a liquidity pool that contains stETH and ETH, that allows Users to interact with these pools to purchase stETH, or ETH with low slippage. Any transactions that take place within this pool are paid out to liquidity providers via trading fees in CRV. Why is the Curve stETH-ETH liquidity pool important? Without a liquidity pool for stETH, users cannot swap their stETH for ETH. This swapping between stETH and ETH effectively unstakes their ETH from the Lido contract. Without any liquidity pools, users will not be able to unstake their staked ETH until Ethereum launches Phase 2. To incentivize liquidity for stETH, liquidity providers are rewarded for providing their tokens into the Curve liquidity pool. In this way, liquidity providers will be incentivized to keep Lido liquid, where users can decide to un-stake their ETH at any time for whatever amount.  Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  Curve whitepaper: Curve.fi Documentation: https://resources.curve.fi/ Curve.fi Lido architecture: Architecture - Lido Website:   Curve: https://www.curve.fi/    Lido: https://lido.fi/   Curve Source Code: GitHub - curvefi/curve-contract: Vyper contracts used in Curve.fi exchange pools. stETH/ETH Curve Pool token contract: https://etherscan.io/address/0xDC24316b9AE028F1497c275EB9192a3Ea0f67022 Additional Domain Work Performed:     [stETH] Collateral Onboarding Risk Evaluation Domain Work       Legal Disclaimer: This communication is provided for information purposes only. The views expressed here are those of the individual quoted or who present said materials and are not the views of Maker Foundation (“Maker”) or its affiliates. This communication has been prepared based upon information, including market prices, data and other information, from sources believed to be reliable, but Maker has not independently verified such information and makes no representations about the enduring a…      Link any available audits of the project. Both procedural and smart contract focused audits.  Audits: Curve.fi Audits: Lido by Quantstamp Audits: Lido by MixBytes  Link to any active communities relating to your project.  Twitter: https://twitter.com/CurveFinance Telegram: Telegram: Contact @curvefi Telegram: Contact @curveficn Discord: Curve Finance Discord: Lido Telegram: Lido Twitter Lido: https://twitter.com/LidoFinance  How is the applying collateral type currently used?  CurveLP-stETH-ETH is a source of liquidity for trading between stETH and ETH. Users can deposit one or both assets to the pool in exchange for LP tokens, and earn a portion of the fees charged on trades. LP tokens can also be staked in Curve’s gauge contracts to earn inflationary CRV token rewards.  Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in?  Curve LP tokens are permissionless assets, no party bears legal responsibility for the asset.  Where does exchange for the asset occur?  CurveLP-stETH-ETH can be exchanged for underlying assets (in ETH and stETH) directly via the Curve finance, Uniswap v2, and 1inch Liquidity Protocol contracts. ETH (Ethereum) is traded on a wide variety of centralized and decentralized exchanges. Balancer has also released MetaStable Pool launch, for stETH-ETH liquid staking. For more information regarding the co-incentivised pool, please read this Medium article.  (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review.  n/a  (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable.  n/a  (Optional) List any possible oracle data sources for the proposed Collateral type.  n/a  (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type.  n/a Disclosure: I have financial interest in some of the tokens mentioned. This collateral application is for informational purposes only, and does not constitute advice of any kind. You should not construe any such information or other material on this MIP6 Application as legal, tax, investment, financial, or other advice. Nothing contained, or written on this MIP6 Application constitutes a solicitation, recommendation, or, endorsement. Copyright and related rights waived via CC0. ",
                    "links": [
                        "https://resources.curve.fi/",
                        "https://www.curve.fi/devdocs",
                        "https://blog.lido.fi/category/architecture/",
                        "https://www.curve.fi/",
                        "https://lido.fi/",
                        "https://github.com/curvefi/curve-contract",
                        "https://etherscan.io/address/0xDC24316b9AE028F1497c275EB9192a3Ea0f67022",
                        "https://forum.makerdao.com/t/steth-collateral-onboarding-risk-evaluation/9061",
                        "https://www.curve.fi/audits",
                        "https://github.com/lidofinance/audits/blob/main/QSP%20Lido%20Report%2012-2020.pdf",
                        "https://github.com/lidofinance/audits/blob/main/MixBytes%20ETH2%20Oracle%20Security%20Audit%20Report%2004-2021.pdf",
                        "https://twitter.com/CurveFinance",
                        "https://t.me/curvefi",
                        "https://t.me/curveficn",
                        "https://discord.gg/9uEHakc",
                        "https://discord.com/invite/vgdPfhZ",
                        "https://t.me/lidofinance",
                        "https://twitter.com/LidoFinance",
                        "https://medium.com/balancer-protocol/balancer-launches-metastable-pools-to-further-pool-liquidity-9eade44d73d8",
                        "https://creativecommons.org/publicdomain/zero/1.0/",
                        "https://forum.makerdao.com/t/curve-fi-eth-steth-erc20-token-smart-contract-technical-assessment/11855",
                        "https://forum.makerdao.com/t/ultraschuppi-delegate-platform/11193/14",
                        "https://forum.makerdao.com/t/maker-relay-ep-66/10950",
                        "https://forum.makerdao.com/t/maker-relay-ep-73-en-espanol/11900",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/59",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/19",
                        "https://forum.makerdao.com/t/maker-relay-ep-65-en-espanol/10784",
                        "https://forum.makerdao.com/t/maker-relay-ep-65/10697",
                        "https://forum.makerdao.com/t/maker-relay-ep-73/11882",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/maker-relay-ep-66-en-espanol/10982"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Interoperability and Scalability",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.460739614994933
                }
            ]
        }
    ],
    "group_index": "78"
}