{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/events-001-cu-update-month-1/16214",
            "title": "EVENTS-001 CU Update Month 1 ",
            "index": 16214,
            "category": [
                "Discontinued Categories",
                "Events"
            ],
            "tags": [
                "cu-update",
                "monthly-cu-updates",
                "archive-events-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#1",
                    "likes": "14",
                    "time": "29/06/2022-18:42:59",
                    "content": "Our Cu’s first month (ish) in existence has been a very interesting and busy one.  This post is meant to give an overview of what we have been working on and where we are going.  Also, we highlight some strategies for dealing with the bear market.  Month 1   CU Financial Setup  Lots of effort involved here but explaining it all would be like eating dry toast.  Mostly setting up corporations, banking, and consulting with tax lawyers.  Been an interesting learning experience and the DAOs unique setup does not make it easy.    EthCC  First event on our roadmap (Below) Scouting and booking venue Arranging and negotiating partnerships Working with DAIF to host a small presentation for their team    DAIF Collaboration  Implemented some strategies for trademark retention Arranged DAIF presentation for ETHCC    POAPs  Lots of research into this for application for MakerDAO events ETHCC will be a trial for POAP so the team can explore the uses and benefits     Events Roadmap Per our mandate, the funds for our CU have been allocated to host 5 events per fiscal year(May-May).  The following is what the team (In collaboration with other CU teams) has come up with as target locations.  EthCC (Paris) - July 19th This event has been confirmed and will take place on July 19th at The Bridge Club. For this, we have dedicated much of our time to arranging partners to co-host the event with us.  We have lined up 4 partners for this, 1 Inch, TrueFi, Perpetual Protocol, Oasis.App.  As the event approaches we will be releasing tickets.  As always follow the DAIvinity Twitter to catch all the announcements. The partners have contributed funds to the event in line with our strategy below on cost splitting which amounts to 55k DAI. We have started our initial Twitter campaign for this and so far the response is off the charts.  Lots have been sharing their positive experiences from Amsterdam and our inbox is getting filled with ticket requests. Bankless have been very supportive of this event and has created a ticket give away via a POAP for DAIvinity EthCC.  StableCON (July 19th, 8:00pm @ The Bridge Club) The DAI Foundation approached us to help organize a small meeting/presentation regarding the foundation.  We were able to leverage the use of the venue further and arrange this just before the main event.  Please contact @sorenpeter if you would like any more information on this  ETH Warsaw - Sept 1-4 With the recent unanticipated rescheduling of ETH Lisbon, the team had to pivot and find a replacement location/conference.  Two options presented themselves, ETH Warsaw & ETH Buenos Aires. Subsequently, the ETH Warsaw team has reached out to us regarding our interest in hosting an event.  We have been able to work closely with the conference organizers and is now slated to be the official opening event for the conference.  We will give more details on this will follow after ETHCC.  DEVCon (Bogota) - Oct 7-17th One of the largest conferences so it makes complete sense for Maker to have a large presence here.  Currently, the team is in the discovery phase for this event.  We plan to have a venue and date arranged by end of July.  So other than the date range there are not many details to share with this.  ETH Denver - Mid/End Feb ETH Denver is also an obvious choice.  The first DAIvinity was held here and is one of the larger conferences.  Once the actual dates of the conference have been posted we can look into this more  TBD - Date Unknown The final event currently has no location or date.  Most likely this would be in 2023.  If the ETH conferences follow the same date ranges next year then ETH Amsterdam, Permissionless or Consensus could be good targets.  Open to suggestions on this one.  Bear Market Strategy Tagging @strat-fin-core-unit because the below is relevant to your current initiative with budget reductions and return of surplus.  Strategy 1: Cost Splitting As outlined in our CU proposal the team will be using partnerships to offset the event cost.  At the moment our strategy is to cover 50 percent with the other 50 percent covered by our partners.  This still gives Maker the majority share of the event so branding and execution remain in Maker’s control.  As highlighted in the ETHCC event above this so far has been a success and the estimated budget offset for the year if successfully continued would be ~213k DAI.  We would return the excess to the surplus after each event has been completed.  Strategy 2 - Convert 2 Major events to Minor Events Currently as highlighted in our proposal our target is 3 “Major” and 2 “Minor” events for the year. Going forward it is possible to lower the event size and scope of the next two major events beyond ETHCC.  This would reduce the budget by an additional 62K DAI.  Realizing a savings of 275K DAI. This we feel would be under extreme circumstances as the large events are more impactful and allow exposure to a broader audience at conferences.  At this time we are not implementing this strategy but it remains an option on the table.  Projected CU Spend Here is how the above would affect our overall budget.  Both reductions in the table assume that our contingency goes un-used (117,150 DAI) and is returned at the end of our budget cycle.      Budget Reduction (Including Contingency) Projected CU Spend (898k Allowcated budget Minus Budget reduction) Percentage Budget Reduction     Strategy 1 330,000 DAI 568,000 DAI -37%   Strategy 2 392,000 DAI 506,000 DAI -44%     Reoccuring Updates Most CU’s provide updates every month or quarter.  In our CU’s case, we have determined it be best to give updates after events/conferences.  As always anyone is welcome to reach out to us if there are any questions or concerns between these periods. Contributor:  @Leggevents ",
                    "links": [
                        "https://twitter.com/BanklessHQ/status/1542172080166146048?s=20&t=lIFKtt7tBx9MXS4KheSnAQ",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP66",
                        "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151",
                        "https://forum.makerdao.com/t/mip40c3-sp73-modify-core-unit-budget-events-001/15991/71",
                        "https://forum.makerdao.com/t/mip40c3-sp73-modify-core-unit-budget-events-001/15991/42",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-june-2022/16783",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-junio-del-2022/16923",
                        "https://forum.makerdao.com/t/cu-budget-reduction-initiatives-wiki-summary/16448"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8751164923039925
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#2",
                    "likes": "6",
                    "time": "29/06/2022-18:46:00",
                    "content": "    PonJerry:  Bear Market Strategy Tagging @strat-fin-core-unit because the below is relevant to your current initiative with budget reductions and return of surplus.   Really appreciate the initiative @PonJerry thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "27/09/2022-18:46:02",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}