{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/liquidation-to-a-basket-of-assets-rather-than-dai/3173",
            "title": "Liquidation to a basket of assets rather than Dai ",
            "index": 3173,
            "category": [
                "Governance"
            ],
            "tags": [
                "idea",
                "liquidation-system"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#1",
                    "likes": "0",
                    "time": "10/07/2020-20:35:27",
                    "content": "In the circumstance where MakerDao is under Dai price pressure liquidation of Vaults into Dai is problematic as it increases the demand for Dai further. What if instead of liquidations taking place in Dai when Dai price is out of range (whatever that is determined to be) the vaults were liquidated instead into a basket of other assets priced by the oracles and Dai was issued by the MakerDao system to sell to the market in order to purchase those assets. This way the Dai price pressure is downward and Dai supply raises to keep balance with Dai demand, yet the system stays fully backed by collateral in all cases (including all of the new Dai issued). As a result of the Dai price being so high and out of range this can occur without limit.  MakerDao is selling $1.00 for $1.05 or whatever the Dai price is and this can keep happening until Dai demand gets back into balance. When demand for Dai is in balance again then Vaults can again switch to liquidation for Dai to repay Dai debt.  So long as the assets in the system are diversified enough I don’t see a reason that this wouldn’t be sustainable forever. Also this is significantly better because in cases where the market is crashing which is usually the case when liquidations occur MakerDao is buying distressed assets and providing liquidity instead of the opposite which helps stabilize rather than exacerbate the crash in asset prices.  It is important to note that these assets are diversified so that MakerDao is not buying any one asset too much as that asset falls to $0.00 as that would be a huge issue. This whole system is built on balance, so anything that can be done to balance supply of Dai with demand for Dai should be a good thing as far as I understand.  I believe this change to the liquidation process accomplishes that elegantly and leads to better balance overall. ",
                    "links": [],
                    "GPT-summary": "The author proposes a new liquidation process for MakerDao in which vaults are liquidated into a basket of other assets priced by the oracles, and Dai is issued by the MakerDao system to sell to the market in order to purchase those assets. The proposal aims to keep the Dai price pressure downward and Dai supply raised to keep balance with Dai demand, yet the system stays fully backed by collateral in all cases. The proposal is open to constructive criticism and questions, and can be audited and reviewed.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.887200956937799
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#2",
                    "likes": "0",
                    "time": "10/07/2020-20:42:06",
                    "content": "The crash that happened in March for example would have been mitigated almost entirely by this approach.  MakerDao would have been buying assets cheaply and selling Dai at high prices rather than the exact opposite which is what resulted in the mess that took place. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.529166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#3",
                    "likes": "1",
                    "time": "10/07/2020-20:42:35",
                    "content": "Nice but with the PSM mechanism anyone can switch their stablecoin to dai and cancel the debt. Perhaps it could be included so that it would go through the PSM and the dai would go directly to cancel it to avoid that extra step ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#4",
                    "likes": "0",
                    "time": "10/07/2020-20:43:55",
                    "content": "Can you elaborate in more detail.  I am not following. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#5",
                    "likes": "0",
                    "time": "10/07/2020-20:51:47",
                    "content": "Perhaps I did not understand correctly but if what you mean is why not cancel the debt in another stablecoin, if the PSM is implemented vault owners would have access to DAI so we should not have an issue there, they could swap their USDC for DAI to cancel the debt. The second part is if in extreme circumstances there is congestion perhaps there could be an option to cancel the debt in another stablecoin for the vault owner and inside the process there would be the PSM operating taking the USDC and cancelling the debt with DAI ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.270833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#6",
                    "likes": "0",
                    "time": "10/07/2020-20:53:40",
                    "content": "What this accomplishes is bouncing the price of Dai back down to where it belongs before MakerDao goes selling any assets for overpriced Dai.  It ensures that when MakerDao does trade assets for Dai that the Dai is in range price wise.  If not, MakerDao grows the Dai supply until that point and buys up distressed assets in the process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.907407407407408
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#7",
                    "likes": "0",
                    "time": "10/07/2020-21:01:39",
                    "content": "OH, you had said PMP so I was very confused haha.  You have since changed it to PSM.  I am not entirely sure how a PSM would play into this since PSMs are new, but if I had to guess I would say that the PSMs do sort of the same thing.  They increase the Dai supply while simultaneously increasing the collateral to back that Dai.  The idea I first mentioned here for the PSM or a simpler version is what I had in mind for the PSM.  I realize now that this doesn’t 100% work because at the upper range of Dai price the demand is being generated at the same speed we are trying ot reduce it which gets MakerDao nowhere. By first increasing the Dai supply and selling Dai while it is expensive and then afterwords doing the opposite MakerDao can keep the balance much better. ",
                    "links": [
                        "https://forum.makerdao.com/t/short-and-sweet-psm-implementation/3166/6"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.025524475524476
                }
            ]
        }
    ]
}