{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp7-modify-protocol-engineering-core-unit-budget/6832",
            "title": "MIP40c3-SP7: Modify Protocol Engineering Core Unit Budget ",
            "index": 6832,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "core-unit",
                "pe-001",
                "core-unit-budget"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "26",
                    "time": "04/03/2021-00:04:42",
                    "content": " MIP40c3-SP7: Modify Protocol Engineering Core Unit Budget  Preamble MIP40c3-SP#: 7 Author(s): Smart Contract Domain Team Contributors: N/A Status: Formal Submission (FS) Date Applied: 2021-03-03 Date Ratified:   Sentence Summary MIP40c3-SP7 adds the budget for the Protocol Engineering Core Unit.  Specification  Motivation I am proposing this budget for the Protocol Engineering Core Unit to be able to succeed in its mandate, specifically; to extend the functionality of the Maker protocol, assist with the maintenance and operation of existing smart contracts and ensure the safety and correctness of protocol design and implementation. The team’s scope involves a significant level of responsibility and exposure, demonstrated by over $7 billion of total value locked in the Maker Protocol. This is coupled with the constant and necessary addition of collateral types, executive votes and code reviews to ensure protocol safety and growth.  New Information: The title of the team has been updated from Smart Contracts Core Unit to Protocol Engineering Core Unit to better reflect the longer-term growth and our mandate to support ongoing protocol implementation, growth, and safety/security. As per the recently updated Protocol Engineering Core Unit MIP (specifically; Motivation, Team Structure and Layer2 Development sections), this proposal has been updated to include two additional senior engineers focusing on growth and innovation, specifically Layer2 development. All data has been updated to reflect this addition below.   Core Unit Name Protocol Engineering Core Unit  Budget Considerations The following considerations have been taken into account when building the budget to ensure a competitive package that allows the DAO to retain and attract talent by providing:  A competitive salary in-line with industry standards Healthcare to compete with traditional company offerings Travel budgets to promote team visibility and speaking at industry events A sign-on bonus to attract new employees  There is also recognition to support the team by removing blockers and covering overhead costs involved in daily work, including:  Hardware for smart contract deployment and independent testing A bug bounty to promote engagement with community whitehat hackers Funds to support audit activities and code reviews for security awareness Funds to cover gas and contract deployments Overhead support for team filing, accounting, legal and reporting A buffer to accommodate unforeseen costs  Compiling the above considerations along with market/competitor research has helped define the following budget.  Budget The yearly budget request for the Protocol Engineering Core Unit is $6.12m. This equates to a $510k monthly expense to support the team mandate. This budget secures a team of 11 - 16 full-time and part-time smart contract engineers, including a team facilitator. It also includes coverage for all operational costs, audits and overheads as presented below;     Summary      Salaries $4,240,250   Healthcare $228,000   Travel $180,000   Hardware $45,000   Referral & Sign-on Expense $100,000   Audits $375,000   Bug Bounty $100,000   Gas Costs $150,000   SC Verification & Quality Assurance $376,000   Legal and Operating expenses $28,500   Contingency Buffer $297,250       Total $6,120,000    Illustrating these details as a percentage of the total budget request for overall comparison:  919×434 54 KB   Budget Details: Providing additional detail with regards to the above line items; Salaries: The current team has 9 full-time smart contract engineers, 1 part-time smart contract engineer, and 1 proposed Team Facilitator (for a total of 11 members). The team is seeking to grow this by 5 members to a total of 16 members. This opportunity to scale will enable us to better meet the demands of the community. Healthcare: In order to align with traditional company offerings, this proposal includes a healthcare supplement averaging $1188 p/month for full-time employees, based on residency to account for local cost variations. Travel: Engineers may travel to present at industry events or participate in a team offsite. Hardware: In order to ensure we are able to run multiple ETH nodes to support testing and contract deployment, a supplement for a Dev machine (e.g. Intel Quad Core i7-8565U, 40GB RAM, 512GB NVMe) and test node (e.g. Intel NUC; i5-7300U 2.6 - 3.5 GHz Dual Core, 32GB RAM, 2TB NVMe M.2.) will ensure the team has the hardware in place to achieve this. Referral & Sign-on Expenses: Provided at the discretion of the Facilitator to attract top talent to the team. Audits: We have accounted for approximately 5 audits (depending on the size of the code base being assessed we may need to revisit the budgeted allowance - to be approved by Governance). Typically we work with Gauntlet, PwC, Certora, Quantstamp, Trail of Bits, Consensus, OpenZepplin and Peckshield. Bug Bounty: Bug Bounties allow us to support whitehat involvement in the work we do. Payout amounts will be assessed and determined by the team. $100k is a conservative number for this line item, any increase will be discussed and assessed with Governance. Gas Costs: Based on our deployer addresses in 2020, we spent $36,367 in gas. The 2021 budgeted amount has been extrapolated from the last quarter of gas usage which has seen significantly higher gas congestion. SC Verification & Quality Assurance: Part of the team’s focus is on protocol security by verifying high-level properties of the system along with low level bytecode verification. This involves; full year engagement with a 3rd party, dedicated resources and the use of external tooling, to ensure repeatable quality assurance across smart contracts and the development of new tooling. Legal and Operating Expenses: Coverage for managing general operational overhead, legal costs including entity creation, legal officer/company insurance, as well as monthly and annual financial reporting. Contingency Buffer: Approximately 5% of budgeted costs to be sidelined in the event that we underestimated this budget cycle.  MKR Vesting The Protocol Engineering Team is proposing to award 0.1% of the existing MKR supply to each full-time team member, (equivalent to 995 MKR) vested over 4 years. Example payout: Each person staying with the project for the full first year will be entitled to 25% of their award - the equivalent of 248.75 MKR. For our team of 16 (including both full and part-time employees) this is a total of 3855.625 MKR to be awarded at the end of the first year. For reference, our current annual MKR burn is 34,054 MKR or 3.54% of remaining MKR. Details:     Protocol:      Current MKR supply: ~995,000 MKR   Current annual MKR burn: 3.54% (equivalent to 34,054 MKR)   Proposal:    MKR minting: Governance using DssVest will mint MKR   Allocation per full-time individual over 4 years: 0.1% (equivalent to 995 MKR)   Allocation per part-time individual over 4 years: 0.05% (equivalent to 497.5 MKR)   1 year cliff for full-time individual: 25% of allocation (equivalent to 248.75 MKR)   1 year cliff for part-time individual: 25% of allocation (equivalent to 124.375 MKR)   Total vesting period: 4 years.   Vesting schedule: 25% at the end of the 1st year, 75% at equal increments over the remaining 3 years.   Number of team members: 16   Total team MKR over 4 years (15 full-time and 1 part-time member) 15,422.50 MKR   Total team MKR at the end of 1 year (15 full-time and 1 part-time member) 3,855.625 MKR     What the budget does not include: Additional Audits: We have budgeted for up to $375k in audits, each audit typically costs between $50-$100k. If we exceed this amount, we will request further funding and approval from Governance. Increased Gas Expenses: We have budgeted up to $150k in gas costs. If we exceed this amount, we will request further funding and approval from Governance. Keeper costs: We expect a technical/operations domain team to maintain Keepers, including chief keeper, cage keeper, auction kickers and more. As a result, we have not accounted for maintenance or gas costs of keeping keepers operational.  Conditions - Continuous Operation To ensure 3 months of continuous operation in the event of emergency shutdown or protocol issues, the Protocol Engineering Team will be requesting an upfront lump-sum of $1.3m to sit in a protocol owned multisig. Calculation: The lump sum is the equivalent of 3 months of budgeted salaries and essential team expenses. Detail:  The lump-sum will be held outside of the surplus buffer in a protocol owned multisig If normal protocol operation is not possible due to emergency shutdown or other protocol failure, these funds will be used to ensure employment resources get the system back up and functional At the conclusion of the year, the lump sum will remain in the multisig for the following year and may be increased at that point in time due to team growth or the desire for an increased runway.   Updated multisig details for clarity - Smart Contract Implementation Protocol Engineering Core Unit Multisig: 0xe2c16c308b843eD02B09156388Cb240cEd58C01c  Implementation: Initial distribution to the Core Unit multisig will be manual until the Keg is in place. Ownership: This multisig will be anonymous individuals selected by the Protocol Engineering Team. Frequency: Protocol distributions to the multisig will occur during the last week of the month.  Protocol Engineering Continuous Operation Multisig: 0x83e36aAA1c7b99E2D3d07789F7b70FCe46f0d45E  Implementation: This multisig will be funded in full upon successful onboarding of the Protocol Engineering Core Unit. Access: In order for funds to be accessed from this multisig, the Maker protocol must be in a state where it is unable to pay team salaries due to protocol error, shutdown and/or under governance attack. Ownership: The Continuous Operation Multisig will require 3 of 6 signatures from the following keyholders. This may be expanded to other critical Core Units as they are formed:  Derek (Protocol Engineering): 0xe3a76328edE8Fd61d5fA7840b878Dd69cdfD67d8 Nadia (Growth CU): 0xc8E6c287F6c127AFE5e4CB30bC440607b44c35f8 LongForWisdom (GovAlpha) : 0x66f40F044E0e2F77bB746e3275E82e88dCBA2D69 Primoz (Risk CU): 0x5d67d5B1fC7EF4bfF31967bE2D2d7b9323c1521c SebVentures (RWF): 0x0D61C8b6CA9669A36F351De3AE335e9689dd9C5b Cmooney (Protocol Engineering): 0xEeF3026eF864C9398c008195E65d16D9cb42a512 For transparency: I had previously identified keyholders as CU multisigs (namely: Protocol Engineering, the Interim DAO Multisig and the Growth CU), however due to complexity of using nested multisigs, I updated this to individuals. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp7-adding-protocol-engineering-core-unit/6831",
                        "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-3-smart-contracts-core-unit/6946",
                        "https://forum.makerdao.com/t/discussion-core-unit-budget-incentives-and-vesting/7102",
                        "https://forum.makerdao.com/t/maker-relay-ep-42/7673",
                        "https://forum.makerdao.com/t/weekly-mips-update-34/7668",
                        "https://forum.makerdao.com/t/weekly-mips-update-33/7573",
                        "https://forum.makerdao.com/t/maker-relay-ep-40/7467",
                        "https://forum.makerdao.com/t/weekly-mips-update-32/7464",
                        "https://forum.makerdao.com/t/mip41c4-sp7-facilitator-onboarding-protocol-engineering-core-unit/6833",
                        "https://forum.makerdao.com/t/weekly-mips-update-31/7232",
                        "https://forum.makerdao.com/t/maker-relay-ep-37-en-espanol/7168",
                        "https://forum.makerdao.com/t/maker-relay-ep-37/7154",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-5-11-2021/6978",
                        "https://forum.makerdao.com/t/maker-relay-ep-35-en-espanol/6949",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-march-7th-2021/6935",
                        "https://forum.makerdao.com/t/maker-relay-ep-35/6932",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/20",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-131-thursday-march-4-17-00-utc/6737/10",
                        "https://forum.makerdao.com/t/mip40c3-sp32-adding-makerlabs-core-unit-budget/10108/3",
                        "https://forum.makerdao.com/t/mip-54-dssvest/8025/21",
                        "https://forum.makerdao.com/t/mip39c2-sp12-adding-collateral-onboarding-core-unit/8037/13",
                        "https://forum.makerdao.com/t/adding-protocol-engineering-core-unit-multisig/7915",
                        "https://forum.makerdao.com/t/mip40c3-sp10-modify-core-unit-budget-ses-001/7369/16"
                    ],
                    "GPT-summary": "The post is a proposal for a budget for the Protocol Engineering Core Unit. The author explains the motivation behind the proposal and provides a detailed breakdown of the budget. The post also includes information on the MKR vesting proposal and conditions for continuous operation. The post could receive entirely positive feedback, constructive criticism, or questions from third parties, and some third parties may extend to the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "Board composition",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.308469166887534
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "6",
                    "time": "04/03/2021-00:42:38",
                    "content": "Salaries look great. Couple questions about the MKR vesting. I assume this is related to MIP42: Proposed Compensation Addendum for MakerDAO Contributors. I don’t know how others feel in this regard but would it not make sense to have the amount of MKR vested to you be in relation to your salaries as opposed to a flat MKR rate? Also I’m having trouble clarifying whether this is new MKR minted or MKR bought from the market with DAI at time of vesting or some other implementation. Thanks in advance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.561688311688312
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#3",
                    "likes": "0",
                    "time": "04/03/2021-01:06:21",
                    "content": "@Aaron_Bartsch It looks like this MIP is going with a different implementation of MKR vesting. I’d like to believe MIP42 sparked a conversation about vesting. I think each team can / should decide how to vest each member on an individual basis. Doesn’t need to adhere to a strict % of the salary per se. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#4",
                    "likes": "6",
                    "time": "04/03/2021-01:08:47",
                    "content": "Thanks Aaron! Yes, it is directly related to Brian’s comment in that thread, utilizing the DssVest module. This module would allow the minting of new MKR - so as long as the amount of MKR minted is less than the burn rate, MKR would remain in a state of net deflation. I chose an absolute MKR value as a percentage of existing supply due to simplicity and the ability to provide all members with an equal incentive. Looking at VC’s this seemed to be an industry standard approach to equity sharing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.122348484848485
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#5",
                    "likes": "1",
                    "time": "04/03/2021-01:09:57",
                    "content": "Oh, we would be minting new MKR? but only if it’s less than burn? Why not take out a portion of the MKR before burning it? (Maybe there’s some technical reason why this other implementation is better) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.287247474747475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#6",
                    "likes": "1",
                    "time": "04/03/2021-01:11:23",
                    "content": "Thanks for the quick reply. That is what I assumed from the wording. My intuition is saying that this seems a bit high but if other’s think it’s fair then I won’t complain. People with more knowledge on industry comparables and competitive retention can further weigh in. It would be great if this new MKR could somehow contribute to positive price appreciation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.698316498316498
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#7",
                    "likes": "2",
                    "time": "04/03/2021-01:13:48",
                    "content": "@Aaron_Bartsch  The space is really competitive right now. Retaining talent when other protocols are paying so much is hard. I think the proposed vesting amounts are fair. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.769047619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Uncle",
                    "index": "#8",
                    "likes": "5",
                    "time": "04/03/2021-01:15:20",
                    "content": "    Derek:  This module would allow the minting of new MKR - so as long as the amount of MKR minted is less than the burn rate, MKR would remain in a state of net deflation   I cannot give enough hearts to this.  The deflationary narrative of $MKR must be preserved!  We aren’t the printer-happy $YFI crew (shoutout @banteg).  MKR should only be inflationary if this system is acting poorly. Other than that, I cannot agree more with the SC dev package.  Maker is one of 3-4 CORE Pillars on Ethereum, and we must incentives our talent enough to avoid distractions. If we had this earlier maybe we wouldn’t have lost @nanexcool and @cyrus to the farmers… the world will never know ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.133953168044077
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#9",
                    "likes": "10",
                    "time": "04/03/2021-01:51:15",
                    "content": "I 1000% support this SC Core Unit Budget.  And before you start thinking about the minting of MKR, we should be thankful that they are showing a long-term commitment via 4 year vesting, broken into 25% per year (in-case they leave–which I hope they won’t)–honestly this is a bargain for the Maker Community. And don’t forget-- the most underrated and best kept secrets in the entire DeFi Universe is the MakerDAO Smart Contract Team. Let’s give them our support as one unified community. We are lucky to have them at these low rates. I’m being 100% genuine. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.279761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/textrapper",
                    "index": "#10",
                    "likes": "5",
                    "time": "04/03/2021-03:44:00",
                    "content": "I assume this is a first offer in somewhat good faith, giving the community a chance to negotiate and get these numbers back into the realm of the real world. I am all for fair compensation but this goes beyond that and gives it a multiplier. If we need to look elsewhere for talent what is the process for that? thank you! Also if we the community are going to pay 850k (if MKR goes back to 3k and it looks like its going higher) per dev (i assume all these people are devs — i would hope so) — then this should go out as a wider job offering. For that money every dev should be a legitimate rock star. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#11",
                    "likes": "1",
                    "time": "04/03/2021-04:29:06",
                    "content": "Love your badges <3 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/textrapper",
                    "index": "#12",
                    "likes": "0",
                    "time": "04/03/2021-11:17:58",
                    "content": "What about a system built on more incentive bonuses? Like if MKR 4k is hit a certain bonus is unlocked, and then at 5k and so on. That might better align the interests of the different parties in the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.517857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#13",
                    "likes": "2",
                    "time": "04/03/2021-11:39:39",
                    "content": "Thanks everyone for your comments! Indeed, this space is super competitive - we’ve all personally seen the challenge to retain and attract high quality developers. I fully expect and welcome the discussion that this will generate on both sides of the fence as we agree on a sustainable approach over the long term - we’re not here for farming, interim or short-lived solutions. Sustainability and growth is crucial. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.066666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#14",
                    "likes": "1",
                    "time": "04/03/2021-11:40:44",
                    "content": "The great thing with the DAO in general is that any individual or team can propose their services to Governance, so in theory with the right knowledge and skillset, anyone can put forward a (competing) proposal - in the case of Smart Contracts, the high personal exposure/risk, responsibility/being on call does come at a premium which I believe is a leading factor in why we’ve recently seen such high turnover. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.835
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#15",
                    "likes": "2",
                    "time": "04/03/2021-11:42:24",
                    "content": "Great points @textrapper yeah, vesting structure is a tough one to settle on, some thoughts:  I can’t/don’t want to predict the MKR price as a mechanism to unlock bonuses because in theory it could promote pumping just to unlock bonuses. It would also be unlikely to offer a long-term incentive once the bonus is paid. Tangential to this, I settled on an absolute MKR bonus number instead of a dollar value because I wanted a transparent absolute incentive regardless of MKR price - bear/bull markets could offer a variable bonus and therefore potentially a different incentive model. I would ideally like to look beyond the crypto cycles.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.865079365079366
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Guy",
                    "index": "#16",
                    "likes": "1",
                    "time": "04/03/2021-12:11:13",
                    "content": "Just a question about where the MKR are coming from. Is there a reason they should be newly-created tokens, rather than bought for Dai at the start of the process (which should provide a better deal for the Protocol assuming MKR goes up in value, albeit by a different route). I get that it reduces the cost in the short-term but 1) down the line new supply is created and 2) there’s a scenario in which the team doesn’t get its MKR vesting because not enough tokens are burned, perhaps because the Surplus needs to rise rapidly due to growth, or because MKR are created for another reason. (Aside from a debt auction, you can imagine a scenario where multiple teams adopt the same model, and only one or two actually get the MKR.) Also, minor point, but weighting the vesting towards the end of the period (e.g. 10-20-30-40%) would help retain talent for the full term. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.273253367003367
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#17",
                    "likes": "0",
                    "time": "04/03/2021-13:32:13",
                    "content": "The short answer is that minting is a much more efficient mechanism and is not exposed to the fluctuations of the surplus buffer or the price of MKR. In a bit more detail: Minting MKR tokens from the protocol can occur regardless of whether the surplus buffer is positive or negative. Minting MKR tokens increases the supply, yes, but - what is critical (in the eyes of MKR holders) is for MKR to retain its deflationary narrative and therefore increase in value over time. This occurs when burning > minting. Whatever vesting mechanism is chosen, this needs to remain the case. If, as you suggest, we flip the model and instead have tokens collected from the existing supply, we would decrease the current buy/burn rate in favour of splitting it into burn/allocate amounts. This would expose us to fluctuations in the price of MKR which means it would be unwise to offer an absolute MKR award because you have no idea of knowing the dollar value of what that might actually be - hence a $ value would be more suitable in such a scenario - but then I think this removes the appeal of a vested interest in the appreciation of the MKR token. Interesting, I’ll explore the variable weighting over time idea you mentioned. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.02972027972028
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#18",
                    "likes": "3",
                    "time": "04/03/2021-13:49:04",
                    "content": "Maybe the Foundation should use some of their treasury to actually properly compensate the employees that made this all possible.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Guy",
                    "index": "#19",
                    "likes": "1",
                    "time": "04/03/2021-14:04:19",
                    "content": "Thanks Derek. Those reasons do make good sense. In an ideal world, though, I would hope/expect that everyone who worked for the DAO on any kind of longer-term basis would be rewarded with some MKR. It’s not just about the financial reward; it incentivises them to help MakerDAO succeed and grow Dai adoption, gives a sense of loyalty, ownership and agency, and critically enables people to vote for proposals they think will do that as well as what they do in their day jobs. Obviously, there’s a limit to how much MKR it will be possible to mint without causing inflation. Should multiple groups suggest what you have (which seems quite likely), there are risks they would not get their rewards or that governance would have to take some kind of action. Perhaps people have other ideas about how demand for MKR from Core Units could be met most effectively. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3359375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#20",
                    "likes": "3",
                    "time": "04/03/2021-14:12:09",
                    "content": "I’d almost prefer MKR that would go to burn from FLAP auctions instead go into a vesting treasury that can then be paid out to core units. That way it still takes the MKR off the market but also gives it to protocol participants and aligns incentives for everyone. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Guy",
                    "index": "#21",
                    "likes": "0",
                    "time": "04/03/2021-14:13:49",
                    "content": "Yes, that’s one potential option. Probably a pretty good way of dealing with the problem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#22",
                    "likes": "0",
                    "time": "04/03/2021-14:25:27",
                    "content": "Thanks Guy, I wholeheartedly agree that value comes from across the spectrum of integrations, business development, marketing, HR and community development to name only a few. How we ensure they are incentivised is equally essential - is there a higher treasury function or some allocation model? I’m not sure. I would be happy to join any group that is tackling this broader incentive question for the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.571428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Guy",
                    "index": "#23",
                    "likes": "1",
                    "time": "04/03/2021-14:30:22",
                    "content": "Aaron’s point about FLAP auctions could be a big part of the puzzle. It dollar-cost-averages into MKR as a routine function of the Protocol. So long as it wasn’t all spent, e.g. 50% was always burned, then the rest could be distributed proportionally, or by some other means? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.65625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#24",
                    "likes": "0",
                    "time": "04/03/2021-14:40:57",
                    "content": "I would personally love to see a 50/50 (or some other non-absolute percentage) split of surplus instead of this all or nothing approach to filling the surplus buffer to full before any type of price appreciation. Having the different flappers siphoning vat DAI to different causes would be awesome. It’s just a matter of the Smart Contract team making all that possible lol. So they just have to create the code to pay themselves!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.632936507936508
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#25",
                    "likes": "8",
                    "time": "04/03/2021-15:00:56",
                    "content": "    textrapper:  Also if we the community are going to pay 850k (if MKR goes back to 3k and it looks like its going higher) per dev (i assume all these people are devs — i would hope so) — then this should go out as a wider job offering. For that money every dev should be a legitimate rock star.   The current smart contract team is the same one that helped build the MCD protocol and put it in the number 1 spot. Screenshot from 2021-03-04 09-49-491077×335 31.8 KB We’re not rock stars, we’re professional Smart Contract devs who built this system to throw off $100m a year (and growing). Our skills are highly sought after and other protocols are trying to recruit us. By lunchtime I’ll have a handful of linkedin messages trying to poach me, this happens every day. Others on the team have the same experience. Many SC team devs have succumbed to this siren song in the past year, and we need to compensate to dampen that. We’d all thrive in both tech and quantitative finance, and these numbers were adapted from leading firms in those industries. Anyways yes, Maker, by virtue of it’s reputation, does attract the best, we just have a hard time keeping them. This should help with that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.632823129251701
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#26",
                    "likes": "6",
                    "time": "04/03/2021-15:17:09",
                    "content": "Regarding the MKR part, it would make sense to just buy them on the market with a MakerDAO-owned multisig. MKR is a fairly liquid token, not a share of a private startup that has no liquidity. Giving MKR tokens is an expense like any other. If the conversion happens today, the yearly budget of the SC Core Unit is $12.85M. How to finance those MKR is a financial decision that has nothing to do with the budget asked for. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#27",
                    "likes": "2",
                    "time": "04/03/2021-15:20:54",
                    "content": "Trying to buy $12.85 MKR on the market would push the price through the roof on it’s own, but by the time this proposal is run through governance the markets would front-run and re-price the token for the event, only to tank again afterward. The proposed solution avoids market manipulation. The SC team has little control over whether governance chooses to burn MKR or not, so minting isolates the team from getting involved in the politics around use of surplus funds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#28",
                    "likes": "5",
                    "time": "04/03/2021-15:27:14",
                    "content": "I wouldn’t worry so much about the mint. We are talking about ~1.5% of supply to cover the whole team for the full 4 years, and we are in a completely irrational bull market. For comparison YFI minted 20% of their supply for treasury and the price went up. Also keep in mind this is not new supply on the market - this is locked up for years. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.781818181818181
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#29",
                    "likes": "0",
                    "time": "04/03/2021-15:27:20",
                    "content": "I wasn’t suggesting to buy it in one go in a day. But we can mint it and limit the surplus buffer to have the same impact. Against that’s how to finance those MKR. I just see that community isn’t keen to the minting. My main point was to treat is like $ at the time of the acceptance of the proposal as it’s the most logical way to account for it. If the community doesn’t want to hedge the exposure that’s a community problem, not a SC Core Unit one. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.145833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#30",
                    "likes": "1",
                    "time": "04/03/2021-15:36:38",
                    "content": "I agree wholeheartedly with everything you have said. I guess this just brings up ways we can make MKR vesting/accrual more efficient for all market participants. Scenario #1: Maker mints 1000 MKR that sits in a vesting contract for 4 years with occasional payouts. Scenario #2: Half of vat DAI accrued goes to FLAP auctions but instead of the MKR being burned it goes to the vesting contract until it accrues 1000 MKR which goes to occasional payouts over 4 years (in this circumstance). Although I think that in the wash, Scenario #1 is probably more efficient, Scenario #2 is probably more digestible by all MKR holders because they get some immediate benefit from it. Would love to hear your thoughts on this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.309523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#31",
                    "likes": "2",
                    "time": "04/03/2021-15:43:45",
                    "content": "The original system was designed to be constantly minting and burning MKR, which we see in flap and flop auctions. If the protocol was to be considered successful, MKR would be net deflationary. It’s just worked so well that we rarely see flops, so I think MKR holders aren’t as accustomed to seeing mints. To clarify, the dss-vest solution only mints MKR when the vest amount is claimed, so there wouldn’t be an inital increase of ~1000 MKR to total supply. It’s also the simplest technical solution to implement that doesn’t involve rewriting core system components. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.890625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Guy",
                    "index": "#32",
                    "likes": "0",
                    "time": "04/03/2021-15:46:56",
                    "content": "That’s a very valid point. It’s difficult to account in the short term for tokens that will only be released in the long term. This is probably something for an unrelated/Pre-MIP discussion, but there is quite naturally interest in the idea of MKR being used as bonuses or part-payment for teams. Accounting for that as a one-off isn’t an issue. If it becomes the standard (as I think it should in some form) then that becomes a wider question for governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.821428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#33",
                    "likes": "5",
                    "time": "04/03/2021-16:41:34",
                    "content": "Quite a proposal we have here. From this I sort of read the following:   There is no MKR coming from the foundation. Otherwise MIP42 or the MKR incentive in this proposal would not really make sense.   Interestingly this proposal does not in any way or form mention expanding the Core Unit. Slightly interesting considering the demand for devs. If the team plans to expand please detail this. And if you plan to remain at 14 just say so.  EDIT: from 9 to 14. Sorry. Thanks @Aaron_Bartsch   300K annually per dev is a king’s ransom - but OK. What I would want to see are some golden handcuffs - stay the full 4 years and you get a big DAI bag. Right now it is a bit meh.   My biggest issue with this proposal is the MKR print. I don’t like MIP42 and I do not like printing MKR for any reason whatsoever except when the protocol needs refinancing. Once MKR is printed for any other reason MKR prints will be proposed for practically all good causes.   I am going to be utterly rude and dare to suggest that if you make 300k you are allowed to buy your own MKR.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.970238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#34",
                    "likes": "7",
                    "time": "04/03/2021-16:41:35",
                    "content": "    Guy:  If it becomes the standard (as I think it should in some form) then that becomes a wider question for governance.   The danger here is that governance might want a standard that conflicts with the previous agreements that have been made under budgets like this one. Aligning incentives and getting more governance tokens into the hands of those that will use them to govern Maker are critically important, but I am slightly worried that if there isn’t a standardized system up-front then it could lead to friction between contributors. In an ideal world we should maybe attempt to handle vested MKR incentives at a wider level than individual core units. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#35",
                    "likes": "1",
                    "time": "04/03/2021-16:44:46",
                    "content": "    Planet_X:  Interestingly this proposal does not in any way or form mention expanding the Core Unit. Slightly interesting considering the demand for devs. If the team plans to expand please detail this. And if you plan to remain at 14 just say so.   He says they currently have 9 and plan to expand to 14.     Derek:  The current team has 7 full-time smart contract engineers, 1 part-time smart contract engineer, and 1 proposed Team Facilitator (for a total of 9 members). The team is seeking to grow this by 5 members to a total of 14 members. This opportunity to scale will enable us to better meet the demands of the community.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#36",
                    "likes": "1",
                    "time": "04/03/2021-16:58:05",
                    "content": "I’m not sure what’s normal, but 250k base per year + 995 MKR over 4 years is a breathtaking amount of compensation. I’m not sure what I think about that. I’m still in shock. Okay, I’ll come back to this in half an hour.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.114583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#37",
                    "likes": "1",
                    "time": "04/03/2021-16:59:08",
                    "content": "I’d almost rather they just double their salaries than add the MKR. Then they can just buy MKR with the extra salary (if they wish). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#38",
                    "likes": "0",
                    "time": "04/03/2021-17:10:41",
                    "content": "Is there a spreadsheet that aggregates individual compensation levels across all core units / roles? How do other people (not smart contract engineers) on Maker payroll feel about these compensation levels?     LongForWisdom:  In an ideal world we should maybe attempt to handle vested MKR incentives at a wider level than individual core units.   Yes     SebVentures:  Giving MKR tokens is an expense like any other. If the conversion happens today, the yearly budget of the SC Core Unit is $12.85M.   Yeah, it is proper to include some approximate value of the tokens in the budget. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0892857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#39",
                    "likes": "0",
                    "time": "04/03/2021-17:17:14",
                    "content": "I think that is the idea ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sctannr",
                    "index": "#40",
                    "likes": "7",
                    "time": "04/03/2021-17:28:24",
                    "content": "This is pretty average compensation for high tier tech & fintech ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.433333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#41",
                    "likes": "0",
                    "time": "04/03/2021-17:30:38",
                    "content": "@sctannr What is your role in Maker? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sctannr",
                    "index": "#42",
                    "likes": "6",
                    "time": "04/03/2021-17:33:57",
                    "content": "I’m one of the newer members on the smart contracts team - I joined ~3 months ago - and have been relatively quiet as I’ve been heads down grokking the protocol & working on a holistic security  + safety strategy with more comprehensive formal verification techniques. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "3rd party giving positive feedback on proposal",
                        "None",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.698412698412698
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#43",
                    "likes": "2",
                    "time": "04/03/2021-17:43:11",
                    "content": "How much do you think it will cost to change the whole team? How long it will take to get the same level of knowledge? We will pay the price but we know what we get in return. If you pay peanuts you get monkeys. My only hope is, this proposal gets voted quickly and they finally can start doing some work. We are losing at least 10M a month with 1billion usdc seating there for the last 6 months. Let give them the motivation to push the code into a 6Billion system. The foundation failed to interest them, the management failed to motivate them, the community failed to de-responsibilize them when we approved the black Thursday code. what would you do if you have an equivalent proposition somewhere else? Let’s fix this and let’s go back to work. Edit: removed buggy and fixed the expression ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.605555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sctannr",
                    "index": "#44",
                    "likes": "4",
                    "time": "04/03/2021-17:59:37",
                    "content": "I have some further perspective to share on the matter of compensation. Somewhat preemptively, just to add more clarity to the rationale behind the proposal & responsibilities of the SC core unit. First, this type of development is not like “web” or “app” development. Software on which the safety of people or the safety of peoples’ property depends is safety-critical. Second, the Maker protocol is pretty complex. In general, it takes a long time to onboard sufficiently. Coupled with the criticality of the protocol, it takes even longer since core code contributions demand impeccable understanding of the system.   Retention will suffer without competitive compensation.   The protocol will suffer financially with decreased retention.   Therefore, it is financially beneficial to provide competitive financial compensation.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.232142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#45",
                    "likes": "11",
                    "time": "04/03/2021-18:14:55",
                    "content": "    alexis:  My only hope is, that this proposal gets voted quickly and they finally can start doing some work. We are losing at least 10M a month with 1billion usdc seating there for the last 6 months, because they have no motivation. Let give them the motivation to push the code into a 6Billion system. The foundation failed to interest them, the management failed to motivate them, the community failed to de-responsabilize them when we approved the black Thursday buggy code.   This statement is offensive and wrong. Everyone on the team cares about DeFi and this project and is here despite all of the opportunities elsewhere. As professionals, we’re motivated by our reputations in this space, and shipping fast but buggy or unmaintainable code fast will damage those reputations and our own MKR holdings faster than anything else we can do. Our focus is on protecting property of users and the reputation of the protocol. We have worked, literally exhaustively, to add new features and collaterals to the system at a rapid clip and in a safe and maintainable manner. I would say that you might want to reconsider what to expect from a professional smart contract development team. I should also mention that no code was changed as a result of Black Thursday. A mis-optimized governance parameter is not “buggy code” and I resent the implication here. Honestly, I’ve enjoyed working for the Foundation, especially when the Maker Protocol aligned with my ideals as an exclusively crypto-focused project. Now that the DAO has decided to branch out into Real World Assets the protocol is becoming more like a traditional bank, and if you want to hire senior devs in this space to work here the protocol will need to compensate them as a bank would. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3801298701298705
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#46",
                    "likes": "1",
                    "time": "04/03/2021-18:38:12",
                    "content": "    alexis:  Give nuts get monkeys. Isn’t it the expression?   Does seem like a good expression. But yeah, it’s not accurate to say that Smart Contracts aren’t doing work, or that the smart contract team have no motivation (or that Black Thursday was their responsibility.) I feel like you might have been going for a positive sentiment and it got lost in communication, but not sure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.527983920841065
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#47",
                    "likes": "0",
                    "time": "04/03/2021-18:54:11",
                    "content": "Yes seems like it, actually I am not sure where I missed it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#48",
                    "likes": "1",
                    "time": "04/03/2021-18:55:46",
                    "content": "Hi @psychonaut , when coming up with this overall proposal, I looked to other teams in the crypto space and also referenced top tier tech companies like Apple, Microsoft, Facebook, Google etc - who offer similar packages and are our competition in terms of snagging top developers. Re:     psychonaut:  Is there a spreadsheet that aggregates individual compensation levels across all core units / roles?   Nothing definite yet, but @SebVentures presented a slide on the G&R call at about the 75min mark that I think we could build upon to document the normalized annual PnL for all planned teams. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#49",
                    "likes": "3",
                    "time": "04/03/2021-19:00:32",
                    "content": "    Derek:  we could build upon to document the normalized annual PnL for all planned teams   Sounds good. I’m not necessarily complaining that your compensation proposal is excessive. I would just want to avoid acrimony or ill-feelings amongst Maker teams. It’s a huge step in the right direction to make this information public and discuss it openly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.811224489795919
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#50",
                    "likes": "1",
                    "time": "04/03/2021-19:12:09",
                    "content": "First of all let me say: I personally would approve this budget. The SC team has proved to be top-level quality. No need to say this CoreUnit is of huge strategical importance for MakerDAO. It make sense that it is paid well. This said and clarified, I am a bit uneasy with comments such as:     brianmcmichael:  This statement is offensive and wrong. Everyone on the team cares about DeFi and this project and is here despite all of the opportunities elsewhere.   It sounds like you have been doing charity work at MakerDAO (The Foundation) so far. This is not the case.  When you signed your contract with the Foundation you found the terms attractive Working at MakerDAO allowed you to build up a fantastic CV which, rightfully so, you can now spend. So you have gained experience in one of the most interesting startups of the crypto space. This is vary valuable (beside money) and you know it.  So I think we should change a bit the tone of the discussion. A) You have proposed a budget. B) If approved, we expect that you (the SC team) will happily work for MakerDAO for the 4 years without ‘blackmailing’ in any way (not that you are doing it right now, by any means).  → For example: what if Governance decides to mint 500k MKR (thus diluting your share of vested MKR). What would be your reaction? TL&DR: once the budget is approved, there should be armony&happiness and alignment of incentives. No more talk about ‘sacrifices to be made’ or tensions.     alexis:  the community failed to de-responsabilize them when we approved the black Thursday code.   I have not seen in this budget proposal any commitment to take responsibility for SC bugs. Question: Would it make sense, for you, to e.g. discuss a “conditional MKR vesting”? Like: you are given 0.1% of MKR in 4 years provided that no major SC bugs have been introduced in the system? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.808686755952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/textrapper",
                    "index": "#51",
                    "likes": "1",
                    "time": "04/03/2021-19:40:26",
                    "content": "Ive talked this over last night/today. I am switching sides! It still seems a little crazy to me but hell this is crypto it is supposed to be crazy-ish. So yeah great job on your previous work and good luck on your future endeavors with Makerdao (assuming it goes through of course)! And you guys are all rock stars in my book to be honest… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.3898809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#52",
                    "likes": "5",
                    "time": "04/03/2021-19:43:25",
                    "content": "    iammeeoh:  When you signed your contract with the Foundation you found the terms attractive   At the time, yes. The protocol has changed a lot since then. To be completely honest, I highly doubt I’ll be standing here in 4 years. This is a competitive offer for the industry and we hope that it can attract talent, but that doesn’t isolate anyone from external and internal factors.     iammeeoh:  Working at MakerDAO allowed you to build up a fantastic CV which, rightfully so, you can now spend. So you have gained experience in one of the most interesting startups of the crypto space. This is vary valuable (beside money) and you know it.   Everyone on the team had built up a stellar CV prior to joining. I don’t want to discount the role of working on this project at all, but I don’t want to discount the achievements that got people here to begin with.     iammeeoh:  B) If approved, we expect that you (the SC team) will happily work for MakerDAO for the 4 years without ‘blackmailing’ in any way (not that you are doing it right now, by any means).   No one can promise this. 4 years in a role like this is the exception rather than the rule, and we don’t expect that all of the proposed MKR will be paid out as a result. Taking responsibility for >$6b TVL takes a physical and emotional toll on people, and we can only hope that this offer can offset that. By the one-year cliff vest, a dev who has satisfactorily fulfilled their obligations is absolutely worth the expense and the token award further aligns their incentives to help with the protocol. It’s devastating for not just the team, but the entire protocol to lose that talent and expertise.     iammeeoh:  So I think we should change a bit the tone of the discussion.   I agree. Let’s work together. Help us to keep experienced devs working on this project. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.098928571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#53",
                    "likes": "8",
                    "time": "04/03/2021-19:56:10",
                    "content": "    brianmcmichael:  I agree. Let’s work together. Help us to keep experienced devs working on this project.   Yeah! Absolutely. Especially if they are the devs who brought us here!      brianmcmichael:  To be completely honest, I highly doubt I’ll be standing here in 4 years.   Thanks also for being honest. You are right, of course, that it is impossible to guarantee 4years of continuous work for individuals. What should be possible, though (and what I meant), is to guarantee 4years of smooth and continuous work for the Core Unit. This might involve finding good replacements, educating them, etc, of course. We (governance) we need to hear your requests (the Budget proposal) and your ambitions, and align them as much as possible with those of MKR holders (i.e., with yours too!). What the MakerDAO needs is:  Good and happy developers/contributors, with the right incentives to act good (like MKR vesting, but again, I think it should be subject to work being done properly, as you did in the past). a CoreUnit that might eventually duplicate itself, so to spread out risk and horizontally increase competences, to reduce the risk of being too dependent of a single Core Unit  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.319166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#54",
                    "likes": "1",
                    "time": "05/03/2021-15:50:45",
                    "content": "So after thinking more about this MKR vesting implementation I like it even less. Some of your reasoning seems to be based on current annual MKR burn but in 4 years the amount of MKR you’re proposing to mint will probably be a much larger % of that MKR burn. So let’s say in 4 years we 10x and burn % stays the same. We’d be burning 3400 MKR a year which is roughly the amount you would be getting at the end of the 4 years. Is my math right there? Yes I realize burn is closer to 4.5% right now. Whoops I forgot to account for revenues also increasing by 10x so it would still be the same % of burn. Like @iammeeoh said below it would be 10% of annual burn which is more digestible to me personally  than what I originally thought. We have to remember that these guys pretty much are responsible for the success we’ve had and it’s important that they feel invested in their work. I don’t know what other corporate stock offerings are like from FAANG for example but if it’s comparable then I accept. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.764411027568922
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#55",
                    "likes": "0",
                    "time": "05/03/2021-16:27:49",
                    "content": "    Aaron_Bartsch:  So after thinking more about this MKR vesting implementation I like it even less.   I agree. I honestly also feel this is very much to ask (again, I am very aware of the critical importance of the SC team and appreciate their work to the full extent possible).     Derek:  Current annual MKR  34,054 MKR   and     Derek:  this is a total of 3358.125 MKR to be awarded at the end of the first year.   So the Budget proposal asks for 10% of all MakerDAO gains  in the next 12 months (assuming things stay like they are today), and possibly more in the next 48 months considering the comments made by @Aaron_Bartsch above. Furthermore, what if other critical Core Units ask similar amounts? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.692592592592592
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#56",
                    "likes": "4",
                    "time": "05/03/2021-16:49:27",
                    "content": "    Aaron_Bartsch:  Whoops I forgot to account for revenues also increasing by 10x so it would still be the same % of burn.   I think we are being potentially too optimistic here:  What if we need to increase the SB to 100 millions? this will reduce the amount of burns, but not the compensation of the SC team. Or, similarly, what if some money is lost, we lose the SB and need to refill it? Again, this will reduce the amount of burns, but not the compensation of the SC team. What if, for some reasons, SF have to go down (to keep the peg) and we reach 1% SF as in the past?  PROPOSAL: What if we, more transparently, agree on a certain percentage (e.g., 10%) of the MKR burns to go to the Core Unit? Like, for each 1MKR sent to the burning mechanism, only 0.9MKR are really burned, and 0.1 are sent to the SC Core Unit. This would also give the Core Unit more responsibility and ‘stake’ in the game. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.276695526695526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#57",
                    "likes": "1",
                    "time": "05/03/2021-17:11:01",
                    "content": "Let me add: As a MKR holder myself, I don’t really mind if the Core Units members become super-rich and MKR-whales in the next 4 years, as long as I get a cut of the pie (i.e., MKR growing in value or MKR-voting rewards/staking/farming initiatives or stuff like that). So, in principle, I am ok with 10% of the income of MakerDAO going to, e.g., the SC Core Unit. However, in case MKR are not burnt as expected (for whatever reason) and/or MKR price does not fly up, I don’t find equally justifiable to give so much reward to the Core Unit. Conclusion: I think there should be more alignment between the requests (995 MKR after 4 years) and the (hard to predict) performance of MakerDAO and MKR as a token. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.279166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#58",
                    "likes": "2",
                    "time": "05/03/2021-18:06:05",
                    "content": "What about at-the-money call options? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#59",
                    "likes": "7",
                    "time": "06/03/2021-18:31:02",
                    "content": "First of all, MKR owners owe a great deal of thanks to the smart contract team for their significant and instrumental contributions to the project. The growth in TVL, DAI, and Interest Income has been absolutely tremendous! I think governance needs to seriously consider what their token compensation philosophy and objectives are. In my mind, our goals should be to:  Attract and retain the best possible talent Promote the achievement of key strategy and financial performance Motivate long-term value creation; and Align the interests of parties receiving token compensation with all stakeholders  To achieve these objectives, I believe we should:  Have competitive positioning of pay versus our peers Deliver a significant portion of pay in the form of variable, at-risk compensation Align performance measures with strategy Use a combination of vehicles that collectively promote the achievement of positive results, retention and sustainable long-term value creation  Looking at the proposed plan, I do not believe we are fully aligned with the above principles. My suggestion would be to at least make half of the token compensation at-risk and subject to achieving performance objectives. Ideally, this compensation would be 80%+ and a mix of a cash bonus and token compensation (70-80% weighted to the token compensation). The token compensation would be broken up into three different categories:  Token Options (30%) – incentivizes long-term sustainable value creation Time-based Restricted Token Units (RTUs) (35%) – promotes retention and aligns interests of recipients with those of stakeholders Performance-based RTUs (35%) – enables governance to reward recipients for performance that is in the long-term strategic importance for the protocol and stakeholders. Subject to a multiplier based on relative achievement of performance objectives.  Additionally and as mentioned earlier in the thread, the phasing of the token compensation should be weighted more towards the longer term. Is a year 1 smart contract engineer worth the same as a year 3 or 4 on this team? I would think not. My suggestion would be something along the lines of: 18%, 22%, 27%, and 33%. The performance objectives, given the compensation potential and variability, would likely generate a lot of discussion if the community decides to pursue this direction. The below are suggestions from someone very new to the MKR community and intended only as a starting point/example of the direction I believe we should head. As the engine of the MKR protocol, I believe the Smart Contract Core Unit Performance Objectives should be tied in with higher level KPI’s. Performance Objectives:  DAI generated Risk-Weighted Assets DAI market share Net Interest Income Number of Collateral Onboarded Real World Asset Growth Unfavorable Liquidations Additional risk-related metric to ensure growth is sustainable  Given the importance of token compensation, I believe governance should consider hiring a third party compensation consultant to design a plan. This is out of my area of expertise and given the current feedback the proposal has received, most others as well. ",
                    "links": [
                        "https://forum.makerdao.com/t/discussion-core-unit-budget-incentives-and-vesting/7102"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.715478965478966
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#60",
                    "likes": "4",
                    "time": "06/03/2021-19:41:17",
                    "content": "Hi iammeeoh, Aes, Aaron, textrapper and others - just a heads-up that I really appreciate your timely feedback, thoughts and suggestions with this MIP in such early stages of RFC - I am taking it all onboard for consideration and further discussion and will keep you in the loop with comments here as this evolves. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#61",
                    "likes": "8",
                    "time": "07/03/2021-10:36:06",
                    "content": "    Derek:  Hi iammeeoh, Aes, Aaron, textrapper and others - just a heads-up that I really appreciate your timely feedback,   thank you @Derek! It is for me super interesting to be here, now, and witness the first baby steps of a multi-billion worth DAO budget definition.  Your Core Unit, being amazing, is a fantastic source of insights and ideas for discussion. The more I think about it, the more I think my proposal (which I am now going to iterate in more details) might be interesting for you, other Core Units, and MKR-holders too. PROPOSAL (in more details):   [Basic Methods] Beside the monthly salary in USD, the Core Unit will receive a percentage p (from 0% to 100%) of the MKR sent to the burner. When a MKR is sent to burn, only (100-p)% are actually burned, and p% are sent to the Core Unit.  [Quality Control] At each time interval (e.g., monthly or quarterly) governance can adjust the value p, in accordance to predetermined agreements: e.g., if everything went well, p should remain constant. If the CoreUnit acted poorly/badly, p will be reduced in accordance to pre-agreed terms&rules.  [Flexibility/Bureaucracy-free] The MKR sent to the Core Unit are managed by the Facilitator. The facilitator will distribute these MKR to its collaborators accordingly to their own rules: releasing them gradually/at the end, giving more to senior contributors/all equal, etc. In other words, MakerDAO trusts the Facilitator to act properly on this (and of course will overlook for good behaviour over time).  [Guarantees for Core Unit] MakerDAO agrees a certain minimum percentage q (from 0% to 100%) that, for the next 4 years, will be used to burn MKR. For instance currently have q=0, because we are using all of our gains to increase the Surplus and we are not burning. This would not be possible if we had set q=50% because q=50% would require to use at least 50% of the gains to burn MKR, and not for other purposes.  → Note: the “other purposes” include paying Core Unit salaries, increasing the Surplus, etc.  Example for discussion: Let us assume, for reference to the current Budget proposal, that we set q=50% and p=20%. This means that  for the next 4 years, at least q=50% of the profits of MakerDAO will go to Burning and MKR-premiums to Core Units. Using @Derek 's numbers, this means today \frac{50}{100} \\cdot 34,054 = 17,027 MKR/year. Of course this number might go up and down in time (depending on the value of MKR and the profits of MakerDAO). The rest of the profits, not sent to the burner, will be used to grow the Surplus and/or to pay monthly salaries to Core units, etc. Each year, the SC Core Unit will get p \\cdot  17,027 = 0.2\\cdot 17,027 = 3405.4 MKR/year. This is about what @Derek asked (3358.125 MKR) in his proposal. The remaining portion of the MKR to be burned (17,027 - 3405,4 = 13621.6 MKR/year) will be burned or, more likely, partially used to pay other Core Units  and partially used to burn.  What I like about this proposal is:  it requires MakerDAO to make a strategical (long term) choice of the values q and p: how much do we want to send to the burner (q), how much of the burner we want to re-direct to the Core Unit (p) and how much we want to keep for growth/salaries/etc (1-q). It aligns incentives between MKR-holders and Core Unit contributors. MKR holders are happy if the DAO grows well and MKR are burnt (as a buy-back procedure for distributing gains). This has been the model of MakerDAO from the very beginning of its design.    It also gives Core Unit members stake in the game, both in the case of things going very well and bad.   It is a predictable model. As in @Aaron_Bartsch, we avoid the situation of having to pay 10s of millions to each Core Unit members (potentially more than what MakerDAO earns!) should the price of MKR go up like crazy in the next 4 years (which is what we all hope for!)   ",
                    "links": [
                        "https://forum.makerdao.com/t/should-we-burn-the-admin-keys-an-argument-for-minting-mkr/7175/42"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.568948412698412
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TheoRochaix",
                    "index": "#62",
                    "likes": "0",
                    "time": "08/03/2021-09:31:07",
                    "content": "This compensation looks fair to me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Guy",
                    "index": "#63",
                    "likes": "5",
                    "time": "08/03/2021-11:13:15",
                    "content": "“Furthermore, what if other critical Core Units ask similar amounts?” Regardless of the decision/discussion around this MIP, it feels important to establish a broader framework that’s sustainable and aligns interests for everyone. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.34375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#64",
                    "likes": "4",
                    "time": "08/03/2021-16:49:17",
                    "content": "I think we have to look holistically at each core unit, what they bring to the table and how comp is done generally for the specific line of work. Not to touch on any particular sensitivities, but the best smart contract engineers in the business (the Maker SC team) have a different value proposition than a growth unit (which, imo, should have a heavier emphasis on performance-connected comp/commissions) or something like communications or operations. Ultimately, what makes this project survive and thrive is the engineering talent, so we need to remember that. And I agree with @TheoRochaix, the proposed comp for the SC team seems fair to me, especially if you think of the team members in light of what they could get from other blockchain projects AND large tech firms, financial institutions or hedge funds/private investment companies. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.007783882783882
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#65",
                    "likes": "0",
                    "time": "09/03/2021-07:02:28",
                    "content": "@Derek, maybe it would be beneficial to provide a bit of historical context on this subject? How have developers been paid in the 2016-20 timeframe? I know 5 years is a whole geological epoch in crypto so I am sure there has been up to several arrangements. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.533333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#66",
                    "likes": "9",
                    "time": "09/03/2021-09:33:20",
                    "content": "This proposal uses a top-tier compensation package which is far from the framework other proposals have used. There is nothing good or bad about it. It doesn’t seem fair to me that the average SC dev is 4x the highest rank in Governance or Risk. Actually, even the junior one is way above thanks to the MKR reward. That doesn’t mean SC compensation is wrong. All is a question of framework and fairness which are important to keep a team cohesion over the long run. My main concern is to see some Core Units as important and others as secondary. Tech is a prerequisite but doesn’t make a success. Balancer has better tech than Uniswap but fails to have a proper UX (seems like web/app developers matters as much as smart contracts after all). xDAI is great technically but probably fails due to UX and business development. The guy that can sign an integration contract with Coinbase, Kraken and Binance is worth more than all the tech team. The vampire mining attack of Sushiswap matters more than the tech. Legal and lobbying might soon be about MakerDAO survival. And, lastly, governance might matter in a successful DAO. Not saying SC shouldn’t be paid more, but the framework should be the same. If you agree on that, it’s a lot of MKR to allocate (but not that much neither depending on how you look at it, what is 5-10% dilution to create a workforce from scratch?). There is a good old discussion where Rune is highlighting the importance of culture and wanting to use academia as a standard (it was only about risk at the time).  Whether it is underpaid, or overpaid, depends on what you’re comparing it to. It’s a fundamental question of what kind of culture we want the risk teams and the governance community to have, and a question of how to get real long term value for money. In my opinion the question of culture is one of the most critical points that must be innovated on to prevent maker from falling into the pitfalls that has plagued traditional finance. I also think a good place to look for compensation standards would be research universities and how research positions at such institutions are compensated.  Not providing any judgment or conclusion here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.640592650103519
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#67",
                    "likes": "4",
                    "time": "09/03/2021-09:48:49",
                    "content": "Thanks @SebVentures, nice comment and nice reference to the old Rune’s post. I can also quote an interesting passage:  Being a risk team shouldn’t be a privilege and it shouldn’t be the new alternative to getting a job on wall street, it should be a duty and a public service, and thus be compared with public servant, regulator, academic, and central banker roles.  in reference to this sentence:     brianmcmichael:  Now that the DAO has decided to branch out into Real World Assets the protocol is becoming more like a traditional bank, and if you want to hire senior devs in this space to work here the protocol will need to compensate them as a bank would.   Also, not providing any judgment or conclusion here. On the one hand we can’t expect people to work for the ‘glory’ and we should reward valuable contributors (especially long-time contributors). On the other hand it is true that MakerDAO does not want to be a bank or compete/align with their salary practices, as Rune pointed out. We need to find some equilibrium in between. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.032754010695188
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#68",
                    "likes": "2",
                    "time": "09/03/2021-09:55:20",
                    "content": "A further comment about a piece of Rune’s post:  I also think a good place to look for compensation standards would be research universities and how research positions at such institutions are compensated.  I can state (with 100% confidence) that one of the most effective compensation academics receive in research universities is TENURE.  Most people starting postdocs after their PhD, and trying to do an academic career, are attracted to tenure way (way!) more than money. Tenure is about intellectual freedom, job security, stable and respected position: for a life-long period. I am not sure how we can reason about something like this in the context of Maker. But if we are talking about ‘academic culture’, tenure is one of its pillars. But yeah, the Academic environment is very different than the Banking/Financial environment in that one proposes a life-long secure/respected/interesting career (with a decent salary but nothing crazy) the other proposes a model based on few years of very intensive work, borderline immoral, paid like crazy and oriented towards quitting and retiring early. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.447916666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#69",
                    "likes": "3",
                    "time": "09/03/2021-12:17:01",
                    "content": "For reference, here is data about salaries for Postdocs (i.e., non-tenured, fixed-term, project-oriented researchers holding PhDs) around the world: Results - PostDoc Salaries Examples include:  University of California - San Diego (UCSD, Electrical and computer engineering): $52k usd/year  ETH Zurich\tComputer Science Department: $88k /year  Harvard University (Computer Science): $70k/year  mcgill university (Computer Science): $45k/year   not to mention excellence research places around the western world (e.g., France/UK/Germany/Italy) where the salary can be even lower. Staying in the US, and talking about full professors, we have the following figures (Ivy league): The average salaries of Ivy League university professors  Professors at top schools can make more than $175,000 a year. Harvard University professors make the most compared to other Ivy League faculty members — they earn $226,394 per year.  Recall that being a full Prof. at the above institutions reflects a life devoted to research, incredible talent, impressive results and decades of hard work. Looking at CV one of the new SC talents (@sctannr , https://www.linkedin.com/in/wilfred-allard, who introduced himself above in this thread) I see a good CV, a promising young talent. Indeed! But I also think that:  it’s kind of crypto-bubble to realise that He (or anyone with a similar profile) will get more than a Harvard full professor for 4 years (250k/year, as in the budge proposal). But ok, it is the merit of being early in a new space!   It’s even more crazy to see that he will receive 995 MKR (about 2 millions) in 4 years (again, as in the budget proposal).  No judgments, no conclusions… just some Food for Thought.  Addendum: I have been contacted in the chat by a community member (not SC team). They asked me if I was even aware of  salaries in the industry (such as: https://www.levels.fyi/). Of course I am. I just kept discussing academic salaries, following the line of reasoning of Rune’s old post and my previous point about tenure and all. Let me re-state what I stated earlier in this thread:     iammeeoh:  First of all let me say: I personally would approve this budget.   and     iammeeoh:  What the MakerDAO needs is:  Good and happy developers/contributors, with the right incentives to act good (like MKR vesting, but again, I think it should be subject to work being done properly, as you did in the past). a CoreUnit that might eventually duplicate itself, so to spread out risk and horizontally increase competences, to reduce the risk of being too dependent of a single Core Unit    I was just providing some (hopefully) food for thought. Please don’t think I am against the SC team or anything like that. Let’s be clear: MakerDAO needs them. Absolutely needs them. So yeah, we are just discussing and trying to define the ‘culture’ (more than the concrete numbers) about MakerDAO compensation. ",
                    "links": [
                        "https://www.businessinsider.com/the-average-salaries-of-ivy-league-university-professors-2019-8",
                        "https://www.businessinsider.com/category/professors",
                        "https://www.businessinsider.com/category/ivy-league",
                        "https://www.linkedin.com/in/wilfred-allard",
                        "https://www.levels.fyi/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0620941558441555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sctannr",
                    "index": "#70",
                    "likes": "13",
                    "time": "09/03/2021-14:50:07",
                    "content": "I’m confused, because if you’re saying you’re aware of the industry pay levels then it follows that the comment “it is unreasonable that He (or anyone with a similar profile) will make more than a tenured Harvard professor” would not have been a valid claim, since our industry has higher salaries than professorships even at top universities. Absolutely, they dedicate their lives to research to get to where they are. But labor, or time, is not the only input to that revenue function. Nor are credential levels alone. Especially in such a forward thinking industry as ours. The former would be Marxist and the latter would mean that if I were a post doc specializing in 18th century Art, I should make more than a blockchain engineer. But it’s demand that dictates our pay. Certainly crypto is hot right now, but make no mistake: the skills I and others have on this team are not novelty and quick tricks one learns from going through a crypto zombies tutorial. It is fundamentals, deep understanding of difficult topics that took thousands of hours to become even remotely adept - that is what allows us to do what we do. I am new to Maker, yes. I do no not have a PhD or even a Masters degree. But I live and breathe my discipline. I went to sleep at 5AM and woke up at 9AM today because I was working on formal proofs of Maker - types of proofs that you will not find any other verification tool in the crypto space capable of tackling, even though many of those projects are developed by doctorate-holding researchers with decades of experience. They could if they wanted to, but when you take a bunch of developers by trade with a love for logic and experience in blockchain systems, you get a special combination that exploits the synergistic power of theoretical knowledge for deep understanding grounded by practical experience to ensure value is delivered timely and in a user friendly way. Everyone on the SC team lives and breathes their discipline. I am humbled by how good this team is, in both character and skill. I am honored to work on this incredible project, and I only hope that when more info about this work is shared in the near future, the community is as happy about it as I am. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.032987297789929
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#72",
                    "likes": "3",
                    "time": "09/03/2021-15:08:56",
                    "content": "The community can muse about how this should be an academic culture, but I assure you that your engineers don’t see it that way and it almost feels like the discussion around it is in bad faith. This is not a public service, we’re charged with securing over $6b in value and making $100m annually (and growing) for the protocol. We have researched what the industry is paying and this proposal is, we think a fair one, that will retain developers in this space. Even then, this doesn’t even put the team among the highest paid in the space, so we’re still relying on other aspects of culture for retention. I think there’s a lot of hang up on the token distribution here. These numbers are percentages, adapted from employee equity plans used industry-wide and by Maker’s own VC investors. Anyone who is still here in four years is absolutely worth this amount to the protocol, because you simply can not buy that sort of experience. Keep in mind that many will take better offers elsewhere or simply burn out of this role, and the community will not have to pay out the distribution. The team, however, will lose that experience and the protocol will be less secure and less stable because of it. This system is non-trivial and there are many moving parts, a misstep can cause all of it to vanish, every experienced dev on this project is worth their weight in MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.983796296296297
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#73",
                    "likes": "5",
                    "time": "09/03/2021-15:11:47",
                    "content": "    sctannr:  I went to sleep at 5AM and woke up at 9AM today because I was working on formal proofs of Maker   I wish I could like this  100X.     Derek:  this proposal includes a healthcare supplement averaging $1250 p/month for full-time employees   This  is cheap. Nice job on saving the DAO money. Hopefully y’all will get a decent healthcare package here. It should technically cost more $1250 p/month–but again–nice job on being conservative.     Derek:  Typically we work with Gauntlet, PwC, Quantstamp, Trail of Bits, Consensus, OpenZepplin and Peckshield.   The SC Core Unit is working with the best of the best. This alone is priceless.     Derek:  |Allocation per full-time individual over 4 years:|0.1% (equivalent to 995 MKR)   I mean honestly–if MKR goes back to $500 by 2023–are we really going to think that they should have gotten less compensation? Maybe y’all are thinking in today’s numbers as oppose to tomorrows numbers. take it easy. They deserve what they are asking for. Trust me. And last but not least–half of us here can never imagine the hard work and dedication this team puts in day in and day out–let alone the talent it takes to write code. Let’s support this MIP and get it to an Executive, before you rug yourself  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.283088235294118
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#74",
                    "likes": "0",
                    "time": "09/03/2021-15:43:10",
                    "content": "Hey,     flipflopflapdelegate:  if MKR goes back to $500 by 2023–are we really going to think that they should have gotten less compensation? Maybe y’all are thinking in today’s numbers as oppose to tomorrows numbers. take it easy.   I take it easy  Let’s all take it easy.     brianmcmichael:  it almost feels like the discussion around it is in bad faith.   No, trust me. No bad faith.     sctannr:  But it’s demand that dictates our pay.   True.     sctannr:  I am honored to work on this incredible project, and I only hope that when more info about this work is shared in the near future, the community is as happy about it as I am.   This . In any case, I said what I wanted to say, always respecting the SC-team and its past/present and hopefully future contributions. I just made a few comments, hoping they could be constructive in a discussion regarding salaries that for many people (this thread generated >70replies in 1 week) coming from different areas of the world and doing different jobs, find perhaps a bit high. Ultimately, as a MKR holder, what I want in the long run is to see MKR at high valuations and at low supply. I hope the MakerDao MKR voters, in their distributed wisdom, will be able to guide us in the right direction (as they have proved to be able to do in the past). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.90328407224959
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yas",
                    "index": "#75",
                    "likes": "0",
                    "time": "09/03/2021-16:15:14",
                    "content": "Thanks for your hard work! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.588541666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#76",
                    "likes": "8",
                    "time": "09/03/2021-16:17:25",
                    "content": "    sctannr:  I went to sleep at 5AM and woke up at 9AM today because I was working on formal proofs of Maker       flipflopflapdelegate:  I wish I could like this  100X.   Yeah, we shouldn’t be liking this. Or lauding it. Work hygiene is important. I’m not exactly a poster child for it myself, but it is extremely important to recognise that people do not operate at anywhere close to 100% efficiently on 4 hours of sleep, and if people do this frequently (or worse, feel that they need to, or that it’s a positive) it is likely to lead to avoidable errors. Do you want the people writing executive spells to have slept a solid 8 hours, or to be coming down off of an all nighter? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.216698232323233
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#77",
                    "likes": "1",
                    "time": "09/03/2021-16:20:35",
                    "content": "    LongForWisdom:  Do you want the people writing executive spells to have slept a solid 8 hours, or to be coming down off of an all nighter?   Different strokes for different folks. Some operate better under such. See Sam Bankman-Fried and the rest of the FTX/Alameda team and their success. But yea, personally I wouldn’t do so well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.402777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#78",
                    "likes": "6",
                    "time": "09/03/2021-16:23:26",
                    "content": "    LongForWisdom:  Do you want the people writing executive spells to have slept a solid 8 hours, or to be coming down off of an all nighter?   Can’t disagree with this. We trust everyone to work on their own schedule. My Fitbit says I scored an 84 on my sleep last night, so we all do what’s best for us. We do work long days generally though, there are so many things to do, so little time to do them, and so many demands that we do more. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.253156565656566
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#79",
                    "likes": "6",
                    "time": "09/03/2021-17:44:20",
                    "content": "I am just gonna chip in and say it’s a free market and SC team is like professional soccer players. You can score? Then you take millions. Why? Because they can generate way more in revenue for the team. Similarly as long as there’s accountability, ROI is all that matters.  Ah also would be good to understand business side is important as well in terms of ROI. They do many including helping to bring huge vaults that generate millions in stability fee. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#80",
                    "likes": "5",
                    "time": "09/03/2021-19:26:58",
                    "content": "I think it is fair compensation. We have to understand the SC team context: what they have done for the protocol and what others are willing to pay for a team like this. Although I keep thinking about what someone mentioned in our previous Governance call: How do we know a team is performing well? And I bring this question to the thread because if we all agree that the SC team is doing a fantastic job (as they are) and showing it by clear OKRs, I think the MKR vesting proposal makes total sense. I understand MKR vesting is a strategy to achieve retention. Still, it also could be used as an incentive to create a meritocratic environment, where the best performances are correctly identified and rewarded. I agree with what Tosh said:     Tosh9.0:  a growth unit (which, imo, should have a heavier emphasis on performance-connected comp/commissions)   and that is the reason why we decided to tie the quarterly bonus with each contributor’s performance. Each mandate is different, and it would be great for both the CU and the governance to establish OKRs that help MakerDAO stay focused, aligned, and engaged. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.712962962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#81",
                    "likes": "7",
                    "time": "09/03/2021-20:33:31",
                    "content": "Let’s also take a step back and think about valuation - based on Seb’s fantastic  financial presentation, our forward annualized earnings are ~68M, about a 70% net margin off of 95M in revenue (net margin interest). Today, the market cap of MKR sits at 2.22B, meaning our fwd P/E (price to earnings) ratio is 32.7. The Nasdaq trades at 36.6 today, or at a 12% premium to MKR (!). For a business that grew net income 16x in 2020 and is on pace to grow 7.6x this year, this is CRIMINALLY low. For reference, Coinbase grew revenues ~2.4x in 2020 vs 2019 and swung from a -6% net margin to a 10% margin. Based on the private market, many investors expect Coinbase to trade at 30-70x forward revenues when it finally goes public. Consensus forward revenues is around $2B for 2021 which would imply a market cap of $60-$140B! What would Coinbase be trading at if it was on pace to grow revenues at the same rate as MKR? Or if it had a net margin anywhere near MKR? In my opinion, MKR would have to 5x from here to be closer to ‘fairly’ valued. To be clear, I’m talking about the price of the token here, not the revenue or net interest income. Look at AAVE for example, they have about the same net interest income and $1.5B less TVL, yet they trade at 3x MKR’s market cap on a fully diluted basis. Are their token economics that much better than ours? If MKR became a ‘household’ name to the extent Bitcoin or Ethereum are, I could see it 10-20x higher than current prices (higher in the future if fundamentals continue to improve). A few additional questions for @Derek  Presumably we will need to continue growing the team in y2/3/4 correct? What compensation would you propose for them? The same DAI but in MKR terms or would these be more junior members and they would be compensated less? Have you considered a shorter vesting schedule? 4 years is an eternity in crypto Could you provide the comps used for the token compensation? With MKR’s volatility, should the token schedule be based on a 30-day weighted average of the price of MKR (in DAI terms)? If MKR doubles in the next two weeks before the proposal is finalized the comp increases dramatically  Generally, I think people are overly concerned with the dilution and token compensation, as long as everyone’s interests are aligned I don’t see an issue with paying at or above market rates for top tier smart contract talent. My assumption is that one of the key bottlenecks to growing the protocol is having enough capable hands on the smart contract team and that we need to be investing here to keep growing. Really we should be investing in all areas (risk, governance, growth, real-world finance, marketing, etc) and growing as fast as we can in a safe and sustainable way. This is the same strategy tech companies use today, grow as fast as possible and grab as much market share as possible. Build the best possible product/market offering and profits will come. If we do that, everyone involved will profit handsomely  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.562042124542125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#82",
                    "likes": "2",
                    "time": "09/03/2021-22:10:57",
                    "content": "    Doo:  I am just gonna chip in and say it’s a free market and SC team is like professional soccer players.   True - this is what needs to be understood. If you find them overpaid - well, I agree with you. They are lucky and skillful guys whose knowledge in the current market situation is well worth the money. Since I don’t know - and I think most of us don’t - how much money+bonus is realistic and competitive for this job, I have no other way: I have to trust the wisdom of the system operators. Why? Because I believe that they do their best to use and distribute revenues most efficiently. But this whole system is about trust, isn’t it? Anyway it’s interesting to read how different perspectives unfold here, thanks for all of you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.50390625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#83",
                    "likes": "10",
                    "time": "10/03/2021-12:41:48",
                    "content": "Thanks everyone, thoughts in response to the recent comments…     iammeeoh:  Example for discussion: Let us assume, for reference to the current Budget proposal, that we set q=50q=50%q=50 and p=20p=20%p=20.   @iammeeoh running with your example for a moment, do you think it would instead make sense to remove the monthly/quarterly quality control, and replace it with a yearly review instead? I see this being a bureaucratically-governance-intensive task across the community when we should focus on getting things built. Hypothetically, this would give the team a 1 year bonus, reviewed every year based on the previous year’s performance. However! … With that said, I would hesitate to see the longer term vesting model disappear because it provides a clear incentive to remain with the program at a point when one’s skills will be the most sort after - and naturally the incentive to stay is comparable. I can’t stress how much knowledge and system complexity is in the minds of employees who have been with us for longer periods of time. It’s worth reiterating that if the team (or team facilitator) is underperforming they can be removed by Governance at any time.      Planet_X:  maybe it would be beneficial to provide a bit of historical context on this subject? How have developers been paid in the 2016-20 timeframe?   It’s difficult to draw any significance from a historical point of view because the nature of demand for certain skills has changed so rapidly in recent years. Currently, it is the real-world competition and demand that has driven up the value of individuals which gets us to where we are now - competing protocols and top tier companies are our competitors. Levels.xyz , Glassdoor and competing forum blogs provide some insight into this. I will say that this proposal has kick-started a number of discussions with senior engineers in the industry (external to Maker) who are expressing interest in what we are doing. I’m not going to jump the gun yet, but this is a promising sign to see us being able to get the attention of individuals to support future team growth.  @TheoRochaix and @Tosh9.0 thank you for your support. In similar threads calling out value propositions of different teams, namely from @Guy and @SebVentures , I agree that this proposal is different to other teams - I built it up to be independently competitive with market rates and competing industry offers for smart contract developers. I’m not opposed to a broader framework if it takes this proposal into account.  @iammeeoh thank you for sourcing the academic data and raising the notion of tenure as food for thought in the context of culture. I think everyone realises the competitive market we are in and that the free market has shown that we will struggle to retain employees if the economic incentive is greater elsewhere. I do however think you raise a great point about culture and work hygiene. It’s a much much bigger topic than this thread can cover but in due course I would like to delve into this with the community - the attitudes, beliefs and behaviours that shape us as Maker are important and define why employees (not just engineers) want to work for Maker.      Nadia:  it would be great for both the CU and the governance to establish OKRs that help MakerDAO stay focused, aligned, and engaged.   Thanks Nadia, indeed, we plan to illustrate clear OKRs, and if they change throughout the quarter, we need to communicate why. This is a challenge in crypto because things move so fast, however I’m certain that with our community and governance discussion channels we will be able to continue being transparent.      Aes:  In my opinion, MKR would have to 5x from here to be closer to ‘fairly’ valued.   Yes! But there is a lot of work to safely get us there and beyond. Regarding team growth. In the first year we have accounted for growing the team by 5 individuals. (currently we have a team of 9). It is expected that these new team members will receive the same MKR, vesting from their start date, as the rest of the existing team members. This budget and growth within the first year is based on meeting current demand. For growth in following years we will submit a new proposal for Governance approval. My initial thoughts were that this would be less MKR due to lower risk but would be structured as the same 4 year vesting plan to incentivise long term commitment. Just a note here on the 4 year vesting …I want to emphasise that It is very unlikely for people to stay in a role for 4 years in this industry. We want our team members to remain because their knowledge at years 2, 3, 4 is incredibly valuable - to know where the skeletons are in the closet and why certain technical approaches work or not saves weeks and weeks of work. I am trying to match the incentive with this skillset. Initially to attract, and then to retain. ^ this eternity in crypto is indeed a long time, which is why the MKR is unlikely to be paid out in full - but if it is, we really deserve those people. Also, during this time we remain accountable to Governance. Alternatively, if we were pursue a 1 year timeframe we may get things out the door quicker to reach a goal but we lose the vested interest in making the protocol secure over the longer term. Regarding MKR volatility - we proposed a % of supply, which I don’t see changing in the coming weeks regarding the existing surplus. If there is some dramatic change, I think it’s reasonable to raise it here for reevaluation. @Aes, you raise good ideas in both your posts thank you. I am still giving thought to the performance based suggestions you had in your first post and will respond when I have a formulated my thoughts.  It’s challenging to convey emotion in forum posts, but I want everyone to know I am grateful for the effort and thought you have put in replying here. Much of this is still being considered and discussed with various stakeholders as we work towards the end of the RFC period. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.645599333099334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#84",
                    "likes": "6",
                    "time": "10/03/2021-12:52:53",
                    "content": "    Derek:  @iammeeoh running with your example for a moment, do you think it would instead make sense to remove the monthly/quarterly quality control, and replace it with a yearly review instead? I see this being a bureaucratically-governance-intensive task across the community when we should focus on getting things built. Hypothetically, this would give the team a 1 year bonus, reviewed every year based on the previous year’s performance. However! …   Of course! I completely agree with 1 year being better than monthly/quartely.     Derek:  With that said, I would hesitate to see the longer term vesting model disappear because it provides a clear incentive to remain with the program at a point when one’s skills will be the most sort after   I have to say I didn’t see this point. Thanks. You are right that, under my proposed system, people are greatly incentivised when things go well, but not when things go bad. Obviously the idea is that this incentivises people to “turn things towards well”, but it is true that it might be problematic to come out from a local-bottom if the incentives are low/null. Good point!     Derek:  I think everyone realises the competitive market we are in and that the free market has shown that we will struggle to retain employees if the economic incentive is greater elsewhere. I do however think you raise a great point about culture and work hygiene. It’s a much much bigger topic than this thread can cover but in due course I would like to delve into this with the community - the attitudes, beliefs and behaviours that shape us as Maker are important and define why employees (not just engineers) want to work for Maker.   Love this paragraph. Thanks.  I am sure things will work out in the best possible for for you, your Core Unit members (present and future) and MakerDAO as a whole. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.35653659611993
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#85",
                    "likes": "4",
                    "time": "19/03/2021-18:13:49",
                    "content": "Can we just ratify this and get to building? These numbers are pretty small in the grand scheme of things and the Smart Contract bottleneck is an existential threat to the continued success of the protocol. I think @Derek and the team are being pretty fair with their numbers given how important they are and we can continue the MKR vesting discussion as a larger philosophical discussion in another place. I’m really excited to get this moving so we can keep pumping out awesome new features. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.4906343656343655
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#86",
                    "likes": "1",
                    "time": "21/03/2021-04:02:34",
                    "content": "After reviewing levels.fyi the top engineers at a few of the faangs are: Facebook E8 - 302k base salary, 796k stock option 215k bonus Google L8 - 326k base salary, 746k stock option 121k bonus. It’s important to note these top paid software engineers typically are managing 100+ developers across multiple teams. I think it is insane that each member of the SC team will be higher paid then the top engineers at Facebook and Google. It feels like the SC team is trying to hold the project hostage with this ridiculous proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.520833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#87",
                    "likes": "1",
                    "time": "21/03/2021-11:55:34",
                    "content": "    Zarevok:  I think it is insane that each member of the SC team will be higher paid then the top engineers at Facebook and Google.   I think the SC people have competences that are currently very hard to find, and proven track of concrete results. They are in the right place at the right time. And it’s just natural that they want to maximise this good positioning.     Zarevok:  It feels like the SC team is trying to hold the project hostage with this ridiculous proposal.   I think this is a bit exaggerated. But I agree with you that it is a failure of the Foundation to have left the community depending on a single group of devs. It is my understanding though that both the community and the SC-team agree on the need (and perhaps even the urgency) to diversify over the course of the next few years. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.834635416666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#88",
                    "likes": "9",
                    "time": "21/03/2021-13:51:36",
                    "content": "    iammeeoh:  But I agree with you that it is a failure of the Foundation to have left the community depending on a single group of devs.   So true. Since every random problem in life, the universe, and everything can ultimately be traced back to the failings of the Foundation, clearly everyone will live in peace and life will be perfect once it is dissolved. I’m really looking forward to it. I for one do not expect anything less than paradise on the blockchain, and I will be utterly shocked should reality turn out to be just a bit more complicated than that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.010533910533911
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#89",
                    "likes": "0",
                    "time": "21/03/2021-14:23:58",
                    "content": "    wouter:  So true. Since every random problem in life, the universe, and everything can ultimately be traced back to the failings of the Foundation, clearly everyone will live in peace and life will be perfect once it is dissolved. I’m really looking forward to it. I for one do not expect anything less than paradise on the blockchain, and I will be utterly shocked should reality turn out to be just a bit more complicated than that.   lol, funny. Sorry for a second I must have forgotten that “The Foundation” is perfect and has only done perfect things  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.781499202551834
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#90",
                    "likes": "0",
                    "time": "21/03/2021-16:03:16",
                    "content": "This dao’s operation costs will continue to increase as we add more core teams and I am concerned if the community accepts these high compensation proposals we will not have sufficient funds for the rest of the initiatives. I also agree, I would much rather see the dao hire multiple SC teams of 6-7 devs in size that work independently of each other so we are not reliant on a single point of failure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.216815476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#91",
                    "likes": "0",
                    "time": "21/03/2021-16:25:12",
                    "content": "    brianmcmichael:  We have researched what the industry is paying and this proposal is, we think a fair one, that will retain developers in this space   Can you please share the comparisons you found? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#92",
                    "likes": "0",
                    "time": "21/03/2021-16:31:59",
                    "content": "But would you expect other non-SC teams to earn significantly less? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.270833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#93",
                    "likes": "1",
                    "time": "21/03/2021-16:44:09",
                    "content": "Define significant? I agree smart contract developers must be highly compensated however their current proposal is far beyond any comparison I’ve found. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.849285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#94",
                    "likes": "0",
                    "time": "21/03/2021-16:47:17",
                    "content": "If the budget proposal is too high doesn’t that give room for another team to propose a smaller budget to undercut the current team? Right now the SC team has a monopoly on negotiation as there is no alternative. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.557142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#95",
                    "likes": "0",
                    "time": "21/03/2021-16:52:49",
                    "content": "Then I think we would be doing the dao a disservice locking ourselves into this 4 year contract. Perhaps we bite the bullet for a year and use the time to launch a second SC team? This would allow us to renegotiate next year from a better bartering position. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#96",
                    "likes": "4",
                    "time": "21/03/2021-17:25:57",
                    "content": "    Zarevok:  I think it is insane that each member of the SC team will be higher paid then the top engineers at Facebook and Google. It feels like the SC team is trying to hold the project hostage with this ridiculous proposal.   Couple of things here.   The risk is much higher at MakerDAO than at facebook or google. MakerDAO is not a megacorp, it is far less likely to be around in a few years than facebook or google, and therefore there is a much higher chance that the stock options will be worth nothing.   Lets avoid highly charged terms like ‘hostage’ and ‘ridiculous’. The Smart Contracts team have communicating their willingness to discuss the issue, and I have no reason to believe that they are acting in bad faith. Please try to engage in a positive manner.       wouter:  So true. Since every random problem in life, the universe, and everything can ultimately be traced back to the failings of the Foundation, clearly everyone will live in peace and life will be perfect once it is dissolved. I’m really looking forward to it. I for one do not expect anything less than paradise on the blockchain, and I will be utterly shocked should reality turn out to be just a bit more complicated than that.   This is an impressive feat of sarcasm, and I enjoyed it quite a lot. That said, lets maybe try to engage in a more straightforward manner. I don’t think anyone really believes that the Foundation has been net-negative for the development of MakerDAO, but it’s also not accurate to say that it has a perfect track record.     iammeeoh:  lol, funny. Sorry for a second I must have forgotten that “The Foundation” is perfect and has only done perfect things    Please try to engage positively. Does this add anything to the discussion? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.7469218765730385
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#98",
                    "likes": "1",
                    "time": "21/03/2021-17:38:50",
                    "content": "    LongForWisdom:  Please try to engage positively. Does this add anything to the discussion?   yes, true. I do apologise to @wouter for reacting so his sarcasm. It’s just that it would be much better if we acted like we are in the same boat, because we are. Did I ever say that the Foundation was bad? For the record, I am grateful for the work it (and all the people who worked for it) has done. Do I think it is flawless? No. Anyway, let’s move on  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.1477272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#99",
                    "likes": "0",
                    "time": "21/03/2021-17:42:24",
                    "content": "say “significant” = half. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#100",
                    "likes": "1",
                    "time": "21/03/2021-19:26:30",
                    "content": "Yes, as an example, experienced members of the SC should be paid more then twice as much as a member of the communications team. However, there is a reason top companies standardize pay to a role and each employee is paid based on the role they are assigned. Unless an individual is managing a large team of developers they are not worth a 2M+ package. Creating an environment where every SC developper we onboard gets 2M+ is not sustainable. A few unanswered questions: Is each member of the SC team equal? What will be the starting pay for new SC members? Should the team facilitator be paid equal to each team member? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.731018981018981
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#101",
                    "likes": "4",
                    "time": "21/03/2021-19:43:05",
                    "content": "    LongForWisdom:  The risk is much higher at MakerDAO than at facebook or google. MakerDAO is not a megacorp, it is far less likely to be around in a few years than facebook or google, and therefore there is a much higher chance that the stock options will be worth nothing.   The purpose of a stock option is to align investor goals with employees. It is not designed to be guaranteed money. Maker will be more volatile over the next 4 years then facebook or Google stock however it also has the potential for much greater multiplicative returns. I would also add the proposal is to mint new maker for the SC team at no cost. This is not the same as a stock option A stock option would imply we instead give the smart contract team the right to buy maker at a set price and this option only has value if the price of maker goes up. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.678030303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#102",
                    "likes": "6",
                    "time": "31/03/2021-19:14:51",
                    "content": "Hi all, Three areas of comment as we put this MIP forward for Formal Submission:   Looking back over the previous month has seen a great deal of discussion on the pros & cons of this proposal. However, we have not landed on an agreement for the MKR reward, as a result the team has decided to put forward our original proposal for on-chain MKR voters to decide.   Due to ongoing discussion of the compensation framework, we reserve the right to switch from our MKR vesting plan to the MKR framework that the community has begun discussing, but has yet to agree on. We hope that a suitable overarching vesting framework will be chosen and backdated to the commencement date of the core unit(s). Therefore, we are submitting our proposal as it exists above, with the option, not the obligation, of switching to a community determined MKR compensation framework if/once it is agreed upon.   As per the update to MIP39c2-SP#7, specifically: “community discussion during the RFC process indicated that we should also give immediate attention to laying the groundwork to promote future protocol growth and innovation, in particular L2 development”. I have increased the number of team members by two, included in the budgeted costs.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.942857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RealityCheck",
                    "index": "#105",
                    "likes": "2",
                    "time": "05/04/2021-04:36:11",
                    "content": "Someone listen to this guy, he is the only person on this thread being reasonable… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#106",
                    "likes": "1",
                    "time": "08/04/2021-10:50:27",
                    "content": "    Derek:  Smart Contract Implementation  Implementation: Automated implementation sending funds to a multisig Multisig address: TBD Frequency: initially monthly, then streaming once the Keg is implemented Asset type: DAI (suck() function), MKR (DssVest mint() function) Amount of Dai in total to be requested per month: $510,000 Amount of MKR to vest at the end of the 1st year: 3,855.625 MKR Multisig Keyholders: The keyholders have been selected by the Protocol Engineering Core Unit and remain anonymous.    Some things here:  When will you be able to provide a multi-sig address? Will the initial distributions be manual (until we get the keg?) When do you expect to receive the first batch of funds?  Feels like the budget is actually more like 6.91M given that over the year you’ll be receiving the lump sum + 11 months of 510k. I’m aware you’re not spending all of that in the year, but it is something you need to operate, and governance doesn’t have access to those funds anymore (as I understand.) If you can, please make this more clear, I’m fine with you editing the MIP at this stage if the goal is to increase clarity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.241341991341991
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#107",
                    "likes": "2",
                    "time": "14/04/2021-15:30:30",
                    "content": "@LongForWisdom , thank you, I have updated the MIP section “Smart Contract Implementation” to include updated multisig addresses as requested. Also, a further clarification regarding timing: if the April 26th executive passes, the Core Unit would officially work for the DAO from May 3rd. For this to occur, we would seek forward payment of the first month, May ($510,000) to go into the Protocol Core Unit Multisig, and the continuous employment lumpsum ($1.3m) to go into the Continuous Employment Fund Multisig at the passing of the MIP bundle executive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#108",
                    "likes": "3",
                    "time": "14/04/2021-16:07:58",
                    "content": "    Derek:  the Core Unit would officially work for the DAO from May 3rd. For this to occur, we would seek forward payment of the first month, May ($510,000) to go into the Protocol Core Unit Multisig, and the continuous employment lumpsum ($1.3m) to go into the Continuous Employment Fund Multisig at the passing of the MIP bundle executive.   Done!! Can somebody please forward this Gentleman the DAI requested above. TY in advance. May is looking like a Month for celebration!   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.651041666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#109",
                    "likes": "0",
                    "time": "15/04/2021-04:30:10",
                    "content": "    Aaron_Bartsch:  Maybe the Foundation should use some of their treasury to actually properly compensate the employees that made this all possible.   Actually this begs the question of how much MKR IS left in the treasury.    While I want to retain talent 1K MKR over 3yrs is pretty much retire money.   Given the heat in the space probably reasonable but I would honestly expect some pretty high team turnover rates within these 4 year periods because of this - so plan accordingly by staggering quality hires. Hence my next question.   If turn-over is going to be high how is the team going to find and retain the next people?   Also what sort of non-compete clauses are there (any?).  I mean I don’t want a Maker smart contract dev just up and going somewhere else to fork the protocol or to compete with it. It is going to be interesting to total up these Core unit costs and look at the current revenue rate because right now I am seeing some pretty big numbers being put up and I am only on the the second core team. Begs a question who is integrating the financials on all these core units into a kind of business expense run report based on the asks here? My other issue is how in the heck we are going to get any decentralized backup redundancy in these groups with these kinds of budgets?   Is it even possible? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.635648148148148
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#110",
                    "likes": "0",
                    "time": "15/04/2021-05:19:33",
                    "content": "    MakerMan:  Begs a question who is integrating the financials on all these core units into a kind of business expense run report based on the asks here?   RWF is working to get this done. You can see the first report here. And @Aes is working on an updated version. Should have more detail in the next monthly financial presentation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.35
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#111",
                    "likes": "0",
                    "time": "15/04/2021-05:48:26",
                    "content": "I keep a spreadsheet of net revenues based on vault SF, DCs.   Last time I ran this came up at 115M/yr being the current revenue rate P/R 19.2,   57M/yr expense doubles this as a P/E, 83M quadruples it. We talk about having sufficient funds for operations and whining about having a surplus in the 60-100M and not burning MKR to achieve this as fast as possible when expense run rates looks to be in the 50-80M/yr range??!   I mean sure we can always print MKR, but we really need to be thinking about a secondary reserve as I can see pulling these funds from surplus during bad times could easily start minting MKR. I am back to how much MKR does the foundation have left for these kinds of expenses that will be folded back into the DAO proper as a kind of ‘rainy day fund’.   Remember Maker has SF’s pretty much at 0 for an extended period after BT. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.334429824561404
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#112",
                    "likes": "3",
                    "time": "15/04/2021-06:42:41",
                    "content": "I made an analysis (not documented) and keeping such an external buffer in the surplus is better in all cases. Having an external buffer makes sense only if you want to convert some DAI in USDC in case of a big issue with DAI. DAI holders will not like it. But you are right that expenses (in DAI or MKR) are decreasing MKR profitability and limit our ability to increase the Surplus Buffer in line with growth (I discussed that here). That’s why I advocate that MKR holders limit expenses to a fixed amount (that can be revised as much as we want over time). PS: Maybe it is better to continue that discussion in this thread. A Framework for Valuing MKR ",
                    "links": [
                        "https://forum.makerdao.com/t/a-framework-for-valuing-mkr/7442"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.792857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#113",
                    "likes": "2",
                    "time": "16/04/2021-00:27:32",
                    "content": "@iammeeoh It’s an interesting aspect you’re bringing here to the discussion. Personally, I am not quite convinced this could be applied as a blanket measure across all types of roles within the MakerDAO Core Units.     iammeeoh:  I can state (with 100% confidence) that one of the most effective compensation academics receive in research universities is TENURE. Most people starting postdocs after their PhD, and trying to do an academic career, are attracted to tenure way (way!) more than money.   It’s quite difficult seeing Software Engineering type of activities fitting into that box. It’s quite a collaborative and peer-review heavy approach comparing to other functions. Think of pair-programming for example. For Risk teams, I personally agree that approach can be valid, particularly when it involves modelling parameters. There is relatively little review of existing models by independent teams to allow the research-like activities that you find in modelling teams even within banks and other economics institutions. That leads to potentially not ideal outcomes and a lot of trust given to Risk teams without checking frameworks. While this was OKish when the protocol had just a feel million staked, lack of model documentation and reproducibility by other teams is one of the biggest risks to MakerDAO as the protocol grows. Critical smart contract changes have audits. Critical Risk changes in a multi-billion dollar ecosystem might as well have some… Liq 2.0 was a first  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.438793995859213
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#114",
                    "likes": "1",
                    "time": "16/04/2021-00:32:16",
                    "content": "    williamr:  It’s quite difficult seeing Software Engineering type of activities fitting into that box.   I have to agree here! Tenure is a really bad set of incentives that encourage rent-seeking. It’s been studied to death in the economics literature and academics with tenure on average publish less, in less influential journals, teach less, and their students report lower satisfaction from their teaching. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#115",
                    "likes": "1",
                    "time": "16/04/2021-06:26:28",
                    "content": "    williamr:  Personally, I am not quite convinced this could be applied as a blanket measure across all types of roles within the MakerDAO Core Units.   I totally agree. Perhaps it sounded like I was proposing tenure for the SC team. I was not. Just to be clear, I was just expanding on the Reddit quote from rune:  I also think a good place to look for compensation standards would be research universities and how research positions at such institutions are compensated.  I agree that tenure is a very expensive instrument. It is most definitely not what is needed in a startup/experiment/young-DAO like MakerDao. At least not at this stage.     PaperImperium:  It’s been studied to death in the economics literature and academics with tenure on average publish less, in less influential journals, teach less, and their students report lower satisfaction from their teaching.   It has also been studied that researchers are more likely to commit fraud, publish fake results, target h-index pumps rather than honest research, etc, if they are under the pressure of “renew the contract” or “apply for the next job”. From wikipedia:  Tenure is a means of defending the principle of academic freedom, which holds that it is beneficial for society in the long run if scholars are free to hold and examine a variety of views.  Anyway, MakerDAO is not academia. So I 100% agree with you guys that the tenure system is not appropriate for what we are doing here now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.09090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#116",
                    "likes": "2",
                    "time": "16/04/2021-07:51:27",
                    "content": "    iammeeoh:  So I 100% agree with you guys that the tenure system is not appropriate for what we are doing here now.   I actually think there areas of MakerDAO that would benefit greatly from that intellectual freedom and inquisitive peer review. For me the low hanging fruit is risk modelling. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.85
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#117",
                    "likes": "3",
                    "time": "16/04/2021-08:35:06",
                    "content": "    williamr:  I actually think there areas of MakerDAO that would be benefit greatly from that intellectual freedom and inquisitive peer review. For me the low hanging fruit is risk modelling.   I kind of agree with this. But in my opinion (as a tenured academic myself), the best approach is not to replicate academia “outside” academia, but to interact with academia. For instance,  fund PhD/PostDoc scholarships on the topics that we care about (at the ‘fundamental research’ level). Sponsor academic conferences, run workshops, etc Try to create incentives/rewards for our (research-oriented) Core Units to publish in good conferences/journals (to get peer-review external feedbacks), etc. → A good example is RWF in my opinion.  As far as I know the CMU has a substantial amount of MKR, donated to them by one of MakerDAO founders: MakerDAO co-creator donates $1.4 million in MKR to Carnegie Mellon | Modern Consensus. That would be a good (top level) institution to start interacting with academia.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.866666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/liberuum",
                    "index": "#118",
                    "likes": "1",
                    "time": "16/11/2021-11:34:53",
                    "content": "As part of our broader effort to bring more transparency to the CU budget structure, we have documented the wallet setup of this CU and others;  1430×781 126 KB  Read more about it here: Introducing the CU Budget Transparency Map ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#119",
                    "likes": "0",
                    "time": "17/11/2021-04:26:07",
                    "content": "Thank you Petru_Catana!     Derek:  The current team has 9 full-time smart contract engineers, 1 part-time smart contract engineer, and 1 proposed Team Facilitator (for a total of 11 members). The team is seeking to grow this by 5 members to a total of 16 members. This opportunity to scale will enable us to better meet the demands of the community.   @Derek I understand you are busy however at some point could you provide an update on PE unused funds? Based on makerburn.com on 14 PE members are currently vesting so I guess we should expect unused funds to be returned at some point. Right? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.730158730158729
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#120",
                    "likes": "4",
                    "time": "17/11/2021-11:36:01",
                    "content": "Hi Zarevok, Yes! I have and intend to provide per-monthly categorised expenses from the PE team, but would like to provide descriptive context first around some of our audit, software and tooling costs so it makes sense to the community. This will include both surplus (salaries) and deficit amounts (audits and gas deployment costs). Keep at me about this, early December should be a quieter time for me to complete this task and provide an insightful report. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                }
            ]
        }
    ]
}