{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/campaigning-vote-no-on-inclusion-poll-for-strategic-marcomms-core-unit-mip-set-may-10-2021/7951",
            "title": "[Campaigning] Vote NO on \"Inclusion Poll for Strategic Marcomms Core Unit MIP Set - May 10, 2021\" ",
            "index": 7951,
            "category": [
                "Governance"
            ],
            "tags": [
                "cpm-001",
                "polls",
                "core-unit-budget",
                "campaigning"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "15",
                    "time": "10/05/2021-16:42:18",
                    "content": "I urge fellow MKR holders to vote no on including the Strategic MarComms proposals in the upcoming executive. I will be brief in my reasoning, and answer any detailed questions in the comments.   It has poorly defined goals, centered around activities such as “Help people understand the benefits of Dai by providing educational content and events” and “increasing awareness of Dai.” I find these to be low-reward tasks given that our core users are not small retail vaults and are unlikely to be so in the future. Additionally, it is not possible to easily capture the return on activities that are simply meant to increase awareness.   It includes 5 million DAI in unrestricted funds. This by itself would be the second-largest CU budget in DAI expenses. It is far too much to put into a fund that has no guidance on appropriate uses, or promises of reporting to the DAO about those uses after the fact. This has a high probability of being either wasted or left unused. Either case is not a good precedent. It will encourage proposals that treat the DAO like a cash cow. We have money, so what’s the big deal if we spread it around? Not the optics we want.   This would be by a margin of 50% the largest DAI budget for a CU. Even mission-critical CUs like PE have received far less than the 9,700,000 DAI requested on an annual basis by this proposal. Given that it’s unclear exactly what this CU is supposed to do, this is far too large of a budget. For reference, important CUs that directly contribute to our bottom line in a way that is unambiguous receive about 5% (RWF) and 17% (Growth) of this requested budget. If we want to spend 9.7 million DAI to grow our user base and DAI adoption, those are the two units we should put it into.   No clear record of execution. I understand that the situation with the Foundation means we can’t look under every stone or have every question answered. But for almost 10 million DAI, we need more examples than a YouTube video with a mere 4145 views over two and a half months. Even if you believe that millions of DAI should be spent on raising awareness of DAI in the general public, this is not an example of spend with any return on investment. We need to see more of the portfolio of past efforts and the metrics they delivered.   In general, there is no plan. Despite being pressed repeatedly, there has been no clear explanation about exactly who would be targeted by marketing, nor what action those targets would be asked to undertake. Is this supposed to target financial advisors? Regulators? The general populace? What do we want those people to do once they hear our message? Does it even matter if most people have heard of DAI at the moment?   If this makes it into a bundled executive, it will endanger all other important decisions bundled with it. Even if this passed on polling because whales aren’t paying attention, they’re not going to look kindly on a bloated budget for… ???.. that also includes 5 million in unrestricted “moonshot” funds. Anything bundled with this proposal at an executive vote would be in danger of being voted down and delayed for a cycle.   Vote no. I welcome comments or questions about this below. ",
                    "links": [
                        "https://www.youtube.com/watch?v=TRJZtKHdofY",
                        "https://vote.makerdao.com/polling/QmT8hdMX?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-may-16th-2021/8248",
                        "https://forum.makerdao.com/t/mip39c2-sp9-strategic-marcomms-core-unit/7189/65",
                        "https://forum.makerdao.com/t/what-are-our-priorities-and-how-can-we-stay-focused-on-things-that-matter-the-most/8697/13",
                        "https://forum.makerdao.com/t/call-for-makerdao-facilitators-to-share-a-multisig/7977",
                        "https://forum.makerdao.com/t/maker-relay-ep-44-en-espanol/7998",
                        "https://forum.makerdao.com/t/maker-relay-ep-44/7974",
                        "https://forum.makerdao.com/t/are-we-having-a-loud-minority-problem/7972"
                    ],
                    "GPT-summary": "The post is a critique of the Strategic MarComms proposal, urging fellow MKR holders to vote against it. The author argues that the proposal has poorly defined goals, a large budget with no clear plan, and no clear record of execution. The author also expresses concern that if the proposal is bundled with other important decisions, it may endanger their chances of passing. The post invites comments and questions about the author's reasoning.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.123539682539683
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#2",
                    "likes": "0",
                    "time": "10/05/2021-16:57:04",
                    "content": "    PaperImperium:  If this makes it into a bundled executive, it will endanger all other important decisions bundled with it. Even if this passed on polling because whales aren’t paying attention, they’re not going to look kindly on a bloated budget for… ???.. that also includes 5 million in unrestricted “moonshot” funds. Anything bundled with this proposal at an executive vote would be in danger of being voted down and delayed for a cycle.   On the other hand why whales wouldn’t vote on polling? We saw them voting sometime for some polls. I don’t remember which one but I have seen at least one poll getting more votes than the hat. Any particular reason? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.600694444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "0",
                    "time": "10/05/2021-16:59:32",
                    "content": "    alexis:  Any particular reason   Just speculation, and a worst case if this passes. Obviously if you believe the underlying proposal is good then this is a feature, not a bug. But I worry it won’t be closely read and pass with minimal participation ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal"
                    ],
                    "Sentiment": 4.766666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#4",
                    "likes": "5",
                    "time": "10/05/2021-17:05:15",
                    "content": "Wow! This is the first instance of a campaign for a NO, I think. I thank you for this (independently of the specific topic: Marcomms) because:  I think it’s useful to campaign for a YES just as much as it is for a NO, and, there are no incentives for doing something like this and, if anything, you might look as the “asshole”.  Anyway, coming back to Marcomms, I mostly agree as I stated long ago:    MIP39c2-SP9: Strategic Marcomms Core Unit   As a constructive feedback, and on a very personal note (and possibly very blind and shortsighted) I will personally vote against this Core Unit proposal as I find it not up to (and in fact far from) the standards required.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.298076923076923
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#5",
                    "likes": "0",
                    "time": "10/05/2021-17:08:20",
                    "content": "My point is I believe there is no evidence that will be the case. This statement is purely speculative and shouldn’t be used as it. I don’t think there is much whales left. and regarding a16z, it looks more a dolphin now than a whale . ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.142857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#6",
                    "likes": "11",
                    "time": "10/05/2021-17:27:56",
                    "content": "As a future delegate, I will hereby explain my position on a Core Unit proposal. The Maker community needs effective marketing of its core product Dai. To this goal, the Strategic Marcomms Core Unit has been proposed for the purpose of Strategic Marketing and Communication. Members of the proposed group have been with Maker since August 2019. However, based on their application, the comments, and the track record of the group I have serious objections. Strategy If you are going to do something strategic you first need a strategy, highly preferably in writing. Who is targeted and who is not and why and in what order? Unfortunately, I do not see any such document provided. The application repeatedly does not distinguish between what is a strategy, what is a task, and what is an intention. What is provided is a list of tasks and intentions, and although these are all good and worthwhile I fail to see how this is going to get us anywhere. One example would be how the gas fees, which have been painfully high for more than a year, makes any serious attempt to reach the poorer regions of the world highly questionable. This has fundamental implications for the groups targeted by Maker. There is no trace of such considerations in the provided documentation. Marketing Marcomms seeks to deliver ‘clear communication in key channels’. Well, let’s start with Youtube. There are four videos uploaded by Maker on Dai with a total of 4,771 views. It is not that there is anything specifically wrong with them, it is just that they fail to reach any sizeable audience. Go to Youtube and search ‘stablecoin’ - the top 10 videos have a total of 485,000 views. Maybe just possibly we should let social media influencers that actually get clicks, produce or promote at least part of our marketing? This is not mentioned in the application. Another fact about the crypto landscape is the intensely skewed power distribution, with edge dev teams, whales, and community leaders having an enormous influence compared to their numbers. In your provided documentation, there is no mention of any of these groups or their importance or how to reach them, nor any other mention of your interpretation of the present and trending crypto social landscape and how it impacts marketing. Communication People want their entertainment to education ratio to be about 2000:1 or something which is why even mediocre cat memes get whole factors more views and likes compared to educational info on decentralized stablecoins. OK - so maybe Dai is not easily memeable, but you should take this into account in your plan and discuss how to get around it. All large and valuable brands have carefully crafted emotional messaging baked into them. Just feel the curious, exploratory, and clearly infantile sound of “Google” or the direct association to fresh, new, green, healthy when you hear “Apple”. In the world of crypto, I will point to Litecoin and Monero as examples of different but fairly consistent emotional messaging. And the emotional message of Dai is what? When a former oilfield engineer like myself can spot that the emotional element to some degree is missing it could be a bit of a subtle hint. To sum it up: Strategic Marketing and Communication - according to my judgment the strategy is not there, the marketing is out of sync with crypto realities and the communication is lacking the emotional depth and power necessary to be heard and remembered. And the worst part? This group has already had two years to practice, review and revise to get this right. Maker needs marketing - but not this marketing. I will be respectfully voting against this Core Unit proposal. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-55-en-espanol/9715",
                        "https://forum.makerdao.com/t/are-we-having-a-loud-minority-problem/7972/3"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving entirely negative feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1567803030303025
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#7",
                    "likes": "4",
                    "time": "10/05/2021-17:31:09",
                    "content": "I have to say I agree with @PaperImperium on this campaign - thank you for starting this thread. Having read through the points raised here and particularly here, I don’t see enough justification for the funding requested. @LongForWisdom is it okay to link this thread to the thread that the voting portal points to? ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp9-strategic-marcomms-core-unit/7189/60"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "2",
                    "time": "10/05/2021-17:38:47",
                    "content": "    AstronautThis:  @LongForWisdom is it okay to link this thread to the thread that the voting portal points to ?   Yes, go ahead. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#10",
                    "likes": "1",
                    "time": "10/05/2021-18:13:36",
                    "content": "I agree with those above that I see nothing that justifies giving this CU 9.7 million DAI. This is nearly one third of the current stability buffer. Quite frankly, given how poor the proposal is I would suggest that delaying burning by funding this proposal would be far more harmful from a PR perspective than any short or medium term benefits we would receive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#11",
                    "likes": "2",
                    "time": "10/05/2021-18:26:47",
                    "content": "Don’t let “them” pull the wool over your eyes–think for yourself:     [CAMPAIGN: MIP39c2-SP9] Vote YES on “Inclusion Poll for Strategic Marcomms Core Unit MIP Set – May 10, 2021.” Governance       Maker Community, it’s that time of the week to decide to express your support or opposition of the newly posted Governance Polls. One inclusion poll that you will be ask to select is whether to approve the Strategic Marcomms Core Unit, or not.  Marketing Distribution. When you vote—I ask that you think about one of the keys to success: Distribution, Distribution, Distribution. Products that achieve greatness get this one thing right.  Value Proposition. We All know that the BD team has had treme…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party advertising proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.965097402597403
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#12",
                    "likes": "9",
                    "time": "11/05/2021-00:35:38",
                    "content": "I should also state here that I have no objection to a heavily fleshed-out CU proposal being submitted for the next round of on-chain votes. But given that the proposed marketing and communications unit cannot communicate clearly what it is they need by far the largest budget for — or even what their work process will look like on any given campaign — I will hope for more clarity on the next try. That 5 million DAI in unrestricted funds is a hill I’m willing to die on, though. That alone would be the third-largest CU budget, and has been justified on the grounds of confidential agreements that couldn’t be shared with the DAO. If we’re ever in such a hurry to spend 5 million DAI on one thing that the endeavor can’t even be announced to the DAO, then we’re in trouble. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#13",
                    "likes": "1",
                    "time": "11/05/2021-08:26:12",
                    "content": "    PaperImperium:  Even if this passed on polling because whales aren’t paying attention   I’m struggling with the idea that a whale (or anyone) might not be paying attention when they vote, and should be protected to make sure they don’t make a mistake. There’s enough noise now in the forum that the situation should be clear without resorting to this kind of precedent. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gustav_Arentoft",
                    "index": "#15",
                    "likes": "18",
                    "time": "11/05/2021-14:42:25",
                    "content": "Only thing that I have clearly against this is how much I know this budget could do working on BD deals. Where part of the budget would be allocated via the external partner integration. For 5m we could pitch to major Fintechs who have already been dipping the toes into crypto and get a long-lasting relationship using the 5m to subsidise the DSR while its still negative. I am not sure allocating this amount of money to purely marketing that brings no revenue or long-lasting business integrations with it back is a good idea. This might be because I am biased working with BD, but I don’t think that many marketing campaigns adds sticky users. I know that Business integrations does that for Dai. We need to focus on user retention, and I would rather see the Growth Core Unit receive a bigger budget than spend it here on undefined adds. I think we should also take note that the previously most successful Marketing campaigns with Dai/MKR has been done by companies like Coinbase Earn, OkEx or The Red Cross. The Growth Core Unit should have a strong say in how that capital should be deployed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.855917366946779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deadpool77",
                    "index": "#16",
                    "likes": "5",
                    "time": "11/05/2021-16:45:23",
                    "content": "The amount and the opportunity cost is what I have issue with. We are talking about spending this much in marketing when we have no native layer 2 implementation. People can’t even really get loans from us unless they have at least 10k. We are supposed to spread the word far and wide about our protocol when nearly everyone who hears about it won’t be able to use it because of gas fees. We could hire more devs to work on l2 or establish partnerships with fiat gateways. Marketing has no business being our largest core unit in a space where the tech evolves so rapidly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#17",
                    "likes": "2",
                    "time": "12/05/2021-02:23:25",
                    "content": "A large budget should bring large results that are going to be tangible. It also seems premature since people are not going to be able to use DAI with sky high gas fees. So it seems that working on scaling DAI comes before marketing DAI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.360714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#18",
                    "likes": "0",
                    "time": "12/05/2021-03:03:32",
                    "content": "You can have the dApp on the fastest mainnet and nobody will use it if nobody knows about it. Also, as building Maker dApp on L2 and different mainnets have been controversial (but Optimism one is coming hopefully), the focus has been on having Dai on these mainnets and L2 so people can use it. Indeed, there’s already billions of Dai on BSC, Matic, Klaytn, and etc. So I think we are getting the first part done. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#19",
                    "likes": "0",
                    "time": "12/05/2021-04:26:52",
                    "content": "    Gustav_Arentoft:  Only thing that I have clearly against this is how much I know this budget could do working on BD deals. Where part of the budget would be allocated via the external partner integration. For 5m we could pitch to major Fintechs who have already been dipping the toes into crypto and get a long-lasting relationship using the 5m to subsidise the DSR while its still negative.   Are you speaking on behalf of the growth team? If so, then, I strongly urge you to put that in the Growth unit budget. It is great to hear what you have in mind and would love to see that come true. If you are not speaking on behalf of the team, then, thanks for your input anyways. One thing to keep in mind though, this isn’t a zero-sum gain. The growth unit and strategic marcomms don’t operate separately, just like the DAO needs governance CU, as well as smart contract team, and others. Each function exists to support the growth of MakerDAO. A collaboration between the two teams would generate more value and synergies than one.     Gustav_Arentoft:  I am biased working with BD   It’s great that you are highlighting the function of BD. You argue that marketing isn’t effective enough to get what it needs (budget) to get things done like BD because they bring no revenue. Even though the overall mission is the same, marketing is indeed different from how BD operates. Their approach and targets are different. Comparing the two is like identifying the difference between an orange vs. an apple. BD’s role is business collaboration and partnership, whereas marketing brings awareness and traction by creative means such as campaigns, ads, content, and news articles. And I would have to agree with you that it does seem like your view is coming from a BD person who isn’t specialized in marketing or PR communications. Therefore, your argument makes a lot of sense only and purely from a BD perspective. Marketing touches a broader audience and makes it easier for BD to start that conversation because potential partners would have heard of us because of Marketing. PR brings credibility to an organization. Their input is calculated not by revenue but by the amount saved in advertising. The value of strategic positioning, branding, and credibility is crucial for MakerDAO if you believe we are heading into the next stage of growth. As for the companies you have mentioned as successful marketing campaigns, it sounded like no big role was played by any marketing department in any organization. Rather than going down that path of zero-sum-gain kind of discussion, I want to bring the focus back to collaboration. My unit is committed to work with other teams to create synergies that can take us all further together. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.918213118580765
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#20",
                    "likes": "1",
                    "time": "12/05/2021-05:04:58",
                    "content": "I been in both marketing and BD role at Maker but I think there’s a misunderstanding. One is yes, there have been a lot of restrictions on marketing. For example, we have Maker and/or Dai on major platforms like Samsung and Kakao but pretty sure nobody took notice as we didn’t do marketing or even announcements around them. So the hope is with the new format, the marketing can be more assertive and flexible. Two is Gustav is not saying that marketing itself is bad. It’s just the size of budget maybe needs to be discussed and come to a compromise. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.67775974025974
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#21",
                    "likes": "1",
                    "time": "12/05/2021-05:06:32",
                    "content": "    Kathleen:  calculated not by revenue but by the amount saved in advertising.   I think 5 million dollars in advertising budget for Maker to have an ad on a soccer team, professional boxer, or martial artist would have a far bigger impact than this core unit could in years. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#22",
                    "likes": "0",
                    "time": "12/05/2021-05:22:56",
                    "content": "    ejbarraza:  I think 5 million dollars in advertising budget for Maker to have an ad on a soccer team, professional boxer, or martial artist would have a far bigger impact than this core unit could in years.   That’s why the Strategic Marcomms unit has proposed the Moonshot fund and what it is potentially for. The sentence you quoted refers to the PR part of the Strategic Marcomms unit and how the contribution from PR is calculated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#23",
                    "likes": "0",
                    "time": "12/05/2021-05:38:17",
                    "content": "If it is of any help, I have explained in details why the moonshot fund is needed. The unit’s two key objectives are:  Increasing the awareness of Dai and the Maker Protocol Boosting Dai adoption through promotions and partnerships  We want to act on a campaign proposal that is deemed with high ROI for awareness and exposure. The metrics differ depending on the type of campaign. In the case of FTX’s naming rights of the Miami NBA stadium, the measurement would include:  An estimate of media exposure Total number of impressions (Or eyeballs) Traffic to the FTX site User growth A total number of FTX goods sold for merchandise branding The number of mentions associated with FTX’s name  The proposition would have to justify the reported cost of $135 million over 19 years, which comes down to about $7 million a year. The reality is that the details of measurement above probably won’t ever be shared. In our case, after a campaign is introduced to the public, we should and be able to share some details regarding the ROI and other data to the extent agreed upon with our potential partners. I am not saying buying naming rights is how we want to spend our moonshot fund, but that is one example of getting seen and known by a target audience beyond crypto. Apple’s “Think Different” TV ads and AOL’s free trial CDs are some excellent examples of how we can creatively approach our target audience. Apple’s ad touches people in so many ways without a word on computers. AOL’s CD campaign successfully onboarded millions of users. They differ in the form of ads/marketing campaigns, but their success is achieved by aiming higher and the willingness to take risks. ",
                    "links": [
                        "https://www.cnbc.com/2021/03/26/crypto-industry-to-get-first-major-us-stadium-with-miami-dade-county-approving-ftx-for-heat-home.html",
                        "https://youtu.be/cpzvwkR1RYU",
                        "https://www.mentalfloss.com/article/87291/youve-got-mail-history-aols-free-trial-cds#:~:text=According%20to%20some%20estimates%2C%20AOL,in%20a%20matter%20of%20years."
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.199836601307189
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gustav_Arentoft",
                    "index": "#24",
                    "likes": "3",
                    "time": "12/05/2021-08:41:33",
                    "content": "    Kathleen:  Are you speaking on behalf of the growth team?   No, I am not speaking on behalf of the Growth Core Unit. I let Nadia do that. I am just giving input.     Kathleen:  You argue that marketing isn’t effective enough to get what it needs (budget) to get things done like BD because they bring no revenue.   What I meant is that with BD I know the results we can get with a huge budget. I am sure we over time can do great things on the marketing front, but going all-in from day one is what gives push-back on the proposal. Rather than doing trial and error and scaling the budget up over time we go full throttle from day one without knowing the results we will get. So far I think a lot of our sticky user acquisition has come from BD. This has for sure been helped by marketing post-integration which is why I think the Growth Unit should have a say in how to deploy the capital. Outreach → Deal structuring → Integration → Marketing. It is during deal structuring where the marketing budget and method are typically allocated. With a smaller initial budget, I am sure that it will pass. There is always the possibility to do amendments later on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.378205128205128
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#25",
                    "likes": "1",
                    "time": "12/05/2021-09:05:05",
                    "content": "I am posting this link here as it is a relevant in our discussions. I suppose by now this is an overly discussed topic, but still, I have put together a post for those who are interested in learning what this Moonshot Fund is about and why the Strategic Marcomms team is pushing for it. Hope this would provide a clear picture for everyone to see what it is all about.     WTFQA is the Moonshot Fund? Maker Improvement Proposals       Here are the top 10 +1 most frequently asked questions about the Moonshot Fund:   What is a Moonshot Fund?  It is a fund, as well as a solution, the Strategic Marcomms team has proposed to capture significant marketing or ad opportunities.   How would such an opportunity look?  An ad or marketing campaign proposal that creates buzz with high ROI for awareness and exposure. One way to picture it is FTX’s naming rights of the Miami NBA stadium. It has successfully created buzz as an example of get…     ",
                    "links": [
                        "https://www.cnbc.com/2021/03/26/crypto-industry-to-get-first-major-us-stadium-with-miami-dade-county-approving-ftx-for-heat-home.html"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.567499999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#26",
                    "likes": "2",
                    "time": "12/05/2021-14:00:28",
                    "content": "guys, you are looking at the the most impressive growth of any project in defi, and the only case in the entire industry where this growth is turned into absurd profits. And your conclusion is to fire the marketing team ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#27",
                    "likes": "6",
                    "time": "12/05/2021-14:10:32",
                    "content": "So here’s the thing: I see a peek at what Growth/BD has done. MarComms is a complete unknown. If we want to put millions of DAI to work to continue growth, I see both track record and momentum for Growth and RWF. I see promise and have begun to hear ideas for Oracles. I even see how Risk(!) can directly contribute to earnings. I don’t believe marketing is worth 0 DAI. But if the marketing unit cannot even market itself by providing a plan, a track record, or both, then I know which units I will be advocating for larger budgets, and this CU is not it. Come back next month with a detailed plan, a transparent budget, no unrestricted funds in the millions of DAI, and a Q&A with your critics. Note that if there’s someone willing to build a CU for marketing, don’t feel as if you can’t provide an alternative CU proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#28",
                    "likes": "1",
                    "time": "12/05/2021-14:22:58",
                    "content": "    Replenish2030:  And your conclusion is to fire the marketing team   Yes, it’s been quite the fight for the Marcomms Core Unit–I hope they’re like Muhammed Ali and know how to “Bob and Weave” – and can bounce back.  I mean we can always Hire Gary V. for $20M a year   image780×417 68.1 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.21875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#29",
                    "likes": "1",
                    "time": "12/05/2021-14:37:34",
                    "content": "You are asking these people to jeopardize the regulatory status of the entire project so they can keep their jobs. Are you sure that’s really what you want? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#30",
                    "likes": "3",
                    "time": "12/05/2021-14:43:06",
                    "content": "    PaperImperium:  cannot even market itself by providing a plan   This bs is starting to approach gaslighting. They are proposing a 5 million USD budget to do something similar to the miami arena sponsorship that FTX did. A type of deal that needs a certain level of confidentiality before it can be executed. That’s how it works. How can it be made any more crystal clear??? It sounds like you won’t be satisfied unless they straight up drag rihanna onto the forums to do a live governance Q&A ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.861471861471861
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pensivepenguin",
                    "index": "#31",
                    "likes": "5",
                    "time": "12/05/2021-22:25:41",
                    "content": "I agree 100%. Moreover the community should be prepared that people will be coming out of the woodwork with proposals like this in a variety of areas trying to take advantage of how flush with cash the Foundation is, and they will put forth flashy (but ultimately substanceless) proposals that will trick voters if they make only a cursory review… Everyone should be aware of this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#32",
                    "likes": "5",
                    "time": "12/05/2021-23:51:52",
                    "content": "    pensivepenguin:  to take advantage of how flush with cash the Foundation is,   The Maker Foundation and MakerDAO are different entities, the Foundation isn’t really involved here (nor is it flush with cash anymore.)     pensivepenguin:  and they will put forth flashy (but ultimately substanceless) proposals that will trick voters if they make only a cursory review…   While I can see the merit of this as a general warning, posting it in this thread implies that the proposed marcomms unit is malicious and attempting to trick the DAO out of money. I’ve seen no evidence that this is true, nor do I think this is a concern that many share. Please don’t imply stuff like this if you can avoid it, try to engage in good faith, and assume that others are engaging in good faith until there is evidence to the contrary. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.090909090909092
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#33",
                    "likes": "6",
                    "time": "13/05/2021-01:46:37",
                    "content": "    PaperImperium:  But if the marketing unit cannot even market itself by providing a plan, a track record, or both, then I know which units I will be advocating for larger budgets, and this CU is not it.   No matter the outcome, we must recognize this isn’t about who is getting a bigger budget. It is about collaboration among teams. That is the only way to grow the MakerDAO ecosystem. @PaperImperium  You may not mean it, but your comment concerns me because it creates division rather than unity. Marketing supports all units as it brings visibility and business opportunities to the DAO from both supply (vaults) and demand (DAI users) side, and across all teams. The marketing CU’s budget will only be used to promote and support the DAO and all the CUs in the DAO. It isn’t about who is getting a more significant cut in the pie. On both the forum and RC, you have repeatedly said the CU has no plan, no strategy, and the team “can’t market” and “that’s ironic,” which started to seem a bit off. You said that the team couldn’t even communicate properly, at the same time, there was no response regarding my answers to your questions, and after ten days you asked the same thing again. Either we are in a weird time loop, or something just doesn’t add up. I believe having a call with the community will help with the communications, which we are planning. Also, it would help us, the unit, communicate better if you can read my response to your questions to continue with such discussion. Here’s our proposal/plan, which has been revised after taking in feedback from the community. Here’s the track record of the team members and their credentials: The CU contributors also include @Saludiego_201 @Alefcripto @AdrienDLT and a former advertising specialist from a well-known agency has just joined. We will be able to add theirs for sure. My past work and my credentials for anyone who is interested in reading more. The foundation’s marcomms team has been a focus in discussions, despite I am the only one that has worked there. (The rest of the team members consist of individuals who have been ambassadors or individuals passionate about MakerDAO who have inspired me in their faith in MakerDAO.) The focus should be on whether the CU has team members who can take their expertise, background, and transferable skills to apply what they are going to do in an agile environment to achieve their goals. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp9-strategic-marcomms-core-unit/7189",
                        "https://forum.makerdao.com/t/mip39c2-sp9-strategic-marcomms-core-unit/7189#people",
                        "https://forum.makerdao.com/t/are-we-having-a-loud-minority-problem/7972/7",
                        "https://forum.makerdao.com/t/mip41c4-sp9-facilitator-onboarding-cpm-001/7191"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.648097826086956
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#34",
                    "likes": "0",
                    "time": "13/05/2021-16:03:15",
                    "content": "Could @LongForWisdom @Davidutro or someone with the ability to do so please archive/close this thread? Everything in it was about a specific proposal at a specific time and I don’t want it to be construed as a position on future proposals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#35",
                    "likes": "1",
                    "time": "13/05/2021-20:22:12",
                    "content": "Correct me if I’m wrong, but you and your team worked mainly in the Japanese market. I have no idea what a successful marketing strategy looks like in Japan, but I am sure you have to have different communication strategies in different markets around the world. For example, multinational companies often make the mistake of looking at the EU market as a single consistent market - like Japan or the US - and not understanding why their strategy doesn’t work equally well in each EU country.   Maybe I’m naive, but  what if the only problem is that you need to communicate your results more clearly and loudly here, than you did it before? If no one here heard about your achievements, why should they trust you? I agree that because of the smell of money, fraudulent people will show up here in the future and so it is important to build trust between participants. This thread is important because you can see a type of problem here and you can see that this is how the system is currently dealing with the problem. If we want it to work better, we need to fix it together. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6988095238095235
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#36",
                    "likes": "9",
                    "time": "13/05/2021-23:11:25",
                    "content": "    purrfection:  Correct me if I’m wrong, but you and your team worked mainly in the Japanese market. I have no idea what a successful marketing strategy looks like in Japan, but I am sure you have to have different communication strategies in different markets around the world.   Okay I can answer you, if you see in the initial proposal  https://forum.makerdao.com/t/mip39c2-sp9-strategic-marcomms-core-unit/7189 you will see that it will be separated and distributed by sector, me and @Alefcripto cripto are in the South American market, along with two more members of the DAG of Colombia, each pair of guys work in the DAGs Venezuela and Colombia respectively. If you want a summary of what we achieved during 9 the DAG of Venezuela respectively you can see it here https://forum.makerdao.com/t/makerdao-venezuela-round-up-february-april-2021/7708 All this achieved without spending a single DAI in advertising, only constant work with our community and love our work. ",
                    "links": [
                        "https://forum.makerdao.com/t/makerdao-venezuela-round-up-february-april-2021/7708"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.689775910364146
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#37",
                    "likes": "3",
                    "time": "14/05/2021-04:03:43",
                    "content": "    Saludiego_201:  If you want a summary of what we achieved during 9 the DAG of Venezuela respectively you can see it here https://forum.makerdao.com/t/makerdao-venezuela-round-up-february-april-2021/7708  All this achieved without spending a single DAI in advertising,   These are actually very nice results. I understand that you are a CU contributor and not a team member and perhaps this is a reason why these were not highlighted in the CU’s track record when I asked for a summary? I also really like the fact that this was done with zero funding from the Foundation (please correct me if I misunderstood). I don’t speak for everyone but I imagine it would be far more palatable for many to see these kinds of initiatives get small amounts of funding to start with and organically get bigger - both in terms of budget and results. ",
                    "links": [
                        "https://forum.makerdao.com/t/are-we-having-a-loud-minority-problem/7972/7"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.976984126984127
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#38",
                    "likes": "2",
                    "time": "14/05/2021-15:00:34",
                    "content": "    AstronautThis:  (please correct me if I misunderstood).   If we receive, compensation, in fact you can see it there. CDIP 41 - DAI LatAm Action Groups Extension 2 · Issue #1133 · makerdao/community · GitHub Of which our Venezuela budget, we only allocated as you can see in the summary. I understand your point, but you must keep in mind that this is not only Venezuela or Colombia, it is all Latam, from Mexico to Argentina. Which represents a greater delivery and campaigns more moderately to strongly aggressive, use and develop communities is a key factor, remember a user well treated and at ease will bring two more. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.712962962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#39",
                    "likes": "0",
                    "time": "14/05/2021-17:42:04",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}