{
    "poll_list": [
        {
            "title": "MIP10c9-SP6 Governance Poll to Whitelist yEarn Finance on ETHUSD Oracle - August 25, 2020",
            "index": "3773",
            "option": "Yes",
            "supporting_mkr": "5,830",
            "highest_fraction": 0.91
        },
        {
            "title": "Whitelist Yearn Finance on BTCUSD OSM Oracle (MIP10c9-SP10) - September 21, 2020",
            "index": "4192",
            "option": "Yes",
            "supporting_mkr": "23,226",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip10c9-sp6-whitelist-yearn-finance-on-ethusd-oracle/3773",
            "title": "MIP10c9-SP6: Whitelist Yearn Finance on ETHUSD Oracle ",
            "index": 3773,
            "category": [
                "Core Units",
                "Oracles"
            ],
            "tags": [
                "oracle-whitelist-sp",
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/banteg",
                    "index": "#1",
                    "likes": "11",
                    "time": "23/08/2020-08:31:51",
                    "content": "MIP10c9-SP6: Subproposal to Whitelist Yearn Finance on ETHUSD Oracle Preamble MIP10c9-SP#: 6 Author(s): Artem K Contributors: Type: Process Component Status: Date Proposed: 2020-08-23 Date Ratified:  Specification Introduction Yearn’s core product is Vaults (example) which allow staking certain assets which are then delegated to Strategies (example) which recycle the rewards back into the base asset. A more complex product is Delegated Vaults which leverage a certain asset to borrow an asset and delegate it to a Vault. We are currently building (work in progress) such a delegated vault strategy for the ETH Vault. It will maintain a Maker Vault and and delegate the drawn DAI to the yearn DAI Vault. To make the strategy safer and more robust, we require an ability to incentivize people to save the Vault from liquidation. To verify this on chain, we need access to the next OSM price. We’ll be using a permissioned proxy contract should new strategies requiring the OSM emerge. It is controlled by yearn’s governance. Oracle Name ETH/USD Customer(s) yearn finance - Andre Cronje ([email protected]) Whitelist yearn finance - 0xCF63089A8aD2a9D8BD6Bb8022f3190EB7e1eD0f1 - OSM  Requirements For each customer address to be whitelisted: - Is the contract source code verified on etherscan? yes - Is the Oracle data used in a permissioned manner that would prevent parasitic behavior? yes - Is Oracle data written to storage? no - If Oracle data is stored, is it stored in a private variable? not stored - If Oracle data is stored, is the value accessible on-chain exclusively by the protocol? not stored Fee yearn finance - ROMP ",
                    "links": [
                        "https://etherscan.io/address/0xa069E33994DcC24928D99f4BBEDa83AAeF00B5f3#code",
                        "https://etherscan.io/address/0x6f6194041f019c7fa21a6e35e4fb496b2d6e1e95#code",
                        "https://forum.makerdao.com/t/signal-request-should-we-fast-track-mip10c9-sp6-yearn-eth-usd-osm-whitelisting/3783",
                        "https://forum.makerdao.com/t/maker-relay-ep-09/3793/2",
                        "https://forum.makerdao.com/t/discussion-makerdao-in-5-years/3804",
                        "https://forum.makerdao.com/t/question-where-are-the-oracle-fees-sent/6188",
                        "https://forum.makerdao.com/t/mip10c9-sp29-subproposal-to-whitelist-yearn-finance-on-uniusd-linkusd-aaveusd-compusd-oracles/8448"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Token economics",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.323051948051948
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Governor",
                    "index": "#2",
                    "likes": "0",
                    "time": "23/08/2020-10:18:23",
                    "content": "I 200% support this. While you’re at it, also add YFI as collateral to mint Dai. And Yearn will create MKR vaults as a gesture in return. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#3",
                    "likes": "0",
                    "time": "23/08/2020-12:30:02",
                    "content": "I am very happy to see the changes in the Maker community. We should always maintain the spirit of exploring new things, not conservative. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.840909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Magicturtle12",
                    "index": "#4",
                    "likes": "2",
                    "time": "23/08/2020-12:58:20",
                    "content": "With respect, I believe YFI to be far too young and volatile to be considered as a asset class for Maker Vaults. I’m entirely for expanding the collateral types, but there’s good reason the MakerDao team has gone slow on new collateral types. I see no reason to add YFI as a collateral type, other than personal gain. YFI is meant to be a governance token afterall, NOT a store of value. Just my 2 cents ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3821022727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mariano_Conti",
                    "index": "#5",
                    "likes": "5",
                    "time": "23/08/2020-15:59:10",
                    "content": "This proposal is not to add YFI as collateral, merely to allow yearn vaults read access to the Maker Oracles I am completely in favor. This is a huge use case for Maker Vaults that will be beneficial for everyone ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#6",
                    "likes": "9",
                    "time": "23/08/2020-16:48:16",
                    "content": "The Oracle Team has done the due diligence on the contract source code and verified the claims of Oracle data usage behavior. This proposal is ready to be voted on by the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#7",
                    "likes": "7",
                    "time": "23/08/2020-16:57:54",
                    "content": "On a separate note I’d like to point out that delegated vaults align with Dai peg incentives really nicely in that they find profit seeking opportunities and stimulate Dai generation which we desperately need right now. Because of this I will be posting a Signal Request thread to fast track inclusion of this proposal into this coming Friday’s Executive Vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.607142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Magicturtle12",
                    "index": "#8",
                    "likes": "1",
                    "time": "24/08/2020-08:39:56",
                    "content": "Oh I know, I was just responding to the person who threw that out as a suggestion/request. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip10c9-sp10-whitelist-yearn-finance-on-btcusd-oracle/4192",
            "title": "MIP10c9-SP10: Whitelist Yearn Finance on BTCUSD Oracle ",
            "index": 4192,
            "category": [
                "Core Units",
                "Oracles"
            ],
            "tags": [
                "oracle-whitelist-sp",
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/banteg",
                    "index": "#1",
                    "likes": "7",
                    "time": "16/09/2020-08:31:31",
                    "content": "MIP10c9-SP10: Subproposal to Whitelist Yearn Finance on BTCUSD Oracle Preamble MIP10c9-SP#: 10 Author(s): Artem K Contributors: Type: Process Component Status: Date Proposed: 2020-09-16 Date Ratified:  Specification Introduction Yearn’s core product is Vaults which allow depositing certain assets which are then delegated to Strategies which farm and recycle the rewards back into the base asset. A more complex product is Delegated Vaults which leverage a certain asset to borrow another asset and delegate it to a Vault. We are currently building our second Maker-based vault that will leverage WBTC-A ilk in a similar manner to our yWETH vault that uses ETH-A ilk. It will maintain a Maker Vault and delegate the drawn DAI to the yearn DAI Vault. To make the strategy able to rebalance and unwind, we require access to the next OSM price. We’ll be using a permissioned proxy contract should new strategies requiring the OSM emerge. It is controlled by yearn’s governance. Oracle Name BTC/USD Customer(s) yearn finance - Andre Cronje ([email protected]) Whitelist yearn finance - 0x82c93333e4E295AA17a05B15092159597e823e8a - OSM  Requirements For each customer address to be whitelisted: - Is the contract source code verified on etherscan? yes - Is the Oracle data used in a permissioned manner that would prevent parasitic behavior? yes - Is Oracle data written to storage? no - If Oracle data is stored, is it stored in a private variable? not stored - If Oracle data is stored, is the value accessible on-chain exclusively by the protocol? not stored Fee yearn finance - ROMP ",
                    "links": [
                        "https://forum.makerdao.com/t/mip10c9-sp29-subproposal-to-whitelist-yearn-finance-on-uniusd-linkusd-aaveusd-compusd-oracles/8448",
                        "https://forum.makerdao.com/t/maker-relay-ep-13-pt-br-portugues/4328",
                        "https://forum.makerdao.com/t/maker-relay-ep-13-en-espanol/4313"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Token economics",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.29997680890538
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Governor",
                    "index": "#2",
                    "likes": "0",
                    "time": "16/09/2020-16:37:11",
                    "content": "I support this 300% @NikKunkel can we fastrack this through signals like we did for Eth price feed? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "3",
                    "time": "16/09/2020-16:49:02",
                    "content": "Assuming @Oracles-Core-Unit approves (and submits the required PR), it meets the cutoff to go on-chain on Monday anyway, no fast tracking required. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "16/12/2020-22:49:09",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2619"
}