{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/press-questions-regarding-defi-regulation/9703",
            "title": "Press questions regarding DeFi regulation ",
            "index": 9703,
            "category": [
                "Miscellaneous",
                "Media Inquiries"
            ],
            "tags": [
                "regulation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SimonCCrypto",
                    "index": "#1",
                    "likes": "5",
                    "time": "05/08/2021-08:11:32",
                    "content": "I’m currently writing a new article for Cryptonews.com about DeFi regulation. In particular, this article will seek to understand what incoming regulation will look like, and the extent to which it will impact the DeFi sector and its development. Would any relevant individual involved with Maker be able to help with this by answering a few questions in writing? Please let me know. 1. It seems like governments and regulatory bodies in various parts of the world are preparing/revising tighter cryptocurrency regulations (e.g. the European Commission’s recent AML proposals, FATF revising its guidelines). How do you think incoming changes in regulation will affect and impact the DeFi sector? 2. In your opinion, do governments and regulators want to nurture DeFi? Or do they want to restrict it heavily? 3. How long do you think it will take for DeFi to have clear guidelines and regulations? Should individuals, startups and organizations hold off launching new DeFi services and platforms until guidelines are established? Do you think some will hold off launching new services? Many thanks for your time. Simon Chandler https://twitter.com/simonchandler ",
                    "links": [
                        "https://ec.europa.eu/info/publications/210720-anti-money-laundering-countering-financing-terrorism_en",
                        "https://www.fatf-gafi.org/media/fatf/documents/recommendations/Second-12-Month-Review-Revised-FATF-Standards-Virtual-Assets-VASPS.pdf",
                        "https://twitter.com/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.53698752228164
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/08/2021-09:34:21",
                    "content": "I think @layerzero might be able to help, or at least point you in the right direction… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.80952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "4",
                    "time": "05/08/2021-10:29:34",
                    "content": "@SimonCCrypto I probably cannot answer your questions, but as someone who interfaces with a lot of these regulatory actors + reads a decent chunk of the research they produce about decentralized finance, I would caution that even jargon is not used the same on the crypto and regulatory side. So it’s not always clear what policymakers want. A great example of this is the debate around stablecoins. As the Gorton-Zhang paper a few weeks ago makes clear, and confirmed by private discussions, even a term as simple as “stablecoin” has different meaning in policy circles than in the crypto-verse. We would use it to mean any token that is purposefully trying to remain in a price band around a given benchmark. Policymakers and regulators are generally talking about redeemable-upon-demand-for-fiat tokens to the exclusion of algorithmically managed tokens. And researchers at the Bank of International Settlements (of Basel guideline fame) have expressed frustration with their own framework that they don’t even know how to classify MakerDAO, as it is not even one of those two categories mentioned above. Given this rather stunning gap of not even using the same lexicon, I think the main takeaway is to be cautious and try to increase communication between real-world policymakers and those of us out in crypto land. Note that MakerDAO is already leading the way on this type of outreach with notable recent examples of the Federal Reserve, academics studying DeFi, and Congress members. I’ll leave the legal opinions to the more lawyerly members of the DAO, but recognizing that crypto people haven’t done a wonderful job reaching out to policymakers to date is important. We need to be more plugged into conversations moving forward. ",
                    "links": [
                        "https://www.crowdcast.io/e/makerdao-speaker-series-2",
                        "https://www.crowdcast.io/e/makerdao-speaker-series-3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.094166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#4",
                    "likes": "2",
                    "time": "05/08/2021-15:56:07",
                    "content": "@jacek, don’t know how active you are these days. But this seems right up your alley. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3809523809523805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SimonCCrypto",
                    "index": "#5",
                    "likes": "0",
                    "time": "06/08/2021-09:08:44",
                    "content": "Hi, thanks very much for your reply. Would I be able to quote your comments (beginning from “I would caution that even jargon…”). I won’t necessarily need to quote all of them, but it would help me considerably if you gave your permission to quote you. Simon ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.06
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "0",
                    "time": "06/08/2021-10:32:56",
                    "content": "    SimonCCrypto:  Would I be able to quote your comments (beginning from “I would caution that even jargon…”)   From there down to “…to the exclusion of algorithmically managed tokens” is fine. Note that these are my own personal conclusions and interpretations, so as long as that is clear, I think it should stand on its own fairly well. Obviously the DAO doesn’t have a “spokesperson” and it is possible to find someone who has differing views. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.232323232323233
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SimonCCrypto",
                    "index": "#7",
                    "likes": "0",
                    "time": "06/08/2021-10:38:21",
                    "content": "Great thanks. Shall I just use your user name, or would you be able to share your full name and status/role within the community? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#8",
                    "likes": "1",
                    "time": "06/08/2021-10:42:22",
                    "content": "PaperImperium is fine. I’m mostly just a community member ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.291666666666668
                },
                {
                    "author_link": "https://forum.makerdao.com/u/layerzero",
                    "index": "#9",
                    "likes": "2",
                    "time": "06/08/2021-14:24:39",
                    "content": "Hello Simon, thank you for your request, can gladly provide you some feedback later on today ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SimonCCrypto",
                    "index": "#10",
                    "likes": "1",
                    "time": "06/08/2021-15:36:58",
                    "content": "Great, thanks. I really appreciate it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jacek",
                    "index": "#12",
                    "likes": "7",
                    "time": "06/08/2021-17:32:15",
                    "content": "@SimonCCrypto thanks for your highly relevant and timely questions! I know that some more answers are coming, but wanted to tackle your third question straight away as it seems particularly important:     SimonCCrypto:   How long do you think it will take for DeFi to have clear guidelines and regulations? Should individuals, startups and organizations hold off launching new DeFi services and platforms until guidelines are established? Do you think some will hold off launching new services?    In some areas, like tax or AML, it’s a matter of months. In some others, it’s unrealistic to expect full regulatory clarity even within years. New DeFi projects should definitely engage in dialogue with regulators and policymakers. We have pioneered such activities at Maker, and have been meeting with both multiple national regulators (including central banks) as well as international organizations (e.g., OECD, FATF, FSB) since 2018. That has helped us gain trust and awareness among the regulatory community. However, that should not mean that the innovation should stop. Innovators should keep on innovating, of course while remaining cognizant of regulatory developments. Any new financial product or service requires a diligent regulatory assessment, but without new great innovations we are not going to see good guidelines. There is a feedback loop between fintech innovation and financial regulatory adjustments, which if there is enough trust and dialogue between regulators and the market, creates a great virtuous circle. At Maker we want to see it happen especially in the stablecoin space. Of course the above is just my opinion, but I believe that it reflects the spirit of this community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.834149686520376
                },
                {
                    "author_link": "https://forum.makerdao.com/u/layerzero",
                    "index": "#13",
                    "likes": "8",
                    "time": "06/08/2021-17:56:11",
                    "content": "Hello Simon, let me the  answer the first two questions: 1. It seems like governments and regulatory bodies in various parts of the world are preparing/revising tighter cryptocurrency regulations (e.g. the European Commission’s recent AML proposals, FATF revising its guidelines). How do you think incoming changes in regulation will affect and impact the DeFi sector? Upcoming regulatory developments will directly affect the whole DeFi ecosystem at large. I welcome good regulation that provides legal certainty to market participants and that doesn’t hinder innovation, but of course, this is hard to achieve. The problem is that the current regulatory framework is outdated and was not designed for decentralized ledger technology. DeFi protocols are arguably digital public goods, based on open-source software, accessible for everyone with an Internet connection (we call this feature permissonlessness). They enable access to financial products and services with no intermediaries. DeFi runs on public ledgers, fully transparent and in real-time auditable (actually a dream for regulators). They are designed to be censorship-resistant and can potentially run autonomously, without human intervention. This is quite different from the legacy financial system. Legacy regulatory frameworks often target financial intermediaries and centralized service providers, many of which are now in DeFi obsolete. I believe regulation is necessary and a sign that the industry matures. Not having legal certainty is a risk that hinders future growth. And I believe that the mission of DeFi is to serve the real-world economy and provide financial services to real businesses and people. This is one of the main reasons for me being active in Maker. We need a regulatory framework that provides us legitimacy and clear rules for operating in the real world. ",
                    "links": [
                        "https://www.fatf-gafi.org/media/fatf/documents/recommendations/Second-12-Month-Review-Revised-FATF-Standards-Virtual-Assets-VASPS.pdf"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.540136054421769
                },
                {
                    "author_link": "https://forum.makerdao.com/u/layerzero",
                    "index": "#14",
                    "likes": "6",
                    "time": "06/08/2021-17:58:20",
                    "content": "2. In your opinion, do governments and regulators want to nurture DeFi? Or do they want to restrict it heavily? It depends on the political positioning of each state. There is the case of China, the next world’s superpower, which is leading the efforts in a Digital Central Bank Currency (CBDC). The digital yuan will probably be the first major central bank currency, and it will be 100% controlled by the CCP. This is the exact opposite of the values of DeFi,  which advocates for transparency, inclusion, and financial sovereignty. Some governments fear they can lose control of their monetary sovereignty and will try to restrict it. Others, as we saw in El Salvador, adopt Bitcoin as a legal tender, delegating its monetary policy to autonomous code running in a public blockchain ledger. This technology is decentralized and global. Governments will learn that by adopting restrictive policies they will push innovation outside their own boundaries and prevent their economy and their citizens to profit from the upside. I am optimistic that some jurisdictions will implement progressive regulatory frameworks and embrace the technology. And states are not monolithic, there are different branches of power, you can see diverse trends. You see it for example in the US. After all the regulatory FUD of the last weeks, (i.e. infrastructure bill, which proposes mass surveillance and extensive KYC requirements to many DeFi market participants, including miners and DEXes) you see proposals like the Safe Harbor proposal from SEC commissioner Pierce  SEC.gov | Token Safe Harbor Proposal 2.0, which provides a 3 year grace period, exempted from the registration provisions of the federal securities laws until the project achieves a certain degree of decentralization. I welcome this type of innovative regulatory approach. As always, these are my own personal opinions  … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.846130952380952
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SimonCCrypto",
                    "index": "#15",
                    "likes": "2",
                    "time": "07/08/2021-08:56:58",
                    "content": "Thanks very much for all these comments everyone. They were extremely helpful, and I’ve quoted all three of you (Jacek, layerzero and PaperImperium) to varying extents. Simon ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.558333333333333
                }
            ]
        }
    ]
}