{
    "poll_list": [
        {
            "title": "Base Rate Adjustment - August 3, 2020",
            "index": "3318",
            "option": "-4",
            "supporting_mkr": "232.8",
            "highest_fraction": -1
        },
        {
            "title": "Base Rate Adjustment - August 10, 2020",
            "index": "3469",
            "option": "-6",
            "supporting_mkr": "17,064",
            "highest_fraction": -1
        },
        {
            "title": "Base Rate Adjustment - August 17, 2020",
            "index": "3570",
            "option": "-4",
            "supporting_mkr": "3,001",
            "highest_fraction": -1
        },
        {
            "title": "Base Rate Adjustment - August 24, 2020",
            "index": "3657",
            "option": "-6",
            "supporting_mkr": "17,813",
            "highest_fraction": -1
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-103-thursday-july-30-4-00-pm-utc/3318",
            "title": "[Agenda/Discussion] Scientific Governance and Risk #103 - Thursday, July 30 4:00 PM UTC ",
            "index": 3318,
            "category": [
                "Discontinued Categories",
                "Governance and Risk Meetings"
            ],
            "tags": [
                "mip-17",
                "iam",
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "0",
                    "time": "23/07/2020-20:13:17",
                    "content": " Agenda The zoom waiting room will be on, and a password is set to: 748478, please ping us in chat if you aren’t let in from the waiting room. This Agenda will be updated over the following week leading up to the call as people make me aware they want segments. 2020-07-30T16:00:00Z  Introduction   @LongForWisdom: Hosting, Introduction, Agenda.   Updates  Governance - @LongForWisdom: Unscheduled Governance Meeting Yesterday Governance - @LongForWisdom: Governance at a Glance Smart Contracts Domain Keepers Oracles Domain Risk Domain MIPs - Charles St. Louis: Weekly MIPs Update MIPs - Charles St. Louis: MIP17   Procedural   @Gov-Facilitators: Governance Cycle Review   Presentations   Vishesh Choudry: State of the Peg   Discussion Topics  Continued Peg Deviation   General Q&A We’ll open the floor for any questions about Scientific Governance and Risk. Please join us and help shape the future of the MakerDAO.  Links  Video/Voice  Dial-in Calendar   Call Summary Will be provided here after the call as time allows. ",
                    "links": [
                        "https://twitter.com/charliestlouis",
                        "https://twitter.com/visavishesh",
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/embed?src=makerdao.com_3efhm2ghipksegl009ktniomdk@group.calendar.google.com&ctz=America/Los_Angeles",
                        "https://forum.makerdao.com/t/maker-relay-ep-5/3406",
                        "https://forum.makerdao.com/t/debt-ceiling-instant-access-module-pre-mip-discussion/3924"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Governance",
                        "Smart contract updates",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "0",
                    "time": "24/07/2020-16:33:56",
                    "content": "Episode 103: July 30, 2020 Agenda   00:00: Introduction with LongForWisdom   02:05: Unscheduled Governance Meeting on July 29th with LongForWisdom   03:34: Governance at a Glance with LongForWisdom   13:48: Smart Contracts Domain Team Update with Wil Barnes   16:10: Keepers Update with JoeQ   17:53: Oracles Domain Team Update with Nik Kunkel   18:37: Risk Domain Team Update with Cyrus Younessi   35:45: Weekly MIPs Update with Charles St. Louis   44:30: Governance Cycle Review with LongForWisdom   51:30: State of the Peg with Vishesh Choudry   1:03:42: Open Discussion with LongForWisdom   Video https://youtu.be/eIL6rpL54-s Introduction LongForWisdom 00:00   Hello, everyone, welcome to 103rd MakerDAO Scientific Governance and Risk meeting. Today is Thursday, July 30th. My name is LongForWisdom. I am one of the MakerDao Governance Facilitators. I am joined by a host of people who are interested in Maker things.   We are going to change up the agenda slightly. We are going to have an update section going forward. This is mainly for the domain teams but also for anybody else who has updates about specific topics. We previously had many five-minute sections that don’t make sense to call out directly during the meeting. We will go through with the main people and see if they have anything to say for each meeting. Afterward, we will go through the procedural stuff and then move onto any presentation and discussion topics.   Discussions happen in the forum.   Updates LongForWisdom Unscheduled Governance Meeting Yesterday 02:05   Yesterday, on July 29th, we had an unscheduled Governance and Risk meeting to discuss the continued peg deviation combined with the fact that we are rapidly approaching the debt ceiling for ETH-A and USDC-A. We felt that taking action sooner rather than later was advisable. We convened the rest of the meeting to get the community’s opinion on the direction before putting up an executive. This executive has now passed and is currently waiting on the governance security module delay before it can be activated.   There is a link on the forum for that call. We will speak about the circumstances a little bit later during the risk updates section.   Governance at a Glance 03:34   Governance at a Glance - Forum Thread: If you have the time to read over and vote in active threads, that would be much appreciated.   We have had a lot of forum interactions over the last few days. Activity is probably the highest it has ever been, which is, on the one hand, good, but on the other hand, it gives us a lot more information for everyone to absorb. I am going to try to point people towards the relevant bits.   Discussions   We Should be Lowering the Base Rate - Forum Thread: Hexonaut advocates for using the Base Rate lever to adjust the overall stability fee when making monetary policy decisions as opposed to changing the risk premiums.  Sam MacPherson: I just put up a thread advocating that we should be lowering the base rate. This thread, in particular, isn’t about lowering the base rate versus risk premium. I was just saying that we have the tools to spur supply growth with Dai, and we should use these tools. I felt that a lot of people were voting at a base rate of zero for week after week. That vote behavior seems like it is from partially misunderstanding how the mechanism works. I am glad to see that people shifted their vote to a -4%, which is fantastic and hopefully will help with the peg.    Discussion on Uniswap liquidity - pooling as a potential tool - Forum Thread: befitsandpiper opens up a discussion on the potential of Uniswap liquidity tokens held in reserve instead of Dai.   TUSD Update: TrustToken Response to Implementation Concerns - Forum Thread: Rafael Cosman, CEO of TrustToken responds to some of the concerns highlighted by the Maker Foundation smart contracts team concerning the TUSD token.  LongForWisdom: I was very impressed with the response and willingness by Rafael to compromise based on Maker’s requirements. I would encourage people who are voting on TUSD to address that.    Signal Requests 06:14   LongForWisdom: There have been quite a lot of signal requests in the last week mainly from Aaron and those who have taken the initiative and proposed a bunch of things, which is excellent on the one hand and, on the other hand, demands a lot of attention from governance. I would advise everyone who is creating signal requests to try avoiding overload of governance attention if possible. There isn’t any strict limit, but I encourage everyone to keep this in mind when creating signal requests.   Increase System Surplus Threshold - Forum Thread   Aaron_Bartsch asks whether it is the right time to increase the system surplus threshold.   LongForWisdom: The system surplus threshold is currently at 500,000, and Aaron asks if we should increase it.     Should MKR be added as collateral - Forum Thread   Aaron_Bartsch does some initial polling around the inclusion of MKR as collateral. Worth noting that outside of emergencies, collateral onboarding needs to happen through the monthly governance cycle, but this can serve as an indicator to sentiment for the domain teams.   Vote concluded majority, “No.”     Add ETH-B Vault - Forum Thread   Aaron_Bartsch polls the community around the introduction of an ETH-B Vault type. Worth noting once again that outside of emergencies, collateral onboarding needs to happen through the monthly governance cycle, but this can serve as an indicator to sentiment for the domain teams.   LongForWisdom: One point I have made on this is that collateral onboarding, outside of emergencies, follows the monthly governance cycle. Therefore, these signal requests will be more advisory and unlikely to go into the weekly cycle and rather more advisory toward the domain teams as to their direction. I still encourage people to vote in them because they are high signals for the domain teams.     Increase ETH-A Risk Premium - Forum Thread  Aaron_Bartsch also asks whether we should adjust the ETH-A risk premium.    Increasing the ‘dust’ amount - Forum Thread   Jiecut asks if the dust parameter should increase, considering the sustained elevation in gas prices over the last few months.   LongForWisdom: The dust parameter is essentially the minimum amount of Dai debt one can create from a vault. It is currently 20 Dai, but due to high gas prices, there is a question of whether this amount is too low and should be increased.     Adjust the BAT Risk Premium and Debt Ceiling - Forum Thread   Jiecut asks if the BAT-A risk premium and debt ceiling should be adjusted. Note that the BAT-A debt ceiling was changed in the most recent executive vote.   LongForWisdom: Yesterday’s executive included The debt ceiling change, but the signal continues for the risk premium.     TUSD Update (Forum Poll): Concerns Surrounding the TUSD Collateral Type - Forum Thread  Lucasmanuel from the Maker Foundation Smart Contracts team asks how governance wishes to move forward with the TUSD collateral type considering the recent contract upgrades.    Discussion 1 ETH-B 8:48  Cyrus Younessi: I think the ETH-B has been slowly gaining a lot of support, and there are many good arguments for it. At this point, it’s just a matter of resources on the back-end trying to put it together and get it going. I think that’s a good, positive idea. We have been talking about the dust amount on the engineering side internally as well.  Dust 9:20  Cyrus Yonessi: I think there is an argument to make for increasing the dust amount, which is ironic because just a few months ago, we were discussing if it should be lower to accommodate more people. It is funny how the Ethereum congestion blew up. Certainly, I think we can kind of do a gas analysis and try to figure out some threshold where below that amount, it doesn’t make sense to do liquidations. I think that if I had to guess, the dust amount should probably go up. Of course, this does introduce user adoption trade-offs, which is something to consider.  12:38   Christopher Mooney: I will reiterate on the dust limit. For liquidators, it’s wildly non-economical to liquidate Vaults with 20 Dai debt, the current dust amount. Sort of back of the envelope numbers probably has us somewhere around a dust value of 100 to 200 Dai. Somewhere around there. I would say a minimum of 100. Maybe we should go higher in anticipation of the future. I am not sure.   Monet Supply: Also, from a usability perspective, I feel like allowing people to open a vault for such a small amount when the gas fees are so high is not good.   Risk Premiums 10:21  Cyrus Younessi: Regarding risk premiums for ETH and BAT and all of them, I think this is just one of those never-ending discussions where you are always going to have people on different sides. Some people are just religiously committed to defending the peg at all costs. Others feel that we should be compensated for all the risks that the protocol is bearing these days. I think that would be something interesting to poll, generically, in a governance poll. Something that says if we should start charging risk premiums on all the assets slowly over the coming weeks versus treating them as a case by case basis. I think it is just a general plan if we want to do something like that or not.  Taking Advantage of the Negative Base Rate 11:22   Sam MacPherson: I would like to point out that, since the base rate is negative, we could set the ETH-A and BAT-A risk premiums without actually affecting the stability fees.   LongForWisdom: Yes, I was going to make that point, as well. If the base rate is going negative, it might be an excellent chance to set them to what we think would make sense as risk premium and not affect the peg.   Cyrus Younessi: For down the line when the base rate goes back up, everything will sort of fall into place?   Sam MacPherson: Yes, exactly.   Cyrus: Sure, yes, that sounds like a good idea.     Wil Barnes Smart Contracts Team Update 13:48 Collateral Status Index - Forum Thread   Wil Barnes: I want to make a note on the MIP12 checklist assessments that we are doing. We are turning them out for each collateral type right now. This morning, Tether and PAXUSD were posted. The PAXG assessment is also available on the forum.   This is a concerted effort to get more community members involved in this process and look at the contracts’ technical details. Everyone should take a look and comment on these if you are comfortable. Going forward, we have a pretty big collateral status next-listed and a pretty big backlog of the collateral types we need to have this done. If anyone is interested in doing this and helping out, we can set up meetings weekly or bi-weekly to do this. I will link the Collateral Status Index for the collateral types that we’re evaluating. You can reach out to me or befitsandpiper. The more people involved in looking at the contracts and just the things that we are looking for, the more helpful. If you have any questions, please reach out.   befitsandpiper: I wonder if we can do the same thing with the Risk with the Oracles teams. I reached out to Cyrus on forums just right before this meeting. I think it would be nice to be able to do this with all the domain teams.   JoeQ Keepers Update 16:10   JoeQ: Just as a public service announcement for everyone that the new MIPs came in and we updated the liquidation system smart contracts so now you can bid with the Dai you had before. Everyone needs to update. As with an open-source protocol like this, people sometimes don’t pay attention. I don’t want to be the boy who cried wolf, but there weren’t as many people participating in the first couple ETH auctions that we had. I want to make sure that everybody knows that you should update your contracts and then also your keepers. So, it’s out there, and we have full participation in auctions. As the system is growing exponentially now, I want to make sure that everyone is there if we have something like a mini March 12th. Thank you.   Iant: If anyone is interested in getting more information on how to perform on that update, please, go to the keeper’s channel on rocketchat.   LongForWisdom: I want to say that keepers are pretty essential for making sure everything goes well when things go badly. I encourage everyone to share this with any keeper friends you may have.   Nik Kunkel Oracles Team Update 17:53 Argent and MyCrypto   Currently assisting Argent with setting up their new light feed. I don’t think that will be ready for tomorrow’s executive, but it should be ready for next week’s.   We’ve got a new application from MyCrypto to become a light feed. We can discuss that on the forum as well.   Cyrus Younessi Risk Team Update 18:37 Unscheduled Meeting and Executive Vote   Yesterday we held an unscheduled executive vote and meeting during the recent upward pressure on the Dai price. We spoke a bit about where that pressure was coming from: seeing all-time highs in the Compound COMP-Dai farming, also a surprise new farm from a YFI fork. That fork has sucked already 60 million Dai, which is not insignificant.   Even we saw the peg go down to 1.01 over the weekend, it quickly shot back up to 1.03 and above.   On Monday, we have put out an unscheduled vote to increase the debt ceilings for ETH-A and USDC-A, and they were both gobbled up in under 48 hours. The speed of hitting the DC shows how high the demand for Dai is.   Raising the Debt Ceilings   I think it makes sense to make a substantial DC increases to reduce the governance overhead.   Those DC passed in executive early this morning.   ETH-A is going up by 80 million.   USDC-A is going up by another 60 million.     Additionally, there were increases for:   WBTC.   USDC-B, the emergency reserve for keepers.   BAT as well.     Later today, when the governance delay has ended, and the vote is officially live we will start monitoring the demand for this additional Dai supply and take it from there.   Moving Forward   There are undoubtedly some good discussions to have around:   Increased risk to the system   Liquidations   Centralization     In the absence of any short term solution, I believe that the community is more or less on the same page for increasing these DCs.   Discussion 2 22:00 The Risks of Raising the Debt Ceiling   Brian McMichael: I think that one of the reasons we have the debt ceilings we do is to protect us from a technical risk where someone could utilize that debt ceilings through some unforeseen exploit. We have a situation like that now, where we have unprecedented demand. Is there any reason that you could foresee why we wouldn’t want to double or triple the existing debt ceiling? What kind of risks would that pose?   Cyrus Younessi: It’s pretty straightforward; if ETH crashes, the Protocol will struggle to efficiently liquidate a couple hundred million Ether in the current Ethereum Network congestion environment, and the current Dai liquidity environment. I tend to think we passed that danger threshold a while ago. At this point, we have to seriously revitalize the circuit-breaker discussions and start talking about operational protocols for how something like that might look, in case ETH were to correct back down.   Kurt: On top of the sheer size of the amount we might have to sell into the market in a liquidation event, there’s another risk involved with having a DC much higher than utilization. In one of those events, someone might see that, and if the decline is significant enough, it’s profitable to throw ETH into the Protocol and pull a bunch of Dai out, which will be worth more than what ETH is about to be worth. This is the OSM risk, as you have an hour warning before price drops trigger a liquidation.     befitsandpiper: Is there a reason we haven’t increased the oracle refresh to fix that OSM risk?   Christopher Mooney: We would never be able to respond to an oracle attack if the delay was 15 minutes.   Kurt: The more you lower that time, the more you mitigate the OSM attack. But as you lower that time, you increase the risk that if something goes wrong with the oracles, there’s some actual manipulation of the oracle prices, we have much less time to react. An hour is already quite short, to be honest.     Reducing the Executive Votes   Brian McMichael: I agree with all of that, but we’re making emergency executive every two or three days. Is the community okay with that, or should we consider more substantial increases?   Christopher Mooney: The Smart Contracts team hates it. I will say that much.   Kurt: There’s also the possibility of adding an Instant Access Module that would allow more frequent and periodic debt ceiling increases based on utilization, and that would not require an executive vote every time. That’s MIP17, as Charles is calling in the chat.   LongForWisdom: From a governance perspective doing emergency votes multiple times a week is also not ideal. If we can and feel safe about getting ahead of things, I would prefer if governance signaled to do that, rather than leaving it for the Risk team to react as an emergency response.     Instant Access Module   Cyrus Younessi: Not to put you on the spot, Kurt, but what’s the status on the Instant Access Module for DC upgrades? I think that’s something that’s been discussed a few times in the past.   Kurt: Gonzalo implemented one quite a while ago. We can deploy whenever the Community wants. We can discuss on the forums about what the parameters should be, or if there should be any tweak to its behavior. It’s not complicated from a technical perspective, at all.   LongForWisdom: Just as a personal note, I’ve heard about Instant Access Modules before, and I understand the theory of how they work. I don’t know if we ever had a communication of what they are and how they work in practice in detail on the forums.   Charles St-Louis chat: Short definition of an Instant Access Module (IAM) - a module that provides a way to change the Maker Protocol without going through an Executive Vote and the subsequent delay in the Governance Security Module.     MIP17 Prepares IAM Logic  Charles St. Louis: On that point, one of the main reasons for proposing MIP17 was to introduce the logic to implement debt ceiling adjustments or risk premium adjustments and have it somewhat as a manual process. If it works successfully, use that logic and transfer it into a more automatic tool, such as an IAM. So MIP17 is this testbed to see if this logic works in the short run and then think IAM in the long run.  Liquidation Risk   Iant: I haven’t read MIP17, but I’m curious about how we handle liquidation risk, and how do we handle the amount of collateral, and what is deemed an acceptable amount of risk that we should lever up and when not to, and where do we draw that line and why. I don’t have the right answer for this, and I just go with my gut feeling. What numbers or analysis have you done? Or is there anything you could concretely refer to as to reasons why you have that opinion? It’s so hard for me to construct an eloquent opinion on the topic.   Cyrus Younessi: The gut feeling is an essential part of it. Certainly, one very cool tool is Vishesh’s Liquidation Price Graph. It shows you the price points you will get specific amounts of collateral liquidated. The distribution is reasonably smooth, but occasionally you see these vast increases from large vaults. After March, we informally talked to a bunch of different keepers to get a sense of how available Dai liquidity was out there to bid on keepers. It’s just a small percentage of the total Dai supply. Those numbers are hard to pin down, but if you’re liquidating 100 million of ETH collateral, you’re not going to instantly find 80 million of liquid Dai to bid on that on that.   Iant: So that’s where we set it up? Anywhere around 100 million, we should be careful?   Cyrus Younessi: That’s the first pass, intuition. We’ve also done some risk modeling in terms of liquidity and order book depth and try to bake in a slippage discount for how much the price would suffer from an increase in the amount of collateral selling. That tends to break down around 200 million of ETH collateral. That’s the unofficial number we were targeting back in April-May, which we have blown through. We have some grants out, with some quant firms doing more sophisticated liquidity analysis. We’re waiting to hear back on that as well. Ultimately, it’s a hybrid of academic approaches as well as practical trader approaches. Just intuitively, if ETH falls 50% and we have to liquidate some 100-150 million of ETH collateral, that doesn’t inspire much confidence for me.     Rate Limiting Liquidations   befitsandpaper: Would rate-limiting the liquidations help the issue, or would it make things worse, since while waiting, the price of collateral could fall more. I mean, only liquidating up to X amount of collateral per hour.   Cyrus Younessi: We discussed that during Black Thursday as well, and that discussion naturally converged into the circuit breaker implementation. Instead of trying to figure out discrete numbers or implement some sort of complicated logic where there’s just a big red button to push where we can just put a pause on all liquidations if needed.   Christopher Mooney: For Liquidations 2.0, I worked on a PR that can rate limit by outstanding Dai for the next version of liquidations. So we may have that in Liquidations 2.0.   Iant: That is awesome.     Bitcoin Liquidations   Akash: I have a question. Has that Quant firm, or you guys, done the same kind of analysis for Bitcoin? I know that wBTC or whatever other variant is not Bitcoin, but how much Bitcoin liquidity is out there for this kind of the same scenario.  Cyrus Younessi: We haven’t done wBTC, which would be the relevant metric here. The market cap has blown up so much over the past few weeks that we would have to revisit that anyways. I don’t know off the top of my head, but Bitcoin is wildly more liquid than ETH, in my opinion.    ",
                    "links": [
                        "https://youtu.be/eIL6rpL54-s?t=125",
                        "https://youtu.be/eIL6rpL54-s?t=214",
                        "https://youtu.be/eIL6rpL54-s?t=828",
                        "https://youtu.be/eIL6rpL54-s?t=970",
                        "https://youtu.be/eIL6rpL54-s?t=1073",
                        "https://youtu.be/eIL6rpL54-s?t=1117",
                        "https://youtu.be/eIL6rpL54-s?t=2145",
                        "https://youtu.be/eIL6rpL54-s?t=2670",
                        "https://youtu.be/eIL6rpL54-s?t=3090",
                        "https://youtu.be/eIL6rpL54-s?t=3822",
                        "https://youtu.be/eIL6rpL54-s",
                        "https://youtu.be/eIL6rpL54-s",
                        "https://forum.makerdao.com/",
                        "https://youtu.be/eIL6rpL54-s?t=125",
                        "https://forum.makerdao.com/t/emergency-peg-management-governance-and-risk-meeting-wednesday-july-29-6-00-pm-utc/3446",
                        "https://youtu.be/eIL6rpL54-s?t=214",
                        "https://forum.makerdao.com/t/governance-at-a-glance/84",
                        "https://forum.makerdao.com/t/we-should-be-lowering-the-base-rate/3439",
                        "https://forum.makerdao.com/t/discussion-on-uniswap-liquidity-pooling-as-a-potential-tool/3444",
                        "https://forum.makerdao.com/t/tusd-update-trusttoken-response-to-implementation-concerns/3407",
                        "https://youtu.be/eIL6rpL54-s?t=374",
                        "https://forum.makerdao.com/t/signal-request-increase-system-surplus-threshold/3316",
                        "https://forum.makerdao.com/t/signal-request-should-mkr-be-added-as-collateral/3350",
                        "https://forum.makerdao.com/t/signal-request-add-eth-b-vault/3349",
                        "https://forum.makerdao.com/t/signal-request-increase-eth-a-risk-premium/3377",
                        "https://forum.makerdao.com/t/signal-request-increasing-the-dust-amount/3445",
                        "https://forum.makerdao.com/t/signal-request-adjust-the-bat-risk-premium-and-debt-ceiling/3334",
                        "https://forum.makerdao.com/t/tusd-update-forum-poll-concerns-surrounding-the-tusd-collateral-type/3225",
                        "https://youtu.be/eIL6rpL54-s?t=528",
                        "https://youtu.be/eIL6rpL54-s?t=560",
                        "https://youtu.be/eIL6rpL54-s?t=758",
                        "https://youtu.be/eIL6rpL54-s?t=621",
                        "https://youtu.be/eIL6rpL54-s?t=682",
                        "https://youtu.be/eIL6rpL54-s?t=828",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://github.com/makerdao/mips/blob/master/MIP12/mip12.md#mip12c3-collateral-type-checklist-for-governance-approval",
                        "https://forum.makerdao.com/t/usdt-erc20-token-smart-contract-technical-assessment/3462",
                        "https://forum.makerdao.com/t/paxusd-erc20-token-smart-contract-technical-assessment/3461",
                        "https://forum.makerdao.com/t/paxg-erc20-token-smart-contract-domain-community-assessment/3443",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://youtu.be/eIL6rpL54-s?t=970",
                        "https://chat.makerdao.com/channel/keeper",
                        "https://youtu.be/eIL6rpL54-s?t=1073",
                        "https://forum.makerdao.com/t/mip10c14-sp6-proposal-appoint-mycrypto-as-a-light-feed/3383",
                        "https://youtu.be/eIL6rpL54-s?t=1117",
                        "https://youtu.be/eIL6rpL54-s?t=1320",
                        "https://forum.makerdao.com/t/mip17-weekly-actual-debt-ceiling-and-actual-risk-premium-adjustments/3021",
                        "https://forum.makerdao.com/t/mip17-weekly-actual-debt-ceiling-and-actual-risk-premium-adjustments/3021",
                        "http://makervaults.descipher.io/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.567857208687501
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "0",
                    "time": "24/07/2020-16:34:03",
                    "content": "Charles St. Louis Weekly MIPs Update 35:45 Weekly MIPs update #10 - Forum Thread Cover Slide823×465 112 KB This Week&#39;s Activity1400×658 101 KB   Five proposals plus adjustments were added to the Maker Protocol.   I will share a thread of what it means for the Maker Protocol to have all these five proposals implemented. In short:   We added a Weekly Governance Cycle to focus on things that need quicker action than the monthly cycle.   Meta-parameter adjustments that are not directly related to Smart Contracts.   A subproposal that proposes to remove the DSR spread.   Adding MANA as a collateral type.   An upgraded liquidation system V1.1     Next Week&#39;s Activity1388×706 144 KB Collateral Onboarding1380×701 170 KB   Wil Barnes: collateral assessments available here   On the right, you can see the list of current community greenlight polls. Another reminder to vote, if you haven’t.   Proposals in the RFC Phase1357×723 103 KB  There are a few proposals still in the Request For Comments phase. It doesn’t look like most of them will be ready for the August cycle.  MIP17 Working Group Call1374×699 99 KB   It could be ambitious, but we’ll try to get them done.   The call was extremely productive. I wish I could put together more slides based on it.   Planet_X has volunteered to help join as an author for the DC adjustment proposal together with me. Hopefully, proposing it for August. It could be a little ambitious, but we’re going to work over the next six days to see if we can formally submit it on time.   Join the community965×536 31.8 KB MIP17: Weekly Actual Debt Ceiling and Actual Risk Premium Adjustments   Working call notes - Forum Thread   MIP17 Working Group Results and Action Items - Forum Thread   A short twitter thread for what the implementation of the five proposals means for Maker   Discussion 3 42:45   Akiva Dubrofsky: Why do some proposals have to extend the RFC process if they have met the deadlines?  Charles St. Louis: When a proposal is submitted, it has a dedicated amount of time that it has to be in the request-for-comments phase, called the Feedback Period. There’s also a frozen period where the proposal can’t be edited, to make sure that no last-minute edits can sneak in before it gets submitted. Based on MIP 0, we have a timeline for the feedback period, which is three months. The Dark Fix Mechanism is going through that period.    Procedural LongForWisdom Governance Cycle Review 44:30 Overview  We had seven proposals proposed at the beginning of the month. We had the governance poll bundle and approved five. Then we saw those five proposals pass in an executive vote.  MKR Participation   We saw more MKR participation in the inclusion polls. Specifically for MIP17 and the MIP12 amendments. We saw a lot of people voting against, to keep things out of the governance cycle bundle, which was interesting. We tended to see more negative responses than favorable responses. The ones that did make it into the governance poll had an average of 6,000 MKR, whereas MIP17 was voted against by, I think, 20,000 MKR.   I guess people are more concerned with removing dangerous things than approving wanted things. Or it could be the reflection that fewer people felt super strong about the passing that proposal.   We saw more participation in the governance bundle, though. I think 18,000 MKR voted this time around. I think it was 4,000 in June and 5,000 in May, so a valuable increase, which is good.   ETH-A Debt Ceiling Added to the Executive Vote   In terms of the final executive, it’s worth mentioning that we opted to include the ETH-A DC in the final mix executive, which is not ideal because the whole point of going through the entire cycle and having inclusion polls is that everyone knows what’s in that final executive. Unfortunately, we were in a situation where the issues with the peg and the state of the debt ceilings forced our hand a bit. It’s possible that affected how quickly the MIP proposals passed, or the fact that it passed. I don’t think it’s controversial, but we do need to be aware.   Charles St. Louis: I think we also need to highlight how unanimous the poll was. If it was a closer call between the yes and the no, then it could be a problem.   LongForWisdom: It’s potentially a problem. If it’s something that we put into the vote that didn’t go through, the cycle is controversial, and you risk throwing away a month’s worth of governance away that people otherwise agree with. It’s risky, but I agree. In this case, the reason I bundled them was because I didn’t think that it was a huge problem. We got lucky in the fact that it wasn’t a huge problem in this case.     Governance Next Cycle 48:40  LongForWisdom: Charles already went over the RFC MIPs. Is there anything anybody’s excited to see moving through the governance cycle? Is there anything anyone thinks it needs more work? Akiva implied that he planned on submitting his Declaration of Intent on Forward Guidance for the next cycle. Does anybody have thoughts on it?  MIP13 Summary   Akiva Dubrofsky: I updated it a lot. The main point is that it establishes a Vault Holder Advocacy Group, which aims to work with risk teams to provide forward guidance and more transparency on what the risk parameters are going to be. Historically, Maker has provided this fluctuating rate, which didn’t matter to people if the market was fluctuating because of the base rate or DSR. If you see my presentation on the Community Call this week, you will see that lots of people are involved in hedging the base rate. This hedging opens the question: is Maker going to be transparent with other risk parameters?   LongForWisdom: If I can summarize, I think the goal is to provide more reassurance to vault holders that the risk premiums are not going to change willy-nilly.   Akiva Dubrofksy: Exactly. We want to optimize transparency and stability in the risk premium.     Risk Vishesh Relevant Links MCD System Stats DAI 24hr VWAP Graphs Maker Vault Stats The State of the Peg 51:30 DaiStats850×370 110 KB   Total Dai is around 330 million, which is pretty significant.   Dai from ETH is about 250 million.   We have about 2 million Dai from BAT.   50 million Dai from USDC-A.   20 million from WBTC.   ETH-A &lt;&gt; Dai Supply1255×616 52.1 KB  In the last 24 hours, we saw a jump in the amount of Dai minted from ETH, up to about 240 million.  USDC-A &lt;&gt; Dai Supply1223×595 51 KB   USDC-A has been volatile recently. There are a few significant positions that have opened and closed for short periods.   Net is still up at about 58 million Dai.   WBTC-A &lt;&gt; Dai Supply1360×673 59.3 KB  The WBTC supply is still capped out.  BAT-A &lt;&gt; Dai Supply1218×600 53.9 KB  BAT gained some utilization and then lost some utilization in that same time frame.  Dai.Descipher.io1357×570 278 KB   As far as the peg itself, we saw this mostly elevated price while a lot of the farming activity is going on for YFI. As that farming opportunity unwound, peg came back down.   We’re still seeing tremendous amounts of trading volumes for Dai during that same time frame.   Uniswap trades1035×540 219 KB   Crazy price trades were getting executed on Uniswap, which we tend to see when there’s a lot of volume and volatility.   Dai price was sitting fairly steady just slightly above the peg for a couple of days, and then it started to rise again in the last 48 hours. People are concerned if further yield opportunities will crop up. Additionally, with Compound activity and yields, if those rates could persist or grow.   Collateral Risk1277×467 109 KB   The ETH pool got riskier. There’s a consistent amount over the last couple weeks of Dai minted from ETH at a very low CR. There’s been a shift downward from higher CR to this mid-to-low 200-250% collateralized bucket, which is rebalancing in terms of the amount of collateral.   Even though ETH has risen in price, and that initially pushed up collateralization ratios, people did the usual: they withdrew collateral or minted more Dai to risk-adjust to that higher nominal ETH value.   Liquidation Walls1256×369 52.3 KB  As Cyrus alluded to these liquidation walls, we have a pretty large one at about $200 ETH. At that price drop, you would see 113 million Dai liquidated. At $155 is 190 million Dai. Even at $230, you would see 34 million Dai liquidated, which in percentage terms is not quite that large, but if you compare it to what it would have been a problem for mass liquidations, say, like three months ago, 34 million is nothing to sneeze at either.  3 Day Dai VWAP Breakdown1272×588 165 KB   As I said, we’ve seen a tremendous amount of trading activity in the trading volume for Dai as well. This volume is something to remain aware of in the context of a lot of insane yields, risks, etc.   For DAI/ETH trades, it’s mainly been dYdX and Uniswap.   EtherScan - Balancer Pool Token1250×310 104 KB  We all know that there’s been a tremendous amount of activity on the Balancer pools, the curve farming, and now with the most recent fork of YFI pools too. That’s got a solid 62 million Dai.  Compound1033×367 89.9 KB   If you look at Compound net value, there’s about 145 million Dai deposited.   In addition to the new YFII pool, we’re looking at upwards of 200 million Dai sitting in these farming opportunities. With a total Dai supply of 330 million, that’s tremendous domination. And that’s low-balling it too, as other sources have not been included.   We have discussed if this is going to be a lasting trend or are these short-term opportunities. I think we had it right when we said that the genie is out of the bottle, and this is a continuing trend, but for as long as assets like USDC outpace the supply of Dai. Still, Dai continues to have a premium or be very heavily used, Dai is likely going to be used for farming.   The insane yields of YFI kicked off a bit of a frenzy. I’m sure that people will try to reproduce those yields in many different forms. Whether it’s going to hit the same yields is very uncertain, probably not.   If you look at the yields that you can get with the COMP farming, that’s very likely to persist. To some extent, farming opportunities creating Dai demand is a new normal that needs to be addressed and have the community plan around.   What to do about this outside of increasing the debt ceilings each time they max out? If you’re doing that ad infinitum, you are ballooning the risk that the system is taking on, and you’re always chasing your own tail. If you continue to increase the DC, at what level will these yield opportunities no longer be as profitable? Will that actually ever be the case?   Again, this is just spurring a discussion on how Dai is being used and what risks that inherently brings.   Discussion 4 1:01:52 Being Ready for a Dai Crunch  Vishesh: Some chat comments worth mentioning around liquidations. If we have an ETH price pullback that would be problematic, we all know ETH is a repetitive beast. ETH price has been rising and rising. It has been wobbly or flat in the last couple of days. There’s a potential for a pullback, and you need to be aware that that could cause liquidity crunch on Dai. That could push the Dai price up further. Having keepers and liquidity ready to act on those auctions is extremely important.  Open Discussion LongForWisdom Negative Base Rate 1:03:42   LongForWisdom: Akiva is saying to talk about the negative base rates. This is the first time we’ve had a negative base rate, which means MKR holders are actively deciding to subsidize risk on the Protocol in exchange to make Dai minting easier. Given the current situation, I think that it makes sense.   befitsandpiper: There are a few collaterals that we aren’t hitting DCs on. Particularly the new smaller collateral types, which would be most affected by this negative base rate.   MIP17 Reiteration  Charles St. Louis: If we, as a community, look at improving and prioritizing MIP17 rewrite for DC adjustments, getting more people in the discussion and having a community-built proposal to figuring the best solution, we can get it into the August governance cycle. I have a process for handling this in the future, leading to maybe the IAM. So I do encourage everyone to go to that forum thread to chime in so we can make this proposal as good as it can be. Sorry for the tangent, but I just wanted to reiterate that.  Common Abbreviated Terms MCD: The Multi-Collateral Dai system CR: Collateralization Ratio DC: Debt Ceiling ES: Emergency Shutdown EV: Executive Vote GF: Governance Facilitator GP: Governance Poll SF: Stability Fee DSR: Dai Savings Rate MIP: Maker Improvement Proposal OSM: Oracle Security Module IAM: Instant Access Module Credits   David Utrobin produced this summary.   Artem Gordon produced this summary.   Juan Guillen produced this summary.   Tim Black produced this summary.   Everyone who spoke and presented on the call (listed in the headers.)   ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-10/3429",
                        "https://forum.makerdao.com/c/risk/6",
                        "https://forum.makerdao.com/t/mip17-working-group-call-summary-next-steps/3464",
                        "https://forum.makerdao.com/t/mip17-working-group-call-summary-next-steps/3464",
                        "https://twitter.com/CharlieStLouis/status/1288127698263347206",
                        "https://youtu.be/eIL6rpL54-s?t=2565",
                        "https://github.com/makerdao/mips/blob/master/MIP0/mip0.md",
                        "https://youtu.be/eIL6rpL54-s?t=2670",
                        "https://youtu.be/eIL6rpL54-s?t=2920",
                        "https://forum.makerdao.com/t/mip13c3-sp1-declaration-of-intent-forward-guidance/3130",
                        "https://www.youtube.com/watch?v=mOC5n9mfyxQ",
                        "http://daistats.com",
                        "http://dai.descipher.io/",
                        "http://makervaults.descipher.io/",
                        "https://youtu.be/eIL6rpL54-s?t=3090",
                        "https://youtu.be/eIL6rpL54-s?t=3711",
                        "https://youtu.be/eIL6rpL54-s?t=3822",
                        "https://forum.makerdao.com/t/mip17-weekly-actual-debt-ceiling-and-actual-risk-premium-adjustments/3021"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.372824829303488
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "30/07/2020-15:45:22",
                    "content": "Bump for visibility ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#5",
                    "likes": "1",
                    "time": "04/08/2020-10:36:33",
                    "content": "summary posted above ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#6",
                    "likes": "0",
                    "time": "04/08/2020-12:37:48",
                    "content": "When will we see some innovative stuff from the Foundation for keeping the peg under control? It’s better to try and fail than not to try at all. By not trying I mean repeating the same actions with every new executive vote and getting the same result. To me, it’s clear that the DAI design made a few years ago is not capable of dealing with high demand. The demand can persist for years (i.e. yield farming + lower confidence in the banking system) or until competition develops a better product. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.326609848484849
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-106-thursday-august-20-4-00-pm-utc/3657",
            "title": "[Agenda/Discussion] Scientific Governance and Risk #106 - Thursday, August 20 4:00 PM UTC ",
            "index": 3657,
            "category": [
                "Discontinued Categories",
                "Governance and Risk Meetings"
            ],
            "tags": [
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "0",
                    "time": "13/08/2020-17:28:54",
                    "content": "Agenda The zoom waiting room will be on, and a password is set to: 748478, please ping us in chat if you aren’t let in from the waiting room. This Agenda will be updated over the following week leading up to the call as people make me aware they want segments. 2020-08-20T16:00:00Z Introduction   @LongForWisdom: Hosting, Introduction, Agenda.  Domain Updates  Governance - @LongForWisdom: Governance at a Glance Smart Contracts Domain Oracles Domain Risk Domain MIPs - Charles St. Louis : Weekly MIPs Update  Procedural   @Gov-Facilitators: MIPs Governance Poll Review  Other Updates and Presentations   @Wil: MIP15: Dark Spell Mechanism   @brianmcmichael : SC Bugs Postmortem   @cmooney: Liquidations 1.2   Vishesh Choudry: State of the Peg  Discussion Topics  Continued Peg Deviation  General Q&A We’ll open the floor for any questions about Scientific Governance and Risk. Please join us and help shape the future of the MakerDAO. Links  Video/Voice  Dial-in  Calendar  Call Summary Will be provided here after the call as time allows. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip15-dark-spell-mechanism/2578",
                        "https://forum.makerdao.com/t/postmortem-bug-in-2020-08-07-executive-spell-contract/3709",
                        "https://forum.makerdao.com/t/liquidations-system-1-2-upgrade-timeline/3592",
                        "https://twitter.com/visavishesh",
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/embed?src=makerdao.com_3efhm2ghipksegl009ktniomdk@group.calendar.google.com&ctz=America/Los_Angeles",
                        "https://forum.makerdao.com/t/maker-relay-ep-8/3712",
                        "https://forum.makerdao.com/t/maker-relay-ep-09/3793/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Governance",
                        "Smart contract updates",
                        "Risk Domain",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.149553571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/08/2020-17:31:17",
                    "content": "Episode 106: August 20, 2020 Agenda   00:00: Intro with LongForWisdom   01:50: Governance at a Glance with LongForWisdom   05:55: Smart Contracts Update with Brian McMichael, including postmortem on WBTC bug   10:57: Oracles Update with Nik Kunkel   13:03: Risk Update by Cyrus Younessi   15:23: Weekly MIPs Update with Charles St. Louis   21:30: Governance Polls Review with LongForWisdom   22:52: Presentation on MIP15: Dark Spell Mechanism with Wil Barnes   31:51: Presentation on Liquidations 1.2 with Christopher Mooney   55:15: State of the Peg with Vishesh Choudry   1:05:31: Short-Term Real World Asset Liquidations with Lucas Vogelsang   Video https://www.youtube.com/watch?v=fPpCmrSkWPY Introduction LongForWisdom Agenda and Preamble 00:00   Hello, everyone, welcome to 106th MakerDAO Scientific Governance and Risk meeting. Today is Thursday, August 20th. My name is LongForWisdom. I am one of the MakerDao Governance Facilitators. I am joined by 35 people at the moment. I will briefly review the agenda, and then we’ll start at the top. Anybody is free to interrupt and ask questions during any point of this call.   Longer-form discussions happen in the Forum.   Forum Recap LongForWisdom Governance at a Glance 01:50   Governance at a Glance - Forum Thread: If you have the time to read over and vote in active threads, that would be much appreciated.  Discussions   cDAI/aDAI/yDAI collaterals as a peg enabler tool  SebVentures speaks to the benefits of using cDai/aDai/yDai as collateral, which prompts some renewed discussion this week.    Real World Assets - CTL Document Roadmap - Getting started v1  Mrabino1 continues his series of posts on his real-world asset proposal. This post focuses on the roadmap and next steps, laying a roadmap to get the steps to where we need to get real-world assets live on the Maker Protocol.    Vault Liquidation Mechanism for Centrifuge Trade Finance Assets: A Pre-MIP Discussion   Spin, or Lucas, from Centrifuge, describes a vault liquidation mechanism that can be used for a subset of the proposed Centrifuge assets, especially the trade finance one.   LongForWisdom: We’re going to see more focus over the next few weeks and months on real-world assets, as we get to a point where we consider finally onboarding them. This is exciting for me and hopefully for some of you as well.     Collateral Calls - Calling all Projects!   Juan has posted a thread in which collateral partners can register their interest in presenting in the new collateral call.   LongForWisdom: I encourage anyone who is a collateral partner, or knows a collateral partner, that wants to present, to point them in the direction of that thread.     Signal Requests   Increase WBTC Debt Ceiling   Aaron_Bartsch proposes increasing the wBTC debt ceiling again to accommodate the increased usage.   LongForWisdom: We are approaching the current cap of 80 million. If you are strongly feeling toward increasing that, make your feelings known.     Should we change the RPs for various collateral types?  Befitsandpiper asks whether we should take the opportunity to adjust risk premiums for collateral assets at a time where we can take advantage of the negative base rate to prevent peg impact.    Increase System Surplus Threshold   Aaron_Bartsch also asks whether it is the right time to increase the system surplus threshold.   This passed last week.     Increasing the ‘dust’ amount   Jiecut asks if the ‘dust’ parameter should be increased considering the sustained elevation in gas prices over the last few months.   This passed last week.     [Signal Request] Adjust the BAT Risk Premium and Debt Ceiling   Jiecut also asks if the BAT-A risk premium and debt ceiling should be adjusted. Note that the BAT-A debt ceiling was changed in the most recent executive vote.   This passed last week.     Signal Request: Resubmit Inclusion Poll for MIP12c2-SP4 - LRC Collateral Onboarding   Aaron_Bartsch asks whether we should resubmit LRC in the September governance cycle.   LongForWisdom points out that the subproposal in question would be up to the author (@NikKunkel) to resubmit.     Discussion 1 05:05 wBTC Signal Request   Akiva: Is the one to raise the wBTC risk premium on poll or by an executive vote?  LongForWisdom: That is currently a signal request, which will then go through the usual steps. No one has presented it as an emergency change yet, so absence of that happening will follow the usual process.    Collateral Calls   LongForWisdom: Lucas is saying in the chat that the next collateral call is next Wednesday, 26th. Look out for that.   Collateral Calls and other community events can be found in the MakerDAO Community Events Google Calendar   Smart Contracts Brian McMichael Smart Contracts Update 05:55 Liquidations 1.2  The team has been working pretty hard on Liquidations 1.2 for last week, and we’ll have some updates later in the call about that.  Parameters Changes  Last week’s spell passed. We raised the dust values from 20 to 100 Dai on all collateral types. The base rate was reduced by 2%, meaning we reduced the stability fee of MANA-A from 8% to 6% percent. We reduced the stability fee on USDC-B from 46% to 44%. And we also increased the system surplus from 500,000 Dai to 2,000,000 Dai. We also had an emergency executive vote earlier this week to raise the ETH-A collateral debt ceiling from 340 million to 420 million Dai, and that succeeded.  WBTC Postmortem   We also have been doing some updates to our spell process. I did post a postmortem for the WBTC bug that Mariano mentioned last week on the call.   It’s not the smart contracts team’s finest moment, but it did reveal a lot of opportunities for us in our process. We all knew that something like this could happen, and it was a matter of when and not if. This is because we usually prepare them and test them ourselves. We will get a head start in the evening after this call and, frankly, the stakes are high. In this case, we changed the WBTC line from 40 million, which should have been RAD, but we changed it to a WAD, and that effectively changed the cap to zero.   Improving the Process and Tools   In the short term, what we’ve done was we’ve refactored our test suites to be able to quickly spot an error like this in our audits. We’ve also added unit testing around all of our modifiable variables that will check for precision ranges, so if anything slips in that’s out of a precision range, we’ll catch that right away in our tests.   The Foundation has some internal tools right now that are still under construction, but they will be made public for visualizing on-chain changes. So, even if you don’t read the code, we’ve got some tools that will let you quickly look and see what these spells are going to do to these various values within the system. We added those to the checklist that we use when preparing for the weekly spells.   Improvements to the Spell Casting Process   We had this process where we used the previous week’s Executive and moved forward from there, and every week we’d add a little bit more to it. So, it would get a little bit better, and it was an incremental process. If things changed that weren’t in last week’s Executive, we wouldn’t have to go back, and that’s where this error happened. So, we’re going to be creating a full-scale template that isn’t a copy-code thing that we’ll be using for our weekly executives going forward. In the longer term, this is something that we can automate. We’re doing line changes, stability fees changes, debt ceiling changes every week so, I think this is a solution that we can automate ourselves out of rather than relying on this manual spell crafting process that we currently have. In a way, it’s good that this happened because it does put a spotlight and renewed priority on how important this spell crafting process is. We’re a little bit focused on new features, and it’s a reminder to all of us that the spell crafting process needs just as much attention. We are on the right track, we’ve already made some big improvements, and there’s more to come.   If anyone has any questions, we can do it now or later in the meeting.   Oracles Nik Kunkel Oracles Update 10:57   We have been working ahead implementing oracles, the back-end details at least, for a bunch of potential collateral types. We’ve already gotten done pretty much anything that the smart contracts and risk teams want to tackle in the next two months. We are in a good position now to take a look at some of the more difficult ones that have popped up over the past couple of months.   I think some of you may have heard me mention in the forum with respect to certain collateral types that maybe our stack doesn’t really support right now. Implementing this would be quite difficult; we were looking for more low-hanging fruit to be able to onboard quickly. But, now that we have built up this lead, it’s probably the right time to start looking at some of those. This can include stuff like the Uniswap liquidity tokens, stuff like Compound Dai, the aDAI, and yDAI type of tokens, looking at the security tokens and how we want to handle the architecture for those. So we’re in a good spot right now, but it might be a while before you see the fruits of this labor before it actually makes it into production.   Risk Cyrus Younessi Risk Teams Update 13:03   Recently, we have been working on Liquidations 1.2, trying to put together some parameters for it, as well as some operational procedures between Liquidations 1.2 and the old circuit breaker, which is still around.   We also finally posted the Tether and PAXUSD MIP12 submissions into the forums. Please, take a look at those, which should be going up for a vote soon.   We are also wrapping up our ETH-A and ETH-B risk evaluations. We should be posting those next week as well.   There is also a Chainlink evaluation coming up hopefully next week, if not then early the following. I’m trying to squeeze that one into the next cycle as well.   We’ve been spending some time exploring the cTokens as potential collateral types, cDAI, and whatnot, seeing if it makes sense to onboard those for governance.   Then, for next month, we’ve begun preliminary research on the COMP token and PAXGold as well.   I think that’s it for updates, but if anybody has any questions, I’ll be happy to answer offline.   MIPs Charles St. Louis Weekly MIPs Update 15:23  This Week2820×1362 387 KB Next Week2738×1416 401 KB  The gap week allows for whoever has proposals and progress to submit them for requests and comments and overall allow the whole community to gather themselves after this month’s governance cycle.  Collateral Onboarding Updates2752×1446 415 KB Proposals in RFC2788×1434 440 KB   I left out the LRC MIP12, which will potentially be resubmitted for next month.   The MIP20 Target Price Adjustment Module has a recording link for this specific segment from last week’s MIP updates.   For MIP17 Weekly Actual Debt Ceiling Adjustments, Planet_X and I have iterating towards creating a reworked version of the MIP17, which previously also included risk premium adjustments. We’re still figuring out the mechanism and whether it should be applied to just crypto assets for the short term or if we should add some functionality for the future of potential real assets. These are some considerations we have in mind. If anybody within the community wants to join our working group, please message myself or Planet_X. Additional help will speed up the process of getting this resubmitted.   Wil will be speaking towards The MIP15 Dark Spell Mechanism’s proposal and giving everybody a recap.   Lastly, the MIP14 Protocol Dai Transfer is still in request for comments. It was rejected sometime last month or the month before this governance cycle. LongForWisdom is the original author and is looking for someone within the community who wants to focus on this proposal and champion it going forward. If you are interested, message LongForWisdom or join the MIPs channel and make a comment there. I’ll facilitate the transition of the authorship.   Pre-MIP Discussions2786×1208 195 KB   We had a new pre-MIP discussion posted on the forums last night on the Vault Liquidation Mechanism for Centrifuge Trade Finance Assets. It was proposed by Lucas.   I want to remind everyone that there are still active discussions still happening with respect to a Governance Chief Contract Redesign, the Liquidation System Redesign, as well as adding a poll to prioritize collateral applications   There are other ones, but these are the most active ones.   LongForWisdom (Governance Facilitator) Governance Poll Review 21:30  The two things included in the bundle governance poll are the Declaration of Intent, Forward Guidance by Akiva, and the subproposal to off-board Richard Brown. The bundle has passed, and I don’t see any reason for them not to move to Executive on August 24th.  Wil Barnes Presenation on MIP15 Dark Spell Ratification 22:52 Cover Slide2546×1374 134 KB  The MIP15 is eligible for ratification in September. I am quite excited to finally work through that process, so I put together this presentation to walk us through a little bit about how we got here, what the Dark Spell is to people who are new as well as some action items.  Things to cover1686×1062 115 KB Brief Explainer2200×960 209 KB  A brief explainer is that we had this issue back at the beginning of the year. We intentionally had a governance delay of 0 as we had a brand new deployment. We wanted to be able to patch bugs as they just showed up. That was the intention, although we didn’t really need to patch any bugs. However, we had the opportunity to be diligent, too, if we needed to be. It also opened us up to a governance attack where someone could easily use various options that involve acquiring MKR and launching a governance attack against MCD. We were in a situation where if we did find a critical bug when we had a governance delay, we would probably have needed to perform an emergency shutdown. With the Dark Spell, now we don’t have to. It fits into the existing governance processes as well as conceals the bytecode. Nothing goes on-chain. Nobody can reverse engineer it. It checks all the boxes for what we need to do. It’s the best solution we have for our circumstances.  Timeline from MCD Launch to Now2032×1096 298 KB  To understand why we have this as a MIP and how we got here, it’s important to understand a little history. We’re approaching a year of MCD being live. Everybody probably remembers that during the launch there was some initial debate around December regarding a potential governance attack. I wouldn’t say it was contentious, but both sides had explained why we had a zero delay and why we needed it; however, we never really landed on a solution at the time. Then we didn’t discuss things for several months until February, where there was a series of flash-loan exploits that brought the discussion back into the forefront. We immediately proposed the Dark Spell. We were working on it before, but this just accelerated the proposal. Then we proposed the Dark Spell around mid-February, and on February 21st, we moved to set the governance delay to 24 hours. We moved pretty quickly after the February flash-loan exploits to secure the system and have the Dark Spell fixed; however, then we stumbled upon a bug. Everyone was probably painfully aware when on Black Thursday we reversed the delay back down to four hours and stuck on that for a couple of months until April 20th when we increased it to 12 hours, which is the current delay time right now.  Action Items for September2196×1134 231 KB   This is going to be light on technical details. If you’re interested in Dark Spell, there’s plenty of literature and previous presentations on it.   I really want to call out a few dates here. The formal submission will be between September 7th and 9th. The inclusion poll is between September 14th and 16th. The big MIPs executive is on September 28th.   I am targeting that we ratify MIP15 in September, which would set the stage for further action in December for us to continue improving upon it. Please, review the MIP again and provide feedback. There is still time until September 7th to provide feedback. Here is the link to the forum discussion thread. LongForWisdom is the only one who has made comments on the MIP so far. It would be great if others can take a look at it.   Upon Ratification...2240×886 130 KB  Lastly, upon ratification in September, which I am hopeful for and think is a good possibility, we will have an initial set of guidelines for dealing with a critical vulnerability. Right now, we just have a common agreement with the SC domain team internally on how we would handle this, but this does formalize the process and creates a process where we can onboard a community appointed trusted third-party in the future and then start adding incremental improvements. It’s the first step, and what I would like to highlight is that once it’s ratified, discussion about who to trust the community appointed trusted third-party or parties will be and how we will set up a working arrangement with them.  Additional Information2176×534 85.1 KB  I would direct all commenting and review to the forum thread where we can continue and make changes to the MIP if anyone desires.  ",
                    "links": [
                        "https://youtu.be/fPpCmrSkWPY?t=110",
                        "https://youtu.be/fPpCmrSkWPY?t=355",
                        "https://youtu.be/fPpCmrSkWPY?t=657",
                        "https://youtu.be/fPpCmrSkWPY?t=783",
                        "https://youtu.be/fPpCmrSkWPY?t=923",
                        "https://youtu.be/fPpCmrSkWPY?t=1290",
                        "https://youtu.be/fPpCmrSkWPY?t=1372",
                        "https://youtu.be/fPpCmrSkWPY?t=1911",
                        "https://youtu.be/fPpCmrSkWPY?t=3315",
                        "https://youtu.be/fPpCmrSkWPY?t=3933",
                        "https://www.youtube.com/watch?v=fPpCmrSkWPY",
                        "https://youtu.be/fPpCmrSkWPY",
                        "https://forum.makerdao.com/",
                        "https://youtu.be/fPpCmrSkWPY?t=110",
                        "https://forum.makerdao.com/t/governance-at-a-glance/84",
                        "https://forum.makerdao.com/t/discussion-cdai-adai-ydai-collaterals-as-a-peg-enabler-tool/3470",
                        "https://forum.makerdao.com/t/real-world-assets-ctl-document-roadmap-getting-started-v1/3716",
                        "https://forum.makerdao.com/t/vault-liquidation-mechanism-for-centrifuge-trade-finance-assets-a-pre-mip-discussion/3737",
                        "https://forum.makerdao.com/t/collateral-calls-calling-all-projects/3715/",
                        "https://forum.makerdao.com/t/signal-request-increase-wbtc-debt-ceiling/3731",
                        "https://forum.makerdao.com/t/signal-request-should-we-change-the-rps-for-various-collateral-types/3484",
                        "https://forum.makerdao.com/t/signal-request-increase-system-surplus-threshold/3316",
                        "https://forum.makerdao.com/t/signal-request-increasing-the-dust-amount/3445",
                        "https://forum.makerdao.com/t/signal-request-adjust-the-bat-risk-premium-and-debt-ceiling/3334",
                        "https://forum.makerdao.com/t/signal-request-resubmit-inclusion-poll-for-mip12c2-sp4-lrc-collateral-onboarding/3692",
                        "https://youtu.be/fPpCmrSkWPY?t=306",
                        "https://calendar.google.com/calendar?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://youtu.be/fPpCmrSkWPY?t=355",
                        "https://youtu.be/fPpCmrSkWPY?t=657",
                        "https://youtu.be/fPpCmrSkWPY?t=783",
                        "https://youtu.be/fPpCmrSkWPY?t=923",
                        "https://youtu.be/ZzEbuwyaZRQ?t=511",
                        "https://forum.makerdao.com/t/vault-liquidation-mechanism-for-centrifuge-trade-finance-assets-a-pre-mip-discussion/3737",
                        "https://forum.makerdao.com/t/governance-chief-contract-redesign-a-pre-mip-discussion/3080",
                        "https://forum.makerdao.com/t/a-liquidation-system-redesign-a-pre-mip-discussion/2790",
                        "https://forum.makerdao.com/t/adding-a-poll-to-prioritize-collateral-applications/2936",
                        "https://youtu.be/fPpCmrSkWPY?t=1290",
                        "https://youtu.be/fPpCmrSkWPY?t=1372",
                        "https://forum.makerdao.com/t/mip15-dark-spell-mechanism/2578",
                        "https://forum.makerdao.com/t/mip15-dark-spell-mechanism/2578"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.456317293817294
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "0",
                    "time": "13/08/2020-17:31:23",
                    "content": " Smart Contracts  Christopher Mooney  Liquidations 1.2 31:51   Liquidations 1.2 - Forum Thread   We are going to talk about liquidation 1.2 today. I’m Chris Mooney from the smart contracts team.    What is LIQ-1.21806×882 167 KB    So, what is liquidations 1.2? It’s a feature where we are going to limit the amount of Dai that is out for liquidation. Why is that? In recent months, we’ve seen a huge growth in MCD, maybe brought on by yield farming or just organic growth. But because of that growth, which is probably around 1.5 billion of collateral assets and around 420 million Dai, we believe that the keepers’ capital reserves are insignificant to handle large pullbacks in the price of some of those collateral assets.   This was a feature we’ve been working on in LIQ-2.0, and we thought it was complete enough, in that we could back pull it into this and limit some of what we believe is a mounting and growing risk in the entire DeFi space today.   And we also get a bonus for this, because it gives us a little bit more resilience against oracle attacks that set the prices for oracle assets down to one way or something. In that case, you can imagine an attack would come in maybe through the fees or some mechanism, the price for all of these collateral assets would get set down to near zero, which would mean that in the next oracle price update effectively we would liquidate that entire 1.5 billion of collateral assets to reclaim all that 420 million Dai. That’s really scary, and it’s a situation Governance has about one hour to act to try and mitigate that and with this feature, even if we weren’t able to act within that hour, the limit of our exposure would be to this new system variable that would prevent the amount of Dai for liquidation. So, rather than trying to reclaim 420 million Dai, we would reclaim whatever Governance sets this new parameter to.    What to expect1994×1050 305 KB    A new governance parameter box has been added to the cat, which has caused us to colloquially call this the litter box. This new variable has to be set by risk teams and governance. A few of the numbers I’ve heard toss around are maybe 10 to 20 million of outstanding Dai. So that’s what the box might be set at. I defer to Cyrus’s team and other people to come up with a good value. That team has to balance the risk of this new variable against it being too large. If it’s too large, we are in a similar situation to what we’re in today, and if it’s too small, liquidations don’t operate as efficiently as they could.   We also have a new cat variable, the litter. So the litter fills the box, and this exists to represent the amount of Dai that’s currently out for liquidation.   We also remove lump, which is a ray that’s denominated in collateral units. So this is the size of an auction lot that can go up right now, and because it’s denominated in collateral units, while we were developing this, we found that we had a 500 ETH lump and with the rise of the ETH price recently, that meant that the calculation to build the tab for what would go out for liquidation could have actually overflowed and caused a revert. Not overflowed in a bad way that would change system accounting, but overflowed in such a way that it would prevent us from liquidating really large vaults that were up for liquidation.   So, the problem is there’s a lot of cognitive overhead to try and track this lump value because we have to always track the collateral price. So we’ve changed that by adding a new value per ilk or per collateral type called dunk, which is now a rad and denominated in Dai units because that’s where we store Dai units as in the core accounting system. So, for anyone of our collateral types, we can now say, when a liquidation happens, the dunk size is going to be around 40 or 50 thousand for that. This is nice because it gives us a very predictable amount that we might be asking for at any given moment. Governance can set it once and forget it unless some major macro situation changes. And we also get to add a file check. file is the mechanism we use to set these values. That will prevent dunk from causing an overflow. So we still get to get the precision, but the overflow risk still exists. However, now we’ll prevent Governance from ever being able to really set it close to that overflow.    Graph - time 02030×1068 158 KB    You’ll recognize this graph from Vishesh’s weekly presentation.   This is basically the amount of Dai that would be liquidated at any given ETH price, and I’m going to use this as an example to illustrate how this “litter box” is going to work.   Up here we have “time zero”, I chose six hours here because our liquidation ttl(duration) is six hours and the ETH price right now we’ll assume is about 420 Dai per ETH.    Graph - time 0 22112×1174 214 KB   As time goes on, we’ll see an oracle price fall to let’s say 325. So, this area of Dai that needs to be liquidated is going to get accumulated in the litter box. It’s represented by this brown line.   Graph - time 12098×1096 182 KB   As time goes forward, we are now one hour in, the price continues to fall, and we’re at about 275, so now all of this Dai needs to be liquidated, and we’ve added that to the litter box.   Graph - time 22092×1094 174 KB   Times continues to go on, we hit the two-hour mark of this awful price crash, and all of us are freaking out. We hit the 250 mark, and this entire chunk gets liquidated and accumulates in the litter box. And you can see how the litter box is now over half full of the Dai that we have out for liquidation.   Graph - time 32100×1078 184 KB   So the next price tick happens, and now we are down to 200 ETH price now, so there’s a huge chunk of Dai that are going to try and reclaim in this area. And, we had a little bit of space left in the litter box, and so we liquidated out of that chunk, keepers liquidated the amount that they could, before the litter box was full. The rest of this Dai in this particular time slice cannot be liquidated because there’s no longer room in the litter box. So, this entire red area represents Dai that can’t be liquidated. In fact, it actually gives these vault holders a little bit of a respite so that they can attempt to protect their positions.   Graph - time 42100×1052 180 KB   But in this fictitious scenario, the price is continuing to fall, so we are now down to 175, and there’s a whole new chunk of Dai that is now out for liquidation. We’re four hours into the auctions, but none of this has been liquidated, that means none of this is throwing pressure on the Dai price to go up, rather than maybe these vault holders attempting to close their positions. And we believe it’s this scenario right here that on Black Thursday, for instance, would have had very sub-optimal pricing. We would find that it would be hard to collect at a fair market price in this level of liquidation. I mean, just the volume of Dai that we would need to collect far exceeds the amount of liquidity available to the keepers.   Graph - time 52094×1056 176 KB   So also in our fictitious scenario, we get down to 150. We’re now at the fifth hour of liquidations, and our ttl for the first batch of auctions is six hours. And what’s nice is that this is a very common behavior that we see whenever we get these rapid price crashes.   Graph - time 0raph - time 0raph - time 02084×1096 195 KB    In the next time quantum, the price springs back a little bit and not only does it spring back a little bit but we are at the six-hour mark, and we’ve now dealt a bunch of this first round of auctions which has freed us up a little bit of space in the litter box. What can happen now is keepers can buy the next chunk of vaults, that need to be liquidated and they continue to add it to the litter box.   I hope this gives a general idea of how the litter box fills, of what it looks like, and maybe some of you are already thinking what are the risks here, what are we looking at.    Risks2090×1030 261 KB    Vaults may be withheld from liquidation while prices continue to drop:  I think it is the contention of most of the people in this space that this scenario is still far better than one-way bids like we saw on Black Thursday. That the price that we collect from this collateral liquidations would be far better than the price that we would have seen without this feature.    Some vaults could avoid liquidation (…):  That’s maybe arguable that it’s also possibly a feature because the box should be set at what we believe what governance believes how much liquidity is available in that keeper ecosystem.    If the box is set too low (…):  This would be extra bad if there was that available liquidity on the market, and we couldn’t just take advantage of it because we’d set the box far too low.    If the box is too high (…):  It’s probably still strictly better than what we have today if it sets too high because you get that oracle defense mechanism as well. But it’s basically the same problem which is that we could put so much Dai into liquidation that it would radically affect the peg and far exceed the amount of liquidity that keepers currently have.    Litter may accumulate in the box (…):  This is just an artifact of how the code works, but you’d think that there was a strong enough incentive to deal auctions that you’ve won, but we’ve actually seen keepers in the past not deal their auctions. What’s nice is that the deal function is not authorized so anyone can call the deal function so this actually creates an additional incentive for keepers to call the deal function on other people’s auctions if they want to free up that litter accumulated to make more space in the box.    The cat may leave behind some dusty Vaults:  Today, that’s because of that lump size, and we may also leave behind possibly dusty Vaults because, if you imagine a Vault to get partially liquidated and you still have a little bit leftover, something under our dust amount, that’s still subject to liquidation, but it might be below that dust amount. But that’s no different than the current risks we have today.     1616×840 92.5 KB   Discussion 2  Dynamic Litter Box 46:13   Aaron: Is it possible to make the litter box dynamic/automatic, so governance could just set it to being 10% of total DAI supply or something? I don’t want to have to keep changing it as supply grows and contracts, no?  Christopher Mooney: Yes. So I think right now the way to think about the litter box is that it’s for us to hope that our ecosystem can get a reasonable idea of the amount of liquidity that keepers have available to them, and this is never going to be perfect. The short answer is “yes.” If we wanted to, we could create an instant access module that you could hit, and anyone could call this function on it, and it would adjust the size of the litter box based on the size of the outstanding Dai supply. So that’s certainly a thing that we could add in the future if we thought that would be a useful metric or a useful way to set this. Right now, if keepers have enough liquidity, if they could handle one billion of liquidations, there’s no reason we shouldn’t set the litter box at one billion, right?     Supply versus Liquidity 47:29   LongForWisdom: Yes, I think what you are saying is not directly related to Dai supply, it’s more related to liquidity, right?  Christopher Mooney: More related to what we think the market can handle. In liquidations 2.0, that will be basically Dai liquidity in all of DeFi, right? Because it’ll be a Dutch auction system, so we’ll be able to use single block composability and go out to any source of Dai in the entire ecosystem and handle liquidations. So, we can be more liberal probably with the litter box, or we can get better numbers by looking at how much liquidity is up there. But for now, the keepers actually have to have that Dai liquidity or be able to at least cycle it from somewhere else within that six hours to make these bids. So, I think we need a variable to limit this, so we don’t get sub-optimal liquidations.     Lot Size Defined in Dai 48:21   LongForWisdom: So you talked about changing the dump parameter to - I’ve already forgotten the name - the lump parameter to something else. Is that what is called?   Christopher Mooney: Yes! lump to dunk (Debt-Chunk)   LongForWisdom: So, my question is whether there any side effects or potentially negative side effects of defining the lot size in terms of Dai rather than collateral? Because presumably, that means that the lower the collateral price, the bigger the lot size gets in terms of the amount of collateral, right?   Christopher Mooney: I’ve actually have been thinking about this change as almost fully better but to highlight an example to your point, let’s say we have a liquidation for a particular ilk that’s going to ask for 40 thousand Dai for that ilk, maybe it would be hard to cycle out the amount of collateral that you would get from that at market rates or something.   Kurt: The interesting thing that matters is not the actual number of tokens of collateral; what matters is the dollar value of that collateral. Is it economical to move chunks of collateral of that size around? Any risk people who are on the call can correct me on this, but my understanding of how we set lump today, which is the collateral denominated value, is we set it in an attempt to target a certain dollar value per liquidation. But, we have the problem then that collaterals change in value, and so over time, we potentially have very different amounts of dollar or Dai value of collateral pro liquidation. So, what we are achieving by switching from lump to this new dunk - which is just the quantity of Dai per liquidation - it’s just basically giving Governance what they want to have in the first place which is a fixed value in each liquidation.      Oracle Price and How Calculations of Collateral are made 50:38   LongForWisdom: I guess my concern is, we get the collateral price based on the oracles, right?   Kurt: That price is only used to determine if the vault is safe or not. It doesn’t go into the calculation of `dunk.   LongForWisdom: How do you calculate how much collateral to liquidate based on the dunk parameter?   Kurt: You take it proportionally. Let’s give a numerical example to make it simple. Let’s say your dunk parameter is 50 thousand, your vault has 100 thousand units of debt, so then in your liquidation, you take 50 thousand units of debt, and because it’s half of 100 thousand, you take half of the collateral.   LongForWisdom: Right. I was wondering how it would work if the oracle price was like zero, would that then liquidate all the collateral?   Kurt: If the oracle price goes to zero, all Vaults can be liquidated for that collateral type, but we’re putting it in a measure where in fact, you wouldn’t be able to liquidate all the Vaults, you’d just be able to liquidate up to the box. But that oracle price wouldn’t affect the ratio of collateral to debt in each auction because that’s just determined by the actual amount of debt and the actual amount of collateral in the vault at the time of liquidation.   LongForWisdom: I think I just misunderstood how you were trying to translate that. I assumed you were doing it based on oracle price rather than the percentage of a share of debt if that makes sense. But this makes a lot more sense.   Kurt: Right. It’s percentage-wise, which is actually how it already works today only in reverse. You take a fixed lump of collateral, and you take a portion of the debt, in proportion to the ratio of that lump of collateral to the total collateral. So this is just turning that around. You take a fixed amount of debt, and you take collateral according to the percentage of the debt you’re taking.      Interaction with Auctions 52:58   Akash: Do all the auctions still take six hours? I was confused by the part where you’re saying anyone can call deal.   Kurt: The auctions will take however long they’re configured to take, which is six hours. You can’t call deal before the auction concludes, but once an auction has concluded, anyone can call deal for that auction, to clear the auction off the books, send the collateral to the winner, etc. And that’s already how it works today, so the comment was if for some reason the keeper wins an auction and decides not to deal their own auction, maybe they also have like a CDP that they’re trying to prevent from being liquidated by keeping the box full, someone else can come along, call deal, and unblock the system.   Christopher Mooney: That’s not a change from today, the box component of it is, but anyone can call deal today on another person’s auction, once the auction is finished.   Kurt: It’s maybe slightly more important that anyone can call deal once we go to the Liquidations 1.2 because it has a little bit more of an effect in terms of unblocking more liquidations if the box is full.      Risk  Vishesh Choudry  Relevant Links MCD System Stats MCD System Stats Alt DAI 24hr VWAP Graphs Maker Vault Stats  The State of the Peg 55:15  2770×1486 351 KB    Just, at a glance, we have ~430 million Dai outstanding.   330 million from ETH   2.7 million from BAT   11.1 million from USDC   77 million from WBTC   Slight change in USDC-B   Small amounts from KNC, ZRX, MANA.    1278×631 40.5 KB   WBTC supply has grown significantly after the DC moved. The excess space in the DC for WBTC over last week has shrunk. There is a moderately high utilization and is at a high percentage of current debt ceilings utilization.   1265×621 67.6 KB   USDC dropped 38 million this week and is sitting at 10-11 million.   1273×627 71.3 KB   ETH has grown from 284 to 334 million. That is a significant 50 million increase. This bucket continues to grow.   Balancer Pool960×523 209 KB   If we look at where this Dai lives, there is a small amount on Balancer.    There’s a bit on Curve.   913×481 107 KB   Compound market has about 212 million or so that’s living in DSR, a good chunk coming from the excess supply in Compound chasing yield.   948×379 22.8 KB    About 212 million in DSR.   1274×529 287 KB   More or less, the peg has been closer to 1, in terms of ETH<>DAI trades. Hovering at 1.08~9. There has been a fair amount of slippage on Uniswap from traders in both directions. That bidirectional slippage moves the price needle a bit.   1274×529 287 KB   842×329 118 KB   USDC trades on Curve, dominating a lot of the USDC<>DAI volume. Those trades dropped about a cent. Sitting at an even smaller margin from peg 1.004~5.   954×338 150 KB    DAI<>USD pairs have a similar pattern. In the last two or three days, the gap is tightening $1.005~7 despite a surprising amount of slippage, even on sources like Coinbase.   Interesting to note the differences in the Dai pairs profile trading. But the general consensus is that the peg has come down. A slight pricing gap exists where peg stands in which venue with an overall blended price at 1.005.   This bodes well for the peg in terms of the collateral portfolio.    939×375 228 KB    Watching ETH price rise and fall recently, generally, in the past, we see decreased bullishness on ETH. Where users would buy Dai, and the price goes up. But given our current state, that it’s not a simple cycle of minting Dai and selling for ETH to resupply for leverage.   Now we have diff structures dominating how Dai is used. It’s more a cycle of minting directly and supplying directly for yield—a bit of a detachment for what’s happening with ETH and Dai price. In the last month, we’ve seen less of the old narrative where ETH bullies Dai. Normally, that’s a positive indicator for the Dai ecosystem, where there are now multiple external drivers on the Dai price. Primarily it’s still those yield farming opportunities, and there are forks popping up, but in large part the past week, the crazy yields have calmed down.   It’s all relative since there is a couple hundred million Dai in protocols like Compound. It will be interesting to watch how the gap tightens on the peg or whether another yield farming cycle pushes it back up. It’s really about people chasing the opportunities and putting their capital in Dai or in other assets. If the yield farming gets more diverse in its assets, then that potentially stresses the Dai peg less when it comes to yield farming.    End Discussion  Lucas Vogelsang  Short-Term Real World Asset Liquidations 1:05:31   Lucas Vogelsang: I missed the prompt by Charles to talk about the liquidations proposal for short term assets. Like ours, that we’re proposing. We’ve come up with a neat solution for real-world assets with keepers that are short term assets. A quick introduction, and I’d love for Lev or anyone else to comment. For real-world assets that are short term in nature, portfolio of invoices, for example, has a 65-day life cycle. Generally, they would be paid back by day 65. That means if you’re trying to liquidate a portfolio of invoices like this, an auction or distressed loan buyer is not the best. Just waiting and sitting on loans as they mature is a better strategy. For short-lived assets, it’s harder to discover price and go through liquidations. We’re suggesting that we don’t use the Flipper but build a mechanism where the vaults can force liquidation, continually mature, and get paid Dai back as invoices are paid back. Any questions about that?   Lev: First, I wanted to say that I agree with the direction this is taking. With real-world assets, we were running up with reconciling the current paradigm with collateral liquidations with whatever works, especially for this type of asset. There are two extremes: one is the margin trading paradigm. Like trading on Bitmex, where huge leverage positions hit a liquidation engine that sells your position as a market order to the book. But then in the real world, there are long-term loans, like real estate, that are highly non-fungible. The underlying collateral is not as liquid and doesn’t have continuous price discovery. The underlying loans, on the other hand, are higher quality, and you don’t expect them to blow up. In those extremes, you have collateral managed in a different way. Coming from the world of liquid crypto assets that you want off the books when unsafe. This doesn’t work in the opposite paradigm, less liquid but high-quality assets. Where you can’t find a buyer, and there isn’t the same price discovery. In general, the lending that MakerDAO is doing is more ad-hoc. The asset might have been created to specifically take advantage of a Maker Vault. I like your proposal of handling liquidations internally to the vehicle, forcing the manager of the pool to not issue loans and wait for short term loans to hit fruition is wise. My question: Are there similar ideas for longer maturity assets? For example, winding down funds for trade assets that are two months in maturity. And, similar structures with longer maturity assets. Can we handle this concept on the granular asset internally rather than liquidate pool shares on-chain?   Lucas: We spent some thinking on short-term, and I can expand if needed. But invoices, like bridge loans or trade finance, these have a fixed maturity where the final borrower is required to repay. It’s not a line of credit that I can keep open for an unlimited amount of time. If I, as a small business, borrow money from this asset originator that then takes that loan and places it in a pool and uses it as collateral in Maker. I have a contract that says I’m borrowing $100 from this Asset Originator and have payback in 60 days. Normally the mechanism is: you’re delinquent if you don’t payback. The SPV funding this pool of loans has a regular legal recourse. Like suing for payment. With longer-term assets, say a 10-year mortgage. You can’t ask them to pay it back since the loan is due much later. You would need to find another buyer, but that wouldn’t be required to happen on-chain. If you can require the asset originator to liquidate the vault in a reasonable amount of time, we won’t have the option to wait for maturity. In that instance, we can have this process defined, like a distressed real estate fund, that has a mechanism in place. Where, if Maker needs money to be repaid and they can’t find another investor to take on the share of the pool of Drop tokens. Then the Asset Originator would have to liquidate, which means selling loans to some hedge fund or broker. You could still give these drop tokens the ability to liquidate quickly potentially at a loss with a distressed loan company trying to provide liquidity for a premium. Now it’s not waiting for maturity but that the Asset Originator would have to have an off-chain process in place to liquidate its portfolio outside of it. As this liquidation occurs, the fiat that is being raised is converted to Dai and repaid to investors of the pool, including the maker vault.      Longer-Term Underlying Assets 1:15:15   Lev: Am I saying this correctly? For longer maturity underlying assets, we could use this as a first line of defense and then have on-chain liquidation as a back-stop? Potentially if these are multi-year mortgages, you could force the Asset Originator to liquidate the underlying portfolio.   Lucas: I think that’s what we want to get to, there we start running into what is an auction of securities on-chain. Which is legally possible; we have done some research, and Centrifuge is not the only member looking into that, but there is still some determination about the safest way to do that legally. Now you’re auctioning this security on-chain, which needs compliance with security regulations. You may need a broker-dealer ensuring keepers can purchase it.   Akiva Dubrofsky: If the vote for advocacy goes through, we’re trying to set up a call for sell-side advocacy for real-world assets and bring securities lawyers into the call to add questions.      Stability Fee on Real-World Assets 1:17:58   Akash: What is the expected SF that this collateral would be OK with? If it’s a low rate, how would that battle against a high DSR?  Lucas: We’ve done 2 million in originations in the last month since we launched in May. Our average rate was 8.5% APR which is competitive, even with a high DSR environment.     Outro  LongForWisdom  Closing Remarks  I think that is a good place to stop. Thanks, everyone, and Lucas for describing this and see you all next week. Everyone enjoy your week!   Common Abbreviated Terms MCD: The Multi-Collateral Dai system CR: Collateralization Ratio DC: Debt Ceiling ES: Emergency Shutdown EV: Executive Vote GF: Governance Facilitator GP: Governance Poll SF: Stability Fee DSR: Dai Savings Rate MIP: Maker Improvement Proposal OSM: Oracle Security Module  Credits   David Utrobin produced this summary.   Artem Gordon produced this summary.   Gala produced this summary.   Juan Guillen produced this summary.   Everyone who spoke and presented on the call, listed in the headers.   ",
                    "links": [
                        "https://forum.makerdao.com/t/liquidations-system-1-2-upgrade-timeline/3592",
                        "https://youtu.be/fPpCmrSkWPY?t=2773",
                        "https://youtu.be/fPpCmrSkWPY?t=2849",
                        "https://youtu.be/fPpCmrSkWPY?t=2901",
                        "https://youtu.be/fPpCmrSkWPY?t=3038",
                        "https://youtu.be/fPpCmrSkWPY?t=3178",
                        "http://daistats.com",
                        "https://catflip.co/",
                        "http://dai.descipher.io/",
                        "http://makervaults.descipher.io/",
                        "https://youtu.be/fPpCmrSkWPY?t=3315",
                        "https://youtu.be/fPpCmrSkWPY?t=3933",
                        "https://youtu.be/fPpCmrSkWPY?t=4515",
                        "https://youtu.be/fPpCmrSkWPY?t=4678"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.529848211552757
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "20/08/2020-15:43:18",
                    "content": "Bump for visibility. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#5",
                    "likes": "1",
                    "time": "26/08/2020-20:13:36",
                    "content": "Summary has been posted in the top comments above ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-105-thursday-august-13-4-00-pm-utc/3570",
            "title": "[Agenda/Discussion] Scientific Governance and Risk #105 - Thursday, August 13 4:00 PM UTC ",
            "index": 3570,
            "category": [
                "Discontinued Categories",
                "Governance and Risk Meetings"
            ],
            "tags": [
                "vault-compensation",
                "trfm",
                "mip-20",
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "0",
                    "time": "06/08/2020-17:44:48",
                    "content": " Agenda The zoom waiting room will be on, and a password is set to: 748478, please ping us in chat if you aren’t let in from the waiting room. This Agenda will be updated over the following week leading up to the call as people make me aware they want segments. 2020-08-13T16:00:00Z  Introduction   @LongForWisdom: Hosting, Introduction, Agenda.   Domain Updates  Governance - @LongForWisdom: Governance at a Glance Smart Contracts Domain Oracles Domain Risk Domain MIPs - Charles St. Louis : Weekly MIPs Update   Procedural   @Gov-Facilitators: MIPs Inclusion Review   Other Updates and Presentations   @equivrel: MIP20: Target Price Adjustment Module (Vox)  @monet-supply: Vault Compensation Update.  Vishesh Choudry: State of the Peg   Discussion Topics  Continued Peg Deviation   General Q&A We’ll open the floor for any questions about Scientific Governance and Risk. Please join us and help shape the future of the MakerDAO.  Links  Video/Voice  Dial-in Calendar    Call Summary Will be provided here after the call as time allows. ",
                    "links": [
                        "https://twitter.com/visavishesh",
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/embed?src=makerdao.com_3efhm2ghipksegl009ktniomdk@group.calendar.google.com&ctz=America/Los_Angeles",
                        "https://forum.makerdao.com/t/weekly-mips-update-11/3618",
                        "https://forum.makerdao.com/t/maker-relay-ep-09/3793",
                        "https://forum.makerdao.com/t/maker-relay-ep-7/3630"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Governance",
                        "Smart contract updates",
                        "Risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.278061224489797
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "13/08/2020-15:28:26",
                    "content": "Bump for visibility ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#5",
                    "likes": "2",
                    "time": "18/08/2020-01:48:26",
                    "content": "Episode 105: August 13, 2020 Agenda   00:00: Intro with LongForWisdom  01:24: Smart Contracts Domain Team Update with Mariano Conti  06:30: Oracles Domain Team Update with Nik Kunkel  07:09: Risk Domain Team Update with Cyrus Younessi  08:31: MIP20 with Lev Livnev  25:25: Governance at a Glance with LongForWisdom  28:43: Weekly MIPs Update with Charles St. Louis  35:11: Vault Compensation Update with Monet_Supply  52:00: State of the Peg with Vishesh Choudry  Video https://youtu.be/ZzEbuwyaZRQ Introduction LongForWisdom Agenda and Preamble 00:00  Hello everyone, welcome to 105th MakerDAO Scientific Governance and Risk meeting. Today is Thursday, August 6th. My name is LongForWisdom. I am one of the Governance Facilitators for MakerDao. I am joined by a host of people interested in Maker. We have a reasonably hefty agenda for today. As a reminder, anybody is free to interrupt and ask questions during any point of this call. We have an abnormal ordering of the agenda today because one of our presenters has to leave early. As a reminder, discussions happen in the Forum.   Smart Contracts Mariano Conti 01:24  As you know, we have the liquidations 1.2 updates that we spoke about last week. There is a forum post here. Very quickly, what this does is it puts a cap on the total amount of DAI that can be in liquidation at the same time. We think this is a good thing to have. The community reacted favorably to it. What we are going to do as the Smart Contracts team is take another week to finalize the code and write more tests. Initially, we were a little optimistic, thinking we’d have it by next Friday. But looking at the ecosystem right now and with everything that has been going on, we wouldn’t mind taking an extra week to do other testing and show these tests to the community if more people want to look at our solution. That was the first item I wanted to speak about, but we are not going to upgrade this weekend. The second thing I wanted to address was the failed spell from last week, which reduced the WBTC-A debt ceiling to zero. There was a mismatch in the units, and it was pretty serious. The good thing is that the bug worked in our favor this time. It could have been the other way and increase the debt ceiling to astronomically large numbers. In this case, the debt ceiling was already maxed, and the only thing that happened is it could create new DAI from WBTC-A almost precisely as it was before, but then a new spell came out and fixed it. But that error did prompt this from the smart contracts team to be more thorough with reviews. We will be sharing all the steps shortly we will be taking to ensure this doesn’t happen again. I think we have been a little complacent week after week - we got the poll’s results, did a spell, did a review, and then deployed on Friday. I don’t want to get into this too much, but maybe the community should speak about the length of time that the Smart Contracts team has to write the spells and if it is sufficient. Because it is under twenty-four hours, and that doesn’t give the community itself enough time to review these spells. Rest assured that we are adding to our methodology to ensure that this doesn’t happen again. Expect more stuff in the forums. If anybody in the community is somewhat technical and is up for reviewing these spells, please, do so.  Oracles Nik Kunkel 06:30  Pretty quiet this week. I did have tBTC reach out because they want to swap the contract that they have white-listed since they are gearing up for another release candidate, so I expect to see them post a proposal probably later next week.  Risk Cyrus Younessi Subject/Segment Description 07:09  No real updates from our end. We put out the blueprint valuation last week, and this week we’ve been strategizing for liquidations 1.2 parameters and reviewing some other general system parameters, things like a circuit breaker. We are still waiting on a few last-minute things to put out USDT tether and PAX MIP12 submissions and the same for Chainlink.  (chat): “Oops, I forgot to say. Also working on eth-a and eth-b.”    MIP20: Target Price Adjustment Module Lev MIP20: Target Price Adjustment Module 08:31  It’s not so much of a presentation today. Instead of going through the MIP, I would like to invite a discussion about the most critical issues that people feel about this MIP, to move it along, and see where it should go, given that it’s in the RFC phase right now. For background, we are talking about MIP20, called Target Price Adjustment Module, you may have heard of this described in one phrase as “negative interest rates.” It’s proposed in the wake of the issues with the peg and the limitations of monetary policy around the zero rates lower band that we are currently subjected to. I would like to highlight some things about this MIP before proceeding with the discussion:  First, this is a technical MIP that gives governance the option to adjust the par parameter, which decides how much for accounting purposes one Dai is worth in USD. Adjusting par can be used as a mechanism for, effectively, negative rates, which is currently not possible. However, there is support in the code for adjusting the USD value of a Dai in the system, which is why it’s possible to make this MIP and make technical modifications without changing the core system. So this a very lightweight small component, and I’m sure that a lot of people who are familiar with smart contracts would agree with me that it’s not an intrusive change. Of course, you can’t entirely separate technical considerations and general governance considerations in the system. I’m not claiming that because it’s a technical MIP, there’s nothing to discuss outside of the technical. We still need to decide whether or not this is something the governance would potentially want to use and what the ramifications of that would be. However, some things are out of scope for this MIP and should be in scope for some further non-technical MIPs that would set governance abstractions and governance expectations for actually using this functionality. Effectively, this gives you the technical tools to create negative interest rates, but how you would use negative interest rates and how that modifies our current monetary policy process is up for discussion. It is possible to implement this MIP and not make use of it, but it would be ridiculous to say that you should consider technical MIPs on technical merits only. The next thing is that the changes proposed in this MIP are technically well understood because target price adjustment was part of the plan for multi-collateral Dai for a very long time. If you look in the purple paper or earlier implementations of multi-collateral Dai, they would include a module that would adjust Dai’s target price. This is not a new invention; this is an implementation of something that has been in the folklore for a while. Additionally, a lot of people don’t know if you look in Sai, in our previous iteration single collateral Dai, that had a target price module built into it from the beginning. It was dormant, because the parameter was set to zero, and as a result, it wasn’t making any target price adjustment. But it was always there, so that code was live. This is worth keeping in mind to do a sanity check of the technical implementation of the idea that this is a quite well-known thing. There’s been quite a lot of discussions about it, and there have also been posts in the forum about TRFM. TRFM is the old way of thinking about a target price adjustment where the price would adjust according to some algorithm.    Clarity on TRFM and TPAM  Now, I’d like to address the main difference between TRFM and what’s proposed in MIP20, TPAM, and target price adjustment module instead of the target rate feedback module. The only difference is that Target price adjustment is just a simpler version of target rate adjustment. It allows governance to set a rate parameter directly, which adjusts the price of Dai at a continuous rate over time. Compared to TRFM, which is a dynamic mechanism that tries to look at the market price of Dai, feeds it back into monetary policy and tries to adjust the rate of change of the price of Dai dynamically based on that. TRFM is a vastly more complicated thing, which is a lot more challenging to study. TPAM is an elementary version of it that allows us to set a fixed price adjustment similar to how we set a stability fee today. We don’t have any special algorithms for automatically adjusting the stability fee in real-time, which is say, it’s going to be 2% or 4% or 0%. Similarly, this will allow you to set a fixed rate, same sort of units, say 0% you can make it positive, 2% you can make it negative, and that’s the rate at which Dai’s price would adjust. If you look at actual MIP, there are obviously more details in discussions on why that’s effectively equivalent (or can be used) to create effective negative interest rates. Last comment about this MIP’s motivation: the monetary policy that we enact has this zero lower bound. We are unable to decrease stability fees on a collateral type below zero, even if we can use these negative base rates. The base rate is just an abstraction that allows you to set the stability fee lower than the risk premium on a collateral type, and it isn’t an actual negative interest rate. Negative interest rates are tricky, a particular case, because we can’t call back Dai from people who are holding it without, firstly, making changes to the core system and also really messing with how tokens work. I think that would be a terrible idea. Instead, we need something like TPAM, which accomplishes a negative interest rate by changing Dai’s price. And I’m happy to answer questions about that. Certainly, this is the most controversial thing about this proposal because it creates a departure from the world where people think of the target price of Dai as always being $1. Instead, Dai’s target price would be some value adjusting in real-time based on whatever governance has set the interest rate. If they were using it to enact negative interest rates, then it would be a negative rate, so Dai’s target price would slowly be going down from $1. This setting would presumably be used as a monetary policy tool to deal with situations like what we have today. Market equilibrium for Dai is still trading above the target we’d prefer. Now, I’d like to invite people to ask questions here. In the forum, we had a good discussion, but since it’s been in the RFC phase for about a month, we should have as many discussions as possible over the next month or two.  Discussion 17:12  Brian McMichael: Thanks, Lev! Just to second your point, technically, it shouldn’t be very controversial. I think the discussion is: “do we want to change the par value of Dai?”  Christopher Mooney: I have a technical question about the implications for implementers of this, people that have ever made, in our code or formal verifications, any wrong assumptions on Dai always being a dollar? Rather than doing a calculation of Dai and par. I wasn’t sure if there would be some rough edges on integrations, especially of immutable contracts that are already out there that may have made this wrong assumption. Lev: That’s a good question. When it comes to MakerDAO, to my knowledge, there is never an assumption one Dai is worth $1. Instead, this par value is always carefully used, or at least that is the intention. You shouldn’t see $1 hard-coded anywhere, that would be a bug even today when we are not adjusting par. In particular, one of the places is in the Global Settlement module, and you’ll see there that it carefully calls par from the spotter to make sure they were respecting the correct redemption value of Dai. I’m not aware of any other places where that needs consideration.  But I think your question is mainly about other integrations, for which it’s impossible to say of course, because we don’t know what they all are. A good thing would be to find examples of other projects relying on Dai for whom this would be a problem. Also, we have to remember that this is a monetary policy tool. The goal is to reduce the purchasing power volatility of Dai, ultimately making Dai price more predictable and less volatile. While the target price of Dai is adjusting away from $1, it’s an unpredicted change that you could see as volatility. Ultimately it’s done to reduce volatility. And when we are not able to do so with the conventional monetary policy available today, we’re also failing in that job. These other integrations that might be affected by this are also hurt by having Dai trade to $1.01 or $1.02 like it does today. So, it’s important to distinguish between integrations that rely on Dai being stable. The goal is undoubtedly for those integrations to be helped and not hindered by this. Because, ultimately, the goal of using negative interest rates is to stabilize Dai, compared to integrations that assume that the internal accounting value of Dai in MakerDAO is $1, which is the thing that we are sacrificing or changing. That’s a subtle distinction. Personally, I’m not aware of other systems making assumptions about MakerDAO’s internal accounting value of Dai.      Reversible System 20:50  Cyrus Younessi: Is this reversible? I have the impression that once you trigger this and Dai starts free-floating, you can’t have a do-over and go back to the old system. Is that accurate or not?  Lev: I’m delighted you asked this because there is a feature in this MIP, which is new,  that is not present in things like TRFM, which is prior to existing stuff: the ability to set a target price cap. I wanted to include this because it allows you to backpedal out of this target price adjustment later if we want to. The way that works in practice is: let’s say we want to do negative interest rates, so we set the target price adjustment to be -2% per year, that’s effectively a two percent negative interest rate on Dai; we can also set a target price cap of $1, which is the current target price.  Later, let’s say the monetary policy is in a different situation, and now we can normalize rates to be positive again. Let’s say maybe the farming mania stops or we start actually generating a lot of Dai from new real-world asset platform types and so on. Then we start setting positive rates again. Then we’ll be able to set a positive target price adjustment rate and combined with this $1 cap, what that will mean is, as soon as the target price of Dai comes again to $1, and this is assuming that we will actually have the positive interest rates back on for long enough that we would actually regain that lost ground. When it gets to $1, it will actually get capped at exactly $1, and then you can switch off the target price adjustment, and you’ll be back where you started, and the target price of Dai would be exactly $1. This means that if you wanted to have a target price adjustment to be positive again in the future, it allows you to walk it back and pretend that it is all a bad negative rate stream. Does that make sense?   Cyrus Younessi: Yes, basically, if it drifts below and then drifts back up, you can just cap it once it hits like this barrier that once it gets there, it freezes? Lev: Exactly. And then, if we set a target rate adjustment at that point, it would stop doing anything. If we set it to zero, it would be like we’ve never done anything, it would just be in there so we would be back to the situation we are in now. This assumes that if in the future we have positive rates, we would prefer to just basically go back to $1 and then stop doing this target price adjustment stuff rather than enacting positive rates to positive target price adjustment. That remains to be seen, but there’s a strong reason to believe that that’s available. Charlie Noyes: You mean positive target price adjustment above $1, right? Lev: Yes, I’m saying that we probably don’t want to make a positive target price adjustment above $1. Given today’s status quo, we would instead go back to just using stability fees, and that’s what this cap achieves. This switch is the main one of the main differences in this proposal. If we commit to implementing TRFM, we don’t have a clear way to come back to $1, that’s wandering off into space. This proposal is intended to address this concern by giving us a way back.    Governance at a Glance 25:25   Governance at a Glance - Forum Thread: If you have the time to read over and vote in active threads, that would be much appreciated.  Discussions   Liquidations System 1.2 Upgrade (Timeline)  The Maker Foundation proposes upgrades to the liquidation system with the support of the Risk and Smart Contracts domain teams to limit the amount of DAI that liquidates at one time. LongForWisdom: Mariano Conti has discussed this earlier. There is also a forum thread about this where Charles describes what it is and how it will change the liquidation system. I encourage everyone to read that if you haven’t already.    [Poll] Creation of a MakerDAO strategic reserves (solving the peg)  SebVentures suggests MakerDAO acquires strategic reserves to aid in monetary policy and lays out some pros and cons.    Collateral Onboarding Call: Bi-weekly on Wednesday at 17:00 UTC // 19:00 CET // 10am PST  spin and _LS share their intention to produce regular calls in which the Maker Community can engage with collateral partners. LongForWisdom: Lucas and Lea ran this call from Centrifuge. We had two collateral partners presenting who were New Silver and mrabino1. They discussed their company and proposal, which I think was super interesting. The call information is available here. I am aware that not everybody has time for two meetings every week. If you have a spare second and want to learn a bit about how we might add real estate as collateral on Maker, I would give it a watch.    Signal Requests   Add a Dai flash mint module  hexonaut opens a brief poll to gauge the support for adding flash-mint functionality to the Maker Protocol. The poll goes well, and hexonaut will be pursuing this as a Declaration of Intent under MIP13. LongForWisdom: This was received reasonably well to the point that we stopped the signal request and moved it to a MIP13 Declaration of Intent, which is currently on the forum. I encourage people to read over this and discuss the merits and potential downsides of flash-minting, which is very exciting.    Should we change the RPs for various collateral types?  befitsandpiper asks whether we should take the opportunity to adjust risk premiums for collateral assets when we can take advantage of the negative base rate to prevent peg impact.    Increase System Surplus Threshold  Aaron_Bartsch asks whether it is the right time to increase the system surplus threshold.    Increasing the ‘dust’ amount  Jiecut asks if the ‘dust’ parameter should be increased considering the sustained elevation in gas prices over the last few months.    Adjust the BAT Risk Premium and Debt Ceiling  Jiecut asks if the BAT-A risk premium and debt ceiling should be adjusted. Note that the BAT-A debt ceiling was changed in the most recent executive vote.    MIPs Charles St. Louis Weekly MIPs Update 28:43 MIPs update1064×617 84.6 KB  So this week is a shorter update, due to time constraints.  8/10 - 8-14 Activity1376×719 106 KB Next Week1367×724 115 KB Collaterral Onboarding1400×732 115 KB Le Fin1386×684 3.99 KB Discussion  Cyrus Younessi: LRC was rejected because of the vote of one holder, making it difficult to add a comment. I don’t want to speculate, I’m not sure if there was a particular part of the valuation that was not well received, but it would be nice to have some mechanism to solicit feedback from voters.  LongForWisdom: This is a problem we’ve seen before: it is hard for MKR holders to give feedback anonymously. For LRC specifically, I think I agree I don’t want to speculate, but it points to the importance of voting in the inclusion polls. Especially if you feel strongly about the assets in question. It’s possible that the rest of the MKR voters felt less passion for LRC and didn’t vote, especially since voting is a bit of a pain, and gas is high.    Vault Compensation Monet_Supply Vault Compensation Update 35:11 Cover Slide1293×711 73.7 KB  I’ll repost the presentation as well for reading later.  Forum post here.  Background1183×558 199 KB  Compensating in Dai: It’s going to impact liquidity when we have a credit crunch on Dai. I would like to see 100k plus MKR voting like the first vote back in April.  Changes1296×730 184 KB  This approach is about eliminating as many steps as possible to reduce Governance overhead.  Revised changes missing1423×772 51.3 KB Phase 01303×728 176 KB  This is where we are currently getting feedback, and figuring out the operating costs are to put this into action  Phase 11270×726 134 KB  In the previous Vault compensation plan, there were many parameters that MKR voters had to choose. The other difference is it consolidates the approval for the plan itself with the compensation. I wanted to do it this way because it’s tough to understand whether the last two bullet points were most relevant. If it was about not compensating at all or whether it was problems with the execution of the plan.  Example1147×618 146 KB Phase 21188×536 145 KB Phase 31189×415 80 KB  After 90 days, governance can self destruct the potential contract, take Dai back that wasn’t used for Op-Ex, and burn any unclaimed MKR.  Discussion Next Steps 42:11  ChrisP: If you guys lose the next vote, then do you keep submitting votes to governance, or at what point do we say this isn’t what we want to do. What’s the breakdown there? Monetsupply: If we get a decent turnout and the post for “I don’t want vault compensation” goes through, I think we are done. Mainly if it’s more than 60K that voted for vault compensation back in April, if it gets to the last bullet point where it’s supported in principle, that’s where it gets tougher and if that gets more than 50% support. Whoever is in support should probably get in touch and propose a plan of their own.  Final Votes Summary 44:00  MakerMan: The first point, we need a strong signal one way or the other. We’ve worked on this as a group, and we don’t have that clarity to settle one way or another. The second point, we changed the method to be this MKR method, and when you look at the numbers in percent, no vaults are going to get that actual percent in collateral compensation even with MKR<>DAI numbers at $250. Even when you see like 6%, no vault will get that, just how we altered compensation. If you wanted to give them 6% back, you’d vote for 12. We are doing this as a difference between what they got back, and what we want to give them is that if they got ETH back, they’ve already got the ride up, with some returns. If they’ve got nothing, then the question is, how much do they get? These numbers don’t reflect that; they reflect an attempt by picking a number to distribute the compensation equitably across all the people who didn’t get that percentage back. I’ll be voting my tiny amount of MKR because I would like to see and executive level of MKR participation on this, thank you, everyone! LFW: Thank you, Makerman and MonetSupply, to reiterate we’re getting to the point where this is dragging on. We need to know clearly if this is something people still want or have realized it isn’t worth the trouble. We just need that clarity; otherwise, this issue won’t go away. There is no real justification to just drop it entirely without a vote that says so because of the initial vote in favor. So we need a signal that helps us with a clear direction going forward. Thank you all for keeping that in mind.  The Choice of Dai  MakerMan: Forgot to articulate my last point: we chose MKR as the thing to compensate in is partially a suggestion on the forums but because it is easiest for governance to fund. When you look at the effective dilution, depending on the choice, it’s low, like a percent or lower. It seemed easier to hand vaults MKR and let them exchange instead of drop-kicking the Dai markets.  Double-compensating Users  Frank Cruz: You think there is a possibility that other folks don’t want to be involved due to the ongoing litigation? Do we consider these people to be double-dipping compensated by the community and the courts? Monetsupply: The compensation plan has a UI where, as part of claiming, you sign a disclaimer that you don’t sue MakerDAO or the Foundation. Legally they probably still could or maybe not.  ",
                    "links": [
                        "https://youtu.be/ZzEbuwyaZRQ?t=84",
                        "https://youtu.be/ZzEbuwyaZRQ?t=390",
                        "https://youtu.be/ZzEbuwyaZRQ?t=429",
                        "https://youtu.be/ZzEbuwyaZRQ?t=511",
                        "https://youtu.be/ZzEbuwyaZRQ?t=1525",
                        "https://youtu.be/ZzEbuwyaZRQ?t=1723",
                        "https://youtu.be/ZzEbuwyaZRQ?t=2111",
                        "https://youtu.be/ZzEbuwyaZRQ?t=3117",
                        "https://youtu.be/ZzEbuwyaZRQ",
                        "https://youtu.be/ZzEbuwyaZRQ",
                        "https://forum.makerdao.com/",
                        "https://youtu.be/ZzEbuwyaZRQ?t=84",
                        "https://forum.makerdao.com/t/liquidations-system-1-2-upgrade-timeline/3592",
                        "https://forum.makerdao.com/t/bug-in-2020-08-07-executive-spell-contract/3603",
                        "https://youtu.be/ZzEbuwyaZRQ?t=390",
                        "https://youtu.be/ZzEbuwyaZRQ?t=429",
                        "https://youtu.be/ZzEbuwyaZRQ?t=511",
                        "https://forum.makerdao.com/t/mip20-target-price-adjustment-module-vox/3196",
                        "https://youtu.be/ZzEbuwyaZRQ?t=1032",
                        "https://youtu.be/ZzEbuwyaZRQ?t=1250",
                        "https://youtu.be/ZzEbuwyaZRQ?t=1525",
                        "https://forum.makerdao.com/t/governance-at-a-glance/84",
                        "https://forum.makerdao.com/t/liquidations-system-1-2-upgrade-timeline/3592",
                        "https://forum.makerdao.com/t/liquidations-system-1-2-upgrade-timeline/3592",
                        "https://forum.makerdao.com/t/poll-creation-of-a-makerdao-strategic-reserves-solving-the-peg/3638",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-bi-weekly-on-wednesday-at-17-00-utc-19-00-cet-10am-pst/3614",
                        "https://forum.makerdao.com/t/agenda-discussion-collateral-onboarding-call-5-wednesday-august-12-17-00-utc/3623",
                        "https://forum.makerdao.com/t/signal-request-add-a-dai-flash-mint-module/3598",
                        "https://forum.makerdao.com/t/signal-request-should-we-change-the-rps-for-various-collateral-types/3484",
                        "https://forum.makerdao.com/t/signal-request-increase-system-surplus-threshold/3316",
                        "https://forum.makerdao.com/t/signal-request-increasing-the-dust-amount/3445",
                        "https://forum.makerdao.com/t/signal-request-adjust-the-bat-risk-premium-and-debt-ceiling/3334",
                        "https://youtu.be/ZzEbuwyaZRQ?t=1723",
                        "https://youtu.be/ZzEbuwyaZRQ?t=2111",
                        "https://forum.makerdao.com/t/vault-compensation-plan-v2/3584",
                        "https://youtu.be/ZzEbuwyaZRQ?t=2531",
                        "https://youtu.be/ZzEbuwyaZRQ?t=2640"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.342463778146918
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#6",
                    "likes": "2",
                    "time": "18/08/2020-01:48:48",
                    "content": " Analysis 52:00  Vishesh Choudry  Dai Supply1058×464 193 KB   At a high level, the Dai Supply is over 300 million Dai from ETH-A. About 2.7 million from BAT. ~50 Million from USDC and ~67 million from WBTC.   ETH-A Supply1002×520 56.4 KB   As far as ETH-A supply goes, this has continued to grow. You can track spikes and plateaus in the growth rate, which correlates to different yield farming opportunities.  We saw a continued base linear trend until early July 2020, where we saw a bit of a spike when the first yield farming opportunities cropped up. Then we saw a massive acceleration due to the YFI type opportunities (Early August), which have slowed in the past week. No recent project announcements in the last week have been too crazy in terms of Dai farming, at least compared to say 3-4 weeks ago. We will continue to watch as more of these opportunities continue to crop up.     USDC Supply993×493 73.4 KB   The USDC<>Dai supply since mid-July has been fluctuating a bit day-to-day. It is heavily used by large individual users making potentially short-term transactions. The long-term supply has stayed around 50 million. Trending upward, but very spikey - will continue to watch.   WBTC Supply1418×662 78.5 KB   WBTC is not entirely capped out. There is still about 13 million room in the DC there. There are these step-wise usage trends due to large users making transactions and capping it out. The amount minted is still sitting at around 66 million but has not been capped out. It is unclear if that is the amount of demand for minting Dai from WBTC that has already been met, or if there will be an increase as it has only been a couple of days.   BAT Supply1425×660 101 KB   BAT usage has varied with close to 3M Dai minted from BAT.   Recent Bat Use1418×664 75.3 KB   Zooming in more recently, it seems that a decent percent wise of that DC is utilized, and is, seemingly, well managed.   ETH collateral Portfolios1050×388 103 KB   Collateral portfolios: we have seen that the ETH collateral portfolio has gotten a bit less risky but also ETH price has gone up. In nominal terms, users have not done much with their collateral there, but naturally, the collateralizations have been pushed up.   ETH Liquidation Walls1056×316 48.2 KB   If you look at the ETH price around $240, you’d be liquidating 132 million Dai, and this is the largest wall. Probably the most significant thing to keep in mind and manage. Smaller walls are around $285 and $330 is not worth mentioning. You want to be decently concerned around an ETH price of $285. Even given a 400+ million Dai supply, a 33 Million liquidation is probably still significant for the amount of market liquidity out there.   Dai Price1396×561 335 KB   Another thing to keep in mind, the Dai price needs a perception adjustment. There were some crazy slippage events on August 10th on Uniswap and Oasis. Overall, in the last few days, there has been a lot more a sustained $1.01 price rising into the $1.02 range. This condition is a steady-state situation that we have been talking about prior; we’ve seen price rises to $1.03 or $1.04, even $1.06 during crazy events such as yield farming opportunities arrive. The presupposition is that we would resume normal levels when the yields come back down a bit, and that’s basically where we are at.   Trading Volume1037×435 180 KB   We’ve seen relatively large trading volumes in the last seven days between Dai<>ETH and DAI<>USDC. I don’t want to belabor too much; we’ve gone over the broad strokes and can double click on the things that we need to.    Of the 400 Million Dai, roughly 247 million is locked into the DSR by supplying to protocols and then being locked back up.   Dai on Compound939×108 22.3 KB   If you look at Compound, this is still a lion’s share chunk, with 250 million. Dai in Compound is dominating what is currently going on with the Dai supply.   Discussion/General QA  GUSD Networking 1:00:35  Monet supply: I’ve been emailing back and forth with someone from Gemini about gUSD, so if anyone has any questions that they would like me to pose to them, please let me know or reach out to me in the forum or what have you.   LRC Discussion 1:01:32  Aaron: What are the next steps for LRC now that it has failed?  LFW: Good question. The first is attempting to find out why it failed in the first place. There is always a chance that whoever voted it down will say something. Other than that, by the MIPs process, you can resubmit the same proposal or subproposal up to three times, without significant changes. If we wanted to, we need to process it again in the next cycle we could. I wouldn’t suggest doing so until we have some idea of why it was voted down or another person professing to be a large MKR holder wants to see it again as an emergency. If there are meaningful changes in liquidity or other things that can affect the risk parameters, it can trigger a re-evaluation. I don’t think this will happen immediately, though.     Voter Participation 1:04:20  Frank Cruz - How do we have any idea how to encourage more voter participation? (Hopefully, when there is no yam 2.0)  Chris p: I’ve seen people complain about the cost of people voting. And I’ve seen this is a governance project to combat this hurdle of small MKR token holder engagement. LFW: Good point. Gas prices are going to prevent most small MKR holders from voting, I would think. Derek from the foundation is working on a new version of the governance dashboard, which I believe may include batch voting to allow for votes toward multiple things in one transaction. I think that may help, at least. I think there have been a couple of posts on this topic in the forums. For instance, El pro posted about voters being reimbursed transaction fees incurred when voting. I’m not sure how it would work in practice, but it is worth discussing.     Loopring and Voter Participation 1:06:25  FC: I think that Loopring was a big disappointment. Specifically, because people put in some time and work into it, I think it was six individuals, and one individual with 17,000 MKR decided, as Cyrus said earlier. I won’t give my opinion, but I think we need to encourage more people to participate in the polls and somehow encourage them whether there are high gas fees or if we moved to L2, just to get them up there to vote. Or even post their opinion on the forum - the reason why they didn’t vote or the reason why they voted.  LFW: I think these are all excellent suggestions. It’s the sort of thing that I think, or I hope, that significant vote motion like this happening can help large Maker holders that if they don’t vote for things like collateral onboarding, then there is a good chance that something doesn’t happen. I kind of agree that it is disappointing since the LRC failed AFTER the work finished even though it passed the greenlight poll initially. But there is always a chance like this happens; the smart contract/risk/Oracle evaluations can change opinions. That is always that possibility.     Signed Transactions in Governance Calls 1:08:39  (chat from Aaron): \"What is wrong with doing signed transactions in gov calls?  LFW: I don’t know, I haven’t thought about it. Would defer to someone else. Josh Levine: It’s something we explored and something that we thought we would do the first time. The only thing that you lose is censorship resistance; whoever is aggregating the signatures can censor something. But what we are exploring now is the case where you do that as the happy path where you signed messages, and if someone suspects any censorship, then they go to on-chain as a fall-back. LFW: That sounds potentially great. I think we’ll call it there and thanks to everyone for joining. Hope to see everyone next week     Links from Chat  The poll on liquidations 1.2 passed   Relevant Links MCD System Stats DAI 24hr VWAP Graphs Maker Vault Stats  Common Abbreviated Terms MCD: The Multi-Collateral Dai system CR: Collateralization Ratio DC: Debt Ceiling ES: Emergency Shutdown EV: Executive Vote GF: Governance Facilitator GP: Governance Poll SF: Stability Fee DSR: Dai Savings Rate MIP: Maker Improvement Proposal  Credits  Artem Gordon produced this summary. Juan Guillen produced this summary. Gala produced this summary. Tim Black produced this summary. Anatta produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/ZzEbuwyaZRQ",
                        "https://youtu.be/ZzEbuwyaZRQ?t=3692",
                        "https://youtu.be/ZzEbuwyaZRQ?t=3865",
                        "https://youtu.be/ZzEbuwyaZRQ?t=3979",
                        "https://youtu.be/ZzEbuwyaZRQ?t=4113",
                        "https://vote.makerdao.com/polling-proposal/qmzaapfn5wxrqpk8pej9bepw1gxufmmndw96kgeufomjvd",
                        "http://daistats.com",
                        "http://dai.descipher.io/",
                        "http://makervaults.descipher.io/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.332014277771159
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-104-thursday-august-6-4-00-pm-utc/3469",
            "title": "[Agenda/Discussion] Scientific Governance and Risk #104 - Thursday, August 6 4:00 PM UTC ",
            "index": 3469,
            "category": [
                "Discontinued Categories",
                "Governance and Risk Meetings"
            ],
            "tags": [
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "1",
                    "time": "30/07/2020-17:55:18",
                    "content": "Agenda The zoom waiting room will be on, and a password is set to:  748478 , please ping us in chat if you aren’t let in from the waiting room. This Agenda will be updated over the following week leading up to the call as people make me aware they want segments. 2020-08-06T16:00:00Z Introduction   @LongForWisdom: Hosting, Introduction, Agenda.  Updates  Governance - @LongForWisdom: Governance at a Glance Smart Contracts Domain Oracles Domain Risk Domain Collateral Call - @spin  MIPs - Charles St. Louis : Weekly MIPs Update  Procedural   @Gov-Facilitators: MIPs Submission Review  Presentations   @Akiva: MIP13c3-SP1: Declaration of Intent (Forward Guidance)  Vishesh Choudry: State of the Peg  Discussion Topics   @equivrel: MIP20: Target Price Adjustment Module (Vox) - Postponed to next week. Continued Peg Deviation  General Q&A We’ll open the floor for any questions about Scientific Governance and Risk. Please join us and help shape the future of the MakerDAO. Links  Video/Voice  Dial-in  Calendar  Call Summary Will be provided here after the call as time allows. ",
                    "links": [
                        "https://twitter.com/visavishesh",
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/embed?src=makerdao.com_3efhm2ghipksegl009ktniomdk@group.calendar.google.com&ctz=America/Los_Angeles",
                        "https://forum.makerdao.com/t/maker-relay-ep-6/3517"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Governance",
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.36734693877551
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "1",
                    "time": "30/07/2020-17:56:01",
                    "content": "Episode 104: August 06, 2020 Agenda   00:43: Intro with LongForWisdom  02:41: Governance at a Glance with LongForWisdom  07:45: Smart Contracts Domain Team Update with Mariano Conti  08:18: Oracles Domain Team Update with Nik Kunkel  09:19: Risk Domain Team Update with Cyrus Younessi  10:24: Collateral Call update with Lucas Vogelsang  15:39: Weekly MIPs Update with Charles St. Louis  19:46: MIP Submission Review with LongForWisdom  21:55: MIP13c3-SP1 Presentation with Akiva Dubrofsky  29:40: State of the Peg with Vishesh Choudry  51:56: Discussion on Peg Deviation  Video https://youtu.be/ZLgbKyTHPY8 Introduction LongForWisdom Agenda and Preamble 00:43  Hello, everyone, welcome to 104th MakerDAO Scientific Governance and Risk meeting. Today is Thursday, August 6th. My name is LongForWisdom. I am one of the MakerDao Governance Facilitators. I am joined by a host of people interested in Maker. We have a fairly large agenda for today. Anybody is free to interrupt and ask questions during any point of this call. Discussions happen in the Forum.   Governance at a Glance LongForWisdom Forum Recap 02:41  We had a few interesting conversations this week on the forum. I feel like real-world assets have been a theme this week. I have seen some really interesting posts.  Governance at a Glance - Forum Thread: If you have the time to read over and vote in the active threads. That would be much appreciated.  Discussions   How MakerDAO can be a competitive lender in the Credit Tenant Lease marketplace by @mrabino1.  LongForWisdom: The post mrabino1 made explains what this is, which is fortunate because I have no idea. I encourage people to give it a read. It is quite a long post with some meaty discussion around it.    Initial Thoughts and Questions for Including Real-World Assets in the Maker Protocol by @g_dip.  LongForWisdom: We have some good discussion going on in here.    Subreddit Repost: Reducing Dai Redemption Value To Fix Peg by @FourthStreet.  LongForWisdom: I think this is thought-provoking compared to some of the other ideas. I encourage people to read this if they have a few minutes.    Signal Requests 04:10  A lot going on in the forums. I mentioned it last week, but it is still true this week.  Should Emergency Action be Taken to Raise the WBTC-A Debt Ceiling? by @jiecut.  Jiecut presents a signal toward increasing the wBTC debt ceiling as an emergency measure to further help the Dai peg. As most of you know, it is still slightly above peg as we have been for the last few months. This signal has already met the participation and consensus requirements to take place as an emergency measure and will be included in the executive on August 07th along with the base rate change. I believe those are the only two things slated for this week’s executive. I encourage people to vote on that thread and discuss it even though we have already figured out what is happening.    Should we change the RPs for various collateral types? by @befitsandpiper.  befitsandpiper asks whether we should take the opportunity to adjust risk premiums for collateral assets at a time where we can take advantage of the negative base rate to prevent peg impact. LongForWisdom: Because we reduced the base rate to 4%, we can change the collateral type of risk premium without directly affecting the stability fee. It’s a good opportunity to change them without messing around with the peg or affecting anything concretely. That’s a good way to set ourselves up for something in the future. Cyrus Younessi: To clarify, the point of setting the risk premium, although the stability fee wouldn’t change. I think the idea is that in the future when rates do start to go back up, we won’t have to go back to change individual assets. The base rate adjustment should be sufficient, right? LongForWisdom: Yes, that’s the hope, which is to set them to sensible values so that when we’re in a position, we can raise the base rates and that everything kind of works out nicely with the risk-adjusted values.    Increase System Surplus Threshold by @Aaron_Bartsch.  Aaron asks whether it is the right time to increase the system surplus threshold.    Increasing the ‘dust’ amount by @Jiecut.  Jiecut asks if the ‘dust’ parameter should be increased considering the sustained elevation in gas prices over the last few months.    Adjust the BAT Risk Premium and Debt Ceiling by @Jiecut.  Jiecut also asks if the BAT-A risk premium and debt ceiling should be adjusted. Note that the BAT-A debt ceiling was changed in the most recent executive vote.    Increase ETH-A Risk Premium by @Aaron_Bartsch.  Aaron is also asking whether we should adjust the ETH-A risk premium.    Add ETH-B Vault by @Aaron_Bartsch.  Aaron polls the community around the introduction of an ETH-B Vault type. Worth noting once again that outside of emergencies, collateral onboarding needs to happen through the monthly governance cycle, but this can serve as an indicator to sentiment for the domain teams. LongForWisdom: Although the last two signals passed, they depend on the winning options that leave this in the hands of the risk team. Cyrus Younessi: We saw the forum polls on the ETH-A risk premium and the ETH-B collateral type as well. We spoke with the team about it yesterday. We are working on it. Stay tuned.    Should MKR be added as collateral? by @Aaron_Bartsch.  Aaron does some initial polling around the inclusion of MKR as collateral. Worth noting that outside of emergencies, collateral onboarding needs to happen through the monthly governance cycle, but this can serve as an indicator of sentiment for the domain teams. LongForWisdom: This failed to pass. People tend to vote against this.    Smart Contracts Domain Team Update Mariano Conti Smart Contracts Domain Team Update 07:45  I don’t think there’s anything too interesting unless anybody thinks of anything.  We are still talking to the TrueUSD team, and we will have more updates soon on that. Other than that, there is nothing urgent.  Oracles Domain Team Update Nik Kunkel Oracles Domain Team Update 08:22  We have a polling vote coming up on Monday for potentially adding MyCrypto as a light feed. If you want to review that proposal you can view it on the Maker forum.  Next week I will be submitting a few oracle-related proposals. One of them being a change for the quorum. We’ve been adding a few light-feeds consistently in the past few months, so we have a lot more, but we haven’t ever really changed the quorum since we started, so I think we can safely raise that now and boost the security a little bit.  Risk Domain Team Update Cyrus Younessi Risk Domain Team Update 09:23  We submitted MIP12 for blueprint for the LRC token yesterday onto the forums. Later this week, today or tomorrow, we should see submissions for PAX and USDT (or Tether). Then, on the backlog for some time, in the next few weeks, there is LINK (or Chainlink). That is a mini-update on collateral evaluations from us.  Collateral Onboarding Call Update Lucas Vogelsand Collateral Onboarding Call 10:27  For anyone who hasn’t been or hasn’t heard about them, we have been intermittently doing collateral onboarding calls. They started leading up to the first MIP8 or MIP9 votes to talk through some of the different collateral types. And we, me and Lea from our team, are starting to kick them off again. We were doing them as part of the Maker Community to create a forum to talk about governance and risk topics that are not governance and risk topics yet because those collateral types are still very early on the stage. But of course, hopefully, the idea of this call is that the Maker Community can get a better understanding and see what’s coming. For the format that we’re going to start experimenting with, which is open for feedback, we will do a call on Wednesday at 5:00 pm UTC for roughly an hour every two weeks. The first one will be next week, where we will ask two projects to give a quick presentation on the collateral that they are interested in submitting or getting included in MCD, maybe some slides to get a good overview on a particular topic and following that twenty minutes of discussion. So ten minutes of slides, twenty minutes of discussion, times two, should get us roughly to an hour. We will be keeping this as open as possible, inviting anyone to join, both those who are presenting in the call but also those who just want to participate in the discussion. If you have a collateral type that you think should be discussed, we will be setting up a process for how to request it, and most likely this will just be a forum thread where you can submit that you want to get on and we’ll do our best to fit people in and hopefully see many of you guys on the call next week, on August 12th.  Discussion 1  LongForWisdom: I think that having a collateral focused call it’s going to become almost a requirement as we continue. Not to say everyone always needs to show up, feel free to pick and choose things that you are interested in, but we’re getting to a point where many points of collateral types are being submitted, it’s easy to miss the point on how collateral types can potentially be useful. These calls will hopefully help the community to get a better understanding of some of the more exotic applicants or assets. befitsandpiper: Didn’t we already have an onboarding collateral call?  LongForWisdom: Yes, Lucas ran a few previously intermittently. Lucas Vogelsang: We’ve done this in a less formal way; we have had an almost two-month-break. We’re kicking them off again with the new wave of MIP6 applications and all of the activity. I think it’s a good thing to start having them again; it will be very similar. We’ll post the recordings in the forum. I can’t commit to doing summaries myself, but it would be great if someone does want to volunteer to put down some notes and keep an archive for everyone else to see. LongForWisdom: Juan just said he would do summaries, which is very nice of him.    MIPs Charles St. Louis Weekly MIPs Update 16:10 Cover Page1227×594 197 KB This Week&#39;s Activity1398×725 117 KB  Akiva will talk about the Declaration of Intent later in this call. Loopring’s collateral onboarding application includes the work requirements from the Risk, Smart Contracts, and Oracle’s teams.  Next Week&#39;s Activity1378×579 88.4 KB Collateral Onboarding1377×743 136 KB  The collateral that failed greenlight polls could still go on, it’s just a signal for the domain teams to gauge sentiment with respect to the community on what they think are great collateral types to be added to the Protocol.  MIP17 Working Group1384×621 77.6 KB Join the community1118×572 33.6 KB LongForWisdom (Governance Facilitator) MIP Submission Review 19:44  The formal submission review is a chance for Governance Facilitators to say which MIPs have been fully submitted and whether they are going to continue to inclusion polls. As Charles said, there have been three sub-proposals submitted.  Off-boarding Rich Brown as a Governance Facilitator  One to off-board Rich Brown as Governance Facilitator. To be clear this is more of a formality to officially remove Rich from his position in terms of the MIPs and the DAO as opposed to the Foundation. I would suggest everyone votes in favor of this, even if you like Rich because it’s a proposal to reflect the reality of the situation. If we all vote against, it’s not really going to change anything; it’s just going to mean that someone technically has permission to do things when they really shouldn’t do.  Loopring Collateral Onboarding Sub-Proposal  Another one, as Charles mentioned, is the LRC collateral onboarding sub-proposal.   Declaration of Intent  The last one is Akiva’s MIP13c3-SP1 sub-proposal, which is a Declaration of Intent.  All Submissions Included  All three submissions seem fine to me and will continue to the Inclusion Polls next week.  Akiva Dubrofsky Declaration of Intent Sub-Proposal 22:00 Cover988×615 26.2 KB  This is a presentation on MIP13, Component 3, Subproposal 1, under LongForWisdom’s Declaration of Intent MIP. I wrote this myself and with my business partner, Vitaly.  Mission Statement1135×611 127 KB  Risk parameters are moving a lot today. For Vault holders, it’s not entirely clear why they’re being changed. It sometimes feels that it’s not fair to them.  The problem1361×694 33.8 KB  We’re going to see later that the real economy does aim for stability in many respects. If we’re asking if Maker can reach its growth objectives, we have to think if Maker can interoperate with the real economy. Can it provide stability not just to Dai holders, but also provide stability to vault users.  Control Panel1361×626 223 KB  Central banks are always looking to create optimal stability, sometimes there are unstable reference rates like LIBOR, and those can also be hedged. If Maker is trying to act like a central bank, then Maker should also optimize for stability.  Vault Holder Advocacy Group1422×685 271 KB  That is why we have created the Vault Holder Advocacy Group, and I want to specify that this is a sell-side initiative. Until today, anything that has happened in MakerDAO has been buy-side initiatives. Meaning all groups are representing MKR holders. We’re laying the groundwork here of what is to become sell-side groups, where these groups are not compensated by MKR holders, but they are groups representing Vault users. Its intention is that sell-side groups work together with buy-side groups, each representing their own best interest, to achieve mutual goals.  Variables1393×728 81.5 KB  When we think of the factors that can change risk parameters, this goes back to Steven Becker’s series on governance and risk. There are:  Endogenous: Variables related to a collateral type. We would look at what variables can change in terms of collateral types, such as the custodian, the volatility, and the liquidity. Part of the job of the group would be to identify these and advocate for guidance on these variables from the risk teams. Exogenous: Related to what’s happening in other markets, and we can maybe make inferences of related risks from other things happening in the market and how that relates to the collateral types in a collateral portfolio. System-Related: A subcategory of exogenous. For example, monetary policy can influence risk premiums.   Just like we introduced a separation of concern, where risk parameters should be considered separate from monetary policy, this should actually not be in the voting construct of risk premium and base rate. This should actually be a governance-wide mandate where we separate monetary policy decisions from risk decisions.  Milestones1407×706 43.8 KB  We are going into the August cycle now. If we can get that, we’re going to create a working group by inviting everyone in September. Hopefully, we will have some forward guidance in October. If we do this, hopefully, by 2021, we can start to see the development of the sell-side domain teams, which will increase the maturity of MakerDAO.  Why now?1392×719 264 KB  Corporate users predictability. Corporate users can’t justify changes like this to their board, where interest rates are going all over the place.  Contact1127×483 58.8 KB Discussion 2 Declaration of Intent 27:23  LongForWisdom: How the Declaration of Intent fits with this? I guess it’s the creation of this group and an intention to take into account the group results when it comes back with suggestions?  Akiva Dubrofsky: It’s exactly that. We just want to know that MakerDAO is going to take the results of the working group seriously. We want to know that we can have some influence in bringing stability to Vault users.    ",
                    "links": [
                        "https://youtu.be/ZLgbKyTHPY8?t=161",
                        "https://youtu.be/ZLgbKyTHPY8?t=465",
                        "https://youtu.be/ZLgbKyTHPY8?t=498",
                        "https://youtu.be/ZLgbKyTHPY8?t=559",
                        "https://youtu.be/ZLgbKyTHPY8?t=624",
                        "https://youtu.be/ZLgbKyTHPY8?t=939",
                        "https://youtu.be/ZLgbKyTHPY8?t=1186https://youtu.be/ZLgbKyTHPY8?t=1186",
                        "https://youtu.be/ZLgbKyTHPY8?t=1315",
                        "https://youtu.be/ZLgbKyTHPY8?t=1780",
                        "https://youtu.be/ZLgbKyTHPY8?t=3116",
                        "https://youtu.be/ZLgbKyTHPY8",
                        "https://youtu.be/ZLgbKyTHPY8?t=43",
                        "https://forum.makerdao.com/",
                        "https://youtu.be/ZLgbKyTHPY8?t=161",
                        "https://forum.makerdao.com/t/governance-at-a-glance/84",
                        "https://forum.makerdao.com/t/how-makerdao-can-be-a-competitive-lender-in-the-credit-tenant-lease-marketplace/3521",
                        "https://forum.makerdao.com/t/initial-thoughts-and-questions-for-including-real-world-assets-in-the-maker-protocol/3511",
                        "https://forum.makerdao.com/t/subreddit-repost-reducing-dai-redemption-value-to-fix-peg/3525",
                        "https://youtu.be/ZLgbKyTHPY8?t=250",
                        "https://forum.makerdao.com/t/signal-request-should-emergency-action-be-taken-to-raise-the-wbtc-a-debt-ceiling/3519",
                        "https://forum.makerdao.com/t/signal-request-should-we-change-the-rps-for-various-collateral-types/3484",
                        "https://forum.makerdao.com/t/signal-request-increase-system-surplus-threshold/3316",
                        "https://forum.makerdao.com/t/signal-request-increasing-the-dust-amount/3445",
                        "https://forum.makerdao.com/t/signal-request-adjust-the-bat-risk-premium-and-debt-ceiling/3334",
                        "https://forum.makerdao.com/t/signal-request-increase-eth-a-risk-premium/3377",
                        "https://forum.makerdao.com/t/signal-request-add-eth-b-vault/3349",
                        "https://forum.makerdao.com/t/signal-request-should-mkr-be-added-as-collateral/3350",
                        "https://youtu.be/ZLgbKyTHPY8?t=465",
                        "https://youtu.be/ZLgbKyTHPY8?t=502",
                        "https://forum.makerdao.com/t/mip10c14-sp6-proposal-appoint-mycrypto-as-a-light-feed/3383/2",
                        "https://forum.makerdao.com/c/oracles/13",
                        "https://youtu.be/ZLgbKyTHPY8?t=563",
                        "https://forum.makerdao.com/t/lrc-mip12c2-sp2-collateral-onboarding-risk-evaluation/3549",
                        "https://youtu.be/ZLgbKyTHPY8?t=627",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-bi-weekly-on-wednesday-at-17-00-utc-19-00-cet-10am-pst/3614",
                        "https://youtu.be/ZLgbKyTHPY8?t=970",
                        "https://youtu.be/ZLgbKyTHPY8?t=1184",
                        "https://forum.makerdao.com/t/mip0c13-sp1-subproposal-for-core-personnel-offboarding/3508",
                        "https://forum.makerdao.com/t/mip12c2-sp4-domain-work-requirements-for-lrc/3558",
                        "https://forum.makerdao.com/t/mip13c3-sp1-declaration-of-intent-forward-guidance/3130",
                        "https://youtu.be/ZLgbKyTHPY8?t=1320",
                        "https://blog.makerdao.com/makerdao-governance-risk-framework/",
                        "https://youtu.be/ZLgbKyTHPY8?t=1643"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.62449584023658
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "0",
                    "time": "30/07/2020-17:56:07",
                    "content": " Risk  Vishesh Choudry  Relevant Links MCD System Stats DAI 24hr VWAP Graphs Maker Vault Stats  The State of the Peg 30:26  1422×673 192 KB   We had a steady-state of about $1.01. Started to see a price run-up explained as a function of yield farming activity and drawing up liquidity for Dai. Basically ending a lot of arbitrage on 07/26.   1204×466 197 KB   The mental calculus has been that as more Dai is minted, anyone who is market making on Dai has the variables: “I can make a 2, 3, maybe 4% profit in the short-term vs. a 600% annualized yield.” If you think about that yield, that is a 2-3% yield a day. Which means in a couple of days, you could make your money back with a different kind of risk compared to arbing the peg. Obviously, a different kind of risk, with un-audited smart contracts and new activities, but you’re also theoretically not holding the bag on some Dai risk. It’s a differential type of risk and theoretically a yield that is just as, if not more, attractive. You can see why there is very little arbitrage in these time frames. Also, a lot of liquidity of Dai is drying up and being dumped into these yield farming protocols. You see a dip back in the Dai peg, coinciding with the end of major yield opportunities with the YFI farming pools.   1235×503 211 KB   Hard to tell whether this rise in Dai price is coinciding with increased yields on Compound versus forks of the YFI farming pool. Around this time frame, we saw 40-60 million Dai sitting in the YFI fork Balancer pool. That dried up too, coinciding with a drop in Dai price. The trend is a spike around an opportunity and then subsequent drop back down to a normalized price, which makes a lot of sense if you think about the circumstance. As these yield farming opportunities dry up, and you see volumes shift back to stable, long-term opportunities like Compound; though there is a discussion about the time frame there, it’s certainly longer than these other fixed-timeframe YFI type farming opportunities. When short-term yield farming goes away, peg returns to a steady state sitting a bit above $1.01. There is a lot of common sense reasoning about why Dai is above a dollar. It goes back to if you have 1 USD and have access to 1 USDC or 1 Dai, which one would you rather try to hold? Would you swap 1 USDC for 1 Dai for farming/supplying to platforms for yield, etc.? The answer is, for a lot of people, yes. Not only that, but for $1.05 USD, they will still buy it. Paying the extra cent premium is worth it to:  Get these extra yields. Pay down debt. Pay to have access to the call option on the illiquidity of Dai. People realize that if I buy Dai and hold it, for when Dai price goes up (liquidity, liquidation), they can make money.   Users are arbing up the peg even when it is above a dollar. Dai is heavily used and limited supply compared to say USDC, it’s a staple in DeFi. When you put together limited supply and high demand, it makes sense that the asset carries a premium. Dai also gives access to passive yield opportunities simply by holding it, so it makes sense that people put a premium on Dai. There is a broader conversation beyond SF changes in regard to maintaining Dai. Those fees don’t control the long term premium on Dai. The long term premium comes from the fundamental nature of how the asset works, how it’s used, and its supply. In regards to the scale of the supply, the scale of hundreds of millions and not billions, that scale causes it to run up quickly when it is stressed if you think about liquidity on the open market versus transaction volume. We’ve known that Dai is a comparatively illiquid asset for a while, and once it was demonstrated that you could arbitrage it effectively, it did not stay below peg for a while. Now, we’re on the flip side of that scenario where Dai has so many uses and access to so much passive yield it stays elevated. In the past, being bullish on ETH led to Dai price going down as people tried to lever up on ETH, selling Dai, and making the price go down. Now, it is interesting to see that all of these supply sinks (or demand generators) are now more prominent drivers of Dai price. It’s a different model of how Dai is used as opposed to its history with ETH. This means we must have a broader conversation for Dai use. Ideally, that conversation will address monetary policy to address Dai’s use for high-profit opportunities. It is currently cheap and easy to mint, which has led to large volumes of it being minted and being primarily supplied to yield farming opportunities.   1375×493 240 KB   Total supply of 364 million Dai Total. With a total of 568 million possible DC. Dai from ETH 282 million, Dai from BAT 2.6 million, not capped out. 47 million dai from USDC, not capped out.   1384×581 356 KB   40 million dai from WBTC, capped out. Smaller amounts from all the other vault types.   1430×669 78.4 KB   Looking at WBTC supply as the ceiling moved, it got capped out pretty quickly.   BAT1236×567 51.2 KB   BAT<>Dai supply shot up again in late August because of yield farming opportunities in July.   ETH1234×576 59.1 KB   ETH has shown a steady linear growth pattern since MCD launch. It was transposed down after the March 12th event. Despite that, the trend resumed. This suddenly accelerated as yield opportunities became more attractive for Dai. There is a huge interest in using ETH as collateral to maintain exposure to that asset while minting Dai for yield opportunities. It has shot-up to 290 million rather quickly over July and more recently. Whether this is a continuing stable demand for Dai or whether it is a short-term craze for the yield opportunities that exist is still a question. My personal rule of thumb is to expect that when things shoot up, suddenly, they have a chance to come down suddenly. If these yield opportunities dry up or have a different asset as their primary target, we will have to consider whether demand is sticky or transient. If 130+ million Dai is dumped on the market, we’ll be dealing with a different peg problem.   1403×664 87.4 KB   As far as USDC, it’s been more fickle with several actors moving overall supply. Primarily used by traders since it’s the most profitable/least risk asset to mint Dai. Especially since it’s less than ETH. It’s 47 million now.   1016×647 169 KB   We’re looking at 270 million Dai being supplied on Compound, which is a significant chunk of the 374 million that exists. More of half of that is on Compound.   1262×696 272 KB   There is this Balancer pool of the YFI fork that dropped 40 million dai in there, jumped to 60, and then back down to 16 million.   1009×692 167 KB   About five million in the curve Dai pool and more sitting out in significant yield pools. That’s why we spend a lot of time talking about yield pools and where the Dai supply is and where it’s going. It’s a huge chunk of the equation at the moment. There are topics to be discussed, whether it’s good or bad, and what impact that has on the peg long term. Also, whether the supply of Dai and how that supply is used is taking liquidity from other potential use cases, alongside the risk that it creates. There are some outstanding ideas on what risk and for whom, and what benefits it generates. Limited amount of insolvency that MKR can cover. MKR exits to be an insurance policy as Dai and collateral pool grows. As the Dai supply continues to grow, the risk that the insurance from MKR underwriting continues to grow. Ironically, during that same time frame, the premium that insurance policy generates is at zero. How much can you underwrite that risk continuing to grow? There’s a conversation around the peg: are these monetary tools really moving the peg at all? Or is the peg moving at its own accord from external factors? It’s IMHO the latter. The SF has a very small fee over time and in comparative percentage terms small. Even if there was a higher fee on the ETH Collateral portfolio, it’s not a very large fee compared to the risks of yield that those Dai holders are taking on when they use that Dai in the first place. In the grand scheme of things, I would not expect that SF is significantly impacting how Dai is used. Is it the right tool for the right job right now? Or is there a conversation to be had about other mechanisms to put in place and better arb or control the peg to keep it stable. The simple answer is during these time frames, the amount of Dai sitting on order books above a dollar is a proxy for how much market making you would have to undertake to arb the peg back down to a dollar. Theoretically, there is a number of money you could mint to sell and arb the peg back down, purchase that Dai back afterward, and prep for the next swing. Continually making that large scale market activity. The problem is that it is less profitable than things you can do with that capital on the Dai portfolio. That profitability is what makes it difficult to keep the peg stable at the moment. Obviously, you want to bifurcate that discussion from the .01 premium that exists over time. What to do about it? Why does it exist? Do we understand why that exists? Are there things to be done about it? By no stretch is this a simple conversation. There is a lot going on here; the first and most important thing is to ask the right questions.   Discussion 3  The Impact on MKR of Trapped Dai in an External Protocol 51:56  Nosagie: Assuming there is some hack, a lot of the Dai that’s been used in these performing protocols becomes inaccessible?  Vishesh: It’s a little tough, but you asked if there’s a hack on one of these platforms, is the MKR cap high enough to cover that risk. Very complex question there. We can touch on what are the complexities involved; I’m not going to pretend to sit here and give you a simple yes or no answer. If you think about it, say 210 million excess Dai supply on Compound. If there is some critical failure in Compound and all of that 210 million was at risk and insolvent. What the market cap of MKR is, it’s not as simple as saying, “is the market cap of MKR greater than that amount?” And let’s say, all of that value is lost tomorrow, it’s not a question about knowing if the MKR could cover that. It’s a question of, what is the subsequent series of dominoes, how much of a hit would the MKR price take if an event like that occurred if there is a large mass liquidation event, is there first some impermanent loss to the MKR price? We have seen this before when the DeFi community knows that the MKR is going to take a hit in terms of losses, there is some injury to the MKR price. And we saw a lot of this occurring before when we had to have those secondary auctions for MKR, etc. There is some math to be done in terms of how much the market cap can cover. I think it’s the correct question to be asking right now. What kind of risk is ballooning as the supply continues to grow and continues to be locked up in three or four contracts? As far as the technical question of how risky are those contracts, that is not something that I can pretend to be able to answer. You want to have really well-versed smart contract developers to talk about the contracts that are out there, how good they are, some percentage value of how risky they might be. Again, a lot of the time, risk evaluation is going to be relative work. It’s how risky something is compared to something that we all expect. At the end of the day, I think, that’s how a lot of pricing works, what is expected and what is unexpected, and it’s about identifying how far out of what is expected in terms of risk or loss would a contract really go. There is an embedded complex smart contract evaluation question there as well. You can also look at it common sense-wise, if you have 374 million of an asset and 210 million is in one contract, and something goes wrong with that one, there would be a huge potential loss event. So you have to think about how much of that risk you are willing to take on and compare it to a multiple of the current market cap of MKR and what ratio you are really comfortable with. Because, at the end of the day, a lot of that risk management is about what ratios are the community or the shareholders comfortable with.     Types of Actions to Bring Down the Peg 56:20  Nosagie: Assuming this yield farming craze goes on for a long period of time, do we have any emergency solutions, or are we just going to have to sit with the peg staying above one?  Vishesh: Not sure what you mean by emergency solutions. Because there have been a number of emergency actions that the community has taken, but I think that it would be good to have a holistic conversation around the types of actions that are being taken in terms of moving stability fees, moving debt ceilings, introducing more assets. Are those sufficient measures for bringing the peg back down to a dollar, do you expect the peg to come back down to a dollar, even with all those measures in a short to medium time frame, is this the long term aspect of how Dai works now or are there other measures that you need to put in place to help bring that down? I’m not sure it’s necessarily appropriate to call that emergency actions, and that’s a conversation for the community to be had, so I don’t want to call out that assumption, but it very well could be, it’s a community call on that.     Flooding the Market with Dai 58:28  Gregory Di Prisco: Right now, it feels like we are very reactionary when I think we would be doing ourselves a service to be more proactive. What I mean by that is, everybody is uncomfortable with raising debt ceilings at a very rapid pace and sometimes for a good reason, but they are especially uncomfortable with it because we are not getting compensated for this with stability fees. A potential solution is to make ourselves more uncomfortable temporarily to solve the problem almost permanently. What I mean is, you would raise the USDC debt ceiling quite high and incentivize people to use that facility, and that would flood the market with Dai in the short term. As we’ve seen via this yield farming craze, is that the demand is not instant, the demand has been growing almost linearly with time, as far as I can tell, where new entrants into the market want the yield, and then the Dai demand goes up incrementally. If we were to give the market a lot of Dai very fast, I think the peg would go below a dollar. Once the peg is below a dollar, you can put stability fees up, and you can manage further supply-demand proactively. Then, I believe, we could grow the supply with a positive stability fee. Basically, it raises the baseline by putting it at a new normal.  Vishesh: In theory, yes, flooding the market with Dai supply theoretically achieves your goals. But how do you intend to proactively get a bunch of Dai flooded onto the market? Because right now, you are not even maxing out all of your debt ceilings that have been raised.     Lowering the Collateral Ratio 1:00:31  Gregory Di Prisco: My idea would be to keep USDC at a 101% collateral ratio and make a non-binding commitment to keep the stability fee at zero for the foreseeable future until it’s maxed out.  Vishesh: Lowering the collateral ratio… Again, the backdrop of all of this is in pretty much everything you are talking about, is some form of increased risk, so that should be an important backdrop, theoretically, lowering the collateral ratio of USDC is one way to improve the amount of utilization of the existing debt ceiling and that part makes sense, but I don’t necessarily think that would be enough. If you are talking about flooding the market with more Dai liquidity to help bring the peg back down, there are two assumptions that are inherent there. One of the problems, there’s been a significant increase in debt ceilings and also a hugely significant increase in mintings, but when that Dai is created, it doesn’t make it into the open market. It just goes and gets deposited in more yield farming opportunities. I really love the suggestion to start thinking about this proactively instead of reactively, because I think that it has been a huge problem. A lot of the actions that have been taken in terms of peg management are pretty reactive. My question is: how do you proactively catalyze more market-making activity?     Collateralization Ration as a Form of Debt Ceiling 1:02:40  Gregory Di Prisco: I want to point out that, whatever the collateralization ratio is on USDC, that effectively puts a ceiling on the Dai price. Because if you are a yield farmer, you are not going to buy Dai for a $1.02 if you can mint it at $1.01.  Vishesh: There will always be people that would rather purchase it than hold USDC and deposit it and mint it in the Maker smart contract. That bucket will always exist, but I get what you are saying for sure. Currently, by and large, the Dai price does seem to sit around $1.01 when it’s not being stressed by crazy yield farming opportunities, so wouldn’t it then just continue to sit at $1.01? Gregory Di Prisco: I don’t think so, but I would like to hear some other opinions too. Sam MacPherson: There’s an interesting effect if we put out a hard cap on the price; it may provide a shelling point such that people may be more inclined to short-sell before that point.     Unexplored Consequences of Low Collateralization Ratios 1:04:25  Cyrus: For me, there are unexplored consequences of super-low liquidation ratios. I just think it needs some careful thoughts before we go that far. Things like liquidations, stability fee accrual, oracle live price feeds. I don’t know if it came across clearly to everyone, but essentially what a low liquidation for USDC does is it allows users to deposit their USDC, draw Dai, and walk away. They essentially abandon their vaults. The good thing is that the liquidation ratio puts a cap on the Dai price because it’s essentially in a closed-loop arbitrage. The downside is that there will be all these abandoned vaults in the protocol, and we don’t really have a very clear action plan on that going forward beyond that. So that’s my immediate concern.   Proactive Peg Management 1:06:16  Andy Tulhope: Vishesh, you were about to give us some insights on what you feel it would be proactive peg management and we got sidetracked again into the debt ceiling. Would you perhaps have any further comments on what you think would constitute responsible, proactive management of the peg?  Vishesh: I feel like people think I’m always on the cusp of giving a silver bullet answer. I don’t think we’ve necessarily come up with a good comprehensive solution that solves all the problems and also maintains really good risk management. That’s because a lot of the problems and the solutions that we are talking about are inherently an increase of risk in exchange for an attempt to solve a problem. That’s a mental calculus that the community is going to have to do in terms of the level of comfort. As far as proactive peg management, currently, if you just increase the debt ceiling or lower the liquidation ratio, which does increase utilization on a percentage basis. Let’s say you’ve done that and it hasn’t solved the peg problem, what is the solution? I’m just asking to ask this question of what actual direct management solution is put in place where you are either yourself arbitraging the peg or causing someone to arbitrage the peg. Right now the core problem is nobody wants to mint dai and sell at $1.01 because a) there are far more profitable things they can be doing with their capital or b) they are concerned that they are going to be sitting there holding that bag for a while before the peg returns back to or below a dollar. I see a lot of indirect solutions, but what are the more proactive and direct solutions to that question? I’m not giving you the answer; I’m just trying to make sure we are asking the right question. Happy to answer anything further.     Uncertainty Hinders Arbitrage 1:09:23  Wil Barnes: We don’t reliably return to the 1:1 parity, I think we did it only once during crop rotations, and I think it would make sense if we did that often, but we don’t. So the sticking point you just said about owning bags for however long is probably one of the big things people don’t really know when we’ll be back in parity or even below parity. You can’t arbitrage the peg if you don’t know when it will be back in parity. Chris Mooney summarized it nicely: we do go back to it eventually; we went to it last week after all the YFI yield farming was over, but we didn’t save it for very long, and then we went back up. So, I think that if people were going to go mint Dai or if you are going to arb the peg back down, you basically have their collateral sitting in a vault until it’s arbed and then people just may be sitting on that collateral with risk however long until we go down to peg.   Is 1.01 the Current Floor? 1:10:44  Vishesh: Brian brings up this question in the chat, and I think it is a very legitimate question, “is a $1.01 the current floor?” Post YFI farming, although there is a lot of slippage and trades coming back down below a dollar, it wasn’t even long enough to make it into a 24-hour volume-weighted average price, so that average price did not hit parity even though individual trades did. That is an important point to consider. As far as Brian’s question is a $1.01 the steady-state and how hard are you trying to push it back down to a dollar. There is a counter to that question, which is the way the system is defined, the peg is one dollar, so if there is a disconnect between the way the peg is defined in the system and what the peg is realistically on the market, what does that do to the confidence in the system. Those are the two things to consider: how hard are you going to push yourself to squeeze the peg from $1.01 to $1 versus what is the narrative disconnect between a steady stated $1.01 and the system definition of $1.   Raising the WBTC Debt Ceiling by 100 Million 1:12:43  JoeQ’s: This is a function of yield farming. My idea is to go and bump the WBTC market cap by 100 million. What does that do? You have a 100 million Dai come on the market, is that all going to be absorbed by the yield farming? No. And the reason why it’s going to come on the market to sell Dai is they are going to sell and Dai for USD, because they’re borrowing bitcoin at zero meanwhile the interest rate arbitrage versus the overall market is around six to eight percent. So, we’ll fill up the vault dramatically and bring down the peg big time. There may not be a 100 million we can vote on as governance and community, but I think that MKR holders can bring down the peg pretty fast.  LongForWisdom: There is currently a signal request to increase DC for WBTC, scheduled for Friday. The exact amount is still in debate. I think 80 million was the maximum on that signal. befitsandpiper: 80 million DC is already almost all of the WBTC supply. If we increase it to 100 million, are there ramifications about increasing the DC beyond the current supply? LongForWisdom: One point is the total capital of WBTC can expand fairly easily, I think. Wil Barnes: No one is arbing the peg. I’ll concede that we did not touch the peg. It was at parity for a brief time. It’s been four and a half months now since we’ve been able to maintain the peg for just a reasonable period of time, so no one is going to even bother to arb the peg, in my opinion. Sam MacPherson: I see the WBTC total supply at 200 million. befitsandpiper: Right now, it says we have a utilization rate of about 40% on Dai Stats. I don’t know how often that is updated. Sam MacPherson: Is that of the total supply or how much Dai is minted from that? LongForWisdom: There are two Utilization metrics. Percentage of the debt ceiling used and percentage of the total supply locked in Maker. Mariano Conti: Utilization is at 100%. There’s 40 million Dai from WBTC, with a 40 million DC. That is about 10% of the total Dai supply, assuming 400 million Dai. And 43% of all WBTC is locked up. So almost half is locked in Maker. Sam: I was not accounting for CR ratio. You’re correct. We would be at around 80% of the supply if we doubled it.     Outro  LongForWisdom: I would encourage people to ask longer form questions on the forum and just, in general, to have more discussion on there as well. We’ve had many suggestions on the call today that I’d love to see as a signal or as discussions. We’ll leave it there for today and hope to see you all next week!   Common Abbreviated Terms MCD: The Multi-Collateral Dai system CR: Collateralization Ratio DC: Debt Ceiling ES: Emergency Shutdown EV: Executive Vote GF: Governance Facilitator GP: Governance Poll RP: Risk Premium SF: Stability Fee DSR: Dai Savings Rate MIP: Maker Improvement Proposal  Credits  David Utrobin produced this summary. Artem Gordon produced this summary. Igor Teslya produced this summary. Gala produced this summary. Juan Guillen produced this summary. Tim Black produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "http://dai.descipher.io/",
                        "http://makervaults.descipher.io/",
                        "https://youtu.be/ZLgbKyTHPY8?t=1826",
                        "https://youtu.be/ZLgbKyTHPY8?t=3116",
                        "https://youtu.be/ZLgbKyTHPY8?t=3380",
                        "https://youtu.be/ZLgbKyTHPY8?t=3508",
                        "https://youtu.be/ZLgbKyTHPY8?t=3631",
                        "https://youtu.be/ZLgbKyTHPY8?t=3760",
                        "https://youtu.be/ZLgbKyTHPY8?t=3865",
                        "https://youtu.be/ZLgbKyTHPY8?t=3976",
                        "https://youtu.be/ZLgbKyTHPY8?t=4163",
                        "https://youtu.be/ZLgbKyTHPY8?t=4244",
                        "https://youtu.be/ZLgbKyTHPY8?t=4374",
                        "https://forum.makerdao.com/t/signal-request-should-emergency-action-be-taken-to-raise-the-wbtc-a-debt-ceiling/3519",
                        "https://daistats.com"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.500984472929305
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "06/08/2020-15:39:25",
                    "content": "Bump for visibility. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "2518"
}