{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/pre-mip-discussion-rwa-foundations/9510",
            "title": "Pre-MIP discussion - RWA Foundations ",
            "index": 9510,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "legal",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "15",
                    "time": "25/07/2021-10:18:27",
                    "content": " Context Following the work that we are @christiancdpetersen is doing on designing a legal structure for RWA (here and here), we are soon to release the documents describing a Cayman Foundation and a MIP to formalize the communication between the DAO and the Cayman Foundation (the WIP MIP is located here but not finished yet). While SolarX is used for the proof of concept, this structure could be used for most RWA collaterals where the MIP6 isn’t addressing the legal structure. This component should speed up RWA onboarding a lot. This post is a way to get feedback from the community on the overall structure and on some open questions in order to be able to change the structure if needed. What is presented here is already the 3rd iteration. I would recommend that we keep it high level, leaving discussion on details with the MIP post (which should go live in early August).  Description The overall structure is to have a Cayman Foundation holding SPVs (Special Purpose Vehicle), most likely one per project. The SPV will be simple structures like member-managed Delaware LLC (i.e. the Cayman Foundation controls and manage the SPV). The Cayman Foundation is the bridge between the real world and DeFi (Maker Protocol and MakerDAO).  image592×511 5.95 KB  For the management, the current plan is to have servicing companies taking the role of supervisor and director (those are distinct roles, but we can summarize that both run the Foundation). How much power they will have is a discussion point. Nevertheless, while it remains to be seen what they agree to do, one can expect that they will not take any non-obvious action anyway and request guidance. Those servicing companies can be supplemented by a committee of MakerDAO members. Those will be able to instruct the directors to act on some predefined items. They will not have any power to represent the Foundation by themselves. Here is a list of actions we suggest the committee could instruct the directors  Notify the borrower of a default; Take any time-sensitive measures to protect lender rights; Immaterial (non-monetary) waivers under financing agreements; Immaterial (non-monetary) amendments under financing agreements; Administrative matters to maintain SPV security (UCC filings, renewals); Authorize payments of administrative fees, costs and expenses for loan management.  There are also some items that the servicing companies will not want to carry, especially for things that are outside of their jurisdiction. For that, we introduce the authorized signers. Authorized signers can sign for the Foundation for things that are delegated to them. It can be a one-time delegation (like open a bank account) or something open-ended. There is also a cost element to it as using directors to do things might be way more expensive.  Discussion points  How much control does the DAO want to keep? It is our view that we need at least to give delegate power to supervisors and directors to pay the bills and do whatever is need to keep the lights on in the Cayman Foundation (and the underlying SPVs). More tricky is the power delegation to the committee and the authorized signers. We can make that evolve with time. But do we start a bit too wide to get things running or by not even having a committee nor authorized signers? If MakerDAO confirms 6S in the interim, should we start with similar specific powers to authorized signers? Who should be on the committee? Who should be authorized signers?  Is a MakerDAO executive the source of truth? The proposed structure gives full power to MakerDAO through executed spells. We haven’t figured any reason why that would be risky but this is a point that worries me. But if someone can execute a MakerDAO spell against the will of MKR holders, what happens for the Foundation is probably not our main problem. A provision like having the ability for the committee to delay directors’ actions by one week might be enough. Happy to have other thoughts on this one.  What if MakerDAO goes dark? There is a plan to add resolutions for the case where MakerDAO is not responding or is no longer alive. For instance, if MakerDAO fails to appoint a director that is resigning, the supervisor will appoint an interim director (and vice-versa).  Should we have many Foundations? I would say one is enough as it is unclear what protection have duplicate bring. This reduces cost (as a % of “assets under management”) as well with scale. But it doesn’t cost much to leave room for an upgraded version of the legal construct. Happy to discuss others topics as well related to this legal structure. ",
                    "links": [
                        "https://forum.makerdao.com/t/real-world-asset-legal-structure/9093",
                        "https://github.com/SebVentures/mips/blob/rwa-foundation/MIP58/MIP58.md",
                        "https://forum.makerdao.com/t/rwa001-a-rwa-international-ltd-resolutions/7725",
                        "https://forum.makerdao.com/t/weekly-mips-update-54/10398",
                        "https://forum.makerdao.com/t/weekly-mips-update-53/10310",
                        "https://forum.makerdao.com/t/weekly-mips-update-52/10192",
                        "https://forum.makerdao.com/t/weekly-mips-update-51/10079",
                        "https://forum.makerdao.com/t/weekly-mips-update-50/9992",
                        "https://forum.makerdao.com/t/maker-relay-ep-58-en-espanol/9949",
                        "https://forum.makerdao.com/t/maker-relay-ep-58/9892",
                        "https://forum.makerdao.com/t/weekly-mips-update-49/9890",
                        "https://forum.makerdao.com/t/maker-relay-ep-56-en-espanol/9812",
                        "https://forum.makerdao.com/t/informal-poll-using-the-cayman-foundation-to-invest-in-financials-assets-at-scale/9790/5",
                        "https://forum.makerdao.com/t/weekly-mips-update-48/9757",
                        "https://forum.makerdao.com/t/maker-relay-ep-55-en-espanol/9715",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-152-thursday-july-29-17-00-utc/9553/3",
                        "https://forum.makerdao.com/t/mipxx-rwa-foundations/9680/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-56/9649",
                        "https://forum.makerdao.com/t/weekly-mips-update-47/9648",
                        "https://forum.makerdao.com/t/lets-talk-liquidity-rewards-that-maker-is-entitled-to-but-we-arent-collecting/9624/3",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/45",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-152-thursday-july-29-17-00-utc/9553/5",
                        "https://forum.makerdao.com/t/forum-at-a-glance-july-23-29/9583",
                        "https://forum.makerdao.com/t/weekly-mips-update-46/9532",
                        "https://forum.makerdao.com/t/maker-relay-ep-55/9531",
                        "https://forum.makerdao.com/t/real-world-finance-core-unit-report-2021-07/9658",
                        "https://forum.makerdao.com/t/rwa-foundation-hvb-disclosure/16267/10",
                        "https://forum.makerdao.com/t/weekly-mips-update-61/11523",
                        "https://forum.makerdao.com/t/weekly-mips-update-60/11347",
                        "https://forum.makerdao.com/t/weekly-mips-update-59/11186",
                        "https://forum.makerdao.com/t/weekly-mips-update-58/11074",
                        "https://forum.makerdao.com/t/weekly-mips-update-57/10921",
                        "https://forum.makerdao.com/t/weekly-mips-update-56/10691",
                        "https://forum.makerdao.com/t/weekly-mips-update-55/10539"
                    ],
                    "GPT-summary": "The author of the post is presenting a legal structure for RWA (Real World Assets) and seeking feedback from the community. The proposed structure involves a Cayman Foundation holding SPVs (Special Purpose Vehicle) for RWA collaterals. The post discusses the roles of servicing companies, a committee of MakerDAO members, and authorized signers in managing the Foundation. The author raises questions about the level of control the DAO should have, the composition of the committee and authorized signers, and the potential risks of giving full power to MakerDAO.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.707830537518037
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NH98",
                    "index": "#4",
                    "likes": "2",
                    "time": "25/07/2021-21:12:22",
                    "content": "Thanks for the write-up @SebVentures.     SebVentures:  While SolarX is used for the proof of concept, this structure could be used for most RWA collaterals where the MIP6 isn’t addressing the legal structure. This component should speed up RWA onboarding a lot.   Just wondering, do we have a comparative as to how long a traditional lending facility for projects such as Solar X takes to complete the process from A to Z? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.678571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#5",
                    "likes": "2",
                    "time": "26/07/2021-11:54:50",
                    "content": "Each transaction will be different and will depend on (1) borrower’s familiarity with the Maker process, (2) borrower’s level of preparedness (external advisors (if needed), 3rd party servicers, etc.), and (3) nature of transaction and transaction risks. In my view, it will expedite matters if the borrower proposes a thought-out and well structured transaction. It is critical for the borrowers to be proactive in structuring the deal (this is not the same as being aggressive). Using the FoundationCo and a Delaware LLC as the “lender” is very easy. Setting up a new Delaware LLC owned by FoundationCo for each transaction takes very little time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.284966856060605
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "0",
                    "time": "26/07/2021-12:54:47",
                    "content": "Is the main purpose of the Cayman Foundation to provide a party that can enforce creditor rights, or is it mainly to avoid taxable events within the US? Is there a way to remove the foundation and SPVs from the handling of cash so borrower can access their own vaults to borrow/repay? It seems like a lot of additional risk to add intermediaries between the vault and borrower if there is not a compelling reason to do so. Even with Centrifuge Issuers, the Issuer has access to their vault and does not need permission to borrow or repay, which is convenient and also just reduces embezzlement risk and “bus factor” by shortening the chain of hands that have to touch the money. What are the ballpark expenses for adding multiples of this structure rather than a single foundation with lots of activity underneath it? Is it prohibitive, or just non-negligible? I’m a bit leery of having a single point of failure in a single foundation if there’s a way to silo the control of each of these away from each other. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.070767195767196
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NH98",
                    "index": "#7",
                    "likes": "3",
                    "time": "26/07/2021-13:27:03",
                    "content": "Thanks for the answer @christiancdpetersen. I guess I’m just trying to wrap my head around what distinguishes Maker as a lender for RWA projects versus traditional alternatives. In my understanding there are few things: (1) Economic incentives: The rate of the loan is obviously a huge factor, and maybe projects are ready to absorb some element of “DeFi” risk for lower rates. This also may include the other costs of doing business. (2) Regulatory incentives: Maybe the borrower cannot use traditional facilities due to its history, track record (or lack thereof), few things that maybe Maker can waive due to its flexibility in procedures. (3) Ideological/Psychological incentives: The borrower might be interested in doing business with a crypto-native project due to personal interests or as an experiment.  There also might be some advantages in partnering with a DAO? Finally, there is always a component that borrowers might be onboarded by individuals they trust that are already part of Maker (I believe this is what @g_dip does?) (4) Process incentives: This is what I’m interested in figuring out. Does Maker want to distinguish itself by its ease of process and speed? If complications are required due to Maker being a DAO, then other elements should be stronger. Correct me if I’m wrong, but it seems like Maker can offer competitive rates and still turn a profit due to its low cost base. Hence, priority should be targeted towards economic incentives and not simplifying the process at the cost of safety in controls. I’m not a lawyer so I don’t understand everything “process-wise” but that would be my initial reaction. Anyone feel free to chime in. I will also ask people I know in the solar business who went through traditional facilities about what they think. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.773148148148148
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#8",
                    "likes": "2",
                    "time": "26/07/2021-20:25:10",
                    "content": "    PaperImperium:  What are the ballpark expenses for adding multiples of this structure rather than a single foundation with lots of activity underneath it? Is it prohibitive, or just non-negligible?   We will update when we will have an estimate. There is also a link with how much we ask the directors to be involved. I would say that besides the cost you also have the risk of mismanaging many Foundations. Hard to keep track of everything. The purpose of the Cayman Foundation is to use a great legal system. And yeah, that allows us to enforce creditors’ rights (but any legal entity would solve that). @NH98 I would say it’s a bit nuanced. Most of the people we are speaking with are crypto enthusiasts. Some are fairly small and wouldn’t be able to get proper funding. Securitization works starting from 50M and banks loans would be expensive and complicated to get. Others are bigger and there is a PR component to it. At least 2 are willing to provide better term that what they would get because it’s PR and strategic. But process is super complex right now. Legal and structuring part is not easy. Governance is quite stressful (maybe gates where it’s unclear how the decision is taken). This is somewhat counterbalanced with the fact that we provide credit facility and when you get one, we don’t ask to much on a deal per deal basis. I think our strategic advantage is not so much in economics and clearly not in the process. It’s that we provide access to a new source of capital, DeFi. While we can compete on economics right now (as we have 60% USDC), this will not work at scale. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.502029220779221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#9",
                    "likes": "1",
                    "time": "27/07/2021-11:39:05",
                    "content": "Interesting quote by Shuli Ren of Bloomberg news: “Does Beijing not care how much money foreign investors have lost? Does the government really want to close China Inc.’s access to the deep pool of global capital? The short answer is, no, the government doesn’t care. But it’s not that simple. Beijing is pursuing other goals: reining in the power of its tech titans and boosting startups; protecting social equality; and making sure the cost of living in cities isn’t so high that families aren’t willing to have children. And Beijing is suspicious of companies that are skilled at raising capital overseas—beyond its watchful eye. There’s one practice it’s especially concerned about: a variable interest entity (VIE) corporate structure commonly deployed by the hottest unicorns. Often incorporated in the Cayman Islands, these startups raise capital and list their shares offshore. The money raised, in turn, gets pumped into China for business developments.” What happens when other governments start to crack the whip on offshore entities based in the Cayman Islands? @christiancdpetersen pivot to Panama? ",
                    "links": [
                        "https://www.bloomberg.com/news/articles/2021-07-08/tech-crackdown-sees-investors-eyeing-china-s-consumer-startups",
                        "https://www.bloomberg.com/news/articles/2021-07-20/china-aims-to-lower-child-expenses-in-effort-to-boost-birth-rate"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.463425925925925
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#10",
                    "likes": "3",
                    "time": "28/07/2021-00:24:54",
                    "content": "I think it depends. There is always a political risk with any low-tax, offshore jurisdiction – Mauritius, UAE, Caymans, Bermuda, Panama, etc. I am not sure if Panama will provide the organizational flexibility offered by the Cayman Islands. Panama is a civil law country and, from my experience, corporate structures may not be as accommodating. The advantage with the Foundation Company structure is that it does not require a shareholder and, by and large, we can address governance issues in a creative manner. Which is helpful when dealing with a DAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.464285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#11",
                    "likes": "0",
                    "time": "28/07/2021-00:55:09",
                    "content": "Is there a reason we wouldn’t be able to separate the actual flow of cash from the monitoring/enforcement duties of this structure? It seems less risky to have as few intermediaries as possible between the DAO and the borrower. If the foundation + SPVs are to provide an entity to sign and enforce agreements, I’m not sure we need the actual DAI to flow through them? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#12",
                    "likes": "5",
                    "time": "28/07/2021-08:39:20",
                    "content": "Some very good work here. I like the direction. I somewhat think developing a general (yet hopefully specific and detailed) framework for control, governance, enforcement, delegation, tax intent, licensing/regulatory etc etc for how the DAO would like to manage RWA’s generally would be good idea. I have a sense that, given the broader aspirations for RWA growth and diversity, there will ultimately be numerous legal structures - each handling certain unique issues with certain specific RWA opportunities. Seems more likely than trying to fit all into a few ‘swiss army knife’ structures - at the very least here at the beginning of this RWA strategy. Many of the RWA projects today seem to be proposed with unique legal structures already as far as I can tell. By developing above robust framework, it would be easier to provide guidance to the RWA projects - and ultimately easier to make an informed decisions on these RWA projects by the community. (now obviously if this framework already exist, please do point me to it and forgive my lack of such basic knowledge - I am still novice here) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.884340659340658
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#13",
                    "likes": "1",
                    "time": "29/07/2021-00:42:46",
                    "content": "As a contractual matter, I think you might need to show the contractual touch points between the applicable parties for purposes of accounting and tax. I am not an accountant, but the first place I would check would be the contracts – is party A contractually entitled to receive funds from party B? If the contractual support is sufficient, then I do not see any issue with Party A contractually telling Party B to pay funds to Account 1 (which may not be a Party A account). I think the threshold matter is an accounting consideration. So, I think you can probably have fewer touch points (as suggested), but the contractual support might need to be there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#14",
                    "likes": "1",
                    "time": "29/07/2021-00:51:33",
                    "content": "I agree that there are multiple approaches and potential structures. But there is one central question - namely Maker’s involvement in key decisions or non key decisions. Ultimately, all loans require some level of administration and, based on experience, no matter how thoughtful you draft the agreements, you will not have covered every eventually. So, the question is what types of decisions does Maker (directly or indirectly) want to have input on? I would imagine for immaterial waivers … the answer is no. For material waivers or other actions … I suspect yes. Then the question is “what is material” or what is not immaterial? To that end, I have been scoping out some of those distinctions. I would be happy to share my brainstorming. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5874999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#15",
                    "likes": "0",
                    "time": "29/07/2021-01:22:51",
                    "content": "    christiancdpetersen:  So, I think you can probably have fewer touch points (as suggested), but the contractual support might need to be there.   I think this is worth exploring, unless there’s a compelling reason not to. Even if it’s a bit extra effort to set up, it just seems like it would remove liability for us to lose funds in transit and lower embezzlement risk and “bus factor.” We do not currently handle the DAI for any borrowers, but then again, we don’t have any actual legal agreements with any borrowers. So I’ll admit I’m also unfamiliar with whether or not the DAO agent supervising the agreement needs to also be the DAO agent that disburses funding. My guess is we can make it so they are not the same, and that additional separation would make me personally much more inclined to experiment with the structure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#16",
                    "likes": "1",
                    "time": "29/07/2021-01:34:02",
                    "content": "I think you can separate them. The critical question is the “discretion” or not given to the DAO agents to “disburse funding” or “supervise the agreement”. This too is more or less solvable for the most common “discretions” in the administration of a loan as long as the agreement spells them out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.402777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#17",
                    "likes": "2",
                    "time": "29/07/2021-04:25:27",
                    "content": "One quick question on the potential Cayman foundation. Have you all confronted the issue of whether the activity engaged in by this foundation would require it to register as a virtual asset service provider under the recently Cayman-enacted regulation? My presumption is that so long as the foundation only provides this service to a wholly-owned subsidiary, it likely falls outside the VASP qualification but you may want to look into that issue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.2023809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#18",
                    "likes": "1",
                    "time": "30/07/2021-08:13:07",
                    "content": "Regarding VASP, indeed, it is the view of our advisors that the RWA Foundation would be outside the scope. This might not be the case if we used this structure for MakerDAO as a whole. On an unrelated note, I also want to add that no MKR holder (or consortium, i.e. delegate) should have more than 50% MKR voting powers (ping @GovAlpha-Core-Unit for awareness). Otherwise, that person might fall under the beneficial ownership regime (as he can appoint himself as a supervisor when he wishes). We don’t see any escape from that if we want to retain some control of the Foundation by Maker. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#19",
                    "likes": "1",
                    "time": "30/07/2021-12:30:03",
                    "content": "Hm would this be 50% of the total tokens or average voting power? I don’t foresee individual delegates getting to 500k MKR, but 35k seems reasonable in a success scenario. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3500000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#20",
                    "likes": "1",
                    "time": "30/07/2021-12:44:40",
                    "content": "    prose11:  I don’t foresee individual delegates getting to 500k MKR, but 35k seems reasonable in a success scenario.   Probably needs to be a separate thread, but will there be a way for delegates to establish a cap or even un-delegate MKR? It’s not clear yet how liability for decision making will end up if one person can unilaterally push through things, and I can forsee some people not wanting to bear that liability given the lack of corporate veil. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.958333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#21",
                    "likes": "0",
                    "time": "31/07/2021-15:11:26",
                    "content": "I think you’re referring to 50% of the active MKR voting (or, in the voting contract), as oppose to 460,000 MKR  — but yea, Delegates will be lucky to get a decent percentage allocated. Fingers crossed  I have confidence that we will. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#22",
                    "likes": "1",
                    "time": "31/07/2021-15:38:30",
                    "content": "Thanks for this, and I’m glad to hear you all went through this analysis. On the DAO and a legal wrapper in total, there may be some workable solutions but it seems preferable to set up these entities on the periphery first before moving to what the DAO is or should be legally speaking. That could be a contentious and prolonged discussion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#23",
                    "likes": "0",
                    "time": "01/08/2021-06:53:58",
                    "content": "    prose11:  Hm would this be 50% of the total tokens or average voting power? I don’t foresee individual delegates getting to 500k MKR, but 35k seems reasonable in a success scenario.   50% of total circulating tokens. There might be some case law that show it can start earlier (like one person deciding of all vote for a few years might be enough). But in any case, in my view, not something that (decentralized) Maker would love anyway (and a bigger problem for the DAO that the RWA part of the problem). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.295454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fernando_Verboonen",
                    "index": "#24",
                    "likes": "2",
                    "time": "10/08/2021-10:13:18",
                    "content": "    christiancdpetersen:  Panama is a civil law country and, from my experience, corporate structures may not be as accommodating. The advantage with the Foundation Company structure is that it does not require a shareholder and, by and large, we can address governance issues in a creative manner. Which is helpful when dealing with a   Alternatively, once may well explore Switzerland / Liechtenstein given it positions today already as the “crypto valley” and there is an actual law known as Blockchain law which actively pursues to bring a complaint framework to digital assets. I would happy to support on this front end with introductions and so forth. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.675595238095238
                }
            ]
        }
    ]
}