{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/in-the-case-where-an-emergency-technical-change-to-the-dcs-is-required-should-we-skip-monetary-policy-changes-in-that-weeks-executive-vote/929",
            "title": "In the case where an emergency technical change to the DCS is required, should we skip monetary policy changes in that weeks executive vote? ",
            "index": 929,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "executive-bundling"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "2",
                    "time": "10/12/2019-01:01:37",
                    "content": "Given the recent blogpost and the requirement for us to activate the Governance Security Module, can we agree that we should skip monetary policy changes in the executive vote either in this specific case, or in the case of emergencies generally. To be clear, this would mean disregarding the monetary policy polls entirely for the week in question and running them next week as usual. I would suggest that this is a positive step which will increase the speed and uptake of the emergency fix, without the risk of divided opinions due to monetary policy issues.     In the case that an executive vote includes emergency technical changes, we should include monetary policy changes in that executive (as per usual). In the case that an executive vote includes emergency technical changes, we should not include monetary policy changes in that weeks executive (instead skipping monetary policy changes for that week). We should skip monetary policy changes for this week due to this specific emergency only. Abstain (I just want to see results) Abstain (I have no opinion) Abstain (I don’t feel I am knowledgeable on the subject) Abstain (I disagree with the poll options) Abstain (I have a different objection)     0 voters     Edit: Just realised I’ve reversed the logic somewhere between the title and the actual poll option. Too late to change it now. Sorry all. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-how-do-we-handle-executive-bundling-in-relation-to-technical-changes/965"
                    ],
                    "GPT-summary": "The author of the post is proposing to skip monetary policy changes in the executive vote in case of an emergency technical change to the DCS. The post also includes a poll with different options for the readers to choose from. The post does not advertise the proposal, nor does it contain entirely positive or negative feedback.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.594787157287158
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "1",
                    "time": "10/12/2019-01:23:22",
                    "content": "Is it really a requirement to activate the GSM because this “exploit” has been made public? Nothing has changed and I’d argue that we are not at more risk today than yesterday. That may be naive but I just don’t see the reason to panic right now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.685714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "1",
                    "time": "10/12/2019-01:27:55",
                    "content": "I am having a hard time on this one. Personally my gut reaction is votes related to ‘emergency issues’ have to override other basic operational issues.  But I also thought the idea of making ‘quick changes’ to anything was the reason for the current vote to up the gsm to 24hrs. The following questions come to mind:  Is the current situation an emergency or simply exposure to threat? Does Maker need to act more quickly than usual to address the situation? Does Maker want to put a hold on monetary changes to do these other actions? How fast does Maker expect ‘who’ or ‘whom’ to act ‘how’, ‘when’ generally.?  I consider these all distinct questions at this point and as an newcomer still diging into details of the system I’m going to Abstain as not feeling knowledgeable on the subject and defer to those with more expertise and experience here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.256944444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "1",
                    "time": "10/12/2019-01:38:25",
                    "content": "So I asked Cyrus and Wouter this question: “since the blogpost, do you think that the risk of the attack is now greater than the technical risk caused by having the delay active?” @cyrus “the GSM is going in now specifically because the increased attention has flipped the risk profiles” Wouter’s answer is harder to quote without the context: @wouter “felix just provided you with the answer. Telegraphing intention to attack “for the lulz” is the first necessary step towards an actual undercover attack.” (This was in reference to a twitter poll that felix posted illustrating that some twitter users were discussing the attack vector) In general, it seemed that the answer was “Yes”. As far as I’m concerned they are the experts, personally I think the attack is still unlikely, but I don’t have a great insight into the likelihood of technical problems so I’m willing to follow their lead. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.51923076923077
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#5",
                    "likes": "2",
                    "time": "10/12/2019-01:47:55",
                    "content": "Fair enough, thanks for the answer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#6",
                    "likes": "6",
                    "time": "10/12/2019-05:33:53",
                    "content": "Just want to remind people, we are very, very close (weeks? maybe a couple months?) from having Instant Access Modules, which would mean that monetary policy would no longer have to routinely go through executive votes (only for extreme changes). In the meantime, however, I think it would be helpful to prioritize securing the system rather than dealing with monetary policy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.8225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#7",
                    "likes": "1",
                    "time": "10/12/2019-12:33:25",
                    "content": "    cyrus:  Just want to remind people, we are very, very close (weeks? maybe a couple months?) from having Instant Access Modules, which would mean that monetary policy would no longer have to routinely go through executive votes   Where could i get more info about IAMs? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.559374999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#8",
                    "likes": "2",
                    "time": "11/12/2019-10:25:37",
                    "content": "obligatory, weeks not months ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#9",
                    "likes": "0",
                    "time": "11/12/2019-11:49:44",
                    "content": "Not sure either, since the * Activating Security Module* would need to have as a main goal to protect every assets all of the money actually. Seems too easy to me but we here and this is happening to make some changes. We should talk about it much. Its a big concerns i think. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "0",
                    "time": "15/12/2019-23:06:05",
                    "content": "This signal thread has moved to: Signal Request: How do we handle executive bundling in relation to technical changes? I am now going to lock this thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "0",
                    "time": "15/12/2019-23:06:09",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}