{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/let-the-world-know-that-makerdao-is-the-best/2360",
            "title": "Let the world know that MakerDao is the best! ",
            "index": 2360,
            "category": [
                "Governance"
            ],
            "tags": [
                "marketing"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Piervanni",
                    "index": "#1",
                    "likes": "4",
                    "time": "04/05/2020-10:19:35",
                    "content": "At the moment MakerDao is the best “lending platform” out there. You can get a loan with Ethereum as collateral at 0.00% interest, and with Bitcoin at 1.00%. Competition doesn’t even come close: 4.50% - BlockFi; 11.90% - Nexo (5.90% if paid with their token); 6.26% - Celsius; 5.95% - Salt Lending. However, even considering that those who borrow through these platforms pay immensely more interest than with a loan on MakerDao, those platforms “claim” to have originated loan volumes dozens of times larger than MakerDao. The difference between MakerDao and these others is not only the interest rate, but the awareness of the existence of the platform. Those private companies spend hundreds of thousands of dollars each month on marketing, and even considering that they have a worse product, they manage to have a critical mass of users. So I think that MakerDao should establish a long-term budget for marketing. There are many people who would use a loan with DAI, however, the technical barrier prevents it. So the creation of step-by-step guides could facilitate the entry of new users.  There are some services that I am aware of that sell marketing packages: https://cryptocoin.news/wp-content/uploads/2019/06/29m-PR-Marketing-Package-4.95k-1.pdf https://bitcoinprbuzz.com/services/ NOTE: I am not affiliated with them, and I have no interest in promoting them (it’s just to give an idea of what’s available).  Furthermore, there are many problems that would be solved through the increase of users, for example the PEG would be a minor problem if the DAI supply were 1 Billion instead of the only 100M, this because there would be much more liquidity on the system and the creation/redemption of a single CDP would have less impact. ",
                    "links": [
                        "https://bitcoinprbuzz.com/services/"
                    ],
                    "GPT-summary": "The author explains why MakerDao is the best lending platform and suggests that the company should establish a long-term budget for marketing to increase awareness and attract more users. The author also suggests creating step-by-step guides to facilitate the entry of new users. The post includes links to marketing packages but clarifies that the author is not affiliated with them. The post also mentions that an increase in users would solve many problems, such as the PEG.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.078491683754842
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#2",
                    "likes": "3",
                    "time": "04/05/2020-10:43:08",
                    "content": "What about those whose collateral was sold for $0 on black Thursday? I’m not sure they think MakerDAO is the best system in the world (maybe they wish they borrowed from Compound etc.). Some importanat things need to be fixed before doing paid marketing IMO. The peg is also back to $1.01 on Coinbase which is not good for marketing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piervanni",
                    "index": "#3",
                    "likes": "0",
                    "time": "04/05/2020-11:54:55",
                    "content": "You’re totally right, there are still many problems to fix, but I think everything can be used to our advantage. For example, the fact that DAI is at $1.01 can be an advertising move to incentivize more people to take out a loan (hoping for a return to $1.00). You’re also right for the “Black Thursday Event” … I asked on the official Nexo telegram channel what are the advantages of using Nexo vs MakerDao, and here is the answer:  However, I also think that in the last month the protocol has improved a lot, and therefore I believe that MakerDao’s voice should also be included in the public arena. In addition, that event attracted many new players, for example, I’m the CEO of UgoliniCapital (a crypto fund), and we bought our first MKRs during the auction started to cover the deficit. We were attracted by this opportunity, not discouraged (however this is subjective). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.365440115440116
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#4",
                    "likes": "3",
                    "time": "04/05/2020-12:55:16",
                    "content": "Before Maker commits to a long-term budget for marketing I think some person or group should come up with a marketing plan. After that plan has been made and agreed on the appropriate budget can be allocated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hsingh21",
                    "index": "#5",
                    "likes": "0",
                    "time": "05/05/2020-17:57:30",
                    "content": "This is hilarious, the best at what exactly? Taking peoples money and writing them off like their hard earned money is nothing, then starting a thread that lasts for months getting absolutely nowhere ?!! First compensate the effected vault holders, at least with BlockFi or Nexo i know my money is SECURE on this side you cant even keep the protocol working properly!!! Who in their rite mind is going to take Maker DAO serious, nobody is locking up big money in Maker Dao with the chance of it being completely wiped out, Block Fi and NEXO have real capital that they are holding on loans for big companies and institutions because they have a model and it works and PEOPLE TRUST IT, who is going to trust Maker Dao after this? Nobody, unless vault holders have been made whole again and confidence is restored! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.73046875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#6",
                    "likes": "3",
                    "time": "05/05/2020-18:16:19",
                    "content": "I think any adequate marketing plan would include a more clear/accessible disclosure of risks. This would ensure borrowers accept responsibility for their own decisions and actions in the future. Also worth noting that maker is the only platform AFAIK that guarantees borrowers 1 hr notice before liquidation (due to OSM delay). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.148809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "3",
                    "time": "05/05/2020-21:31:14",
                    "content": "I’m going to ask you to tone it down a bit, please. Some people are working on compensation, others are free to discuss other issues. While I understand your frustration, I don’t think it makes this type of response okay (especially outside of the compensation threads.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.6194444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/KamesCG",
                    "index": "#8",
                    "likes": "0",
                    "time": "05/05/2020-23:04:58",
                    "content": "Who would be the target audience? What use case would be marketed first? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hsingh21",
                    "index": "#9",
                    "likes": "0",
                    "time": "06/05/2020-02:30:35",
                    "content": "Sure i understand and from my side it’s a clear frustration. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                }
            ]
        }
    ]
}