{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/scaling-web3-workforce-towards-a-decentralized-impact-based-talent-hiring-solution/17785",
            "title": "Scaling Web3 workforce - towards a decentralized, impact-based talent hiring solution ",
            "index": 17785,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "recruitment",
                "hiring",
                "bounties"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/synesthesia",
                    "index": "#1",
                    "likes": "7",
                    "time": "08/09/2022-09:00:09",
                    "content": "Author: @synesthesia Contributors: @pawel_tt @standaa @Anais_Cisneros  TL;DR Summary   Techtree is a bounty platform where people can monetize their personal assets such as network, knowledge, or reputation. Its initial focus is hiring referrals for tech roles. It is based on a fairness-first incentive model that enables success-based rewards depending on the degrees of impact in the hiring process: creator, referrer, and sharer. Employers can deposit bounties, create their bounty boards, and share direct access to talent referred to generic jobs within the community. Outside talent can be introduced to the Maker Ecosystem by TechTree and be readily available in the MakerDAO Talent Branch for outreach by CU Facilitators. Community members can earn various rewards by referring candidates or sharing bounties with their network to help a successful hire and generate value within the ecosystem. TechTree already collaborates with several VCs (Including Inflection, Maker’s last funding round investor) and their portfolio companies, but no DAO yet. TechTree proposes a pilot program to Create a MakerDAO talent branch, inviting all interested Core Units to participate.   Background At TechTree, we’re building a platform where communities or “trusted networks” leverage the assets of their members, such as their professional networks & knowledge, to make an impact and get rewarded. Many such networks provide a financial incentive to specialized service providers - for example, recruiters - while often asking their members for help without any incentive being offered. Hiring is an obvious example, and it is the subject of our initial focus as it is a critical problem for many tech businesses. TechTree has created a value exchange engine based on bounties - rewards that are due when value impact is made. TechTree’s model is currently focused on hiring referral bounties. We believe that very often and especially in specialized areas such as web3 & tech, a community can be a much more effective source of talent than hiring agencies. We also believe such recruitment bounties incentives should be transparently available to everyone. TechTree had a chance to meet with the Maker Foundation back in 2021, as it was undergoing its transformation into the DAO. Early on, we participated in many conversations about decentralization and the function of high-quality talent in the broader picture of a decentralized organization. As the most sophisticated and advanced DAO, our early involvement in Maker conversations have been instrumental to our subsequent product roadmap and has driven product development in recent months. That context heavily drove the creation of “bounty boards” - a simple way for communities to ask their members for help and creative incentives based on actual impact. Bounty boards were launched in January 2022 and are currently used by almost 40 organizations and 9 Venture Capital firms.  About TechTree  Founders Pawel(@pawel_tt), CEO & co-founder, sold his previous company to Publicis Groupe in 2011 - which helped companies like Google, Amazon, and Intel to build a strong reputation in the developer community. He was also an early team member of Confirm - AML software for blockchain-based assets, which he joined in 2016. Stanislas(@standaa), CTO, is an early contributor to Solana, and before that, he was a CTO & co-founder of a hardware tech startup. Laurence, VP of Partnerships & co-founder, spent six years leading business development for Jobbio – a provider of job board technology plugged into media companies, events, etc.  Team and resources TechTree started in Q1 2020. We are currently a 12-person team based in the UK. In July 2022, Andy (@synesthesia) joined the TechTree team. I’m a former @SES-Core-Unit  permanent team member, incubation program PM, and agilist specializing in organizational architecture, team dynamics, and processes.  Vision and Mission As TechTree, we believe in a world of sustainable communities, where members can share value and get easily rewarded by the community for their impactful contributions. The initial focus of TechTree is on the challenge of recruiting tech people, as this is one of the core growth inhibitors for the Web3 space.  Capital TechTree is backed by Notion Capital, Frontline Ventures, StakeDAO, and Move Capital, as well as the ex-CEO of Skype, ex-CTO of Workday, ex-CTO of Nutmeg, co-founder and ex-CFO of Monzo, and ex-Head of Sales of Stackoverflow and additional angel investors.  Track Record  Venture Capital Portfolios  Used by 8 VC  companies and over 25 business organizations, including Notion Capital, Advent PE, Polychain Capital, Inflection, and Frontline Ventures, with a waitlist of 21 VCs pending onboarding. Businesses including Advent, Wayflyer, YuLife, Tessian, Secret Escapes, and Shawbrook Bank.   Web3 / crypto project early adopters:  Ramp Network Oazo Apps (incl. Oasis) - recent acquisition of a CTO and a Senior Full Stack Engineer through bounties. Inflection.xyz - Maker recent round investor, one of the top European VCs backing crypto & web3, has launched its bounty board & talent branch and gave access to all 20 portfolio companies Portfolio companies of VCs, i.e., Sequoia, Index, NFX, Balderton, EQT Ventures, and more.   Some general numbers  Over 50 referred candidates have been hired via TechTreein the last year. Over 600k USD worth of bounties have been paid out. Candidates hired via TechTree are based in over 10 European countries.   The old but not-so-good display-based reward model Getting people’s attention on the spammy web has never been more challenging. At TechTree, we focus on tech people - the most crucial resource fueling global economic growth. The spammy internet originated with Google, who persuaded users that content should be free and built a click-based revenue model. Unfortunately, this motivates all users to maximize reach at all costs, bringing misinformation, polemical content, and clickbait. It also sucks value out of users who create 70% of all online content yet receive less than 1% of all revenue generated. As a result:  Finding information is more complex (everyone can create content). The costs of verifying content are increasing. People cut through this noise by relying on biased filters.   Challenges in hiring Hiring is a massive challenge for Tech, but primarily for Web3 projects as the talent is still scarce and often afraid to jump into the Web3 space. As a reminder, there was a great report  put together by the @SES-Core-Unit on the WEB3 Workforce situation not so long ago. It nicely summarizes what motivates and demotivates devs when attempting to join the Web3 Space. So, to sum up, here’s what the current challenges are:  Display-based payout models are still prevalent, preventing users from capitalizing on their assets. The almost exclusive way for an individual to capitalize on their personal assets is to get a job and get paid for it. Organizations are paying agencies to hire talent while their own communities have an immense source of quality candidates as part of people’s personal networks. However, without a robust systemic referral and incentivization model, the individual is not motivated to look for and make referrals. Apathy in potential candidates due to quantity-oriented hedging strategies by recruiters. A lot of great talent is still reluctant to join the Web3 world and actively contribute, even more so if there is no one to pull them into it. People respond to recruiters depending on the financial package offered as they lack trust and remain agnostic towards potential employers.   Solution – Impact-Based Hiring Bounty Model To alleviate the underlying issues, we propose the following:  Systemic bounties program with bounty boards and a fairness-first simple reward system DAO Talent branch UI - Shared talent pool for general referrals Incoming talent referrals from other DAOs and communities  While many communities are making considerable efforts to acquire high-quality talent, most of their community members have great talent in their personal network. They would more likely recommend them for hire if properly incentivized by the community. The TechTree Model utilizes game theory and considers the community’s inherent trust and loyalty as its foundation. Here are some immediate benefits:  Low fixed cost as the trust-based crowd-sourced model takes over agency-type models. It is fairer as the incentive goes to the members of the community that make an impact instead of external agencies. Usually, the bounty amount stays in the ecosystem instead of leaking outside. Time-to-hire is usually faster as a community swarms to fill positions utilizing their personal networks. The average time-to-hire is 2.5 weeks. It is more engaging and helps the community build a new degree of internal trust. It motivates towards quality as opposed to quantity.  Suppose an individual is paid for sharing information about jobs regardless of whether anyone gets the job in the end. In that case, a person will be incentivized to hedge to increase the chances of a candidate actually getting the job. On the other hand, If one is rewarded only for an impact in the form of a successful hire (continued 90-day engagement with the new employer), one will focus more effort on fewer people. This also raises the potential bounty amount as perceived quality overtakes quantity. Essentially, based on the game theory logic, a loyal member of the community will always choose to recommend talent from their network to the same community (or DAO for that matter) over another community. E.g., recommendations made by Maker token holders would translate into higher payoff as the workforce of their home DAO and the DAO itself grows and scales up.  How the TechTree bounty model works TechTree is organized into talent branches and bounty boards.  Bounty Boards Bounty boards are at the heart of the TechTree model. They represent a front-end where employers post bounties, and community members can refer a candidate for hire or pick the individual link and share the board with their network using preferred media streams. Individual members from the existing ones can curate custom bounty boards.  techtree bounty board1544×1304 270 KB  Here’s a live example of the Bounty Board above. An overview video of how the Bounty Board works can be seen below:   Talent branches A new feature in the TechTree product. These can be described as recruitment landing pages for an organization (e.g., a VC or DAO). They also represent liquidity pools of aggregated talent. Any community or organization can activate a talent branch (UX example below), aggregating all bounties and talent referred through general referral to the talent branch. General referrals are accessible to all opted-in members of the branch, e.g., MakerDAO Core Unit facilitators. Here’s what it looks like:  techtree branches1800×1619 127 KB  Community members can easily recommend candidates from their network to specific jobs or through general referrals, the former visible only to the employer (e.g., hiring Core Unit), the latter to all members of the branch, e.g., other Core Unit Facilitators. Signed-up users can also share boards with their network as a custom link and create content pointing at any of the boards made to secure rewards. Talent Branches can enable DAO’s to create an exclusive talent pool, helping them:  Add value to their community by sharing job opportunities within core units or suitable roles in the broader Web3 space. Help members of a DAO monetise their network by referring their friends to roles in the DAO. Support the growth of core units that are hiring in the DAO by finding top talent in the shared talent pool. Generate new revenue (which can also be donated to selected charity) when candidates are successfully hired through the DAO Talent Branch. Keep value within the DAO ecosystem instead of paying intermediaries to help them grow.  A working talent branch for Inflection VC (used by their portfolio companies) can be seen here Here’s Andy’s short video intro for a hypothetical MakerDAO talent branch:   Talent Branch interoperability through TechTree The model’s power is in the conditional flow of talent between talent branches to broaden the talent pool and the potential for successful hires.  Bounties from a child talent branch can be made visible to the parent branch by the board owner (by talent board invite and opt-in). Referrals made through general referral to the talent branch are visible to all opted-in members of the branch. Applicants may opt-in to be visible in other talent branches (e.g., a candidate from the exemplified Inflection VC who has a number of Web3 Portfolio companies in its network. Talent referred to Inflection would become available for MakerDAO employers as well. TechTree will help that talent become available and provide additional matching services to fit open jobs.   Reward System and corresponding reward flow Rewards are paid out depending on the role and its impact on the hiring process. Apart from referrers getting rewarded with the value of the bounty, individual creators of content leading to the bounty get 25%, board sharers: 10% on top of the original amount. As expected, there are multiple scenarios in which users get rewarded. More examples of current user logic are available here for reference and here from an employer’s perspective including fees.  techtree reward flow1800×1917 232 KB   Future of the Project As we’re testing the solution with other communities, mainly VC portfolio companies, we are already planning the roadmap to encompass:  User reputation scoring system based on e.g. The number of candidates recommended who were positively rated. The number of candidates brought to the Talent Branch. Profit Pools - One of the key challenges of the bounty-based system is that the initial low frequency of the reward makes it challenging to keep users engaged. This is also true for communities such as DAOs. As TechTree starts to generate profit, it will be shared with users based on their impactful contributions. At a later stage, each Talent Branch will be able to create and distribute such a value pool via TechTree. Bounty locked in DAO’s local token, e.g., DAI (currently it is FIAT & USDC). Applying bounties to other areas where the crowd-sourced model can be effective e.g. Knowledge - short-term projects focused on knowledge sharing. Sales - introduction to the entity that makes a purchase results in a bounty payment. Asset acquisition - introduction to someone who collateralized their assets via MakerDAO receives a bounty payment.   Proposed Pilot with MakerDAO TechTree represents a partner in hiring that can help MakerDAO find the right talent and optimize its spending on talent during a challenging time of budget cuts. The DAO still needs to support the growth of its initiatives but must do so in a way that maximizes the return on its investment and limits the spending of cash in the short term. We are proposing to:  Create a MakerDAO talent branch maintained by one or more Core Units (for invitation management within the ecosystem). Maintainer invites all Core Units in the Maker Ecosystem to the MakerDAO talent branch so they can start creating bounties for currently sought jobs. TechTree would reach out to Facilitators to help set up needed bounties. TechTree would educate the community on the idea of TechTree bounties so they can maximize their personal networks to refer talent.  At every step of the way we would help with guidance to the relevant parties - employer CUs, referrers, shares, and alike.  Next Steps We would like to start a conversation about the feasibility and the potential impact based on hiring bounties in Maker DAO. We would love to connect with:  A select Core Unit that would step up as a potential owner of the MakerDAO Talent Branch (this has no potential effort overhead) Facilitators in Core Units with current hiring needs (potential employers). Community members who have tried recommending talent in the past.  And of course, anyone with questions & challenges to our proposed model. Feel free to visit Techtree.dev for the working platform. You can reach out to me directly via Discord : synesthesia#5763 Thank you for your time in reading this post! ",
                    "links": [
                        "https://forum.makerdao.com/t/why-do-developers-join-crypto-web3-and-keep-contributing-to-the-space-insights-that-fuel-sustainable-developer-growth-strategies-at-makerdao/13194",
                        "https://techtree.dev/user/MAR119/techtrees-first-bounty-board",
                        "https://youtu.be/ZRU_dLPs0mAP",
                        "https://talentpool.webflow.io/vc-company/inflection",
                        "https://youtu.be/nLi4k_Ybs20",
                        "https://docs.techtree.dev/knowledge-base/products/bounties/for-users/examples-for-users",
                        "https://docs.techtree.dev/knowledge-base/products/bounties/for-companies/examples-for-companies",
                        "https://techtree.dev",
                        "https://forum.makerdao.com/t/escalar-la-fuerza-laboral-de-web3-hacia-una-solucion-de-contratacion-de-talento-descentralizada-y-basada-en-el-impacto-traduccion/17806"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.662773139558855
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#2",
                    "likes": "2",
                    "time": "08/09/2022-20:00:33",
                    "content": "Brilliant!. Looks like an interesting opportunity. In reference to the cost of use for Maker, I think that it is not clarified in the post, if so I apologize in advance, but could you specify what are the commissions that Techtree charges? thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.916666666666668
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pawel_tt",
                    "index": "#3",
                    "likes": "1",
                    "time": "08/09/2022-20:25:38",
                    "content": "Hi Gonzalo - glad to hear you like it. We’re charging 15% on top of the bounty. So if the bounty is 10k, we would charge 1.5k on top of it. More details on fees here: Pricing - Knowledge Base ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#4",
                    "likes": "1",
                    "time": "08/09/2022-20:46:10",
                    "content": "Great, thx for answering ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/synesthesia",
                    "index": "#5",
                    "likes": "0",
                    "time": "15/09/2022-12:02:45",
                    "content": "Perhaps we could have a convo with the @Growth-Core-Unit? We’re in DAO discovery mode and would love to jump on a call to see how we can help MakerDAO hire  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                }
            ]
        }
    ]
}