{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-brand-research-results-seeking-opinions-on-new-messaging/10020",
            "title": "[Informal Poll] Brand Research Results + Seeking Opinions on New Messaging ",
            "index": 10020,
            "category": [
                "Core Units",
                "Core Unit Archive"
            ],
            "tags": [
                "research",
                "brand-research",
                "archive-mkt-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#1",
                    "likes": "6",
                    "time": "25/08/2021-17:59:43",
                    "content": "This post summarizes the results of the Brand Research interviews the Content team has conducted so far. Please get in touch with @Content-Production or reply to this post if you’re interested in sharing your opinion. We’ll ask whether or not you’re comfortable allowing us to record the interview and use the content in marketing materials for MakerDAO and are happy to keep your responses anonymous if you prefer.  Brand Research Initial Results Of the 17 individuals that have been interviewed so far, we’ve had:  9 from the U.S. 4 weren’t asked or declined to answer 2 from Argentina 1 from Canada 1 from Denmark 1 from New Zealand  We ask participants to share the top three values they believe the community embraces. The word cloud below shows the results; the most commonly-cited values include Transparency (8), Decentralization (5), Community (4), and Innovation (3).  wordcloud687×603 95.2 KB  When discussing “why MakerDAO matters,” here’s what we heard:  Transparency + Community - Seeing an active, inviting community makes others want to contribute.  Our community is more hospitable and isn’t as exclusive as other crypto communities We have more intelligent, less “degen-ey” contributors (and even our degens are pretty great. Looking at you, @aburban90!) Several women noted that other communities can be exclusive and weren’t as helpful as MakerDAO when introducing themselves and asking questions. Non-crypto-natives also found MakerDAO more accessible than other crypto communities Leadership - it’s cool to be working “at the edge”   Social good - Not just “be your own bank” MakerDAO has a strong competitive advantage over other DeFi protocols in that collateral can’t be forked One respondent felt we have an opportunity to reduce risks around centralization using the Core Unit model, but there’s work to be done to understand and mitigate those risks.   Interpretation It’s no surprise that MakerDAO has a passionate community that deeply cares about making the world a better place; unfortunately, the nuances of what it means to make the world a “better” place tend to be where we get stuck: should we help “bank the unbanked” or should we refrain from characterizing MakerDAO as a bank, etc. Conducting brand research gives the DAO insight into these nuances. While many respondents mentioned things like permissionlessness and decentralization, most of the focus of these conversations shifted toward discussion of our community and the strengths that come with it.  With regard to brand & messaging: During one of the recent hearings in the U.S. on the regulation of stablecoins, one of the experts brought in to speak to legislators testified that the way people talk about blockchain and cryptocurrency tends to be more aspirational than accurate. For example, the copy on makerdao.com currently says that “Dai can be used by anyone, anywhere, anytime.” Roughly ⅓ of the world lacks Internet access, mobile devices, or government-issued ID, which means:  There are plenty of people who can’t currently use Dai. MakerDAO comes off as ignorant to the individuals and organizations directly involved in doing things like “banking the unbanked.”  Instead of trying to convince people that Dai is a “better” or “smarter” form of money, the Content team is interested in experimenting with messaging that emphasizes the value of community - and our community in particular - in developing a currency.  Next Steps and Poll The Content team will continue conducting interviews and reporting on the results; if you’re interested in participating in our research, please get in touch with a team member or leave a comment below. If the community is interested, the Content team will come up with a few examples of what this messaging could look like and create another poll to get feedback.    Would you like to see the DAO experiment with different messaging or not and if so, does the community-oriented approach sound like a good place to start?  Yes, community-oriented messaging makes sense and we would like to see what this could look like. No, this messaging doesn’t make sense but I would like to see something different from our current messaging. No, we should stick with the current messaging Abstain/Other     0 voters     ",
                    "links": [
                        "http://makerdao.com",
                        "https://forum.makerdao.com/t/maker-relay-ep-60/10082",
                        "https://forum.makerdao.com/t/content-production-bi-weekly-update-8-19-9-1/10129",
                        "https://forum.makerdao.com/t/maker-relay-ep-60-en-espanol/10375",
                        "https://forum.makerdao.com/t/mip40c3-sp33-modify-core-unit-budget-mkt-001/10150"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1780979437229435
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "4",
                    "time": "02/09/2021-16:52:39",
                    "content": "I find this research to be interesting, and more or less what I expected. I like the idea of focusing more on how the pie is made and who makes it. Dai is not the same “currency” it was last year. Over time it changes, and it’s meant to change for the better into perpetuity. That’s a powerful concept, if it holds true. Questions to be ready for: “What makes the MakerDAO community equipt to do this?” “If anyone can join, doesn’t that mean unqualified people can come and have influence?” “What indicates that Dai is getting better over time? Is there proof?” “What is the size and composition of the active community?” The decentralization of the protocol’s infrastructure is one thing. Decentralization and quality of the community is another, and although those two things are growing, my prediction is that this will be what people focus on with this kind of messaging. The community are the “Makers” of Dai. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.079166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "02/10/2021-16:53:40",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}