{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/collateral-onboarding-update-hvbank/17201",
            "title": "Collateral Onboarding Update - HVBank ",
            "index": 17201,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "rwa",
                "hvb",
                "rwa-009"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#1",
                    "likes": "11",
                    "time": "12/08/2022-02:40:40",
                    "content": "Hi all! I am providing the community an update on the HVBank status and plan moving forward. I’ve been working with @williamr , @christiancdpetersen , and @g_dip to determine our next steps. As the facilitator of the RWF core unit, @williamr is going to take the lead to complete the HVBank onboarding. This includes the coordination and legal aspects. @g_dip is managing the client relationship with HVBank. @collateral-core-unit will continue to manage the process and ensuring the deliverables are completed in a timely manner. We currently have the following tasks and work in progress:  Knowledge transfer including documentation from Christian to Will’s legal counsel (Christian/Will/new Legal) Ensure MakerDAO receives the second Genesis payment of 25M Dai (Will) Update the trust documents (Will/new Legal) Find/onboard a new broker (Greg/Will) Update the legal documentation for services provided by the new broker (Will/new Legal) Technical modifications, if needed (CES) Complete the remaining transfers (All)  If you have any questions on the individual tasks, please @mention the responsible parties as listed in the parentheses. CES will be providing ongoing updates. We look forward to a timely resolution of the HVBank onboarding. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.52020202020202
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#2",
                    "likes": "0",
                    "time": "25/08/2022-09:53:20",
                    "content": "Can you provide if and how the RWA Foundation will be added and managed through MIP58 RWA Foundations? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#3",
                    "likes": "0",
                    "time": "25/08/2022-12:51:49",
                    "content": "As a follow-on update from @monkey.irish above - RWA Foundation and Genesis Global Trading executed an amendment to the RWA Foundation/Genesis letter agreement – as approved by MKR holders Here. As with the original letter agreement, @collateral-core-unit will maintain a copy of the executed amendment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#4",
                    "likes": "1",
                    "time": "25/08/2022-17:13:03",
                    "content": "If there is additional work to do here, we’ll ensure it happens. It’s in discussion now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}