{
    "poll_list": [
        {
            "title": "Decrease the UNIV2DAIUSDC-A Liquidation Ratio - May 3, 2021",
            "index": "7444",
            "option": "Yes",
            "supporting_mkr": "11,974",
            "highest_fraction": 0.96
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-adjust-liquidation-ratio-for-uni-v2-dai-usdc-a-vault-type/7444",
            "title": "[Signal Request] Adjust Liquidation Ratio for UNI-V2-DAI-USDC-A Vault Type ",
            "index": 7444,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "stablecoin",
                "uniswap-v2",
                "sig-status-accepted",
                "uni-v2-dai-usdc"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "6",
                    "time": "12/04/2021-04:52:55",
                    "content": "Hi Everyone, The liquidation ratio is the minimum amount of collateral required per unit of DAI debt borrowed (more info in the docs here). Currently, the UNI-V2-DAI-USDC vault type has a liquidation ratio of 110%, meaning a borrower would need to supply at least $110 worth of LP tokens for each 100 DAI borrowed. While the UNI-V2-DAI-USDC vault type has seen some DAI minting, I believe it may be underutilized due to an unnecessarily stringent liquidation ratio. In many ways, Uniswap stablecoin LPs are better collateral assets than holding stablecoins directly. They have reduced potential losses from stablecoins losing their peg, earn native interest from swap fees, improve DAI liquidity, and are naturally resistant to censorship. The USDC-A vault type, which has been deprecated but still has over 200 million DAI outstanding, has a 101% liquidation ratio, implying a 1% buffer. The current 110% liquidation ratio for the LP vault type implies a roughly 20% buffer, and could potentially be reduced without adverse impacts on system risk. One issue to be aware of is abandoned vaults, which impacted other stablecoin vault types and has forced Maker to reduce interest rates to 0%. Uniswap LPs benefit from native interest from swap fees, helping reduce the risk of vaults becoming undercollateralized through interest accrual. But this is still an important reason to avoid setting too low of a liquidation ratio. Benefits of reducing liquidation ratio:  More capital efficiency for vault users Increased DAI generation through this vault type Potential to reduce exposure to USDC-A and PSM-USDC-A Potentially better risk adjusted return on Maker’s stablecoin exposure Improved DAI liquidity for DEX traders  Drawbacks of reducing liquidation ratio:  Greater potential for losses on this vault type if USDC losses it’s peg Potential for abandoned vaults (similar to current USDC vaults) if liquidation ratio is set too low   Signal request poll question Please select all options you would support in an on chain vote (multiple choice) What should be the liquidation ratio for the UNI-V2-DAI-USDC-A vault type?     110% (Current value) 105% 103% Abstain     0 voters      Next Steps This poll will run until Monday April 26. If a majority of forum voters (excluding abstain voters) support changing the UNI-V2-DAI-USDC liquidation ratio, I’ll follow up with an on chain governance poll for the selected parameter update. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-43/7818",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-138-thursday-april-22-17-00-utc/7515/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-42/7673",
                        "https://forum.makerdao.com/t/maker-relay-ep-41-en-espanol/7614",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-16-22/7609",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-137-thursday-april-15-17-00-utc/7384/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-41/7571",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-9-15/7509",
                        "https://forum.makerdao.com/t/maker-relay-ep-40/7467"
                    ],
                    "GPT-summary": "The author of the post proposes to adjust the liquidation ratio for the UNI-V2-DAI-USDC-A Vault Type, explaining the current ratio and the benefits and drawbacks of reducing it. The author also asks for feedback through a poll and plans to follow up with an on-chain governance poll if the majority supports changing the ratio. A 3rd party could give constructive criticism, extend to the proposal, or ask questions about it.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.441176470588235
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#2",
                    "likes": "0",
                    "time": "12/04/2021-06:26:02",
                    "content": "I agree that it is lower risk and as a result should have a corresponding lower liquidation ratio. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#3",
                    "likes": "2",
                    "time": "12/04/2021-14:23:46",
                    "content": "We haven’t seen the security report from the oracle contract yet. I would first ask the SC team about it before decreasing the Liquidation ratio. If the oracle can be compromised those little 10% are our margin. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.15625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#4",
                    "likes": "2",
                    "time": "26/04/2021-23:50:20",
                    "content": "The forum poll is now closed, thanks to everyone who voted! Excluding abstain votes, the only option to gain majority support was reducing the vault liquidation ratio to 105%. I’ll prepare this to be submitted as an on chain poll next week. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "27/05/2021-09:50:38",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "3462"
}