{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/aclaraciones-acerca-de-mi-opinion-sobre-love-vs-metadao-y-un-diagrama-de-votacion-de-aprobacion-traduccion/16946",
            "title": "Aclaraciones acerca de mi opini\\xc3\\xb3n sobre LOVE vs MetaDAO y un diagrama de votaci\\xc3\\xb3n de aprobaci\\xc3\\xb3n [Traducci\\xc3\\xb3n] ",
            "index": 16946,
            "category": [
                "Latin America"
            ],
            "tags": [
                "voting",
                "meta-governance",
                "love-cu",
                "mips",
                "espa\\xc3\\xb1ol",
                "endgame",
                "love-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/brigith238",
                    "index": "#1",
                    "likes": "7",
                    "time": "02/08/2022-12:45:59",
                    "content": "He conversado con Rune y Luca por separado, diría que tengo relaciones “amistosas” con cada uno, y ambos parecen dispuestos a colaborar de buena fe para resolver esto. En primer lugar, mis declaraciones recientes en el chat sobre “securing supermajority vote” no deben interpretarse como si existiera una coalición con una agenda específica, no la hay, esto fue pensado como una declaración provocativa para resaltar que los delegados inútiles pagados en exceso que hablan mucho son una pequeña minoría y simplemente pueden ser ignorados. En segundo lugar, inferí que el prestatario estaba votando Sí a la propuesta LOVE porque 1) fue un gran cambio estructural y 2) se hizo al mismo tiempo que se realizó un préstamo masivo en Aave. Tomar prestado para votar “sin cambios” no es una jugada sostenible, solo tiene sentido hacerlo si puede usarlo para ganar algún tipo de terreno. En tercer lugar, el momento de los diferentes ataques contra mí y contra el Rai System hizo que pareciera que provenía de personas que no estaban contentas con el hecho de que estaba interrumpiendo esta votación, lo que me hizo pensar aún más que provenía del lado “sí”. Ahora me doy cuenta de que esos ataques podrían no haber venido de ninguno de estos lados, y que en realidad es una amenaza completamente externa. Dicho todo esto, quiero enfatizar que no estoy a favor de la propuesta de MetaDAO más de lo que estoy a favor de la propuesta de LOVE. Creo que ambos son movimientos subdesarrollados y posiblemente existencialmente malos. Creo que en este momento debemos dar un paso atrás y no tomar NINGUNA acción drástica hasta que resolvamos el problema central de que la gobernanza aquí es completamente disfuncional, y eso se puede hacer reduciendo la complejidad y aclarando cómo funciona realmente el sistema de votación actual. En una de mis publicaciones más enojadas, dije algo como “¿por qué no me dejan a mí y a Rune diseñar un mejor sistema de incorporación de garantías?”, pero ahora veo que se malinterpreta y significa que apoyo su propuesta particular de Endgame. Eso no es cierto, lo que debería haber dicho es “Quiero averiguar quién es un colaborador de buena fe y quién es un títere, y diseñar algo sin obtener un divide y vencerás de los cómplices que hablan todo el día pero no hacen nada”. Lo que me queda claro ahora es que ninguna de estas propuestas tiene una aprobación “amplia”. Este es exactamente el resultado que puedes esperar cuando la gobernanza es un sistema de votación de mayoría simple.! Aquí hice un pequeño diagrama que muestra apenas cómo pretendía que se usara el contrato de gobernanza. Es muy tosco, no lo tome como una descripción completa de Maker ni de ningún sistema nuevo. Lo hice para enfatizar solo una cosa, y es que el voto de aprobación siempre fue mi diseño previsto, y el resultado es que el sistema es resistente a los ataques de gobernanza y no está constantemente preocupado por propuestas políticas polémicas. Ahora mismo lo necesitamos más que nunca. (Aquí, “modelo antiguo” y “modelo nuevo” están en el contexto de mis nuevos proyectos: aquí estaríamos adoptando algo como el “modelo antiguo”, porque Maker tiene sus raíces en el ds-chief contract).  3262×1798 466 KB  La buena noticia es nuevamente que el sistema aún se basa en el ds-chief contract, y aún se puede hacer la transición de manera segura a un estado en el que se usa la votación de aprobación para luego seleccionar delegados. Con un conjunto de delegados del core system  ampliamente respaldados, podemos comenzar a desenredar este lío sin que cada voto se divida por la mitad en función de líneas esencialmente políticas. Creo que deberíamos hacer esto antes de comprometernos con una dirección para la política de incorporación de RWA (pero no me opongo a los pequeños estudios de casos con límites de deuda responsablemente bajos para que el progreso no se detenga por completo). Puedo tratar de liderar por ejemplo y mostrar cómo se ve la votación de aprobación para un conjunto de delegados en vivo en proyectos paralelos por un tiempo, de esta manera Maker no necesita experimentar con cambios estructurales fundamentales y puede adoptarlo una vez que esté claro que en realidad funciona. Nuevamente, lo único en lo que creo que todos pueden estar de acuerdo ahora es 1) no necesitamos hacer cambios drásticos en la gobernanza o agregar muchos más tipos de garantías “contenciosas”, y 2) existe al menos una posibilidad de que un sistema de votación de aprobación pueda ayudarnos a solucionar todos estos problemas. Una vez más estoy en contacto tanto con Rune como con Luca y, al menos en teoría, todos estamos dispuestos a trabajar juntos de buena fe. Si está al tanto de un gran bloque de votantes que siente que ninguno de estos representa los mejores intereses de Dai y el sistema Maker, no dude en enviarme un mensaje privado en Discord y lo escucharé. Por favor tenga en cuenta que estoy muy atento a los cómplices y marionetas, ese tipo de actores sobresalen como payasos que brillan en la oscuridad para mí, es como si tuviera lentes especiales que me permiten ver hasta el más mínimo material fluorescente de una milla de distancia.  Esta es una traducción libre del topic Clarifications about my take on LOVE vs MetaDAO, and a diagram of approval voting de @nikolai Créditos: Traducción @Brigith238 - Revisión @nahueth ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.190476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/08/2022-20:06:44",
                    "content": "Excelente traduccion, aquí se desglosa muy bien lo difícil de definir estructuras de gobernanza y otros mecanismos, tomará tiempo el descifrar que es lo mejor para Maker ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}