{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rethinking-psm-fees/16168",
            "title": "Rethinking PSM-fees ",
            "index": 16168,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "psm-usdc-a",
                "psm",
                "psm-pax-a",
                "psm-gusd-a"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#1",
                    "likes": "9",
                    "time": "28/06/2022-22:13:46",
                    "content": " TL;DR I have been in favor of 0-PSM-fees to provide a hardened peg since the introduction of the PSM. I am now convinced that this was a mistake as this policy removes the incentive for normal vault holders to arbitrage on depegging and by that just leaving the leverage-usecase for vault holders. As the appetite for leveraging crypto is not very strong, we have reached a stablecoin ratio of ~80% recently - turning DAI more and more into a USDC-wrapper.  Rethinking PSM-fees For those not having an idea what PSMs are - here is a great summary. I’d like to focus on the two parameters defining the fees:   tin - the percentage fee applied when trading a stablecoin (USDC, GUSD, USDP) in exchange for DAI  tout the percentage fee applied when trading DAI against a stablecoin.  Trading DAI back to another stablecoin is of course only possible if there is enough of it deposited on our side - which is not too much of an issue as we have 3.3B of USDC and almost 500 MM of USDP in our PSMs. Both parameters are set to 0, allowing trades into both directions without any conversion fees. Last changes on tin: Signal Request, Onchain Poll, Executive vote - last changes on tout: Signal Request, Onchain Poll, Executive Vote As soon as DAI is depegging to the north - let’s say trading at $ 1.01 - anyone can easily arb this by converting their USDC to DAI and selling it with a premium. As there is no fee on our side, this does happen really quickly. If we would have a fee of 1%, using the PSM would only be profitable, if the price of DAI is > $1.01. Between $1.00 and $1.01 the only way to arb it is to mint DAI using real collateral. As we have zero fees on the PSM, the only use case for native crypto vaults is to leverage your collateral - the appetite for leveraging crypto collateral seems to be at an all time low, the only metric growing on DAI is the stablecoin-ratio (currently at a record 80%). Vault usage is going down more and more. If this trend continues DAI will (slowly) turn into a stablecoin wrapper. If we would increase the tin just a bit, we could re-enable the arbitrage use case for crypto-vault holders. This will very likely not happen really quickly, as there is a lot of e.g. DAIUSDC liquidity on other platforms like curve and uniswap that will be used first. But over time, it will be attractive again to arb the peg just by using crypto vaults again and the PSM will remain as a last-resort peg-stability-enforcer. Increasing the spread also opens up the market for liquidity outside of the Maker Protocol, right now since you can trade 1:1 we’re the primary market for DAI/USDC trades. By opening a window between 1 and 1.01 we’re allowing the market to find a price between there.  Next steps I’d like to use this thread to gauge sentiment about increasing the tin again - if successful I will start a Signal Request on that topic in a couple of days. I would be happy to get comments, additional perspectives and also roasting if this idea is stupid. Moving away from 0-fee PSMs will likely have some effects that should be taken into consideration: what is the impact on RWA, GUNI… Happy to hear your thoughts ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-set-psm-fees-to-0/10894",
                        "https://vote.makerdao.com/polling/QmSkYED5?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/executive/template-executive-vote-parameter-changes-core-unit-budget-distribution-november-5-2021?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/signal-request-reduce-the-usdc-psm-tout-to-0/8128",
                        "https://vote.makerdao.com/polling/Qmc7PYCn?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/executive/template-executive-vote-june-core-unit-budget-distributions-other-changes-june-4-2021#proposal-detail",
                        "https://forum.makerdao.com/t/signal-request-changing-usdc-psm-fees/17304",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/3",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-9/16355",
                        "https://forum.makerdao.com/t/can-we-justify-the-existential-risk-posed-by-psm-usdc/16180/76",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-9-traduccion/16383",
                        "https://forum.makerdao.com/t/governance-and-risk-198-thursday-july-07-at-17-00-utc/16370",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/12",
                        "https://forum.makerdao.com/t/governance-and-risk-198-thursday-july-07-at-17-00-utc/16370/3"
                    ],
                    "GPT-summary": "The author of the post is proposing to increase the fees for the PSM (Peg Stability Module) to incentivize normal vault holders to arbitrage on depegging and prevent DAI from turning into a stablecoin wrapper. The post explains the two parameters defining the fees and how increasing the tin could re-enable the arbitrage use case for crypto-vault holders. The author is asking for feedback and additional perspectives on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.8735615079365076
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/06/2022-23:39:30",
                    "content": "Thats a creative and interesting idea. My perspective about the implementation of PSM-Fees is that it may not be the best timing, given that MIP65 is up for voting right now. If the proposal passes, the investment of 0-PSM-fees will be realized in NII via bond investing. Implementing PSM may increase volatility and impact stability of funds, which is an important variable for the PSM investable amount - Modeling DAI maturity. The stablecoin ratio is too high and although driving PSM funds down would lead to a better stablecoin ratio, the focus should be on driving lending demand, MKR’s core business. I have opened up an informal poll post to ideate on incentives to increase DAI borrowing.     ultraschuppi:  As soon as DAI is depegging to the north - let’s say trading at $ 1.01 - anyone can easily arb this by converting their USDC to DAI and selling it with a premium. As there is no fee on our side, this does happen really quickly.   Should MKR also compete for USDC/DAI arbitrage opportunities? ",
                    "links": [
                        "https://forum.makerdao.com/t/informal-poll-dai-borrowing-incentive-ideas-that-the-dao-could-test/16057/5"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.978412698412699
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#3",
                    "likes": "17",
                    "time": "29/06/2022-00:49:08",
                    "content": "The following opinions my own and do not represent PECU Setting the PSM fees to zero has played out pretty much exactly the way that many of us had predicted. Michael from Curve warned even before the PSM was implemented that market price discovery for Dai is necessary and that setting the fees to 1:1 would cause “empty shelves” in secondary markets by attempting to price fix at the protocol level. I warned prior to the imposition of the zero fee tin that Maker holders would expect to take on many multiples more stables than we had backing Dai, and that’s indeed what has happened, to the point where we’re at a laughable 80% stablecoin backing for Dai. By attempting to stomp down the market premium for Dai we’ve disincentivized vault usage generally, which is and should be the protocol’s bread and butter as sticky revenue. By not allowing the market to price in a premium to Dai when it is in demand there is less incentive to generate new Dai via collateral vaults. Without the ability to apply variable rates to sop up Dai on the downside of the peg none of the other strategic money games work. Swapping bonds with Circle on the backend is not an interesting defi primitive nor is it one that I think people will get excited to support Maker over. The original desire for reducing the fees to zero apparently stemmed from a desire to ensure Dai could be purchased at $1 by Dai holders. This is not something we should optimize for. The MakerDAO White Paper describes Dai as “collateral-backed cryptocurrency soft-pegged to the US Dollar.” This soft-peg is critically important to the long-term stability of the token as the price fluctuates to represent market sentiment. High Dai price means high demand, and encourages Dai generation, it also discourages and should discourage repayments, which would take Dai out of circulation. Conversely, Dai below peg discourages new vaults and means that borrowers can buy Dai at a discount and repay debt, thus reducing supply and driving the price up. At scale, we can expect that by allowing these market incentives to play out as intended market participants will naturally play both sides of the peg and keep the token price on track. By removing this critical market signal we’ve eliminated the ability for market participants to grow in a healthy and sustainable way. Instead, we’ve provided nominal Dai price stability at the cost of existential risk to the protocol without any reward to MKR holders. It’s time to declare this experiment with zero fees a failure and begin to allow the protocol to heal by embracing the innate incentives of the system. The PSM in and of itself is a compromise to those incentives, but in the long term, a PSM with zero fees interferes too much with the systemic feedback mechanisms that keep the system upright. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-set-psm-fees-to-0/10894/8",
                        "https://makerdao.com/whitepaper/White%20Paper%20-The%20Maker%20Protocol_%20MakerDAO%E2%80%99s%20Multi-Collateral%20Dai%20(MCD)%20System-FINAL-%20021720.pdf"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.665941674812642
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/06/2022-01:00:35",
                    "content": "We are in bear marker and the best thing to do at this time is to think of ways to monetize everything obtained in the bull market. Maker needs money for the expensive structure that various CU’s have become. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GWintery",
                    "index": "#5",
                    "likes": "1",
                    "time": "29/06/2022-01:37:12",
                    "content": "I have generally also disagreed with the whole idea of 0 fees PSM, I do agree that it helps to maintain the peg, but I do not think it is the type of stability that we desire in the long run. If we want to continue with the 0 fee PSM, then I would at least want us to use the idle stablecoins to generate revenue for the protocol, and then we can perhaps use that revenue to bootstrap our own liquidity for DAI/USDC. My general thinking for the short term is 1-10 bps for ‘tin’ and 0 for ‘tout’ so long as we do not utilize the stable coins in the PSM Once there are some utilization of the stable coins, I would advocate for lower ‘tin’ (1-5bps) and low tout (1-5 bps) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#6",
                    "likes": "0",
                    "time": "29/06/2022-02:21:02",
                    "content": "    GWintery:  If we want to continue with the 0 fee PSM, then I would at least want us to use the idle stablecoins to generate revenue for the protocol, and then we can perhaps use that revenue to bootstrap our own liquidity for DAI/USDC.      MIPs Portal    MIPs Portal Maker Improvement Proposals are the preferred mechanism for improving both Maker Governance and the Maker Protocol.      ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP65"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GWintery",
                    "index": "#7",
                    "likes": "1",
                    "time": "29/06/2022-03:21:13",
                    "content": "I am well aware some proposals are ongoing, it’s just that it has been quite a long time… Not even sure when this particular proposal will start even if it is already accepted? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#8",
                    "likes": "0",
                    "time": "29/06/2022-03:35:57",
                    "content": "Once approved I dont think the execution would extend beyond a few months (fingers crossed). Sacrificing a few bps in fees would be worth it to earn 2-5% on the PSM funds  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#9",
                    "likes": "14",
                    "time": "29/06/2022-07:16:25",
                    "content": "IMO the most important aspect of Dai is that it is reliable money the average person can trust with their savings and use in their every day life. Ideally you should be able to only use Dai as your preferred form money or savings, Dai shouldn’t have to be some secondary, strange asset that can’t be used unless you also have some other “real” money. In that context anything other than 0 fee PSM makes no sense. What kind of money charges you a fee for trying to spend it or withdraw it? We would simply be shutting the door on adoption and pushing people to stay with fiat or centralized systems. Even if we haven’t figured out the collateral yet, we will be able to in the future… but it will only matter if people actually use Dai. In terms of mainstream adoption, nobody, absolutely nobody, cares about USDC or decentralization. That’s something we have to sneak in once they’ve adopted Dai for other reasons. Decentralization isn’t a value proposition, it’s a kind of charity or responsibility to society that we will not be rewarded for providing - just like Clean Money, sustainability, and other forms of public good that Maker can revolutionize if it reaches its full potential, it falls entirely on us to deliver in ways that don’t inconvenience the users.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.923333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GWintery",
                    "index": "#10",
                    "likes": "5",
                    "time": "29/06/2022-07:49:12",
                    "content": "When you say mainstream adoption, does 0 fee PSM encourage retail to use it in the first place? IIRC the gas cost for PSM is much higher compared to a simple swap on uniswap, hence I think it is not used much by small retail in the first place. Do correct me if I am wrong on this. If people want to swap in general there is now a 0.01% fee USDC/DAI pool that has very high amount of liquidity, and already incentivized by the protocol to be used as collateral. PSM should be used as its name, a peg stability module. Large players use the PSM as they see opportunities to arbitrage, plain and simple. We should also therefore make use of this to earn for the protocol. The peg is important, and so is our bottom line. I am still not convinced that 0 fee PSM will lead us to mainstream adoption. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.274166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#11",
                    "likes": "1",
                    "time": "29/06/2022-07:55:09",
                    "content": "    rune:  In terms of mainstream adoption, nobody, absolutely nobody, cares about USDC or decentralization.   that’s not my point. my point is that we turned our back on vault-users that want to arbitrage. i did not even mention “income” or “revenue”. I just don’t see much value in DAI just being a USDC-wrapper with added benefits (like reinvesting the USDC into TradFi). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#12",
                    "likes": "3",
                    "time": "29/06/2022-08:21:25",
                    "content": "I agree with this perspective - we need to benefit vault users so we will get more of them. But vault users are better off and will in all cases prefer low and reliable stability fees - in the past when we’ve had to raise fees due to demand imbalance we drove away long term vault users that never came back again. Stability of the balance between supply and demand comes from scale and Dai adoption, which I believe is heavily driven by stability and reliability of the peg. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.234375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#13",
                    "likes": "2",
                    "time": "29/06/2022-08:23:00",
                    "content": "Agreed that regular users never use the PSM directly, but the it’s what the arbers use to set prices everywhere else. If we charge a spread on the PSM, we will be widening the spread of Dai across the entire market by close to the same amount, in addition to the spreads that already exist. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#14",
                    "likes": "1",
                    "time": "29/06/2022-08:42:01",
                    "content": "    rune:  I agree with this perspective - we need to benefit vault users so we will get more of them. But vault users are better off and will in all cases prefer low and reliable stability fees   SFs are low and stable (or even decreasing) for some months now. yet a lot of outflow. shall we just continue lowering SFs? I have doubts this is going to help us getting inflow again. just decreasing revenue even more ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#15",
                    "likes": "1",
                    "time": "29/06/2022-08:45:35",
                    "content": "No, but if we raise them unpredictably or create an expectation that they could raise unpredictably, I think we can expect more outflows ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#16",
                    "likes": "0",
                    "time": "29/06/2022-08:57:39",
                    "content": "Revenues will eventually be solved by getting access to treasury yields. Getting back market share of crypto-native assets is important, but we shouldn’t care so much about the SF yields. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#17",
                    "likes": "3",
                    "time": "29/06/2022-09:32:32",
                    "content": "I actually looked at this question back of the envelope for G-UNI DAI/USDC 1bps vaults, when rates went from 25 bps to 5bps, quite a deep cut. Again just really rough calculations here but the tldr is that rate cuts that are too deep effectively net lose revenue to the system and can’t be recovered easily, so more gentle changes may be more appropriate. However, more research on other vaults and over other time-frames is necessary to extend this conclusion.  image1312×235 10.4 KB  The price elasticity of this vault for this rate shock is on the order of -2.5. This move effectively lost Maker ca. 200k in annualized revenues as the increase in borrowing demand did not compensate for the decrease in rates. Furthermore, now that we are at the ‘bottom’ on rates as it were, we are stuck. Raising rates back to 25bps would flatten demand to 0. If we were to increase even 1bp we would lose another 100k in annualized revenues. All else being equal a more suitable cut would have been from 25bps to 17.5bps, which would have actually increased annualized revenues by 100k. This model suggests actually cutting from 5bps by another 1.5bps to 3.5 to pump demand by more than the decline in rates. Again this is just a toy model, not worth its salt for proper rate recommendations. But gentle step-changes are an interesting hypothesis worth exploring further and a heuristic that could be worth bearing in mind when it comes to rate-setting, particularly in a ‘panic’ as we try and shore up demand as best we can. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.922043010752688
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GWintery",
                    "index": "#18",
                    "likes": "1",
                    "time": "29/06/2022-15:50:01",
                    "content": "If spread is a concern, then I would like to know what is the acceptable and non-acceptable spread? I doubt a 1bps tin would cause spreads in the network to become intolerable for regular users? I feel like our idealistic take on wanting to equate 1 DAI = 1 USDC = 1 Other stable coin is costing us more than benefitting the protocol. The tighter we want the spread, the more costs that we will incur. I think a low fee on all PSMs is something that will at least shrink the cost and tip the balance. I will only change my mind at the point where we are already able to utilize the USDC for other purposes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.527777777777779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#19",
                    "likes": "2",
                    "time": "29/06/2022-16:20:44",
                    "content": "As soon as MIP65 has been implemented we will basically have unlimited scalable access to yields on the demand for Dai. So it’s coming very soon. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#20",
                    "likes": "0",
                    "time": "29/06/2022-16:27:35",
                    "content": "And enhanced DSR rate will increase DAI demand ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#21",
                    "likes": "0",
                    "time": "29/06/2022-16:34:52",
                    "content": "This is actually an interesting idea.  Do we have any insight to how many users were opening vaults for this arbitrage purposes before the PSM?  I wouldn’t mind trying this as an experiment.  Some thoughts…   I imagine currently, as soon as you place a fee on the PSM, the price of DAI would immediately move up to match it.  How high of a fee would be required to make minting DAI with new collateral worth it?   Another issue is that it would only ever be worth it if DAI eventually went back to the 1.00 peg.  If you add this fee and DAI’s value just stays at say 1.01.  Well, you can mint and sell DAI at 1.01 but just end up paying stability fees waiting for the price to drop back to 1.00.  If it doesn’t, your collateral is stuck unless you buy back at the same heightened price.   This type of usage doesn’t seem super sticky although it does encourage people to get to learn how to open vaults which is a good thing.   Would increased volatility reduce overall long term demand for DAI?  You’re basically allowing for a less stable DAI here.  Will that affect how people view it as a stablecoin?  People are sensitive to this.  Arbitragers make money at the expense of people who have to buy or sell.  The more unstable a coin is, the more those who transact in it get nickel and dimed with each transaction.  But maybe this is acceptable to some extent.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.907864357864358
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#22",
                    "likes": "8",
                    "time": "29/06/2022-16:54:49",
                    "content": "I would like us to rethink how to increase vault usage (on size and number of vaults), and analyze different alternatives, having the PSM fees as one of these. As @ultraschuppi  says, by now, the appetite for leveraging crypto collateral is at an all-time low, we have been talking with various large crypto treasuries interested in IVs and they all are waiting to see what happens with the market. On the other side, playing with the idea of DAI ≈ $1 to incentivize vault owners will have consequences on adoption:  it would be hard to position DAI for large transactions, as a change on its peg could mean losses for one of the transaction parties. Think about the consequences this could have on the RWA lenders it would be hard to position DAI to retail because stablecoins are supposed to be stable, and when talking about money, you have to trust it (trust that it will be at 1 all the time, and you will be able to get fiat whenever you want). Of course, Dai is supposed to be a soft-pegged coin… but retail will never understand it. Would you save your money on something that you don’t know how much will cost tomorrow? As a CU whenever I have to pay for something I try to force service providers to accept DAI (sometimes I can’t but most of the time I’m able to do it), and that’s just because we both know 1 DAI = $1  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.484906462585034
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#23",
                    "likes": "0",
                    "time": "29/06/2022-17:15:16",
                    "content": "    rune:  In terms of mainstream adoption, nobody, absolutely nobody, cares about USDC or decentralization. That’s something we have to sneak in once they’ve adopted Dai for other reasons. Decentralization isn’t a value proposition, it’s a kind of charity or responsibility to society that we will not be rewarded for providing - just like Clean Money, sustainability, and other forms of public good that Maker can revolutionize if it reaches its full potential, it falls entirely on us to deliver in ways that don’t inconvenience the users.   sounds like we should keep tracking the price elasticities of the various vaults and adapt accordingly ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.893939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#24",
                    "likes": "2",
                    "time": "30/06/2022-09:14:43",
                    "content": "I’ve set the SR to put PSM to 0%, so I’ve shared my view in there and here. Setting fees to 0% didn’t made us onboard a lot of USDC contrary to what was expected by opposing people. People (institution we are speaking to) start to trust us on the 1 DAI = $1. Probably not great the kill this trust. It will also piss the DAI-USDC leveraged LP. Our inability to invest our balance sheet is our own problem and we should focus on that instead of creating friction for our users. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-set-psm-fees-to-0/10894/13"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.166666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#25",
                    "likes": "3",
                    "time": "30/06/2022-09:27:45",
                    "content": "    SebVentures:  Our inability to invest our balance sheet is our own problem and we should focus on that instead of creating friction for our users.   I see all points raised in this thread but I agree with @SebVentures here. DAI is useful to users if it is strongly pegged to USD. It’s just not acceptable to see users be liquidated if DAI depegs 1% from USD, which was a not so uncommon event before the PSM. Note: I agree with @brianmcmichael that in the whitepaper, DAI is described as having a “soft peg” with USD, and that its design and game-theoretic dynamics are kind of altered by having a 1:1 PSM-enforced peg with USDC.  But really, do people mostly want a strongly pegged or sotfly pegged coin? I mean, RAI has 14m marketcap… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.974537037037037
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JWizard",
                    "index": "#26",
                    "likes": "4",
                    "time": "30/06/2022-11:39:48",
                    "content": "To me it seems clear that this is yet another example of where the push to have Maker’s core principals more strictly defined makes a lot of sense. There are multiple views in here in this thread that just cannot be held by members of the same collateral-backed stable coin protocol. One example is the idea of pushing away the reliance on centralized collateral vs having an iron-strong dollar peg in a time where most stablecoins have died or deviated way off-peg. One can look at MAI, MIM, LUSD etc. for examples. We need to solve these existentially paradoxically positions first, and let there be a peaceful departion of those that do not agree with the winning beliefs. Otherwise we cannot move forward. Seems like the existance of RAI could act as a secondary boat if Maker’s Majority chooses to favor strong peg over all.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.116666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#27",
                    "likes": "0",
                    "time": "30/06/2022-14:21:22",
                    "content": "This may be true if we’re moving toward a future where PSMs are always going to be as large as they are now.  But I think there is a shared vision out there of a DAI safely backed by all kinds of collateral not under the control of any one party or jurisdiction.  If this were ever able to happen, the PSMs would naturally shrink in comparison to these other collateral types.  We are where we are simply because demand for crypto backed loans has disappeared. The PSMs as they are now provide the clearest and simplest visibility into demand for holding DAI and allows the protocol to respond quickly if we were to see this demand flag.  We should not take these large PSMs for granted and be grateful that demand to hold DAI has not disappeared in the same way lending demand has.  If the fed hikes a little bit more, do not be surprised if we start seeing outflows again…  Centralization to stablecoin issuers is a risk and obviously against the ethos of MKR but this bear market is not done.  So until revenues are increasing and profitability is clear, we must be careful not to weaken the position of the protocol in the quest to address these existential risks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7351190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#28",
                    "likes": "4",
                    "time": "30/06/2022-21:21:49",
                    "content": "    brianmcmichael:  High Dai price means high demand, and encourages Dai generation, it also discourages and should discourage repayments, which would take Dai out of circulation.   Unfortunately I don’t think the incentives really play out like this in practice. Without PSMs (or with wider spreads), vault users face a lot of uncertainty about their total cost of borrowing, particularly over shorter time periods. So while users may have some theoretical profit opportunities if DAI price is eg. $1.005, they must also consider the risk that premium blows out to $1.01 (or even higher) at the time they want to repay. And those specifically targeting these arb opportunities would likely want to use higher leverage (to make the trade capital efficient enough to generate meaningful profits), but this increases risk of forced closing during a price spike. I’d expect greater DAI price volatility to discourage ETH vault usage on net as most just want a safe, predictable, low cost way to leverage their holdings and are not interested in seeking profit by arbing the peg. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.515416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#29",
                    "likes": "0",
                    "time": "30/06/2022-21:49:09",
                    "content": "    monet-supply:  vault users face a lot of uncertainty about their total cost of borrowing   This is not my experience as a vaultholder. Leverage is already a risk that you’re taking on, and the potential of a price spread in Dai is one of the risks you add to the calculus. If ETH moons and I want to get out with a gain the penny isn’t going to make a difference. If ETH crashes and I need to repay the premium it’s still cheaper than the liquidation penalty. If I want to repay Dai somewhere in between those extremes I can set limit orders and wait for the price to come to me. I don’t think vaultholders are as sensitive to Dai price fluctuations as Dai holders. But Dai holders don’t generate any sustainable revenue for the protocol and we can not prioritize them over our vaultholders. It also doesn’t matter if most users aren’t interested in arbing the peg. If there’s a profit to be had there it doesn’t take a majority of actors to play that market. We’ve completely destroyed the decentralized Dai arb market by becoming the centralized market maker of first resort for Dai/USDC. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.03125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#30",
                    "likes": "0",
                    "time": "01/07/2022-01:46:24",
                    "content": "While true for you it doesnt appear to generalize. You are making a Law of Small Numbers inference which suspect ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#31",
                    "likes": "0",
                    "time": "01/07/2022-13:15:25",
                    "content": "Vaultholders care about DAI/ETH or DAI/WBTC, not Dai/USDC. Does your group have any vaultholders among it’s ranks, or can you provide any testimonials from vaultholders that this doesn’t generalize? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisB",
                    "index": "#32",
                    "likes": "6",
                    "time": "01/07/2022-13:31:20",
                    "content": "We (Oasis through Maker) do have just over 1B Dai in Dai/USDC GUNI Vaults where the semi-guarantee of 1:1 price is very very reassuring for them, I think. Not least when viewing on the UI, they don’t see a worse-case based on slippage (because right now it is at 0), which at ~50x looks pretty considerable compared to their original deposit. But yea, we definitely do have vault holders with an interest in Dai/USDC price. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.014795918367347
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#33",
                    "likes": "1",
                    "time": "01/07/2022-13:50:37",
                    "content": "That’s fair. I expect LP holders would want their tokens to stay stable. I suspect that those LP holders would also like to earn more fees on volume, which is what increasing the PSM fee does. Personally, I’d love for ETH to only go up, but I have to let the market decide that. It should be noted that with these GUNI vaults the protocol is earning nothing or next-to-nothing, and like the PSM, it allows these holders to pass the long-term risk of these assets to the Maker protocol, which isn’t adjusting for holding that risk with stability fees.  Screenshot from 2022-07-01 09-33-49878×918 57.5 KB  We’ve had a pretty rock-solid peg for over a year now, yet the vaultholders are leaving. I’m a vaultholder, and I’m telling you that this isn’t working, the peg isn’t what keeps people in vaults. Having 80% of our backing in regulated stablecoins is turning people off though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#34",
                    "likes": "0",
                    "time": "01/07/2022-14:09:50",
                    "content": "ChrisB answered this better than I could ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#35",
                    "likes": "0",
                    "time": "01/07/2022-14:17:34",
                    "content": "I mean, not really though. If Dai price goes to, say, 1.01, then GUNI holders end up fully weighted in USDC well before that with very little slippage due to the tight V3 pairing. If anything that just means the protocol ends up being more overweight USDC via these tokens. What are we planning to do about retaining customers that actually pay us? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.67155612244898
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#36",
                    "likes": "0",
                    "time": "01/07/2022-14:28:43",
                    "content": "Well the plan is to start investing the USDC, so we don’t need customers to actually pay us. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#37",
                    "likes": "1",
                    "time": "01/07/2022-14:36:22",
                    "content": "By taking Dai’s collateral backing and putting it off-chain? That’s not the project many of us are here for.  Screenshot from 2022-07-01 10-34-291356×610 102 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#38",
                    "likes": "2",
                    "time": "01/07/2022-14:51:29",
                    "content": "Projects change. The DAO has approved tens of millions in spending to develop off-chain collateral. That shows a lot of commitment to the direction and is unlikely to be reversed anytime soon. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving additional perspective on proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisB",
                    "index": "#39",
                    "likes": "1",
                    "time": "01/07/2022-15:14:22",
                    "content": "I agree it isn’t totally bad - and I didn’t mean to get into a point of why we shouldn’t change it. Your most recent point about the increased volumes is also very valid, and may actually lead to more value to the users than any potential slippage. I was simply just trying to echo that we do have vault users who are interested in seeing a 1:1 peg though - because when Dai is above a dollar, because we’re at 50x - we have to get a lot of Dai from somewhere to repay the position from the flashloan. Likewise though, if it’s less, could be very profitble to close. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1810897435897445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#40",
                    "likes": "1",
                    "time": "01/07/2022-16:53:48",
                    "content": "What is DAI? “DAI is a decentralized stablecoin” that without the PSM, as history proved, would not be a a reliable stablecoin. Since stablecoin was not defined in that document, we would need to assume the market definition, which defines a stablecoin as a pegged coin to an external reference. The mechanism for DAI to maintain its peg is a top priority but secondary based on that document. But the real question may be “Can the PSM model work with non centralized / non stablecoins options (i.e. USDC, RWA)?” I really dont know, but really wish the answer was yes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#41",
                    "likes": "0",
                    "time": "01/07/2022-17:28:28",
                    "content": "“Decentralized”, “unbiased”, and “collateral-backed”, appear before the phrase “soft-pegged to the US Dollar”. If we want to throw out the white paper, let’s hold a Maker vote as a referendum on the document so it’s clear to everyone that that’s what’s happening here.  Screenshot from 2022-07-01 13-26-191312×322 49.1 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#42",
                    "likes": "1",
                    "time": "01/07/2022-19:19:22",
                    "content": "It is still all of those things… Decentralized - (of an activity or organization) controlled by several local offices or authorities rather than one single one. MKR holders dictate what happens to DAI Unbiased - showing no prejudice for or against something; impartial. Everyone can participate. Collateral-Backed - A collateral loan is often called a secured loan. This means the loan is guaranteed by something you own. DAI is generated by collateral ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.660714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#43",
                    "likes": "0",
                    "time": "05/07/2022-23:04:48",
                    "content": "The PSM should cost something. And should be capped. 84% stablecoin backing… Nobody bothered by this? We currently have only a bit over 1 Billion income producing Dai everything else basically doesnt fund anything. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#44",
                    "likes": "0",
                    "time": "05/07/2022-23:36:40",
                    "content": "IMO the PSM itself is not the main problem. It highlights behaviours that are expected during uncertain times such as flight to safety due to crypto price declines, inflation, war, etc and specifically highlights DAI’s demand among other stablecoins. Vault liquidations, lack of lending incentives, inflated budgets and PSM fund investment should be the focus. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.816666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#46",
                    "likes": "1",
                    "time": "06/07/2022-02:55:03",
                    "content": "Thats a great analysis     Traster_Tray:  Currently, a lot of DAI demand is coming from crypto being sold for safety as people are scared of forced liquidations and margin calls causing further market drops. Because of it is so conservatively overcollateralized and relatively proven liquidation system, DAI is seen as safe. Owners continue to hold in DAI because these owners still want to keep assets on-chain   Yes it will be interesting to see what happens to DAI demand from PSM when the bull run returns and those funds return to risky assets. Will it be stable enough to maintain off-chain investments? We shall find out     Traster_Tray:  Open question - what other use cases are there for DAI holders?   I would think other DAI use cases include:  New crypto users first product Store of value in unstable economies Store of value for crypto traders Participating in DeFi Global remittances Transfers between crypto users On-chain Payroll for other crypto projects  I do think that for DAI demand to remain stable or increase in bear/bull markets use cases need to expand, I have seen ideas to expand DAI to other L1s, L2, finance RWA, expand PSM collateral, etc but would love to see use cases for the everyday person. Thinking something like partnering with Venmo/Cash App would be interesting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5753588516746415
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#47",
                    "likes": "2",
                    "time": "08/07/2022-18:56:56",
                    "content": "Yesterday’s Gov and risk call had a lively chat about this topic. Signalling then adding a fee change might not be the best next step, but it will likely be one of the outcomes. More importantly, the question we’re really asking is: do we want to encourage vault opening (revenues) or market parity through liquidity? (which we also don’t get paid for) They are intrinsically linked, but my hunch is that @brianmcmichael  is more correct, other platforms exist that are far more efficient for arbing peg discrepancies.  I took this note yesterday (forgive me @rema)  “What we could do, is set hard peg limits higher than 1:1, at like 1-3% tin and have some of both worlds; assurance that peg wont spike and this arbing game of soft peg mechanisms”  Understanding these questions via polls would be helpful:  What level of backing is the community comfortable backing DAI ? 30, 40, 50, 60 % ? 0 ? Should we turn on tin fees above that level? What amount of USDC on the books is needed for predictable RWA generation and management? What are the hard peg limits?  I think these parameters should be on the table at the MOMC tbh. In conjunction with understanding community sentiment we can slowly unwind what isn’t necessary, send a signal that we don’t want to make a market above a certain level, and put the assets to work when we have them above an acceptable amount. Ancillary questions:  How do we not rug GUNI vaults? Is there something creative we can do working with Curve etc.?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.638463203463203
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#48",
                    "likes": "0",
                    "time": "17/08/2022-16:45:57",
                    "content": "Thanks everybody for their comments - there is a follow-up signal request running on this topic here. See you on the other side  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1875
                }
            ]
        }
    ]
}