{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dai-lights-reunion-tour/16636",
            "title": "Dai-Lights Reunion Tour ",
            "index": 16636,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "summary"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#1",
                    "likes": "16",
                    "time": "15/07/2022-20:22:48",
                    "content": " Dai-Lights Reunion Tour  6912×3456 1.11 MB  Hey all - been a while. For the first time, this will be posted without any “guiding” input. Just me -  your average Dai-curious forum-goer. As such, you may notice a few changes to style, including tone, content, emoji usage, etc. Whatever happens, happens.  Previously on Dai-Lights: Bulls were stampeding, Dai was flowing, Do Kwon was the self-proclaimed “master of stablecoin”, and Zhu Su was calling for a supercycle… so, we might have some catching up to do.   As you likely expected, the total DAI bridged to various chains has fallen dramatically in the last 6 months.   Celo saw the largest decline, posting a crisp 93.83% 6-month decrease in circulating DAI.  Gnosis Chain (formerly xDAI) stayed fairly neutral, with only a 1.13% drop in circulating DAI. Need to do more digging here, but the rebrand and updated business model seem to be working out for them.  Though, Celo’s loss comes on a technicality, as all 6M DAI on Harmony remains entirely unbacked after a hack saw North Korea’s Lazarus Group siphon and launder 100% of the funds held in its ERC-20 bridge contract. There exists a strong possibility of a multi-chain future, but for that vision to come to pass, the first order of business is likely bridge security.  EVMs Finally. All the noise can be condensed into one tidy category. Combined this network bebop holds around 779.45 million DAI or 11.25% of the current supply, down a collective 580.27% in the last 6 months. Not much has changed on this front. The total DAI circulating on these chains fell, but mostly in tandem with the total supply. The lone contradiction is BSC, where it appears CZ may have finally updated the numbers. Total DAI circulating on the chain hadn’t budged by more than a percent in over a year. Today that 262M DAI has finally fallen to a more realistic figure of 162M. Click for an overview of the current L1 EVM landscape  https://i.imgur.com/bKptDiG.gif(image larger than 4 MB)   Layer-2s L2s were a footnote section in previous posts. DeFi was thriving and Ethereum was near max network utilization. So, the majority of us sought alternate routes to capitalize on those sweet, sparkly yields. But like you can’t really buy friends, you can’t buy a loyal userbase. As gaudy liquidity mining programs dried up and the markets tanked, those of us that are still here have moved, and finally, L2s are handling a decent sum of the traffic.  Despite the massive market drawbacks, L2s managed to gain in DAI market share, posting a collective 56.2% increase in 6-month circulating DAI.  Arbitrum There’s a lot happening on Arbitrum, though two-thirds of the big players are household names around here.  Aave Curve GMX  I won’t bother with the first two, but GMX is a new one. The project went on to launch on Avalanche, though the majority of its volume flows through Arbitrum. GMX is, in a sense, an amalgam of DeFi’s more successful concepts from the past year. The project houses two flagship tokens.  1. GMX, a governance token 2. GLP, an index token comprised of wBTC, ETH, DAI, USDC, UNI, LINK, FRAX, and USDT in varying proportions based on risk.  Alongside the flagships are a derivative and a subtoken, esGMX and multiplier points. A user staking GMX or GLP earns a percentage of all trading fees, and over time, accrues multiplier points to boost individual APR. How these trading fees are generated makes the platform interesting. GMX features three markets: leveraged longs, leveraged shorts, and swaps. GLP providers earn a percentage of the losses incurred by the leveraged trades made on the platform, and as the average trader operates in the red, GLP providers are, more or less, the “house”. Financial schema aside, GMX is interesting because of the index it utilizes.  While still overshadowed by USDC, DAI represents nearly twice the index share of USDT and FRAX combined. Hopefully, this is a sign of changing times, and the interest in a battle-tested, decentralized, fully collateralized stablecoin continues into the next wave of innovation.  Optimism  Optimism has been slow to gain traction. Once thought the obvious incumbent for the most trafficked Optimistic rollup (I mean come on, you have it in the name), the protocol was beaten to the punch. Arbitrum launched and Ethereum-based protocols began to port. And once Optimism had finally readied itself, it didn’t quite get the expected reception. Only a small sampling of projects have launched on the chain, though those that have do see respectable volume. The network features the usual Ethereum combo platter of Curve, Uniswap, and Aave, but a new project finally joined the mix. Velodrome is a DEX incorporating a couple of successful concepts utilized in the last bull run, and another that never got the chance to be fully explored. Click for more info on the Velodrome protocol, including DAI usage   The network utilizes two separate but linked governance tokens. 1. VELO, the governance token 2. veVELO, an interest-bearing NFT derivative of the VELO token. veVelo is an ERC-721 interest-bearing NFT. When a user stakes VELO, the stake must be locked for a pre-selected period of time. In return, these users receive veVELO, which can be used to vote on pool weightings and “bribes”.  While nothing explosive, the platform’s seen its fair share of DAI inflow, particularly recently.  Velodrome stats1441×260 7.86 KB    Zero-Knowledge Rollups (ZKs)  Optimistic rollups (ORs) are here for the now. ZKs represent a future of even lower fees and higher transaction throughput, but the tech still needs work. The ZK darling to this point has been Loopring, though this came off the back of its partnership with Gamestop (GME). Despite the noise, not much DAI has moved over, with the chain seeing a 6-month drop-off of 22% in on-chain DAI. The real action is happening on zkSync. After its successful launch of a zkEVM testnet (a ZKR capable of running smart contracts), its list of upcoming projects is growing. That said, the majority of active dApps are comprised of myriad bridges and fiat on-ramps. ZigZag accounts for the only active DEX order book, but it’s seen a fair chunk of volume all the same. Last week, ZigZag saw around 372k DAI change hands through various pairs (extrapolating from 24-hr volume). Click for a short look into the technical side of Optimistic vs. ZK rollups   ORs are better suited for most general use dApps. This stems from its use of the OVM, or an ‘optimistic implementation’ of the Ethereum Virtual Machine. This enables optimistic rollups to behave in near parity with their L1 counterparts, allowing for a rollup that looks and feels like Ethereum mainnet. While no code is run on-chain by default, “fraud-proofs” gives network operators the ability to run a transaction if needed. This ability to run arbitrary code makes porting a project a simple matter of deployment rather than an issue of infrastructure. ZK’s, on the other hand, focus on two areas: scalability and privacy. Given Ethereum’s current limitations, scalability is the primary area of concern. Today, ZKs do quite well with simple interactions, like token transfers and swaps. That said, with zkSync’s recent announcement - and subsequent launch - of a a zkEVM testnet, full interoperability may not be as far off as once thought.     DAI Volume Visualized  Dune Dashboard Click for more charts (taken from the above dash) A 6-month Look into L1 Bridge Volume    CEX DAI Volume      Disclaimer: None of this should be taken as financial advice. As I said, I’m just another Dai-curious denizen. All the same, thanks for reading, skimming, or scoffing! ",
                    "links": [
                        "https://i.imgur.com/bKptDiG.gif",
                        "https://dune.com/queries/998618/1727464",
                        "https://defillama.com/protocol/gmx",
                        "https://defillama.com/protocol/velodrome",
                        "https://ecosystem.zksync.io/",
                        "https://info.zigzag.exchange/",
                        "https://blog.matter-labs.io/zksync-2-0-public-testnet-is-live-de870ba9632a",
                        "https://dune.com/alec/Dai-on-Different-Networks",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/6",
                        "https://forum.makerdao.com/t/gira-de-reunion-de-dai-lights-traduccion/16790",
                        "https://forum.makerdao.com/t/multichain-market-musings/16909",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-14-20-de-julio-del-2022/16911",
                        "https://forum.makerdao.com/t/dai-lights-news-moves-and-layer-2s/17188"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.603730374563708
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "16/07/2022-21:05:35",
                    "content": "I missed these summaries of where DAI was in other EVMs and chains. Thanks for coming back! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#3",
                    "likes": "2",
                    "time": "16/07/2022-21:54:19",
                    "content": "Nice report. Ideally we move to self updating, crystal clear dashboards so that anyone can access them. This is a great first step.  PS, are you adding the averages? They should be volume weighted to give useful information. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#4",
                    "likes": "2",
                    "time": "16/07/2022-22:45:22",
                    "content": "First time I saw this jewel, awesome work my friend, it was perfect to maridate with a cup of coffee or a glass of wine. I must confess that I am fascinated with the quality of your work in detail upon DAI stats on the ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "2",
                    "time": "17/07/2022-18:32:36",
                    "content": "Bruuuuuuuh!! Good to see you back! I always appreciated your willingness to report the cross-chain growth of DAI. Something some here tend to forget. Glad to see you posting again. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#6",
                    "likes": "1",
                    "time": "18/07/2022-17:47:33",
                    "content": "Thank you all for the warm reception!  Was worried it would go unread.     juan:  PS, are you adding the averages?   And appreciate you highlighting this! The majority of the data I collect by hand through various explorers, but working on transitioning to either CSV dumps or parsing through a node directly. In the meantime, I’m working on a few queries to better encapsulate individual growth! Again, thank you all for the kind words. Missed y’all way too much to stay away for long. My end goal will always be to benefit the Maker Community as a whole - from delegates on down. As such, I’m open to any and all requests and critiques for future posts! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.689814814814815
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#7",
                    "likes": "3",
                    "time": "24/07/2022-21:52:02",
                    "content": "I was surprised by the DAI circulating data in Avalanche (234M), it´s the blockchain with the highest DAI circulating outside Ethereum and by far ahead of BNB Chain (162M) which is the blockchain that follows. When Maker Teleport comes out, DAI will explode in that network. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#8",
                    "likes": "2",
                    "time": "27/07/2022-21:00:47",
                    "content": "Nice job putting all of this together! It’s really interesting to see what Optimistic rollups’ future holds in comparison to their Zk counterparts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.083333333333334
                }
            ]
        }
    ]
}