{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/decentralized-makerbroker/2691",
            "title": "Decentralized MakerBroker ",
            "index": 2691,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "idea"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Graciouseats",
                    "index": "#1",
                    "likes": "1",
                    "time": "01/06/2020-15:25:35",
                    "content": "Maker as a decentralized broker:  User deposits Stocks, Bonds, commodities, etc. as collateral Maker, as smartcontract other party, would manage those assets during the duration of loan in the real market 2.a. This would allow MakerBroker to hedge trades and limit their risk. If contract became undercollateralized, liquidation would occur as it does now with ETH being used as collateral.  Perhaps there would be different parameters surrounding these types of deposits (i.e. length of loan time and which Stocks, commodities would be accepted, etc.).  Or not… MakerBroker would internally manage these loan holdings during the duration of the loan. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-6/2914"
                    ],
                    "GPT-summary": "The post explains the concept of a decentralized MakerBroker, where users can deposit various assets as collateral and Maker would manage those assets during the loan period. The post suggests that this would allow MakerBroker to hedge trades and limit their risk. The author does not ask for feedback or collaboration, but a 3rd party could give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RepoTactics",
                    "index": "#3",
                    "likes": "4",
                    "time": "22/06/2020-15:32:32",
                    "content": "Are you talking about setting up a SPV that would accept collateral and similarly utilize Maker’s CDPs as Tinlake? From my understanding, since the GFC, securities-based lending has been a strong area of growth for Investment Banks. This has been facilitated by extremely low-interest rates and rising asset prices. Traditionally, securities-based lending has mainly been available to the ultra-wealthy, but it would be interesting if Maker and MakerBroker marketed towards a broader (and more inclusive) market. If this is where you’re going, this could be an excellent way to achieve one of The Foundation’s Core Principles of Serving the Underserved. I’m trying to make sure I fully understand your proposal, so please bear with me if I do not understand your proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.6875
                }
            ]
        }
    ]
}