{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip41c4-sp26-sidestream-auction-services-facilitator-onboarding-sas-001/10797",
            "title": "MIP41c4-SP26: Sidestream Auction Services Facilitator Onboarding - SAS-001 ",
            "index": 10797,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "4",
                    "time": "06/10/2021-14:19:13",
                    "content": " MIP41c4-SP26: Sidestream Auction Services Facilitator Onboarding - SAS-001  Preamble MIP41c4-SP#: 26 Author(s): @danik Contributors: @BracketJohn, @lukass, @builderman, @wouter, @juan, @Petru_Catana, @lollike, @Njoku_Emmanuel Tags: core-unit, cu-sas-001, facilitator Status: Accepted Date Applied: 2021-10-06 Date Ratified: 2021-11-22   Sentence Summary MIP41c4-SP26 onboards Daniel Kremerov(@danik) as Facilitator for the Sidestream Auction Services Core Unit.  Specification  Motivation I discovered the ​​crypto ecosystem a few years ago and have followed along since then as a hobbyist. Now I am excited about the opportunity to dedicate more of my time to it. From an early age, I’ve been interested in economics. Still, after studying and working in Finance, my professional career moved into technology, as I discovered a passion for building digital products. This passion resulted in founding a company, SIDESTREAM, that is dedicated to building software products. Throughout time, my excitement for the crypto ecosystem grew tremendously. On the one hand, it combines my passions for economics and technology. On the other hand, it fits perfectly with my personal values and worldview. At the beginning of 2021, I set myself the following goal: Find a way that allows me to dedicate more of my time and attention to the crypto ecosystem. I was very lucky to discover the SES Incubation Program. Since joining the program in June 2021, my excitement for the crypto ecosystem and the MakerDAO in particular grew further: I engaged with different community members and dived deeper into the protocol mechanics. Through that, I realized that Maker is based on a very solid foundation and a forward-looking mindset in terms of people, governance and engineering. Now I would like to formalize my commitment to the success of MakerDAO while taking on additional responsibility and accountability. Besides, I hope our journey can serve as a role model to other existing companies that want to ​contribute to MakerDAO’s future success.  Core Unit ID SAS-001  Core Unit Name Sidestream Auction Services  Facilitator Name and Information  Name: Daniel Kremerov Location: Cologne, Germany (Central European Summer Time) Forum: @danik  Discord: danielkr#9058 Ethereum Address: TBD   Facilitator Credentials  Experience at Sidestream  Co-founded the software development agency SIDESTREAM GmbH at the beginning of 2020 Grew the company to 7-figure revenue and 20 employees within less than two years Acquired and led software development projects for a variety of mid- and large-cap customers. You can find the portfolio here    Other Experience and Education  Started a few tech-related projects and ventures, among others an IoT Startup for Beekeeping Worked in an IT Consultancy and in Product roles for two Startups University Degrees in Finance and Computer Science from University College London, Maastricht University, National University of Singapore   Facilitator Commitment My role is to support the mandate and business continuity of the Sidestream Auction Services Core Unit (SAS). A non-exhaustive overview of my responsibilities includes:  Be the main point of contact to the community, other core units and further stakeholders  Facilitate communication and collaboration with all stakeholders Engage with the community and synthesize feedback for the team to help iterate on ideas Communicate team updates, roadmap, and releases to the community Attend meetings to represent SAS   Consistently demonstrating to stakeholders how our contribution brings value to the protocol  Maintain visibility and transparency for all work identified, planned, and completed Act under principles of transparency and accountability and deliver relevant budget reporting   Running SAS as a business  Define core unit management framework and team OKRs Build and retain a high performing team Maintain legal and financial structures of the Core Unit Draft and deliver MIPs     Related Documents  MIP39c2-SP25: Adding Sidestream Auction Services Core Unit - SAS-001 MIP40c3-SP43: Adding Sidestream Auction Services Core Unit Budget - SAS-001 MIP40c3-SP44: Adding Sidestream Auction Services Core Unit MKR Budget - SAS-001  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp-adding-sidestream-auction-services-core-unit-sas-001/10796",
                        "https://forum.makerdao.com/t/mip40c3-sp-adding-sidestream-auction-services-core-unit-budget-sas-001/10799",
                        "https://forum.makerdao.com/t/mip40c3-sp-adding-sidestream-auction-services-core-unit-mkr-budget-sas-001/10802",
                        "https://forum.makerdao.com/t/mip40c3-sp95-modifying-sidestream-auction-services-core-unit-budget-sas-001/19737",
                        "https://forum.makerdao.com/t/mip40c3-sp43-adding-sidestream-auction-services-core-unit-budget-sas-001/10799",
                        "https://forum.makerdao.com/t/mip39c2-sp25-adding-sidestream-auction-services-core-unit-sas-001/10796",
                        "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-20-sidestream-auction-services/10959",
                        "https://forum.makerdao.com/t/mip40c3-sp85-modify-sidestream-auction-services-core-unit-budget-sas-001/18253"
                    ],
                    "GPT-summary": "The post is a proposal for onboarding Daniel Kremerov as the Facilitator for the Sidestream Auction Services Core Unit. The author explains his motivation for joining the crypto ecosystem and his commitment to the success of MakerDAO. The proposal includes information about the Core Unit ID, the Facilitator's credentials, and his commitment to the role. A 3rd party gives entirely positive feedback on the proposal and extends support to the author.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.603828828828829
                }
            ]
        }
    ]
}