{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dai-on-different-networks-15-october-14-2021/11019",
            "title": "Dai on Different Networks #15 - October 14, 2021 ",
            "index": 11019,
            "category": [
                "Core Units",
                "Core Unit Archive"
            ],
            "tags": [
                "summary",
                "update",
                "archive-mkt-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#1",
                    "likes": "3",
                    "time": "14/10/2021-21:32:09",
                    "content": " Dai on Different Networks #15  If you missed last week’s update, here’s a link to Dai on Different Networks #14.  Dai on Different Networks: The Dashboard   Highlights The bridges are packed and the liquidity mining rewards are worth a double-take. I think it’s safe to say DeFi Fall is upon us. Which brings us to this week’s theme: bridging.  Bridging is the new cool. Liquidity mining incentives and weekly protocol drops are dragging users from chain to chain. The flavors of the month are Avalanche and Fantom, and the bridge of choice has been AnySwap. The bridge now has over 5bil in TVL with 3.9bil headed towards the Fantom network. The Avalanche-Ethereum Bridge also been seeing its fair share of volume, with over 253 million Dai now held in its contract.  Fantom’s become very active, very quickly. The Geist money-market surprise-launched on October 3rd before locking up over 2bil in assets in under a day. That growth has slowed but it hasn’t stopped, with its actualized TVL now seated at a comfy 7.3bil. With strong incentive offerings for both Dai deposits and borrows, the protocol has managed to lock in around 213 million Dai. Geist, as well as the farming protocols Curve, SpookSwap, and SCREAM drove around 45 million Dai to the network last week, pushing the Dai circulating on the chain to over 320 million - or around 4.5% of Dai’s total supply.  Avalanche is trending back up. An underwhelming launch of the Avalanche Rush liquidity mining program saw users migrate to Fantom in droves, but the trend has reversed and humble farmers are once again migrating back to the chain. Aave is the money market of choice, with over 250 million in Dai locked into its contract. Through the protocol, users have generated around 446 million in leveraged Dai. Over 266 million Dai now lives on the chain or 3.78% of Dai’s total supply.  Overview  Where is my Dai (General)  overview921×370 54 KB  Source  This week’s overview shows a combined 9.6% increase between bridges, lending protocols, and DEXs. The ‘Other’ category also took a nice hit, with a net decrease of almost 7%.   Dai on Rollups  Source  Where is my Dai (Bridged)  All Assets  TVL of bridged assets929×430 38.5 KB   Dai now represents only 3.7% of the assets bridged from Ethereum.   Dai Bridged from Ethereum  Weekly Dai bridged from Ethereum1441×348 23.1 KB   Circulating Dai by Platform As of October 14, 2021   By Platform  Circulating Dai Visualized  709×384 35.1 KB   Week-over-Week Visualized  714×388 19.7 KB   Avalanche With so much activity happening on-chain, we’ll continue to track Avalanche’s top wallets as the network grows. To start, here’s a brief rundown of Avalanche’s three-chain network:  The Contract (C-Chain) chain is EVM compliant, allowing devs to copy/paste projects and enabling easier bridging for end-users. Platform (P-Chain) chain controls validators and creates “subnets” or sharded side-chains. The Exchange (X-Chain) chain is used for the creation and exchange of assets.  We’ll be focusing on the C-Chain, where nearly all the network’s current Dapps are housed.  AVAX Markets849×318 27.4 KB   Bridges  AnySwap - Cross Chain Protocol Avalanche Bridge: Transfer Assets To and From Ethereum   Fantom  Farms  FTM Farms974×367 32.4 KB  Curve’s 2pool (USDC-DAI) is predictably the top yield farming protocol to park Dai on the Fantom chain, though it’s seeing A LOT of recent competition.  Money Markets & Bridges  FTM MMs &amp; Bridges971×370 26.1 KB  Geist is the native money market on the Fantom chain, launched with support by the Fantom Foundation. With a true money market now in place, the chain has seen users come in droves. AnySwap is the preferred bridge to the network, as its top AMM, SpookySwap, utilizes the bridge natively.  Current Events  Fantom Newsletter   Bridges  AnySwap - Cross Chain Protocol https://multichain.xyz/ SpookySwap   Solana  Solana Top Wallets709×209 14.7 KB   Current Events  Solana Newsletter   xDai  Source  Current Events  xDAI Newsletter   Bridges  https://omni.xdaichain.com/   Notes & Feedback  Huge thank you @flipflopflapdelegate and @MakerMan for all the contributions and feedback!  Have anything you’d like to see added to these breakdowns? Leave a message in the comments or DM me, @seth, or @JerryAG. Thanks for reading!  Tracking Tools  DAI  Dai on Different Networks Dash Dai-Curious Dashboard Dai Stats Maker Burn  Maker Analytics Dashboard - @SebVentures  Block Analitica Dai Markets Dai Bought on Uniswap/hr   Block Explorers  Avascan BSCscan FTMscan scope.Klaytn Polyscan Solana Explorer xDai Blockscout   Bridge Metrics  IntotheBlock Blockscout Bridged Token List Poly Bridge   DEX  HoneySwap Analytics xDAI/Polygon Curve Analytics PancakeSwap Token Analytics DEX Metrics SushiSwap Token Pairs Pangolin Analytics   Misc  Dappradar Rankings xDAI Analytics Dashboard Stablecoin Metrics Comprehensive List of Explorers and Aggregators A Community-built List of Every Project on the Polygon Chain Loopring Dune Analytics DAI in zkSync TVL for all Bridges Layer-2 Overview  This is for informational purposes only. We do not endorse any of the projects referenced in this update. Always do your own research before making investments and/or using DeFi products and services. ",
                    "links": [
                        "https://dune.xyz/alec/Dai-on-Different-Networks",
                        "https://anyswap.exchange/dashboard#/router",
                        "https://defillama.com/protocol/anyswap",
                        "https://etherscan.io/token/0x6b175474e89094c44da98b954eedeac495271d0f?a=0xE78388b4CE79068e89Bf8aA7f218eF6b9AB0e9d0",
                        "https://defillama.com/protocol/geist-finance",
                        "https://dune.xyz/SebVentures/maker---accounting_1",
                        "https://bi.etherscan.io/public/dashboards/Z6PuB2HTLK4tGOCtrYvP65seYXGWfLea76mknRu6",
                        "https://anyswap.exchange/dashboard#/router",
                        "https://aeb.xyz/#/transfer",
                        "https://www.fantom.foundation/blog/",
                        "https://anyswap.exchange/dashboard#/router",
                        "https://multichain.xyz/",
                        "https://spookyswap.finance/bridge",
                        "https://medium.com/solana-labs",
                        "https://duneanalytics.com/maxaleks/xDai-Usage",
                        "https://xdai.substack.com/p/-xdai-weekly-recap-august-06-2021",
                        "https://omni.xdaichain.com/",
                        "https://dune.xyz/alec/Dai-on-Different-Networks",
                        "https://dune.xyz/alec/Where-is-my-Dai",
                        "https://bit.ly/2Twk7Mc",
                        "https://bit.ly/3Br1mdX",
                        "https://bit.ly/2UqMUlT",
                        "https://forum.makerdao.com/u/sebventures/summary.",
                        "https://bit.ly/3eK2Vdg",
                        "https://nomics.com/assets/dai-dai/markets?interval=7d",
                        "https://duneanalytics.com/bobbyb/eth_12",
                        "https://avascan.info/blockchain/x/asset/2HG68eGcW1Xn8JcLuMZzLdT54Y394odWjPmLgfkbSfPZDgTM9v",
                        "https://bscscan.com/token/0x1af3f329e8be154074d8769d1ffa4ee058b1dbc3",
                        "https://ftmscan.com/token/0x8d11ec38a3eb5e956b052f67da8bdc9bef8abf3e",
                        "https://scope.klaytn.com/token/0x5c74070fdea071359b86082bd9f9b3deaafbe32b?tabId=tokenTransfer",
                        "https://polygonscan.com/token/0x8f3cf7ad23cd3cadbd9735aff958023239c6a063#balances",
                        "https://explorer.solana.com/",
                        "https://blockscout.com/xdai/mainnet/",
                        "https://app.intotheblock.com/coin/DAI/deep-dive?group=exchanges&chart=all",
                        "https://blockscout.com/xdai/mainnet/bridged-tokens/eth",
                        "https://duneanalytics.com/nascent/Polygon-Bridge:-(Public)",
                        "https://info.honeyswap.org/#/home",
                        "https://duneanalytics.com/pengiundev/curve-fi",
                        "https://pancakeswap.info/token/0x1af3f329e8be154074d8769d1ffa4ee058b1dbc3",
                        "https://duneanalytics.com/hagaetc/dex-metrics",
                        "https://app.intotheblock.com/insights/defi/protocols/sushiswap?address=0xc3d03e4f041fd4cd388c549ee2a29a9e5075882f",
                        "https://info.pangolin.exchange/#/tokens",
                        "https://dappradar.com/rankings",
                        "https://duneanalytics.com/maxaleks/xDai-Usage",
                        "https://duneanalytics.com/hagaetc/stablecoins",
                        "https://github.com/denisnazarov/awesome-crypto-trackers",
                        "https://awesomepolygon.com/",
                        "https://duneanalytics.com/Brecht/loopring",
                        "https://duneanalytics.com/queries/10961",
                        "https://bi.etherscan.io/public/dashboards/Z6PuB2HTLK4tGOCtrYvP65seYXGWfLea76mknRu6",
                        "https://l2beat.com/",
                        "https://forum.makerdao.com/t/maker-relay-ep-67/11076",
                        "https://forum.makerdao.com/t/maker-relay-ep-67-en-espanol/11113"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.756077441077441
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "5",
                    "time": "14/10/2021-22:05:46",
                    "content": "This is getting so long I am going to have to take some time to read. You need a DAI at a glance - 1 pager to go with this that has the salient highlights. I still am wanting to just see a $$ DAI went to, and gone from in a list of largest gainer to 0 and 0 to largest loser. I see you pointed out about ‘bridges’     alec:   Bridging is the new cool. Liquidity mining incentives and weekly protocol drops are dragging users from chain to chain.   Something to think about because I see Celo warming up to basically provide bridging functionality between multiple networks. I really would like to hear anyone from Protocol Engineering, Growth, whomever chime in on an issue I see cropping up which may lead to an opportunity for Maker. Bridges if you anticipate a N2N (network 2 network) topology will always require 2*N the DAI funds to exist for N DAI funds to move from one network to the next.    Lets say we want to have funds to move 1000 DAI in a single bridge that covers K networks. This is going to mean K*1000DAI just for 1000 DAI to move from one network to another so the liquidity profile will look like 1000 1000 … … 1000 0 2000 1000 One network will have 2000 in liquidity which now can only move to 1 of the K-1 other networks etc. after only 1000 DAI moves.   Not very capital efficient. This is if we only have one protocol bridge, this gets worse if we have 3 bridges trying to supply 1000 DAI to all K networks. Here are the questions. Is the bridge liquidity bi-liquid.  Meaning instead of one protocol having 1000 1000 … … 1000 on each network does each protocol have to have 1000-1000 (on each network pair due to the fact that bridging is a cross network atomic swap). Implications of bridges between networks being limited to cross network atomic swaps is that liquidity to provide these 1000DAI on each side of K networks becomes 2Kliquidity vs K*liquidity. Those numbers are for a single bridge.  What if there are multiple bridges B? Then we end up with liquidity requirements that scale at BKliquidity. What this means is that even if we evenly distribute existing DAI the average DAI available on each side of a bridge is going to look like MINTED_DAI/B*K.  Say we have 10 networks and 3 bridge players trying to bridge all of them 6B/30 = 200M/bridge side.    But this assumes all DAI is available.   If DAI available for bridging is only like 10-20% this number drops to 20-40M/bridge side. Which as a problem begs a solution that only Maker might be able to provide.   Since DAI would live in these bridge contracts and would never be available to anyone unless they provide DAI on another side of a bridge isn’t Maker uniquely suited to run DAI bridges everywhere? Because DAI sitting in these bridge contracts basically makes no claim on the system.  Maker in principle could mint this DAI unbacked to be used to make these bridges highly liquid in DAI. By running the exclusive DAI bridges Maker could reduce bridging fees across these network to make DAI cheap and liquid.  All the protocol has to do is come up with the bridging technology that protects the unbacked DAI in these contracts (or figures a good way for how to deal with this).  Should there be reason to limit DAI in these contracts then also works with some bridging keepers to basically cycle the DAI as necessary to ‘rebalance’ the bridges should there be reasons to only have so much DAI liquidity in these things. Is there a real opportunity here or is Maker still stuck under the security assumptions of the bridging network to be obligated to use backed vs. unbacked DAI on these networks? Is there a solution to this problem that can be a opportunity uniquely suited to Maker solving? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.50736073137389
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "3",
                    "time": "14/10/2021-23:08:37",
                    "content": "    MakerMan:  You need a DAI at a glance - 1 pager to go with this that has the salient highlights.   I actually think this weekly post is one of the best sources for DAI alpha, for the Maker Community. Unfortunately, “Few”     MakerMan:  Because DAI sitting in these bridge contracts basically makes no claim on the system. Maker in principle could mint this DAI unbacked to be used to make these bridges highly liquid in DAI. By running the exclusive DAI bridges Maker could reduce bridging fees across these network to make DAI cheap and liquid. All the protocol has to do is come up with the bridging technology that protects the unbacked   I believe a lot of your concerns about bridging DAI and if it’s native is why PECU built the Arbi and Optomism bridges. But having said that — as you can see from this report Avalanche has a large amount of DAI that has bridged-over via the Avalanche bridge. I also have had questions with regards to bridging DAI over, specifically to Hop Exchange and @bartek was kind enough to post this on the forum: Hop Protocol - Google Slides It would be interesting to hear more people’s thoughts on minting unbanked DAI — personally I would be against it, but I do no wish DAI was more in abundance in some of these other bridged protocols. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.36510989010989
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#4",
                    "likes": "2",
                    "time": "18/10/2021-23:09:09",
                    "content": "First off - thank you  Was looking into this a bit over the weekend, and there’s definitely an avenue to explore. Whether or not it’s actually worth pursuing is an entirely different conversation, but still - over 300m Dai on Fantom with the AnySwap contract holding just under 90% of that total. Also over 7m in the Synapse contract, which I’m pretty sure has only been around since mid-August. Forgive the gradient abuse - I missed Excel…  1189×654 20.1 KB  I’ve been using a good bit of Fantom and it’s nice to see a Dai pair on every protocol. Orion’s also pretty interesting. Deposit on mainnet for access to Terra’s stablecoin APY’s without bridging. AFAIK the swapping happens behind the scenes and can always be withdrawn as the initial tokens. Really smart move from a chain mostly utilizing it’s own token set. ",
                    "links": [
                        "https://forum.makerdao.com/t/content-production-bi-weekly-update-10-15-10-28/11271"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.254201680672269
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "17/11/2021-23:10:07",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/dai-on-different-networks-14-october-7-2021/10850",
            "title": "Dai on Different Networks #14 - October 7, 2021 ",
            "index": 10850,
            "category": [
                "Core Units",
                "Core Unit Archive"
            ],
            "tags": [
                "summary",
                "update",
                "archive-mkt-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#1",
                    "likes": "1",
                    "time": "07/10/2021-21:19:25",
                    "content": " Dai on Different Networks #14  If you missed last week’s update, here’s a link to Dai on Different Networks #13.  Dai on Different Networks: The Dashboard (soft-launch)  I created a dashboard to track some of the stats I’ve been reporting in real-time. Dune Analytics currently tracks Ethereum and Polygon proficiently but databases for the other L1s and L2s are limited or non-existent; that said, more are being added every week. As more information becomes available this dashboard will be updated! With the dashboard now available, we’ve made some changes to the format; namely, an extension of the highlight section and a pivot to focus on the week’s anomalies. Hopefully, this format will prove to be a more valuable week-to-week format. As always - we’re open to any all and suggestions.  Now, on to the meat and potatoes.  Highlights DeFi Summer is transitioning nicely into DeFi Fall - this time driven by absurd multi-chain liquidity mining programs. In response, humble farmers are hopping from chain to chain in search of fertile yields. And therein lies our theme of the week (and likely the month): liquidity mining.  Avalanche saw a lot of action last week after the announcement of a ~$700 million incentive program the AVAX team calls Avalanche Rush. That hype reached a peak over the weekend after the release of the long-awaited Aave and Curve protocols.  The news saw another ~20 million Dai flood the Avalanche network, now totaling a strong 211 million circulating Dai. Through BenQi and now Aave, over 394 million interest-bearing Dai are being leveraged on the chain - with the majority held in Curve and Trader Joe.   Fantom has seen peaks and valleys over the past month, but this past week was a big one.   Geist Finance launched over the weekend and saw its TVL rise from around 17k to over 2bil in 24 hours. This amounted to around 131k in Dai bridged to Fantom, or a 134% increase in circulating Dai.   Rollup szn is still underway, though some steam was lost as money moved to Avalanche, Terra, and Fantom.  Optimism and Arbitrum saw a combined 109% increase in circulating Dai or just over 10 million Dai. Optimism’s ecosystem is still a little sparse and is primarily controlled by Synthetix and Uniswap. Arbitrum’s top projects include multi-chain staples like Curve, Sushiswap, and Abracadabra (MIM).   Overview  Where is my Dai (General)  915×378 55.1 KB  Source This week saw a ton of chain-to-chain movement, and it shows, as Dai in bridges and EOAs (Externally Owned Accounts) increased by a combined 2.7%. Dai parked in lending platforms and the ‘Other’ category also saw a week-to-week decrease of 2.3%.  Dai on Rollups     Rollup Solution Circulating Dai Weekly Movement     Optimism 25,282,126.23 17.60%   Arbitrum 13,704,201.00 91.10%   zkSync 1,396,391.07 -1.47%   Loopring 512,218.35 -0.55%   Aztec 2.0 373,083.99 5.93%    Source  Where is my Dai (Bridged)  All Assets  BIG shoutout to @flipflopflapdelegate for the find!  Dai dropped from 8% of all bridged assets to 5.7% in a week, as Dai was converted the native stablecoin of various chains - UST (Terra) being a primary example.   Dai Bridged from Ethereum  Daily Dai bridged from Ethereum1432×340 42.4 KB   Circulating Dai by Platform As of October 7, 2021     Solution Circulating Dai Dai Holders Weekly Dai Movement     Avalanche 221,982,089.00 ~3,062 6.80%   Binance Smart Chain 262,125,946.10 52,311 0.05%   Fantom 202,925,265.60 4,977 133.98%   Klaytn - 6,309 -%   Polygon 283,729,628.23 64,878 -6.43%   Solana 24,422,166.27 - 9.84%   xDai 22,050,755.00 unknown 0.10%    DeFi Summer is transitioning into DeFi Fall - this time driven by absurd multi-chain liquidity mining programs. The week’s biggest mover was Fantom, seeing a week-over-week increase of nearly 134%. Avalance and Solana are also seeing solid input with respective increases of 6.8% and 9.84% in circulating Dai over the past week.  Avalanche’s top projects are Aave, BenQi, Curve, and Trader Joe. Solana’s top Dai wallets are Saber and Mercurial Finance.   By Platform  Avalanche     Solution Circulating Dai Dai Holders     Avalanche C-Chain 211,458,599.43 2,453   Avalanche P-Chain 0 0   Avalanche X-Chain 10,000,000 ?    With so much activity happening on-chain, we’ll continue to track Avalanche’s top wallets as the network grows. To start, here’s a brief rundown of Avalanche’s three-chain network:  The Contract (C-Chain) chain is EVM compliant, allowing devs to copy/paste projects and enabling easier bridging for end-users. Platform (P-Chain) chain controls validators and creates “subnets” or sharded side-chains. The Exchange (X-Chain) chain is used for the creation and exchange of assets.  We’ll be focusing on the C-Chain, where nearly all the network’s current Dapps are housed.     C-Chain Top Wallets Liquidity in Dai     Aave 93,485,731.99   Trader Joe 66,172,375.26   Benqi 30,964,211.58   Snowball 7,247,055.28   Pangolin 4,009,313.00     markets1274×486 47.5 KB   Bridges  Avalanche Bridge: Transfer Assets To and From Ethereum   Fantom     Top Holders Circulating Dai Proportion Weekly Movement     Geist 140,627,210.31 69.15% -%   Curve 30,958,980.60 15.19% -26.56%   Scream 12,775,152.24 6.26% -30.13%   SpookySwap 5,774,311 5.39% -75.64%   Other 12,789,611.45 6.65% 6.72%    Source  Current Events  Fantom Newsletter   Bridges  https://multichain.xyz/ SpookySwap   Solana  Solana Top Wallets1064×323 27.7 KB   Current Events  Solana Newsletter   xDai     Top Holders Circulating Dai Weekly Movement     HoneySwap 2,363,109 -12.45%   CHAI 687,223.327 -29.57%   Other 22,050,755.00 20.15%    Source  Current Events  xDAI Newsletter   Bridges  https://omni.xdaichain.com/   Notes & Feedback Have anything you’d like to see added to these breakdowns? Leave a message in the comments or DM me, @seth, or @JerryAG. Thanks for reading!  Tracking Tools  DAI  Dai on Different Networks Dash Dai-Curious Dashboard Dai Stats Maker Burn  Maker Analytics Dashboard - @SebVentures  Block Analitica Dai Markets Dai Bought on Uniswap/hr   Block Explorers  Avascan BSCscan FTMscan scope.Klaytn Polyscan Solana Explorer xDai Blockscout   Bridge Metrics  IntotheBlock Blockscout Bridged Token List Poly Bridge   DEX  HoneySwap Analytics xDAI/Polygon Curve Analytics PancakeSwap Token Analytics DEX Metrics SushiSwap Token Pairs Pangolin Analytics   Misc  Dappradar Rankings xDAI Analytics Dashboard Stablecoin Metrics Comprehensive List of Explorers and Aggregators A Community-built List of Every Project on the Polygon Chain Loopring Dune Analytics DAI in zkSync TVL for all Bridges Layer-2 Overview  This is for informational purposes only. We do not endorse any of the projects referenced in this update. Always do your own research before making investments and/or using DeFi products and services. ",
                    "links": [
                        "https://dune.xyz/alec/Dai-on-Different-Networks",
                        "https://twitter.com/avalancheavax/status/1445116659681923077",
                        "https://twitter.com/CurveFinance/status/1445413435676704770",
                        "https://defillama.com/protocol/geist-finance",
                        "https://defillama.com/chain/Optimism",
                        "https://defillama.com/chain/Arbitrum",
                        "https://duneanalytics.com/SebVentures/maker---accounting_1",
                        "https://bi.etherscan.io/public/dashboards/Z6PuB2HTLK4tGOCtrYvP65seYXGWfLea76mknRu6",
                        "https://aeb.xyz/#/transfer",
                        "https://ftmscan.com/token/0x8d11ec38a3eb5e956b052f67da8bdc9bef8abf3e#balances",
                        "https://www.fantom.foundation/blog/",
                        "https://multichain.xyz/",
                        "https://spookyswap.finance/bridge",
                        "https://medium.com/solana-labs",
                        "https://duneanalytics.com/maxaleks/xDai-Usage",
                        "https://xdai.substack.com/p/-xdai-weekly-recap-august-06-2021",
                        "https://omni.xdaichain.com/",
                        "https://dune.xyz/alec/Dai-on-Different-Networks",
                        "https://dune.xyz/alec/Where-is-my-Dai",
                        "https://bit.ly/2Twk7Mc",
                        "https://bit.ly/3Br1mdX",
                        "https://bit.ly/2UqMUlT",
                        "https://forum.makerdao.com/u/sebventures/summary.",
                        "https://bit.ly/3eK2Vdg",
                        "https://nomics.com/assets/dai-dai/markets?interval=7d",
                        "https://duneanalytics.com/bobbyb/eth_12",
                        "https://avascan.info/blockchain/x/asset/2HG68eGcW1Xn8JcLuMZzLdT54Y394odWjPmLgfkbSfPZDgTM9v",
                        "https://bscscan.com/token/0x1af3f329e8be154074d8769d1ffa4ee058b1dbc3",
                        "https://ftmscan.com/token/0x8d11ec38a3eb5e956b052f67da8bdc9bef8abf3e",
                        "https://scope.klaytn.com/token/0x5c74070fdea071359b86082bd9f9b3deaafbe32b?tabId=tokenTransfer",
                        "https://polygonscan.com/token/0x8f3cf7ad23cd3cadbd9735aff958023239c6a063#balances",
                        "https://explorer.solana.com/",
                        "https://blockscout.com/xdai/mainnet/",
                        "https://app.intotheblock.com/coin/DAI/deep-dive?group=exchanges&chart=all",
                        "https://blockscout.com/xdai/mainnet/bridged-tokens/eth",
                        "https://duneanalytics.com/nascent/Polygon-Bridge:-(Public)",
                        "https://info.honeyswap.org/#/home",
                        "https://duneanalytics.com/pengiundev/curve-fi",
                        "https://pancakeswap.info/token/0x1af3f329e8be154074d8769d1ffa4ee058b1dbc3",
                        "https://duneanalytics.com/hagaetc/dex-metrics",
                        "https://app.intotheblock.com/insights/defi/protocols/sushiswap?address=0xc3d03e4f041fd4cd388c549ee2a29a9e5075882f",
                        "https://info.pangolin.exchange/#/tokens",
                        "https://dappradar.com/rankings",
                        "https://duneanalytics.com/maxaleks/xDai-Usage",
                        "https://duneanalytics.com/hagaetc/stablecoins",
                        "https://github.com/denisnazarov/awesome-crypto-trackers",
                        "https://awesomepolygon.com/",
                        "https://duneanalytics.com/Brecht/loopring",
                        "https://duneanalytics.com/queries/10961",
                        "https://bi.etherscan.io/public/dashboards/Z6PuB2HTLK4tGOCtrYvP65seYXGWfLea76mknRu6",
                        "https://l2beat.com/",
                        "https://forum.makerdao.com/t/maker-relay-ep-66/10950",
                        "https://forum.makerdao.com/t/maker-relay-ep-66-en-espanol/10982",
                        "https://forum.makerdao.com/t/content-production-bi-weekly-update-9-30-10-14/11007",
                        "https://forum.makerdao.com/t/dai-on-different-networks-15-october-14-2021/11019"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5865575396825395
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "1",
                    "time": "09/10/2021-17:06:14",
                    "content": "Hey team. I have been looking at these a bit and I wondered does it make sense to have a winners/losers list by network and then by protocol. Conceptually what I want to see is where the DAI moved to, and where it moved from. I am not sure if the 100% graph works for me here because while I think % of cap is important also seeing the actual amounts help a bit.   Don’t get me wrong if you had amounts I’d be the first person saying I want to see MC as a % of total too. So maybe when it comes to winners and losers list maybe these should be in % MC? I mean 20M or 100M may seem like a lot but this is what .3% and 1.5% respectively. So tables and graphs of amounts in % of MC and $$ might also be useful. I can look for a chart but I think it is also important to state how much total DAI there is and whether this increased or decreased over the week. I keep wondering as well if the collateral backing DAI is important when it comes to the state of DAI but maybe this is a risk anaysis report thing so out of your domain. Something like N DAI outstanding this week + some reasonable high level breakdown into ETH, wBTC, rest with amount of DAI borrowed and average vault CR.   idk maybe this is a risk/vault analytics thing.   I just think it would be nice to have with the State of DAI report… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.367763157894737
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#3",
                    "likes": "0",
                    "time": "14/10/2021-15:53:13",
                    "content": "Thanks for the in-depth feedback!  I’ve been putting together this dashboard to try and track more of the internals we’ve discussed. Still in the ‘building’ stage so any feedback on the dash would be very much appreciated! Keep an eye out for today’s post! Incorporating as much as possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.328125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "13/11/2021-15:53:20",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/dai-on-different-networks-16-october-21-2021/11138",
            "title": "Dai on Different Networks #16 - October 21, 2021 ",
            "index": 11138,
            "category": [
                "Core Units",
                "Core Unit Archive"
            ],
            "tags": [
                "summary",
                "update",
                "archive-mkt-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#1",
                    "likes": "2",
                    "time": "21/10/2021-21:40:06",
                    "content": " Dai on Different Networks #16  If you missed last week’s update, here’s a link to Dai on Different Networks #15. Dai on Different Networks: The Dashboard  Highlights DeFi Fall’s been surprisingly green, an uptrend that saw another exodus of humble liquidity miners chasing gains. So, at this point, it’s settled - our theme for the month: liquidity mining and bridging.  Bridging The Avalanche and Fantom chains have had a nice back-and-forth as new platforms continue to launch with shiny, new APY’s. This week’s top mover was the Avalanche chain, which utilizes the Avalanche-Ethereum Bridge. The bridge now holds around 318 million Dai or 4.24% of the total supply. Despite the downtick, the AnySwap Bridge is still one of the largest off-chain Dai holders with over 270 million in locked Dai. As discussed in last week’s thread, in a multi-chain world - layer-2 solutions, bridge security, and Dai liquidity are topics worth further exploring. I’m working on a separate post to dive into this further.  Avalanche The Avalanche Rush liquidity mining program saw an underwhelming launch, but Trader Joe flipped the script. The farming protocol launched its incentive rewards early last week, and in response, another 61 million Dai moved to AVAX. Aave is still Avalanche’s money market of choice, with nearly 141 million Dai locked into its contract - and through the protocol, users have generated around 514 million in leveraged Dai. Over 266 million Dai now lives on the chain or 3.78% of the total supply.  Fantom The Geist money-market surprise-launched on October 5th before locking up over 2bil in assets in under a day, but as towering APY’s have toppled back to earth, that growth has finally stalled. That said, the protocol still has over 128 million Dai locked in its contract, and the recent release of a Geist 3pool (gDAI-gUSDC-gUSDT) on Curve could see that number rebound. Geist’s swift rise and decline can also be attributed to the rapid growth of the Fantom ecosystem as a whole:   SCREAM, a competing money market, has seen its TVL shoot to around 392 million with over 25 million in Dai. An Aave Governance poll that recently passed in support of a Fantom launch.  After a week of slight decline, Fantom currently holds over 250 million Dai or around 3.4% of the total supply.  Overview  Where is my Dai (General)  overview913×370 53.1 KB  Source Recent weeks have seen a shift in dominance from the ‘Other’ category in favor of DEXs, Lending protocols, and good old-fashioned cold storage.  Dai on Rollups  Source September was Optimism’s time, but October’s been all Arbitrum. Over 20 million Dai now lives on the platform, good for a 56% week-over-week increase.  Where is my Dai (Bridged)  All Assets  TVL of bridged assets929×430 38.5 KB  Dai now represents only 3.7% of the assets bridged from Ethereum.  Dai Bridged from Ethereum  Weekly Dai bridged from Ethereum772×375 29.5 KB   Circulating Dai by Platform As of October 21, 2021,  By Platform712×382 34.9 KB   Week-over-Week  709×383 20.4 KB   Avalanche  AVAX Markets1065×524 49.5 KB   Bridges  AnySwap - Cross Chain Protocol Avalanche Bridge: Transfer Assets To and From Ethereum   Celo   Bridges  AnySwap - Cross Chain Protocol Mobius Interface   Fantom  Farms  FTM Farms972×361 33.5 KB   Money Markets & Bridges  FTM MMs &amp; Bridges970×503 33.9 KB  Geist and SCREAM are the top money markets on Fantom, though a poll recently passed with the intent of launching the Aave protocol on the chain. AnySwap is the preferred bridge to the network, as its top AMM, SpookySwap, utilizes the bridge natively.  Bridges  AnySwap - Cross Chain Protocol SpookySwap   Solana  Solana Top Wallets883×258 23.5 KB   xDai  Source  Bridges  https://omni.xdaichain.com/   Notes & Feedback  Huge thank you @flipflopflapdelegate and @MakerMan for all the contributions and feedback! Began tracking the Celo network, and put Klaytn on hold as there’s currently no information on the conversion rate from Dai to KDai.  Have anything you’d like to see added to these breakdowns? Leave a message in the comments or DM me, @seth, or @JerryAG. Thanks for reading!  Tracking Tools  DAI  Dai on Different Networks Dash Dai-Curious Dashboard Dai Stats Maker Burn Maker Analytics Dashboard Block Analitica   Block Explorers  Avascan BSCscan FTMscan Polyscan Solana Explorer xDai Blockscout   Bridge Metrics  Uniwhales Etherescan Bridge Activity   DEX  DeFi Llama Dappradar Rankings  This is for informational purposes only. We do not endorse any of the projects referenced in this update. Always do your own research before making investments and/or using DeFi products and services. ",
                    "links": [
                        "https://dune.xyz/alec/Dai-on-Different-Networks",
                        "https://etherscan.io/address/e78388b4ce79068e89bf8aa7f218ef6b9ab0e9d0",
                        "https://defillama.com/protocol/anyswap",
                        "https://defillama.com/protocol/geist-finance",
                        "https://twitter.com/Screamdotsh",
                        "https://snapshot.org/#/fantomecosystem.eth/proposal/QmSTMpJq4Hbzhd7GifqNUMQTSrW1nbhnFJ88pzRDhu3fB5",
                        "https://dune.xyz/SebVentures/maker---accounting_1",
                        "https://bi.etherscan.io/public/dashboards/Z6PuB2HTLK4tGOCtrYvP65seYXGWfLea76mknRu6",
                        "https://anyswap.exchange/dashboard#/router",
                        "https://aeb.xyz/#/transfer",
                        "https://anyswap.exchange/dashboard#/router",
                        "https://bridge.mobius.money/#/",
                        "https://anyswap.exchange/dashboard#/router",
                        "https://spookyswap.finance/bridge",
                        "https://duneanalytics.com/maxaleks/xDai-Usage",
                        "https://omni.xdaichain.com/",
                        "https://dune.xyz/alec/Dai-on-Different-Networks",
                        "https://dune.xyz/alec/Where-is-my-Dai",
                        "https://bit.ly/2Twk7Mc",
                        "https://bit.ly/3Br1mdX",
                        "https://bit.ly/2UqMUlT",
                        "https://bit.ly/3eK2Vdg",
                        "https://avascan.info/blockchain/x/asset/2HG68eGcW1Xn8JcLuMZzLdT54Y394odWjPmLgfkbSfPZDgTM9v",
                        "https://bscscan.com/token/0x1af3f329e8be154074d8769d1ffa4ee058b1dbc3",
                        "https://ftmscan.com/token/0x8d11ec38a3eb5e956b052f67da8bdc9bef8abf3e",
                        "https://polygonscan.com/token/0x8f3cf7ad23cd3cadbd9735aff958023239c6a063#balances",
                        "https://explorer.solana.com/",
                        "https://blockscout.com/xdai/mainnet/",
                        "https://app.uniwhales.io/avalanche/bridge-tracker",
                        "https://bi.etherscan.io/public/dashboards/Z6PuB2HTLK4tGOCtrYvP65seYXGWfLea76mknRu6",
                        "https://defillama.com/home",
                        "https://dappradar.com/rankings",
                        "https://forum.makerdao.com/t/maker-relay-ep-68-en-espanol/11250",
                        "https://forum.makerdao.com/t/maker-relay-ep-68/11182",
                        "https://forum.makerdao.com/t/content-production-bi-weekly-update-10-15-10-28/11271"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.540538362346873
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "20/11/2021-21:40:16",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "189"
}