{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip0c12-sp1-subproposal-for-core-personnel-onboarding-mip-editor/2133",
            "title": "MIP0c12-SP1: Subproposal for Core Personnel Onboarding (MIP Editor) ",
            "index": 2133,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#1",
                    "likes": "5",
                    "time": "22/04/2020-17:06:29",
                    "content": "MIP0c12-SP1: Subproposal for Core Personnel Onboarding (MIP Editor) Preamble MIP0c12-SP#: 1 Author: Charles St.Louis Contributors: n/a Status: Request for Comments (RFC) Date Applied: 2020-04-22 Date Ratified: <yyyy-mm-dd> --- Core Personnel Role: MIP Editor Proposed applicant: Charles St.Louis  Application Form   Motivation  The Maker Improvement Proposals Framework requires a MIP Editor when the framework becomes ratified. Given that I am closest to the process and am driven towards making the Protocol self-sustainable, I am propsing myself to take on the MIP Editor role. As the MIP Editor, I will support and enforce the administrative and editorial aspects of the overall MIPs process and framework. For the full list of resposibilities, please reference MIP0c10: MIP Editor Role. Additioanlly, as one of the architects of the framework, I will actively work with the community to help sheppard incoming MIPs and work and communicate with Governance Facilitators on coordinating governance and executive votes in relation to MIPs and the monthly governance cycle. Lastly, I would like to note that the expectation is that the MIPs Framework will start out with a MIP Editor from the Maker Foundation (myself) and that other MIP Editors will join later.    Credentials   Work Experience   Current:   Decentralized Governance Architect @ Maker Foundation  Responsible for the initiative to further research, architect, and formalize Maker Governance processes on behalf of the Maker Foundation (Self-Sustaining Maker). Other relevant public work:  docs.makerdao.com Contributor blog.makerdao.com  Contributor MCD Whitepaper  Contributor Developer Guides  security.makerdao.com      PM @ Ethereum Cat Herders (Volunteer / Community Contributor)  This includes helping out with technical audit coordination, advisor/editor of Ethereum.org, developer growth initiatives, creating PM processes and retroactive reports, and relaying information between Ethereum Core Dev teams.      Past:  Independent technical consultant and advisor Developer Experience Lead @ Polymath Network        Relevant Information   Github Account: @CPSTL   MakerDAO Forum Account: @charlesstlouis   Twitter Account: @CharlieStLouis      Link to proposal on Github. ",
                    "links": [
                        "https://forum.makerdao.com/t/the-maker-foundation-s-vision-of-a-self-sustaining-makerdao-initiation-of-maker-improvement-proposals-mips-framework/1882",
                        "http://docs.makerdao.com/",
                        "https://blog.makerdao.com/",
                        "https://makerdao.com/en/whitepaper",
                        "https://github.com/makerdao/developerguides",
                        "http://security.makerdao.com/",
                        "http://Ethereum.org",
                        "https://github.com/CPSTL",
                        "https://forum.makerdao.com/u/charlesstlouis/summary",
                        "https://twitter.com/CharlieStLouis",
                        "https://github.com/makerdao/mips/blob/master/MIP0/Subproposals%20for%20Core%20Personnel%20Onboarding%20(MIP0c12)/MIP0c12-SP1.md",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-april-23-9am-pst-4-00-pm-utc/2145/2",
                        "https://forum.makerdao.com/t/mkr-holder-dai-gest-week-17-2020-the-state-of-the-peg/2177"
                    ],
                    "GPT-summary": "The post is a proposal for the Core Personnel Onboarding (MIP Editor) role in the Maker Improvement Proposals Framework. The author explains the motivation behind the proposal and provides relevant information about their credentials and work experience. The post also includes a link to the proposal on Github. A 3rd party could give constructive criticism, ask questions, or audit and review the proposal.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.21078431372549
                }
            ]
        }
    ]
}