{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/solution-to-runaway-dai/3440",
            "title": "Solution to runaway DAI ",
            "index": 3440,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/markobarko",
                    "index": "#1",
                    "likes": "0",
                    "time": "29/07/2020-13:35:37",
                    "content": "Ive looked around and seen negative interest rates as a potential solution. Doesnt seem to be popular. Given the positive interest rates elsewhere (compound/etc), there is pressure to buy and hold. The market is ignoring zero DSR. If dai leaves the peg in a significant way, there will be pressure on vault owners to buy to cover. If people buy to cover, this further raises the dai price. This results in a feedback loop, no? Is there any mechanism to ensure that dai value does not run away? What happens to the system if dai is $3, $5, etc? You can only lock so much collateral to generate new dai and, given the feedback loop, it would be risky to do so (generate at $3 thinking you’re an arbitrage boss and next day dai is at $5). I apologize if this was discussed somewhere else but I could not find it. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.619318181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ApoiioCreed",
                    "index": "#2",
                    "likes": "0",
                    "time": "29/07/2020-15:13:47",
                    "content": " If dai leaves the peg in a significant way, there will be pressure on vault owners to buy to cover. If people buy to cover, this further raises the dai price.  If dai price dropped significantly below the peg there is an incentive for vault owners to buy dai at a discount to pay down their debt – this takes dai out of circulation while creating demand for dai, the price should increase. If dai price rose significantly above the peg there is an incentive for individuals to mint dai and sell it on the market to collect the premium – this adds dai to circulation and should reduce the price. I think why the peg is starting to slip is because gas prices make minting dai expensive, and the dai being minted is largely being used for yield farmer so it is locked inside another smart contract.  Is there any mechanism to ensure that dai value does not run away? What happens to the system if dai is $3, $5, etc? You can only lock so much collateral to generate new dai and, given the feedback loop, it would be risky to do so (generate at $3 thinking you’re an arbitrage boss and next day dai is at $5).  Dai will never get to prices this high, there is a hard economic stop at ~$1.50. At $5, one could lock up $1.50 worth off eth in a vault and mint a $5 token – the market would never allow for that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.507698011864679
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#3",
                    "likes": "0",
                    "time": "29/07/2020-15:21:14",
                    "content": "There’s only pressure on the short supply I think, so as long as a significant amount of total dai supply is not short, and there’s also enough DC for new dai to enter the market, this runaway effect seems unlikely. However, I don’t know what the short dai supply is rn. This is probably something we should be monitoring. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.980681818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/markobarko",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/07/2020-15:54:35",
                    "content": "    ApoiioCreed:  I think why the peg is starting to slip is because gas prices make minting dai expensive, and the dai being minted is largely being used for yield farmer so it is locked inside another smart contract.   this is a good point as far as cause of the problem. However, eventually you could run out of collateral to mint the dai. Adding additional collateral types helps, and additional upward movement in DAI price could result in MASSIVE amounts of collateral entering makerdao (maybe the source of the next big crypto rally?). What happens if 100% of the ETH in existence is now in makerdao and price is still at $1.25? Getting your ETH out requires you to buy the DAI on the open market at increasing prices. So, you could get into a situation where DAI is $5 but people are out of collateral to mint more? I dont think you even need to get to 100% ETH locked to reach this scenario. Am i being a paranoid conspiracy theorist about this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.558441558441558
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rileyjt",
                    "index": "#5",
                    "likes": "2",
                    "time": "29/07/2020-16:12:57",
                    "content": "The primary issue IMO is that DAI isn’t really being used as a stable coin, it is being used as collateral for DeFi systems. More than 90% of the supply is locked into two DeFi systems - Compound and InstaDapp, so it is not really being circulated and subject to market forces.     markobarko:  However, eventually you could run out of collateral to mint the dai.   As more ETH is used to mint DAI, it also puts upwards pressure on the price of ETH. So it is not really possible to completely run out of collateral. More accurate to say we could end up with more ETH collateral than we would prefer since there are not other assets that will scale in value aside from ETH. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.206597222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#6",
                    "likes": "0",
                    "time": "29/07/2020-16:33:23",
                    "content": "Basically by this point the goal would be that we are onboarding real world collateral, and that new cryptocurrency projects that are relevant to existing businesses that are not crypto native would exist. Basically the goal is for cryptocurrencies to start eating up traditional assets. There is no shortage of assets, and money doesn’t really mean anything except relative to assets anyway, so we should not run out of assets in a way that hurts the peg. If there is some new demand for dai, or new need for something that didn’t used to exist in traditional finance, a new asset or product can fill that space, and presumably new collateral will be produced. Sorry though, this is all very long term and theoretical. Running out of cryptocurrency assets is not something we have to think about anytime soon. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.14439935064935
                }
            ]
        }
    ]
}