{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/emergency-call-on-usdc/17106",
            "title": "Emergency call on USDC ",
            "index": 17106,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/scream",
                    "index": "#1",
                    "likes": "1",
                    "time": "09/08/2022-00:04:02",
                    "content": "Wake up everyone. We should gather for a war room call. Where is Rune ?, and all core units should be alarmed and should be expected at HQ. No end games, and other jokes about RWA and core unit funds to make funny talks and dance. We should de-risk and decrease the amount of USDC in the protocol. Shutdown the PSM? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#2",
                    "likes": "3",
                    "time": "09/08/2022-00:37:48",
                    "content": "It is already a point that has been repeated previously in the forum, reducing exposure to USDC but as was said in another topic regarding Circle and Tornado Cash, as long as DAI liquidity is used in legal situations there would be no problem, however, the chain is big and no one doubts that user 1’s USDC is transferred to user 2 and it’s completely legal but if user 2 sends it to user 3 and this USDC is used to exchange DAI then our USDC would get blacklisted and the DAI of the user would be validated, that is, we urgently need a change with respect to USDC.     [Signal Request] Immediately Onboard BUSD & Introduce 0% PSM Signal Archive       Note: This is an urgent request to expedite a MIP6 & PSM launch for BUSD to diversify DAI’s collateral backing. DAI is backed nearly entirely by a single centralized collateral in a defaulting environment.    TLDR   >80% of DAI is backed by USDC.  USDC may or may not be compromised.  Surprisingly, large players have been mismanaging customer funds, going under, and defaulting. It is feasible that Circle may have mismanaged USDC.   >80% of DAI is backed by USDC.  A potential default could be im…         [BUSD] MIP6 Collateral Onboarding Application Collateral Onboarding Applications (MIP6)       [BUSD] MIP6 Collateral Onboarding Application for Binance USD Token   Who is the interested party for this collateral application?  @monet-supply   Provide a brief high-level overview of the project, with a focus on the applying collateral token.  BUSD was launched in 2019. It is issued and custodied by Paxos. Currently, BUSD is issued on both Ethereum and Binance chain (this application addresses only erc20 BUSD), with total BUSD circulating on Ethereum of ~170 million.   Provide a brief histor…     The most notable option to lower exposure and continue with the stablecoin model - DAI we can use BUSD as collateral but this does not prevent us from Binance doing the same as Coinbase and Circle did ",
                    "links": [
                        "https://forum.makerdao.com/t/busd-mip6-collateral-onboarding-application/3376"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.46358543417367
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#3",
                    "likes": "3",
                    "time": "09/08/2022-01:08:55",
                    "content": "    scream:  Wake up everyone… We should de-risk and decrease the amount of USDC in the protocol.   This is far from a new or novel issue - Maker’s use of USDC has been debated umpteen times in the forums, Twitter etc. The truth is there is no easy or simple way to “de-risk and decrease” USDC from the protocol without causing some other kind of major issue in a domino effect. The other point to emphasise is that Tornado is not the same as Maker: we are talking about different categories of risk. It is straightforward to see why Tornado is in the crosshairs of regulators: the protocol, whatever its other benefits, is clearly a tool to launder money for North Korean hackers. It is not clear why Maker would be under risk of blacklisting by regulators/Circle and there are no signs of this happening - whereas there have been lots of danger signs for Tornado. My view is that we should be looking to diversify away from USDC, particularly where we can also generate some revenue. But I don’t think the Tornado news shifts the needle very much on this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3621448863636365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#4",
                    "likes": "0",
                    "time": "09/08/2022-01:56:39",
                    "content": "  twitter.com    tobal.eth 🦇🔊 #L222 @ ETH Latam @tobalgarcia_  Well, people:  $DAI, the ERC-20 token generated by the Maker Protocol, can *not* be frozen.  Yes, @MakerDAO TVL is ~30% USDC. More than 3 billion.  But, besides that, let’s be honest, USDC is one of the largest liquidity providers on crypto.   11:05 PM - 8 Aug 2022           8                1              twitter.com    tobal.eth 🦇🔊 #L222 @ ETH Latam @tobalgarcia_  And, what do I mean by that?  If USDC in Maker can be frozen, USDC on @Uniswap, @AaveAave, blah blah blah etc etc etc can be frozen as well.  Why aren’t you talking about that? If all USDC is suddenly frozen in the entire crypto ecosystem, we’re all fucked up.   11:05 PM - 8 Aug 2022           7            ",
                    "links": [
                        "https://twitter.com/tobalgarcia_/status/1556778767300694016?t=Awpt72N6LDhC87aH3_R-gA&s=19",
                        "https://twitter.com/tobalgarcia_/status/1556778767300694016?t=Awpt72N6LDhC87aH3_R-gA&s=19",
                        "https://twitter.com/MakerDAO",
                        "https://twitter.com/tobalgarcia_/status/1556778767300694016?t=Awpt72N6LDhC87aH3_R-gA&s=19",
                        "https://twitter.com/tobalgarcia_/status/1556778769808891904?t=3EhTK3zHbqF3JZCOCdq6og&s=19",
                        "https://twitter.com/tobalgarcia_/status/1556778769808891904?t=3EhTK3zHbqF3JZCOCdq6og&s=19",
                        "https://twitter.com/tobalgarcia_/status/1556778769808891904?t=3EhTK3zHbqF3JZCOCdq6og&s=19",
                        "https://twitter.com/Uniswap",
                        "https://twitter.com/AaveAave",
                        "https://twitter.com/tobalgarcia_/status/1556778769808891904?t=3EhTK3zHbqF3JZCOCdq6og&s=19"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.15625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#5",
                    "likes": "2",
                    "time": "09/08/2022-04:01:00",
                    "content": "    Moi:  we urgently need a change with respect to USDC   I hope that in hindsight, it will look like I was just overreacting.   To be fair, @monet-supply did loosely agree that he’d make sure BUSD gets rolled out at some point… sooner or later. Since now it’s definitely later and not sooner, by deductive reasoning… that means we should be good to go for porting over to BUSD! : ) Our reliance on USDC is solved!  /s Of course, jk… @monet-supply, I’m just poking fun.   I know everyone’s been quite busy lately. I fully agree that our number one priority right now is to focus all of our collective mental bandwidths on detailed expense reporting, cutting staff and expenditures, and, most importantly. making sure that all members and contributors in our community adhere to strict standards of professionalism and operate under clearly defined expectations of their roles. Once we nail that down perfectly… everything else will fall into place!  Anyway, @Moi, like I said, I hope I was just overreacting to the USDC thing. The Tornado stuff is a little unsettling. We really should diversify sooner than later… but I think we may still be okay for now.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875401470510166
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pcfreak30",
                    "index": "#6",
                    "likes": "0",
                    "time": "09/08/2022-05:11:00",
                    "content": "See my comments on Proposal for the avoidance of possible future sanctions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pcfreak30",
                    "index": "#7",
                    "likes": "0",
                    "time": "09/08/2022-05:12:11",
                    "content": "But I don’t think the Tornado news shifts the needle very much on this. It should give you a wakeup call, the same thing I have posted a few times on this forum. GTFO of USDC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#8",
                    "likes": "0",
                    "time": "09/08/2022-15:41:05",
                    "content": "    scream:  Shutdown the PSM?   Short answer? No. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chaser",
                    "index": "#9",
                    "likes": "1",
                    "time": "09/08/2022-22:02:27",
                    "content": "    Matt_NZ:  It is not clear why Maker would be under risk of blacklisting by regulators   I could list multiple serious reasons, but I won’t, given it’s quite possible that regulators are reading this, and I don’t want to feed them with ideas. but please do think about how the Tornado events were totally beyond the conceptual horizon of a large swathe of crypto people. take that pattern and consider the possibility that many of us are stuck in a similar failure of imagination regarding a much greater threat. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.257142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#10",
                    "likes": "0",
                    "time": "07/11/2022-22:02:57",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}