{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/proposal-dai-point-of-sale-app/763",
            "title": "[Proposal] Dai Point of sale app ",
            "index": 763,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PlusBit",
                    "index": "#1",
                    "likes": "1",
                    "time": "10/11/2019-11:50:41",
                    "content": "Hello Maker team, @rich.brown @g_dip Because of the volatility in cryptocurrencies, stablecoin’s acceptance as payment coin is very important. Generally, merchants prefer to accept stablecoins. Therefore, we, as Plusbit, want to add stablecoin support. We have an offer for you; Dai  Point of Sale & PlusBit Interlocutor : PlusBit Point of Sale Company (https://plusbit.tech/) Problem statement This project is designed for merchants to be able to accept Dai  quickly, easily, and securely. In order to further adoption of Dai, we need to make it easy for merchants to accept it as a form of payment. This system will enable them to do so. So far, POS systems were being built using custom hardware, making them costly and less flexible. A new trend is emerging now. Business owners have started using tablets and smart phones as their POS terminals. PlusBit POS is an app based on Android platform, used by merchants and vendors for processing cryptocurrency payments. Make your tablet or smart phone Point-of-Sale (POS) system with PlusBit. Why use this instead of a mobile wallet? One of the main reasons a merchant would use this app over the standard mobile wallet would be to have an experience they are familiar with. It has been designed to be very closely related to credit card processing machines in this respect. The main reason however, besides ease of use and familiarity, is the fact that this terminal is not a wallet. Several factors to consider ;  PlusBit only generates the payment requests to a wallet that the merchant controls on a different machine. This means that there is no control of the coins from the POS software. This situation works especially well when you have employees that may access this machine as well. Keeping your private keys offline is always a bonus! Your wallet may need time to sync. Unlocking wallet in front of customers is not safe.  What are the features?   No need to purchase hardware , convert smartphone or tablet to POS device PlusBit  does not get any fee from TXs  There is  no monthly fee  for users. PlusBit is a free mobile Point-of-Sale app. Supports Multilanguage (en, es, tr, de). Supports 12 fiat units No KYC No registered account No control of the coins from the POS software PlusBit  does not hold or store your coin ad private key . You have immediate ownership and full control of your money.  How It Works?  Connect your business wallet address to app, which is where you’ll receive payments. Enter sale amounts in your local currency and have them converted to an amount in crypto. A QR code will then appear for your customer to scan using their own personal wallet. After your customer pays, an on-screen verification will pop up. The payment will then land in your business wallet. You can also watch your balance information.  Schedule What is the timeline for integration into PlusBit? Expected timeline for implementation is over the next 1 month. Are there features planned beyond this release?  Invoice history (Q1/2020) Invoice printing (Q1/2020) Pin protection of Balance & Invoice page (Q2/2020) Works on iOS (Q2/2020) NFC payments (Q3/2020)  Budget and justification How much development cost, and what will the cost breakdown? As a PlusBit company, we never get fee from transactions. Also there is not monthly/annual cost for merchants. The app will completely become free for everyone. This means PlusBit doesnot get any revenue. However, two developers work for this project. A single engineer could cost $500 USD to contribute to a project. You might expect development of this complex would cost $1,000 USD. So, we ask this fund from coin teams. PlusBit is self-funded project, we are responsible from all our other expense and server, etc. As a conclusion, what is the cost that you need to cover in order to go ahead with PlusBit app for coin? Developer compensation: $500 USD x 2 (This is one time payment at the beginning and covers all the further developments, updates and maintenance). Direct Contact [email protected] - Director of Communications, PlusBit Kind Regards PlusBit ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.679865096144166
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#2",
                    "likes": "2",
                    "time": "12/11/2019-16:59:54",
                    "content": "Hi PlusBit, First of all, let me say thanks for building with Dai!  It would be great if you could shoot me an email to see if we can help out: [email protected] ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PlusBit",
                    "index": "#3",
                    "likes": "0",
                    "time": "12/11/2019-20:29:59",
                    "content": "Hi @g_dip Thank you for reply, We have sent email Kind regards ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                }
            ]
        }
    ]
}