{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-explorer-2-crossing-the-carbon-chasm/11929",
            "title": "\\xf0\\x9f\\x8c\\x8e Maker Explorer #2: Crossing the Carbon Chasm ",
            "index": 11929,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "ses-001",
                "maker-explorer"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#1",
                    "likes": "10",
                    "time": "01/12/2021-19:37:23",
                    "content": " 1440×810 115 KB   Join us for the 2nd session of Maker Explorer! During this session, we will host Adam Carver from Bitgreen as he shares his organization’s vision for a purpose-built blockchain to solve the world’s biggest problems: climate change, public health, wealth disparity, and others. The need for solving climate change alone is massive: The team has a goal of bring trillions of dollars into ESG initiatives, and begin closing the $4 T deficit humanity faces to combat climate change. Having just completed raising $5m in funding, Adam joins Maker Explorer to present an overview on Bitgreen’s action plan for enabling “clean money”.  About Bitgreen Bitgreen aims to be the leader in blockchain solutions for ESG, sustainability, and environmental impact by attacking complacency and being brave enough to thinking really big. The team is purpose built with backgrounds in crypto, venture funding, and environmentalism.  About Adam Adam is the CEO of Bitgreen and is an experienced start-up professional with 10 years of co-founding organizations. Adam served as a director of AngelList, as well as cofounded and served as CEO of Battlestar/KeyFi prior to the organization’s acquisition by Celsius Network.  Join us!  @Juan and @Retro will be our hosts.  When Time in your local-timezone format: 2021-12-08T16:00:00Z Mark it on your Google Calendar!  Where Zoom call Passcode: COREUNIT Alternatively, use this:  Find your local number: Zoom International Dial-in Numbers - Zoom Meeting ID: 829 4277 3725 Passcode: COREUNIT  Attn:  @SES-Core-Unit, @gov-comms-core-unit, @GovAlpha-Core-Unit, @Growth-Core-Unit, @Content-Production, @daif-core-unit, @Protocol-Engineering, @happiness-core-unit, @Oracles-Core-Unit, @Risk-Core-Unit, @Real-World-Finance, @dux-core-unit, @starknet-core-unit, @data-insights-cu, @collateral-core-unit ",
                    "links": [
                        "https://bitgreen.org/",
                        "https://bitgreen.org/",
                        "https://www.linkedin.com/in/adamcarver",
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=MWllODdkNTZtcGYwa2VyYnFkNm52YmZxcm0gbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/ses-update-03-12-2021/11970",
                        "https://forum.makerdao.com/t/ses-update-10-12-2021/12126",
                        "https://forum.makerdao.com/t/maker-relay-ep-74/12035",
                        "https://forum.makerdao.com/t/maker-relay-ep-74-en-espanol/12071"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.773809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#2",
                    "likes": "0",
                    "time": "03/12/2021-03:00:59",
                    "content": " Maker Explorer - Episode #02  December 8th, 2021  Agenda   00:00: Intro with Retro  00:20: Discussion and Questions with Adam Carver  1:04:22: Outro   Video https://youtu.be/Fe83Dnu0wFY  Introduction  Retro  Agenda and Preamble 00:00  Hello to everyone. Thank you for joining Maker Explorer #02 from MakerDAO. Today we have Adam Carver from Bitgreen discussing their team’s initiative to be the leader in the blockchain space for ESG Solutions.   Adam Carver 00:20  1920×1124 106 KB   Agenda for today&#39;s explorer1920×951 148 KB   Adam Carver1920×978 122 KB   About BitGreen1920×967 136 KB   Rationale &amp; Assumptions1920×995 80.5 KB   The World is not O.K.1920×934 134 KB   Issues1920×943 109 KB   Declining Agency1920×939 131 KB   Intentions vs. Incentives1920×949 128 KB   Why Carbon?1920×937 87.9 KB   CO21920×940 115 KB   800,000 Years of CO2 Readings1920×948 150 KB   What&#39;s the significance of 350?1920×951 232 KB   Atmospheric CO2 forecast1920×951 162 KB   Where are we now?1920×954 112 KB   You&#39;re probably thinking about this all wrong.1920×953 112 KB   CO2 ppm will continue to climb...1920×946 155 KB   Financial deficit1920×948 166 KB   $50T in perspective1920×959 113 KB   BitGreen Assumption #11920×937 122 KB   BitGreen Assumption #21920×961 135 KB   BitGreen Assumption #31920×941 142 KB   Chamath1920×970 96.7 KB   On-chain infrastructure for Impact1920×972 73.2 KB   1920×967 159 KB   Tragedy of the Commons of Ethereum1920×933 216 KB   Carbon Credits1920×930 74.7 KB   What&#39;s out there: Landscape of Impact Crypto1919×959 307 KB   Klima DAO1920×956 192 KB   Criticism1920×975 196 KB   Celo1920×972 147 KB   Carbon Contract1918×952 163 KB   Carbon credits value-chain1920×954 136 KB   Largest certifiers1920×964 113 KB   Carbon Forward Contract benefits1920×957 241 KB   Impact Investing Marketplace1920×948 81 KB   Impact Investing1920×946 145 KB   Users1920×960 133 KB   Synthetic Green Bond Market1920×966 147 KB  ![Marketplace schematic](https://i.imgur.com/UgIr6Ld.png  Why is this marketplace so crucial?1920×957 153 KB   Conclusion1916×973 75 KB   Think in the Trillions1920×955 99.4 KB   Most people are thinking too small1918×967 96.1 KB   Risks and models1920×956 133 KB   Who will solve this problem?1918×971 187 KB   Be our partners on this1920×956 166 KB   Thank you!1920×1008 113 KB   Questions 35:00 - Juan Guillén: Is there any set of best practices or frameworks that we should be looking into and we can follow? In which way should we be framing this problem, asking the right questions, and making sure that we are not just the crypto bros trying to pump a market but instead having a meaningful long-term change? Is there a straightforward way to start in the right direction? 42:10 - Retro: You discussed creating this sideload teams that focus on that initiative. What standards would you encourage that team to have to keep in mind as they are progressing this massive goal? 45:24 - Juan Guillén: Is there such a thing as the ISO standards for anything that has to do with clean projects? 47:29 - Juan Guillén: Going back to the carbon credits, something that does not click is that it feels like rich countries would be paying poor countries to store their crap. Also, there is the enforcing factor with carbon at the end of the day. If some company or government decides to go out there and contaminate and ruin the world for everyone else, there is no clear way to tell them that they need to buy carbon credits. Because there is no law forcing them to do so. 50:36 - Frank Cruz: How will you capture the Oracle Price Feed, being that some of these carbon credit market reporting tools are stuck on Web 1.0? Also, with the narrative of forest offset credits being the most popular, are you going in that approach? How do you convince the real world companies that they need to reduce emissions and help out with this huge problem? 54:29 - Jack: Where does Bitgreen see itself fitting in within the ecosystem? Is it a case of you providing your products like the carbon credit marketplace or more of a consultancy role to help implement best practices in establishing projects for Maker? 57:19 - Lewis: How can you help financing projects instead of just helping a more liquid market of already issued carbon credits? 1:01:48 - Juan Guillén: Is there something you would like to say? Where can people find you?  Closing Comment  Retro  Outro 1:04:22  Thank you, Adam, for that excellent presentation providing great background and insight into BitGreen’s mission. The team at Maker is happy to help. As a follow-up, we will post your contact information into the forum post and a replay of the video. You will be getting a couple of pings for support over the next coming days. Thank you to everyone for joining.   Credits  Kunfu-po produced this summary.  @gala produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/Fe83Dnu0wFY?t=20",
                        "https://youtu.be/Fe83Dnu0wFY?t=3862",
                        "https://youtu.be/Fe83Dnu0wFY",
                        "https://youtu.be/Fe83Dnu0wFY",
                        "https://youtu.be/Fe83Dnu0wFY?t=20",
                        "https://i.imgur.com/UgIr6Ld.png",
                        "https://youtu.be/Fe83Dnu0wFY?t=2100",
                        "https://youtu.be/Fe83Dnu0wFY?t=2530",
                        "https://youtu.be/Fe83Dnu0wFY?t=2724",
                        "https://youtu.be/Fe83Dnu0wFY?t=2849",
                        "https://youtu.be/Fe83Dnu0wFY?t=3036",
                        "https://youtu.be/Fe83Dnu0wFY?t=3269",
                        "https://youtu.be/Fe83Dnu0wFY?t=3439",
                        "https://youtu.be/Fe83Dnu0wFY?t=3708",
                        "https://youtu.be/Fe83Dnu0wFY?t=3862"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5813492063492065
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#4",
                    "likes": "5",
                    "time": "07/12/2021-20:32:51",
                    "content": "Really looking forward to this one. Strategic discussions. Perfect timing to have those in preparation for 2022. @juan and team, can we try to do a bit of a rotation in timezone alignment for these calls? I am not sure if the community realises but by default we’re excluding the whole of the developed Asia + Pacific from any calls we do as a community. Everyone is sleeping. Not saying every call but maybe 1 out of 3 or even out of 4 should be inclusive to timezones currently essentially absent from the community. Encouraging fresh new blood into the Maker community as a truly global project should be a strategic pillar on its own. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1431818181818185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#5",
                    "likes": "0",
                    "time": "07/12/2021-23:07:50",
                    "content": "Thanks for the feedback, @williamr. We’ll look into it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#6",
                    "likes": "0",
                    "time": "09/12/2021-15:57:27",
                    "content": "This full call is now available for review on the MakerDAO Youtube channel:      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                }
            ]
        }
    ]
}