{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ama-risk-management-with-makerdaos-risk-core-unit/11208",
            "title": "[AMA] Risk Management with MakerDAO's Risk Core Unit ",
            "index": 11208,
            "category": [
                "Core Units",
                "Core Unit Archive"
            ],
            "tags": [
                "public-call",
                "archive-mkt-001",
                "pubcall-:-ama"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#1",
                    "likes": "1",
                    "time": "26/10/2021-20:52:08",
                    "content": " DAO-risk1280×720 91.8 KB  Join @Primoz and @josolnik from MakerDAO’s Risk Core Unit for an AMA on 2021-11-04T14:00:00Z (14:00 UTC) Zoom Whether you’re interested in MakerDAO’s approach to Risk Management, current and upcoming risks the DAO is facing, or even what the Risk team is up to, listen in to learn more about how Risk is managed in MakerDAO. @prose11 @Risk-Core-Unit ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-69/11345",
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/maker-relay-ep-69-en-espanol/11439",
                        "https://forum.makerdao.com/t/maker-relay-ep-70/11528",
                        "https://forum.makerdao.com/t/maker-relay-ep-70-en-espanol/11569"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#2",
                    "likes": "0",
                    "time": "04/11/2021-21:21:08",
                    "content": "This full call is now avialable for review on the MakerDAO Youtube channel:      ",
                    "links": [
                        "https://forum.makerdao.com/t/content-production-bi-weekly-update-10-15-10-28/11271"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#3",
                    "likes": "0",
                    "time": "11/11/2021-15:45:33",
                    "content": " AMA call - Episode #11  November 4th, 2021  Agenda   00:00: Intro with Payton Rose  01:11: AMA with Primoz and Jan.  56:45: Outro   Video https://youtu.be/0ilts--wRXw  Introduction  Payton Rose  Agenda and Preamble 00:00  Hello to everybody. Welcome to Ask MakerDAO episode #11. I am Payton Rose. Today we will be hosting Primoz, the facilitator of the Risk Core Unit at MakerDAO and, Jan, a Risk CU team member. For other episodes of AMA, please check the forum.   AMA with Primoz and Jan, from Risk CU.  Presentation  Dashboard demo1920×1102 111 KB   1920×1113 115 KB   Risk tab1920×1112 162 KB   1920×1117 158 KB   ETH-B1920×1121 162 KB   ETH-A1918×1120 158 KB   More Risk charts1920×1120 111 KB   Collateral Risk Model1920×1110 158 KB   Vaults1920×1116 171 KB   D3M Model1920×1120 150 KB   DeFi Monitor1920×1107 112 KB   Maker Collateral Risk Model1920×1109 140 KB   1919×1107 176 KB   Questions 11:12 - Payton Rose: It might be hard for the average community member to envision what the Risk CU does. In terms of the bulk of your work, how is that time spent? You mentioned that you split between the development side and the risk analysis side. Could you give a little inside into those groups? What do you exactly work on daily? 17:33 - Payton Rose: How do you approach evaluating the risk of something like the Wintermute deal? 30:48 - Payton Rose: I have noticed that many of the Vaults are linked to the DBank page. You can see where the assets of the owners are across Ethereum and other chains. Primoz talked about starting to focus more on capital availability. Do you have any thoughts about that? How have you found that useful for your modeling? 35:30 - Payton Rose: How do the Vaults get their risk scores? 39:08 - Payton Rose: Our latest recognized delegate, Schuppi, had shared a draft about increasing the surplus buffer this morning in our Discord. Based on the tools available with the Dashboard, are there certain things we should be paying attention to when contemplating what we should do with the surplus buffer? What values do we want to determine if the surplus buffer is too high or too low? 46:19 - Payton Rose: Things like ETH-B contribute to the lower collateralization ratio, especially once you add in the OSM delay. What do you think on that subject? 48:03 - Jason Jones: At a particular surplus buffer, we are protected against this scenario. You said you would suggest 100 million. Did you put those two together? If at 100 million, what scenario are we protected against? 55:55 - Payton Rose: If people want to get in touch with you after this call or have inquiries for how you arrived at certain conclusions, where is the best place to do that?  Closing Comment  Payton Rose  Outro 56:45  Thanks to Primoz and Jan for the awesome presentation today. I appreciate everyone who came and participated as well. We will keep the discussion going in the forums. We will probably have some discussion from Risk on the G&R call a little later today. Thanks for coming.   Credits  Kunfu-po produced this summary.  @gala produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/0ilts--wRXw?t=71",
                        "https://youtu.be/0ilts--wRXw?t=3405",
                        "https://youtu.be/0ilts--wRXw",
                        "https://youtu.be/0ilts--wRXw",
                        "https://forum.makerdao.com/search?q=AMA%20call",
                        "https://youtu.be/0ilts--wRXw?t=672",
                        "https://youtu.be/0ilts--wRXw?t=1053",
                        "https://youtu.be/0ilts--wRXw?t=1848",
                        "https://youtu.be/0ilts--wRXw?t=2130",
                        "https://youtu.be/0ilts--wRXw?t=2348",
                        "https://youtu.be/0ilts--wRXw?t=2779",
                        "https://youtu.be/0ilts--wRXw?t=2883",
                        "https://youtu.be/0ilts--wRXw?t=3355",
                        "https://youtu.be/0ilts--wRXw?t=3405"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5214880952380945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "11/12/2021-15:45:59",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}