{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - SB-DDC (Solid Block Detox Digital Coins) - September 20, 2021",
            "index": "10063",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "34,611",
            "highest_fraction": 0.52
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/sb-ddc-mip6-application-membership-interests-in-detox-medical-digital-series-of-solidblock-holdings-llc-in-the-form-of-cryptographic-digital-tokens-ddcs-a-solidblock-offering/10063",
            "title": "[SB-DDC] MIP6 Application: MEMBERSHIP INTERESTS IN DETOX MEDICAL DIGITAL SERIES OF SOLIDBLOCK HOLDINGS LLC IN THE FORM OF CRYPTOGRAPHIC DIGITAL TOKENS (\\xe2\\x80\\x9cDDCs\\xe2\\x80\\x9d) - a SolidBlock Offering ",
            "index": 10063,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Yael_Tamar",
                    "index": "#1",
                    "likes": "5",
                    "time": "29/08/2021-15:08:13",
                    "content": "Intro: Detox Digital Coins ( “DDCs”) are real-estate backed security tokens representing an interest in the Detox Medical Digital Series, LLC (‘the Series”) established by SolidBlock to offer investors the opportunity to participate in the the Detox Digital Property Portfolio (“the Portfolio”) which manages detoxification facilities, each with its unique and licensed approach to drug and alcohol and mental health recovery. The main underlying challenge and need for the project is the opioid epidemic which is a global malady, further exacerbated by the COVID-19 pandemic with more than 93,000 drug-related deaths in 2020 in the United States (a 29% increase over 2019). For further information, please see how SolidBlock’s platform is becoming an ideal way to make a profit through real estate and how you can make this work for you when investing in Detox Digital Coins. 1. Who is the interested party for this collateral application? The interested party for this collateral application is Detox Medical Digital Series (the Series). Specifically, SolidBlock Inc. has formed the Series (Delaware incorporated) to offer investors the opportunity to participate in real estate through the Detox Digital Property Portfolio as delineated above. Main Contacts: SolidBlock: Co-Founder & Co-CEO, Yael Tamar: [email protected]; SolidBlock Co-Founder & Co-CEO, Yuval Wirzberger: [email protected] 2. Provide a brief high-level overview of the project, with a focus on the applying collateral token For this offering SolidBlock, Inc. , an internationally recognized pioneer in tokenization and the developer of a fully compliant tokenization platform has teamed with the Holdun Family Office (Bahamas) Ltd., and Omicrom Development, LLC (Delaware Incorporated) (through a joint US company - CRE Realty - Placeholder name) that seeks to raise up to USD $70M, offering interest in facilities focusing on various levels of care. The Portfolio consists of real estate within the United States that is utilized to increase the number of substance abuse treatment programs available for those seeking a solution to opioid dependency. The Portfolio represents an investment in a niche commercial real estate sector that has insulation from the effects of the Coronavirus, and is considered “essential business” in the eyes of US federal and state governments. The Portfolio addresses a rapidly expanding market with an unmet demand: the exploding opioid crisis and the lack of treatment facilities. CRE Realty Partners currently manages five thriving centers and anticipate acquiring a total of 20 additional centers that are specifically zoned and refurbished to provide diverse levels and stages of substance abuse programs. Specifically, the Detox Digital Property Portfolio will acquire facilities that address different levels of care for every stage of recovery from substance abuse. These include:  Residential Drug and Alcohol Detoxification Centers In-patient Drug and Alcohol Rehabilitation Centers Sober Living Post Rehabilitation Residential Housing  The Series may hold, depending on the amount raised, up to 100% of several detox centers as delineated above. Each DDC is initially offered at a value of USD $1. Using SolidBlock’s advanced platform on the Ethereum blockchain (the “SolidBlock Platform”), investors will be able to purchase DDC’s. The Company intends to use the proceeds of the sale of the DDCs (after payment of fees and offering expenses) to purchase an interest in the real property holding company, which wholly owns the medical detoxification centers. The Series seeks to raise up to $70,000,000 USD to invest into the Series which may hold, depending on the amount raised, up to 100% of several real property holding companies whom each is the sole owner of a medical detoxification center (the “Property” or “Properties”). We expect several tranches whereby there is a minimum cap of 3M. Each Property, as of the date of this Offering has been identified, renovated, developed, and is leased via a triple net lease for a 10-year period to a medical detoxification operator. The determination of which properties are to be included in this Offering is based on the following estimated financial metrics of the potential return to investors:  Internal Rate of Return of 12% to 15%; Annualized Return of Investment of 15% to 18%; and Equity Multiple of 1.7 to 2 times investment.  DDC is a new series of Ethereum blockchain-based smart contract digital tokens consisting of software code meeting the ERC-20 protocol standard as modified to meet transfer restriction requirements under applicable US securities law. The software code of the DDC Smart Contract will be based on open-source code but will be proprietary and will not be published at this time. Fractional ownership/Tokenization of real estate, in general SolidBlock’s state-of-the-art digital securities platform, which enables fractional ownership of the underlying assets or fractional entitlement to certain rights (revenue or interest) as well as trade of assets via OTC on the SolidBlock platform or through partner exchanges. Real estate asset tokenization is an emerging trend representing the convergence of real estate investing and blockchain technology. Tokenization helps asset or fund owners raise capital more efficiently, and gives investors unprecedented access to private real estate investments, transparency, and liquidity.  960×540 147 KB  SolidBlock was a first mover in the industry spearheading the tokenization of the St. Regis Aspen Ski resort (ASPD trading on tZero).  960×540 551 KB  The Series, as delineated in the previous section, is the official issuer of the Detox Digital Coins. Purchases of the DDCs will be paid in U.S. dollars. The Series may accept Bitcoin (“BTC”), Ethereum (“ETH”) , DASH, or other cryptocurrencies as payment for DDCs. The funding objective is to raise $70,000,000 USD as outlined above in numerous tranches - each with a min. A cap of $3M and a maximum of $15M in accordance with the PPM. The offering price of each DDC is $1.00 and the minimum investment is $5,000 USD although the Series, in its sole discretion, may determine to lower the minimum amount. DDCs can be accessed and transferred (when and to the extent permitted under applicable regulations) through the SolidBlock Platform or held directly in a digital wallet.  1280×720 593 KB  The Real Estate Assets: The addiction industry is a multi-billion dollar industry with a very deep tenant pool and moreover, our tenants are well-known national operators. With the proceeds from the sale of the DDCs, the Series will acquire an additional 20 recovery and health rehabilitation centers in prime locations within the United States to add to the Portfolio and which will be rented to qualified detox and recovery facilitators. The Portfolio addresses a rapidly expanding market with an unmet demand: the exploding opioid crisis and the lack of treatment facilities. The projected IRR is 15% with annual 8% cash-on-cash return. Taking into account that there are multiple levels of care for recovery stages, the Portfolio is interested in acquiring facilities that address these different levels including:  Residential Drug and Alcohol Detoxification Centers In-patient Drug and Alcohol Rehabilitation Centers Sober Living Post Rehabilitation Residential Housing  There are currently five thriving facilities under management, each with its unique and licensed approach to drug and alcohol and mental health recovery. Our inside knowledge of the bed capacity and turnover rate for these facilities compels us to seek additional buildings (approximately 20) that can cater to the needs of a growing at-risk population.  1280×720 759 KB   1280×720 705 KB  Exit Strategy:. To raise and deploy 70 M USD in equity (equivalent to a 200M USD portfolio) and once we build such a portfolio, we will sell to a larger fund that has an interest in acquiring ESG investments. DDC Storage and Transparency: DDCs are held on behalf of investors by SolidBlock in a cold storage wallet, and can be accessed and traded through the SolidBlock Platform. Investors will also have the option to store DDCs in any ERC-20 compatible wallet. It is also important to understand that because they are stored on the blockchain, investors in DDCs can view a record of their investment on the SolidBlock Platform. The Series will communicate with Investors through the SolidBlock Platform or via electronic mail as to material developments regarding an investment. Investors can review their account statements online and see that they have received payments on the DDCs they own. 3. Provide a brief history of the project The history of the project is embedded in the separate histories of the main stakeholders behind the Series - SolidBlock Holdings and CRE Realty (Omicrom Development, LLC and the Holdun Family Office) as well as the social challenge and financial/social opportunity afforded by the ever-increasing opioid crisis. Omicrom Development, LLC reached out to SolidBlock to tokenize their project and assist in raising funds to meet the insatiable demand created by the opioid crisis for additional detox and recovery facilities. The opioid epidemic is a global malady that has damaged the economic and social wellness of many countries and its effects are not slowing down. Drug dependence among the most at-risk population has accelerated because of Covid. SolidBlock entered into a partnership agreement with CRE Realty (Omicrom Development, LLC and the Holdun Family Office) to execute the tokenization project providing the entity structuring, regulatory compliance, and technology platform. The Project Team: CRE Realty (Placeholder name) - A US Entity wholly owned by Ominicrom and Holdun* -CRE Realty has ultimate responsibility for the management, operations, and investment decisions made on behalf of the partnership. With many years of real estate transactions to their credit, CRE Realty has led investors to successful, transformative, and equitable projects. They offer consulting in all areas related to identifying up-and-coming real estate deals for the management, operations, and investment decisions of their clients. Omicrom Property Management, LLC.,* - is a Delaware limited liability company that serves as the property manager for the real estate assets held by the Portfolio. Holdun Family Office, Ltd.,* - is a major investor in Omicrom. With an extensive reserve of knowledge based on this company’s five-generational investing dynasty, Holdun offers financial guidance to investors on their journey to leverage their financial security. SolidBlock is a smart contract development and management platform for tokenized assets. In other words, SolidBlock transforms real estate, a traditionally illiquid asset into a tradable security through tokenization. SolidBlock spearheaded the successful tokenization of the five-star St. Regis Aspen Resort in Colorado. The Aspen Coin (as termed) was the first-ever tokenized commercial real estate project in the world whereby $18M was raised using the SolidBlock platform. The Aspen Coin was listed on tZERO in Sep 2020 (amidst the COVID-19 crisis), traded by over 800 customers with over 4-8% of its market cap traded every month. The issuance price was $1, was about $1.30 at the time of listing (30% premium), and is now about $1.20. The SolidBlock team is hustling, simultaneously, working on diverse tokenization projects for residential, commercial, and hospitality-based properties in the United States, Europe, and Asia. Moreover, SolidBlock prides itself on its efforts to advance and facilitate interoperability and regulatory standardization, thus mitigating barricades to digital markets and investing.  960×540 211 KB  Through the leveraging of these companies’ wealth of experience, the Detox Digital Coin (DDC) was born. DDC provides an unprecedented opportunity for savvy investors interested in digital securities backed by one of the safest asset classes, namely US real estate, and focusing on a real-time, real-world challenge, namely the global opioid crisis. Why Detox and Recovery?. The US is experiencing an opioid crisis of an unprecedented magnitude. More than 93,000 drug overdose deaths occurred in the US in 2020, the highest number of overdose deaths ever recorded in a single year. Tragically, another 5,460 deaths were related to alcohol-specific causes. There are more than 14,000 treatment centers across the US and the number is growing. A total of 3.7 million persons received treatment in 2020, but facilities are filled to capacity and there are not enough beds. The Portfolio combines an excellent business opportunity with ESG - environ- mental, social, and governance (ESG) factors that hold increasing interest for investors. ESG performance measures non-financial disclosures which forecast the risk, resiliency, and character of an asset. At SolidBlock, we believe that the Detox Digital Property Portfolio sets our company’s standards for a socially conscious investment with promising yields as delineated within this document. 4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. Link to the PPM: Detox Medical PPM 07252021.docx - Google Docs  1280×720 80.1 KB   1280×720 40.5 KB   1280×720 76.1 KB  5. Link any available audits of the project. Both procedural and smart contract-focused audits. We self-audited the smart contract. The PPM (Private Placement Memorandum) has been prepared and reviewed by our legal team, which includes our in-house counsel, Mr. Israel Frenkel. The DDC smart contract was built. based on the Ethereum network, ERC 1404, https://erc1404.org/, audited by Pessimistic (see audit attached) 6. Link to any active communities relating to your project.  https://www.linkedin.com/company/solidblock/ Redirecting... https://twitter.com/SolidBlockCo https://youtube.com/channel/UC84dDl36X0MYEQPnpMXL7zQ Login • Instagram  Omicrom:  Home  The Digital Detox Property Portfolio:  Detox | Investor Presentation - Google Slides  7. How is the applying collateral type currently used? The current collateral type uses an asset-backed SPV tokenization structure. The asset is placed in a newly formed entity (the Delaware Series LLC) which is tokenized. 8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? The SPV for the project is the United States Delaware Limited Liability Series formed for the purpose of investing in the Detox Digital Property Portfolio . SolidBlock Inc. a Delaware C-Corp, is the general partner of this SPV and thus, bears general responsibility. The investors will be protected through the use of 3rd party compliance and audit partners, who will be acting as escrow agents on the funds collected. 9. Where does exchange for the asset occur? Exchanges may occur in two distinct ways: Via peer-to-peer trading tokens over the counter on the SolidBlock platform, following a 1-year lockup for US investors, as per the US regulation. The tokens will also possibly be listed on exchanges and ATSs with an appropriate levels of licenses with whom SolidBlock works (tZero, Archax, Merj, Atlas. one, Texture Capital, Rialto, ADAX, etc.) 10. (Determined by Legal Domain Team) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. We have created an official Private Placement Memorandum (PPM) , guided and written by our US US-licensed securities attorney (Israel Frenkel)) and are raising funds under Reg D 506C, Reg S, and Reg CF. The project also passed due diligence with North Capital, which is a registered US-based broker-dealer. 11. (Determined by Legal Domain Team) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. As mentioned above, we are using Reg D 506C, Reg CF, Reg S for which we have filed or will file Form C and Form D with the SEC. We have registered with Edgar. All the subsequent links will be provided in the comments section. We are registering the security with the CUSIP Global Services. Legal Entity Name: SolidBlock Holdings LLC - CRE (Placeholder) The GMEI/LEI registration number will be provided in the comments section. 12. List any possible oracle data sources for the proposed Collateral type. The initial data source is based on the initial valuation presented based on the appraisal provided. The data source will be the price. In other words, the question we tackle here is price-setting mechanism. Initially, there will be an issuance price and thereafter, the price oracle will be the market fee - the price for which people are actually buying and selling. It should be noted that at this point, only the SPV is borrowing against the collateral. 13. List any parties interested in taking part in liquidations for the proposed Collateral type. We have several accredited investors and groups who may be interested in taking part in the liquidation of the collateral in case of default. We will need to develop the list and grow the potential investor base together with Makerdao. ",
                    "links": [
                        "https://www.solidblock.co/about",
                        "http://www.solidblock.co",
                        "https://docs.google.com/document/d/1UtlHKzrBQYgCQ5bbOk_tHEubopLQh_8K/edit?usp=sharing&ouid=105842529195121522026&rtpof=true&sd=true",
                        "https://erc1404.org/",
                        "https://www.linkedin.com/company/solidblock/",
                        "https://www.facebook.com/solidblock.co",
                        "https://twitter.com/SolidBlockCo",
                        "https://youtube.com/channel/UC84dDl36X0MYEQPnpMXL7zQ",
                        "https://www.instagram.com/solidblockco/",
                        "http://www.omicromdevelopmentllc.com/index.html",
                        "https://docs.google.com/presentation/d/1qKlV1_E7i3N3xI8X6LNYPYhCd3tOFFrvZTSBmDcKMDY/edit?usp=sharing",
                        "https://forum.makerdao.com/t/maker-relay-ep-64/10540",
                        "https://forum.makerdao.com/t/delegate-compensation-informal-poll/10042/29",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/11",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/maker-relay-ep-63/10400",
                        "https://forum.makerdao.com/t/maker-relay-ep-63-en-espanol/10443"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.460581741365323
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "7",
                    "time": "29/08/2021-18:22:28",
                    "content": "    Yael_Tamar:  Each Property, as of the date of this Offering has been identified, renovated, developed, and is leased via a triple net lease for a 10-year period to a medical detoxification operator.   Thank you for submitting this MIP6 Application Yael. Question–can you please provide the names of the medical detoxification operators of the current tenants? A few months back I was reading about Gallus Medical Detox Centers game plan  to expand to Arizona and Colorado. Reads like a promising venture.     Yael_Tamar:  DDCs are held on behalf of investors by SolidBlock in a cold storage wallet, and can be accessed and traded through the SolidBlock Platform. Investors will also have the option to store DDCs in any ERC-20 compatible wallet.   Is that idea here that DCC token owners can use their self-custody tokens as a collateral type to borrow DAI, or are you looking to use the Custodial account to draw DAI for growth purposes?     Yael_Tamar:  We self-audited the smart contract. The PPM (Private Placement Memorandum) has been prepared and reviewed by our legal team, which includes our in-house counsel, Mr. Israel Frenkel.   Would you consider hiring a third party audit provider trusted by the Maker community and an attaining an outside legal opinion of the PPM?     Yael_Tamar:  audited by Pessimistic (see audit attached)   I can’t seem to find the attachment in this forum post, and I visited the Pessimistic Github page and can’t find an audit related to your company. Is it named differently?     Yael_Tamar:  once we build such a portfolio, we will sell to a larger fund that has an interest in acquiring ESG investments   Detox Centers are considered ESG investments, is that right?  ",
                    "links": [
                        "https://github.com/pessimistic-io/audits"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#3",
                    "likes": "6",
                    "time": "30/08/2021-09:33:46",
                    "content": "@Yael_Tamar, thank you for this collateral application, I have some initial questions. My apologies if the answer to these questions are already stated in the above text.   How does value from this project flow back to the token holders? In the above text you mention selling the project on to a larger fund at some point.   What are the timelines for the project? Both for acquiring property and returning funds to investors?   I assume these tokens will be listed on KYC’d exchanges only. What happens if one of these for some reason, like bankruptcy, must close? You have backup solutions?   Is it theoretically possible to sell these tokens on an open market (in an emergency) and then leaving it to the tokensholders to KYC themselves in order to sell the tokens on a regulated exchange?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Yael_Tamar",
                    "index": "#4",
                    "likes": "1",
                    "time": "01/09/2021-14:18:44",
                    "content": "Hi @Planet_X Thanks for your interest. 1. How does value from this project flow back to the token holders? In the above text you mention selling the project on to a larger fund at some point. There are dividends and distributions in accordance with PPM. Furthermore, there is a possibility of a liquidity event or an exit as the market improves such as selling to a larger fund  ( or as properties are sold) . In such cases, value will flow back to token holders. 2. What are the timelines for the project? Both for acquiring property and returning funds to investors? Acquired within 3 months from the capital raise, the capital gain on the underlying asset will be returned in 5 years after the aquitsions. We are going to do in tranches, and there would be quarterly distribution with an expected yield to cash of  around 7%. 3. I assume these tokens will be listed on KYC’d exchanges only. What happens if one of these for some reason, like bankruptcy, must close? You have backup solutions? The tokens we issue are available for trading on our platform (OTC), centralized exchanges (ATSs) which list the token and some DEX’s (explained below). If one of them closes, you can sell through other channels. We work with select DEX’s (decentralized exchanges) which use KYC/AML providers we recognize. We also work with ATS’s / integrate with them to facilitate trading on centralized exchanges. Individuals don’t need a DEX or a centralized exchange to sell to a 3rd party they know - they can have them register on SolidBlock to pass through KYC/AML and sell the securities over the counter (OTC). They can also post the securities on the bulletin board on SolidBlock and see if there are any takers among our users. If you want us to work with a specific DEX or a centralized exchange, we will reach out to them, examine their KYC/AML procedures and add them to our whitelist. 4. Is it theoretically possible to sell these tokens on an open market (in an emergency) and then leaving it to the tokens holders to KYC themselves in order to sell the tokens on a regulated exchange? If you want to post the tokens for sale anywhere - it is fine as long as it’s linked to our platform where users can sign up and undergo KYC/AML. As mentioned above, users will also be able to sell via regulated exchanges as well as some DEX’s with which we are connected. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.310416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Yael_Tamar",
                    "index": "#5",
                    "likes": "0",
                    "time": "20/09/2021-08:37:53",
                    "content": "Hi @flipflopflapdelegate, Thanks for your interest & sorry for replying late. 1. Can you please provide the names of the medical detoxification operators of the current tenants? A few months back I was reading about Gallus Medical Detox Centers game plan to expand to Arizona and Colorado. Reads like a promising venture. The operators that we are working with at the moment include:  Allure Detox Palm Royal Recovery Unplugged Holstix by the Sea Ertzor Investment Fund  2. Is that idea here that DCC token owners can use their self-custody tokens as a collateral type to borrow DAI, or are you looking to use the Custodial account to draw DAI for growth purposes? At this stage, we are using the DCC tokens as collateral to receive a loan from the MakerDAO community; hence we are using a custodial account to draw DAI for growth purposes. 3. Would you consider hiring a third party audit provider trusted by the Maker community and attaining an outside legal opinion of the PPM? It’s not clear to us what the purpose of hiring a third-party audit provider and an outside legal opinion of the PPM would be. Is it a requirement of the Maker community? 4. I can’t seem to find the attachment in this forum post, and I visited the Pessimistic Github page and can’t find an audit-related to your company. Is it named differently? Please see the PDF. 5. Detox Centers are considered ESG investments, is that right? ESG Investing refers to investing which prioritizes optimal environmental, social, and governance (ESG) factors or outcomes where investments are made with consideration of the environment and human wellbeing, as well as the economy. So to the extent that people are dying at an alarming rate from drug overdose and the businesses that operate in the properties we own to provide a significant service to help these people with a life or death affliction, these centers qualify for an ESG Investment. ",
                    "links": [
                        "https://github.com/pessimistic-io/audits",
                        "https://drive.google.com/file/d/1zLkVc2uL-9yOTAjn_dZRCc2EqwDLjwJM/view?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.118271221532091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "2",
                    "time": "20/09/2021-11:31:43",
                    "content": "Thank you for your response.     Yael_Tamar:  We self-audited the smart contract.   You “self-audited” the smart contract— you don’t think a third-party audit would benefit All? More than likely MKR token owners will prefer other eyes to perform an audit. With regards to the PPM — it was “prepared” and  reviewed by your legal team/GC — not a requirement, but more than likely MKR token owners will want a 3rd party review as well, IMO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8353174603174605
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Yael_Tamar",
                    "index": "#7",
                    "likes": "1",
                    "time": "20/09/2021-11:55:42",
                    "content": "Hi @flipflopflapdelegate , Great questions again! Actually our smart contract code was audited by Pessimistic! The audit is on GitHub: audits/SolidBlock Security Recheck.pdf at main · pessimistic-io/audits · GitHub Every time we tokenize the new entity, it’s a new contract but it’s virtually identical to the first one which was audited by Pessimistic. The difference is in the metadata - various compliance events, additional documents and other info that help investors by providing access to as much information as possible. If necessary we will get this smart contract audited by Pessimistic as well if that gives peace of mind to the investors. Regarding the PPM audit - that’s not customary. We provide it for investors to have a peace of mind with ALL the business and legal information available. We recommend every investor reads through the PPM prior to investing. Happy to schedule a webinar to run through the PPM! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.131334351922587
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#8",
                    "likes": "3",
                    "time": "21/09/2021-14:43:35",
                    "content": "Greenlight poll of this asset is active here: https://vote.makerdao.com/polling/Qmd7oS1n?network=mainnet#poll-detail Polling ends on Monday, October 4th. Please vote if you have opinions on this collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Yael_Tamar",
                    "index": "#10",
                    "likes": "0",
                    "time": "30/03/2022-15:10:27",
                    "content": "Hi @Buchigon Happy to answer! How do you prefer to communicate? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#11",
                    "likes": "0",
                    "time": "02/05/2022-04:48:05",
                    "content": "Dear @Yael_Tamar & team The process for MIP6 applications for off-chain collateral, so called real-wold assets, has been under significant review by the teams involved in collateral onboarding (RWF, CES, Growth and incubating LTS and LOVE). See more for collateral onboarding process. The goal of this process update is to provide MKR tokenholders and respective delegates a comprehensive view of MIP6-RWA applications from a credit, legal and technology perspective so tokenholders can make a more informed decision before moving applications through the execution of the onboarding process after greenlight. As part of this review, MIP67 and the underlying Methodology for structured finance transactions were written to provide applicants with a more comprehensive set of guidelines and requirements so MIP6 applications are fit for purpose and closer to a state where they could be executed, if prioritised by tokenholders during polls. MIP67 is now part of the MIP6 process. It is designed to fill the gaps in the MIP6 application for RWAs. Our domain team is aligned to the approved MIP67 process and Methodology. We are asking MIP6-RWA applicants to express whether they will retrofit their MIP6 applications in line with MIP67/Methodology guidelines. We ask applicants to express their intention by Mon 9 May at 12pm UTC. The collateral application template is located here: MIPs Portal. Status of MIP6 applications that do not express their interest by 9 May will be considered “withdrawn” from a MIP6 collateral onboarding point of view by the aforementioned Core Units and reflected in the CSI. We understand that once applicants express their intentions, there will be a period for drafting and updating documentation of the newly proposed MIP6 applications. Our teams will be available to provide guidance to applicants during this time. Kind regards, William. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip67-methodology-and-review-process-for-structured-finance-transactions/13737",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://vote.makerdao.com/polling/QmWt5fov#vote-breakdown",
                        "https://mips.makerdao.com/mips/details/MIP6#component-summary",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.713068181818182
                }
            ]
        }
    ],
    "group_index": "22"
}