{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/idea-for-visualizing-progress-for-collateral-onboarding/3348",
            "title": "Idea for visualizing progress for collateral onboarding ",
            "index": 3348,
            "category": [
                "Miscellaneous",
                "Site Feedback"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/freiza",
                    "index": "#1",
                    "likes": "8",
                    "time": "25/07/2020-01:10:15",
                    "content": "Sometimes it is unclear what the status is on certain collateral types, like which ones have passed, which ones are being implemented by the Foundation, and what’s on deck. What if we could make a quick dashboard that is updated weekly to show the status of collateral, and also get a clearer indication of which of the ‘passed’ collateral types are currently being worked on, and what is next? We have a pretty decent backlog of collateral types, and I myself am curious when things like PC-DROP (passed a little while ago) will get worked on.  An idea is to put everything into a simple Trello board [attached][ or some other project management tool, to quickly visualize the collateral lifecycle of Maker.  This can give governance slightly better view into the Foundation’s work, without being too overbearing.  Better yet, this could be a website where people can monitor vote status, access forum links, etc.  Is this desirable to people?  The downside is this just another artifact to maintain, so it should only be done if its useful.  How else are people currently keeping track today? col-status1442×680 89.1 KB ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6828497023809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tbone",
                    "index": "#2",
                    "likes": "2",
                    "time": "25/07/2020-08:16:02",
                    "content": "Have you seen the Collateral Status Index ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "1",
                    "time": "25/07/2020-10:26:14",
                    "content": "Definitely an idea worth considering. Are you currently maintaining this for personal use? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/freiza",
                    "index": "#4",
                    "likes": "2",
                    "time": "25/07/2020-14:30:00",
                    "content": "I was not aware of the Collateral Status Index, that’s exactly what I was looking for and I think serves the purposes of what I was looking for. Long, I don’t maintain this list, I mainly put it together as a strawman for illustrative purposes. IMO we could probably lock this thread given the collateral status index ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.302083333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "0",
                    "time": "01/08/2020-14:30:03",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}