{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/risks-on-usdc-a-and-all-the-other-collateral-with-l-r-101/4266",
            "title": "Risks on USDC-A and all the other collateral with L.R 101% ",
            "index": 4266,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Samyak",
                    "index": "#1",
                    "likes": "0",
                    "time": "19/09/2020-17:02:06",
                    "content": "Current situation: L.R at 101%, stability fees 6% & DAI at 1% slippage. If a user decides to withdraw all the collateral to 101% (liquidation point). Most favourable condition for users who opened their vault when DAI had more than 1.5% slippage. Users can realise a minimum of 0.5% benefit without having anything at risk. If DAI stays at 1% for more than a month. There will be no liquidators for vaults and in a little less than 2 months total vault debt will cross total vault collateral putting the Maker protocol at risk. Immediate action:- Reduce stability fees to 1% or 2% if not 0. (As we’re seeing at 6% no one is minting DAI at 1% slippage) I believe ETH will be the main reason for DAI stability but till the time ETH price surges USDC & stable coins should provide cushion to keep the DAI stable. Edit: Stability fee is 4%. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.642045454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "3",
                    "time": "19/09/2020-17:27:08",
                    "content": "Stability fees are 4%.     Samyak:  (As we’re seeing at 6% no one is minting DAI at 1% slippage)   ETH Stability fee is 0% right now. Stablecoins are minting DAI like crazy right now. Liquidation 2.0 is scheduled to come out before stability fees are greater than collateral value. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.7214285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "1",
                    "time": "20/09/2020-02:17:18",
                    "content": "I had similar concerns but literally if vaults go into liquidaiton we can simply liquidate them up to the 1.01 mark and still come out even.  Only if the price stays high (which it might) in 3 months might we start having issues at 4%. As a USDC-A vault user frankly I can find a way to clear my vault and get the .5-1% for myself which I am already doing. There was a reason I wanted to stagger stablecoin liquidity over a sequence of vaults with increasing liquidity at a higher LR and this was to give an overall higher abandonment price as the liquidity increases. Unfortunately I think this increasing average LR on the USDC vs. DAI oustanding in the model I proposed went past most people.     [Signal Poll] Use multiple stablecoin (e.g. USDC) vaults with different LR/DC combinations to manage value/price/risk exposure Governance       Currently Maker governance is considering changing the USDC-A parameters.  Currently recently changed USDC-A parameters:  Collateralization Ratio: 103 (lowered just a day ago from 110) soon to 101  Debt Ceiling: 200M (raised from 100M just a day ago from 100M)  Risk Premium: 2%  The goal of this signal request is to modify how Maker is extending Debt Ceilings against Liquidation Ratios on not just USDC but all of the stablecoins.  I use USDC here just to give a flavor of what this proposal is su…     As SFs rise this abandonment will become more of a problem/hazard.  Fortunately though once Liq2.0 is brought on line we can probably clear much of that abandoned collateral at a slight profit.  But as you point out there will be a SF interest hole that will have to be filled or adjusted somehow if that 1% on the 101 LR isn’t enough to fill. Basically with SF at 4% a 3month clock is ticking on Liq2.0 from after the LR went to 101 (what yesterday) before we hit those marks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.389855072463768
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Samyak",
                    "index": "#4",
                    "likes": "2",
                    "time": "20/09/2020-04:12:53",
                    "content": "Got it. Although, if DAI stays at 0.7%-1% slippage I think even with the liquidation system in place in month collateral & debt will be having ~0.7% difference which will result in no profit for liquidators. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#5",
                    "likes": "1",
                    "time": "20/09/2020-07:41:05",
                    "content": "Some debt won’t be clear that sure however it increases the supply. We won’t recover the whole percentage but if we take a cut on it let say 50% Only new created debt can have a benefit to sell. For example : 1010000 debt created today can be sell at 1009900 can be sell  1.099 with 0.1 profits today But the debt not cleared today will need to be sell at 1006500 in one month to get the same 0.1 profits. In 3 months all debt created today won’t be sellable at 1.000 but if makerdao take a 50% cut it can sell it at 1.005 with still a dai backed at 100% but with an actual interest at 2%. Tho the dai will need to go under 1.01 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6688311688311686
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "20/12/2020-13:41:10",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}