{
    "poll_list": [
        {
            "title": "Lower Stablecoin Stability Fees - November 16, 2020",
            "index": "5131",
            "option": "NO_RESULT",
            "supporting_mkr": "-1",
            "highest_fraction": -1
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-lower-the-stablecoin-vault-fees/5131",
            "title": "[Signal Request] Lower the Stablecoin Vault Fees ",
            "index": 5131,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "4",
                    "time": "13/11/2020-14:11:50",
                    "content": "So I know we are right in the middle of a vote to determine what to do about the stablecoin vaults, but things are moving quickly and we have just had another wrench thrown into the spoke. It looks like the DsChief 1.2 upgrade will be consuming most of the executives until December 11th. As @LongForWisdom said in his reply, this upcoming week is likely the last place to put through changes. We are still in the process of settling whether governance wants to proceed with Option 3 or the new PSM option that just came out this week. Regardless of the eventual outcome, we are racing against the clock here. If we want to proceed with the PSM instead of Option 3 we will likely want to have the CR on the leading stablecoin vaults be more than 100.2% or so to allow for a 0.1% profit to those wanting to move over to the PSM  naturally. Additionally, even if we stick with Option 3 the timeline of doing an executive on December 11th was previously voted down and Dec 18th is problematic as it’s so close to the holidays. I’m unclear if MKR holders want to wait another week or two to maximize the fees. I’ll be running another governance vote soon to determine the Option 3 timeline, but due to this DsChief upgrade I believe it’s a good idea to lower the SFs on stablecoin vaults so we aren’t so rushed. We can always adjust them again later, so we will collect the fees one way or another. Personally, I recommend we lower to at least 2% to put us at ~100.2% CR for December 18th. Due to the time constraints, @LongForWisdom has okayed me to run this from today until Sunday followed by an on-chain vote Monday.    Should we lower the Stability Fee on USDC-A/TUSD-A/PAXUSD-A?  No, leave them at 4% Yes, lower them to 3% Yes, lower them to 2% Yes, lower them to 1% Yes, lower them to 0% Abstain     0 voters     ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmY1vJPs?network=mainnet#vote-breakdown",
                        "https://forum.makerdao.com/t/signal-request-accelerate-the-psm-launch/5094",
                        "https://vote.makerdao.com/polling/QmQed3Ca?network=mainnet#vote-breakdown",
                        "https://forum.makerdao.com/t/maker-relay-ep-21-en-espanol/5199",
                        "https://forum.makerdao.com/t/maker-relay-ep-21/5181"
                    ],
                    "GPT-summary": "The author of the post is proposing to lower the stability fees on stablecoin vaults due to time constraints and the upcoming DsChief 1.2 upgrade. The author is asking for feedback on whether to lower the fees and by how much. A 3rd party is giving constructive criticism by suggesting that the author should provide more information on the potential risks and benefits of lowering the fees. Another 3rd party is asking a question about whether the stability fees should be lowered for all stablecoin vaults or just specific ones.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.283297258297258
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "4",
                    "time": "13/11/2020-14:18:25",
                    "content": "I’m getting whiplash from the constantly changing solutions to fix this problem, but I think I can finally see the light at the end of the tunnel. PSM is going to be great! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#3",
                    "likes": "1",
                    "time": "13/11/2020-14:20:00",
                    "content": "Haha tell me about it. Never a dull day in crypto.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.864583333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "5",
                    "time": "13/11/2020-15:42:34",
                    "content": "IMO–as long as we don’t have a stable DAI Peg–we should be at 0% SF. It’s against my better judgement–but I’m willing to take the long-route to success… On the other hand I admire that the Community is taking the bull by the horn here–if anything, I wish Sam would have just released the PSM as an Anon–would have been interesting  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.075
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#5",
                    "likes": "0",
                    "time": "13/11/2020-15:43:24",
                    "content": "We should liquidate bad vaults - that’s one of the pillars of the DAI system. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.5000000000000009
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#6",
                    "likes": "0",
                    "time": "14/11/2020-04:41:40",
                    "content": "We don’t need to make SF = 0, just temporarily balance the stablecoin pool. I choose SF = 2% in order to maximize revenue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#7",
                    "likes": "3",
                    "time": "14/11/2020-09:23:14",
                    "content": "SF = 0% doesn’t help the peg. The vaults will unwind before you hit DAI = $1, that’s 400M of DAI selling before the peg. If the CR of those vault is 100% you go faster to the peg (and giving you a safety buffer that DAI doesn’t go too much below $1 easily). Anyway, the PSM will solve both in a clean way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#8",
                    "likes": "3",
                    "time": "15/11/2020-14:05:38",
                    "content": "I’ve closed the poll. This seems like a controversial enough vote to necessitate a ranked choice on-chain vote with all options (except 3% which didn’t get much support). Thanks for participating on the short notice everyone. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "16/12/2020-00:05:40",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2932"
}