{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-communications-team-research-form/2713",
            "title": "Governance Communications Team - Research Form ",
            "index": 2713,
            "category": [
                "Governance"
            ],
            "tags": [
                "user-research",
                "communications"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#1",
                    "likes": "13",
                    "time": "02/06/2020-15:46:33",
                    "content": "Hi friendly forum folks. Tim here with Comm-Dev. I take notes in the Governance meetings, among other activities. One of those activities is a proto-Governance communications group. Starting back with our project plan posted by Mitote to a recent chat from cryptowanderer. There have been mentions, doc templates, and ideas swirling around a “Decentralized Governance PR-team” or “archive-all-the-threads-website kinda thing” for a bit. A small team has taken some initiative to help scope and frame these ideas but we’ve hit some roadblocks along the way. Ergo, we’ve got this form to ask everyone who participates in Governance about Governance communications. Consider this form a call for more insights and more members. We have a group in rocketchat and a weekly call to try and build towards some sort of cadence if anyone is interested in joining ping me. We welcome everyone’s feedback so we can get a template for “comms-at-a-glance” agreed upon and build a network of contributors that help improve Governance communications every other week. ",
                    "links": [
                        "https://forum.makerdao.com/t/community-driven-governance-messaging-project-plan-placeholder-name/1875/8",
                        "https://chat.makerdao.com/channel/general?msg=p4Ddqx2nhWD5wt9Wx",
                        "https://forms.gle/qfF5fD4t5J2G5ygv8",
                        "https://chat.makerdao.com/direct/tim.black",
                        "https://forum.makerdao.com/t/guide-navigating-feedback-from-governance-and-the-greater-makerdao-community/8303",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-june-4-9am-pst-4-00-pm-utc/2737/3"
                    ],
                    "GPT-summary": "The author of the post is explaining the purpose of a form that has been created to gather insights and feedback from participants in Governance about Governance communications. The author is also inviting interested parties to join a group and weekly call to help improve Governance communications. The post does not advertise the proposal, but rather seeks collaboration and feedback.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.875
                }
            ]
        }
    ]
}