{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/introducing-the-collateral-onboarding-handbook/5134",
            "title": "Introducing the Collateral Onboarding Handbook ",
            "index": 5134,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "collateral-onboard",
                "mips",
                "guide",
                "governance",
                "documentation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#1",
                    "likes": "17",
                    "time": "13/11/2020-17:53:46",
                    "content": " addtext_com_MTU1MDU3MjAwMTg1024×614 20.5 KB   Introduction The collateral onboarding process for MakerDAO emerged organically from the community over the past year and was formally introduced via MIPs Framework in May 2020. Over the past six months, the collateral onboarding process has evolved quite considerably and most recently moved to use a more flexible, weekly approach. Given the community’s feedback on the collateral onboarding process over the past few months and the observed difficulty in parsing the various available materials and understanding how to onboard an asset from A to Z, it has become apparent that the MakerDAO community and project teams seeking to onboard collateral may find the process frustrating and cumbersome without a clear primer. Therefore, in order to smooth MakerDAO’s journey to complete decentralization, the MakerDAO domain teams and the Maker Foundation have synthesized the collateral onboarding processes into this series of “first-cut” guides for the risk, oracles, smart contracts, and governance.  What is the Collateral Onboarding Handbook? The Collateral Onboarding Handbook contains a thorough collection of information regarding Maker Protocol collateral onboarding, ranging from the formation of domain teams and the explanations of the governance processes involved to the domain work used to date for successful collateral onboarding, and more. Many of the collateral onboarding procedures described here emerged organically as the Protocol matured over the last year and as the DAO expands and the Foundation recedes, this handbook will serve as a versatile tool, ever-evolving and ultimately molded by Community members to fit Community needs.  Handbook Content Directory   Introduction to MakerDAO Collateral Onboarding   Getting Started  Overview of the Collateral Onboarding Process Collateral Onboarding Stakeholders    Community Involvement  Collateral Onboarding Status Updates (Coordination and Communications)  Collateral Onboarding Community Collateral Onboarding Calls Collateral Onboarding Prioritization Framework spreadsheet Collateral Onboarding Funding    Collateral Onboarding Governance Process   Collateral Onboarding Guide for Oracle Domain Teams   Collateral Onboarding Guide for Smart Contracts Domain Teams   Collateral Risk Assessment Guide   Resources  Collateral Onboarding Glossary Resources List    The full Collateral Onboarding Handbook can be found at collateral.makerdao.com.  Next Steps With this Collateral Onboarding Handbook, the goal is to ease the process for community members to get involved with MakerDAO collateral onboarding. Once you have read through the Handbook or the specific areas that interest you and get a feel for the process, please reach out to @amyjung to discuss the next steps about the current grants program for collateral onboarding. For more information about getting involved, check out the Collateral Onboarding Grants Initiative. /fin ",
                    "links": [
                        "https://collateral.makerdao.com/",
                        "https://collateral.makerdao.com/introduction-to-collateral-onboarding/high-level-overview-of-the-collateral-onboarding-process",
                        "https://collateral.makerdao.com/introduction-to-collateral-onboarding/cob-stakeholders-overview",
                        "https://collateral.makerdao.com/cob-team-coordination-and-communications",
                        "https://collateral.makerdao.com/community-collateral-onboarding-calls",
                        "https://collateral.makerdao.com/cob-prioritization-framework",
                        "https://collateral.makerdao.com/collateral-onboarding-funding-grants",
                        "https://collateral.makerdao.com/governance-and-collateral-onboarding/untitled",
                        "https://collateral.makerdao.com/oracles-domain/untitled",
                        "https://collateral.makerdao.com/smart-contracts-domain/untitled",
                        "https://collateral.makerdao.com/risk-domain/untitled",
                        "https://collateral.makerdao.com/resources/collateral-onboarding-glossary",
                        "https://collateral.makerdao.com/resources/resources-list",
                        "http://collateral.makerdao.com",
                        "https://forum.makerdao.com/t/collateral-onboarding-grants/4252",
                        "https://forum.makerdao.com/t/maker-relay-episode-22/5288",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-119-thursday-november-19-16-00-utc/5112/3",
                        "https://forum.makerdao.com/t/weekly-mips-update-21/5222",
                        "https://forum.makerdao.com/t/all-available-guides/16159",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-119-thursday-november-19-16-00-utc/5112/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-21-en-espanol/5199",
                        "https://forum.makerdao.com/t/maker-relay-ep-21/5181",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/6",
                        "https://forum.makerdao.com/t/discussion-long-run-business-strategy-collateral/7547/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-22-en-espanol/5290"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7290640394088665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#2",
                    "likes": "2",
                    "time": "13/11/2020-18:09:06",
                    "content": "All initiatives to make this process clearer are greatly appreciated. Thank you ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "0",
                    "time": "13/11/2020-19:19:05",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}