{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/havenly-digital-residential-mortgage-rwa-proposal/19325",
            "title": "Havenly Digital - Residential Mortgage RWA proposal ",
            "index": 19325,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral",
                "collateral-onboard",
                "real-world-finance",
                "rwa",
                "mip6"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Ryan_Oakley",
                    "index": "#1",
                    "likes": "3",
                    "time": "05/01/2023-20:11:46",
                    "content": "Dear Maker Team, we are currently exploring opportunities within de-fi to open new liquidity channels and increase access to home ownership in the US.  In return we are offering stable RWA yields to de-fi investors.  Please see below for a more detailed explanation of our proposal.  We are keen to progress and would to hear any questions or other feedback Maker community might have. @recognized-delegates. @Real-World-Finance @collateral-core-unit About Us: Havenly Financial Inc. (HFI) is committed to expanding access to home ownership in America. With a focus on underserved markets, we seek to provide financing opportunities to home buyers typically locked out of the residential home loan market. HFI has access to an efficient mortgage origination platform from which to originate and acquire loans in underserved markets, namely our subsidiary Town Square Mortgage & Investments, LLC (TSM). TSM funded over $1 Billion in residential mortgages in both 2020 and 2021, and is on track to fund over $800 Million in residential mortgages in 2022 despite the rapid interest rate increases caused by the Fed throughout the year. TSM is licensed in 14 states, and is expanding into other states during 2023. Our subsidiary, Havenly Digital (HD), is focused on leveraging emerging decentralized finance markets (DeFi) to provide liquidity to TSM for originating loans in underserved markets while providing a return to digital investors backed by real-world asset yields. HFI’s business model creates a unique platform allowing us to bridge the lending gap and match borrower risk with investor risk appetites.  Revolutionary Credit Risk Process: Innovative and highly predictive credit risk assessment drives loan approval for homebuyers with little to no traditional credit by focusing on their cashflow from income, assets, and expenses, and their financial volatility. Specialized Mortgages: Portfolio home loan products with long-term stability and stable income potential designed to match borrower risk profiles to investor risk appetites. Digital Finance: Integration with De-Fi markets to provide alternate stable liquidity channels to underserved home buyers while offering residential mortgage interest yields direct to digital investors.  Our executive team has decades of experience originating, securitizing, and managing portfolios of mortgage loans against diverse rate environments and macro conditions. Our team has well-established reputations and industry connects, both created while completing over 300 whole loan and mortgage-back securitization transactions over the last twenty-five years, totaling in excess of $500 Billion.  Lisa Thomas: CEO of HFI, HD and TSM. Mortgage industry veteran, entrepreneur and executive with a reputation for servant leadership, innovation, revenue generation, cost control, and continual process improvement, 25+ years of experience in capital markets, securitization, portfolio acquisition and risk management. Ryan Oakley: Co-Founder and President of HD, and chief visionary. Dynamic transformational leader and driving force behind the company’s digital finance strategy with a demonstrated track record of improving operational capabilities and achieving targeted objectives within global financial services firms such as HSBC, Credit Suisse and Deutsche Bank. Leon Daniels: Chief Capital Markets Officer of HFI and HD, and EVP of Capital Markets for TSM. 25+ years modeling mortgage and bond cash flows for structured finance vehicles across different asset classes, including product development, pricing, hedging, and portfolio management expertise for MBS and ABS. Kevin Sawyer: Chief Technology Officer of HFI, HD and TSM. Serial entrepreneur with 30+ years of technology leadership and digital transformation for clients, founder of Advanced Programming, Consulting & Integration LLC, an MSP and VAR specializing in telecommunications, networks, servers, desktops, Windows, Linux, Cisco IOS, routing, switching, VoIP/SIP, full stack development, cloud services, ERP and CRM platforms. Brian Simons: Chief Operations Officer of HFI and HD: Successful entrepreneur and mortgage industry executive, founder of Altavera Mortgage Services LLC, sold to Computershare (ASX: CPU), a publicly traded multinational financial services firm, licensed mortgage loan originator in 32 states plus the District of Columbia. Riad Bacchus: Head of Delivery for HD. Digital project management with expertise in software development, including custom applications, planning, analysis, design, implementation, quality assurance, and delivery execution. Well-versed in traditional Waterfall, Agile development (RAD, XP, and Scrum), and Rational Unified Processes.  To date, HFI has raised $500k in capital from founders and has $0 external capital or debt. HD will maintain a revolving credit facility to support mortgage acquisition. Our revenue will be based on Origination Fees: c. 1% (100bps) and a target net interest margin of 1-4% (100-400bps). How it works: HD purchases loans originated by our affiliate that meet our risk-return requirements for the portfolio. The mortgages are held in our proprietary ‘revolver’ fund structure, from which we issue short-term notes in the form of digital collateral. The short-term notes offer yields tailored to meet digital investor risk-return appetites. Digital investors provide liquidity in the form of stablecoin investments (e.g., USDC) in return for real-world asset yields. At redemption, digital investor capital is returned and investment opportunities are opened for new digital investors.  1600×791 169 KB  Investment Pool Parameters:  HD plans to launch with an initial investment pool of ~1M USD, growing to 100M over the next two years, according to continued investor interest. Senior tranche notes issued from the loan pool with ~4-5% yields and subordinate tranche notes offered with higher risk and returns. HD intends to use existing credit facilities with major US banks to support the initial mortgage portfolio acquisition and leverage existing secondary market investor relationships to drive adoption and investment into the pool across senior and junior tranches in accordance with investor risk appetites.  Mortgage Asset Parameters: The investment pool will be comprised of mortgage assets with the following characteristics:  Average Loan Amount: ~300k Mortgage rates: 6-12% Average expected life: 7-10 years, factoring in prepayments. Expect Default Rate: < 3.5%  Risk Management: Our team is comprised of industry veterans with decades of experience in managing mortgage portfolio risk. Our risk management approach starts with asset selection, due diligence, and portfolio structuring, considering rate environments and broader macro factors. All assets will be collateralized by a Deed of Trust or Mortgage on the residential property securing each home loan. As with any mortgage-backed product, the principal risks are centered around Credit Risk driven by borrower prepayments and ability to repay the loan; Market Risk from property value fluctuation, natural disasters, etc.; Interest Rate Risk impacting new loan origination supply and payment/cashflow performance on existing loans in the portfolio; and Liquidity Risk impacting redemptions, payouts and notes refinancing. Continuously monitoring of the risk-return profile of the portfolio, and our unique revolver structure will allow us to manage the underlying asset risk as or more effectively than a traditional mortgage-backed security (MBS). Additionally, Regulatory Risk plays a factor given the likely evolution of crypto regulation globally. We are continuing to monitor this situation for any pertinent developments. Next Steps: We intend to be a premier provider of real-world asset yield products to decentralized finance. We are evaluating DeFi platforms, including Centrifuge, Goldfinch, and others to identify stable, high volume platforms to support our planned product expansion. We are also engaging DeFi lending facilities with several stablecoin communities, including Maker, Aave, and Circle USDC to fund senior tranche investments. Our business development team is actively engaging our capital market and venture capital partners to grow investment into our loans pools as well as direct equity and debt issuance to support continued business development. For more information on investment opportunities, please contact us at [email protected] ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.398843700159491
                }
            ]
        }
    ]
}