{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/improving-legal-templates-and-structure-for-rwa-originators-using-centrifuge/9041",
            "title": "Improving Legal Templates and Structure for RWA Originators using Centrifuge ",
            "index": 9041,
            "category": [
                "Governance"
            ],
            "tags": [
                "centrifuge",
                "real-world-finance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/_LS",
                    "index": "#1",
                    "likes": "3",
                    "time": "29/06/2021-22:27:35",
                    "content": "This is a follow up on Seb’s Post Mortem summarizing the events and the community discussion around New Silver’s change of their Executive Summary and their Tinlake pool parameters. Over the last couple of weeks we have been improving the legal documents that are used in the Centrifuge model to address all concerns that were raised around the lack of control and insufficient time to act as a decentralized autonomous community of MKR holders. A concern the community raised is the ability of the Asset Originator to change the terms and conditions of the issued DROP tokens stated in the Executive Summaries with only a limited recourse by investors. Even if those changes are of good intent and following changing market conditions as it has happened in the case of New Silver, the process was too fast, not transparent enough, and MakerDAO governance missed the opportunity to respond and discuss the changes. We had longer discussions with our legal support, New Silver, and the other Asset Originators currently approaching Maker and using the Tinlake Protocol. This results in material improvements in the way Assets Originator will have to interact with Maker and how Maker can respond. Details Together with CitadelSPV (https://citadelspv.com/) - one of the leading service providers for asset-backed security offerings and state-of-the-art capital market services, we are publishing templates and information on how CitadelSPV can become an independent manager for the SPVs. Every one of our US-based Asset Originators can use these templates to make their SPV, which is operating the pool, and owning and managing the underlying assets fully bankruptcy remote. On top of this industry-standard independent manager setup, we included rules to address the specific concerns of the MKR holders. Every interested community member can register as a DROP Investor Representative to get full notification rights without the need to sign a DROP subscription agreement and to purchase DROP tokens. The Independent Manager ensures now as an independent third party that any change to the terms and conditions of the offering, meaning the Executive Summary, can only be executed if:  The SPV has notified all DROP Investors and DROP Investor Representatives about the change in an email with the Executive Summary attached. Whereas all changes are highlighted in review mode. The SPV has posted these changes on the Maker forum as well. The notification has happened at least 28 days ago. There are no open DROP redemption requests.  The last point is very important and gives Maker the ability to disagree with and reject those changes. MKR holders have 28 days to vote and trigger the redemption of the DROP tokens in the Maker vault if there is a disagreement. The change cannot take place as long as this redemption is not fully satisfied, which means until all DROP tokens of the Maker vault are liquidated for their current DAI value. Next steps This has been finalized for New Silver and will be provided to all Asset Originators using Centrifuge and Tinlake. We are working with our other AOs to adopt this as well. Further improvements will come. The trust structure comes to mind but we would like to see this going live first as we see significant hurdles still to overcome here. Those measurements are not free of course and come with significant legal costs. Our focus is on carefully growing the first Maker vaults to a size justifying that these efforts make sense for Asset Originators. With New Silver we are ready to take the next steps and others will follow soon. Here are the template PDFs  Independent Manager Service Agreement Operating Agreement with Independent Manager  ",
                    "links": [
                        "https://citadelspv.com/",
                        "https://drive.google.com/file/d/1sADj8ZsXc8EyUMQw21dlyyZ1Cw17Fs33/view?usp=sharing",
                        "https://drive.google.com/file/d/1y1AQ4NWS2XGjCTfCPl4K8uWUTmKraRN8/view?usp=sharing"
                    ],
                    "GPT-summary": "The post explains how the legal documents used in the Centrifuge model have been improved to address concerns raised by the community around the lack of control and insufficient time to act as a decentralized autonomous community of MKR holders. The post also provides details on how CitadelSPV can become an independent manager for the SPVs and how the Independent Manager ensures that any change to the terms and conditions of the offering can only be executed after notifying all DROP Investors and DROP Investor Representatives. The post also provides links to the template PDFs.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.531054239877769
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "1",
                    "time": "29/06/2021-22:33:01",
                    "content": "These sound like significant improvements, and I look forward to reading the new documentation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.518939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "29/09/2021-04:33:59",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}