{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-flop-mkr-vesting-contracts/4242",
            "title": "Discussion: Flop MKR Vesting Contracts ",
            "index": 4242,
            "category": [
                "Governance"
            ],
            "tags": [
                "flop-auction",
                "discussion"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#1",
                    "likes": "1",
                    "time": "18/09/2020-04:25:51",
                    "content": "Tl;dr Flop MKR vesting contracts When MKR Flops there is concern that MKR dilution will occur at a depressed MKR price unfavorable to token holders. A possible solution is a new, additional Flop mechanism that auctions off not MKR, but a vesting contract paying MKR over a time period. I think this would incentivize hodlers to buy them at a discount, but maybe at less of a discount than a MKR Flop. I am not proposing it, I want to know why people think this is a good idea or not, and worthy of development resources or not. ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing a new mechanism for dealing with concerns about MKR dilution when MKR flops. They suggest an additional Flop mechanism that auctions off a vesting contract paying MKR over a time period. The author is not proposing this mechanism, but rather asking for feedback on whether it is a good idea and worthy of development resources.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.003030303030304
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#2",
                    "likes": "3",
                    "time": "19/09/2020-15:15:13",
                    "content": "Interesting idea, but I doubt that equilibrium bid price for FLOPs would be higher if we offer bidders an objectively worse token (MKR with vesting restrictions vs regular MKR). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#3",
                    "likes": "0",
                    "time": "24/09/2020-06:04:05",
                    "content": "Agree that anyone buying it will demand a discount vs. regular MKR. In exchange for the discount, Maker is building a portfolio of locked MKR. Wouldn’t that have a DSR-like effect (locking MKR instead of Dai) of increasing scarcity and, all other things equal, MKR price? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "24/12/2020-12:04:06",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}