{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/looking-for-help-with-an-old-cdp-from-last-year/3674",
            "title": "Looking for help with an old CDP from last year ",
            "index": 3674,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "tech-support"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Tirapon",
                    "index": "#1",
                    "likes": "0",
                    "time": "15/08/2020-21:47:27",
                    "content": "Hi all, I am looking for someone with good technical knowledge of CDP contracts to help me with this issue. Last year I opened a CDP via the old online portal at https://cdp.makerdao.com/. I put up ETH as collateral and used DAI to buy more ETH, which I then added to the pool of collateral in order to lower the price at which I’d be stopped out of my position. I was basically leveraging a long position on Ethereum. I have tried to migrate the contract using the tool at https://migrate.makerdao.com/ however the migration keeps failing. I’m pretty sure I just need to add the correct amount of funds in either DAI or SAI, and MKR, in order to cover the relevant fees. I’m not completely familiar with the technicalities of smart contracts and could really do with some help understanding my best option at this point. This was my first attempt at using any form of DeFi contract. I am hoping I can find someone with enough relevant knowledge to help me resolve the issue, and I will pay for their service. Thanks ",
                    "links": [
                        "https://migrate.makerdao.com/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.316701680672269
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tirapon",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/08/2020-23:49:07",
                    "content": "(What could possibly go wrong?) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#3",
                    "likes": "0",
                    "time": "16/08/2020-01:42:21",
                    "content": "The Sai to Dai bridge was closed many months ago. You now have to source SAI on the open market and pay back your cdp to unlock your collateral and open a new vault (cdp) on oasis.app/borrow ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.446969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tirapon",
                    "index": "#4",
                    "likes": "0",
                    "time": "16/08/2020-01:50:06",
                    "content": "Hi, thanks for the response. If I source the SAI and migrate to Oasis, A) How much SAI do I need? the migration portal gives no details re. amount required. (What percentage of the original position? I think the stability fee was 8% or so?) B) once migrated, will I still be the rightful contract owner of the full amount of ETH in the contract (Or PETH or WETH or whatever form my original Ethereum had to take in the creation process). I really appreciate any help with this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tirapon",
                    "index": "#5",
                    "likes": "0",
                    "time": "16/08/2020-01:52:31",
                    "content": "As far as I can tell, I may need to load the contract owning address with the correct amount of SAI and MKR, in order to migrate the original contract to oasis.app I don’t know how much SAI or MKR I require, and I don’t know if this will entitle me to the full balance of ETH in the contract. I’ve already screwed up once, and I want to make sure I don’t make any further mistakes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.270833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tirapon",
                    "index": "#6",
                    "likes": "0",
                    "time": "16/08/2020-02:13:37",
                    "content": "Well shit, SAI is gonna cost me a pretty penny these days. (Does this mean I’m fucked?) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.921875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#7",
                    "likes": "0",
                    "time": "16/08/2020-02:30:56",
                    "content": "Not sure exactly what you need to do as I have never had to deal with this problem but check out sai.makerdao.com ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tirapon",
                    "index": "#8",
                    "likes": "0",
                    "time": "16/08/2020-02:37:00",
                    "content": "No luck with that site…  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tirapon",
                    "index": "#9",
                    "likes": "0",
                    "time": "16/08/2020-10:53:31",
                    "content": "Looks like I need to source enough SAI to cover the original loan, and enough MKR to cover the stability fee. Then I can somehow load the contract address and migrate the contract onto the Oasis platform. I’m not 100% certain if this is correct, and even if it is, I have no idea where to source SAI and how to load the contract. Will I end up with all of my original collateral back in my wallet? Or just a new contract on the new platform? I have sent an email to [email protected] and hoping for a response. (Sorry, I keep re-reading the developer guide and I think I understand a little better now. I’m not a developer unfortunately, so I’m very slow at this.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.274797077922077
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "0",
                    "time": "16/08/2020-15:58:49",
                    "content": "Migration from SCD is no longer available, the system was globally settled earlier in the year. Everyone’s CDP was liquidated at market price, and any excess collateral was made available to withdraw via migrate.makerdao.com. As far as I know this is still possible via that UI, but I’m not 100% sure. Probably best you come to the official chat if you want more details. People tend to be more knowledgable and available to help there. ",
                    "links": [
                        "https://chat.makerdao.com/channel/help"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7272727272727275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tirapon",
                    "index": "#11",
                    "likes": "0",
                    "time": "16/08/2020-16:59:54",
                    "content": "Thanks for the response, I’ve been really worried about this. I tried posting in the chat but wasn’t successful. I’ll try again in the chat, it was fairly quiet over there but I guess its because its the weekend… I was just panicking because its a fairly large amount to me. I’m hoping I can pay someone a consultation fee to talk me through it. I’m keen to learn more about the technical side of things. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.331632653061225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tirapon",
                    "index": "#12",
                    "likes": "0",
                    "time": "16/08/2020-17:37:46",
                    "content": "I’m willing to offer $1000 USD of ETH to anyone who can talk me through the process and help me recover the collateral. You can reach me at [email protected] ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#13",
                    "likes": "0",
                    "time": "16/08/2020-19:00:56",
                    "content": "Yeah, chat gets a little quiet over the weekend. I would expect there to be people there (during the week) who would help you for free. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.354166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#14",
                    "likes": "0",
                    "time": "17/08/2020-12:09:59",
                    "content": "Hello, you can read the step by step guide here Migration Portal: Redemption after SCD Shutdown (May 12th 2020) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#15",
                    "likes": "0",
                    "time": "17/08/2020-12:11:13",
                    "content": "Specifically look for Migration Portal Walk-Through: Redeeming a CDP ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tirapon",
                    "index": "#16",
                    "likes": "3",
                    "time": "17/08/2020-12:39:59",
                    "content": "Panic over! I’ve successfully redeemed my collateral. Massive thanks to the team for all of their help, you guys have been great. The problem turned out to exist between the chair and the keyboard. I am an idiot and I forgot to load my wallet with enough ETH to cover the transaction fees. Fortunately I received the full amount of ETH which I had originally put up as collateral, so my only loss has been the opportunity cost - I did not receive the extra ETH which I’d bought on margin, as this was liquidated to cover the loan and stability fees. Thank fuck for that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.697916666666667
                }
            ]
        }
    ]
}