{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/how-to-eventually-remove-dais-dependence-on-usdc-and-other-stablecoins/6875",
            "title": "How to eventually remove DAI's dependence on USDC and other stablecoins ",
            "index": 6875,
            "category": [
                "Governance"
            ],
            "tags": [
                "stablecoin",
                "pegstab-module",
                "psm-usdc-a"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#1",
                    "likes": "9",
                    "time": "06/03/2021-17:57:39",
                    "content": "I am a long time MKR holder but participating in the forum for the first time. Following a recent discussion on Reddit with @LongForWisdom I’d like to express some concern over DAI’s reliance on stablecoins to stay pegged and the long term vision for the PSM. Right now, DAI is super tight on the peg because of the PSM. This is great and the PSM achieved what it set out to do. But while I thought the PSM was a temporary measure, things appear to be going in a different direction with the latest increase of the debt ceiling exceeding the previous debt ceiling + USDC-A vault’s debt ceiling. If it fills up, it seems that the governance response will simply be to increase the PSM ceiling, much like we do for other vaults. While it’s not as bad as it was at one point, the significant amount of stablecoins used to establish DAI’s peg is something I find troubling. Meanwhile, we’re also increasing stability fees across the board although DAI is above $1. I believe there needs to be an effort to   Use the PSM as a last resort mechanism after interest rate based fixes cannot help. It doesn’t make sense to me to charge 5.5% to ETH-A vault owners and raise the USDC PSM ceiling because we expect demand for DAI to exceed supply. I am not sure I agree with the idea that leverage seekers are insensitive to the interest rate. During a bull market, the PSM should be emptying out, not filling up!   Have some long term plan to rely less on stablecoins. If this is the situation in a bull market, I can’t imagine how we will survive the next bear market except by loading up the PSM with huge amounts of USDC to keep DAI pegged.   I realize I am criticizing without providing solutions (apart from a recommendation to lower stability fees) but I hope some ideas can come out of this. Thank you for reading! ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-trilemma-peg-decentralization-dai-1-1-collateral-backing-usdc-discussion/9064/19",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-march-7th-2021/6935",
                        "https://forum.makerdao.com/t/maker-relay-ep-35/6932",
                        "https://forum.makerdao.com/t/maker-relay-ep-35-en-espanol/6949"
                    ],
                    "GPT-summary": "The author of the post is expressing concern over DAI's reliance on stablecoins to stay pegged and the long term vision for the PSM. The post explains the current situation and suggests that there needs to be a long term plan to rely less on stablecoins. The post also asks for ideas and feedback on the issue.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.263928571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#2",
                    "likes": "2",
                    "time": "06/03/2021-18:09:53",
                    "content": "There is solution such as RWA which is coming with 400M demand. There is also PSM using second market such compound or aave MIP32/35/36. The reality is, unless we diversify via the RWA during the crypto bull market the demand is higher than the supply and during the bear market it is the opposite. Using usdc flat it down and peg it nicely to the usd. But you are alright we need to find ways to use the usdc and decrease the dependency on it. Another problem which doesn’t help at least in short term, is makerdao as community try to fly by itself without the foundation. At least limited use of the foundation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.306929181929182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#3",
                    "likes": "2",
                    "time": "06/03/2021-18:28:12",
                    "content": "Agreed, we should at least be trying to lower SFs again to spur more DAI printing. I think that the situation now is a little different than last spring/summer when we had rates at 0% but weren’t printing enough DAI with ETH. I would at least like to experiment with dropping rates super low to beat everyone else’s rates by a healthy margin and make it impossible for people not to come to us to mint/borrow stablecoins. I understand the Foundation is now trying to decentralize into Core Units and we need the revenues for payroll but I don’t think this philosophy is a good long term strategy with many other protocols snapping at our feat. The market is becoming more and more crowded every day and we don’t want to lose more market share to these competitors. We’re in a position as the leader to still take control of this market and move our weight around to show who’s king. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.75109649122807
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#4",
                    "likes": "0",
                    "time": "06/03/2021-20:15:17",
                    "content": "You could always put up a Signal Request to mandate the rates group to consider lowering rates or do a one-off SR to lower ETH-A and see what kind of reaction you get. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#5",
                    "likes": "10",
                    "time": "06/03/2021-22:09:06",
                    "content": "    AstronautThis:  While it’s not as bad as it was at one point, the significant amount of stablecoins used to establish DAI’s peg is something I find troubling.   In nominal value yes, but that share of stablecoins in collateral backing DAI decreased. Also keep in mind that even if we had 0 stablecoins in collateral, we would still want to have 20%+ of DAI debt minting capacity available from USDC or any stablecoin in order to prevent DAI liquidity squeeze in crash events or in events of DAI demand surge. Which means we’ll always be exposed to stablecoins one way or another if you want to protect the peg in distressed market conditions or other short term demand and supply imbalances. Unless you diversify collateral to something less volatile (RWA being an example) or we find another solution in regards to peg management in distressed events.     AstronautThis:  It doesn’t make sense to me to charge 5.5% to ETH-A vault owners and raise the USDC PSM ceiling because we expect demand for DAI to exceed supply.   I hear this a lot, but let me try to highlight a bit different angle to this. Is community ok by charging close to 0% fees on ETH-A where you have a 1.3bn exposure growing mad and knowing losses can amount to tens of millions in Black Thursday scenario? And don’t forget to add other collaterals and potential losses. We made improvement with Surplus Buffer, but we are not there yet and very low fees wouldn’t help much. I however expect Liquidations 2.0 implementation will allow Maker to offer lower rates since both liquidations risks and risk premiums will be reduced. We are also implementing lower SF ETH-C vaults for rate sensitive users. I am generally more worried about losses on crypto collateral than USDC blowing in short term, but I totally get your concerns. But in general it always comes down to this trade-off: stable peg = more stablecoin backing, volatile peg = less stablecoin backing. Also one major misunderstanding about Maker that I am observing is that centralized collateral is always seen as a curse although in reality Maker (or better, quality of DAI) in my view was always about increasing DAI network effects and meanwhile implementing proper risk management. Here is how I look at it: more USDC means stable DAI and stable DAI means more usage and more usage leads to more minting and fees from other collateral. And this is great because Surplus Buffer and MKR value grow and help to hedge against counterparty risk exposure from adding centralized assets that again increase usability and so on. Finally this also eventually decreases reliance on stablecoins since demand and supply shocks are minor relative to total DAI supply at one point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.441936728395062
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#6",
                    "likes": "1",
                    "time": "07/03/2021-01:11:51",
                    "content": "I do not agree to lower SF. Now, the risk exposure of various mortgage tokens is increasing. We must increase SF to hedge against risks. RWA will help us resolve its reliance on stablecoins in the future. It is only a matter of time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#7",
                    "likes": "2",
                    "time": "07/03/2021-06:39:09",
                    "content": "Considering funding rate to long ETH is 0.1% per DAY (36.5 per year) on Binance, I also don’t think it makes sense to lower SF. We also saw back in DeFi summer last year, despite the bull run, Maker system couldn’t capitalize on it because it had to lower stability to meet with the demand. But now with PSM, the Maker system can capitalize on it while scaling the system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.916666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "0",
                    "time": "07/03/2021-15:33:09",
                    "content": "    AstronautThis:   During a bull market, the PSM should be emptying out, not filling up!    Empty. Why??? During a bull market where “euphoria” is the leading component that provides investment guidance (See BDP Yield Farm accumulating $3B in TVL within 24 hours–yessss–a protocol that’s going to eventually move to Solana) more USDC should be accumulated and not liquidated, IMO. If the Mkt reverses violently (hopefully not) we will be thankful to have USDC on the balance sheet. Also, if you look at the largest trading desks in DeFi, most settle in USDT and USDC. Why? Because it’s the same as settling in USD. It is the base layer. What to do. Just my 2 gwei ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#9",
                    "likes": "2",
                    "time": "07/03/2021-16:22:03",
                    "content": "Thanks for your reply. I see your point of view on this but some aspects still seem worth talking about.  But in general it always comes down to this trade-off: stable peg = more stablecoin backing, volatile peg = less stablecoin backing  Can I ask what is considered an acceptable deviation from the peg? 0.1%? 1%? This would be related, as you point out, to the stablecoin dependence. I always understood that DAI was meant to be a soft peg and that our users should not expect it to be as stable as, say, USDC. Is this still the community’s understanding or have expectations changed? In any case, it would be good to know what range is considered reasonable.  even if we had 0 stablecoins in collateral, we would still want to have 20%+ of DAI debt minting capacity available from USDC or any stablecoin in order to prevent DAI liquidity squeeze in crash events or in events of DAI demand surge  This is related to the previous question but again, are we trying to change DAI from a soft peg to an almost always hard peg? Moreover, can I ask where the 20% comes from? In the future, it seems that as DAI supply grows, the supply shocks are better absorbed and hence this stablecoin backing should decrease in percentage terms. Is there a roadmap for DAI supply vs percentage dependence on USDC and other stablecoins? Even if it doesn’t exist, do you think this might be worth having as a target? Also, the current PSM debt ceiling is 1B which is 40% of current DAI supply and even if we’re not using it all, the fact that the ceiling is that high seems excessive. 28% of DAI is now backed by USDC (if I have read daistats correctly) and that’s again well above 20%. I do see your side of this and a lot of it makes sense. But it seems that we are missing a clearer picture of the path out of stablecoin dependent DAI. It may all fix itself when we have enough diversified collateral but I fear that a conscious effort needs to also be made to prevent USDC and other stablecoins from becoming a crutch for DAI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.479907407407407
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#10",
                    "likes": "2",
                    "time": "07/03/2021-16:23:56",
                    "content": " Empty. Why??? During a bull market where “euphoria” is the leading component that provides investment guidance  During a bull, every user of ETH is gonna want leverage, which mints DAI and hence DAI supply should exceed demand. The fact that it is not doing so right now is worrying. In a bear, DAI demand will be much higher (as people sell crypto and move into stablecoins) and hence, DAI will go above peg and the PSM will fill up with USDC to correct that. ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-at-a-glance-mar-5-mar-11-2021/6977"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.544642857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#11",
                    "likes": "0",
                    "time": "07/03/2021-16:35:30",
                    "content": "Agree–IMO DAI is not seeing such demand/scaling because we have not made the push for horizontal scaling, unlike USDT and USDC. My hope is that on day we will push DAI adoption across other Layer 1s and 2s (this is happening)–but it is a difficult task, as the Core Teams have been short-handed/stacked with other initiatives. But also, a Layer 1 like NEAR has taken the initiative–unfortunately they too are overwhelmed. I guess time will tell. Patience. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.35
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#12",
                    "likes": "1",
                    "time": "07/03/2021-17:59:39",
                    "content": "In normal market, the supply would have easily overwhelmed demand but when there’s yield farming where even 100%+ APY is around, the demand will naturally be stronger. They are even insensitive to 3-4% premium because the yield is just so high ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.054166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#13",
                    "likes": "5",
                    "time": "23/05/2021-18:25:49",
                    "content": "It’s now gonna be a long hard road to start removing the USDC from the PSM. DAI is now 1/3 backed by USDC - and if this price action continues, that number is only going up. I wonder if the sentiment around decreasing rates has changed since the last time we discussed this? It will take a fair amount of nerve to long ETH now but rewarding those who do with low rates coupled with a tout of 0 might be what we need. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.50462962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#14",
                    "likes": "0",
                    "time": "23/08/2021-00:26:32",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}