{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/changes-to-our-implementation-of-sourcecred/6115",
            "title": "Changes to our Implementation of SourceCred ",
            "index": 6115,
            "category": [
                "Discontinued Categories",
                "Misc Discontinued"
            ],
            "tags": [
                "community",
                "sourcecred",
                "update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "12",
                    "time": "19/01/2021-14:23:46",
                    "content": "Hello everyone! This post is to document some changes being made to Maker’s implementation of SourceCred and provide the reasoning behind doing so. Please respond to this post or shoot me a PM if you have any questions, comments, or concerns!  Executive Summary Here are the key points covered by this post:  SourceCred has developed a new distribution calculation that they believe works more effectively. We agree, and will be adopting it. It weights rewards more heavily towards consistent and new contributors. It will result in some short-term volatility in payments. We believe it to be a net positive step, and it will be implemented 1 week from now, barring major pushback.   Grain Distribution Methods SourceCred distribution has two key parts. Calculating the Cred for each user, and determining how to distribute rewards (called Grain) based on that Cred. This post introduces a change to the second of those parts, how Grain is distributed based on Cred in MakerDAO. Important to note here that we have chosen DAI to be our Grain token for MakerDAO, but in general it can be any token, or even the promise of a token. Cred is generated for contributions to the MakerDAO forum. In general, this is based on user’s “liking” each other’s posts to give the algorithm an idea of how valuable each post is to the ecosystem. By also factoring things like replies, tagging users, and links back to other posts, the SourceCred algorithm is able to generate nodes and edges to distribute Cred (Graph Theory). The algorithm is based on Google’s Page Rank, with the idea that people with higher Cred scores liking a post will have more weight than a new user liking the same post. This brings us to Grain. Currently, 5,000 DAI is going out to our Forum contributors every week, but just like any other project using SourceCred, we have control over the mixture of how that distribution is segmented. Every week before distributions are sent out, the Cred scores are recalculated and the Grain is distributed based on our weighting of the following SourceCred policies (methods of valuing Cred):  Balanced (Lifetime) Distribution Balanced Distribution attempts to distribute Grain across the user pool, consistent with their overall Cred score. It does so by looking both at contributors’ lifetime Cred and Lifetime Grain scores. By doing so, the algorithm attempts to moderate who is overpaid and underpaid with regards to their total Grain received. The easiest way to visualize this is to think of a contributor who becomes more valuable over time vs one who begins to contribute less to the group. Because Grain is calculated weekly, there are a number of weeks where the first person is underpaid, and likewise a number of weeks where the second person is being overpaid. The Grain portion allocated to Balanced Distribution attempts to ensure contributors are paid relative to their current total value of contributions. By doing so, the Balanced Distribution corrects for imbalances in rewards compared to the current Cred scores.  Immediate (Last Week) Distribution Immediate Distribution is entirely based on the Cred earned on the previous week. Grain allocated to the Immediate Distribution is intended to reward the contributors who brought forth contributions since the last time Grain was allocated. By doing so the Grain from Immediate Distributions provides a constant incentive to contribute to a project.  Recent Distribution Recent Distribution is the newest policy for distributing Grain from SourceCred. The Recent Distribution is a generalization of the existing Immediate Distribution, adding a decay parameter that allows us to set the period over which ‘fast’ distributions are calculated. If the decay rate were set to 1, Recent Distributions would equal Immediate Distributions. Yet, with the introduction of a non-zero decay factor, Recent Distributions can take into account contributions from more than just the past week. The chart below shows how different decay factors would affect the timeline of how long Cred from recent contributions adds to Recent Distributions. Grain allocation to Recent Distribution compensates contributors for posts in the near past, without forcing a portion of a user’s Grain to go to zero when they stop posting for a week.  1434×1112 146 KB   Current Distribution As documented in the SourceCred Trial post (which can help explain these concepts further), MakerDAO implemented SourceCred when only Immediate and Balanced Distribution policies were in place. With the recommendations of the “default” SourceCred settings in mind, Maker decided to set Grain Distributions at 80/20 Balacned to Immediate Distributions. Seeing as we are currently distributing 5,000 DAI per week, this practically means that 4,000 DAI is currently being distributed to contributors based on the Balanced (Lifetime) Distribution and 1,000 DAI is distributed to the same members based on the Immediate (Last Week) Distribution.  New Distribution MakerDAO will be switching to a 25/75 Balanced to Recent Distribution, with the Recent Distribution having a decay factor of 0.4. As the above chart showcases, this change means that the Grain associated with Recent Distributions (3,750 DAI/week at current levels) will be paid out based on Cred generation from contributions within the last month or so (those in the six week range will still provide a small amount of Grain). This model leaves 1,250 DAI/week for the Balanced Distribution.  How This Affects Contributors As noted in many of the SourceCred Weekly Distribution Posts the aforementioned tweaks to the algorithm will cause a decent amount of volatility in individual contribitor payouts compared to last week’s distribution. Once implemented however, the parameters allow for a more predictable amount of DAI to be distributed to our contributors. Below is a snapshot of the DAI change by user for last week’s distribution, comparing the new parameters to the old ones:  Chart1600×941 124 KB  While this undoubtedly will result in smaller distributions for more senior members of the MakerDAO Forum who post less frequently, any new decay factor allowing contributions to “carry over” to multiple Grain distributions, contributors will notice a far less drastic change to their average weekly earning through SourceCred if they stop/slow down with posting for a short period of time. This allows for “vacations” from the Forum that keep expected payouts from SourceCred more predictable. The new policy change to SourceCred makes the algorithm more biased toward recent quality contributions, so users that contribute less (garner less likes, replies, and link-backs) will notice that the DAI they receive from SourceCred will be greatly reduced. The good news is that by sharing your valuable thoughts (maybe even moving some idea exchange from Rocket.Chat to the Forum), contributors will be more presently rewarded. This new Distribution Model will be implemented for the Grain Distribution one week following this post.  Rationale While we already have some data to suggest SourceCred is generating more consistent engagement on the forums, implementing this change will give us a further dataset to analyze and further determine what incentives are best promoting Governance participation. There are several motivating factors behind this change. Working with the SourceCred platform and our SourceCred Working Group, I believe making this change is the best course of action for the following reasons:  Other communities using SourceCred (1Hive and MetaGame) have already implemented this change and seem to be pleased with it  1Hive first moved to using Recent Cred on 2020/11/23 and are continuing to utilize the new policy MetaGame finalized their switch over to Recent Cred recently to strong community support   This change makes our implementation of SourceCred more “responsive” in that distributions will be weighted more toward recent posts and contributions. New users will, in particular, benefit from seeing their contributions hit the SourceCred algorithm much quicker. The recency preference in distribution is also attractive for consistent users of the forum, as the change incentivizes new and continued contributions to the platform.  There are undoubtedly some drawbacks to this change as well which I will present here:  More established members of the community will see their distributions drop if they do not continue posting in the forum Leaning on recency could cause community members to only show up when they need some DAI The change could encourage Sybil Attacks, as new contributions are more heavily incentivised  Finding the drawbacks to be outweighed by the benefits of the change and with most risks protected by the SourceCred system (you can check out @s_ben’s post in the SourceCred Funding MIP which documents how SourceCred held up during Sybil/Degen meme attacks at 1Hive last year), I am confident the new policy should represent an improvement to the MakerDAO SourceCred instance.  Final Thoughts These changes make a stronger incentive to participate on our Forum and will help usher in more helping hands to the many essential projects occurring simultaneously here at MakerDAO. I look forward to documenting the data we receive from making this switch and presenting it to the community at large. For a deeper dive into SourceCred, the SourceCred website is incredibly useful. Thank you for taking the time to read through this update and please feel free to voice all questions, comments, and concerns below! ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-sourcecred-trial/2551",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-jan-3rd-2021/5950",
                        "https://github.com/1Hive/pollen/commit/1694f1516851c4c164b9251e4c2c8221962bc20a",
                        "https://github.com/MetaFam/XP/pull/28/commits/aab5f3a7f3149aa25db79f9a53fea038b4e19cb8",
                        "https://en.wikipedia.org/wiki/Sybil_attack",
                        "https://forum.makerdao.com/t/mip13c3-sp6-sourcecred-funding/4545/9",
                        "https://sourcecred.io/",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-4/14770/10",
                        "https://forum.makerdao.com/t/informal-poll-increasing-the-sourcecred-payments/7489/55",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-feb-7th-2021/6469",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-jan-24th-2021-updated-payout-formula/6246",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-jan-17th-2021/6120"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.570124898249898
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "7",
                    "time": "19/01/2021-14:34:46",
                    "content": "One bit of helpful framing for thinking about Recent/Immediate Distribution vs Balanced Distribution comes from @LongForWisdom who pointed to the distribution between consistency and equity. If we were relying solely on Balanced Distributions, it would always be equitable since the payouts would be entirely based on keeping everyone’s rewards relative to their total amount of Cred earned. However, it would be terribly inconsistent as the algorithm would always be adjusting to changes that recent contributions would have little effect on. On the flip side, if we were solely reliant on Immediate or the new Recent Distributions, the payouts would always be consistent relative to how many “good posts” were recognized by the community in the last week. This would make a pretty clear line between posting and getting paid, but would leave out people who became more valuable to the community overtime, and overpay those already established members that made some recent contributions. This new policy adjustment seeks the best of both worlds, where we attempt to be more consistent with our payouts by relying heavily on recent contributions (but with a decay factor that allows members to take a break) while still distributing a strong amount of DAI on an equitable basis that can make up for periods of time when users are paid too much or two little relative to their Cred score. Hope this helps frame why this change was such a big deal internally and please do ask questions ang give your comments! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.617424242424242
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "3",
                    "time": "26/01/2021-17:10:07",
                    "content": "Join the community call happening now!! Seth and Kevin from Sourcecred will be joining us to give an update on the Maker Forum implementation as well as some future upgrades that are in the works! SourceCred is extremely cool, and has been used on the Maker Forum for months now. It’s an open-source tool that enables online communities to create a community-specific contribution scores, called Cred, which measures how much value every contributor has added to the project. The Maker Forum takes it a step further and maps Cred to  Dai payouts! Literally paying active forum participants for their contributions. Come join us!    Crowdcast    The MakerDAO Community Call: SourceCred Update and Changes to the Maker Forum... Register now for Maker's event on Crowdcast, scheduled to go live on Tuesday January 26, 2021 at 12:00 pm EST.      ",
                    "links": [
                        "https://www.crowdcast.io/e/the-makerdao-community-28"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.433080808080808
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Uncle",
                    "index": "#4",
                    "likes": "1",
                    "time": "26/01/2021-17:34:52",
                    "content": "As a new contributor I fully agree with these changes! (like, follow, subscribe!  ) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.065340909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "27/04/2021-23:34:54",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}