{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/incentivized-attention-makerdao-governance-prediction-markets/3789",
            "title": "Incentivized Attention: MakerDAO Governance Prediction Markets ",
            "index": 3789,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "mips"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Graeme_Barnes",
                    "index": "#1",
                    "likes": "11",
                    "time": "24/08/2020-13:07:24",
                    "content": "Hi MakerDAO community, My name is Graeme Barnes, I’m a product manager at Gnosis working on prediction markets. I’ve made a few markets about MakerDAO, and I’d like to share the theory behind what I’m doing, the results so far and where it could go. First off, why am I making prediction markets about MakerDAO governance? When running Sight.pm’s beta we created a market regarding MakerDAO’s stability fee. These markets could only be accessed by a small group of traders that passed the hellish KYC requirements. During a user interview with a beta trader, we learned that the trader would attend MKR governance calls to inform his decision to buy or sell an outcome regarding the stability fee. We ran a few other markets regarding governance, ETH2.0 deadlines or DEX volumes and what we noticed, and perhaps this is obvious in retrospect, is that traders would do serious research before making a trade. The insight here was that attention follows money. The hypothesis is that If I create a market, the question the market poses will receive attention relative to the amount one could profit from it. I.e More money to be potentially made equals more attention. The MakerDAO and soon other decentralized governance protocols markets are my way to test the hypothesis. What happened on the MakerDAO markets? I chose three MakerDAO markets about the MIP9 polls. I chose markets asking if the following collateral would be greenlit for onboarding:  → Houbi BTC - Omen  → Binance USD  - Omen  → Uniswap V2 ETH-DAI liquidity token - Omen I went with these three because of the discussion on the thread and frankly my interest in these tokens being used as collateral. Each market started on 50/50 odds funded with 1 000 DAI as liquidity. I set the 50/50 odds because I didn’t have an understanding of where the odds should be placed given the initial trading that had taken place. Post launch people have traded on each of these markets (despite hideous GAS fees). In all cases, the odd’s have moved from 50/50 to roughly 80/20 in favour of greenlighting the collateral. Of these the strongest market in favour of greenlighting is the Uniswap V2 Dai-ETH liquidity token which is sitting at 86.8% greenlit, or in other words, people have put at stake 1568 DAI that Uniswap V2 Dai-ETH liquidity token will be greenlit.  Screenshot 2020-08-24 at 15.04.301248×854 65.4 KB  What’s next? At the moment these Omen markets are quite simple, yes, no type markets. The attention they receive is one whereby the trader needs to figure out not “should” collateral be prioritized but “if”. The former is not so much about understanding the consequences of the poll but instead how MKR holders will vote. Personally, and where I’d like to take this eventually, is to ask markets that pose the question, “If UniswapV2 ETH-DAI liquidity token is onboarded as collateral, how much UniswapV2 ETH-DAI liquidity tokens will be used as collateral on a range from 1 000 to 1 000 000 within the first month of been live”. These conditional markets require traders’ attention to be focused on the consequence of a proposal being accepted. I believe that this information could be valuable to decentralized communities to aggregate beliefs about the consequences of proposals and hopefully lead to more informed and better governance decisions. In the meantime expect more basic markets but perhaps with more than 1000 DAI or perhaps MKR. If there is an upcoming proposal which you believe could benefit from attention from inside and outside the Maker community, lemme know, and I’ll do my best to get the market live and funded. ",
                    "links": [
                        "https://omen.eth.link/#/0x22fc4d228e05f043522b63b57d54f12a5d94d0ea",
                        "https://omen.eth.link/#/0xe0aabc3ab700623c5a47efcdadb61b009d46b135",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-107-thursday-august-27-16-00-utc/3754/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-09/3793"
                    ],
                    "GPT-summary": "The author, Graeme Barnes, a product manager at Gnosis, shares his theory behind creating prediction markets about MakerDAO governance. He explains that attention follows money and that creating markets will attract attention to the question posed in the market. He shares the results of the MakerDAO markets he created and his plans for more complex markets in the future. He also invites suggestions for upcoming proposals that could benefit from attention from inside and outside the Maker community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.451073232323233
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "2",
                    "time": "26/08/2020-12:43:22",
                    "content": "This is something that interests me a fair bit personally. Prediction markets have a great deal of potential in a wide range of areas. I’d encourage the community to weigh in on how useful you feel this would be. I’m somewhat surprised that these markets are seeing any trading at this stage. I do think the biggest challenge in aligning incentives around these successfully is in correctly wording the market to get the outcome you want. Prediction Markets could be quite useful to Maker, as either incentive mechanisms, prediction mechanisms or both. Thanks for taking the time to write this! I’d be interested to see some more general markets:  How much Dai will there be by <date>? How much Dai will the Maker Protocol make as income by <date>? How much MKR will be burned by <date>?  There are also lots of more specific markets that we could create. I could see it working as an incentive mechanism to resolve certain issues. Something like:  Will the Black Thursday Vault Compensation Plan be approved by <date>?  If any MKR Holder or entity or user hoping for compensation voted an amount of Dai on the ‘No’ side of this market, and publicised this, it would be a big incentive for people to buy the ‘Yes’ side and try to make it happen. Potentially the protocol itself could even do this as an executive vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.147186147186147
                },
                {
                    "author_link": "https://forum.makerdao.com/u/andy8052",
                    "index": "#3",
                    "likes": "6",
                    "time": "26/08/2020-13:12:23",
                    "content": "I love this idea and think that maker could benefit from taking it even further. I have played around in my free time with the idea of a maker governance futarchy. In my mind this would function as a smart contract on top of whatever governance maker is using at any given time. Those voters who choose to participate would be essentially betting a small amount of their MKR that executing an executive (or not executing) will result in a closer DAI peg to $1. These markets would have all of the required tools to exist purely on chain. Honestly the main thing holding me back from exploring this more is the legality of creating a betting market in the United States. Would love to help flesh out prediction markets in maker more though! Here is a rough draft of an MKR futarchy I worked on during an internal maker hackathon https://github.com/andy8052/mkr-futarchy ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.209449404761904
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "26/08/2020-14:08:38",
                    "content": "This sounds super interesting Andy. I’m wondering if there is any way to approximate it on Omen or Augur in the meantime though. If we don’t have to develop our own prediction markets then we could start using something like this a lot sooner. Omen markets denominated in MKR might work, but that does incentivise keeping MKR outside of the Chief. Perhaps Omen markets denominated in the Chief’s IOU tokens? I’m not sure how comfortable I’d personally be in participating in markets directly related to the Dai price. It seems to be largely driven by liquidity mining at the moment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6988095238095235
                },
                {
                    "author_link": "https://forum.makerdao.com/u/auryn",
                    "index": "#5",
                    "likes": "0",
                    "time": "26/08/2020-14:13:34",
                    "content": "@LongForWisdom what is the address of the Chief’s IOU tokens? We could possible add them to Omen, MKR was added today, I believe. And yeah, I totally agree that building on top of an existing framework would make more sense. The really cool thing with Omen is that it’s built on Gnosis’ conditional tokens framework, you can have the same markets show up in multiple interfaces. Perhaps it’s worthwhile testing with some markets on Omen and then looking to build a more purpose specific interface for Maker at a later date. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.068181818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/auryn",
                    "index": "#6",
                    "likes": "0",
                    "time": "26/08/2020-14:14:56",
                    "content": "This is really cool, @andy8052! Would love to chat with you about pushing this idea forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.34375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "0",
                    "time": "26/08/2020-14:24:06",
                    "content": "    auryn:  @LongForWisdom what is the address of the Chief’s IOU tokens?   Not sure. Perhaps one of the devs can comment. I think there would still be some barriers to entry. I think most voters use the VoteProxy contract which is what actually ends up holding the IOUs. It doesn’t have any sort of functionality that would allow it to interact with a prediction market, so we’d probably need a new contract to do it safely. It would work if you don’t use VoteProxy though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.886363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Graeme_Barnes",
                    "index": "#8",
                    "likes": "0",
                    "time": "26/08/2020-15:13:35",
                    "content": "This is awesome. When the conditional tokens framework was designed the developers at Gnosis created a futarchy demo. It’s a lil janky and the markets are closed, but it did show that a user could trade on an outcome on the condition of another outcome. https://conditionaltokensdemo.gnosis.io/#/ and the docs (just search anything with HG in the repo for all the various pieces)    GitHub    gnosis/hg-contracts-playground Playground to test out hg-contracts functionality for UI implementation - gnosis/hg-contracts-playground      ",
                    "links": [
                        "https://github.com/gnosis/hg-contracts-playground",
                        "https://github.com/gnosis/hg-contracts-playground"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#9",
                    "likes": "2",
                    "time": "26/08/2020-23:19:01",
                    "content": "Graeme Barnes was actually on the community call back in January. Some stuff might be outdated but I’m sure this call might be interesting to some of you       ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.6
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Graeme_Barnes",
                    "index": "#10",
                    "likes": "1",
                    "time": "27/08/2020-09:35:24",
                    "content": "Thanks for the feedback LFW, During the Sight beta one of the more popular markets asked if MCD would have 10 a supply of over 10 000 000 three days after launch. These deadline markets seem to do quite well and are genuinely interesting as there is often information asymmetry between those who want it to happen and those that have to implement it (i.e management pushes for an early deadline and executors of work know that it will take longer). The best example we have of this kind of market is the ETH 2.0 market and how its been used as a signalling tool from ETH core devs.   twitter.com    prestonvanloon.eth (preston_vanloon)  I just bought 32 ETH worth of YES shares for \"Will Ethereum 2.0 Phase 0 launch before 2021?\" prediction market on Omen.   🚀🚀Let's launch ETH2 🚀🚀  omen.eth.link/#/0x592af74865…   8:08 PM - 11 Jul 2020     510          69            As an outsider to the MakerDAO ecosystem it’s a little difficult to get a sense of the big milestones. Are there any up and coming roadmap items/product enhancements or something crucial to MakerDAO? A market on it would help crowdsource an estimate of it hitting its deadline ",
                    "links": [
                        "https://twitter.com/preston_vanloon/status/1282044049059266560",
                        "https://omen.eth.link/#/0x592af74865799e1ed509afef002a6eca26e1caa2",
                        "https://twitter.com/preston_vanloon/status/1282044049059266560"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.296875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "1",
                    "time": "27/08/2020-10:47:09",
                    "content": "Two semi-major milestones would be:  The liquidations redesign described here: A Liquidation System Redesign: A Pre-MIP Discussion  The replacement of DSChief, described here: Governance Chief Contract Redesign: A Pre-MIP Discussion   Potentially also the onboarding of Real World Assets, which is currently being pursued by Centrifuge (@spin) and @mrabino1 How easy or difficult is it to create these kind of of markets? Ideally we’d have someone from the community who was more knowledgable about upcoming events creating these. ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-chief-contract-redesign-a-pre-mip-discussion/3080"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Graeme_Barnes",
                    "index": "#12",
                    "likes": "1",
                    "time": "27/08/2020-11:07:29",
                    "content": "Super easy. Head over to https://omen.eth.link/ and tap on create market. I’d be more than happy to allocate liquidity to the market for trading  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Graeme_Barnes",
                    "index": "#13",
                    "likes": "0",
                    "time": "02/09/2020-11:55:36",
                    "content": "@LongForWisdom I’ve been looking into the Black Thursday Compensation threads and man, they are extensive and at times emotional. I was initially thinking of posting a forum thread to ask for suggestions around markets related to the plan. However, after reading the threads and seeing just how much work has gone into the proposal from @monet-supply and others, as well as some of the mudslinging that has gone on, I don’t feel comfortable creating and funding a market without community backing or consent. If you are open to trying something out, if yourself, @monet-supply or another community member who has been working on the plan, create a market on Omen, I’d be more than happy to fund it if it may assist or bring attention to the Black Thursday compensation plan.  What do you think? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.712121212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "2",
                    "time": "02/09/2020-12:02:36",
                    "content": "    Graeme_Barnes:  I don’t feel comfortable creating and funding a market without community backing or consent.   Probably a good call.     Graeme_Barnes:  If you are open to trying something out, if yourself, @monet-supply or another community member who has been working on the plan, create a market on Omen, I’d be more than happy to fund it if it may assist or bring attention to the Black Thursday compensation plan. What do you think?   I’ll leave this up to @monet-supply, as he’s heading up that group. Personally I’m not opposed, I’m not sure how much traction it will get though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.212962962962964
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Graeme_Barnes",
                    "index": "#15",
                    "likes": "1",
                    "time": "02/09/2020-12:40:13",
                    "content": "Thanks for your feedback @LongForWisdom, always appreciated. @monet-supply what do you say? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#16",
                    "likes": "2",
                    "time": "02/09/2020-18:58:42",
                    "content": "Maker depends on voters expressing a long-term, principled self interest by taking action they believe will increase the value of MKR. Prediction markets make me a little uncomfortable, because it could create exogenous financial rewards and misalign incentives. Example of the black mirror-esque future I’m envisioning: someone creates a prediction market on the outcome of a governance vote with a very low prospect of passing (e.g. increasing the base rate while DAI is above the $1 peg). They then post deep limit orders for “no increase in base rate” outside of the market implied probability. This essentially becomes a bounty that large MKR holders can collect by filling the prediction market order and voting for a rate increase. The prediction market creator could then cash out via derivatives on interest rates, leveraged long positions in DAI/USDC, etc. MKR voting is like an illiquid market. Listing derivatives of illiquid markets creates risk of market manipulation (moving the “spot market” eg vote results in order to profit from a move in the derivative market). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.270039682539682
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Graeme_Barnes",
                    "index": "#17",
                    "likes": "1",
                    "time": "04/09/2020-09:52:34",
                    "content": "Thanks for the feedback @monet-supply. Your concern is correct but is proportional to the amount of  liquidity avaliable on the prediction market. For example the markets on MIP 9 which were predicting the poll green-lighting collateral at roughly 80%. A selfish MKR holder could buy the No side of the market, vote No on the MIP poll with enough MKR  to change the outcome and profit about 3 000 DAI. That said, with the means to profit through other financial instruments, how much would a prediction market contribute to incentivising negative behaviour? With more liquidity on derivates products, the profit/bounty one could collect on a prediction market would be the cherry on the top, not the entire desert? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.170454545454546
                }
            ]
        }
    ]
}