{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-brand-pr-updates/15582",
            "title": "Maker Brand: PR Updates ",
            "index": 15582,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Corina",
                    "index": "#1",
                    "likes": "31",
                    "time": "03/06/2022-11:46:06",
                    "content": "Maker Media Presence Hi Maker community, I am Corina - contributor in Growth; and lately also focusing on developing the new Maker Brand strategy for branding, PR, and media exposure together with the Maker Brand team. We have been working on spreading the most essential Maker stories, news, implementations, and partnerships in the media for the past couple of months, as well as building an accurate narrative for Maker which will present the protocol’s strengths to the public and remind everyone how many cool things the people behind the Maker Protocol have been building together  On April 5, 2022, @MarianoDP  published a forum post to introduce the Maker Brand team - based on the initiative to strengthen the brand image of the Maker Protocol and the DAO by focussing efforts on Public Relations, Marketing, and Visual Identity - which is currently in the process of being incubated by the Growth CU. The Maker Brand PR efforts: Latest Updates One of the first initiatives the Maker Brand team started was working on the presence of the Maker Protocol in the media: via press releases, ads, interviews, and podcast appearances with Maker facilitators and contributors, etc. The team went to PR specialists to achieve better media coverage and hired two professional PR agencies: Wachsman and APCO. Within the last two months of work on the PR side, the most significant announcement was the DAI deployment on the Starknet bridge to increase DAI liquidity in the Starkware ecosystem. For this announcement, we have worked with BanklessDAO on the piece “MakerDAO’s paradigm-shifting bridging solution begins on Starknet” by Jake and Stake.  Starknet x Maker article on Bankless1920×1530 177 KB  In addition, a press release on the deployment was distributed, and the response from the media outlets has been very positive, having Maker mentioned in over 30 different media channels:   Decrypt - Ethereum’s MakerDAO to Launch on StarkNet, Promises 10x Lower Gas Costs   CoinDesk - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain   The Block - MakerDAO to integrate StarkNet to cut DAI transaction costs   CoinNews - MakerDAO to integrate StarkNet to cut DAI transaction costs   Yahoo Finance - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain   Markets Insider - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain   LatestCrytpoNews - MakerDAO deploys on layer-2 network StarkNet to enhance functions of DAI stablecoin   Bitcoin.com- Makerdao Plans to Integrate Ethereum L2 Solution Starknet to Lower DAI Transaction Costs   CryptoBriefing - MakerDAO’s DAI Heads to Ethereum Layer 2 StarkNet   Investing.com - MakerDAO deploys on layer-2 network StarkNet to enhance functions of DAI stablecoin   CoinTelegraph Espanol - MakerDAO se implementa en la red de capa 2 StarkNet para mejorar las funciones de la moneda estable DAI   BitcoinEthereumNews - Makerdao Plans to Integrate Ethereum L2 Solution Starknet to Lower DAI Transaction Costs – Technology Bitcoin News   Technical Ripon - MakerDAO Deploys StarkNet on Layer-2 Network to Enhance DAI Stablecoin Features   InvestoSignals - MakerDAO deploys on layer-2 network StarkNet to enhance functions of DAI stablecoin   Coinolik - MakerDAO, İşlem Maliyetlerini Azaltmak İçin StarkNet’i Entegre Edecek   BusinessFast - Makerdao Plans to Integrate Ethereum L2 Solution Starknet to Lower DAI Transaction Costs   Coinphony - DAI di MakerDAO si dirige verso Ethereum Layer 2 StarkNet   LatestCrytpoNews - DeFi OG Protocol MakerDAO Announces April 28 StarkNet Integration For Cheaper DAI Transactions   Yahoo Finanzas - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain   Yahoo Finaças - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain   The Defiant - MakerDAO Steps Up Multichain Strategy With StarkNet Rollout   Coindesk - Market Wrap: Bitcoin Fades From $42K, Alts Still Ahead as ApeCoin Pumps   Coindesk | The Hash - MakerDAO Moves Toward Multi-Chain With StarkNet Bridge   CoinTelegraph Brazil - MakerDAO implanta na rede de camada 2 StarkNet para aprimorar as funções da stablecoin DAI   Blockchain Reporter - MakerDAO To Integrate Ethereum L2 Solution Starknet   Coin68 - MakerDAO integrates StarkNet to cut DAI transaction fees, ambition to go multichain   Micky.com - Ethereum’s MakerDAO to deploy on StarkNet, guarantees 10x lower fees   BlackCryptoNews - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain   BlackCryptoNews - ETHEREUMMakerDAO deploys on layer-2 network StarkNet to enhance functions of DAI stablecoin   Investing.com Turkey - Kripto para sektöründe günün öne çıkan haberleri   AIThority - MakerDAO Accelerates Multichain Strategy with StarkNet Integration   Portal Do Bitcoin - Integração do MakerDAO a camada do Ethereum promete taxas dez vezes menores   Crypto Noticias - Podrás usar DAI con menos comisiones en Ethereum gracias a esta integración de MakerDAO   Ihodl.com - MakerDAO Integrates StarkNet’s L2 Solution   Addressing the role of Maker Protocol in the DeFi ecosystem In the light of recent events in DeFi, several media representatives saw the need to do an extensive analysis of the stablecoin market. With the Terra/Luna crash and the increased public attention to the stablecoin market (quite a natural outcome), Maker was approached by several journalists and media channels to discuss the future of DeFi and the role of Maker in shaping that future Thanks to our PR help, we were offered a speaking opportunity on the stablecoin panel at Permisionless Miami, where Sam MacPherson participated. Many media outlets then have covered the stablecoin story with input from MakerDAO via quotes and interviews, some including parts of Sam’s speech at Permissionless.  Yahoo Finance: LUNA Ghost haunts Permissionless1902×822 136 KB   The media appearances were:   Coindesk: ‘Stable in Name Only’: Stablecoin Issuers Speak Out as UST Craters   Yahoo! Finance: ‘Stable in Name Only’: Stablecoin Issuers Speak Out as UST Craters   Yahoo! Finance Hong Kong: ‘Stable in Name Only’: Stablecoin Issuers Speak Out as UST Craters   Nasdaq: ‘Stable in Name Only’: Stablecoin Issuers Speak Out as UST Craters   TIME - The Real Reasons Behind the Crypto Crash and What We Can Learn from Terra’s Fall   Yahoo! Finance - The Real Reasons Behind the Crypto Crash and What We Can Learn from Terra’s Fall   NewsDeal - What Terra’s Crash Means For Crypto and Beyond   Globe World News Echo - What We Can Learn From Terra’s Fall, And What’s Next For Crypto   Bloomberg - DAI Is King Of Decentralized Stablecoins After Terra Collapse   As we are currently working on the overall messaging and narrative of Maker and how we want to present it to the world, we decided to analyze the current situation by having a Brand Analysis conducted by one of our PR agencies, Wachsman; which you can see here. This comprehensive list of Maker mentions in the media is combined with sentiment analysis for most articles, which helped us understand the overall sentiment in the media about Maker and how we can use that to determine our following KPIs as the Maker Brand team. We got a good overview of how Maker is perceived in the case of which it had almost no marketing initiatives whatsoever for at least 9 months. This helped us incorporate these stats to build realistic expectations of our marketing and PR efforts.  Brand Analysis MakerDAO1240×1032 91.9 KB   Broader Marketing and Advertising In the absence of an established Marketing CU, Maker also didn’t have any direct advertising in a long time. As Bankless fans, we found the Bankless podcast to be the perfect place to try direct advertising, as their audience fits Maker perfectly. Hence, in April 2022, we launched the first Maker Ad on the Bankless Youtube/Podcast, which was quite positively received by the community.   Bankless Ad MakerDAO1154×804 100 KB   Bottom Line Overall, our first marketing and PR initiatives have been quite successful in terms of media reach and overall received positive feedback from community members. Besides the statistics and key metrics that are an obvious indicator of the reach and results of these campaigns, we have noticed an organic growth on both the MakerDAO official and the Maker Growth Twitter accounts. One of the exciting things we noticed was the increase in the Maker-centered posts on Twitter made by the web3 community that we did not sponsor or interact with in any way. It shows that the DeFi space is starting to recognize Maker as a brand and learn about its latest implementations and deals more and more, which is the best performance indicator we can ask for   Screenshot Twitter Thread on Maker1182×652 77.2 KB   We are continuously working on defining the best practices by doing market analysis, brand analysis, consulting with top-tier PR specialists in the industry, and trying out different service providers (for creating a visual identity, for example) to find the best fit for Maker. There is also a set of OKR and key metrics currently in the works for us to share with the community. Many more amazing things are coming, and we are excited to share them with you! Keen to see your thoughts on the above and am open to suggestions and ideas on what we can improve or focus on more in the future in terms of Maker Brand. ",
                    "links": [
                        "https://wachsman.com/",
                        "https://apcoworldwide.com/",
                        "https://medium.com/bankless-dao/makerdaos-paradigm-bending-bridging-solution-1d77ba11d688",
                        "https://decrypt.co/98252/ethereum-makerdao-launch-starknet-10x-lower-gas-costs",
                        "https://www.coindesk.com/tech/2022/04/20/ethereum-defi-staple-makerdao-adds-starknet-bridge-in-first-step-toward-multi-chain/",
                        "https://www.theblockcrypto.com/post/142641/makerdao-starknet-integration-ethereum-layer-2",
                        "https://thecoin.news/articles/makerdao-integrate-starknet-cut-dai-transaction-costs-1650450861805",
                        "https://fr.finance.yahoo.com/news/ethereum-defi-staple-makerdao-adds-103000478.html",
                        "https://markets.businessinsider.com/news/currencies/ethereum-defi-staple-makerdao-adds-starknet-bridge-in-first-step-toward-multi-chain-1031367427",
                        "https://latestcrypto.news/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin/",
                        "http://Bitcoin.com",
                        "https://news.bitcoin.com/makerdao-plans-to-integrate-ethereum-l2-solution-starknet-to-lower-dai-transaction-costs/",
                        "https://cryptobriefing.com/makerdaos-dai-heads-to-ethereum-layer-2-starknet/",
                        "http://Investing.com",
                        "https://www.investing.com/news/cryptocurrency-news/makerdao-deploys-on-layer2-network-starknet-to-enhance-functions-of-dai-stablecoin-2806947",
                        "https://es.cointelegraph.com/news/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin",
                        "https://bitcoinethereumnews.com/bitcoin/makerdao-plans-to-integrate-ethereum-l2-solution-starknet-to-lower-dai-transaction-costs-technology-bitcoin-news/",
                        "https://www.technicalripon.com/makerdao-deploys-starknet-on-layer-2-network-to-enhance-dai-stablecoin-features/",
                        "https://investosignals.com/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin-2/",
                        "https://www.coinkolik.com/makerdao-dai-islem-maliyetlerini-azaltmak-icin-starkneti-entegre-edecek/",
                        "https://www.businessfast.co.uk/makerdao-plans-to-integrate-ethereum-l2-solution-starknet-to-lower-dai-transaction-costs/",
                        "https://coinphony.com/it/dai-di-makerdao-si-dirige-verso-ethereum-layer-2-starknet-32757/",
                        "https://latestcrypto.news/defi-og-protocol-makerdao-announces-april-28-starknet-integration-for-cheaper-dai-transactions/",
                        "https://es.finance.yahoo.com/news/ethereum-defi-staple-makerdao-adds-103000478.html",
                        "https://br.financas.yahoo.com/news/ethereum-defi-staple-makerdao-adds-103000478.html",
                        "https://thedefiant.io/makerdao-l2-starknet/",
                        "https://www.coindesk.com/markets/2022/04/20/market-wrap-bitcoin-fades-from-42k-alts-still-ahead-as-apecoin-pumps/",
                        "https://www.coindesk.com/video/the-hash-on-cdtv-clips/makerdao-moves-toward-multi-chain-with-starknet-bridge/",
                        "https://cointelegraph.com.br/news/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin",
                        "https://blockchainreporter.net/makerdao-to-integrate-ethereum-l2-solution-starknet/",
                        "https://coin68.com/makerdao-tich-hop-starknet-de-cat-giam-phi-giao-dich-dai/",
                        "http://Micky.com",
                        "https://micky.com.au/ethereums-makerdao-to-deploy-on-starknet-guarantees-10x-lower-fees/",
                        "https://blackcryptonews.com/2022/04/20/ethereum-defi-staple-makerdao-adds-starknet-bridge-in-first-step-toward-multi-chain/",
                        "https://blackcryptonews.com/2022/04/20/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin/",
                        "http://Investing.com",
                        "https://tr.investing.com/news/cryptocurrency-news/kripto-para-sektorunde-gunun-one-ckan-haberleri-2293887",
                        "https://aithority.com/technology/blockchain/makerdao-accelerates-multichain-strategy-with-starknet-integration/",
                        "https://portaldobitcoin.uol.com.br/integracao-do-makerdao-a-camada-do-ethereum-promete-taxas-dez-vezes-menores/",
                        "https://www.criptonoticias.com/tecnologia/podras-usar-dai-menos-comisiones-ethereum-gracias-integracion-makerdao/",
                        "http://Ihodl.com",
                        "https://es.ihodl.com/technologies/2022-04-21/makerdao-integra-solucion-l2-starknet/",
                        "https://www.coindesk.com/business/2022/05/13/stable-in-name-only-stablecoin-issuers-speak-out-as-ust-craters/",
                        "https://finance.yahoo.com/news/stable-name-only-stablecoin-issuers-190018918.html",
                        "https://hk.finance.yahoo.com/news/stable-name-only-stablecoin-issuers-190018918.html",
                        "https://www.nasdaq.com/articles/stable-in-name-only%3A-stablecoin-issuers-speak-out-as-ust-craters",
                        "https://time.com/6177567/terra-ust-crash-crypto/",
                        "https://news.yahoo.com/real-reasons-behind-crypto-crash-223934303.html",
                        "https://newsdeal.in/what-terras-crash-means-for-crypto-and-beyond/",
                        "https://globeecho.com/news/north-america/united-states/what-we-can-learn-from-terras-fall-and-whats-next-for-crypto/",
                        "https://www.bloomberg.com/news/articles/2022-05-17/-king-of-decentralized-stablecoins-surges-after-terra-collapse",
                        "https://docs.google.com/spreadsheets/d/15_s6IsdecgcZPrzC7TOZwojCTsKRXMyDddJYBItnnTU/edit?usp=drive_web&ouid=109682565970327134123",
                        "https://www.youtube.com/clip/UgkxbIxidmt2gNnc715nxT4DlWpSWCfzq2p_",
                        "https://forum.makerdao.com/t/mip40c3-sp70-modify-growth-core-unit-budget-gro-001/15102/16",
                        "https://forum.makerdao.com/t/maker-brand-update-june-july-2022/16858",
                        "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2022-08-23-makerdao-linkedin-page/17401",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-may-2022/15932",
                        "https://forum.makerdao.com/t/maker-brand-team-monthly-update-may-2022/15980",
                        "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2022-08-23-makerdao-com/17400",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-mayo-del-2022/16043",
                        "https://forum.makerdao.com/t/growth-cu-monthly-update-may-2022/15804",
                        "https://forum.makerdao.com/t/activo-intangible-acordado-modificacion-de-la-gestion-2022-08-23-makerdao-com-traduccion/17449"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.945065995001562
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#2",
                    "likes": "12",
                    "time": "03/06/2022-11:53:00",
                    "content": "It is time to wake up. Now. Let´s make some noise  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#3",
                    "likes": "5",
                    "time": "03/06/2022-12:05:56",
                    "content": "Thanks for this awesome update @Corina. The StarkNet marketing effort was particularly noticeable - pieces about Maker’s StarkNet bridge were absolutely everywhere. I also agree about the broader, organic recognition of Maker over the last month (courtesy of Terra’s reminder as to the virtues of a safety-first protocol). Our paid and earned media seem to be dovetailing nicely which is just great to see. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1190476190476195
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "6",
                    "time": "03/06/2022-18:01:42",
                    "content": "This updated is nicely done, and needed, thank you–good to see Maker on Yahoo Finance and others. I’ve been meaning to ask since the Branding was introduced, have you also consider other Crypto(only) native Marketing companies… like HypePartners and/or the new Growth Marketing DAO like Celium? Not sure if they’re the best of the best–but they’ve been gaining traction. Also, if you ever need someone to shill MKR via CT   check out CRE8RDAO ",
                    "links": [
                        "https://twitter.com/MyceliumGrowth",
                        "https://twitter.com/CRE8RDAO"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.361363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#5",
                    "likes": "5",
                    "time": "03/06/2022-20:52:03",
                    "content": "Fantastic update @Corina glad to see more data come through as you, and team, rebuild the efforts to get Maker out in the narrative space again.     Corina:  focus on more in the future   The only thing I can constructively add, I’m sure this is already there somewhere, is to not let PR spend be only about “exposure.” Def have seen quite a few PR firms just syndicate publishing, overcharge, and call it a day. FWIW, I brought this up on an office hours but I hope to see the brand efforts really focus on conversions. There are only three things that help growth: word of mouth, referral, and SEO. Glad to see 1 & 3 coming out of the gates strong, can’t wait to see the next pieces of data like \"campaign X resulted in Y number of vaults that retained for Z months. \"  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.190476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "7",
                    "time": "05/06/2022-18:11:33",
                    "content": "Here’s an interesting Branding proposal comparison from the other side of the planet (Cosmos Hub) by the current marketing team, “OMM” (Osmosis Ministry of Marketing) for Osmosis (the Leading Dapp in the Cosmos Hub): Conference attendance is an expensive endeavor. Currently, with the inclusion of quality merchandise, attendees, speaking fees, sponsorships, booth artwork, etc - these events can run upwards of $100,000 each. With one large event per month, advertising costs, and payroll, the OMM could potentially be spending up to $150,000 a month. As this is a 6 month proposal, this would bring a linear maximum projected spend to around $900,000. @Recognized-Delegates  because Branding ain’t easy, but it sure is expensive if you want to stay relevant… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.261309523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#7",
                    "likes": "5",
                    "time": "10/06/2022-19:04:33",
                    "content": "On the June 8 call of the Decentralized Open Voters Committee someone told @rune  that it’s pretty curious how everything that happens in Maker doesn’t have such a strong repercussion outside the community. He was saying that for the state of not only the cryptocurrency market but the world, what Maker has been achieving is impressive. If people outside knew everything that is going on in the Protocol, everything that CUs are working on, and all the innovation that is coming, they would be attracted to Maker simply because they would want to know what is happening here. I don’t remember who commented on that (I think it was a recognized delegate). The thing is, it’s something I’ve also thought about since I first learned about Maker; the level of innovation, creativity, proposals, and solutions being developed here are really impressive; I think a lot of people would be attracted to Maker simply because they would want to know how we’re making it all work. What you have been doing is great, guys congratulations. I think this bear market generated some junctures, such as the collapse of several stables, that helped Maker position itself even better with the public eye; people know that DAI implies confidence. The Growth team, the Brand team and @MarianoDP  have done it very well. Finally, the doors are open in the Ambassador Program for any future collaboration; our Twitter account  (in Spanish) has been growing quite well, and we also have some communities on telegram. ",
                    "links": [
                        "https://twitter.com/MakerDAO_Lat"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.923611111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#8",
                    "likes": "3",
                    "time": "10/06/2022-19:50:34",
                    "content": "Thanks Jose for your work on the Latam communities, it is impressive what’s  you have been doing! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#9",
                    "likes": "0",
                    "time": "19/06/2022-12:14:24",
                    "content": "    twblack88:  word of mouth, referral, and SEO   hear hear ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#10",
                    "likes": "2",
                    "time": "19/06/2022-15:06:08",
                    "content": "    MarianoDP:  It is time to wake up. Now. Let´s make some noise   Even more than noise, make a rumble (of information) and add a little rhythm…  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.78125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#11",
                    "likes": "3",
                    "time": "20/06/2022-02:25:08",
                    "content": "How can I join the Latam telegram? Would love to be participate ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#12",
                    "likes": "7",
                    "time": "20/06/2022-03:22:16",
                    "content": "Hi @One_Pastrami These are the MakerDAO´s LATAM communities:  Twitter Account Telegram Group  You are welcome to join us in the Telegram group! ",
                    "links": [
                        "https://t.me/makerdaolatam"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Corina",
                    "index": "#13",
                    "likes": "3",
                    "time": "21/06/2022-20:50:40",
                    "content": "    flipflopflapdelegate:  I’ve been meaning to ask since the Branding was introduced, have you also consider other Crypto(only) native Marketing companies… like HypePartners and/or the new Growth Marketing DAO like Celium ? Not sure if they’re the best of the best–but they’ve been gaining traction.   Thanks for the suggestions, @flipflopflapdelegate ! Right now we are focusing our efforts on PR and Branding specifically as this is the type of activities Maker has lacked most in the past, while marketing initiatives were still ongoing practices within the Growth team (e.g. co-marketing with partners, Twitter activities, Hackathon sponsorships, etc.) Nonetheless, we are still navigating through the space to find the best ways to position Maker - and this involves experimenting and exploring all kinds of different tasks and practices - including Ads, Social Media Marketing, Brand Analysis, PR, Twitter Spaces, Opinion/Educational Articles, etc. This is a crucial process leading us to experiment, analyze, learn and find the things that work best for Maker in both the short and long term. However, I believe it could be a good idea to consult and hear external opinions from the Marketing companies you have mentioned (or others in the space) to find those solutions faster   We will certainly discuss our options with the team!     twblack88:  There are only three things that help growth: word of mouth, referral, and SEO. Glad to see 1 & 3 coming out of the gates strong, can’t wait to see the next pieces of data like \"campaign X resulted in Y number of vaults that retained for Z months. \"    Thanks @twblack88 . It is rather tricky to measure the impact of PR on the number of new vaults (there is no direct Call-To-Action). At the moment, I believe we have a higher chance of pulling such numbers from a direct campaign with UIs that grant users access to the Maker Protocol. We are actually working on some marketing campaigns with them so we are also testing that out!   ",
                    "links": [
                        "https://twitter.com/MyceliumGrowth"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.04620092551127
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ClausClowes",
                    "index": "#14",
                    "likes": "1",
                    "time": "21/06/2022-21:14:50",
                    "content": "    flipflopflapdelegate:  the new Growth Marketing DAO like Celium   This group has been almost completely inactive since January, I checked around their Discord. Just in case anyone was looking into new marketing groups.  ",
                    "links": [
                        "https://forum.makerdao.com/t/growth-cu-monthly-update-june-2022/16556"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.621212121212121
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#15",
                    "likes": "0",
                    "time": "19/09/2022-21:15:25",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}