{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/education-partnership-proposal-with-mass-effect/15715",
            "title": "Education Partnership Proposal with Mass Effect ",
            "index": 15715,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ManuelMaccou",
                    "index": "#1",
                    "likes": "3",
                    "time": "09/06/2022-23:04:25",
                    "content": " Summary I’m building a knowledge exchange protocol called Mass Effect that gives equal access to information and knowledge. It connects learners to subject matter experts. Most importantly, Mass Effect incentivizes a cyclical pattern of learning → teaching → learning allowing for the exponential growth of knowledge transference. Phase 1 of Mass Effect will build the community of educators and learners. I’ll be coordinating live knowledge sessions with community nominated subject matter experts. I’m reaching out to the top Web3 and crypto organizations, including MakerDAO, who can nominate subject matter experts to lead these lectures and hands-on, interactive sessions. MakerDAO will be recognized as an early supporter of a high-impact project. Subject matter experts will be invited to the Mass Effect platform at a higher credential level with more perks once the platform is finished. I’m unable to create polls in this forum so I’ll judge support based on comments. You can learn more about the initiative and roadmap below. Link to Gitcoin Grants page  Background I’m frustrated with the one-way nature of online education. When an educator teaches a student something new, the transfer of knowledge stops at the student. This transaction of knowledge is fine for the educator and student involved, but when you shift your perspective to all of humanity, we are missing out on an important regenerative opportunity. Think of transferring knowledge as transferring heat, light, or other forms of energy. When energy moves from one body to another, it doesn’t just stop. It’s continuously moving through everything in its environment. Knowledge can and should be treated the same way. What happens when we incentivize the spread of knowledge wide to a larger, more diverse population? When more people hold the necessary knowledge, more problems get solved, and humanity thrives. Mass Effect will make information accessible to those who may not have the financial means. Because of the internal economy, coordination, and incentive structures tokens enable, we can make sure knowledge is attainable regardless of your status or situation. Recognizing this new technology for what it could do, the need to build Mass Effect in this environment was obvious. I dove head first into crypto, joined BanklessDAO full-time, collaborated with many others, and started soaking up as much as I could. It’s 8 months later and I still have A LOT to learn, but I understand enough to get started.  Specification My ask to MakerDAO, if you all believe in this mission, is for you to nominate people in this community who are subject matter experts in any field related to crypto. It could be trading, regulations, governance, tokenomics, anything. You can also self nominate, but it’s important that the community recognizes you as competent on that subject. The knowledge that is shared MUST be accurate, factual, unopinionated, and unbiased. See below for an explanation of the nomination process. Those who accept the nomination will be invited to lead paid workshops and seminars. The majority of these sessions will be on Twitter spaces. However, hands-on, interactive workshops will be done on Zoom, Google Meet, or a similar platform. The sessions are free to attend, but instructors will be paid at a rate that is TBD. Finally, those who accept the nomination and successfully complete a live workshop will be invited to join Mass Effect with “Specialist” level credentials and privileges when the platform is built.  Impact To You and MakerDAO If there is community support for Mass Effect and the mission it serves, MakerDAO will be recognized as an early supporter. You may be consulted during the planning and product development phases of Mass Effect. Most importantly, you will be helping to build a high impact, regenerative, educational system that makes knowledge highly accessible. There is no financial commitment from the community as part of this ask. Just time and expertise. Finally, those who accept the nomination and successfully complete a live workshop will be invited to join Mass Effect with “Specialist” level credentials and privileges when the platform is built. Details of the Specialist role can be found in the docs below. Mass Effect Docs  Nomination Process This part of the process is important. Everyone attending the live workshops and lectures must trust the educator is qualified. If your community is already using a credentialing system, we can utilize that. Otherwise, we can use the process described below. The entire process is done anonymously to avoid social backlash and ensure honesty. To nominate a fellow community member, fill out the form below. You can also self-nominate. Everyone who is nominated will be contacted to accept or decline. Nominations will be open for 1 week. After the nomination period, there will be a second forum post with a poll where the community can vote whether or not they believe that person has shown sufficient knowledge on that subject. This part is also anonymous. You’re welcome to share this vote with your network on Twitter, other Discord servers, etc. They may have to create an account on the forum platform you use to vote if they don’t already have one. Those with the most votes after 1 week will be invited to lead a paid knowledge transfer session. Nomination form  About Me My name is Manuel Maccou. My background is in product management where I worked for 6 years, but my passion is creating opportunities for others. There is no better way to create opportunities than provide access to information. My first dive into the world of crypto was 8 months ago when I joined BanklessDAO. Mass Effect is the reason I entered this space. I recognized that the opportunities, social coordination, and economic structures that crypto enables were key to the success of Mass Effect. But I didn’t know how it worked. So I came to learn. That need to learn mixed with my passion for creating opportunities lead me to the education guild where I lead the creation of educational materials for 1 season. I’m currently a member of a small elected team at BanklessDAO called the GSE (Governance Solutions Engineers) tasked with identifying and proposing action for the biggest threats and opportunities in the DAO. Discord: ManuelMaccou🏴#6974 Twitter ",
                    "links": [
                        "https://docs.thisismasseffect.com/introduction/what-is-mass-effect",
                        "https://forms.gle/ztqPNUvxPzMBW62b9",
                        "https://twitter.com/ManuelMaccou",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-09-15-de-junio-de-2022/15954",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-09-15-2022/15843"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.694126449682005
                }
            ]
        }
    ]
}