{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mkr-token-decentralization-views/16617",
            "title": "MKR Token Decentralization Views ",
            "index": 16617,
            "category": [
                "Core Units",
                "Strategic Finance"
            ],
            "tags": [
                "sf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#1",
                    "likes": "21",
                    "time": "14/07/2022-21:17:56",
                    "content": " MKR Token Decentralization Views Commentary on data as of July 14, 2022 (embedded views will auto refresh with updated data). All views exclude Maker-owned addresses that hold MKR. Addresses known to be owned by a single entity are lumped together. Unless otherwise specified, views only include addresses/entities with at least 1 MKR token. One aspect of decentralization in the DAO is how decentralized the MKR token is, as it represents governance power. For this reason, we put together some metrics to show the community how decentralized the MKR token is and how that has changed over time. We can potentially use these or similar metrics to track MKR token decentralization going forward. Here is a simple view of how many MKR holders there are, by bucketed size of holdings:  . Similarly, here is a view of the total amount of MKR tokens in each of these buckets:  . One measure of decentralization is how many effective voters there can be. For this, we can track the number of MKR holders with at least 1 token, as we assume less than that is not worth the gas to vote. As shown below, this number has decreased since April 2021 but is a longer-term overall uptrend:  . Similarly, it is important to track the voting power of the single largest holder, which seems to be steadily declining:  . It takes more than a single holder to dominate a vote though. In the most active vote in Maker history, the winning side had roughly 20% of available MKR tokens voting on the winning side. Thus, one can reasonably conclude that a coalition that comprises 20% of the vote can dominate any vote. Here is the amount of top wallets/entities it would take to make up 20%, through time:  As you can see above, at the current moment, all it takes is 3 entities to dominate votes. Similarly, here is the amount of top wallets/entities it would take to comprise 50% of available MKR holdings:  Fortunately, this metric has been in an uptrend since December 2020. Ideally, we want to see delegation going up to represent more active governance by the many. Here is the total number of MKR delegated through time, which has been increasing significantly lately:  Here is the same view represented as the percentage of the total available MKR tokens:  . Similarly, the number of delegators has been increasing, a sign of increased decentralization:  . Finally, following is the relative difference between the mean and median through time. This is a proxy measure of the skew of the distribution; a higher relative difference means more right-skew and more inequality.  This has increased over time, suggesting that distribution is increasingly right-skewed over time, with increasing inequality. In other words, MKR has been concentrating more in wallets with greater than the median amount of tokens (in the upper half) than in wallets with less than the median. Another measure of inequality of a distribution, typically used in income distributions, is the Gini Coefficient. Complete inequality is represented as a score of 100, whereas complete equality is represented as a score of 0. The current gini coefficient is 96.74, which represents a high level of inequality.  We will soon have views of the Gini Coefficient through time to see how this is trending. . Conclusion Decentralization is one of the core principles of MakerDAO. One of the most important aspects of decentralization for the DAO to track and understand is how decentralized the MKR token is, as it represents governance power. These metrics aim to assist in this dimension. These metrics can be found in this dashboard or just above in this post. Here is a summary of these metrics as they stand now:  Many metrics, especially those revolving around delegation, point to increasing levels of decentralization It only takes the largest 3 entities to dominate any vote, which is certainly a decentralization concern Since April 2021, the effective number of MKR holders has been slightly declining, suggesting slightly decreasing decentralization  . Call to Action    Would it be worthwhile to regularly report these MKR decentralization metrics? If so, at what cadence?  Not worthwhile Quarterly Monthly     0 voters      Big shoutout to @prose11 and @hernandoagf for enabling dune embeds on the forum! ",
                    "links": [
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/32",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-10-traduccion/16689",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-10/16685",
                        "https://forum.makerdao.com/t/governance-and-risk-200-thursday-july-21-at-17-00-utc/16736/3",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-14-20-de-julio-del-2022/16911",
                        "https://forum.makerdao.com/t/reporting-for-strategic-finance-core-unit-may-june-and-july-2022/17037",
                        "https://forum.makerdao.com/t/governance-and-risk-200-thursday-july-21-at-17-00-utc/16736",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/6"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.677724358974359
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "3",
                    "time": "14/07/2022-21:32:34",
                    "content": "It’s interesting but I am not sure whether it needs to be frequent reporting as it’s much less time sensitive than for example revenue and income. Even once a year seems sufficient ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.283333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#3",
                    "likes": "1",
                    "time": "14/07/2022-21:57:16",
                    "content": "Thank you for this analysis and I think it’s a good idea for us, as a DAO, to understand at a high level the amount of holders and holding trends. Appreciate you doing this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1499999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#4",
                    "likes": "2",
                    "time": "15/07/2022-07:49:06",
                    "content": "This is great work @lyt, Only a quant-based analysis can help us improve the current governance system and align it towards the shared values of MakerDAO - assuming there are some. In my opinion, the current Maker governance system is highly inefficient to protect against adverse selection and behavioural deviation. And this is extremely exacerbated by the high concentration. We have discussing a lot lately how to improve decision making internally, but not enough IMO how to improve the base layer of voting. I have had some fun recently in trying to model mathematically what happens in flat commingled systems of voters/ proponents like Maker. If anyone is interested I paste it below.    dirtroads.substack.com    # 43 | First Principles of Crypto Governance Designing Gonzo-Mathematical Governance Mechanisms for Systems of Irreducible Uncertainty      ",
                    "links": [
                        "https://dirtroads.substack.com/p/-43-first-principles-of-crypto-governance?r=k87cd&s=w&utm_campaign=post&utm_medium=web"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.197058823529411
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#5",
                    "likes": "7",
                    "time": "15/07/2022-08:11:35",
                    "content": "Love this, @lyt.     lyt:  Would it be worthwhile to regularly report these MKR decentralization metrics? If so, at what cadence?   Aren’t the dashboards available all the time? Maybe the solution is to work on making them more accessible (@makerburn is the perfect example) so that you don’t need to be copying-pasting all the time. It goes also with the decentralization ethos: if you ever leave, the dashboards are there, still serving the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.339285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#6",
                    "likes": "1",
                    "time": "15/07/2022-09:10:21",
                    "content": "They’re live on Dune so thanks to the embeds, in 6mo time when people open this thread again the data will have refreshed. I think @lyt is referring to the commentary probably and publicizing the availability of this information ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#7",
                    "likes": "2",
                    "time": "15/07/2022-09:41:48",
                    "content": "This was an interesting post - thank you. I’d be interested in a semi-regular report if you’re up for it. Looking at the Dune query, it looks like you were able to link MKR held in Delegate contracts and the Chief to their originating wallet - this is great as it reflects the true source of the MKR. Were you also able to do this for MKR in LPs or deposited to other protocols such as Aave and Compound etc? If not, won’t this skew the results? Looking at the Dune query for the GINI co-efficient, some of the numbers seem to be discrepant. Did you apply any grouping or normalising? For example, it lists the Pause Proxy as having 78,594.787 MKR tokens, but etherscan shows 77,801.08 (link). Do you have any data on Gini coefficients for other DeFi tokens? It would be nice to compare Maker to other protocols in the space to see if this is a unique problem for Maker. Finally, almost a year ago, Vitalik published an interesting post about the pitfalls of using Gini co-efficient in the crypto context - link for anyone that’s interested. I’d be interested to hear your thoughts on this if you have time. ",
                    "links": [
                        "https://vitalik.ca/general/2021/07/29/gini.html"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.40625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#8",
                    "likes": "2",
                    "time": "15/07/2022-09:52:32",
                    "content": "Thanks, Adrian.     adcv:  They’re live on Dune so thanks to the embeds, in 6mo time when people open this thread again the data will have refreshed. I think @lyt is referring to the commentary probably and publicizing the availability of this information   This is even better, @lyt, you’re selling this work short then.   We (Maker) need to work on documentation a lot; not sure what the best UI/UX is, but ideally we build some evergreen doc (or even better, the UI is so clear that you don’t need docs) so that people can interpret / check evolution of the metrics as needed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.493801652892563
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#9",
                    "likes": "3",
                    "time": "15/07/2022-10:42:58",
                    "content": "    Patrick_J:  Finally, almost a year ago, Vitalik published an interesting post about the pitfalls of using Gini co-efficient in the crypto context - link for anyone that’s interested. I’d be interested to hear your thoughts on this if you have time.   I had not read this article, it’s very thought provoking thank you. It’s very interesting he comes back to the HHI index as a measure of concentration - our team has had ideas for a generalized HHI metric in other settings related to measuring decentralization. I understand Vitalik’s point that two identical quantitative measures of inequality can produce two very different outcomes. I imagine most attempts at reframing multi-variate problems into two principal components will probably end up having to choose their tradeoff. In the case of Gini, I think it probably works well if you don’t try to extrapolate the impact and just look at measuring the distribution or dispersion of token holders. It’s hard to argue it’s anything other than very concentrated at the moment no matter how you look at it but the important data points will emerge when sampling these different measures over time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.752604166666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "0",
                    "time": "15/07/2022-10:47:06",
                    "content": " image747×750 35.5 KB  Non-transparent backgrounds in the future please. Doesn’t work so well on dark-mode  Edit: Ah, these are embeds. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#11",
                    "likes": "2",
                    "time": "15/07/2022-13:00:11",
                    "content": "Congrats @lyt on putting this dashboard together! Every single visual provides an interesting insight into MKR shareholder decentralization. The commentary is super useful but the graphs, titles and legends are very clear that I dont think a frequent post is required unless you would be want to do it. Since the dashboard is designed to provide decentralization metrics, maybe including targets (or comparable) that achieve “decentralization” and red flags that would be concerning would further increase its usefulness. That would further guide/inform the viewer into what good and bad looks like. Eg # of wallets comprising 50% of MKR is a super important metric. A target might be X wallets (based on similar shareholder voting recommended distribution) while a red flag could be <5?  Screenshot_20220715-084820_Chrome1080×1172 92.6 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.632886904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#12",
                    "likes": "3",
                    "time": "15/07/2022-14:40:07",
                    "content": "    Patrick_J:  Looking at the Dune query, it looks like you were able to link MKR held in Delegate contracts and the Chief to their originating wallet - this is great as it reflects the true source of the MKR. Were you also able to do this for MKR in LPs or deposited to other protocols such as Aave and Compound etc? If not, won’t this skew the results? Looking at the Dune query for the GINI co-efficient, some of the numbers seem to be discrepant. Did you apply any grouping or normalising? For example, it lists the Pause Proxy as having 78,594.787 MKR tokens, but etherscan shows 77,801.08 (link ). Do you have any data on Gini coefficients for other DeFi tokens? It would be nice to compare Maker to other protocols in the space to see if this is a unique problem for Maker.   We could do that for MKR in LPs, but one problem is that MKR is borrowable as well so this would lead to negative balances of some wallets that borrow and send elsewhere. Our general approach is along the lines of “not your keys not your coins” for simplicity - if any contract besides governance holds MKR on someone’s behalf, we assume the contract owns those tokens. Another reason we choose this approach is that we are trying to measure the decentralization of governance power. If someone deposits 10K MKR into AAVE and another borrows AAVE’s entire sum of MKR, the original depositor has effectively zero governance power & the borrower has it all. This can only be reflected with our current approach. CEX wallets are also a source of imperfection here. We’ll look into the discrepancy, thanks for calling that out! And I agree that if we continue to use Gini Coefficient, context will help. We already thought to bring forth through time views but will also pull in the coefficients of other tokens. I suspect as you do this is not a unique problem for Maker.     LongForWisdom:  Non-transparent backgrounds in the future please. Doesn’t work so well on dark-mode  Edit: Ah, these are embeds.   Really unfortunate! Embeds can have non-transparent backgrounds (& these are actually currently set to have solid white backgrounds). Discourse forums by default block a bunch of things, including html styling (which is how background color is set). We are looking into a solution to this to make embeds dark-mode-friendly! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.557499999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rachel_G",
                    "index": "#13",
                    "likes": "4",
                    "time": "15/07/2022-16:10:28",
                    "content": "@TRUEMAKER good idea on targets!  I think seeing trend lines in addition to targets could be helpful (especially if the “ideal target” level is out of reach, at least in the short-term).  Also, as @lyt points out, CEX wallets will distort the reality, to a “target” level may be too precise. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pipko",
                    "index": "#14",
                    "likes": "3",
                    "time": "15/07/2022-16:31:10",
                    "content": "@Patrick_J thanks for the great feedback:     Patrick_J:  Looking at the Dune query, it looks like you were able to link MKR held in Delegate contracts and the Chief to their originating wallet - this is great as it reflects the true source of the MKR. Were you also able to do this for MKR in LPs or deposited to other protocols such as Aave and Compound etc? If not, won’t this skew the results?   The current query does not adjust for LP contracts like Aave and Compound (although as you point out you could have a version where you look through the Aave contracts). We have a version in process that could make this adjustment–the issue is identifying all the correct LP contracts which is a work in progress. Edit: @lyt points out above that there are some issues with the look through:     lyt:  We could do that for MKR in LPs, but one problem is that MKR is borrowable as well so this would lead to negative balances of some wallets that borrow and send elsewhere. Our general approach is along the lines of “not your keys not your coins” for simplicity        Patrick_J:  Looking at the Dune query for the GINI co-efficient, some of the numbers seem to be discrepant. Did you apply any grouping or normalising? For example, it lists the Pause Proxy as having 78,594.787 MKR tokens, but etherscan shows 77,801.08 (link ).   Thanks for the flag, I will check on this for you     Patrick_J:  Do you have any data on Gini coefficients for other DeFi tokens? It would be nice to compare Maker to other protocols in the space to see if this is a unique problem for Maker.   Yes, but we are holding off on releasing them to compare because we haven’t done the work to isolate their treasury and delegation yet. We want them to be as close to like-for-like before releasing.     Patrick_J:  Finally, almost a year ago, Vitalik published an interesting post about the pitfalls of using Gini co-efficient in the crypto context - link  for anyone that’s interested. I’d be interested to hear your thoughts on this if you have time.   I read the article when building this query–I don’t disagree with Vitalik’s main points, namely the coefficient obscures concentration of power vs. lack of resources and it is difficult to compare when participation is optional (ownership of a specific asset in an economy) vs. effectively required (participation in an economy). For our purposes, I think this metric is most useful when used to understand how our own Gini has changed over time vs. comparisons to real world economies. ",
                    "links": [
                        "https://vitalik.ca/general/2021/07/29/gini.html"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1321839080459775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#15",
                    "likes": "1",
                    "time": "15/07/2022-19:20:27",
                    "content": "    lyt:  CEX wallets are also a source of imperfection here   Are CeXs allowed to vote on MKR governance polls with custodied MKR tokens? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#16",
                    "likes": "2",
                    "time": "15/07/2022-19:33:05",
                    "content": "    Doo_StableLab:  as it’s much less time sensitive than for example revenue and income. Even once a year seems sufficient   Great work @lyt I agree with @Doo_StableLab it will be enough even if it will be reported once a year. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#17",
                    "likes": "2",
                    "time": "15/07/2022-19:36:49",
                    "content": "Not to my knowledge. An integration with fireblocks could help unlock institutional engagement. Saw the name fly by in Discord I think from @rspa, pinging to see if relevant? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#18",
                    "likes": "2",
                    "time": "15/07/2022-19:41:02",
                    "content": "If they really wanted to, what would stop them from sending 80-90% of the MKR tokens they hold on behalf of users to the governance contract to vote on something? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ClausClowes",
                    "index": "#19",
                    "likes": "0",
                    "time": "15/07/2022-20:01:02",
                    "content": "Would this data be useful for simulating governance power shift? I’m thinking specifically for governance vis-a-vis delegation. Like if # of delegators stayed the same, but everybody holding 5-500 MKR delegated, what would happen to the voting power balance? Those kinds of things. Knowing what metrics push governance balance the most could be useful, especially as we are pushing for more participation/considering voting incentives re endgame? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#20",
                    "likes": "2",
                    "time": "15/07/2022-20:31:51",
                    "content": "    lyt:  If they really wanted to, what would stop them from sending 80-90% of the MKR tokens they hold on behalf of users to the governance contract to vote on something?   CeXs wouldnt have any incentives to participate, they most likely dont have a dedicated team to vote on behalf of the organization and more importantly it would cost them gas fees and costs associated to salaries. Also, note sure if CeX users provide them with the voting ability, legally speaking, of participating on their behalf. But if it was possible, wouldnt we be against this type of participation? Since the CeX would be voting based on their interest which might or might not reflect the interest of the MKR holder? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#21",
                    "likes": "0",
                    "time": "15/07/2022-20:32:41",
                    "content": "Flipside will be switching to Fireblocks when we renew the contract, if possible. Still figuring this out though. So nothing is set in stone here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#22",
                    "likes": "3",
                    "time": "15/07/2022-21:48:31",
                    "content": "Coinbase jointly owns USDC. Think they will never have incentive to participate in our votes, which may influence the $5B of USDC we hold? This is one more obvious example, but there are countless possibilities. Good point on the legality. If CeX users currently don’t provide them with delegate power, I’m sure an update to the ToS would do the trick I think we should be against this type of participation. But as far as I’m aware, this could happen today and the votes would count. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.28125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#23",
                    "likes": "1",
                    "time": "15/07/2022-22:12:20",
                    "content": "Thats a good point and could be a threat down the road. Might be worth adding a timeline graph of MKR held by CeXs, not sure if we are able to further identify them (Coinbase, Geminis, Binance, etc) but if we can that would provide insights and allow us to act to protect MKRs decentralization. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.912037037037036
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#24",
                    "likes": "1",
                    "time": "16/07/2022-02:02:26",
                    "content": "If we start paying people to vote, as the endgame plan proposes, exchanges would have a strong incentive to start participating. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#26",
                    "likes": "0",
                    "time": "16/07/2022-19:32:29",
                    "content": "    CodeKnight:  If we start paying people to vote, as the endgame plan proposes,   Really? Even if its a good idea, (Maybe urgent or high priority polls should be paid but not all) I don’t know if we want CeXs to be able to further benefit from their user’s coins. I guess there wouldn’t be anything we can do about it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.559999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#27",
                    "likes": "2",
                    "time": "18/07/2022-13:36:59",
                    "content": "This is really interesting and important information. Could we arrange a verbal presentation to walk through the charts and your analysis? Perhaps a G&R call or separate session? @Davidutro ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/layerzero",
                    "index": "#28",
                    "likes": "1",
                    "time": "18/07/2022-14:26:33",
                    "content": "Great work. @Balloonist is working in a decentralization matrix for MakerDAO, you should definitely cooperate! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Balloonist",
                    "index": "#29",
                    "likes": "2",
                    "time": "20/07/2022-15:58:35",
                    "content": "Thanks for a great post @lyt Just a couple of questions and comments from my side. You demonstrate that: It only takes the three largest entities to dominate any vote. I would love to get a discussion started about how many votes would be sufficient for the Maker community to say the voting is sufficiently decentralized and the reasoning behind this number. The changes could also be based on minority protection, quorum requirements, or the way we count votes. You conclude that: Since April 2021, the effective number of MKR holders has been slightly declining, suggesting slightly decreasing decentralization I would like to have the number of MKR holders actually voting visualized instead of the number of holders that are able to vote, as this might be a better metric. Call to action I voted it not worthwhile to report on a fixed basis, however I find the work very helpful. I would rather prefer to see this reporting when something of important changes, like bells and whistles when some predefined thresholds are passed. This would create a better kind of attention than when doing time-scheduled posting, IMO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.18859649122807
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#30",
                    "likes": "0",
                    "time": "20/07/2022-16:18:31",
                    "content": "Great points and questions Maker voting isnt very decentralized at this point ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#31",
                    "likes": "0",
                    "time": "18/10/2022-16:18:52",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}