{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/coinbase-launches-dai-rewards-peg-will-need-more-help/3449",
            "title": "Coinbase launches Dai Rewards - peg will need more help ",
            "index": 3449,
            "category": [
                "Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rileyjt",
                    "index": "#1",
                    "likes": "4",
                    "time": "29/07/2020-20:26:48",
                    "content": "   Medium – 29 Jul 20    Coinbase launches Dai Rewards for customers in the US, UK, Netherlands,... At Coinbase, we want to offer more ways for customers to earn rewards with their crypto. Last year, for example, we began offering… Reading time: 2 min read        Today, we’re introducing Dai Rewards, with 2% APY* for customers in the US, UK, Netherlands, Spain, France, and Australia. With yields on savings accounts and government bonds at record lows, earning rewards on stablecoins like Dai and USDC stands out as an alternative way to passively generate income using crypto held on Coinbase.  I assume they are trying to compete with DeFi systems for deposits. I would expect other centralized exchanges to follow suit. We’re going to need more DAI. ",
                    "links": [
                        "https://blog.coinbase.com/coinbase-launches-dai-rewards-for-customers-in-the-us-uk-netherlands-spain-france-and-1519113f8d2f?gi=106788933faf",
                        "https://help.coinbase.com/en/coinbase/trading-and-funding/other/dai-rewards",
                        "https://forum.makerdao.com/t/discussion-executive-vote-to-raise-eth-a-usdc-a-usdc-b-w-btc-bat-debt-ceilings/3450/5"
                    ],
                    "GPT-summary": "Coinbase has launched Dai Rewards, offering 2% APY for customers in several countries. The post suggests that Coinbase is trying to compete with DeFi systems for deposits and that other centralized exchanges may follow suit. The post ends with the statement \"We're going to need more DAI,\" indicating that the demand for Dai may increase due to this new offering. The post does not fit perfectly into any of the listed topics, but the closest matches are constructive criticism, extending to the proposal, and advertising the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.375
                }
            ]
        }
    ]
}