{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/all-mkr-holders-on-friday-12pm-est-please-vote-for-the-gsm-to-be-activated/1303",
            "title": "All MKR Holders, on Friday 12pm EST, please vote for the GSM to be activated! ",
            "index": 1303,
            "category": [
                "Governance"
            ],
            "tags": [
                "govsec-module"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "11",
                    "time": "18/02/2020-19:44:10",
                    "content": "Update: The vote has now passed. Thanks to all who voted!  Based on the recent goings on regarding flash loans, and the general concern over the risk of governance attack it seems likely that we are going to put an executive proposal to activate the GSM on-chain on Friday. Once the GSM executive goes live on Friday we need to make sure that it is activated as quickly as possible in order to minimise the risk of governance attack. In the meantime, in order to defend against a possible governance attack, consider moving your MKR to the  ‘Hat’ proposal. So, to conclude, I am asking MKR Holders to do two things. 1. When this weeks executive vote goes up (Friday, 12pm EST), please review it promptly, and seriously consider voting to activate the GSM as quickly as possible. It is critically important that this is activated as soon as possible. 2. Vote for the current hat proposal prior to Friday. This is the executive proposal that has already passed, and was created the Friday before last. The more MKR on this proposal, the safer the Maker Protocol is from attack. Current hat proposal can be found here: https://vote.makerdao.com/executive-proposal/activate-the-savings-rate-spread-and-the-sai-and-dai-stability-fee-adjustments ",
                    "links": [],
                    "GPT-summary": "The author of the post is asking MKR holders to vote for the activation of the GSM on-chain and to move their MKR to the 'Hat' proposal to defend against a possible governance attack. The author is also asking MKR holders to review the executive proposal promptly and vote for it as quickly as possible. A 3rd party is not giving feedback on the proposal, but the author is asking for MKR holders to take action.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.442067736185383
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adamdossa",
                    "index": "#2",
                    "likes": "1",
                    "time": "18/02/2020-23:18:25",
                    "content": "Is it possible to provide a quick explanation of how the GSM will help mitigate a governance attack (i.e. where an entity gains enough MKR to force an immediate executive vote, through the use of a flash loan / liquidity pools or otherwise)? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.555555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "2",
                    "time": "18/02/2020-23:48:33",
                    "content": "Hello! Thanks for coming to the forum. I’ll give a summary my best shot.  Activation of the GSM (Governance Security Module) means that there will be a delay between a proposal being ‘passed’ and a proposal becoming ‘active’ This immediately shuts down flash loans, because there is no way for an attacker to abuse the change that they voted in within the same block that they voted it in. Outside of the use of flash loans or borrowed MKR generally, having a GSM delay means that for 24 hours (or the length of the delay), other MKR Holders can see what change will be activated, and react if it is malicious. This reaction can take a couple of forms. If more MKR than the attacker owns can be brought to bear before the delay expires, the change can be cancelled. If we can’t muster more MKR than the attacker within the delay period a quorum of MKR (currently 50k) can trigger Emergency Shutdown. In practice, this means that governance attacks of this nature are not viable and shouldn’t happen. An attacker will never be able to financially benefit from an attack before Emergency Shutdown is called, so there is no incentive to attack the protocol, and we should never need to use the Emergency Shutdown mechanism.  Hope that answers your questions.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.122863247863249
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adamdossa",
                    "index": "#4",
                    "likes": "0",
                    "time": "19/02/2020-00:47:30",
                    "content": "Thanks - much appreciated. I guess that if an attacker set it up in such a way that after the 24 hour period, all pillaged ETH collateral was paid out to MKR token holders proportionally, then there may not be much of a motivation to enact Emergency Shutdown (or cancel the executive vote via a quorum) by MKR token holders. Having said that it does seem a step in the right direction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.885714285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "1",
                    "time": "19/02/2020-12:16:51",
                    "content": "Just realised that the title of this post previously specified 12pm PST, while the body specified 12pm EST. Pretty big cock-up on my part. Apologies all. The correct time is: Friday 12pm EST ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.138888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/the_ocs",
                    "index": "#6",
                    "likes": "0",
                    "time": "19/02/2020-12:58:54",
                    "content": "    LongForWisdom:  If we can’t muster more MKR than the attacker within the delay period a quorum of MKR (currently 50k) can trigger Emergency Shutdown.   Question on Emergency Shutdown: Is there an attack vector here as well, as in, flash loan or obtain 50k and trigger it? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "0",
                    "time": "19/02/2020-13:04:59",
                    "content": "Hello, welcome to the forum! Ultimately yes but not by using flash loans. MKR locked in the Emergency Shutdown module (when this reaches 50k shutdown is triggered) is locked permanently. If this happens, the community need to decide whether the ES was malicious or not, if they deem it to have been justified, they can restore the MKR (technically we would need to mint more or migrate to a new token, but the actual mechanism isn’t super important.) This means that if you trigger ES maliciously you lose a bunch of money. Doesn’t mean that it can’t happen, but there is a high cost associated with it. Link to docs: https://docs.makerdao.com/smart-contract-modules/emergency-shutdown-module#game-theory-of-funding-and-firing-the-esm ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.1896349862258955
                },
                {
                    "author_link": "https://forum.makerdao.com/u/the_ocs",
                    "index": "#8",
                    "likes": "0",
                    "time": "19/02/2020-13:08:50",
                    "content": "Ok, understand, guess question then becomes what the impact/disruption of this ES is on the overall DeFi landscape (given the importance of DAI)… And if an attacker can see a path to profit through the impact (with either a short or long duration) of an ES. Maybe worth exploring this mechanism further. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#9",
                    "likes": "1",
                    "time": "19/02/2020-13:11:35",
                    "content": "@the_ocs https://forum.makerdao.com/tag/emergency-shutdown ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/haydenadams",
                    "index": "#10",
                    "likes": "1",
                    "time": "19/02/2020-14:24:14",
                    "content": " If more MKR than the attacker owns can be brought to bear before the delay expires, the change can be cancelled.  Personally, I think 24hrs is too short to coordinate MKR in response to an attack making emergency shutdown a more likely scenario. I would feel much better at 72 hrs to 1 week ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "2",
                    "time": "19/02/2020-14:28:47",
                    "content": "I agree, but I think starting the debate around the actual delay now is probably a bad idea. 24 hours was the previous suggestion and is what everyone has been assuming it will be set to up until this point. If we activate at 24 hours that fixes the current attack vector. Later on we have time to discuss and find a value that makes the most sense. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.738095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/haydenadams",
                    "index": "#12",
                    "likes": "3",
                    "time": "19/02/2020-14:44:54",
                    "content": "Classic perfection is the enemy of good situation Totally agree, if 24hrs is more likely to pass quickly I’m all for it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#13",
                    "likes": "0",
                    "time": "19/02/2020-15:57:49",
                    "content": "Actually i would have prefer a 0 Delay time with a dedicated team 24/24 working on this. Since we are moving millions…worth it… ‘’ A Hacker never sleep ‘’ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#14",
                    "likes": "1",
                    "time": "19/02/2020-22:56:32",
                    "content": " In practice, this means that governance attacks of this nature are not viable and shouldn’t happen. An attacker will never be able to financially benefit from an attack before Emergency Shutdown is called, so there is no incentive to attack the protocol, and we should never need to use the Emergency Shutdown mechanism.  an emergency shutdown by one anon person griefing flash loans would be bad it’s easy to profit a lot by predicting a “black swan” accurately in any market human nature is that people do things just to see if they can, for no profit defi can’t survive on “lack of incentives” it requires “strong disincentives” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.527777777777779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#15",
                    "likes": "4",
                    "time": "20/02/2020-00:03:07",
                    "content": "    David_Meister:  an emergency shutdown by one anon person griefing flash loans would be bad   You can’t trigger ES with flashloans. The Emergency Shutdown Module locks the MKR used to trigger it, you can’t get it back again.     David_Meister:  defi can’t survive on “lack of incentives” it requires “strong disincentives”   The strong disincentive to this is that you lose all the MKR locked to trigger Emergency Shutdown. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.555555555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dominik",
                    "index": "#16",
                    "likes": "4",
                    "time": "20/02/2020-04:00:45",
                    "content": "Continuing the discussion from All MKR Holders, on Friday 12pm EST, please vote for the GSM to be activated!: Hi all! We did an analysis of the attack vector using flash loans and crowd funding to take over the Maker Governance Contract here: https://medium.com/@dominik.harz/stealing-all-of-makers-collateral-f940970605b1 Right now the attack is not possible using flash loans due to missing liquidity. However, if the liquidity at the flash loan pools become high enough, it is entirely possible. By introducing a delay through the GSM, flash loan attacks would be prevented.  Actually i would have prefer a 0 Delay time with a dedicated team 24/24 working on this.  The problem with flash loans is that it would become a race condition even if you had a 24/7 team working on this. Best they could do is detect the tx with the flash loan in the mempool and try to get in a transaction before the attacker that would prevent the attack. ",
                    "links": [
                        "https://medium.com/@dominik.harz/stealing-all-of-makers-collateral-f940970605b1"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.622619047619048
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#17",
                    "likes": "0",
                    "time": "20/02/2020-16:26:21",
                    "content": "    dominik:  The problem with flash loans is that it would become a race condition   This is not the main problem actually ? The one who got the more liquidity and CPU power calculation ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.111111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#18",
                    "likes": "0",
                    "time": "21/02/2020-04:52:27",
                    "content": "@dominik Could you provide any reference for the numbers (i.e. available liquidity) you are citing in the article? Where did you get 38k MKR available liquidity for kyber? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dominik",
                    "index": "#19",
                    "likes": "0",
                    "time": "21/02/2020-05:19:44",
                    "content": "Not sure what you mean by more liquidity and CPU power. I mean if you had enough liquidity in a flash loan and if there is enough MKR available to buy within a single tx, then the attacker can execute within the single tx. As a defense, you would have to see the transaction first before it is included in the longest chain. Then you would have to send a transaction the e.g. takes the same flash loan but replaces the governance contract with one that has the GSM with a delay > 0 activated to counter the attack. But then it becomes a decision of the miner which transaction will be included first. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.159226190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dominik",
                    "index": "#20",
                    "likes": "0",
                    "time": "21/02/2020-05:30:43",
                    "content": " Could you provide any reference for the numbers (i.e. available liquidity) you are citing in the article? Where did you get 38k MKR available liquidity for kyber?  Sure! We used this https://dexindex.io/?symbol=MKR&amount=50000&action=buy to check the liquidity. On Kyber itself you would only see the liquidity they have in reserve (the swap). I guess you would have to execute the trade with the limit orders as well to get that amount of MKR. Also, the price has changed quite a bit since we did the last check. It has become more than 4x the price it seems. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.604166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#21",
                    "likes": "0",
                    "time": "21/02/2020-08:03:52",
                    "content": "https://dexindex.io/?symbol=MKR&amount=1000000&action=buy I still get value returned, although input is amount of mkr bigger than current supply. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#22",
                    "likes": "0",
                    "time": "21/02/2020-17:13:39",
                    "content": "    LongForWisdom:  Update: There has been a minor delay in getting the executive vote on-chain due to etherscan going down. (Etherscan is used to verify the contract bytecode matches the provided sourcecode.)   See update in the OP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party giving updates on proposal"
                    ],
                    "Sentiment": 4.449074074074074
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#23",
                    "likes": "1",
                    "time": "21/02/2020-18:22:57",
                    "content": "The proposal is up. Browse to here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#24",
                    "likes": "0",
                    "time": "21/02/2020-22:48:22",
                    "content": "The vote has now passed! Thanks all who voted. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#25",
                    "likes": "0",
                    "time": "28/02/2020-22:48:24",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}