{
    "poll_list": [
        {
            "title": "Adopt the Debt Ceiling Instant Access Module (DC-IAM) for PSM-USDC-A - June 21, 2021",
            "index": "8601",
            "option": "Yes",
            "supporting_mkr": "12,669",
            "highest_fraction": 0.99
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-adjust-psm-usdc-a-for-whatever-it-takes-to-keep-the-peg/8601",
            "title": "[Signal Request] adjust PSM-USDC-A for \"whatever it takes to keep the peg\" ",
            "index": 8601,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "sig-status-accepted",
                "psm-usdc-a"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#1",
                    "likes": "9",
                    "time": "07/06/2021-18:47:41",
                    "content": " Overview In the last weeks we have seen a significant inflow of USDC into the PSM which made it necessary to increase the DC to 3B in an urgency executive.  While we probably all would like to keep the amount of USDC in the PSM lower than it is today, the PSM is still the best weapon we have to keep the peg. I want to propose that we do a Mario Draghi move to  send out a message that the peg is our highest goal and have a tool ready to adapt to crazy market moves   Activate DC-IAM for PSM-USDC-A I want to signal for changing PSM-USDC-A to  activate DC-IAM  set a really high line on it with corresponding gap and ttl defined by @Risk-Core-Unit    Pros:  hopefully enough headroom to not need another urgency exec on the PSM strong tool to keep the peg   Cons:  might result in a even higher dependency on USDC  Please vote for all options you would support in an onchain poll     no change set line to 10 B (+8 B) set line to 15 B (+12 B) set line to 20 B (+17 B) Abstain     0 voters      Next Steps The Poll will run until 2021-06-17T13:00:00Z; its outcome will either result in a on-chain-poll assuming the outcome of the poll deems it necessary or its intermediate results are going to be taken to another initiative - another signal, onchain-poll or urgency executive. ",
                    "links": [
                        "https://www.mkranalytics.com/vaults/USD/PSM-USDC-A?stats=Dai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1591480800&end=1623535199&granularity=Weekly",
                        "https://www.youtube.com/watch?v=tB2CM2ngpQg",
                        "https://community-development.makerdao.com/en/learn/governance/module-dciam/",
                        "https://forum.makerdao.com/t/delaying-this-weeks-executive-vote-originally-scheduled-for-june-25-2021/8948",
                        "https://forum.makerdao.com/t/maker-relay-episode-50/8897",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-june-13th-2021/8851",
                        "https://forum.makerdao.com/t/maker-relay-ep-49-en-espanol/8795",
                        "https://forum.makerdao.com/t/maker-relay-ep-49/8763",
                        "https://forum.makerdao.com/t/maker-relay-ep-48-en-espanol/8636",
                        "https://forum.makerdao.com/t/maker-relay-ep-48/8609",
                        "https://forum.makerdao.com/t/maker-relay-ep-51-en-espanol/9063",
                        "https://forum.makerdao.com/t/maker-relay-ep-51/9011",
                        "https://forum.makerdao.com/t/maker-relay-ep-50-en-espanol/8966"
                    ],
                    "GPT-summary": "The author proposes to adjust PSM-USDC-A to activate DC-IAM and set a high line on it to keep the peg. The post includes pros and cons and an on-chain poll for voting. The post explains the proposal and the next steps. A 3rd party could give constructive criticism, ask questions, or audit and review the proposal.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.410897435897436
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "5",
                    "time": "07/06/2021-21:22:40",
                    "content": "This is a no-brainer. Market values debt (in the form of DAI) with $1 face value at > $1. Sell more debt. We can deal with the counterparty risk later. Any organization that’s not this DAO would take this deal all day long and then invest some portion of the USDC to generate yield. If we can go from 2 billion USDC assets to 20 billion by offering 0%, perpetual debt (DAI) and be paid to do it, we should do it. It’s the deal of a lifetime. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#3",
                    "likes": "0",
                    "time": "07/06/2021-21:39:52",
                    "content": "I am for doing whatever it takes but disagree re: a no-brainer to sell more debt. We have to find some debt to sell, not overexpose to risk of going severely < $1… here going to eg $10B moves us to yet another level of temporarily tying our fate to USDC’s. But the peg is more important. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "4",
                    "time": "07/06/2021-22:32:23",
                    "content": "How do we deal with the “no-it-doesn’t-take-a-brain” to make comments on Twitter referring to DAI as a USDC wrapper? Kill the noise, or ignore the noise ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#5",
                    "likes": "0",
                    "time": "07/06/2021-22:46:50",
                    "content": "The challenge is getting people to bother with integrations, not what happens on Twitter. Working on a proposal about the USDC war chest, though, so we’re not a wrapper. The big question is how do we buy or invest in something off chain if a DAO can’t own something, and how to put that kind of money to work if it’s just on chain. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#6",
                    "likes": "5",
                    "time": "07/06/2021-22:58:40",
                    "content": "Yes. But for some reason we are too scared to invest the proceeds. If we can have a private vault to hold USDC why can’t we have a private RWA to hold investment grade commercial paper. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#7",
                    "likes": "1",
                    "time": "07/06/2021-23:38:16",
                    "content": "I think there is always going to be that noise about what I don’t understand or what I can criticize the easiest thing to do. If it’s for the common good, ignore the noise. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#8",
                    "likes": "1",
                    "time": "07/06/2021-23:40:34",
                    "content": "I already want to see this proposal. Just out of curiosity ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#9",
                    "likes": "5",
                    "time": "08/06/2021-04:28:58",
                    "content": "    flipflopflapdelegate:  Twitter referring to DAI as a USDC wrapper?   They’re not entirely wrong though. As much as we can say it’ll be fixed in the future with RWA DAI, right now, DAI is heavily reliant on USDC. This proposal only makes those arguments more true than before. I don’t have a solution but the criticism coming at us is completely fair and warranted until we show a demonstrable ability to scale up DAI supply faster than the demand for leverage.     PaperImperium:  It’s the deal of a lifetime.   It is until something goes wrong with USDC. The space is way too young to put that much faith into a single centralized entity. I think there’s merit to your point but it’s not quite a no-brainer. As for the PSM debt ceiling, I would make the following points:   Is there an issue right now where the market believes that we will let DAI go off peg? I don’t think this is the case. Our commitment to the peg doesn’t need to be proven with a huge move like this. Even when the PSM DC is hit, the peg still stays where it is because arbitrageurs know that we eventually will raise the DC with an exec.   Urgent execs are annoying but they aren’t that much a thorn in our side.   I don’t see the necessity to do this right now. The peg is fine and having the occasional urgent exec gives us much better control over how quickly the PSM grows. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.736607142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#10",
                    "likes": "5",
                    "time": "08/06/2021-07:13:25",
                    "content": "    AstronautThis:  The peg is fine and having the occasional urgent exec gives us much better control over how quickly the PSM grows.   The size of the PSM is actually not under our control. As you said, arbitrageurs continue to sell Dai when the PSM is fully utilized, because they have faith that it will be raised again. The second we decide that “enough is enough” and don’t raise the PSM we lose that credibility. So is it better that we raise the PSM 10 times over 20 weeks until it is utilized by 10 billion or that the PSM is used as needed and left with plenty of headroom? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#11",
                    "likes": "1",
                    "time": "08/06/2021-07:18:21",
                    "content": "    zenithlight:  The size of the PSM is actually not under our control. As you said, arbitrageurs continue to sell Dai when the PSM is fully utilized, because they have faith that it will be raised again. The second we decide that “enough is enough” and don’t raise the PSM we lose that credibility. So is it better that we raise the PSM 10 times over 20 weeks until it is utilized by 10 billion or that the PSM is used as needed and left with plenty of headroom?    IMHO we even raise our credibility by increasing the DC right now as arbitrageurs would know that there is 0% doubt in our decision to do whatever it takes to keep the peg. This is much better than just believing we are going to urgently increase the DC again and again. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#12",
                    "likes": "0",
                    "time": "08/06/2021-08:54:16",
                    "content": "    zenithlight:  So is it better that we raise the PSM 10 times over 20 weeks until it is utilized by 10 billion or that the PSM is used as needed and left with plenty of headroom?   Hopefully, we’re not doing that every two weeks (we’ve only had one urgent exec for the PSM DC if I recall correctly, the remaining increases were normal execs) so the real question for me is whether this is such an undue strain on governance. I would agree with this proposal if there were peg problems but that doesn’t seem to be the case at all.  There are two kinds of arbitrageurs: those who believe we will raise the DC and those who only play the game when they have a cast iron guarantee. The peg is unaffected as long as there are enough arbitrageurs of the first kind. The con of such a high PSM debt ceiling is that any type of event where the credibility of USDC comes into question (whether real or even fake news) and its price dips below $1, our PSM is going to instantly be full of an asset we overpaid for. DAI is supposed to be pegged to $1 and USDC is just a proxy. If that proxy no longer represents $1, we should minimize the damage. Some point out that if USDC has issues, we’re screwed anyway - this is true to some extent but doesn’t justify allowing ourselves to be screwed over three times as badly. Lastly, given that we are considering several other stablecoin PSMs precisely to avoid being overly dependent on USDC, raising the USDC PSM debt ceiling by at least a factor of 3 seems to go against that effort. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.361458333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#13",
                    "likes": "4",
                    "time": "08/06/2021-09:43:30",
                    "content": "    AstronautThis:  Urgent execs are annoying but they aren’t that much a thorn in our side.   if we are willing to urgently raise the DC whenever it is needed we can just DC-IAM it. There is no difference - just removing manual and annoying working, relying on sluggish on chain approval, GSM delay… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.5624999999999996
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#14",
                    "likes": "0",
                    "time": "08/06/2021-10:05:42",
                    "content": "    ultraschuppi:  if we are willing to urgently raise the DC whenever it is needed we can just DC-IAM it.   I think I see your point now - fair enough. Could you comment on the values of gap and ttl that would go with each option or are we waiting for the Risk team to decide this? I guess you’re saying that if the “lag” is sufficiently large, the DC-IAM can be disabled before we take on too much USDC in the event of a problem with USDC. This makes sense. Also, I imagine we would be lowering the line when other stablecoin PSMs are introduced? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.74234693877551
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#15",
                    "likes": "1",
                    "time": "08/06/2021-10:10:48",
                    "content": "    AstronautThis:  I think I see your point now - fair enough. Could you comment on the values of gap and ttl that would go with each option? If the “lag” is sufficiently large where the DC-IAM can be disabled before we take on too much USDC in the event of a problem with USDC, I can see that it makes sense.   So  - just guessing here and would rather get an opinion from @Risk-Core-Unit - if we would set the gap to 1B and the ttl to 24h the effective ceiling can be increased once a day to +1 B to the current utilization. If something goes totally wrong with USDC we are doomed already now - does not really matter if we get 1B of bad debt or 10 B  ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.107142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#16",
                    "likes": "3",
                    "time": "08/06/2021-10:14:31",
                    "content": "    ultraschuppi:  If something goes totally wrong with USDC we are doomed already now - does not really matter if we get 1B of bad debt or 10 B   I disagree with this part - it’s always a sliding scale of damage and I think we should treat every extra bit of risk the same way. After all, USDC might end up at $0.99 at some point so do we lose $100M or $1B?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 3.7
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#17",
                    "likes": "1",
                    "time": "08/06/2021-12:53:58",
                    "content": "Is that only 5 times our total supply? More seriously we don’t earn anything with usdc and half of our supply is not at work already. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#18",
                    "likes": "6",
                    "time": "08/06/2021-15:43:26",
                    "content": "I abstained because I think all outcomes here are acceptable, but I keep asking myself at what point does maker attempt to kick this vice with USDC? Even in this thread the comments are all “the threat is already existential so whats the harm with making it more existential.” I get the point there, which is why I abstained, but if maker is accepting total failure as a risk I would love to see some plan made for at least mitigating it’s likelihood. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.383333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#19",
                    "likes": "6",
                    "time": "08/06/2021-16:45:50",
                    "content": "    Andy_McCall:  but if maker is accepting total failure as a risk I would love to see some plan made for at least mitigating it’s likelihood.   The best solution is to simply take some of this USDC – we have $2 billion and counting of it – and swap it into USD and then income-producing assets. That lowers our counterparty risk to Circle, lowers the perception of us as a wrapper, lowers the opportunity cost of having $2 billion on the balance sheet that is sitting idle, and overall makes the protocol safer by having the anticipated income to draw from. The question is how do we get from Point A (where we are now) to Point B (take some of this USDC float to earn income and diversify our risk). It’s understandable for us to be at Point A today, but really unforgivable from both a risk management and profit maximizing perspective if we’re still sitting on Point A by the back half of the year. So let’s all start getting comfortable with the idea of taking some of our USDC and putting it to work. In the meantime, hopefully our Centrifuge and 6S experience will help us figure out the best way to structure that kind of relationship. As long as we will move closer to Point B and further from Point A in the future, all this USDC is a free float. If this inflow continues (and maybe it won’t), we can probably earn more from reinvesting a portion of the USDC than from our current core business. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.991228070175438
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#20",
                    "likes": "1",
                    "time": "08/06/2021-17:01:57",
                    "content": "I really like this idea but what sort of investment would you imagine it being? Presumably, volatile investments might not go down well given that each USDC backs 1 DAI and we want to maintain that. From a technical point of view, what exactly are the tools we need to get from the PSM to US dollars held in a bank account somewhere but controlled by the DAO? I think this might merit its own thread to avoid cluttering this one up. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.894444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#21",
                    "likes": "1",
                    "time": "08/06/2021-17:16:35",
                    "content": "    AstronautThis:  I really like this idea but what sort of investment would you imagine it being?   Something conservative. And no, we don’t need 1 DAI at all times for instantaneous settlement. Just enough reserves to maintain the peg. Maybe that’s 80% of what’s in the PSM, maybe it’s 40%. Lots of details that will need their own debates later, and better suited to a new thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.196969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jameskmccall",
                    "index": "#22",
                    "likes": "4",
                    "time": "10/06/2021-20:19:21",
                    "content": "Would actually prefer to depeg at some point than become a USDC wrapper. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#24",
                    "likes": "3",
                    "time": "13/06/2021-06:30:07",
                    "content": "Maybe we should consider raising the fee to 0.15%, with the USDC PSM growing at this rate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#25",
                    "likes": "3",
                    "time": "13/06/2021-07:08:14",
                    "content": "Almost all DeFi protocols ranging from AAVE to Curve have a large centralized stablecoin portion, so the problem is not unique to Maker per se. Also, yes, maintaining peg is quite important for partners and etc. We still have many large partners that either took USDC or used to have Dai but chose USDC instead because the Dai peg broke so hard during DeFi summer. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.707837301587302
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#26",
                    "likes": "0",
                    "time": "15/06/2021-14:06:07",
                    "content": "Its a no-brainer only if we have something to use the proceeds from the debt sale. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#27",
                    "likes": "0",
                    "time": "15/06/2021-14:10:45",
                    "content": "Isn’t the total outstanding USDC around 23 B?  Don’t substantial risk issues develop if we had a third or more of all USDC in our PSM?  Aren’t we already pressing our luck on having 3 B all at one location? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#28",
                    "likes": "1",
                    "time": "16/06/2021-00:28:22",
                    "content": "Why not use the USDC to provide liquidity on Curve, Uniswap, or Aave/Compound? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#29",
                    "likes": "0",
                    "time": "16/06/2021-00:43:49",
                    "content": "I can’t speak for others, but my worry is we’d move the market, which would devalue USDC and we just feed the PSM. I like a no-cost float (most insurance companies would kill for it), but I don’t want one based on recursive action ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#30",
                    "likes": "0",
                    "time": "16/06/2021-07:41:00",
                    "content": "In theory if we move the market, usdc will go under 1. And circle would have to remove some usdc from the supply. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#31",
                    "likes": "0",
                    "time": "16/06/2021-10:17:22",
                    "content": "    alexis:  In theory if we move the market, usdc will go under 1. And circle would have to remove some usdc from the supply   Not if we still have the PSM. It operates the same for appreciating USDC as it does for lowering DAI ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#32",
                    "likes": "0",
                    "time": "16/06/2021-10:21:37",
                    "content": "Not really, the dai will go under peg as/with the usdc. We haven’t invented the infinity loop for making free money yet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#33",
                    "likes": "0",
                    "time": "16/06/2021-11:00:01",
                    "content": "USDC is way more liquid around $1 that I don’t really think we have to worry about breaking their peg. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#34",
                    "likes": "0",
                    "time": "16/06/2021-21:55:22",
                    "content": "    PaperImperium:  but I don’t want one based on recursive action   What about using Volmex’s ETHV and iETHV to hedge market price volatility? As ETH drops ETHV rises thereby mitigating the risk of insolvency due to bad debt. When volatility mean reverts the iETHV rises along with the price of ETH. Another source of income is being a Uniswap v3 LP on both pairs knowing that the impairment loss is actually impermanent. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.9625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#35",
                    "likes": "2",
                    "time": "17/06/2021-14:48:58",
                    "content": "Thanks everybody for participating in this Signal Request. I will now prepare an onchain poll in collaboration with @Risk-Core-Unit It will very likely go live on 2021-06-20T22:00:00Z, I will update here accordingly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.5606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tedh",
                    "index": "#36",
                    "likes": "1",
                    "time": "18/06/2021-10:11:50",
                    "content": "The interesting thing about MKR that isn’t intuitive is that fee collection already goes up when ETH falls as CDPs liquidate (13% is a nice fee).  I’m pretty sure it’s not necessary to hold ETHV as a hedge, but could definitely see it being possible to generate a CDP for ETHV someday. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.321428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#37",
                    "likes": "2",
                    "time": "22/06/2021-06:51:34",
                    "content": "The corresponding onchain poll is now live in the voting portal. The poll will run until 2021-06-24T16:00:00Z - please participate there. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#38",
                    "likes": "0",
                    "time": "24/06/2021-19:08:31",
                    "content": "small update: the onchain poll passed, but as there is not going to be a weekly executive tomorrow (and the poll said it should be added in the next 30 days) it will not be included in an executive before next week. will keep you updated once the corresponding onchain exec is available ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#39",
                    "likes": "0",
                    "time": "26/06/2021-14:04:48",
                    "content": "We are going full Mario Draghi on the DAI peg. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#40",
                    "likes": "1",
                    "time": "03/07/2021-08:16:19",
                    "content": "update: the current executive vote is containing the changes from this Signal Request:  Maximum Debt Ceiling (line): 10 billion DAI Target Available Debt (gap): 1 billion DAI Ceiling Increase Cooldown (ttl): 24 hours  please help by putting your MKR onto the exec. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#41",
                    "likes": "0",
                    "time": "04/07/2021-13:11:21",
                    "content": "Wow 10 billion DAI is a lot of money, I would prefer it not to be in stable currencies, but at the end of the day the market is the one who decides and we just give the options. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#42",
                    "likes": "0",
                    "time": "22/07/2021-13:03:42",
                    "content": "Some house keeping: the executive containing this Signal passed and the spell was cast on July 18th. You can currently check the latest DC-IAM details on the PSM on MakerBurn. ",
                    "links": [
                        "https://makerburn.com/#/collateral/psm_usdc"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#43",
                    "likes": "0",
                    "time": "21/08/2021-23:04:19",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "3764"
}