{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mkr-token-question/8566",
            "title": "MKR token question ",
            "index": 8566,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PacoBelan",
                    "index": "#1",
                    "likes": "0",
                    "time": "06/06/2021-12:14:44",
                    "content": "Can you passively hold the MKR token to gain exposer to the utility of the network? Or do you have to be actively maintaining the network with MKR to see the benifits of the token? For example, I really like this project but I do not feel qualified to actively participate with the direction that the project takes. Is it safe and reasonable for me to own MKR in this senario? Edit 1: As a disclaimer, I have been studying this project for 5 months now. I wouldnt say I am ignorant to the goals of the project, but I am still learning. speed test ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.027777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "0",
                    "time": "06/06/2021-12:28:04",
                    "content": "MKR can best be thought of as the keys to the protocol. Over time, a portion of revenues are directed towards buying those keys and burning them. Presumably this will result in upward pressure on the price over time, as there is a ready buyer of MKR when the protocol has high revenues and low expenses, relative to each other. This does not guarantee appreciation of MKR on the secondary market. And direct participation is indeed optional. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.646875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "0",
                    "time": "06/06/2021-13:00:20",
                    "content": "in addition, because of the strength and all the development that this protocol has, you can see MKR as a way to save, as well as as paper said, there will always be a buying pressure and upward pressure from the burning of the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#4",
                    "likes": "0",
                    "time": "06/06/2021-14:12:44",
                    "content": "To some extent I would take MKR as a company action because of the decisions MKR makes and the token reacts. No doubt with all the new and good decisions that maker is making I would be a permanent MKR holder. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#5",
                    "likes": "0",
                    "time": "06/06/2021-22:39:19",
                    "content": "Hi, @PacoBelan Participation is encouraged but not required. In the future you will be able to delegate your MKR’s voting power to someone else who can then vote on your behalf. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#6",
                    "likes": "0",
                    "time": "07/06/2021-03:53:33",
                    "content": "    PacoBelan:  For example, I really like this project but I do not feel qualified to actively participate with the direction that the project takes   As mentioned earlier, you do not need to participate if you don’t want to but please don’t hesitate to participate because you feel unqualified. Everyone on this forum or on RocketChat is willing to answer questions (I’ve asked plenty of really basic ones myself) and if you hang around here often enough, you’ll soon form opinions on the directions we are taking. Most signal request discussions also point out the issues involved and you can form an opinion on their arguments. I want to stress that the more people we have contributing with ideas or pointing out issues with our current direction, the more successful the protocol gets. So please don’t feel shy to make your voice heard. The fact that you own MKR tokens means you are as invested in Maker’s success as anyone else! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.086309523809524
                }
            ]
        }
    ]
}