{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/negative-interest-rates/842",
            "title": "Negative Interest Rates ",
            "index": 842,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "concerns",
                "rates",
                "dsr"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/John_Galt",
                    "index": "#1",
                    "likes": "0",
                    "time": "22/11/2019-02:46:13",
                    "content": "How would Dai hold a peg to a currency that has negative interest rates? Negative interest rates (on demand deposits) means that people are literally being charged a % fee to hold their money at a bank. Based on my understanding of the current MCD system there is no way to mimic this with Dai. It is not possible to implement a negative DSR as currently implemented due to voluntary DSR participation/lock-up. If rates were to go negative, how would Maker prevent Dia from trading at a premium? On the supply side, the goal would be to increase supply by reducing the stability fee but that can’t go lower than 0 (I assume because otherwise MKR holders would be eating the difference which would be unsustainable). On the demand side, the stability fee can’t be lowered below 0(because it’s opt in option). What options are left to maintain the peg in a scenario where the stability fee is 0, the DSR is 0 but Dai is still trading at a premium? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.263888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "0",
                    "time": "22/11/2019-09:52:55",
                    "content": "Welcome to the forum @John_Galt !     John_Galt:  It is not possible to implement a negative DSR as currently implemented due to voluntary DSR participation/lock-up.   This is correct.     John_Galt:  What options are left to maintain the peg in a scenario where the stability fee is 0, the DSR is 0 but Dai is still trading at a premium?   I think the answer to this is to on-board new collateral types that we can hopefully use to increase supply. It’s admittedly not a great answer, but in the scenario you’ve outlined above, I think that’s the only option. This scenario is one of the reasons that it’s so important for MCD to include a wide range of collateral assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.254734848484849
                },
                {
                    "author_link": "https://forum.makerdao.com/u/John_Galt",
                    "index": "#3",
                    "likes": "0",
                    "time": "22/11/2019-14:14:52",
                    "content": "I think onboarding more collateral is the best answer but I don’t think that would be sufficient. I think the DSR would need to be baked directly into Dai as opposed to the opt in option. IMHO this kind of a big deal given the current rate environment. It implies the current Maker system is incompatible with a negative rate environment. In other words it would not currently work with a euro or yen dai and if USD rates went negative I believe the peg would break. Maybe I’m missing something though? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.53125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#4",
                    "likes": "2",
                    "time": "22/11/2019-20:28:07",
                    "content": "The TRFM can be activated to replicate negative rates. To lower demand for Dai, one can make 1 Dai redeemable for only $0.99 of collateral, for example. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/John_Galt",
                    "index": "#5",
                    "likes": "0",
                    "time": "22/11/2019-20:38:33",
                    "content": "Ah, that makes sense. Should have known I was missing something.  Thanks Cyrus! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#6",
                    "likes": "0",
                    "time": "23/11/2019-19:48:45",
                    "content": "@cyrus excuse my ignorance but what is TRFM. I was asking previously about ability for Maker to implement negative interest rates or not. I think a good sales case would be if Maker would never go negative on rates.  I mean really are we going to pay borrowers and bill savers? If it came down to this I would be advocating highly to adopt a commodity peg either energy or PMs or both since I don’t ever see negative rates entering those markets - just straight up inflation due to excessive money printing and currency devaluation that will ensue by CBs.    This whole idea of NIRP is rather insane and dangerous to the world economy to my mind.   imo it is my hope Maker should try to do better and avoid going down this road even if it means changing what we are trying to PEG to. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.512422839506173
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#7",
                    "likes": "0",
                    "time": "23/11/2019-21:29:43",
                    "content": "TRFM would make 1 Dai redeemable for some dollar amount of collateral other than $1. So, if 1 Dai were all of a sudden only redeemable for $0.98 at Emergency Shutdown it would de facto act like negative interest rate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#8",
                    "likes": "0",
                    "time": "23/11/2019-22:10:09",
                    "content": "thank you for the reply @cyrus and I apologize for not being precise? What does the acronym TRFM stand for? And now that you bring it up it.  Is this TRFM a feature or function ‘only’? available during a Emergency Shutdown or during other normal operation of Maker? Thank you in advance for any reply ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#9",
                    "likes": "0",
                    "time": "23/11/2019-22:36:32",
                    "content": "TRFM is a super old concept, called the Target Rate Feedback Mechanism. It was actually (afaik) the original implementation of DSR, but it became too confusing (and I agree). Check out this old post from way back in the day https://steemit.com/makerdao/@kennyrowe/digital-money-a-simulation-of-the-deflation-rate-adjustment-mechanism-of-the-dai-stablecoin ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.434523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chaser",
                    "index": "#10",
                    "likes": "1",
                    "time": "24/11/2019-00:45:28",
                    "content": "Wasn’t TRFM removed from MCD? I can’t find it in the code base. Also, AFAIK the TRFM was intended as a temporary (and rather extreme) intervention to be used until the peg can be restored by regular means, and not to implement a continuous devaluation (that negative interest is). @MakerMan, I  believe negative interests don’t make sense outside the insanity known as traditional finance, so I agree that ensuring an equivalent is not possible in Maker would be highly desirable, given that not replicating the legacy system’s failures is one of the unwritten mission statements.     John_Galt:  How would Dai hold a peg to a currency that has negative interest rates? … What options are left to maintain the peg in a scenario where the stability fee is 0, the DSR is 0 but Dai is still trading at a premium?   I think the simplified answer to this is that in such an environment, assets prices should rise, including ETH, real estate, metals, etc. The demand for leverage should rise as well, including in Maker, so vault openings and the dai supply should eventually rise, lowering the dai price. Raised debt ceilings can further facilitate this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.476785714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/John_Galt",
                    "index": "#11",
                    "likes": "0",
                    "time": "24/11/2019-01:33:51",
                    "content": "If TRFM is not available, it sounds like there are no other mechanisms available to prevent Dai from trading at a premium in the scenario outlined above. @cyrus could confirm if TRFM is part of MCD? If true, this is a problem that needs to be solved. TRFM would be one option. Other options would be to make the DSR compulsory with the ability to set to negative. A third option would be for the DAO to mint Dai and sell into the market to increase supply. Not sure that I’ve thought this third option the whole way through, but this may be the best option. It allows Dai holders to avoid negative interest rates and MKR holders to reap the benefits of the printed Dai sales. If the system could reliably and sustainably provide a zero/non-negative return to Dai holders in a negative rate environment this would be huge. I would expect explosive growth of the system. It could/should be done now for the currencies currently experiencing negative savings rates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PatrickDehkordi",
                    "index": "#12",
                    "likes": "0",
                    "time": "25/11/2019-19:38:26",
                    "content": "Need to make sure I understand the problem, cause it seems complex, but a good question:  As it stands we are pegged to a 2% by design inflationary currency, (USD) The federal reserve in theory is responsible for the peg above. 400 years of central bank data shows, this is impossible to do, and there will be periods when real interest rates go negative, and there will be periods of high inflation or deflation.  Is the question: What do we do if real interest rates in the US go negative like September of 2008? or is the question what do we do if the we somehow become more valuable than  than a deflationary USD? or is the question simply what do we do if we are above peg with SF=0 DSR=0? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.297777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/John_Galt",
                    "index": "#13",
                    "likes": "0",
                    "time": "27/11/2019-01:24:43",
                    "content": "Many used to think this scenario was impossible but it is happening with many major currencies today. May not be likely but it is possible this happens to USD. If it did, the DSR and SF may not be able to hold the peg on their own. Another mechanism may be required (like TRFM). Regarding the other points:  2% inflation is just one of the Feds mandates Not a peg to anything, just an inflation target Not impossible. It is currently happening with several major currencies (Japanese  yen, Swiss franc, Danish krone)  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.630952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PatrickDehkordi",
                    "index": "#14",
                    "likes": "0",
                    "time": "27/11/2019-11:49:46",
                    "content": "By “impossible” I mean it is impossible to have 2% constant inflation or any other type of defined stability. If  history is an indicator,  there will be periods of negative real interest rates, and there will be periods of higher than usual inflation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.960648148148148
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chaser",
                    "index": "#15",
                    "likes": "0",
                    "time": "16/12/2019-08:45:04",
                    "content": "    PatrickDehkordi:  Is the question: What do we do if real interest rates in the US go negative like September of 2008? or is the question what do we do if the we somehow become more valuable than than a deflationary USD? or is the question simply what do we do if we are above peg with SF=0 DSR=0?   One thing “we could do” is to hustle hard enough to be able to get dai off of the USD peg by the time this happens, moving on to a custom currency/commodity basket or some more advanced stability mechanism. If there will still be a need for a USD-pegged stablecoin, it can be done as a synthetic asset with the new, stable dai as its collateral basis. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.747589531680441
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chaser",
                    "index": "#16",
                    "likes": "0",
                    "time": "29/03/2020-17:38:41",
                    "content": "(This post is a transfer of conversation from the Onboarding USDC as collateral to mitigate liquidity risk topic.)    Onboarding USDC as collateral to mitigate liquidity risk   The assumption you are making is true over the long term, but there can be periods of time (like during a drawn-out pandemic or a massive catastrophe) when economic activity shrinks. DAI needs to be able to handle these situations. A temporary negative fee and DSR would be a very effective fix. Beats an emergency shutdown!   I agree, on the short term from now, a negative DSR can be better than an ES. However, you previously talked about longer-term changes, and that’s also what I’m addressing. (To make it clear, I’m talking about the negative DSR in the next two paragraphs.) I still think that negative interest rates make “sense” only in the ethically compromised world of legacy finance. Although Maker still depends on it (e.g. Dai is pegged to a fiat currency), Maker’s goal should be to create a system that evolves beyond legacy concepts and ethics.  And if that means e.g. a surplus buffer of 25% of the Dai supply as a recession war chest, or flopping every week in times of crisis, then maybe that’s the price to pay for a better system. My point is that it’s easy to fall into copying the legacy system and make the same mistakes. And it’s tenfold easier under the duress of a crisis. Dai users shouldn’t pay for the faults of economists and policy makers from past generations. They are the prime user base of Maker. The whole purpose of this initiative relies on them.    Onboarding USDC as collateral to mitigate liquidity risk   Of course, once the surplus is depleted, the situation goes back to normal and the Stability Fee can go back to being positive again. In normal times, economic activity is expanding, demand for DAI and ETH is increasing and the Stability Fee and DSR are positive. But in an emergency, they can go negative until normality is restored. People would understand that a negative fee is only temporary and preserves their investments, unlike an ES.   As long as it’s within the confines of a positive surplus, and it’s effective, I’m not against a negative SF. I’d have to think more about it. It would be basically a distribution of (part of the) surplus buffer to vault owners.    Onboarding USDC as collateral to mitigate liquidity risk   This is an incomplete fix. An ES is a risk that stays in the back of people’s minds, undermining their confidence in DAI and ETH. It needs to be reduced as much as possible.   The ES is always a risk. It’s the risk you take when you enter the system, and one you have to take care of first. Trust in Maker relies on the base assumption that during an ES, every system participant is more-or-less fairly remunerated. Once that’s taken care of, you can go on to deal with other things, like people’s perception of how likely an ES is and such. ",
                    "links": [
                        "https://forum.makerdao.com/t/onboarding-usdc-as-collateral-to-mitigate-liquidity-risk/1570/55",
                        "https://forum.makerdao.com/t/onboarding-usdc-as-collateral-to-mitigate-liquidity-risk/1570/55",
                        "https://forum.makerdao.com/t/onboarding-usdc-as-collateral-to-mitigate-liquidity-risk/1570/55",
                        "https://forum.makerdao.com/t/onboarding-usdc-as-collateral-to-mitigate-liquidity-risk/1570/56"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.30961791831357
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#17",
                    "likes": "0",
                    "time": "29/03/2020-19:42:14",
                    "content": "DSR has to be baked in and negative rates supported. DAI price today: $1.025. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#18",
                    "likes": "1",
                    "time": "29/03/2020-22:18:27",
                    "content": "@chaser  Thank you for your reply. You echo my sentiments and understanding of the NIRP environment quite well.   I agree asset prices typically will rise (that was and has been managed by CBs as well using futures markets to great extent particularly during the 2007-8 crisis and associated money creation to ‘support’ asset prices over the past decade - the US CB I think still has not unwound its treasury exposure completely to the 2007-2008 event).  You are also right demand for leverage naturally would rise (and has).   What is interesting is you conclude with a point I get back to repeatedly.   Liquidity (via raised debt ceilings) would most facilitate management of the PEG particularly when demand is high.  One just has to be careful that the facilitated liquidity is not allowed to run away by continuously increasing debt ceilings.  Usually in this case the PEG is running <1. My concern is the risk management under such schemes.  CBs pretty much are running amok in this realm as far as I can tell.  I really like the idea (but know there are people who completely disagree with me - mostly kensians) of not allowing rampant money printing and a complete leverage up, who gives a shit about risk laze faire attitude vs. a more conservative well if the markets need some pain to slow down, let it happen approach.  It is my view better to hold back growth to moderate risk and allow some cracks/liquidations to appear and/or slow markets down than to just let them run rampant and then self collapse in a massive risk off event.   What we have seen is for the tendancy of humans with markets to allow the creation of massive risk dependency and having not enough backing capital for liquidity to manage the deleveraging of risk.    This approach inherently puts a damper on ‘return’ - giving up some return to buy insurance against risk and always tend to slow down economies vs. to heat them up constantly.   Conceptually I feel it is better to limit growth in exchange for lower and managable risk exposure to try to lengthen the inevitable end of the business growth cycle. I never posted this but this whole tread is rather preescient of the events recently. Interesting idea to pay vault owners to borrow.  But if the whole liquidation system puts peoples capital at risk you can pay all you want and they simply are NOT going to borrow more.   Typically CBs basically are just going to print because they have no compunction about backing for capital. In the Maker system there really is no similar mechanic for providing liquidity to the system via unbacked printing.  Sopping up that liquidity via fees is the obvious back out btw…  One could argue that Maker could via USDC basically drop the USDC SF to near 0 and alter the Liquidation Ratio down to allow for high leverage.  IF Maker knew that there was absolute 0 chance of a blacklisting event one could pretty much use this as a direct tool for decentralized printing via USDC backing but this simply increases general reluctance to want to use DAI if basically in a ES DAI resolves to a large portion of USDC which the community in general affects confidence as you say. I don’t see an obvious mechanism (negative rates will just pull drom DSR) - paying borrowers to borrow IS an option but then when sopping up this DAI via fees you actually then have to burn the amount you paid them to pull it back properly and retain collateralization in an ES.   Remember if you just pay borrowers DAI you are in effect increasing DAI supply but not increasing collateral.  During an ES one would need to account for this extra money printing by lowering the effective redemption rate on DAI to collateral to something less than $1 again affecting DAI holders. Interesting thing here.  Everytime I look at the ES it looks to me like DAI holders end up holding the bag as I know of no real mechanism in the system to guarantee they will be made whole while if the backing collateral value rises > $1 DAI holders end up making money. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.466507936507936
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chaser",
                    "index": "#19",
                    "likes": "0",
                    "time": "30/03/2020-00:07:02",
                    "content": "Interesting observations @MakerMan, I too appreciate thoughtful  input.     MakerMan:  What is interesting is you conclude with a point I get back to repeatedly. Liquidity (via raised debt ceilings) would most facilitate management of the PEG particularly when demand is high. One just has to be careful that the facilitated liquidity is not allowed to run away by continuously increasing debt ceilings.   When I suggested raising the DC, it was part of an answer to “what to do if DSR=0, SF=0 and peg>1”. I agree that a responsible governance would analyze the business cycle, and anticipate the “bust” part with preemptive action. One could be lowering the DC (though for that, you also have to change SF and deal with the consequences of that). Another action, mentioned in my previous post, could be setting a high surplus buffer size and a low DSR spread well in advance, in order to amass a buffer big enough that can soak up liquidation shortfalls during a crash. The first solution discourages risk-taking and assumes governance knows better, the second allows leverage risks but provides a safety net for the protocol. Both could be employed in parallel for safeguards.     MakerMan:  In the Maker system there really is no similar mechanic for providing liquidity to the system via unbacked printing.   There is. Governance can “print” new Dai, but it won’t remain unbacked for long. It would appear as bad debt and anyone could instantly cancel it out with the surplus in the buffer (which means MKR burning would not continue until the buffer is filled up again). If there’s insufficient surplus, the deficit would eventually trigger MKR dilution and auctioning, which may decrease the MKR price. So the governance itself would pay for the Dai it voted to print, and the system’s capitalization would remain intact, provided there are no issues with the auctions. Paying the negative ES to vault owners could work the same way, only in an automatic manner. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.459393939393939
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#20",
                    "likes": "0",
                    "time": "30/03/2020-02:08:16",
                    "content": "    chaser:  Interesting observations @MakerMan, I too appreciate thoughtful  input.   agreed.     chaser:  When I suggested raising the DC, it was part of an answer to “what to do if DSR=0, SF=0 and peg>1”. I agree that a responsible governance would analyze the business cycle, and anticipate the “bust” part with preemptive action. One could be lowering the DC (though for that, you also have to change SF and deal with the consequences of that). Another action, mentioned in my previous post, could be setting a high surplus buffer size and a low DSR spread well in advance, in order to amass a buffer big enough that can soak up liquidation shortfalls during a crash. The first solution discourages risk-taking and assumes governance knows better, the second allows leverage risks but provides a safety net for the protocol. Both could be employed in parallel for safeguards.   One of the few first things I asked about here (can’t remember if it was chat or forums) was about why the Surplus was so low at .5M.  Everyone was like - we just picked that number.  I was like - I think you should raise it to something closer to 2-3M at least.  SImple reasoning suggested you would be paying 2x DAI buring MKR than you would minting MKR to buy DAI (which is burned effectively btw - completely sopping up liquidity when you had a negative surplus event). I still think it should be minimum 2-3% total DC for a whole bunch of reasons and think in reality it would be better at 5M or higher (has to start including costs of operation which will be wayyy north of 1-2M/yr).   So in principle I agree with you surplus needs to be higher to deal with your case (2) safetynet. With regards to your (1) DC management to anticipate frothy markets to preanticipate bust by slowing down the runoff tops.   I believe better data and market effectiveness would be served with     Proposal interest rate adjustment by debt facility utilization Risk       I am posting this as a new topic for discussion because after the first round of analysis and the fact the GSM time delay is not activated means the IAMs that could be used to implement it could be coming on line shortly.   Also my wife is now suffering a debilitating medical condition that requires almost constant care currently and so it is time I hand various details/ideas I have found off to others for discussion and debate.  I don’t want to talk about implementation issues but simply the me…     The beauty of this kind of automated rate/facilityutilization curve generation is that it allows for incremental DC SF rate changes at the ends of utilization - if the market is getting heated it will show by where the utilization is sitting on the curve.  If way underutilized it will be at the bottom of the curve.  You can use that info to adjust base rate policy or DC limits and basically let the market tell you what it is thinking and then decide whether to let the growth run, or reign it back a bit.   Literally in such a model if the usage curves are not within expected bounds (20-80%) you will see how disjointed they are getting by how far off into rate increase or decrease they are driving you to go.   The bonus of this model is that you basically capture the higher rates automatically and relieve governance from having to act all the time over shooting, undershooting, whatever and if no-one wants money rates automatically due to low utilization rates drop significantly as well (probably the rarer case).     MakerMan:  In the Maker system there really is no similar mechanic for providing liquidity to the system via unbacked printing.       chaser:  There is. Governance can “print” new Dai, but it won’t remain unbacked for long. It would appear as bad debt and anyone could instantly cancel it out with the surplus. If there’s insufficient surplus, the deficit would eventually trigger MKR dilution and auctioning, which may decrease the MKR price. So the governance itself would pay for the Dai it voted to print, and the system’s capitalization would remain intact, provided there are no issues with the auctions. Paying the negative ES to vault owners could work the same way, only in an automatic manner.   This was why I was saying during last ‘deficit’ the system continued to run fine with -5.3M debt and flops halted.  That fact alone should have been sufficient to drive the PEG to below 1 (ES the system there and DAI holders take a haircut to the tune of ~6-7% below $1 at the time from 1.08 or above it was like a 13% price swing) but it didn’t (markets ignored the fact their collateral was worth 6-7% under $1 for a few days and instead DAI only dropped to maybe 1.03).   While I like the idea of paying that interest to vault owners - would it really make it into markets to drive the PEG down.  I think they would just use it to pay down debt and lower their Liquidation price.  Those people would basically bank it against future fees vs. borrowing more.  Now would new ETH come in to deposit and mint as well as make some return in a 0 rate enviroment - yeah.   Guess what they have to do - to do that.   Buy collateral.  If they want to lever it.  They sell DAI and buy more collateral.   But the amount of liquidity that comes on the market I think has an impairment factor related to newETH /oldETH factor.  So if you want to double system liquidity you basically need newETH=oldETH.   What I find interesting is to create like extra 1K DAI the system only has to offer to pay some small percent/yr to (all vault holders including the new ones) to encourage that so whilie there is an impairment factor related to amount of DAI that can be generated by newETH - there is a multiplier factor on how much DAI interest has to paid to generate that 1K DAI for X time for new vault owners (or bankers on the borrowing side of DAI) I will have to think more about this one but honestly the more I think about it the more I like it as a real decentralized negative rate enviroment.  Because the negative rate is taking the positive rate to the borrowers to encourage more borrowing.   As long as there isn’t other postive returns out there to compete with your positive rate for vault/borrowing in the collateral side I think this should prove a quite effective way to generate DAI liquidity that would be freely unleashed on the markets.   Then just sop it up with +SF later.   The only issue is how one treats the negative balance during a ES and determining when a negative balance requires minting and selling MKR in flops vs. just sopping up with +SF later which is what is done now. What this tells me is that instead of punishing savers with negative interest rates, we should be paying borrowers to borrow.   BUt hell in their CB world everything is levered to the hilt but literally it would be paying the borrowers to borrow to induce new borrowing while rewarding everyone that is in the hole, at the expense of savers (in terms of inflation).     When I compare this to what is going on now, what we have is socialized money printing, direct injection into the entire economy - literally like a crypto air drop of cash throughout the economy at the expense of tax payers/savers.  Though if you look at how government portioned this out - biggest amounts go to businesses that will be deepest in the hole.   Literally consider if the FED just started paying people to have mortgage debt, car debt, whatever debt and a cash savings rate of 0.  Only way to earn 1% is to borrow.  Whether you spend it or not is up to you.    Wow.  Wouldn’t that be a different world! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.425512065095398
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiji",
                    "index": "#21",
                    "likes": "0",
                    "time": "03/04/2020-06:28:59",
                    "content": "    MakerMan:  What this tells me is that instead of punishing savers with negative interest rates, we should be paying borrowers to borrow   Yes! Besides, people will take advantage of the situation so quickly that the interest rate environment can revert back to normal (positive SF) very fast. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.496338383838384
                }
            ]
        }
    ]
}