{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/real-estate-tokenization-protocol-a-pre-mip-discussion/5169",
            "title": "Real estate tokenization protocol: A Pre-MIP Discussion ",
            "index": 5169,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "real-world-finance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Denis",
                    "index": "#1",
                    "likes": "11",
                    "time": "16/11/2020-16:52:18",
                    "content": "Introduction This post is intended to serve as an introduction and “pre-MIP” discussion, where the Maker Community and Risk teams can discuss and provide input on Blocksquare’s protocol as a proposed solution to start accepting real estate (and possibly even other RWA) as collateral, without the need for major updates to the Maker Protocol. The main goal of this forum post is to gather feedback in preparation for the creation of a formal Maker Improvement Proposal (MIP), which will contain more implementation details. TL;DR   The post serves as a “pre-MIP” discussion to gather feedback on the real estate tokenization protocol developed by Blocksquare;   In the context of real estate assets, debt or equity tokens do not seem to be the appropriate solution — while debt services are already very well covered traditionally (banks), equity tokens have no real on-chain settlement in most jurisdictions;   Revenue based asset tokenization is a far superior model for real estate assets as it is not only easier to understand for a token holder, but also solves challenges like on-chain settlement, valuation and transparency;   A description with examples form Blocksquare’s real estate tokenization protocol is included in the 2nd part of this post;   Adopting RWA tokenization protocols will expedite collateral onboarding as it becomes possible for Maker risk teams to compare real estate properties and analyse them more efficiently;   On-chain liquidations should be Maker’s primary concern, while off-chain liquidations of underlying RWA should be left for other participants to engage;   Context Real estate is the biggest asset class in the world. At the same time it’s also one of the most illiquid investments you can make. Generally investing in real estate is hard to access, time consuming and capital intensive. What’s more, real estate as an asset class is difficult to properly valuate, making investments predominantly regionally bound as the availability of reliable data is scarce. In fact, when we look into Commercial Real Estate, a research by JLL shows that approximately 80% of all direct investments are made in just 60 cities around the globe, meaning that 1000s of urban areas are underserved, receiving only 20% of capital. This inequality of accessing funds for urban development furthers the inequality gap and the ability for communities to prosper. With the acceptance of real estate backed collateral, Maker will not only address the sustainable growth of its protocol, but also open an immense opportunity to address these underserved markets providing a real financing solution for real world challenges. Motivation With the publicly declared intention of onboarding RWA (Real World Assets), the Maker community will face numerous collateral onboarding requests by issuers of tokenized securities. This will in terms bring a myriad of tokens structured in various ways up for consideration and assessment by Maker’s risk teams and community. As we have seen from some recent posts on this forum, these tokenized securities have more often than not a complex structure with various legal entities holding certain rights to the underlying asset(s). Individual due diligence on each and every structure will prove to be exhausting and consequently slow down the regular onboarding process for other crypto assets. It is therefore important for the Maker community to first agree on tokenization protocols that will be accepted as a standard and that will help expedite collateral onboarding for RWAs adopting them. It is also important to note that it might not be possible to find a ‘one solution fits all RWA’ protocol and that different tokenization models might fit different requirements. Who are we to comment? Since 2017, Blocksquare and its team have dedicated their time and resources to find the most lean and effective method of bringing real estate assets on the Ethereum blockchain. In the course of this journey Blocksquare has also received some awards and recognitions amongst both the PropTech and Blockchain communities:  Best blockchain solution for real estate — 2019 winners at Crypto Valley Summit (first prize 100,000 USD) Builtworld PropTech competition finalists 2019 One of the winners at 2020 Proptech Innovation Awards by German Tech & Union Investments  While developing the real estate tokenization protocol the team researched various tokenization models including debt and equity, concluding that neither of the two are currently suitable for the purpose of tokenizing real estate assets. Debt vs Equity: Research and Findings While tokenization of debt is easier to implement and also easy to understand, banks already serve this avenue very well. As long as the project is of a certain quality, the borrower has a good balance sheet and is able to provide 20-30% of the required capital to execute the real estate investment, banks will green light the senior loan. Tokenization of debt will thus predominantly attract projects that are unable to secure financing through traditional and well established routes — in short, projects that Maker shouldn’t onboard as collateral. On the other side of the capital stack we have equity. The tokenization of equity was highly expected with the rise of STOs, however, it never really took off. The main challenge of tokenizing equity is transferability. While tokens can settle instantly on a blockchain, to actually transfer the ownership of private companies or real estate is a much more complex process that includes notaries and banking institutions to get involved. We thus conclude that as long as these core players do not become an integral part of Ethereum, the actual transferability of shares will remain limited and provide investors more uncertainty than traditional investment routes. A third option: Revenue based asset tokenization As mentioned above, tokenizing either debt or equity of the capital stack presents challenges — debt is already serviced very well traditionally, while equity tokens have no real on-chain settlement in most jurisdictions around the world. Is there anything else out there? A solution that would offer both asset owners and investors something new? In the real estate context it is fairly easy to estimate the revenue a particular property can generate. Most common revenue streams for real estate properties are:  cash flows from lease contracts, and resale of the property to a 3rd party buyer.  In the context of commercial real estate, the revenues a property generates also highly impact the valuation of the property as investors look predominantly for a target return. Revenue based investing is not by any means a new concept, and is mostly used for financing companies through royalties. A royalty is a defined share of the royalty issuer’s revenues. Royalties have been used for hundreds of years where one party wished to share revenues with another party who was doing something useful to the royalty payer or issuer. Royalties were traditionally used in commerce where the definition of profit was either difficult to determine or not chosen to be revealed. To put it simply, the issuer is telling investors that every month they will receive X% of the issuer’s revenues until they receive Y times their cash back and the issuer expects it to be happening in a period of Z years. The advantages over buying shares or lending a company money? An investor is not concerned with or impacted by the issuer’s profitability for so long as the issuer meets royalty payment obligations. The royalty owner also benefits when the revenues of an issuer increase, but on the flip side there is also the risk of revenues declining. But don’t take our word for it — Investment banker, financier, management consultant, author, lecturer, and inventor of the Lipper Index, Dr. Arthur Lipper, is the main advocate for revenue based investing. Feel free to Google him. Top-line revenues vs. bottom-line profits Revenues are found on the top line of a balance sheet and are easier to understand and project than the profits we find on the bottom line of the balance sheet. Grasping one set of factors that affect revenues is easier than grasping the multi-dimensional factors that affect profit, so risk and reward of revenue investing can be quantified in a more straightforward manner. This is the principle behind royalty finance and provides a greater degree of certainty to the investor; returns in the form of current income begin to flow immediately, and they grow as revenues grow. The investor’s natural skepticism is decreased because he has better information, though it can never be eliminated (nor should it be). The company must still credibly justify its revenue projections, and provide a failsafe mechanism to report, sequester and pay a percentage of revenues to investors. But the investor is now on more solid ground in quantifying his risk, and his reward. Therefore, raising capital may become easier, and the decision to green-light the investment becomes more straightforward. Everyone benefits. Real estate revenues & tokenization Real estate is a specific asset class that offers an investor both steady cash flow and value appreciation over time. Although volatile for traditional markets, in comparison to the crypto market it looks like a safe and steady investment that appreciates in value over time. Additionally, the revenues from lease contracts offer a steady inflow of capital to the investor — in crypto terms it is much like rewards you receive while staking, but without the risk of holding an unstable asset. By tokenizing the real estate asset’s revenues, investors are focused on the growth and performance of revenues. The rest of the balance sheet is less relevant to the investor’s direct interest, and unlocking its mysteries is less of an obstacle to making an informed investment decision. Blocksquare’s real estate tokenization infrastructure Blocksquare’s vision is to power 100s of platforms across the globe, connecting investors to real estate opportunities in their region. With our real estate tokenization protocol entrepreneurs can start digitising real estate assets at a fraction of the cost, while our white-label platform offers the quickest way to launch an online marketplace. DAI is at the heart of the platform already, and adding the ability for property tokens to be used as collateral within Maker would create great value to all participants — issuers, platform operators and end-users alike. Blocksquare’s products include but are not limited to the following:   Blocksquare’s real estate tokenization Protocol provides our Client a standardized method of digitizing the value of a single real estate property, either partially or in full.   Blocksquare’s Platform provides the Client with a white-label solution to create, list, issue, sell, distribute, manage, track and trade properties tokenized through the Protocol. The Platform is composed of two web applications:  Investor dashboard (for end-users) Admin panel (for platform administrators)    1600×900 149 KB Protocol overview The Protocol is the process of creating a ‘PropToken’ smart contract - a standard Ethereum ERC-20 smart contract with a defined maximum issuance of 100,000 digital tokens, extended with unique information identifying a specific real estate property, and additionally limiting transactional rules according to the issuer’s requirements (which users can transact with the tokens is defined within a separate ‘DataHolder’ smart contract). To link a real estate property and its revenues to the ‘PropToken’ smart contract, a Public Corporate Resolution is generated and subsequently signed by the legal representative (e.g. GM, director, CEO) who is mandated by shareholders of the issuing legal entity which in terms also holds title to the property. The signed resolution is made public through IPFS - a distributed file system that ensures the legal document has a fixed online address, while the file itself can not be tampered with after it has been uploaded and becomes public. The location of the file is defined as a unique IPFS hash and recorded within the PropToken smart contract, while the Corporate Resolution holds the information of the ‘PropToken’ contract address. The ‘PropToken’ now points towards the Corporate Resolution and vice-versa, so the legal effects of the corporate resolution work in conjunction with the tokens managed by the ‘PropToken’ smart contract. Consequently, investors holding tokens can use this corporate resolution to appeal in court should the issuer stop their payments. As payments are conducted via smart contract, they are recorded on the ethereum Blockchain and shall be used as proof, should a legal dispute start. 1600×898 135 KB Traditionally, corporate resolutions are used by boards of directors in private and public companies to sign on important corporate decisions, like change of leadership and then reported to the companies house or similar government institution. In the context of tokenization, however, the corporate resolution is used to make a public decision on a specific asset and its revenues. The corporate resolution is used to transfer any and all revenues (NAT — Net After Taxes) that the issuing legal entity generates within the scope of its commercial and trading activity with the specified real estate property to the individual digital token holder of the PropToken smart contract, where 100,000 digital tokens represents a predefined ‘Royalties Percentage’ of any and all net revenues, including revenues generated by a sale of the property to a 3rd party. The ‘Royalties Percentage’ is defined at issuance according to the real estate property’s business model and the cost structure that the issuer will use to generate revenues. For instance, renting out an apartment might append all costs to the tenant and thus the issuer could direct 90-100% of revenues towards token holders, while an office building could have a more complex cost structure with legal, maintenance, financing and other costs stacking up and thus only 60% of revenues would be directed to the token holders. The above method of tokenizing a real estate property or multiple properties forms the Protocol developed by Blocksquare. Example case A property owner has invested in an office building valued at 10,000,000 USD. The equity stake is 2,000,000 USD, a REIT (real estate investment trust) partner has also invested 2,000,000 USD, while a bank loan is in place to finance the remaining 6,000,000 USD over a period of 10 years. All combined lease contracts are projected to generate 2,000,000 USD per year if fully occupied, and the issuer is willing to give up 60% of these projected revenues, as they project 40% need to be reserved for direct and indirect costs. The property owner and REIT partner decide to tokenize 20% of the property to decrease their exposure and use funds for a new investment. The previously described tokenization protocol is used, meaning 20,000 tokens are minted from the PropToken contract (out of a maximum possible supply of 100,000 tokens). If revenues perform as projected, token holders will receive 2,000,000 USD ✕ 60% ✕ 20,000 tokens / 100,000 tokens = 240,000 USD, converted into DAI and distributed to token holders each month. Simply put, if you hold 1,000 tokens on your wallet, you receive 1% of the agreed upon royalties. The sale price of property tokens is determined by the issuer. While it will not change the amount of royalties token holders will receive, it will affect the profitability for investors. Protocol features “FactoryContract” is the main smart contract to generate a “PropTokenContract” — an ERC-20 backwards compatible token standard developed by Blocksquare designed to tokenize a specific real estate property and the revenues it generates. The protocol features a standardized token symbol BSPT-XXX-###, where BSPT stand for BlockSquare Property Token, XXX is a defined unique alphanumeric symbol, and ### is an automatically incremented number. Each PropToken contract is registered in the “PropertyRegistry” — a smart contract where “Identification data” of all real estate properties is publicly available. The “maximum amount” of tokens that can be issued is 100,000, where 100,000 tokens represents a predefined percentage of royalties of any and all net revenues, including revenues generated by a sale of the property to a 3rd party. The Royalties percentage is stored and sealed in the PropToken contract. “Corporate resolution” is the legal binding document uploaded and stored on IPFS that works in conjunction with a PropToken smart contract and creates a financial obligation by the issuer towards any and all holders of a property token. Due to AML regulations, to hold property tokens, a user is required to first complete KYC using Blocksquare’s platform. This is a one-time process. As opposed to ERC-20 where transferability is not limited, PropToken contract’s “transfer function” uses wallet information stored in the “WhitelistingContract” limiting token transferability according to an issuer’s predefined requirements. For instance, it is possible to limit token ownership to wallets whose owners are US residents only, or exclude residents of certain countries, or even define custom parameters for eligibility — the more limitations, the less liquidity potential a tokenized property will have. Each PropToken contract also has a “Capital stack” parameter that needs to be defined by at issuance. Besides the tokenization percentage, the capital stack provisions for 1. Senior equity, 2. Preferred equity, 3. Mezzanine, 4. Junior debt, 5. Senior debt to be defined. This information adds transparency to token investors and the ability for protocols like Maker to create a custom valuation and risk assessment model based on this information. Important to note, that the capital stack can be updated by issuers as time passes, for instance, the debt portion should diminish in time in favour of the equity side. Each PropToken also has the ability to store information about its valuation, split into two categories: 1. Property valuation, and 2. Token valuation. Both values can be updated through oracles. Blocksquare has developed a token valuation model that listens to transactions that occur via DEX protocols like 0x or Uniswap, and takes into account volume, price, property valuation and circulating supply. Property valuation vs. Token valuation A property’s valuation is traditionally created by qualified valuers, for instance, RICS (rics.org) is the most recognized international organization of valuers. On the other hand, big data and AI, has opened the world of “instant valuation” based on available market data. Additionally, companies like RCAnalytics (rcanalytics.com) offer access to accurate property valuation data by partnering with large corporations and investors. Assessment of a property valuation is therefore well established and can be relied upon, although many professionals and RICS members will also tell you that there are cases where valuations made by different valuers with the same tools and qualifications might differ by as much as 10-20%. That being said, banking institutions usually update valuations of their portfolios (properties they have taken as collateral for debt issuance) on a yearly basis, depending on the regional standards of course. A tokenized property’s valuation, on the other hand, is much more dynamic and can’t solely rely on the basis of a rather static traditional valuation model. For this reason, Blocksquare has developed a valuation model for properties based on the share of the tokenized portion in a property’s capital stack. For example, a property where 10,000 tokens have been issued, the token’s secondary market activity will have a lower impact on valuation, then for a property where 70,000 tokens have been issued. RWA valuation and liquidation events Defining a safe model to properly value tokenized RWA is important for mitigating risks associated with possibilities of manipulating prices on secondary markets that would trigger liquidation events. As Maker works with oracles feeding token price information to the protocol, it also relies on multiple data sources to establish accurate prices. With RWA, relying solely on token pricing might prove to be challenging as the amount of data sources is very limited and perhaps even insufficient to establish a reliable pricing point. It can therefore be dangerous as a RWA token price could easily be manipulated. Blocksquare’s protocol mitigates the previously mentioned challenge. Real estate properties hold their real world valuation within the PropToken smart contract itself. Maker oracles could use the rather static “propertyValuation” as an orientational point to prevent manipulated liquidations when the token prices become volatile on secondary markets. Off-chain vs on-chain liquidations for RWA RWA token collateral is essentially not much different than crypto collateral. While the latter has a much more complex valuation model, where network effects and token velocity impact greatly on its value, RWA are usually valued based on more traditional financial models. Any ERC-20 token that is already being accepted as collateral on Maker can lose its value — for instance, a better solution could come to the market and the project’s token could stop to serve its purpose, significantly dropping in value. This process would trigger liquidation events along the way, but on the other side, keepers would not be interested in bidding for these tokens as they would know the project has no future. In the context of RWA like real estate, the assets backing a token are much more tangible and are expected to hold value even in case an off-chain liquidation occurs. However, their capital stack might prove to be more complex, with traditional institutions like banks being involved and having priority to recoup their investment. It is thus required to distinguish between off- and on-chain liquidation events. On-chain liquidations are similar for both crypto and RWA collaterals. A holder has locked a token to get a loan — the RWA tokens might get liquidated, but this does not mean the collateral itself is not performing, thus keepers will gladly engage in auctions to bid for the tokens and profit on the spreads. On the other side, off-chain liquidations are different. While a crypto project’s failure is permanent, a real estate backed token could still offer the token holder an off-chain process via legal dispute that will enable them to recoup at least the underlying asset’s nominal value, at least in part. For instance, commercial banks usually sell portfolios of NLPs (Non Performing Loans) to investors at discounted rates of 70-90%. That’s correct. You could go to a bank to buy a portfolio of real estate assets for a fraction of their valuation. Why? Because getting your investment back on these properties is not by any means an easy job. We believe that off-chain liquidations of RWA should not be Maker’s primary focus. Maker is a decentralized organisation without a legal entity recognised within the real world economy and thus can not take part in legal procedures that take place for off-chain liquidations. On the other hand, certain keepers could operate as legal entities and thus have the ability to engage in RWA legal proceedings. Just like commercial banks sell off their NLPs to outside investors to “deal with them”, Maker should auction NPTs (Non Performing Tokens) to those who are able to turn a profit with them. Why should Maker care? Adopting a tokenization standard for a specific class of real world assets like real estate should be an important step towards standardisation for RWA collateral onboarding. But, at the same time, Maker’s position as a decentralized organization challenging traditional banking institutions should be carefully safeguarded. Opening to RWA collateralization is important, but so is the notion of keeping Maker decentralized and without a central touch point in the “real world” — as long as Maker can not be regulated by governments, institutions and lobbyists, its position as a challenger to central banks will remain intact and hard to stop. It is therefore important, in our opinion, that any proposed solution for onboarding RWA as collateral should not push Maker to create any legal entity of any kind, as such steps could jeopardise the very essence of Maker. Blocksquare’s protocol does not require Maker to create any legal entity to onboard real estate assets as collateral. Maker governors are solely responsible to assess the risks of onboarding a PropToken as collateral via information that can be easily retrieved either directly from PropToken contracts or indirectly via Blocksquare’s API. As most relevant information is publicly available for assessment, Maker risk teams will be able to efficiently analyse different real estate assets not only by looking at each asset individually, but also by comparing them one to another. Information readily available includes:  Real estate property identification data (Ethereum) Real estate property legal ownership (IPFS) Signed corporate resolution (IPFS) Property and token valuation (Ethereum) Property capital stack (Ethereum) Revenues distribution history (Ethereum)  As the identities of issuers are known and linked to Ethereum wallets/accounts, an on-chain “credit scoring” system could be further developed for Maker to automate collateral evaluations based on an issuer’s past performance. What’s more, Blocksquare’s PropToken protocol creates ERC-20 compatible token contracts and implementation to work with Maker should not be an issue, and most importantly, there would not be a need to make major adaptations to the current liquidation system. Next steps At Blocksquare we would like to start a conversation within the Maker community to assess if moving towards a Declaration of Intent and subsequently starting an official MIP on this topic is within the interest of the community. From our point of view, the acceptance of tokenized real estate properties issued through Blocksquare’s protocol should be perceived as a potential model that could expedite if not even automate RWA collateral onboarding on the mid-to-long term. On the other side, the adoption of the protocol by Maker would result for more traditional investors to engage as their tokenized real estate holdings could be further used as collateral. ",
                    "links": [
                        "http://rcanalytics.com",
                        "https://forum.makerdao.com/t/maker-governance-review-november-2020/5453",
                        "https://forum.makerdao.com/t/weekly-mips-update-22/5416",
                        "https://forum.makerdao.com/t/weekly-mips-update-26/6291",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-17-blocksquare-io-wednesday-november-25-18-00-utc/5234",
                        "https://forum.makerdao.com/t/rwa-resena-de-los-ultimos-dos-meses-actualizaciones-y-lo-que-viene/5272",
                        "https://forum.makerdao.com/t/maker-relay-ep-22-en-espanol/5290",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-17-blocksquare-io-wednesday-november-25-18-00-utc/5234/2",
                        "https://forum.makerdao.com/t/maker-relay-episode-22/5288",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-119-thursday-november-19-16-00-utc/5112/2",
                        "https://forum.makerdao.com/t/rwa-last-2-months-review-updates-and-looking-forward/5225",
                        "https://forum.makerdao.com/t/weekly-mips-update-21/5222",
                        "https://forum.makerdao.com/t/weekly-mips-update-24/6052",
                        "https://forum.makerdao.com/t/weekly-mips-update-25/6092",
                        "https://forum.makerdao.com/t/weekly-mips-update-28/6791",
                        "https://forum.makerdao.com/t/weekly-mips-update-23/5914"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.652355355661516
                },
                {
                    "author_link": "https://forum.makerdao.com/u/textrapper",
                    "index": "#2",
                    "likes": "4",
                    "time": "16/11/2020-18:06:13",
                    "content": "    Denis:  Maker’s position as a decentralized organization challenging traditional banking institutions should be carefully safeguarded. Opening to RWA collateralization is important, but so is the notion of keeping Maker decentralized and without a central touch point in the “real world” — as long as Maker can not be regulated by governments, institutions and lobbyists, its position as a challenger to central banks will remain intact and hard to stop. It is therefore important, in our opinion, that any proposed solution for onboarding RWA as collateral should not push Maker to create any legal entity of any kind, as such steps could jeopardise the very essence of Maker.   Wow, great point! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.986979166666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "0",
                    "time": "16/11/2020-18:43:20",
                    "content": "    Denis:  Since 2017, Blocksquare and its team have dedicated their time and resources to find the most lean and effective method of bringing real estate assets on the Ethereum blockchain.   Hey man, interesting post–TY. I guess first question–what has happen since 2017–what are your accomplishments since then? Besides the blockchain awards–have you distributed a RE product on an L1? Were you trying to build your own private chain? Or, were you just focus on building/creating the protocol, etc.     Denis:  As long as the project is of a certain quality, the borrower has a good balance sheet and is able to provide 20-30% of the required capital to execute the real estate investment, banks will green light the senior loan.   I believe there are many other parameters that need to be met by the borrower to get a loan–but okay–I guess it can be view as an easy process for those with a good balance sheet.     Denis:  Blocksquare’s real estate tokenization Protocol provides our Client a standardized method of digitizing the value of a single real estate property, either partially or in full.   Cool–so, you’re doing the same as Compound RE which was taken over recently by the Republic/AngelList folks https://bit.ly/3pw810C  --sort of like owning microshares of RE properties–except you’re issuing tokens versus traditional investment paper.     Denis:  ‘PropToken’ smart contract - a standard Ethereum ERC-20 smart contract with a defined maximum issuance of 100,000 digital tokens, extended with unique information identifying a specific real estate property   What is your theory of having a hard limit of 100,000 per property? Can that number go up and down? Assuming only 10% of the offering gets filled, what happens to the 90%?     Denis:  Due to AML regulations, to hold property tokens, a user is required to first complete KYC using Blocksquare’s platform. This is a one-time process. As opposed to ERC-20 where transferability is not limited, PropToken contract’s “transfer function” uses wallet information stored in the “WhitelistingContract” limiting token transferability according to an issuer’s predefined requirements. For instance, it is possible to limit token ownership to wallets whose owners are US residents only, or exclude residents of certain countries   I guess the PropToken is a Security offering correct? if so, is it also available to unaccredited investors in the U.S.?     Denis:  A tokenized property’s valuation, on the other hand, is much more dynamic and can’t solely rely on the basis of a rather static traditional valuation model. For this reason, Blocksquare has developed a valuation model for properties based on the share of the tokenized portion in a property’s capital stack. For example, a property where 10,000 tokens have been issued, the token’s secondary market activity will have a lower impact on valuation, then for a property where 70,000 tokens have been issued.   Does this mean there won’t be a need for an appraisal of each property?     Denis:  Real estate properties hold their real world valuation within the PropToken smart contract itself. Maker oracles could use the rather static “propertyValuation” as an orientational point to prevent manipulated liquidations when the token prices become volatile on secondary markets.   How does your smart contract evaluate depreciation of a property?     Denis:  Opening to RWA collateralization is important, but so is the notion of keeping Maker decentralized and without a central touch point in the “real world” — as long as Maker can not be regulated by governments, institutions and lobbyists, its position as a challenger to central banks will remain intact and hard to stop. It is therefore important, in our opinion, that any proposed solution for onboarding RWA as collateral should not push Maker to create any legal entity of any kind, as such steps could jeopardise the very essence of Maker.   Is it fair to say that if the Property defaults/goes belly up, the Maker Community will still need to have a central touch point in the “real world”?     Denis:  Blocksquare’s protocol does not require Maker to create any legal entity to onboard real estate assets as collateral. Maker governors are solely responsible to assess the risks of onboarding a PropToken as collateral via information that can be easily retrieved either directly from PropToken contracts or indirectly via Blocksquare’s API.   So, I guess you envision the Maker Community + Risk Teams reviewing the Property P&L, Cash Flow, RE Tax Returns, etc., and hope that they’re accurate based on the fact a decent bank made the loan and now the property wants to tokenize the revenue stream? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.892621527777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Denis",
                    "index": "#4",
                    "likes": "2",
                    "time": "16/11/2020-20:38:13",
                    "content": "First of all, thank you for taking the time, especially as you are one of the most active contributors on this forum.     flipflopflapdelegate:  Hey man, interesting post–TY. I guess first question–what has happen since 2017–what are your accomplishments since then? Besides the blockchain awards–have you distributed a RE product on an L1? Were you trying to build your own private chain? Or, were you just focus on building/creating the protocol, etc.   In 2017 we started our research and then got a first pilot off the ground in 2018 where we tokenized a parking spot in tech park Ljubljana (Slovenia, where our team comes from). It wasn’t perfect, but it got us off the ground I would say. After the somewhat unexpected CV award in 2019, we got a lot of inquiries, mainly shady projects that you just know something is not right  however some good companies showed up as well and we were able to work on various case studies with them, our goal was to learn and understand what the pain-points within real estate are. From a product perspective, we had an SPV structure in place to safeguard a real estate asset at the time and we soon realized real estate developers would not go forward with it. Pushed us back to the drawing board with our legal team and came up with a much more adaptable model earlier this year where a corporate resolution is used instead. You can easily apply it to any existing form of ownership. In the meantime we also developed the whole infrastructure around the concept from smart contracts, backend, API, frontend…     flipflopflapdelegate:  I believe there are many other parameters that need to be met by the borrower to get a loan–but okay–I guess it can be view as an easy process for those with a good balance sheet.   Most definitely, I was utterly simplifying the evaluation criteria. It is essentially an ongoing process where trust is earned through time and I think Maker will need to follow suit. But it would be easier for a protocol to gain trust in another protocol, that would connected them via intermediary to each issuer individually.     flipflopflapdelegate:  Cool–so, you’re doing the same as Compound RE which was taken over recently by the Republic/AngelList folks https://bit.ly/3pw810C --sort of like owning microshares of RE properties–except you’re issuing tokens versus traditional investment paper.   We offer the infrastructure and even provide a user facing web application for those without coding skills. Yes, essentially, you could also develop a Compound-like app using our API. Real estate is so localized that it is hard to imagine a single global investment platform emerging. The devil is in the details, and a lot of work is needed when it comes to due diligence, which makes it hard to scale the supply side.     flipflopflapdelegate:  What is your theory of having a hard limit of 100,000 per property? Can that number go up and down? Assuming only 10% of the offering gets filled, what happens to the 90%?   100,000 tokens essentially represent 100% of the capital stack — that’s fixed. If you plan to issue 20,000 tokens, it means you are taking in 20% of the asset’s value. The remaining 80,000 tokens are not minted. If the property was structured as i.e. 30% equity + 70% debt, you now need to restructure the capital stack to include the tokenized 20%… for instance you could do 20% equity + 20% tokenization + 60% debt. And this information goes directly in the proptoken contract for each property. The main objective here is “re-financing” the asset, not getting it off the ground. As I mention, good real estate projects will easily attract traditional financiers for both equity and debt and it is hard to compete with them. But this tokenization model offers something different to the asset owner and could take-up a slice of the pie not replace it… you can always tokenize a small portion like 2-5% and see what happens, right?     flipflopflapdelegate:  I guess the PropToken is a Security offering correct? if so, is it also available to unaccredited investors in the U.S.?   Yes, revenue sharing tokens are securities, although some jurisdiction might decide not to regulate them. In any case, their transferability needs to be managed — meaning KYC is required for each holder who can then whitelist up to 10 wallets under their name. Each individual proptoken contract is owned by an issuer and linked to a certified partner (platform operator). The CP defines under what regulatory exemptions they will be issuing securities. The CP thus works with issuers to digitize new properties and lists them on their platform. Based on user KYC information (stored off-chain), and regulatory confinements, CPs define which users can hold properties they tokenized for issuers they work with. In essence, any ethereum address can be verified if they are allowed to hold a certain token.     flipflopflapdelegate:  Does this mean there won’t be a need for an appraisal of each property?   We provision for 2 separate valuations — property valuation & token valuation. The first is conducted by licensed valuers, where an issuer would procure the information to the CP for them to update it within the proptoken contract. The second is more dynamic as it reflects valuations on secondary markets. Yes, maker could use the second for liquidations, but leverage the first as a safeguard mechanism. For instance, if token price drops too heavily in relation to the property valuation.     flipflopflapdelegate:  How does your smart contract evaluate depreciation of a property?   A property valuation is set at time of issuance and it is then updated on a quarterly, biannual or annual basis, depending on how the CP wants to manage it. In some countries banks value mortgage portfolios on an annual basis, while in others even monthly. Depreciation is part of this valuation too. Token value will follow when depreciation on real markets occurs.     flipflopflapdelegate:  Is it fair to say that if the Property defaults/goes belly up, the Maker Community will still need to have a central touch point in the “real world”?   Good question. What is the recourse when a project with an ERC20 token defaults/goes belly up? Maker, as it is now, does not provide financing for ICOs, but only accepts established tokens as collateral. It should be the same case with RWA. I think the ability to use RWA tokens as collateral should be an enhanced feature for the token holder, and not a way for the token issuer to raise funds. Otherwise, let’s open up collateralization to any team with an ERC20 token out there  — I honestly don’t think it would end well, and I don’t know why doing it with tokenized RWA would yield better results.     flipflopflapdelegate:  So, I guess you envision the Maker Community + Risk Teams reviewing the Property P&L, Cash Flow, RE Tax Returns, etc., and hope that they’re accurate based on the fact a decent bank made the loan and now the property wants to tokenize the revenue stream?   A tokenized real estate property needs to first establish itself on the market, just like a crypto project does, then it can become accepted as collateral by Maker. The token will have a track-record of cashflows, trades, token holders, token valuations, property valuations before the risk team will evaluate it. And yes, if the issuer has a good track record with enough tokenized assets, then Maker could expedite the onboarding process or even consider opening the debt ceiling directly. What we’ve built is a protocol that simplifies the assessment process for token investors, because issuers are bound to pay royalties on top-line revenues and not bottom-line profits. For those who wish to go more in depth, information on the underlying asset is readily available on-chain and even more can be retrieved off-chain via API. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.839897382595401
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Denis",
                    "index": "#5",
                    "likes": "0",
                    "time": "16/11/2020-20:42:59",
                    "content": "Thanks! I mean, as soon as you get into regulated waters, I see things like KYC and AML stepping in. Its something we’ve been dealing with a lot… I really don’t want DAI going in that direction, especially with cash fading away and no real “stable” alternative offering financial privacy around… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.03125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptouf",
                    "index": "#6",
                    "likes": "0",
                    "time": "16/11/2020-23:12:07",
                    "content": "Maybe a very naive question. But how is it different compare to RealT ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0249999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Denis",
                    "index": "#7",
                    "likes": "2",
                    "time": "17/11/2020-11:12:37",
                    "content": "Hi @Cryptouf, great question, and not naive at all by any means. RealT is a great example of a platform connecting investors to real estate opportunities. Their business model is to perform due diligence on projects they receive into their pipeline, and market them to interested investors. With our infrastructure you can build a similar platform without coding skills, or create your own interfaces via API. Blocksquare in this sense aspires to be for real estate tokenization, what shopify + stripe are to e-commerce — anyone can launch an online shop. Here’s some screenshots of the prebuilt white-label platform for your reference: 1600×900 271 KB 1600×901 164 KB From a tech perspective, I’m unfortunately not able to look into it more as the contract code on etherscan is not verified, but RealT seems to be using contracts where tokens are not devisable — they need to be purchased in full. Dividend payouts seem to happen daily. Probably they make a deposit to a contract that then makes those distributions to token holders. Although I’m not sure how gas intensive this process is, the problem of token tradability & dividend distributions can also be solved in other ways. For instance Blocksquare runs an off-chain module that accounts for each trade, holder, and timeframe to correctly determine revenue distributions for a give time period. The total distributed amount is then visible on-chain and distributed in DAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.96875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "4",
                    "time": "17/11/2020-15:01:40",
                    "content": "Okay–now I’m starting to see the full picture. Can you walk us thru on how you avoid a scammer listing a property in Brooklyn that he/she does not own? As example, say I am the scammer and I list an Apartment located in quaytowerbk.com ( fancy pants building) – I fabricate fake documents–how does Blocksquare determine that the deed and title are fake? Actually–let’s make it harder, I do the same for an apartment in a fancy pants building in Lima, Peru. Just trying to get an idea of how you weed out exploits, from folks who have done  it the old-fashioned way–by creating fake documents and pulling the wool over peoples eyes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.03125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptouf",
                    "index": "#9",
                    "likes": "0",
                    "time": "17/11/2020-16:37:03",
                    "content": "    Denis:  Hi @Cryptouf, great question, and not naive at all by any means. RealT is a great example of a platform connecting investors to real estate opportunities. Their business model is to perform due diligence on projects they receive into their pipeline, and market them to interested investors. With our infrastructure you can build a similar platform without coding skills, or create your own interfaces via API. Blocksquare in this sense aspires to be for real estate tokenization, what shopify + stripe are to e-commerce — anyone can launch an online shop.   Ok thanks a lot. So basically in you case, i have to buy the house/flat and then tokenise it. And then put it on your website. So i have to find the money , sign contracts… So it’s clearly not like RealT. I don’t know if you are aware of it, but vave (https://vave.io/) is doing the same thing. But please be extra cautious. I think this company is a scam. SO it’s more for the principal. Not to promote it. BTW: they use MakerDAO , and pretend to colaborate (after checking , it’s not the case)     Denis:  From a tech perspective, I’m unfortunately not able to look into it more as the contract code on etherscan is not verified, but RealT seems to be using contracts where tokens are not devisable — they need to be purchased in full. Dividend payouts seem to happen daily. Probably they make a deposit to a contract that then makes those distributions to token holders. Although I’m not sure how gas intensive this process is, the problem of token tradability & dividend distributions can also be solved in other ways. For instance Blocksquare runs an off-chain module that accounts for each trade, holder, and timeframe to correctly determine revenue distributions for a give time period. The total distributed amount is then visible on-chain and distributed in DAI.   Can speak for them, but i think they changed some aspect of that recently because gas was too expensive to send dividend payout everyday. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.73076923076923
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Denis",
                    "index": "#10",
                    "likes": "2",
                    "time": "17/11/2020-18:48:51",
                    "content": "@flipflopflapdelegate Thnx for expanding the conversation with additional questions.     flipflopflapdelegate:  Can you walk us thru on how you avoid a scammer listing a property in Brooklyn that he/she does not own? As example, say I am the scammer and I list an Apartment located in quaytowerbk.com ( fancy pants building) – I fabricate fake documents–how does Blocksquare determine that the deed and title are fake?   Before I explain further, I need to make clear that Blocksquare is built as a permissioned system. This means we require KYB & KYC process before we grant access to any client. This company will work with issuers and perform due diligence on them. In the above case, Blocksquare would have a contractual agreement with a US based company, preferably registered as a “funding portal”. The US based client company and its executive board will essentially define their criteria for both supply (properties) and demand (end-user investors) requirements. How they perform due diligence on issuer companies and their properties before listing them will be very important in the long term relationship they wish to build with their end-users—the investors. If they let an issuer with fake ownership documentation pass through, that might kill their business. For comparison, real estate crowdfunding platforms like to highlight their due diligence process. Based on our research, roughly 5% of deals pitched to a crowdfunding platform get posted. On some platforms I’ve seen the acceptance rate fall even further to smth like 2-3%. Does this mean only the best deals on the market make it through? Unfortunately not. It only suggests that the majority of projects looking for financing via crowdfunding are poor.     flipflopflapdelegate:  Actually–let’s make it harder, I do the same for an apartment in a fancy pants building in Lima, Peru. Just trying to get an idea of how you weed out exploits, from folks who have done it the old-fashioned way–by creating fake documents and pulling the wool over peoples eyes.   And this is precisely why we just can not imagine a one-to-rule-them-all platform can emerge in the short term. I am able to do due diligence for real estate I invest in in Slovenia, but when I go to e.g. Austria or Italy I already have a problem. This is the bottleneck that prevents you to grow the supply side across countries and continents — it’s just too diverse. We even partnered with Deloitte for due diligence, but on our clients. In the above example, the apartment in Lima would be processed and listed by a client operating a platform in Peru or South America. Before doing business, we would need to verify incorporation documents, identities of legal representatives etc., but because our team would not be able to fully assess the company internally, we would outsource it, hence Deloitte. Our goal is to help launch legitimate businesses, but at the end of the day, you can never be 100% sure and all you can do is take best measures to prevent bad situations. Blocksquare provides the infrastructure—a platform to power other platforms if you will. 1600×901 214 KB ",
                    "links": [
                        "https://www.finra.org/registration-exams-ce/funding-portals/how-apply-new-funding-portal",
                        "https://www.realtymogul.com/knowledge-center/due-diligence"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.053618421052631
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#11",
                    "likes": "1",
                    "time": "17/11/2020-19:00:36",
                    "content": "Thank you for the answers to my questions @Denis – the more you explain your vision and goals—the more eye opening it becomes. Agree—there’s always risk—it happens to the best of them. Thanks again! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Denis",
                    "index": "#12",
                    "likes": "0",
                    "time": "17/11/2020-19:01:41",
                    "content": "Thank you @Cryptouf     Cryptouf:  Ok thanks a lot. So basically in you case, i have to buy the house/flat and then tokenise it. And then put it on your website. So i have to find the money , sign contracts… So it’s clearly not like RealT.   Essentially, we differentiate between two legal entity types—certified partners and issuers. Partners are clients who operate a portal/platform, have access to the system, and are allowed to tokenize properties for issuers. Issuers on the other side are the clients of certified partners and actually own and manage listed properties. I’m familiar with Vave and have been following their progress. I think they have an interesting proposition where you invest with another person like with syndication. What has lead you to believe they might not be legitimate? But yes, giving out a statement you are working with Maker…     Cryptouf:  Can speak for them, but i think they changed some aspect of that recently because gas was too expensive to send dividend payout everyday.   Makes sense to change yes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.576923076923077
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Denis",
                    "index": "#13",
                    "likes": "2",
                    "time": "17/11/2020-19:06:31",
                    "content": "A pleasure @flipflopflapdelegate. If anything new comes to mind, please don’t hesitate to bring your questions forward. I would actually like to steer the conversation into the topic of how we could make this work with Maker. From our perspective, it would add immense value to our protocol, but it would be even more awesome if the benefits would be reciprocal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.636363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptouf",
                    "index": "#14",
                    "likes": "1",
                    "time": "17/11/2020-20:23:43",
                    "content": "    Denis:  I’m familiar with Vave and have been following their progress. I think they have an interesting proposition where you invest with another person like with syndication. What has lead you to believe they might not be legitimate? But yes, giving out a statement you are working with Maker…   A lot of things ^^ can send you a pm if you want to know. don’t want to speak about that on your topic ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#15",
                    "likes": "2",
                    "time": "17/11/2020-22:21:04",
                    "content": "Thank for you great post. Currently, RWA are thought as B2B relationships (we deal with the asset originator, only one borrower per vault, heavy oversight) while crypto vaults are B2C (anyone can get a loan from the collateral). RWA are defined as illiquid while crypto assets are defined as quite liquid and easy to liquidate on the market. RWA are usually managed (asset originator) by a third party through a SPV so we can have both scale,  diversification and lower risk (due to the equity part). Not sure where this proposal fit. Seems like a bit of both (not that it can’t be). Revenue-based model It is my understanding that royalties models are strictly more risky than lending. You take more risk but expect revenue to increase (cash flows are put in the future). In real estate, rent is quite stable. I would expect the yield of such instrument to be higher than the cap rate of the property. If the property is not let, you don’t make a buck. And you don’t get the property price increase. So the yield expected from this investment is higher than net rent / property value. Let’s take your example and let’s say the property doesn’t yield a dime. The property owner can’t repay its loan and the lender take custody of the property. The resell value is also and issue. How do you sell a property with a royalty contract on it? How do you make royalty owner to sell their right? Your instrument is basically tokenizing the fructus of the property. This exists with time limits but is not widespread. Do you have a contract sample? Liquidity / Scale If I understand correctly, each property has a different token. Therefore, liquidity is thin. On-chain liquidations are almost impossible if you have 50% of a property and you need to sell in a day. I don’t think you will get $1M volume per day. How should a liquidation work? There is no developed off-chain market for revenue-based real estate neither (at least currently). So Keeper can’t arbitrage quickly. The lack of diversification also raises the issue of idiosyncratic risks (but I fully agree that a token like YFI or COMP is more risky on that front). ",
                    "links": [
                        "https://forum.makerdao.com/t/rwa-resena-de-los-ultimos-dos-meses-actualizaciones-y-lo-que-viene/5272",
                        "https://forum.makerdao.com/t/rwa-last-2-months-review-updates-and-looking-forward/5225"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.398399014778326
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#16",
                    "likes": "1",
                    "time": "18/11/2020-01:26:20",
                    "content": "    Denis:  Real estate is the biggest asset class in the world. At the same time it’s also one of the most illiquid investments you can make.       SebVentures:  f I understand correctly, each property has a different token. Therefore, liquidity is thin. On-chain liquidations are almost impossible if you have 50% of a property and you need to sell in a day.   I’m sure @Denis has a better answer–but, for sure–this will be an illiquid asset–more than likely we will have to go to court to get a claim/recoup the DAI Loan. All in all a lot of good questions Seb! Looking forward to the response from Denis ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.754166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Denis",
                    "index": "#17",
                    "likes": "2",
                    "time": "18/11/2020-13:54:11",
                    "content": "@SebVentures thank you and thank you for your input     SebVentures:  Currently, RWA are thought as B2B relationships (we deal with the asset originator, only one borrower per vault, heavy oversight) while crypto vaults are B2C (anyone can get a loan from the collateral).   I like the way you explain it with B2B vs B2C. As you point out, Maker is currently in the B2C lending business where it takes crypto assets as collateral. While one might think that extending from B2C to B2B is easy, I think it is a whole different ball game. If Maker wants to extend its operations towards B2B, shouldn’t it first do so with crypto assets — assets Maker is already familiar with? At the same time, if Maker wants to go into RWA, shouldn’t it remain in the B2C mode of operations at first and transition to B2B only later-on, when things become more clear and the frictions with RWA better understood?     SebVentures:  RWA are defined as illiquid while crypto assets are defined as quite liquid and easy to liquidate on the market.   I agree, but only in part. In terms of tokenization, the RWA a token is associated with is defined as illiquid, true, but the token itself should have market demand, therefore liquidity, although limited and not instant, otherwise, what is the point of tokenization in the first place? RWA like real estate sometimes spend years on the market before a liquidity event occurs. If a portion of such asset can be bought and sold in a matter of days, tokenization already improves drastically its liquidity. On the other hand, a crypto asset is perceived as very liquid, and it will remain so as long as the service or product it is designed for creates value. But, once this is gone, demand will drop and liquidity will thin out. What happens when an ERC20 locked in the Maker protocol drops in value because the project suddenly fails? Vaults will be liquidated and no keeper will bid for a token they can not re-sell on the market. Will Maker then engage directly with the team (asset originator) behind the token and take legal measures? Why should RWA be treated any different?     SebVentures:  RWA are usually managed (asset originator) by a third party through a SPV so we can have both scale, diversification and lower risk (due to the equity part).   But, will Maker and its stakeholders have a real legal claim on the SPV and the assets it holds? I don’t see why crypto and real world assets should be approached by Maker so differently. While for crypto assets Maker “blindly” relies on the efforts of others developing a token project, without any legal repercussion in pace if it fails, while for RWA there is this sudden need for “control”. The reality is that crypto assets are also managed by legal entities incorporated in various forms who work on the product and try to make it work and bring value to the token. More often than not token projects never make it to a decentralized governance structure, and even if they do, failure is way more probable than success.     SebVentures:  Not sure where this proposal fit. Seems like a bit of both (not that it can’t be).   Neither do I  But, Maker is a B2C lending platform and its control lies in the ability to diversify collateral, not becoming involved in the origination of it. If a protocol like Blocksquare’s would become accepted, each real estate project would get a debt ceiling of how much can be locked in at a certain moment. In time, there would be 1000s of real estate properties managed by 100s of issuers with an on-chain track record = diversification of risk. Maker would only be required to manage on-chain risk factors, while off-chain risk like fraud would be effectively outsourced to Certified Partners, companies that offer real estate tokenization services to issuers and list them on their marketplaces. CPs are essentially marketplaces or “funding portals” with a legal footing in the real world — they serve as a trusted party between issuers and investors. Some will require the issuer to sign additional documents before listing, some will have business insurance policies in place… whatever will offer more certainty for end-users — the people and business that invest in deals listed on a CP’s platform.     SebVentures:  It is my understanding that royalties models are strictly more risky than lending. You take more risk but expect revenue to increase (cash flows are put in the future). In real estate, rent is quite stable. I would expect the yield of such instrument to be higher than the cap rate of the property.   Subordinated and unsecured loans are risky too, but yes, the revenue based model takes in a higher risk factor. That’s why investors are exposed also to the potential value appreciation of the asset. Senior loans are less risky, but still, it is a borrower’s ability to repay their debt that is important to a lender, not how much the collateralised assets are worth. The higher risk when investing through a revenue based asset token in the real estate context exposes the investor to both asset appreciation/depreciation + revenues (NAT). All revenues are included, both revenues from lease agreements and revenues that a potential resale of the property might generate. In the latter case, any outstanding senior debt would need to be closed first, followed by royalties owed to token holders. In this sense the risk with the revenue based model is lower compared to an equity position, but higher than debt. On the other side a lender is not exposed to the potential appreciation of the underlying asset.     SebVentures:  If the property is not let, you don’t make a buck. And you don’t get the property price increase. So the yield expected from this investment is higher than net rent / property value.   If the property is without revenues, you don’t make a buck, true, but you are also not responsible to keep it afloat. Remember, the issuer will in most cases have a higher stake than a token holder does. Their goal is to maximise revenues. In any case, the token still holds the value of the property even without recurring revenues. Thus you could use the protocol to tokenize real estate assets the do not generate recurring yields, for instance land.     SebVentures:  Let’s take your example and let’s say the property doesn’t yield a dime. The property owner can’t repay its loan and the lender take custody of the property. The resell value is also and issue. How do you sell a property with a royalty contract on it? How do you make royalty owner to sell their right?   For instance a property that generates 70,000 USD per year and valued at 900,000 USD is resold for 1,000,000 USD to a 3rd party. 10,000 tokens have been issued and the smart contract + corporate resolution (the whole agreement) define that 70% of all recurring revenues, but 100% of revenues from a sale to a 3rd party shall be directed towards token holders where the revenue share for a single token is 1:100,000. For each token, the issuer would be expected to pay the token holder 0.49 USD per year; As a resale event occurred, the issuer is as per the corporate resolution required to buyback the 10,000 tokens in exchange for 10% of the 1,000,000 USD sale price i.e. 100,000 USD. A clause is included in the corporate resolution to protect token holders when the opposite occurs — for instance if a resale below market value takes place. This clause states that the issuer is required to buyback tokens at a minimum valuation that matches the highest price ever payed for a token through a direct sale from issuer to investor.     SebVentures:  Your instrument is basically tokenizing the fructus of the property. This exists with time limits but is not widespread. Do you have a contract sample?   Exactly, the time component is “defined” by the token — right/obligations stand as long as there are tokens in circulation. While the essence of the “fruits” are defined in the corporate resolution — any and all revenues net after taxes deriving from a defined real estate asset. I’ll have the team deploy a sample on Kovan and share it tomorrow. It will include both an example of the smart contract and corporate resolution.     SebVentures:  If I understand correctly, each property has a different token. Therefore, liquidity is thin. On-chain liquidations are almost impossible if you have 50% of a property and you need to sell in a day. I don’t think you will get $1M volume per day. How should a liquidation work? There is no developed off-chain market for revenue-based real estate neither (at least currently). So Keeper can’t arbitrage quickly.   That’s a good point. Liquidations will not be instant. But at the same time there won’t be as many liquidations in the first place due to higher price stability. The idea is to set up liquidity pools for each property but there won’t be much incentive for LPs to engage. That’s where BST can come in handy to incentivise them — a certain % (fee) of collected DAI at each issuance is used to buy & burn BST to create scarcity. I’ll be honest with you here, we still haven’t figured out the exact model, and I’m wide open to suggestions. Functional liquidity pools would be the back-bone of liquidity for PropTokens, however, KYC is a limitation that should be accounted for. There are ways to get around it though — a natural or legal person that successfully went through KYC could set up a smart contract designed as a proxy/pool and have it whitelisted as one of their “wallets”.     SebVentures:  There is no developed off-chain market for revenue-based real estate neither (at least currently). So Keeper can’t arbitrage quickly. The lack of diversification also raises the issue of idiosyncratic risks (but I fully agree that a token like YFI or COMP is more risky on that front).   There are marketplaces operated by crowdfunding websites, but mainly these are debt or equity offerings. With our solution there is an increased transparency for revenue payouts that is otherwise not present. It creates a track record that is measurable and can be relied upon for projecting future revenues. The risks an investor faces can be mitigated by means of diversification. An investor can get exposed to various real estate assets across issuers and geographies. Instead of going into one single deal you can distribute your capital over a portfolio of many properties. Same would go for Maker — one protocol to be on-boarded, but that protocol could bring asset diversity and distribution of risk. At first each asset would be manually approved for B2C collateralisation, but in time and with the on-chain information available, risk evaluation models for debt ceiling automation could be created that take into consideration on-chain data like the asset’s country, geo location, type, issuer, capital stack structure, token holder distribution, revenue distributions, secondary market activity, liquidity pools… the core function of the model would be to manage the cumulative risk for Maker as a whole, while at the same time growing the locked in value. @SebVentures Hope I managed to answer some of your questions. I read through some of your posts on Medium, and I’d love to get on a call sometime. Let me know. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5603371783496005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Denis",
                    "index": "#18",
                    "likes": "1",
                    "time": "20/11/2020-13:03:06",
                    "content": "Hi @SebVentures, @flipflopflapdelegate, @Cryptouf & Co     SebVentures:  Do you have a contract sample?   Here’s a sample proptoken contract on Kovan as promised so we can start looking a bit more in-depth. Main component to the proptoken contract is the corporate resolution that is publicly uploaded to IPFS. The hash of the token contract is included in the legal doc, while the IPFS hash of the signed resolution.pdf is recorded within the proptoken contract — so now they work jointly as one. Proptoken sample contract address: https://kovan.etherscan.io/address/0x07F5435a129e29ed2240a4C3a7e28bA423715214 The legal contract sample (corporate resolution) can be viewed on: https://gateway.pinata.cloud/ipfs/QmU5rLSPknsRzecQFTthzYwqr4f1N2bkxJVA86uLtAs4XG As you can see in the sample, the main version is always in english, while a 2nd language is also provisioned for. For instance, in the case of a German-based issuing company, the second language would be German. image1080×1144 257 KB The goal of our legal team was to create a legal document that can be taken by any legal entity — corporate resolutions (sometimes also called Decisions) are ideal as they are always taken by the board. The template we created gives token holders defined “economic” rights, defines the issuer’s obligations and limitations, while still keeping it simple so most investors can understand it. It is important to state that the corporate resolution does not address the exact process of how the tokens shall be sold. The issuer-to-investor sale process should therefore be defined in the terms of service of the platform that will execute and offer the investment. If the exchange is done via smart contract e.g. DAI for BSPT, the need for a “token purchase agreement” is basically obsolete. The creation process of a proptoken contract is done through a Property Factory contract, so Etherscan will recognize the source code and tag it as “similar match” for each newly created proptoken contract, while a Property Registry is in place where property data is stored and can be read from for each proptoken contract: https://kovan.etherscan.io/address/0x3e7847e279ce072e8e94075d4fd0734b9bac4587 As you can imagine, a proptoken contract can also relate to multiple real estate properties. In the above example, where a shopping mall is tokenized, there is 1 big building that spans over 12 land plots with various parcel numbers. image1572×1202 273 KB This info can be retrieved from the Property registry contract by inputing the proptoken address and property index 0, 1, 2, 3… for instance, the sample proptoken relates to 13 various properties. image1414×894 67.2 KB The propertyValuation part is defined in the basic info, where the street address and geo locations are also recorded. The tokenValuation on the other side is stored in the proptoken contract itself. While the property valuation will be updated by CPs depending on real world valuation models on a quarterly, biannual or even annual basis, the tokenValuation can be updated regularly using token valuation models.     Denis:  Each PropToken also has the ability to store information about its valuation, split into two categories: 1. Property valuation, and 2. Token valuation. Both values can be updated through oracles. Blocksquare has developed a token valuation model that listens to transactions that occur via DEX protocols like 0x or Uniswap, and takes into account volume, price, property valuation and circulating supply.   The rights to update these valuations are assigned through a “roles” contract, where admin and similar roles are provisioned for. image1318×634 59.3 KB ",
                    "links": [
                        "https://gateway.pinata.cloud/ipfs/QmU5rLSPknsRzecQFTthzYwqr4f1N2bkxJVA86uLtAs4XG",
                        "https://kovan.etherscan.io/address/0x3e7847e279ce072e8e94075d4fd0734b9bac4587",
                        "https://kovan.etherscan.io/address/0x679a0f605d33cd6c24d21acf248b2f799bf10e26#code"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.632760879471405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#19",
                    "likes": "1",
                    "time": "20/11/2020-20:36:34",
                    "content": "Thank you for providing the sample Denis. Are the early deals going to be based in Slovenia, or will you look to attract deals from major EU cities? Or perhaps both. I guess one of my concerns is–how do we determine (Maker and Blocksquare) that documents are not forged? Trying to get a feeling of how you thought of avoiding real-world exploits and what the thought process has been for your Team. Thanks in advance Denis! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Denis",
                    "index": "#20",
                    "likes": "2",
                    "time": "21/11/2020-09:16:54",
                    "content": "@flipflopflapdelegate     flipflopflapdelegate:  Are the early deals going to be based in Slovenia, or will you look to attract deals from major EU cities? Or perhaps both.   As we position ourselves as the infrastructure provider, our goal is to help launch a couple of platforms that will either list their own real estate or real estate of other projects. Geografically speaking, we have no real limitations and can launch platforms for any jurisdiction. The per property & issuer due diligence will in essence be conducted by the Certified Partner - the company that operates the platform with services to grow supply and demand side (origination & investors). If we are looling at single tokenization deals, for instance, in the US we have a good relation with a property developer that specializes on self-storage facilities. They have been peaking into the tokenization topic for more than a year now, and they are now becoming more confident to actually proceed with a test case. They are offering a USD 20 million facility to start with and if we were to combine our efforts in collaboration with Maker, it could serve for a great pilot case.     flipflopflapdelegate:  I guess one of my concerns is–how do we determine (Maker and Blocksquare) that documents are not forged? Trying to get a feeling of how you thought of avoiding real-world exploits and what the thought process has been for your Team.   When a company wants to launch a platform we conduct due diligence on the CP. When a CP onboards a new Issuer, we perform a KYB check with our partners. When a CP tokenizes a property for an Issuer, the CP also conducts their due diligence before offiring the asset to their investor base (registered end-users). Verification is thus multi layered. Maker could decide later on if the real estate property the CP & Issuer have tokenized shall be accepted as collateral. Basically, when looking at each induvidual tokenization, we “outsource” the origination process to the CP is the 1st line of verification; then we “crowdsource” the due diligence to investors and that is the 2nd line of verification (investors take a look at each deal available on the platform and then decide to engage or not); 3rd line of verification is where Maker and Blocksquare would collaborate to assess eligibilty for collateralization on Maker by looking at all the readily available on-chain information but also also off-chain data that can give us answers like how many unique token holders there are by looking at anonymized KYC data. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.871239177489178
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#21",
                    "likes": "2",
                    "time": "21/11/2020-16:34:22",
                    "content": "Thank for this post @Denis. Few questions from my side.     Denis:  100,000 tokens essentially represent 100% of the capital stack — that’s fixed. If you plan to issue 20,000 tokens, it means you are taking in 20% of the asset’s value. The remaining 80,000 tokens are not minted. If the property was structured as i.e. 30% equity + 70% debt, you now need to restructure the capital stack to include the tokenized 20%… for instance you could do 20% equity + 20% tokenization + 60% debt. And this information goes directly in the proptoken contract for each property.   Why did you choose such a tokenized structure because I for me it doesn’t work well unless I am missing something. For instance, how can 20.000 tokens represent 20% of assets value, if capital stack can consist of different levels of debt/capital seniority. For instance if you tokenize 20% of asset value in equity, this doesn’t necessarily mean you are entitled to 20% of the returns, since senior creditor gets to collect agreed payouts first? What I am trying to say is that different levels of capital stack can’t be entitled to a predefined share of payout, especially in a scenario where you sell RE for a price below senior debt.     Denis:  While for crypto assets Maker “blindly” relies on the efforts of others developing a token project, without any legal repercussion in pace if it fails, while for RWA there is this sudden need for “control”.   As stupid as it may sounds, crypto assets can weirdly have a value even there is nothing to claim for by holding them. How Dogecoin can still have 0.5bn market value was always unclear to me. But apparently there is enough speculators providing bids on one side of orderbook which makes currency valuable at that time even if it is just “thin air”. On the other side, RWA need to have a real claim, either a property or a cashflow. RWA just can’t have the same speculative value crypto currencies can have. Which brings me to a question if tokens have any sort of a control at all? Am I as a token holder holding majority of equity able to influence an issuer or originator (not sure which party controls asset in real world) and force him to sell real estate? Or am I only counting on his best efforts to always maximize yield for me because he has some kind of stake as well? Also how are royalties collected by token holders, is there some sort of dividend payout? Asking mostly because collateral asset that are currently in Maker don’t receive cashflows and new implementation is needed. We might though soon onboard first asset that might have this implementation, which is CropJoin cUSDC and other farm tokens such as UNI LPs. In this implementation vault users will be able to claim rewards/cashflows for the collateral position they hold. In case there isn’t a liquid market to sell such token how am I able to redeem it if I am only minority equity holder? I guess the idea here is to be locked inside long term or hope liquid market is established at some point to exit out of the position? Or will originator always have liquid funds available from royalties to make buyouts under certain terms? Related to KYC where asset can only travel between KYC addresses, would this create a problem if asset is deposited as collateral to Maker which can not be KYCed? Not sure if that is even needed because asset is just deposited as collateral, Maker isn’t really entitled to economic rights until liquidated. But asking just in case. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.217515557359307
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptouf",
                    "index": "#22",
                    "likes": "1",
                    "time": "21/11/2020-20:06:36",
                    "content": "thanks @Denis. Now I need to read that carefully ^^ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Denis",
                    "index": "#23",
                    "likes": "0",
                    "time": "23/11/2020-14:09:41",
                    "content": "Hi @Primoz, thank you for looking into this pre-MIP discussion post. Appreciate your input!     Primoz:  Why did you choose such a tokenized structure because I for me it doesn’t work well unless I am missing something.   The idea was to standardize the amount of tokens that can ever be issued through a proptoken contract. 100,000 BSPT-XXX-### is a hard cap on the total possible supply, however, in most cases only a portion will ever be minted.     Primoz:  For instance, how can 20.000 tokens represent 20% of assets value, if capital stack can consist of different levels of debt/capital seniority. For instance if you tokenize 20% of asset value in equity, this doesn’t necessarily mean you are entitled to 20% of the returns, since senior creditor gets to collect agreed payouts first?   In the example you make, 20.000 tokens represents 20% of the assets value (not equity) and 20% of any and all revenues (Net After Taxes) multiplied by the percentage of revenues (royalties) as defined by the corporate resolution and stored within the Proptoken contract itself. The remaining 80% of the capital stack are occupied by other tranches such as equity and debt. The debt portion has seniority over the equity portion, while the tokenized revenues have essentially seniority over the debt financier, or at least in part. Let me explain: The royalty is being paid out solely based on the revenues the real estate asset generates, meaning the the issuer is required to pay royalties to token holders as soon as revenues are generated. Token holders thus have ‘senior ranking’ vs the lending institution in terms of cash-flow to any debt this institution provides. I said in part in my previous paragraph because the conditions under which the bank loan was given will most probably challenge the seniority in case of default — In Chapter II paragraph 3, the corporate resolution defines the buyback process and the issuer’s obligations in cases like a sale of the asset to a 3rd party (when this 3rd party does not transfer the corporate resolution), however achieving seniority over a banking institution is, in our view, hard if not even impossible to achieve.  1. In the absence of legal provisions and/or prohibitions the resolution may only be withdrawn insofar as all the active (existing) shareholders agree therewith and provided that the special condition precedent is met, namely that in case of a resolution withdrawal, the Company shall irrevocably be bound to repurchase any and all digital tokens in circulation, related to the Real Estate (according to the “Squeeze out” principle or mutatis mutandis thereof). The minimum repurchase price for each token shall be equal or higher than the highest price of a token at which the Company has ever offered or sold tokens.      Primoz:  What I am trying to say is that different levels of capital stack can’t be entitled to a predefined share of payout, especially in a scenario where you sell RE for a price below senior debt.   Well, in essence they are entitled to a predefined amount, right? With debt the lender defines an interest rate that the borrower must pay and if they don’t the loan defaults. The interest rate might be fixed or not, and how it gets calculated might also have some variations, but in essence that’s a predefined cost that will take away a portions of the revenues. With equity, profits get distributed as dividends based on performance, so here the share of payouts is less defined and can easily be manipulated by the management and their decisions. With revenue based financing, the asset owner is required to make payments when it is producing and generating revenue. To make it possible for multiple tranches to co-exist, the Proptoken contract & corp. resoltion provision for a ‘Royalties percentage’ that the asset originator can use to define the amount of revenues they project can be appropriated. When you then combine this % with the amount of tokens that are being issued + the price for which the tokens are being sold to investors, the asset originator has enough flexibility to find the best ratio to offer a good financing deal for both their operation and the token investors.     Primoz:  As stupid as it may sounds, crypto assets can weirdly have a value even there is nothing to claim for by holding them. How Dogecoin can still have 0.5bn market value was always unclear to me. But apparently there is enough speculators providing bids on one side of orderbook which makes currency valuable at that time even if it is just “thin air”. On the other side, RWA need to have a real claim, either a property or a cashflow. RWA just can’t have the same speculative value crypto currencies can have.   The value of network effects startles me as well  …and also where most of the value in crypto assets actually resides today. As you well point out, with RWA that is not the case — except perhaps with iconic RWAs that could attract and capture network effect value, for instance, if the City of Paris, who owns the Eiffel Tower, would decide to tokenize it. I’m sure “Eiffelcoin” would trade at prices well above anything that would correlate with a traditional valuation model for RWAs or the revenues it might generate. But, most RWA are not the Tour Eiffel and they won’t have any price appreciation due to network effects. The investor thus needs a real claim towards the underlying asset. If we consider that issued tokens will in most cases represent only a portion of the asset, we can assume the issuer will always hold an equity stake — the higher the equity part, the higher the stake. On the other side of the sandwich, there will probably be a debt provider like a bank. The token holder is thus somewhere in the middle, just like mezzanine or a subordinated debt providers. These loans may be secured or unsecured and in case of default, the lender would be paid just before shareholders — assuming there are assets to distribute after all other liabilities and debts have been paid. Is this real claim to the underlying RWA as secure as one would hope? No, but then again, the same positions are regularly taken without tokenization. So how would tokenization be able to provide more security to investors? The Proptoken model will thus work best when 1) the originator has enough skin in the game and/or 2) where a senior lender oversees the RWA originator. The token investor can always choose how much to allocate for each RWA and thus invest over different issuers and assets.     Primoz:  Which brings me to a question if tokens have any sort of a control at all? Am I as a token holder holding majority of equity able to influence an issuer or originator (not sure which party controls asset in real world) and force him to sell real estate? Or am I only counting on his best efforts to always maximize yield for me because he has some kind of stake as well?   The revenue based asset tokenization model we propose finds similarities in Revenue royalties, as developed, researched and analysed by well-known Wall Street investment banker and institutional broker Arthur Lipper, where he defines revenue royalties as “a useful alternative to equity and debt in selected situations.” Proptoken holders do not hold equity, and thus do not have any say in the management of the asset, but merely benefit from the asset’s revenues or potential sale of the asset to a 3rd party buyer. The legal base of the Proptoken model is simple and does not provide any more security to an investor then an unsecured mezzanine loan for instance. On the other hand, a retail investor can quite easily increase their security with portfolio diversification across different issuers and assets. However, important to note, that the absence of additional security in the Corporate resolution itself does not exclude the ability of a Proptoken holder, probably with substantial holdings, to negotiate with the asset originator extra provisions that would grant additional rights, for instance, directly securing the payment obligations against the asset for a time frame of e.g. 99 years. In the context of Maker, MKR holders could appoint a trusted 3rd party with a legal footing to exercise these additional rights in name of Maker due to its decentralized nature. This 3rd party might be required to stake a defined amount of crypto assets as reassurance on delivery, should these additional measures come into action.     Primoz:  Also how are royalties collected by token holders, is there some sort of dividend payout? Asking mostly because collateral asset that are currently in Maker don’t receive cashflows and new implementation is needed. We might though soon onboard first asset that might have this implementation, which is CropJoin cUSDC and other farm tokens such as UNI LPs. In this implementation vault users will be able to claim rewards/cashflows for the collateral position they hold.   An issuer distributes revenues to proptoken holders via a “revenue distribution contract”. They are required to define the token address for which revenues are being distributed + the time period for which the distribution is being done (start & end date). Because tokens can be traded, the share of revenues each token holder receives should account for both the amount and time an address holds tokens. To make life easier, a simple call to our API does the trick. In the context of Maker, and depending on user preferences, the implementation could also provision for a vault owner to have their revenues deposited directly into the vault to automatically pay off a portion of the debt recorded in it with DAI.     Primoz:  In case there isn’t a liquid market to sell such token how am I able to redeem it if I am only minority equity holder? I guess the idea here is to be locked inside long term or hope liquid market is established at some point to exit out of the position? Or will originator always have liquid funds available from royalties to make buyouts under certain terms?   Good question. We bet on Certified Partners to work towards getting a good number of end-users (investors) on their portals/platforms, where p2p trading is offered as one of the features. However, the liquidity there will remain very limited, albeit much better if compared to anything currently available in terms of real estate investments. Expecting an originator to always have liquid funds might not be possible, however, expecting them to allocate a portion of an issuance towards a liquidity pool should be possible. To increase liquidity, the idea is to set up liquidity pools for each Proptoken, but with limited volumes, the transaction fee incentive for LPs will be too low. Therefore, another way to incentivise LPs is required, for instance, by introducing a reward token. So far, we have minted only 5% of the BST supply, meaning we can program a distribution schedule, for example — mint new BST to LPs based on the amount of liquidity an LP provides vs liquidity in all Proptoken pools (rewards), while on the other side buy and burn BST market supply at each issuance with collected fees.     Primoz:  Related to KYC where asset can only travel between KYC addresses, would this create a problem if asset is deposited as collateral to Maker which can not be KYCed? Not sure if that is even needed because asset is just deposited as collateral, Maker isn’t really entitled to economic rights until liquidated. But asking just in case.   Good question. When developing the smart contract system we provisioned for the ability to whitelist certain addresses, for instance a liquidity pool and account for this in revenue distributions. In short, KYC should not be a problem, while we could also create a portal for Proptoken vault creation and management. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.511204589329589
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#24",
                    "likes": "3",
                    "time": "23/11/2020-15:02:46",
                    "content": "@Primoz, @Cryptouf, @flipflopflapdelegate, @SebVentures, and the others, @Denis will be presenting his project this Wednesday:     [📄] Collateral Onboarding Call #17: Blocksquare.io - Wednesday, November 25 18:00 UTC Collateral Meetings   [collateral17]  Time in your local-timezone format:  2020-11-25T18:00:00Z (UTC)  Dial In Details Zoom Call  Passcode: RWA-WG  Intro An open discussion where we discuss projects and potential assets for MCD, open for anyone to join.  If you’d like to present, check out this thread  Agenda Intro by  @juanjuan  blocksquare Presentation (https://blocksquare.io/)  by @Denis Real estate tokenization protocol: A Pre-MIP Discussion :point_up_2:t3:This forum post is qui…      Hope to see you all there. ",
                    "links": [
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/88508073720?pwd%3DR1FiRCtKK0hIVGJyMlpiekZIelY2Zz09&sa=D&source=calendar&usd=2&usg=AOvVaw2bZFk9OiwA_yeyeiUyPYwE",
                        "https://forum.makerdao.com/t/collateral-calls-calling-all-projects/3715/",
                        "https://forum.makerdao.com/u/juanjuan",
                        "https://blocksquare.io/",
                        "https://forum.makerdao.com/t/real-estate-tokenization-protocol-a-pre-mip-discussion/5169"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptouf",
                    "index": "#25",
                    "likes": "0",
                    "time": "23/11/2020-18:21:56",
                    "content": "Thanks. Will try, but not sure i can make it … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Denis",
                    "index": "#26",
                    "likes": "2",
                    "time": "26/11/2020-16:43:46",
                    "content": "@juan, thank you for giving us the spotlight and organising yesterday. Much appreciated.  Also, thank you all who could join @SebVentures @amyjung @blimpa @_LS @spin @Primoz @mrabino1 & others Our main takeaway from the conversation we had is that technically solving on-chain liquidations is key.  To get the things going, I would like to get more into the technical side of this implementation challenge and any help is welcome. Would anyone be willing to guide our team through the liquidation process for an ERC20 as it is now, preferably with transaction links to etherscan etc.? Obviously we did our initial research, but for best results, it would be great to go through it with someone who is deeply familiar with the Maker protocol and smart contract system. @SebVentures perhaps you could help us out here or at least connect us with someone who can? Viktor and I will then deep dive into Maker liquidations and map out on-chain implementation options. So far, I see this could be achieved via proxy/pool contracts, but I don’t want to limit our thinking to the first solution that pops in my head as there may be other implementations that we just haven’t thought of yet. We’ll much appreciate any help you might provide  Thank you in advance!  PS: oh, and happy thanksgiving for those who are based in the US  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.257369614512472
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#27",
                    "likes": "1",
                    "time": "26/11/2020-17:48:33",
                    "content": "I sadly don’t know much about on-chain liquidation. I work on RWA that use off-chain liquidation because they are illiquid. Maybe you should step back and analyze of you can provide on-chain liquidity on the size needed for a Maker liquidation. Let’s say the market cap on a token is $1M and maker own $500k. How could you ensure that it can be sold in less than 6 hours without distorting the price too much? If it’s not possible, no Keeper will do the job to liquidate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.238095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#28",
                    "likes": "0",
                    "time": "26/11/2020-18:03:49",
                    "content": "The only way I can see of having an on-chain liquidation would be to have a public company issuing share on both stock market and on chain. Then liquidation become easy as on chain token would be trusted and should match market. This company would own the properties. I am not too sure about the legal and it needs a big player. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.238095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptouf",
                    "index": "#29",
                    "likes": "0",
                    "time": "28/11/2020-00:15:34",
                    "content": "did you record the call ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Denis",
                    "index": "#30",
                    "likes": "2",
                    "time": "30/11/2020-15:27:21",
                    "content": "@SebVentures Thnx for simplifying the requirements like this. The solution should allow a Keeper to ‘sell’ the liquidated property tokens in less than 6 hours without distorting the price too much. I believe it’s possible and have drafted a solution that might just do the trick over the weekend. Having a call with our smart contracts devs tomorrow on this subject to go through the technical restraints, but from the top of my head I think it should be OK. Then, if we see we can make it work, I would schedule a call with you @SebVentures to run it by you — please PM me if you have time later this week or beginning of next week. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.54047619047619
                }
            ]
        }
    ]
}