{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/endgame-call-2pm-et-8pm-cet-overview-of-the-endgame-constitution/19168",
            "title": "Endgame Call @ 2pm ET 8pm CET: Overview of the Endgame Constitution ",
            "index": 19168,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "endgame",
                "pubcall-:-voter-committee",
                "constitution"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "4",
                    "time": "14/12/2022-17:30:13",
                    "content": "Link to todays Endgame Call: https://us02web.zoom.us/j/89326394914 After discussing the example Scope Framework for RWA last call 2 weeks ago, today we will discuss the Endgame Constitution itself which governs all of the Scope Frameworks, incentivized voting, delegates, and all other crucial components necessary to maintain the endgame steady state. Here’s the screenshot of an overview of the 12 articles that I’m currently drafting to include in the constitution. They are still very work in progress so will change significantly based on feedback. The design goal is to ensure that the Endgame Constitution, plus the Scope Frameworks together are enough to provide all details and information necessary to determine the complete endpoint structure of the Endgame state. I’m hoping to get some feedback on this structuring, including the choice of articles and their ordering, as well as the broader points and context that are crucial to contain or reference inside the body of the constitution.  image1644×782 86.5 KB   Video Recording:      ",
                    "links": [
                        "https://www.youtube.com/watch?v=hJSqYTzensQ",
                        "https://forum.makerdao.com/t/governance-and-risk-call-224-thursday-february-2-2023-17-00-utc/19613",
                        "https://forum.makerdao.com/t/weekly-relay-recaps-of-current-events-at-makerdao/16382/29"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.298611111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#2",
                    "likes": "1",
                    "time": "14/12/2022-18:18:54",
                    "content": "The main piece of feedback most community members have had is:  can you open source or  “comment-only-share” these excalidraws?  Consitution feedback: 11.4 growth and ecosystem seem too fuzzy compared to the other scope frameworks. we should consider breaking them into constituent parts. For growth finding out which are better as core functions (e.g. integrations) and which are better as subdaos or EA’s. Branding, community might fit there or might not. Additionally, some input about the highest leverage growth activities to date and potentially in the future would be super useful; so no one gets stuck spinning their wheels. For ecosystem, wat is ecosystem? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.170454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "1",
                    "time": "14/12/2022-18:21:36",
                    "content": "I was actually thinking starting constitution would be more of principle (as noted in the image) and that itself would take some time. And once principles are agreed, the rest can be built on it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "7",
                    "time": "15/12/2022-11:11:30",
                    "content": "    rune:  The design goal is to ensure that the Endgame Constitution, plus the Scope Frameworks together are enough to provide all details and information necessary to determine the complete endpoint structure of the Endgame state.   I’m not sure that this is sensible. There are structures and constraints you’ve described in the past that would be better defined using something similar to a MIP-like structure. If you stick on this course, both the scopes and the constitution are going to be extremely long, and their focus very broad. As I understand it, you want to create two types of what is effectively legislation for the DAO:  Mutable legislation - this is the content of the scope frameworks, and is analogous to the existing MIPs. Enshrined legislation - this is anything that should not be easy to change.  The requirement for these two types of legislation should not imply the existence of a single document (a constitution) that contains all of the enshrined legislation. That’s a recipe for an overly complex, hard to understand, and long document. The aim of a constitution in my mind is to be a short, easily understandable document that explains what Maker is trying to achieve, why, and how it plans to do so at a high level. As an example of this, we (GovAlpha) wrote a couple of delegate MIPs, one to cover recognized status, one to cover compensation. Those were both multi-page documents, and this was necessary to define the structures and information in sufficient detail to be:  Understandable Actionable Unambiguous.  Delegates is 1 section of a 10 section constitution according to this outline, meaning either:  This document will run > 50 pages. This document will not be detailed enough to constrain any actions reliably.  My advice on structure would be to have:  A constitution that:  Includes articles 1-3 in your division above. Defines enshrined legislation (and the requirements for changing it) Includes a list of enshrined legislation. Defines mutable legislation (and the requirements for changing it) Includes a list of mutable legislation. A clear statement that the constitution itself is enshrined, meaning no one can add additional mutable legislation without clearing the enshrined modification requirement.   A set of enshrined legislation as defined in the constitution, but not part of it.  These are MIP-like documents that cover what you’ve currently defined as articles 4-10. I’d recommend that they actually be MIPs and that you re-purpose the MIPs framework to host these and nothing else. But MIP-like is fine.   A set of mutable legislation (ie, the scope contents).  This keeps complex information separated into digestible chunks, and allows us to go into the required level of detail without polluting the constitution with the sort of legal crap you need to effectively constrain the actions of profit-seeking entities. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.276914682539683
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#5",
                    "likes": "0",
                    "time": "15/12/2022-11:37:09",
                    "content": "    LongForWisdom:  The aim of a constitution in my mind is to be a short, easily understandable document that explains what Maker is trying to achieve, why, and how it plans to do so at a high level.   I agree on this. It should also clearly say what it should/must not try to achieve, and why, so to set very clear (even if high level) delimitations. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.819444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#6",
                    "likes": "1",
                    "time": "20/12/2022-22:10:11",
                    "content": "The constitution should be as short as possible, obviously, but I think it would be a distraction to use it as a vision statement or some other vague function. Its core function should be to enforce and protect the endgame by defining all the rules in the system that are immutable, such as voter incentive funnel, tokenomics, token emissions, principles of delegate compensation, etc. basically the rules that insiders are heavily incentivized to alter in their own favor if nothing stops them (and the constitution also needs to describe how they’re stopped). It is better to keep all of these definitions in a single immutable document or they become more vulnerable to slippery slope risks. e.g. if delegate comp and tokenomics were separate docs, then delegates may alter delegate comp first, and MKR holders would be fine since it didn’t “crack open” the tokenomics document. Then by altering delegate comp the colluding delegates could eliminate their competition and achieve full control to the point where they can then alter tokenomics ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.381324404761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#7",
                    "likes": "0",
                    "time": "21/12/2022-14:38:20",
                    "content": "The only item on the list, that I’m not 100% sure it should be there is the decentralized frontend. Aside from the most basic specifications, what’s the content here? We should probably not prescribe technologies or infrastructure because these are bound to change rapidly. So we might simply say that Endgame strives for true decentralization and full privacy / pseudonymity. But aside from that, what are you envisioning in this section? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#8",
                    "likes": "0",
                    "time": "21/12/2022-18:27:40",
                    "content": "In the MIPs framework, within MIP details, there is a field called dependencies. The constitution could lay out more defensive voting requirements for dependent MIPs relating to specific sections (eg: tokenomics.) For example, it can be designed so that not only the constitution(enshrined legislation) requires something like 2/3 majority and some quorum, but also that a dependent MIP relating to a specific section be classified as enshrined legislation as well, carrying with it the same stricter passing requirement. This way, Maker can achieve both a simpler constitution and a better structure of “legislature” without sacrificing the stricter requirements needed for things like delegate comp or tokenomics. @rune ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                }
            ]
        }
    ]
}