{
    "poll_list": [
        {
            "title": "Initial Parameters for StarkNet Simple DAI Bridge - March 28, 2022",
            "index": "14158",
            "option": "Yes",
            "supporting_mkr": "110,691",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/starknet-simple-bridge-limit-poll-risk-assessment-mitigation/14158",
            "title": "Starknet simple bridge limit poll: Risk assessment & mitigation ",
            "index": 14158,
            "category": [
                "Updates"
            ],
            "tags": [
                "sne-001",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#1",
                    "likes": "7",
                    "time": "23/03/2022-08:10:10",
                    "content": "The objective of this post is to share the risk assessment and risk mitigation analyses ahead of a poll next week. The poll will let the community decide on the limit for the Starknet DAI bridge. Risk review and mitigation  The risks related to the simple bridge have been summarized in a joint post between Bartek (PECU) and Maciek (Starknet Engineering CU): Starknet DAI bridge and Starknet platform technical risk assessment  Each risk has been assessed by severity and frequency. Mitigative actions and processed have been implemented for each risk vector. A spreadsheet summarizes the risk vectors and the mitigations.  Risk parameter proposal  The simple bridge to have a bridge limit of DAI 5Mn. The scope of the simple bridge is slow withdrawal, fast withdrawals are out of scope for this release. The bridge limit is the maximum amount of DAI that can be in the L1 bridge contract. Hence it is the maximum amount that can be lost by users The bridge launch will require the completion of all the mandatory items on the checklist  Users will use the simple bridge at their own risks. It will be mentioned on the bridge interface  ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1aByYNfjz1m7o9jyiIhHq-G6OEKq--wu0eoQXzVgc4XE/edit#gid=0",
                        "https://docs.google.com/spreadsheets/d/1lg4LFQCW7x4bcR8gEgHoE7DB2rqa4GA4DPSUdMOgBsI/edit#gid=718243816",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-28-de-marzo-de-2022/14308",
                        "https://forum.makerdao.com/t/weekly-relay-march-22-28-2022/14300",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-17-23-2022/14191",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/47",
                        "https://forum.makerdao.com/t/relay-semanal-22-28-de-marzo-de-2022/14333",
                        "https://forum.makerdao.com/t/executive-inclusion-starknet-bridge-limit/18905"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Risk assessment and mitigation",
                        "Token economics",
                        "Smart contract updates",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.227272727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "4",
                    "time": "23/03/2022-12:09:12",
                    "content": "Just to confirm, we want this to go to an on-chain poll on Monday? From the point of view of the person that needs to write the poll, what exactly is governance deciding to do? Launching a Mainnet-Starknet bridge with a limit of 5 million DAI? Do we need to do anything as part of an executive vote to support this, or will a simple on-chain poll be enough? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "1",
                    "time": "23/03/2022-12:49:28",
                    "content": "    LongForWisdom:  Do we need to do anything as part of an executive vote to support this, or will a simple on-chain poll be enough?   I believe the upcoming SR should include that question  as part of the Mainnet-Starknet bridge 5 million DAI POLL  Signal Request(if the community wants it to go to an Executive). Personally, I will Poll YES. Because allowing the Mainnet-Starknet bridge to increase above & beyond the Surplus Buffer (currently 67M) should be a gradual event voted upon by MKR token owners & Delegates. As we have seen, bridges like the Solana Wormhole can be exploited. I believe once the Mainnet-Starknet bridge and StarkNet platform have been battle tested, the community will feel a lot more comfortable scaling beyond the SB. After all, we are talking about swapping and minting over $1B of synthetic DAI into CanonicalDAI. Fingers crossed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#4",
                    "likes": "2",
                    "time": "23/03/2022-13:26:31",
                    "content": "Just for context for everyone who has not been staying close to the issue. The bridge limit for other rollups does not exist, we are having a bridge limit in this context because Starknet is still a new technology and it has not been audited fully or gone through formal verification (it is planned though). The amount of the DAI bridge limit is in line with the limit Starkware will self-impose on other ERC20 bridges. @LongForWisdom , to reword what @flipflopflapdelegate  just said. We discussed in mandated actors meetings and internal L2 meetings that an on-chain poll would suffice to launch the bridge with a low limit. However, the future decision to increase or waive the bridge limit will be subject to an executive vote. Any request to increase that limit should be backed by proofs that we have increasing confidence in Starknet and the bridge implementation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.79978354978355
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "0",
                    "time": "23/03/2022-13:41:36",
                    "content": "    pyramidmaker:  However, the future decision to increase or waive the bridge limit will be subject to an executive vote.   So in general we don’t do this anymore unless there is some parameter or technical change that we need to make in order to action the results of a vote. From the sounds of it, it doesn’t seem like we need an executive in order to implement any aspect of the bridge at this stage, so until that changes I think we’ll stick to on-chain polls to determine any changes to the bridge limit. How is the bridge controlled at this point? Like is admin access controlled via multisig, and/or is admin access being transferred to Maker Governance like we did with the Optimism bridge? EDIT: From the risk assessment it seems like this is the plan, it would be good to be able to give an indication of the timeline in the poll. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.845238095238096
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#6",
                    "likes": "1",
                    "time": "23/03/2022-14:28:39",
                    "content": "@LongForWisdom sticking to on-chain polls works for me, as long as any new request is supported by PECU, Risk, and Starknet Engineering CU. The bridge is controlled by Maker Governance exactly like it’s been done for Optimism bridge. On the timeline for the poll, the risk assessment and risk mitigation plan have been finalized so all the information required to run the poll is available in the post above. Regarding timeline to launch the bridge itself, we are still waiting on Starkware to launch the Starknet bridge interface and we expect to be able to launch in 2-3 weeks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.03030303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "3",
                    "time": "23/03/2022-14:35:02",
                    "content": "So my fault, I wasn’t super clear here. I understand the timeline for the poll, I was asking for the timeline on governance control of the bridge. Based on what’s been said so far, I’m guessing the following is what we’re doing:  We poll on initial parameters for the StarkNet bridge. External dependencies are met (Starkware launching the bridge interface). SECU deploy and setup bridge with initial parameters. SECU transfer ownership of the bridge to governance (after some lindy period?) Future changes to the bridge will now require an executive vote in addition to an on-chain poll, because SECU no longer have admin access to make changes without Maker Governance.  Is that correct? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#8",
                    "likes": "1",
                    "time": "23/03/2022-17:00:18",
                    "content": "@LongForWisdom that’s correct. A couple of comments:  We will do 3 and 4 during the deployment The bridge limit at deployment will be zero by default. We could either set the limit before handing over, or let governance do it  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "0",
                    "time": "23/03/2022-17:44:51",
                    "content": "Perfect thanks for confirming.     pyramidmaker:  The bridge limit at deployment will be zero by default. We could either set the limit before handing over, or let governance do it   I’ll leave this up to you and PE. I’m not sure of the pros and cons. If you could let me know before Friday, that would be ideal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#10",
                    "likes": "1",
                    "time": "23/03/2022-20:18:54",
                    "content": "Both ways are really equivalent and it’s a one-off process. We will set it up right before handing over as long as we have a poll decision. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.726190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#11",
                    "likes": "0",
                    "time": "06/04/2022-20:19:02",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "857"
}