{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/lrc-erc20-token-sc-domain-team-assessment/3471",
            "title": "[LRC] ERC20 Token SC Domain Team Assessment ",
            "index": 3471,
            "category": [
                "Collateral Onboarding",
                "Domain Work"
            ],
            "tags": [
                "lrc",
                "sc-domain-work"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#1",
                    "likes": "9",
                    "time": "30/07/2020-21:08:50",
                    "content": "General Information   Symbol: LRC  Address: 0xBBbbCA6A901c926F240b89EacB641d8Aec7AEafD   Deployment date: April 11th, 2019   Total Supply: 1,374,513,896.690823857345100827 (uint256, strictly decreasing)  Developers Allotment: at least 186,010,140.666667 (~13%, balance of Icebox contract, developers may control other coins elsewhere—e.g. it seems the Icebox contract has staked ~4,202 LRC in the current staking pool)  Project website: https://loopring.org/   Github repository: https://github.com/Loopring/protocols/tree/master/packages/lrc_v2   Can use existing MCD collateral adapter: Yes, the GemJoin adapter.  Risk Summary   Does the contract implement the ERC20 token standard? Yes, the contract implements all the required ERC20 functions.  Risk analysis: LOW.  Technical Information   Compiler version: v0.5.7+commit.6da8b019  Decimals: 18  Overflow checks: Yes, the contract uses a SafeMath library.  Mitigation against allowance race-condition: Yes (increaseAllowance and decreaseAllowance functions are implemented).  Upgradeable contract patterns: No.  Access control or restriction lists: No.  Non-standard features and behaviors:  Implements a batchTransfer function. Implements burn and burnFrom functions and tracks total tokens burned. A call to transfer or transferFrom with a recipient address of 0 will call burn (or burnFrom, respectively) instead of executing the transfer (and the Burn event will be emitted instead of the Transfer event).    Formal Verification Considerations   Does transfer have simple semantics? Mostly, excepting delegation to burn on transfers to the zero address.  Does transferFrom have simple semantics? Mostly, excepting delegation to burnFrom on transfers to the zero address.  Can balances be arbitrarily modified by some actor? No.  Are there any external calls? No.  Testnet Information  Kovan LRC token address: no official deployment from the team—we should deploy our own version for testing  Audits & Related Documentation  Loopring Protocol Security Audit Report:  Can be found here, but doesn’t seem to cover the token contract itself.    Contract Logic Summary The contract is essentially a vanilla ERC20 contract that includes functions for burning tokens and performing batch transfers. Administrative Addresses None. Contract Risk Summary This is a low risk contract. The ERC20 functions are implemented to the industry standard and does not use upgradeable design patterns. The ERC20 allowance race condition is mitigated and noted in their code, although a user could still fall victim to the race condition if they do not understand how to avoid it. The contract makes use of a SafeMath library to prevent overflows & underflows. One thing to note: while the contract itself is not upgradeable, the rest of the Loopring system is, and thus if the Loopring system were upgraded to use a different token, this contract would effectively become defunct and very likely valueless. The probability of this happening is judged to be low (and a Loopring team member stated there were no plans to ever do this). ",
                    "links": [
                        "https://etherscan.io/tx/0xd5992b734d7045fdc97f1172a74ca41c1f5d713b152bf97c2351513d7f2ad4e8",
                        "https://etherscan.io/address/0x527f4fb6563d6afd30efedb9c57c7d7df2f5cdfc#code",
                        "https://etherscan.io/tx/0xf3ca74f780dcf88473bb7e9790f09af01073c47892bfa39a9222fab0202ddc69",
                        "https://etherscan.io/address/0xf4662bb1c4831fd411a95b8050b3a5998d8a4a5b#code",
                        "https://loopring.org/",
                        "https://github.com/Loopring/protocols/tree/master/packages/lrc_v2",
                        "https://github.com/makerdao/dss/blob/82044f2c0cdf86414f3543b09608d449c67798e9/src/join.sol#L62",
                        "https://github.com/ethereum/EIPs/issues/20#issuecomment-263524729",
                        "https://en.wikipedia.org/wiki/Semantics_(computer_science)",
                        "https://en.wikipedia.org/wiki/Semantics_(computer_science)",
                        "https://medium.com/loopring-protocol/secbit-delivers-a-security-audit-report-for-loopring-protocol-3-0-a768c2bd061a",
                        "https://forum.makerdao.com/t/mip12c2-sp4-domain-work-requirements-for-lrc/3558",
                        "https://forum.makerdao.com/t/maker-relay-ep-6/3517",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/26"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3173076923076925
                }
            ]
        }
    ]
}