{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/starknet-engineer-core-unit-january-2022-update/13147",
            "title": "Starknet Engineer Core Unit - January 2022 Update ",
            "index": 13147,
            "category": [
                "Updates"
            ],
            "tags": [
                "sne-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#1",
                    "likes": "1",
                    "time": "09/02/2022-17:05:17",
                    "content": "Our phase II MIP was ratified by governance. We have been preparing for phase II in January and have been working with the broader L2 group to define an acceptable risk framework that is specific to the bridge and wormhole implementation. We are looking to get a greenlight from Risk CU on the launch of our bridge end of February and we have started the implementation of fast withdrawals.   On business and partnership  We had conversations with Market Makers to explore how to bootstrap liquidity on Starknet. The conclusion is unclear, market makers don’t seem eager to provide liquidity to AMMs. We are currently thinking how we could work directly with exchanges to bootstrap liquidity on Starknet    On risk management  We have had sessions with PECU to compare side-to-side the bridge implementations between Starknet and Optimism We have supported PECU on building a framework to assess rollups risk and deriving risk parameters We have worked on a framework to assess the risk of our immediate bridge implementation and get the greenlight from Risk CU on an initial bridge limit of few Mn DAI We have heard Oracle CU concerns about the implementation of fast withdrawals We have planned a second review of our bridge contract for the last week of February    On product - planning  We have incorporated events to our bridge We have been integrating our bridge to the Starknet UI We have updated our L1 and L2 contracts for fast withdrawals We are working on building a wormhole oracle PoC we can handover to the Oracle CU and use for the basis of a conversation    ",
                    "links": [
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-january-2022-updated/13094"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "23/02/2022-17:05:34",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/starknet-engineer-core-unit-february-2022-update/13742",
            "title": "Starknet Engineer Core Unit - February 2022 Update ",
            "index": 13742,
            "category": [
                "Updates"
            ],
            "tags": [
                "sne-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#1",
                    "likes": "3",
                    "time": "08/03/2022-12:54:12",
                    "content": "On risk management  Mapped out the lifecycle of transactions in different use cases Wrote a post with PECU highlighting the risks of the Starknet DAI bridge. To be posted very soon Discussed with PECU and Risk CU the process to get the simple DAI bridge limit agreed upon. Post to notify the risk team we are requesting a $5Mn DAI bridge limit at launch  On product   For simple bridge  Added events Tested the bridge UI Built and proposed a checklist to PECU for new rollup lauches    For fast withdrawals  Built the event monitor. Demo in Denver of the event extractor for the fast withdrawals Developed an integrated test environment Reviewed the wormhole oracle SDK developed by PECU    For wormhole teleportation  Followed PECU design work for the wormhole, and had discussions with different members in Denver Ran tests with warp transpiler to explore the feasibility of using the transpiler for the next phases    Upcoming hackathon  Exploring a Starknet-based Maker governance project for the Amsterdam hackathon    On Liquidity   Had 4 more discussions with Market Makers that have not been fruitful, they would charge an unreasonable amount to be LPs on AMMs   Agreed on the necessity of exploring collaboration with partner exchange to solve Maker’s liquidity issue   Prepared a presentation deck to discuss the liquidity challenge that Maker is facing   Still assessing the market risk exposure for Maker in the PSM case vs. using GUNI token as collateral for example (non-market risk assessment of GUNI)   On Recruiting  Interviewed candidates to add one Engineer to the team. Expecting to add one more member by mid-April  ",
                    "links": [
                        "https://docs.google.com/presentation/d/1BbjotsZ4BCsObCjvQpzr_r2D3tOmiRIySoQZG6yXMEQ/edit#slide=id.g116ee51eac5_0_0",
                        "https://forum.makerdao.com/t/guni-dai-usdc-erc20-token-smart-contract-technical-assessment/9139",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-february-2022/13726"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.744755244755244
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "08/03/2022-17:53:40",
                    "content": "    pyramidmaker:     Exploring a Starknet-based Maker governance project for the Amsterdam hackathon      Nice! Is this in coordination with the StarkAthon? Or, you’re running it separately?  image910×308 54 KB      pyramidmaker:  Tested the bridge UI   Will this eventually be open to Users that wish to participate in the testnet of such? Seeing platforms entice user to test out their dApps and report back–wondering if that’s doable–but might not be since there’s no incentives.     pyramidmaker:  Ran tests with warp transpiler to explore the feasibility of using the transpiler for the next phases   How well did Warp do when transpiling DaiWanese?       pyramidmaker:  Prepared a presentation deck  to discuss the liquidity challenge that Maker is facing    image1652×324 63.6 KB            ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#3",
                    "likes": "1",
                    "time": "09/03/2022-22:56:14",
                    "content": "We are still learning about Warp. We have been using it a couple of times and we’re staying very close to its development and roadmap. The results have been interesting so far, though it does require some rework for now. The hackathon we are considering is indeed the hackathon you mentioned On testing: the UI is very simple for the simple bridge, and it’s been developed and tested for other tokens as well by Starkware. It will be a highly tested interface. However, we are in discussion for a bug bounty for the wormhole specifically ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5843750000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "23/03/2022-22:57:02",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/starknet-engineer-core-unit-december-update/12568",
            "title": "Starknet Engineer Core Unit - December update ",
            "index": 12568,
            "category": [
                "Updates"
            ],
            "tags": [
                "sne-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#1",
                    "likes": "9",
                    "time": "12/01/2022-00:59:25",
                    "content": " Starknet Engineering Core Unit Month in Review: December 2021 This post summarises the tasks, work, and activities of the Starknet Engineering Core Unit  for the month of December. The short summary is that we shipped a first version of the Starknet bridge contracts, we will add events to those contracts once they are available on Starknet. We worked on sharing knowledge about Cairo with relevant stakeholders, and we planned for the implementation roadmap for phase II (wormhole design) with a focus on fast withdrawals.  First version of the Starknet bridge contracts You will find the github repo to our bridge contracts here. The main challenges of writing those contracts have been:  Understanding the difference between Starknet and Optimism and the implications for a scenario where the sequencer is censoring transactions Understanding the features that are currently available on Starknet and what will be available in Q1 and Q2 of 2022 Defining a mitigation process in case Starknet goes down or the sequencer is malicious. We opted for providing MakerDAO the ability to redistribute funds on L1 manually in case such an event was to occur   Audit with ChainSecurity  We went through a first audit with ChainSecurity which turned out to be very useful with great catches from the team. You will find the audit report publicly available here  As events are planned to be released on Starknet at the end of January, we will incorporate into our contracts code, along with some refactoring. We will ask for an additional audit of the contracts early February   Code walkthrough with the Protocol Engineering Core Unit  In order to assure our code is peer-reviewed and to prepare for the wormhole implementation on Starknet, we organized two code walkthroughs with the Protocol Engineering team We have more walkthroughs planned for January, with a side-by-side comparison of the optimism bridge code and the Starknet bridge code   Front-end integration and public launch  We synchronized with the Starknet team to integrate our bridge to their bridge interface The interface will require the user to connect with both an Ethereum wallet and ArgentX (Starknet wallet) We are aiming at launching the front-end, coupled with a PR push around the third week of February   Wormhole implementation preparation To prepare for phase II of our mandate, the wormhole design, we pursued the following activities:  We studied and analyzed the wormhole design produced by the Protocol Engineering Core Unit We studied the first chunk of code submitted for audit by the Protocol Engineering Core Unit We defined a January roadmap to start implementing the Starknet version of the wormhole design, starting with fast withdrawals We submitted MIP40c3-SP47 to request a budget for phase II We organized discussions with delegates to hear out their comments and concerns about the Starknet implementation of the wormhole design  ",
                    "links": [
                        "https://chainsecurity.com/security-audit/makerdao-starknet-dai-bridge/",
                        "https://forum.makerdao.com/t/mip40c3-sp47-core-unit-budget-sne-001-phase-ii-starknet-fast-withdrawal-and-wormhole/12041",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-january-2022-updated/13094",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-december-2021/12692"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.130676328502416
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "3",
                    "time": "16/01/2022-01:31:41",
                    "content": "Hey folks—just simple questions here. Being that StarkNet is still centralized, is L1escrow Permissionless, no keys? Or it is permissioned and forceWithdaw is the equalizer for users who are censored? With regards to minting uncollateralized L2 DAI, you mention that: Bug allowing direct access to mint method on L2 dai or to finalize_deposit on l2_dai_bridge will result in a creation of uncollateralized L2 DAI. Withdrawal finalization to L1 is expected to take several hours on StarkNet. Maker governance with its 2 day delay won’t be able to respond in time to coordinate preventive action if a malicious user mints uncollateralized DAI on L2 and withdraw DAI on L1. In case this  happens, is there a “trigger-function” that can alert Maker governance and extent withdrawal finalization to L1 for more than 48 hours? TOL. With regards to getting Maker Devs up to speed with StarkNet—as we know, Coding dApps natively on L2 requires learning Cairo — wondering if you can provide us with an update on how that’s going. And last but not least, with regards to Oracle price updates—as you and the entire community knows, managing oracles include dozens of price updates and signatures from various sources to calculate—can you please provide how StarkNet/ValidityRollup help with scaling this issue? Thanks in advance! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#3",
                    "likes": "1",
                    "time": "19/01/2022-17:22:30",
                    "content": "@flipflopflapdelegate thank you for those questions, answers in-line below Q: Hey folks—just simple questions here. Being that StarkNet is still centralized, is L1escrow Permissionless, no keys? A: Only the L1DAIbridge contract and MakerDAO can call the escrow contract. L1DAI bridge can call the escrow to transfer funds to the users on L1 in case of a withdrawal. MakerDAO can call the escrow contract to redistribute the funds on L1 in an emergency situation (e.g., rollup going down or forced withdrawal being ignored/censored). Q: Or it is permissioned and forceWithdaw is the equalizer for users who are censored? A: forceWithdraw is doing the same thing as the function initiate_withdraw on the L2_dai_bridge contract, except that the call is made on L1 so even if it is censored by the sequencer, we can see the call has been made on L1 and the DAO can take action if that request is censored for more than 7 days by the sequencer. forceWithdraw is not a permissioned function, however it will fail if the user does not have a L2 address or is trying to withdraw an amount higher than their balance. Q: With regards to minting uncollateralized L2 DAI, you mention that: Bug allowing direct access to mint method on L2 dai or to finalize_deposit on l2_dai_bridge will result in a creation of uncollateralized L2 DAI. Withdrawal finalization to L1 is expected to take several hours on StarkNet. Maker governance with its 2 day delay won’t be able to respond in time to coordinate preventive action if a malicious user mints uncollateralized DAI on L2 and withdraw DAI on L1. In case this  happens, is there a “trigger-function” that can alert Maker governance and extent withdrawal finalization to L1 for more than 48 hours? TOL. A:  The first line of defense is enough testing, peer-reviews, and comparisons with other rollups’ implementations. A second line of defense is the bridge limit and debt ceiling, limiting the amount that could be maliciously withdrawn. A third line of defense is a bug bounty to assure that there are no bugs inadvertently providing unwanted access to those methods.  As you suggest, a fourth line of defense could be an alert mechanism coupled with a circuit breaker. This mitigation mechanism could be implemented for any rollups. I launched the discussion on discord in the public protocol engineering channel. Q: With regards to getting Maker Devs up to speed with StarkNet—as we know, Coding dApps natively on L2 requires learning Cairo — wondering if you can provide us with an update on how that’s going. A: We have had discussions on a weekly basis with PECU about trust assumptions before getting at Cairo, and we are revisiting those discussions for fast withdrawals and wormhole teleportation. On Cairo side, we have been doing weekly code walkthroughs in December with the Protocol Engineering team and we will be doing side-by-side comparisons of contracts in January. Bartek gave a presentation last week of the CPU architecture of Cairo to better understand/explain the differences between Cairo and Solidity. Those sessions are typically happening on Thursday afternoons and are recorded, we will discuss the best place to post them, most likely a post from our CU. Q: And last but not least, with regards to Oracle price updates—as you and the entire community knows, managing oracles include dozens of price updates and signatures from various sources to calculate—can you please provide how StarkNet/ValidityRollup help with scaling this issue? A: Starknet oracles can be thought of in two contexts: Starknet-based price Oracle service for Starknet (e.g., price oracle for Maker implementation on Starknet), and a Starknet-based price oracle service for L1. For Starknet oracles, we will build a price oracle service in phase III, when we build MCD on Starknet. Note that we will build with the Oracle team the wormhole oracle before we build the price oracle service. The cost of operating that price oracle can be broken down into L1 cost (proof cost) and L2 cost (transaction fees). The L1 cost is significantly higher than L2 cost and would be expected to be around 300 to 1k gas, i.e., ranging from ~ 100 to 150x cheaper than the current oracle cost. For L1 oracles, the cost improvement will be in the same range as for the use case above, so that’s very promising. However additional considerations must be taken into account for a L1 oracle service. First, oracles are designed for the worst case scenario and a significant amount of thinking needs to be put in to define emergency cases, including new ones introduced by a new Starknet-based design. Second, given how critical oracles are for Maker, we don’t think an oracle service for L1 is viable until Starknet reaches decentralization. Additionally, the poke method is called roughly every hour, hence such a design can be considered only when Starknet proofs are sent to L1 more frequently than hourly. In terms of high-level feasibility, the decentralization roadmap will start being implemented in Q2-Q3, and more frequent batch updates will also be implemented in the second part of 2022. cc: @Ohad_Barta_StarkWare @marcandu  for the Oracle discussion. They both provided useful detailed gas calculations that I was able to compare ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.453809279233008
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "2",
                    "time": "19/01/2022-21:28:04",
                    "content": "    pyramidmaker:  As you suggest, a fourth line of defense could be an alert mechanism coupled with a circuit breaker. This mitigation mechanism could be implemented for any rollups. I launched the discussion on discord in the public protocol engineering channel.   Thank you Louis for taking time-out to formulate all the answers to my questions and for re-introducing the idea of a “circuit-breaker” with PECU. Much appreciated. And last question (promised) I was reading about  L1 to L2 messaging, how does StarkNet handle messages when L1 usually waits for x number of confirmations? And get a message getting stuck also cause for funds to get stuck? Thanks in advance! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#5",
                    "likes": "1",
                    "time": "20/01/2022-15:58:31",
                    "content": "Thanks @flipflopflapdelegate , appreciate your questions The L1->L2 messaging starts by a call to the Starknet Core Contract on L1. Currently Starknet is not decentralized yet and the sequencer waits to assure that this call is final on L1. When Starknet will be decentralized, sequencers will have a very strong incentive to wait. So to answer your question, everything is done so the L1 call is final and hence a wrong L1->L2 should not be processed by the L2. There is another case where funds could be stuck in the L1 bridge: if user deposits funds on L1 bridge but the sequencer censors the mint call on L2. This will be solved end of February with the Starknet v0.71 where if the sequencer censors mint on L2,  the message is canceled from Starknet Core Contract and funds can be returned to user on L1. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.219444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "03/02/2022-15:59:28",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "528"
}