{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/what-is-a-dao-anyway/9259",
            "title": "What is a DAO anyway? ",
            "index": 9259,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#1",
                    "likes": "45",
                    "time": "08/07/2021-17:22:04",
                    "content": "I wrote this on my personal blog, mainly as a way to better articulate my thoughts. I’m posing it here as most of my conclusions come from my experiences with MakerDAO and they influence my actions as a community member.   What is a DAO anyway? —  A study of “censorship resistant organizations” On a Friday evening I had an interesting Twitter encounter which forced me to think more critically about the purpose of DAOs. “Decentralized Autonomous Organizations” have been around since 2016, when Stephan Tual first mesmerized us with a grand vision and a fashionable scarf. Yet over the past five years, despite countless explanations of how DAOs can work, I cannot find a single satisfactory explanation as to why people would ever organize themselves in such a painfully frustrating way. Now, I happen to know a few things about DAOs. Since 2016 I have been actively involved with, in, and around organizations calling themselves DAOs. There have also been fascinating legislative developments, such as Wyoming officially recognizing DAOs as a type of entity. With much respect to the pioneering officials that have achieved this legislation, these entities are DINOs (DAOs in name only). While they serve a purpose in assisting a company with a siloed crypto token-economy in claiming limited liability, they are quite literally traditional LLCs with unconventional operating agreements. As will be discussed, DAOs are a completely new kind of entity that does not so easily fit into a pre-existing mold.  597×590 40.7 KB  In addition to not having a broadly accepted purpose, there seems to be a pervasive misconception around how DAOs actually function. Digging into the Twitter interaction referenced above, it seems that there is a perception that DAOs may produce greater collective intelligence and efficiency. While there could be a distant future where this is true, I believe DAOs are extremely far away from becoming an efficient operating structure. Yet that’s not a cause for concern — DAOs are serving a far more important function than being a better corporate mousetrap. To study the nature of the “DAO,” we should first define it. I’ll pose this: A DAO is the coordination mechanism of actors operating a permissionless public good. It may seem redundant to specify that a public good is permissionless; isn’t the entire purpose of a public good that it’s effectively available to everyone? The nuance is in how one defines “public.” The US military is a public good, if you’re a US citizen. US citizenship is perhaps one of the most permissioned status’ on the planet. Therefore the US military is only a public good in the context of the generally permissioned network of US citizens and those the US government chooses to protect. Public blockchains like ethereum are permissionless networks, truly anyone can access them. A public good running on a permissionless network can therefore be considered a permissionless public good. The internet and websites are a good example of this relationship, yet their utility has thus far been constrained to the flow of information. Blockchains bring this property to value. [It’s worth noting that this is a paradigm shift for civilization. Prior to the advent of the internet the only permissionless public goods were naturally occuring, like air and rain.] The internet bestowed upon information a sort of “sovereignty,” no longer was it a good in which its flow could be controlled or intermediated. In turn the internet itself began to take on the properties of a sovereign state. After all, what is sovereignty if not the ability to resist censorship? The internet tried to spawn the first DAOs in the form of open source software, but without an economic incentive mechanism coordination was difficult. This isn’t to say that open source software wasn’t successful, but it certainly did not meet the expectations of its creators — the only open source software that could be implicitly monetized to the benefit of its contributors was that which in some way handled money, and value had not yet found its sovereignty. With the creation of Bitcoin, and public blockchains in general, a global permissionless network of value could finally exist. But unlike information, there is a need for consensus in a value network, and therefore a requirement to have a coordination mechanism to form that consensus. There are many explanations of consensus mechanisms in blockchains, so I will not go further into the topic. The important concept is to understand where sovereignty lies. As a user of a public blockchain, one needs to be sure that the accounting of the ledger isn’t being manipulated and that transactions are not being censored. The sovereignty of a value network can only be present if its users can independently verify this information. If only some users can prove that their transactions are not being censored, all others users are subordinated to their power. Thus the only way that a blockchain can take on the properties of a “sovereign state,” in a way similar to the internet itself, is to be independently verifiable by the vast majority of its users. This has had serious implications on scalability and the amount of information that a blockchain, at its base layer, can be expected to process. This same concept applies to DAOs, but we’ll discuss that later. With this context, let’s further explore the nature of a DAO. DAOs exist to coordinate actions in a permissionless public good. Permissionless public goods, outside of those that are naturally occurring, must exist in a permissionless public network. The internet and public blockchains, specifically the Ethereum public blockchain, are two permissionless networks that give their users sovereignty over value and information. They are in a sense, a new form of State. A key role of the State is to enforce property rights and contracts. Any study of empirical data will show that a country with strong property rights and contract enforcement has probably fostered a more prosperous society than a State which does not have these qualities. Money, being a form of debt, is almost entirely dependent on the State’s ability to uphold private contracts. The long term strength of a country’s money is intrinsically linked to this principle — i.e. good money is based upon deterministic outcomes. This adds a level of complexity to our line of thought; the sovereignty of the individual is only as strong as the determinism of the network they rely on for their contracts, and therefore the sovereignty of the individual can be in opposition with that of the State, which has its own sovereignty and will. Public blockchains have overcome this problem by creating a completely neutral base-layer where users, as long as they can verify the chain, can always enforce their sovereignty over the “State.” A contract on a blockchain is maximally deterministic and therefore stronger than any guarantee made by a legacy government. It’s no wonder that blockchains are being used primarily to make better money and financial services. Yet this superpower comes at a cost — a deterministic outcome requires an objective input.This limits the utility of the blockchain to applications that do not include any subjective measurements or decisions, which is quite a severe limitation. This is where DAOs enter the picture. Today the primary use case for a DAO is to build, maintain and update open source software (smart contracts) on a public blockchain. DAOs are most useful when these smart contracts require subjective inputs to function appropriately. By running on a public blockchain, smart contracts are implicitly permissionless public goods. Therefore, if deployed without any kind of administrative powers, they are fully censorship resistant. Since the value of a public blockchain is in its censorship resistance, any smart contract with administrative functions must have a mechanism to preserve this property. Thus we can expand our definition of a DAO to being a coordination mechanism to maximize censorship resistance. While a legacy organization organizes itself in a way which maximizes the efficiency in achieving a specific goal (e.g. profit, impact, control), a DAO organizes itself to maximize resistance to censorship in achieving a specific goal. A DAO is a censorship-resistant organization. Since a DAO must ensure its public good remains censorship resistant and continues to provide deterministic outcomes, it must logically resist censorship of itself. If the DAO itself is compromised, all of its goods and services become equally compromised. To achieve censorship resistance, a DAO must properly align the incentives of its users and bestow sovereignty into a fundamental unit of power. It must then distribute these fundamental units of power in a way that maximally diversifies away the potential for censorship while not breaking the incentive alignment. In most nation-states, the fundamental unit of power is the individual who is able to express this power with a singular vote. The fundamental unit of power in a DAO is the token. Tokens are not the ‘expression of power’, in the sense that they have the right to vote, but are the unit of power itself, the ‘individual’ in the analogy. They are explicitly not comparable to a share in a company. Traditional shares do not exist in a permissionless deterministic network, and are therefore not an extension of the sovereignty of that network but a unit of power subordinated to the State they exist in. Since DAO tokens exist on permissionaless public networks, which bestow sovereignty and determinism into the code running on them, the will of the token holders in a DAO is law. As indicated above, by placing administrative rights into a token which exists on a public blockchain, pass on the censorship resistant qualities of that network to the token. From here we must determine the best way to use these tokens without diminishing this censorship resistance and thus negating the entire purpose of the DAO. This forms the fundamental theory of the DAO — to preserve censorship resistance, all sovereignty must remain with the token. Note that this concept is not being applied to token holders but to the collective token supply itself. A token holder can easily be censored, but with the correct mechanism design it may be nearly impossible to censor the collective. Yet this causes the same point of contention that we see at the public blockchain base layer between user sovereignty and scalability, in that DAO scalability becomes a direct tradeoff to token holder sovereignty. In an ideal world token holders would be able to process an unlimited amount of information and intelligently vote on each parameter change in a system. They would also be able to do so reliably and without intermittent periods of censorship. This is clearly not a reflection of reality, especially in an adversarial environment. While public blockchains cannot scale beyond the average computer processing power of its users without sacrificing censorship resistance, a DAO cannot scale beyond the average brain processing power of a human being. Most scaling solutions for public blockchains address this issue by having layer-2 solutions compress their data and commit it to the main public chain, with the important caveat that the entirety of the original state can be reconstructed and challenged at will. A similar concept can work for DAOs; any decision which is delegated outside of the control of token holders may be condensed and presented to token holders as a ‘conclusion’, but the entirety of the inputs must be made public and deployed to a decentralized network for preservation and redundancy. There will be circumstances where this is not possible due to the interaction between the legacy State and the DAO (i.e. legal constraints, and a DAO should NOT attempt to extend its sovereignty beyond the public permissionless network on which it runs), but a DAO and its token holders should understand that each bit of information which is siloed outside of token governance effectively leaks sovereignty from its own token. This same concept applies with even greater significance to control. Any control ceded from the token to an outside party should be considered a direct loss of token holder sovereignty and weighed accordingly, as the actions of this outside party may be censored. So in this context, we can say that transparency is the antidote to complexity. However, given the generally subjective nature of DAO decisions, transparency is only as effective as the amount of time provided for a community to process information and debate. Therefore I draw the conclusion that a DAO can only be effective at scale if all information is public and its governance is exceptionally slow. With the key to censorship resistance being in token sovereignty, token holders must have a direct and not tangential incentive to govern properly. This means that they must be explicitly rewarded for good governance, and explicitly punished for bad governance — with the distinction between the two being an objective and hard-coded measurement. Since censorship is a total failure of governance, it is additionally beneficial if the protocol has a built in distribution mechanism in order to dilute the existing token holder pool should they be unable to govern due to censorship. For example, if a system begins to fail because parameter changes are being censored, the protocol must have a way of automatically redistributing its units of power to new un-compromised participants. These mechanisms may be unpopular with existing token holders, but systems are likely more fragile without it. Another consideration for DAOs is how resilient they can be to a successful censorship attack. If an attacker can prevent the protocol from receiving inputs, for how long can the DAO survive? This introduces another principle, and one that is relatively well accepted in today’s DAO-scape, that DAOs should attempt to minimize governance. The number of interactions with token holders can be considered to exponentially increase the likelihood of censorship, simply by making it more effective for an attacker to execute a “siege” on the DAO. For this reason, I have been an advocate of “set it and forget it” models whenever possible. More resilient DAOs will also have a thorough contingency plan to survive a censorship attack. In conclusion, the concept of a DAO is still in its early stages, but it would be a mistake to discount these organizations just because they are young. It’s hard to say what the future will look like, but I’d bet it’s full of DAOs. Society craves determinism, DAOs deliver it. This shift should not be particularly surprising either; we (i.e. humanity) have already seen the feudal/agrarian model organization give way to the corporate form. This happened when the means of production shifted from land to factories and other industrial mechanisms. Now the means of production are shifting to smart contracts, and in the not-too-distant future DAOs will be as common as corporations are today. We will ultimately be the generation of the permissionless public good, the generation of the censorship resistant organization.  700×918 134 KB  ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-150-thursday-july-15-17-00-utc/9331/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-53/9305",
                        "https://forum.makerdao.com/t/delegation-and-makerdao/9429/6",
                        "https://forum.makerdao.com/t/forum-at-a-glance-july-8-15/9362",
                        "https://forum.makerdao.com/t/maker-relay-ep-53-en-espanol/9330",
                        "https://forum.makerdao.com/t/mip57-rwa-committee/9304/15"
                    ],
                    "GPT-summary": "The author explains the concept of DAOs (Decentralized Autonomous Organizations) and their purpose as coordination mechanisms for actors operating a permissionless public good. The post discusses the nature of DAOs, their relationship with public blockchains, and the importance of censorship resistance. The author also explores the challenges of scalability and token holder sovereignty, and proposes solutions to maintain censorship resistance and good governance. The post concludes by suggesting that DAOs will become as common as corporations in the future.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.707667249082913
                },
                {
                    "author_link": "https://forum.makerdao.com/u/KryptoKnight",
                    "index": "#2",
                    "likes": "2",
                    "time": "08/07/2021-17:52:52",
                    "content": "Thank you for sharing. Given how new DAO’s are it’s interesting to hear a well-reasoned philosophical argument for their purpose, structure, strengths etc. - as I too think they will become commonplace in the not-too-distant future. I’m curious, how well do you think Maker fits your ideal definition of a true “DAO?” Are there any areas (transparency, censorship-resistance, governance speed etc.) that have room for improvement? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.275974025974026
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#3",
                    "likes": "7",
                    "time": "08/07/2021-17:54:53",
                    "content": "As you could probably infer, pretty much every conclusion I drew was from MakerDAO. I honestly think it’s the only functioning DAO at the moment. That being said, Maker is going through a lot of changes, and I want to ensure that we stay true to our core principles. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party giving feedback on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#4",
                    "likes": "3",
                    "time": "08/07/2021-17:54:55",
                    "content": "    g_dip:  “set it and forget it” models whenever possible   ^^^ THIS… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NH98",
                    "index": "#5",
                    "likes": "0",
                    "time": "08/07/2021-18:07:16",
                    "content": "Solid take. As you mentioned, there is certainly an efficiency cost related to taking decisions with DAOs. However, in the long run, I can definitely see this lack of efficiency being compensated by a decision process which involves more actors and lead to outcomes that are actually supported by those who put the work in and not unknown parties. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.446428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "1",
                    "time": "08/07/2021-18:59:07",
                    "content": "Nice write-up Greg.     g_dip:  the will of the token holders in a DAO is law.   In your opinion, how important is it to Diversify the quantity of DAO token holders? And in your opinion, can DAOs exist within the Real World Asset world–say a bunch of waiters, bartenders, etc., wanted to create a Restaurant DAO–how important is it that they implement the DAO core principles on-chain versus off-chain? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#7",
                    "likes": "0",
                    "time": "08/07/2021-19:33:31",
                    "content": "    flipflopflapdelegate:  In your opinion, how important is it to Diversify the quantity of DAO token holders?   I think Maker is designed to nicely mitigate this issue. Anyone who doesn’t vote implicitly defers to those who do, so a very small number of participants can operate the system should a large holder be censored. The flip side to this is that the “silent majority” needs to pay attention to make sure that smaller, more active group has not been compromised. At the end of the day, Flop auctions will save us from anything.     flipflopflapdelegate:  And in your opinion, can DAOs exist within the Real World Asset world–say a bunch of waiters, bartenders, etc., wanted to create a Restaurant DAO–how important is it that they implement the DAO core principles on-chain versus off-chain?   I’m sure it could, but I can’t imagine why anyone would subject themselves to this. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.120535714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "4",
                    "time": "08/07/2021-20:27:50",
                    "content": "Right. Amazing how in China commercialize fully autonomous robotaxis have been deployed throughout the Pingshan District, but here in the good ole’ U S of A we can’t even figure out the proper frameworks for a DAO. And then you wonder why Terminal A at LaGuardia Airport in stuck in the 1950’s haha ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.821428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#9",
                    "likes": "1",
                    "time": "08/07/2021-23:10:35",
                    "content": "Excellent write-up @g_dip. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#10",
                    "likes": "0",
                    "time": "09/07/2021-02:50:33",
                    "content": "Thanks for the thought provoking piece @g_dip . As someone who’s thought a lot about DAOs, what do you think their advantages are over their centralized counterparts (traditional corporate structures)? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#11",
                    "likes": "2",
                    "time": "09/07/2021-03:08:45",
                    "content": "Censorship resistance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#12",
                    "likes": "3",
                    "time": "09/07/2021-03:14:50",
                    "content": "Pretty sure an unscrupulous person with a $5 wrench could “censor” MakerDAO by just unloading on one of several key personnel or investors. So I don’t think we’re there yet. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MJMoonbow",
                    "index": "#13",
                    "likes": "0",
                    "time": "09/07/2021-05:58:26",
                    "content": "I wonder how minority regulations could work on a DAO. Could it be possible to protect minority opinions/uses within an anonym system, by regarding something like “history”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#14",
                    "likes": "2",
                    "time": "09/07/2021-09:00:59",
                    "content": "@g_dip Interesting piece.     g_dip:  This means that they must be explicitly rewarded for good governance, and explicitly punished for bad governance — with the distinction between the two being an objective and hard-coded measurement.   The mathematical (i.e. objective / logic) definition of good or bad outcome is something we may never achieve in its entirety. For “good” or “bad” to be defined and hence punished/rewarded it would mean that every single governance decision, before it is taken (i.e. voted), has a numeric bad or good outcome pre-defined. And that for punishment or reward to happen, every single governance decision is “performance” monitored systematically (embedded) against a bad vs good outcome definition. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0148809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#15",
                    "likes": "4",
                    "time": "09/07/2021-14:01:42",
                    "content": "Perhaps on a micro scale we’ll never achieve this, but at the macro we have Flop auctions. The outcome the Maker Protocol looks for is solvency. Solvency = good, insolvency = bad. Good outcomes are rewarded with burning, bad outcomes with dilution that brings in new MKR holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.136363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#16",
                    "likes": "2",
                    "time": "09/07/2021-14:04:02",
                    "content": "MakerDAO actually has some of the best minority protections of any DAO, if not the best. 7.5% of the token supply can settle the entire system at any time. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#17",
                    "likes": "0",
                    "time": "09/07/2021-19:42:53",
                    "content": "This relates to a discussion I had with a particularly prominent community member. I personally believe Signal Requests are not going to be used in 10 years. The exception being if signal request votes are weighted by MKR balance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#18",
                    "likes": "1",
                    "time": "09/07/2021-23:45:29",
                    "content": "    g_dip:  To study the nature of the “DAO,” we should first define it.   While deceptively simple, the best definition of a DAO I’ve come across is that it’s just an organization organized around a multi-sig wallet. I appreciate the nuance you bring in with permissionlessness and supporting public goods but I don’t think it’s possible to say that every individual who belongs to a DAO agrees, so while I would say that DAOs tend to be interested in supporting permissionless, public goods, I wouldn’t associate those factors by definition.     g_dip:  Thus we can expand our definition of a DAO to being a coordination mechanism to maximize censorship resistance.   That’s an interesting way to think about defining a DAO - I’m gonna have to let that one marinade.     g_dip:  I believe DAOs are extremely far away from becoming an efficient operating structure   I agree there remain a lot of misconceptions that DAOs somehow operate outside of legal systems and provide a simpler alternative to LLCs; where I think this conversation gets interesting is when we look at DAOs in the context of co-ops and organizations that operate using holocracy. Holocracies have historically struggled to overcome tragedies of the commons and I think part of the problem that’s gone unrecognized is that the real issue isn’t competition between members of the commons; it’s the difficulty involved in effectively allocating resources as a group. I’m speculating here, but perhaps the inclusion of tokens makes it easier for holocracies to understand what their resources are and avoid tragedies of the commons. On the other hand, maybe we’re just lucky to have a community that’s particularly effective at stewarding our resources. Swarmwise is a particularly interesting case study that focuses on the Swedish Pirate Party’s success in joining the Swedish Parliament in 2009.     g_dip:  token holders must have a direct and not tangential incentive to govern properly.   100% agree, and I think this is too often overlooked. “If you build it, they will come” doesn’t cut it when it comes to governance. Redistributing power in an emergency scenario’s an interesting idea as well. ",
                    "links": [
                        "https://falkvinge.net/2013/02/14/swarmwise-the-tactical-manual-to-changing-the-world-chapter-one/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.2515432098765435
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#19",
                    "likes": "2",
                    "time": "10/07/2021-01:30:08",
                    "content": "I understand the desire to philosophize though I think the most accurate way to describe MakerDAO – and not other purported DAOs – is as a member-managed LLC. MKR holders are sophisticated; understand what they vote for/against; contribute independently (which offers us the chance to capture multiple points of view with any decision); do not depend on any person or team for information core to decision making; and control, in total, the economic destiny of our shared public good. That sounds to me like a member-managed LLC (which can be designed to operate like a “cooperative”, so those two corporate forms are not necessarily in opposite). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.947115384615385
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dor",
                    "index": "#20",
                    "likes": "2",
                    "time": "14/07/2021-05:53:16",
                    "content": "Great to see this out! Will have to let it marinate for a while and come back.     g_dip:  I believe DAOs are extremely far away from becoming an efficient operating structure.   I think there is some more nuance there, clearly, you are right now with the current stage of things and I 100% agree that having a centralized organization could be more efficient, but I’ve seen so many centralized organizations become slow and inefficient as the leaders go astray (bad tyrants) and/or when the organization grows and you have a bunch of people all fighting to be the tyrant. This almost seems to be inevitable so can’t DAOs be more efficient over a longer period of time?     seth:  I’m speculating here, but perhaps the inclusion of tokens makes it easier for holocracies to understand what their resources are and avoid tragedies of the commons.   Also +1 to this ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.048469387755102
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dor",
                    "index": "#21",
                    "likes": "1",
                    "time": "14/07/2021-16:49:05",
                    "content": "The time horizon you evaluate good/bad decisions is also important and tricky ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#22",
                    "likes": "2",
                    "time": "14/07/2021-21:00:22",
                    "content": "    g_dip:  Solvency = good, insolvency = bad.   Nice one, I thought flop auctions would be the answer. Ok, so we know the dependant variable (i.e. target outcome). Monitoring the regressors (independent variable) and their performance on our constant governance process should really be the goal. In a true experiment, i.e. hypothesis testing, we would isolate changes in regressor (risk parameter changes) to measure their impact on outcome. I do not believe this is done now or whether it is even feasible in a micro scale under the current vote bundling framework where multiple inputs are changed at once. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#23",
                    "likes": "0",
                    "time": "14/07/2021-21:18:29",
                    "content": "Additionally I don’t think the process has been defined well enough to establish a control. But this is an opportunity in my opinion, we get to approach the issue from first principles and build the process moving forward with this outcome in mind. Would love to pick your brain at some point to see how you think about it in more detail. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#24",
                    "likes": "1",
                    "time": "14/07/2021-21:33:03",
                    "content": "Reinstating a scientific method for decision making. That would work yeah. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#25",
                    "likes": "0",
                    "time": "14/07/2021-21:37:11",
                    "content": "I mean we literally call it “scientific governance and risk”  Like I said, would love to work with you on this if you have the time! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.78125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#26",
                    "likes": "1",
                    "time": "14/07/2021-22:04:17",
                    "content": "Time is my (our) most limited resource. But I have by default an “open door policy”. So yeah. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.071428571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Pinotio.com",
                    "index": "#27",
                    "likes": "1",
                    "time": "23/07/2021-11:44:44",
                    "content": "Thanks for the thoughtful post @g_dip . Could you provide a definition for censorship in the context of DAOs? Could you provide one or two brief examples? Thanks ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#28",
                    "likes": "3",
                    "time": "27/07/2021-15:06:20",
                    "content": "    Pinotio.com:  Could you provide a definition for censorship in the context of DAOs?   As mentioned, I equate the concept with sovereignty. A sovereign entity can do what it pleases without the concern that it can be stopped. As a general rule, the US and China are sovereign nations because (barring an unprecedented level of coordination) no other nation or current group of nations can actually stop them from doing it. In this sense, they are censorship resistant. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.7125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/imkharn",
                    "index": "#29",
                    "likes": "8",
                    "time": "29/07/2021-18:37:36",
                    "content": "I spoke with Vitalik on skype in 2017 and got his help coming up with a definition of a DAO. I continually proposed definitions and then he would provide an example of something that fit the definition but was clearly not a DAO. Eventually I arrived at the below definition that he was unable to find issue with: “An entity that exists in multiple redundant locations, has sovereign control over internal capital, and prohibits unintended modifications of its assets or mechanisms.” To me the last part about unintended modifications is about having immutable terminal goals… essentially autonomous goals. I define the limits of autonomous thusly: “A system is not autonomous if incentives preventing open ended changes to mechanisms or purpose are intentionally less than the plausible maximum. If a system intentionally has a weakness that enables agents to override the intended functioning of the system it is not autonomous” In other words, if a system isnt designed to try in every way to prevent or make impossible for governance token holders to take actions that conflict with the mission statement / original intent of the system, it is not autonomous, and is therefore not a DAO.   Lots of systems call themselves a DAO even when governance token holders are able to act against the mission statement or take all user funds even when there exists mechanisms that could prevent this they chose not to implement. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.12962962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#30",
                    "likes": "0",
                    "time": "29/10/2021-00:38:06",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}