{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/paxg-pax-gold-as-mcd-collateral/2423",
            "title": "[PAXG] - PAX Gold as MCD collateral ",
            "index": 2423,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "paxg"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#1",
                    "likes": "6",
                    "time": "09/05/2020-19:54:23",
                    "content": "Hi everybody. I have not seen any recent discussion of gold backed tokens in the forum, so I decided to create a new topic here. PAXG is a standard erc20 token with approximately $43 million market cap compared to dgx market cap of around $6.5 million. Having gold backed tokens in our system would be a big step in diversification of maker collateral. It would be the first non-stablecoin asset with a low correlation to ethereum and the broad cryptocurrency market. Gold also has low volatility when compared to cryptocurrencies and so could help reduce system wide liquidation risk like we saw on Black Thursday. There are also unique financial opportunities here for retail investors to leverage gold, which is likely to attract new users in the long term. Leveraging gold with traditional brokers can be difficult and costly. Due to the nature of tokenizing physical assets, there is centralization/custodial risk with the PAXG token, but this is likely lower than the custodial risk with traditional financial instruments, and PAXG monthly audits can relieve some of the concerns here. In any case this risk is something that as of now is unavoidable for physical assets. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-may-14-9am-pst-4-00-pm-utc/2497/2",
                        "https://forum.makerdao.com/t/paxg-collateral-onboarding-risk-evaluation/4833/18"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.920533459595959
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#2",
                    "likes": "1",
                    "time": "10/05/2020-02:57:25",
                    "content": "I think the main blocker for PAXG is the 0.02% on chain transaction fee: https://help.paxos.com/hc/en-us/articles/360042322531-What-are-on-chain-transaction-fees-Are-they-the-same-thing-as-gas- ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#3",
                    "likes": "0",
                    "time": "10/05/2020-18:15:48",
                    "content": "What technical problem does that cause? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#4",
                    "likes": "2",
                    "time": "10/05/2020-19:01:28",
                    "content": "Wouldn’t the main issue there just be making sure that vault holders are informed of that fee? Since the fee is automatically handled, is there even any action that would need to be taken by makerdao? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OliverNChalk",
                    "index": "#5",
                    "likes": "1",
                    "time": "11/05/2020-14:27:26",
                    "content": "I would be interested in knowing the tech cost to add a XAU/USD price feed to the system. Keeping in mind we could ideally re-use this price feed for all other gold-backed tokens in the future. As for listing PAXG, beyond the technical and social cost of adding another collateral, I don’t see any reason not to list PAXG with a reasonable risk premium & debt ceiling. Example starting values could be:  Risk Premium: 5% Debt Ceiling: 500K DAI Collateralization: 115%  Regarding on-chain transaction fee, I would suggest reaching out to the PAXG team and seeing what they think about MakerDAO circumventing the fee. As I understand it, every ERC-20 Maker adds is wrapped in Maker’s own ERC-20 contract to standardize interactions with the token? I might be wrong here but if that isn’t already happening, we could easily introduce it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8143939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ilan",
                    "index": "#6",
                    "likes": "6",
                    "time": "12/05/2020-18:45:09",
                    "content": "Just want to say hi here. I’m a developer at Paxos and am happy to answer any questions y’all have. Excited to see the community have an interest in PAXG! Maybe we can get an MIP together to get more input from other community members? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0546875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#7",
                    "likes": "3",
                    "time": "13/05/2020-06:28:33",
                    "content": "@ilan, I think there is a good possibility that Paxos Gold will be well received as gold in general is a very good store of value. Here is a link to the MIP6 application form MIP6: Collateral Onboarding Form/Forum Template. If you look at the applications sent in by the other teams it is primarily the questions under MIP6c2 that needs to be filled in. While other parties may fill in the application for you, it is much preferable you do this yourself as you are in much better position to answer any questions related to the application. Ok? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.550000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#8",
                    "likes": "3",
                    "time": "14/05/2020-05:23:40",
                    "content": "Hey @ilan I want to echo what planet_x said. It would be significantly better if you or someone from your team could fill out an official application. Let us know if we can assist in any way. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#9",
                    "likes": "0",
                    "time": "15/05/2020-00:43:53",
                    "content": "I had no idea tokens could have built in transaction fees!? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Metternich",
                    "index": "#10",
                    "likes": "3",
                    "time": "17/05/2020-15:46:47",
                    "content": "I think adding a gold based token is basically a great idea. But it my opinion it has to be verified, that the used token is absolutely trustable. Paxos writes the following on its website ( https://www.paxos.com/paxgold/): <<Redeemable PAX Gold is the only gold token that you can redeem for LBMA-accredited Good Delivery gold bullion bars. For additional convenience, smaller amounts can be redeemed through a network of physical gold retailers around the world. Institutional customers can also redeem for unallocated Loco London Gold. Paxos customers can always redeem for USD at current gold market prices.!>> Exactly this should be checked. As long as this is the truth, and the token can really be exchanged against physical gold (minus a small fee), the asset seems trustworthy. Furthermore another question should be asked: What happens if the organisation behind Paxos Gold goes bankrupt?   paxos.com    PAX-Gold-Whitepaper.pdf 302.82 KB       According to their whitepaper that wouldn’t be a problem at all. <<Bankruptcy Remote - Since PAX Gold is issued by a state-chartered trust company, customer assets are kept separately from the company’s assets. All gold bars represented by PAX Gold tokens are custodied by Paxos for PAX Gold holders and do not become a part of the company’s estate in the event of the company’s insolvency.>> Furthermore Paxos writes:    Paxos    Why do I need 430 PAXG tokens plus fees to redeem a bar of gold? London Good Delivery gold bars range from 370-430oz, so your account must be able to cover the full cost of whichever bar of gold becomes available to you. Additionally, There are small fees associ...      << Why do I need 430 PAXG tokens plus fees to redeem a bar of gold? London Good Delivery gold bars range from 370-430oz, so your account must be able to cover the full cost of whichever bar of gold becomes available to you. Additionally, There are small fees associated with these processes, therefore a customer must hold enough PAXG to cover these costs.>> This would mean, that if everything goes wrong, you’d at least have the chance to get a full gold bar. But that would only be possible if you owned 430oc of gold + fees. That would have to be considered in accepting PAXG as collateral. Maybe via a risk premium like @OliverNChalk has suggested.? The last questions concerns the liquidity of PAXG. Is there a liquid market for the tokens? Maybe there is someone who has made experience with the whole process. I’d like to hear your opinions on that. ",
                    "links": [
                        "https://www.paxos.com/wp-content/uploads/2019/09/PAX-Gold-Whitepaper.pdf",
                        "https://www.paxos.com/wp-content/uploads/2019/09/PAX-Gold-Whitepaper.pdf",
                        "https://www.paxos.com/wp-content/uploads/2019/09/PAX-Gold-Whitepaper.pdf",
                        "https://help.paxos.com/hc/en-us/articles/360042322051-Why-do-I-need-430-PAXG-tokens-plus-fees-to-redeem-a-bar-of-gold-",
                        "https://help.paxos.com/hc/en-us/articles/360042322051-Why-do-I-need-430-PAXG-tokens-plus-fees-to-redeem-a-bar-of-gold-"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.583928571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#13",
                    "likes": "4",
                    "time": "21/05/2020-02:13:44",
                    "content": "1. Who is the interested party for this collateral application? A member of the makerdao community. Perhaps the makerdao community in general is interested as PAXG is a high market cap, low volatility token which represents a well established asset, namely gold, to help stabilize the dai peg and collateralization levels in the maker ecosystem. 2. Provide a brief high-level overview of the project, with a focus on the applying collateral token. PAX Gold (PAXG) is an erc20 token. Each token is backed by one fine troy ounce (t oz) of a 400 oz London Good Delivery gold bar, stored in Brink’s vaults. If you own PAXG, you own the underlying physical gold, held in custody by Paxos Trust Company. 3. Provide a brief history of the project. Since its founding in 2012, Paxos has always sought to enable the movement of assets, starting with the launch of the itBit exchange in Singapore. In 2015, the New York State Department of Financial Services granted Paxos a limited-purpose trust charter, thus establishing it as the first company approved and regulated to offer crypto products and services. By seeking the highest forms of regulation and compliance, Paxos has distinguished itself within the blockchain industry and earned the trust of discerning institutional and individual investors. Paxos has since continued to operate within established regulatory frameworks while creating innovative new products. This includes workstreams in the tokenization of securities, precious metals and commodities, such as the Paxos Standard token, a digital dollar launched in 2018. Along the way, Paxos has raised over $93M in venture funding, added distinguished luminaries including Sheila Bair and Senator Bill Bradley to the board, and grown to 110 employees in three global offices. 4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. white paper: https://www.paxos.com/wp-content/uploads/2019/09/PAX-Gold-Whitepaper.pdf APIs: https://www.paxos.com/apis/ 5. Link any available audits of the project. Both procedural and smart contract focused audits. audit FAQ: https://www.paxos.com/is-paxos-audited/ attestation reports link: https://www.paxos.com/ 6. Link to any active communities relating to your project. paxos is not decentralized/community driven, but has a blog: https://www.paxos.com/blog/ 7. How is the applying collateral type currently used? collateral is used as a cryptocurrency representation of gold which is redeemable for 400 oz gold bars directly through PAX (in 400 token increments) or for smaller amounts through a network of physical gold retailers around the world 8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? Yes, PAX has headquarters in New York City, Singapore, and London 9. Where does exchange for the asset occur? Kraken is the largest exchange for PAXG at the moment, although there is also some volume on other exchanges as well a uniswap pair (with minimal volume): https://www.coingecko.com/en/coins/pax-gold#markets The rest of these questions should be answered by @ilan or someone else who is better positioned to answer them than me:  (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. (Optional) List any possible oracle data sources for the proposed Collateral type. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type.  ",
                    "links": [
                        "https://www.paxos.com/apis/",
                        "https://www.paxos.com/is-paxos-audited/",
                        "https://www.paxos.com/",
                        "https://www.paxos.com/blog/",
                        "https://www.coingecko.com/en/coins/pax-gold#markets"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.605501059224464
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "2",
                    "time": "21/05/2020-10:06:37",
                    "content": "@befitsandpiper Would you mind posting the application text as a new thread in the MIPs section of the forum as specified in  MIP6 (https://github.com/makerdao/mips/blob/Accepted/MIP6/mip6.md)? It’s better if we can keep all the applications in a consistent and referable place. By all means refer back to this thread for context from there. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.107954545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ilan",
                    "index": "#15",
                    "likes": "3",
                    "time": "22/05/2020-19:36:40",
                    "content": "@befitsandpiper thank you so much for putting this together!! I was going to work on this this weekend and you went ahead and put together a great application already. I’m going to go over what you posted, plus some responses we’ve seen in the thread so far with a couple people from our team and add any additional information ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.020833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#16",
                    "likes": "2",
                    "time": "22/05/2020-21:14:53",
                    "content": "just as an FYI the actual MIP thread relating to this asset can be found here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ffrenchman",
                    "index": "#17",
                    "likes": "0",
                    "time": "02/04/2021-12:37:07",
                    "content": "How does one evaluate/audit the gold backing PAXG and the token supply? The data they provide is all over the place and the different sources conflict with each other. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#18",
                    "likes": "2",
                    "time": "02/04/2021-13:30:11",
                    "content": "Feels like this might be better covered on the risk evaluation thread. Going to close this one so as not to split the discussion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#19",
                    "likes": "0",
                    "time": "02/04/2021-13:30:13",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}