{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-should-begin-moving-away-from-the-dollar/4708",
            "title": "MakerDao Should Begin Moving Away from The Dollar ",
            "index": 4708,
            "category": [
                "Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/nanook",
                    "index": "#1",
                    "likes": "2",
                    "time": "12/10/2020-20:20:29",
                    "content": "The US dollar is currently in decline, and along with it the supremacy of the USA as the global ruler. Combined China, Eu, Russia, and countries in the middle east have all began to move away from the dollar as the world reserve and are adopting others. While the dollar has a long history of being the world’s standard which is why many companies like MakerDao adopt it, the truth is that history cannot always tell us about the future. Many other currencies are appreciating against the dollar and have been for some time now, and with even more stimulus talks on the way this can only accelerate the process of the dethroning of the dollar as world reserve currency. However, I do not believe that Dai should just jump to the next major currency like the euro or yuan if it hopes to be a truly global currency. The UN has been alluding to a currency based on an index of many major world currencies. For example, in such an index if a single countries currency depreciates due to excessive printing, then it will be offset by others appreciating thus evening out the index. If Dai were to create or track an index of many major currencies instead of just the dollar, then it would greatly add to the reliability and stability of the coin. Trust would be much stronger thus making adoption easier. TLDR: A global coin should track an index of all currencies. This would greatly aid in stability, reliability, trust, and adoption of the coin. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-114-thursday-october-15-16-00-utc/4657/2"
                    ],
                    "GPT-summary": "The author proposes that MakerDao should move away from the US dollar and instead track an index of many major world currencies to create a more stable and reliable global coin. The post explains the reasoning behind this proposal and suggests that it would increase trust and adoption of the coin. A 3rd party could give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.743475274725275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#2",
                    "likes": "0",
                    "time": "12/10/2020-21:00:37",
                    "content": "I have the impresion that MakerDAO does not plan to add any major new features after it finishes the current ones. I guess the community will have to find funding and do it themselves. I don’t see any practical use for an index of all currencies but I think non-US users should be given the opportunity to use their local currency in MakerDAO. Other currencies could help with the peg which is abandoned 7 months ago. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.073863636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nanook",
                    "index": "#3",
                    "likes": "0",
                    "time": "12/10/2020-21:05:18",
                    "content": "I said it in the OP. The benefits of the Dai tracking an index of global currencies is much greater stability and reliability which translates to greater trust and easier adoption as a legitimate currency for general payments. It is the right thing to do in the long term because at the moment if the dollar falls off a cliff, then so does MakerDao. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.071428571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#4",
                    "likes": "2",
                    "time": "13/10/2020-07:28:12",
                    "content": "If you live and work in the US, why do you worry about EUR/USD ratio or gold/USD ratio? DAI is a US-centric system. DAI just saves you from keeping your earned USD in a bank. For investment you have stocks, indexes, YFI and thousands of other investment options. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.028409090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "8",
                    "time": "13/10/2020-11:52:05",
                    "content": "    bit:  Other currencies could help with the peg which is abandoned 7 months ago.   @bit you need to stop saying stuff like this as if it’s a fact. It’s confusing to new users. We haven’t abandoned the peg.     nanook:  A global coin should track an index of all currencies. This would greatly aid in stability, reliability, trust, and adoption of the coin.   It was originally planned that DAI would be pegged to the SDR basket. The problem is that most people don’t know what that is, and would rather transact in something that they understand (like dollars.) I’m not sure it would have the affect on adoption that you’re predicting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.710227272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nanook",
                    "index": "#6",
                    "likes": "1",
                    "time": "13/10/2020-14:25:54",
                    "content": "If you are abandoning the peg, then what is the point in MakerDao at all? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#7",
                    "likes": "0",
                    "time": "13/10/2020-22:15:49",
                    "content": "Maybe go back to the gold standard (i.e. PAXG)? It has existed since time immemorial and has plenty of liquidity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "1",
                    "time": "14/10/2020-00:15:18",
                    "content": "Unfortunately (fortunately for us Yankees ) the mighty U.S. Dollar is the most powerful weapon in the World. It is accept anywhere, and everywhere in the world–like you said, the Reserve currency of the world. As long as that is the case, 1 DAI = $1 USD and that should remain the mission of the protocol, IMO. IMO, one of the biggest reasons why BTC was never outlaw to U.S. Citizens is because it is Quoted/paired to the USD. Think about that. And take a look at Facebooks/Libra and their attempt to not be paired equally to the USD.  Unfortunately the U.S. has some gigantic weapons at their disposal. Sorry mate–but maybe in our Great Grandkids life the USD will no longer be this powerful. What to do… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#9",
                    "likes": "1",
                    "time": "14/10/2020-00:18:43",
                    "content": "Well…never under estimate the Chinese yuan…belt & road etc etc. However agreed that dai should be pegged to whatever unit of account has the most use case/reserve value and right now and for the foreseeable future can’t see usd not being the one ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.982142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#10",
                    "likes": "1",
                    "time": "14/10/2020-00:20:43",
                    "content": "@mario When was the last time you went to a coffee shop in Buenos Aires, or Montevideo and you asked if could pay for that cup of coffee with the Yuan? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#11",
                    "likes": "2",
                    "time": "14/10/2020-00:23:12",
                    "content": "Ask me in 10 years? My chest just inflated when you mentioned montevideo though  PS: I believe sooner rather than later more than one coffee shop in argentina will accept yuan if chinese pay in yuan and in return a sweet cup of coffee together with some warm water ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#12",
                    "likes": "0",
                    "time": "14/10/2020-00:25:23",
                    "content": " you really believe that? Oh man. Hard for me to see that happening – even in 10 years. I like to believe that the people of Montevideo will accept DAI, or even ETH. But Maybe you’re right. Time will tell… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.323412698412699
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#13",
                    "likes": "0",
                    "time": "14/10/2020-00:28:40",
                    "content": "Nahh, not really but honestly I don’t discount it either. If i see a coffee shop accepting dai though…my oh my, expect full coverage from my side!!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.97265625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nanook",
                    "index": "#14",
                    "likes": "1",
                    "time": "14/10/2020-01:41:14",
                    "content": "Honestly, I think the world is getting fed up king dollars shit. Hell I am several generations born and raised in America, and I don’t want to hold uncle Sams over printed garbage anymore. I can see the writing on the wall. This isn’t post WWII anymore with all the countries destroyed except the USA giving us free reign of economic growth. Now competition exists, and so far I don’t see America faring well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nanook",
                    "index": "#15",
                    "likes": "1",
                    "time": "14/10/2020-01:49:50",
                    "content": "But I mean, good luck getting the big votes in MakerDao governance to understand the direction the dollar is going. Instead of focusing on the original idea of a decentralized stable coin succeeding, they are more concerned about raising stability fees, hiking collateral ratios, and on boarding as much shit they can to boost MKR so they can pump and dump. As soon as the whales got the majority of the vote the hope for a decentralized stable coin divorced from the fed was forfeited. Back to buying gold for me I guess. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.758928571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#16",
                    "likes": "1",
                    "time": "14/10/2020-02:17:45",
                    "content": "I think that is a mid-term goal and it is still too early. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nanook",
                    "index": "#17",
                    "likes": "0",
                    "time": "14/10/2020-02:31:21",
                    "content": "Because I am tired of Powell making money printer go brrrrr! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iliadou",
                    "index": "#18",
                    "likes": "1",
                    "time": "14/10/2020-08:10:52",
                    "content": "I agree with the thought of moving away from the dollar in the long run. For faster adoption at present, though, it is necessary to keep the dollar-pegged DAI and start creating DAI versions pegged to other major currencies. We see Central Banks scrambling to catch up. Right now they say CBDC will exist alongside cash and existing electronic money, but I do not think it will take very long before some CBs will claim a sovereign monopoly to the issuance of money, prohibiting anything backed by or pegged to the sovereign fiat currency. So it would definitely be prudent for the Maker community to start thinking about this scenario. A gold-backed token sounds interesting, but has the disadvantage of being “centralised” due to storage and therefore being seizable by authorities. This risk could be mitigated somewhat by choosing a solid jurisdiction (e.g. Switzerland). I think BTC can be a contender too. If it proves to have a value behaviour similar to gold and it enjoys a high level of trust by the people of the world (yes, fiat in Latin), its decentralised nature and capped issuance can bring it a long way to pick up this role. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.279129464285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#19",
                    "likes": "1",
                    "time": "14/10/2020-09:01:54",
                    "content": "    nanook:  Instead of focusing on the original idea of a decentralized stable coin succeeding, they are more concerned about raising stability fees, hiking collateral ratios, and on boarding as much shit they can to boost MKR so they can pump and dump.   This is not the case. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#20",
                    "likes": "1",
                    "time": "14/10/2020-12:24:44",
                    "content": "While it’s not explored often, many stablecoins that are pegged to “index of many major currencies” simply haven’t gained momentum and several instead moved to major currencies. For example, Terra used to promote Terra SDT, which was pegged to IMF Special Drawing Rights (SDR). However, there’s not much usage and demand. So they instead started to focus on Terra stablecoins that are pegged to KRW and USD. Other stablecoins that are pegged to SDR like Xank, MILE, and etc also faced similar issues. But if there are stablecoins that are pegged to SDR that are doing well, I am happy to learn about them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.935064935064935
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#21",
                    "likes": "1",
                    "time": "14/10/2020-15:19:06",
                    "content": "Maybe the solution is to make different versions of DAI pegged to gold, bitcoin, SDR, etc. and see which are adopted by the community and the ones that aren’t we abandon. Since user adoption is what determines product-market fit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#22",
                    "likes": "0",
                    "time": "14/10/2020-16:37:53",
                    "content": "In most countries it’s not legal to pay with USD directly, and you can convert euro or yen as easily as USD. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ben_Lilly",
                    "index": "#23",
                    "likes": "1",
                    "time": "16/10/2020-15:46:44",
                    "content": "Is there a way to create a SDR version that acts as a basket of various currencies, including BTC and Gold? And do this without getting rid of DAI? The greenback system is real and isn’t going anywhere in the near term. While everybody fears “brrrrr” will devalue the dollar, it’s important to ask if it’ll be devalued in relation to other currencies. Historically, democratic controlled white houses have been VERY correlated with the DXY getting stronger. So it’s not a given that a weaker dollar is in the future. But the SDR basket has merit. If Maker decides to implement something similar, it might make sense to do it as a second debt backed currency, with some originality that takes into consideration “the new financial economy” by including BTC and Gold. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.350524475524475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#24",
                    "likes": "2",
                    "time": "20/10/2020-02:00:09",
                    "content": "I am also in favor of a diversified pool of currencies tGBP, tCHF, tEUR, PAXG, BTC, etc. The reality is that these currencies have too much to lose to not be part of the future economy, but we should add Bitcoin and Gold to act as a ballast. We can debate whether they should be equally-weighted or market cap-weighted. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#25",
                    "likes": "0",
                    "time": "19/01/2021-08:00:12",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}