{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/pr-talking-points-regarding-usdc-as-collateral/1648",
            "title": "PR Talking Points regarding USDC as collateral ",
            "index": 1648,
            "category": [
                "Governance"
            ],
            "tags": [
                "stablecoin",
                "emergency-response",
                "usdc",
                "covid-crash",
                "pr"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "2",
                    "time": "17/03/2020-14:22:30",
                    "content": "Hey all, So as most of you are aware (and probably expected) there is some level of backlash against MakerDAO adding USDC as collateral. This came up in the governance and risk chat today. A number of us used a novel method of consensus building in the #consensus-test channel on rocket-chat to generate a list of talking points that can be used to help combat disinformation and hopefully accurately communicate intentions (as far as is possible in a decentralized system.) The output of that process is below:    Due to the unprecedented situation in markets, both traditional finance and crypto, DAI went through a major liquidity crisis. Due to the massive demand for DAI liquidity the price spiked to $1.08. To help improve DAI’s liquidity and to keep MakerDAO functioning through future market movements, the MKR community chose to add a maximum of $20 million of Dai issued against USDC collateral*.   Dai liquidity is important for two main reasons. Allowing keepers to participate in auctions, and so that Vault users can close Vaults without paying an excessive premium on Dai.   We are aware USDC comes with regulatory and blacklist risks. Due to these risks, we intend for USDC to remain as small a percentage as possible while maintaining Dai liquidity.   MKR Holders have the capability to remove USDC as a collateral type or lower the debt ceiling in the future.   With the 20% SF on USDC there will only be a large incentive to mint Dai using USDC during times of liquidity crisis where the Dai/USDC arb is profitable. We expect to see Dai minted from USDC collateral to be close to zero outside of these times.    Here’s a poll where you can agree / disagree with these points. Comments are of course also welcome. Poll is multiple choice with 2 max options to allow people to signal agreement/disagreement mixed with conflict. Edit: Nope I didn’t double check and max options is 3. Oh well.     I agree with the above listed points. I disagree with the above listed points. I am conflicted on the above listed points.     0 voters     *Edited due to factual inaccuracy. Previously this was: 'USDC collateral to the existing collateral pool.' ",
                    "links": [],
                    "GPT-summary": "The author of the post is explaining the decision to add USDC as collateral to MakerDAO and providing talking points to combat disinformation. A 3rd party may give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.375270562770563
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "5",
                    "time": "17/03/2020-14:48:12",
                    "content": "Also, it would be nice to include a promise to add more stablecoins ASAP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leighton",
                    "index": "#3",
                    "likes": "7",
                    "time": "17/03/2020-14:58:27",
                    "content": " Something that I think is missing from USDC narrative… 1. Historically the only assets MakerDAO accepts as collateral are subject to highly volatile prices (these assets are Ethereum and BAT). 2. During recent market volatility these assets have crashed in value making it incredibly difficult to keep the price of Dai pegged to 1 dollar. It also made it very risky to mint new Dai as the underlying asset might get liquidated as the crash continues. 3. In light of this, it was necessary to add a form of collateral that is price stable. As of today, MKR holders determined that USDC is the best form of price stable collateral. 4). As the entire ecosystem matures we anticipate major price movements will become more rare and there may no longer need to be a price stable collateral option and / or a better price stable collateral option will emerge.  Basically, don’t say “we added USDC” say “we needed a more price stable collateral option, right now that is USDC” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.836292435634541
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#4",
                    "likes": "2",
                    "time": "17/03/2020-15:36:40",
                    "content": "  Is fair although ignores emergency shutdown as an alternative option. Maybe being honest and admitting that the system was not yet robust enough to survive as intended, so emergency centralized fiat had to be added to balance supply/demand? Is that not what happened?   Lack of liquidity although abstract, appears fairly analogous to lack of stability.   4 rubs me the wrong way, not sure why. Maybe because its slightly misleading. MKR holders can change almost anything at any point. Highlighting that would be more honest/accurate communication. They added USDC because emergency shutdown was considered not an acceptable alternative (although it was barley discussed). 5 Is speculative and does not take into account that the future is different from the present. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.719696969696971
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#5",
                    "likes": "2",
                    "time": "17/03/2020-17:42:57",
                    "content": " Agree with @psychonaut, a point about diversifying among stablecoins would be good. I’m not sure that point 5 is correct. Is normal-times liquidity such that someone with say 12M in USDC could almost instantly borrow 10M DAI? If not, then there may be continuous, cycling use of the lending offer for participants who decide to do short-term plays using DAI. So I would remove point 5. Point 3 on risk should be expanded twofold: a) we will later assess what an acceptable percentage of total collateral USDC can be, and b) we will continuously tune the other parameters.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.232142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#6",
                    "likes": "3",
                    "time": "18/03/2020-02:39:07",
                    "content": "I want to echo others sentiments @swakya @psychonaut should really spread the blacklist risk by adding 1 or more stablecoins and spread the DC across them. As to PR talking points.   I don’t think the community is clear but honestly these added options should really be ONLY an emergency measure and not a sustained addition.   Really adding only one which has the greatest blacklisting risk - itself is risky. ALso no discussion that MKR basically will potentially backstop any blacklisting risk on USDC might have been important. 5 is speculative and pretty much fits under the ‘this is an emergency and expected to be temporary measure’.   (4) pretty much stands at all times if anyone understands the system.   The whole point is executives are passing because of whales in <2hrs anyway at this point - community or no community. I also want to add a point NOT discussed as far as I can tell and being completely avoided.   Conditions where an ES is warranted.   So far it appears Maker would rather let all assets plunge to zero rather than ES the system.   It tells me that the ES is not an effective emergency solution because I think Maker realizes it hoses all DAI holders (collateral value in system is < than value of DAI) particularly with DAI trading > PEG and pretty much sends a message to rest of community of giving up where as the ES - as intented is meant to protect all participants in the system by giving everyone a reasonable and fair/known out. Today there was talk about SCD shutdown.   Notice what happens in this case in this event (ES in either system) effectively unlocks collateral that previously was locked up to satisfy higher than 100% LR requirements, and everyone holding what they felt was ‘cash’ ala DAI now will trade with price of ETH relative to the OSM price and backing collateral still in the system.  The race to claim collateral and sell exits will be so fast it won’t be funny.  Which is why the powers that be are doing anything they can to avoid an ES (which they should also avoid on the SCD for same reasons) This whole ES issue avoidance and reprocussions to DAI holders in particular I think is something that the community as a whole should not be burying away in this whole - DO ANYTHING except ES the system approach to Maker.   If ES is such a bad option the community better be thinking about making better system halting options and explain to people what the implications of these are to them (vault holders, MKR holders, DAI holders). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.014957264957265
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#7",
                    "likes": "2",
                    "time": "18/03/2020-07:54:59",
                    "content": "Yes you just articulated my feelings about this ES topic avoidance. I didn’t listen carefully before when you explained how the high growth path everyone wants is extremely dangerous. Now I see the concern clearer. MCD is a novel system with many unique designs, we should expect that the emergency mechanisms will be needed. When those mechanisms are untested (or sub optimal) maximizing growth seems rather rash/unscientific. your point: \"So far it appears Maker would rather let all assets plunge to zero rather than ES the system. It tells me that the ES is not an effective emergency solution because I think Maker realizes it hoses all DAI holders (collateral value in system is < than value of DAI) particularly with DAI trading > PEG and pretty much sends a message to rest of community of giving up where as the ES -as intended is meant to protect all participants in the system by giving everyone a reasonable and fair/known out.\" is salient. Between ES, auctions, and governance (Quickly my concerns on governance: Where is the scientific input for governance design? Sociology/poly sci/network analysis are all big academic topics, there is highly relevant material to explore, I have seen no critical engagement in those topics. Are we most accurately plutocracy dressed up as a dao? How to address?) there is fundamental work to do still. Enticing people and marketing the platform seems somewhat predatory at this stage. Sorry for the negativity. Suddenly wanted to express these thoughts ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.758333333333333
                }
            ]
        }
    ]
}