{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/off-chain-mips-collateral-update-what-s-going-on/14530",
            "title": "Off-Chain MIPs Collateral Update: What\\xe2\\x80\\x99s Going On ",
            "index": 14530,
            "category": [
                "Collateral Onboarding",
                "Domain Work"
            ],
            "tags": [
                "mips",
                "risk-domain-work",
                "highlight-announcement"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#1",
                    "likes": "13",
                    "time": "08/04/2022-19:09:06",
                    "content": " Off-Chain MIPs Collateral Update: What’s Going On Authors: @williamr, @eumenes, @teej, @christiancdpetersen, @luca_pro During the last months, RWF-001 (or RWF) has worked closely with several potential counterparties that have approached the DAO in order to partner as borrowers, or in other words, providers of off-chain collateral to be onboarded. Consistent with the proposed MIP67, the relevant stakeholder CU teams are committing to do their best to facilitate the review of each proposal based on the process outlined in the MIP. In doing so, however, the teams will necessarily have to prioritise the proposals that Maker has received. In each phase of the collateral onboarding process, the prioritisation will depend on a combination of factors that include, among others:  Current status along the collateral onboarding process Potential financial impact for the protocol Perceived financial and execution risk Level of completion and available details Perceived quality of the counterparty Perceived strategic value in the transaction  It is clear that this prioritisation effort will necessarily come with some level of discretion that the teams will try to qualify in their recommendations. According to MIP0, “MIPs are standardised documents subject to voting that (once enacted) regulate and define the behaviour of the Maker Governance and the Maker Protocol.” Given the finality of the terms “regulate” and “define”, RWF, as well as incubating LTS and LOVE, want to offer the Community a snapshot of what the group intends to be working on.  Summary of Proposals Below, we share a high-level summary of the existing proposals, listed in priority order, with what the group intends to deliver to the Community ahead of the deadline for the next monthly voting cycle. For purposes of clarity, incubating LTS will not engage external counsel to support on any of these transactions until such time as the MIP or MIP6 (as applicable) is approved. Incubating LTS has identified potential counsel for the HVB transaction (if approved). External counsel for the other transactions will be identified later (as needed).     Priority Name Motivation     1 MIP6: SocGen Approved   2 MIP65: Project Clydesdale Formally Submitted   3 MIP68: Monetalis V2 RFC   4 MIP70-71: HVB RFC   5 MIP73: Pando RFC   6 MIP72: 6s Capital RFC   7 MIP6: ATD RFC   8 MIP6: India Power Green RFC    *Note: MIP65 results currently in the process of being withdrawn *Note: those priorities might be subject to change in case other applications will be withdrawn  Actions for Each Prioritised Proposal 1. MIP6:SocGen  Ongoing. Working through technical and legal mechanics in the agreements See also (here)  2. MIP65: Project Clydesdale  High-level opinion already provided by LOVE (here) - nothing to do ahead of voting  3. MIP68: Monetalis V2  Independent risk assessments already provided by RWF (here) and LOVE (here) - nothing to do at this stage  4. MIP70-71: HVB  RWF expects, based on RFC feedback, that this application will be greenlit imminently. In such a case, RWF will thus commence a risk assessment, site visits in Pennsylvania, and meeting of key underwriting/monitoring personnel at HVB Incubating LTS will provide a high-level issue-spotting and diligence review based on the information provided to date. Once greenlit, LTS will work with HVB to flesh out the legal structure and review the financing agreements. A prominent Washington DC based law firm with blockchain and US banking regulatory experience is diligencing North Lakes Legal for the purpose of assisting on this transaction  5. MIP73: Pando  RWF plans to issue a high-level triage of this deal, based on the information provided thus far, for the benefit of the community. This should help the community make an informed decision for greenlight. Due to the similarity of the credit to recently securitized public transactions, we will also provide guidance on the pricing of the deal versus reasonable “on-market” comparables. This triage may be complimented with opinions from external consultants Incubating LTS will provide a high-level issue-spotting and diligence review based on the information provided to date  6. MIP72: 6s Capital  Incubating LTS will provide a high-level issue-spotting and diligence review based on the information provided to date  7. MIP6: ATD  RWF plans to issue a high-level triage of this deal, based on the information provided thus far, for the benefit of the community. This should help the community make an informed decision for greenlight. Such a snapshot may include but will not be limited to deal-specific, sponsor-specific, guarantor specific, and country-specific considerations. This triage may be complimented with opinions from external consultants.  RWF will provide guidance the pricing of the deal versus reasonable “on-market” comparables Incubating LTS will provide a high-level issue-spotting and diligence review based on the information provided to date  8. MIP6: India Power Green  RWF plans to issue a high-level triage of this deal, based on the information provided  thus far, for the benefit of the community. This should help the community make an informed decision for greenlight.   RWF will provide guidance the pricing of the deal appears versus reasonable “on-market” comparables Incubating LTS will provide a high-level issue-spotting and diligence review based on the information provided to date   What Else Consistent with its mandate and with the process proposed through the proposed MIP67, the group continues to support counterparties that have an off-chain vault active, as well as those counterparties that have been greenlit and that are requesting counselling in order to prepare the best possible MIP to be presented to the community. In addition, the group remains available to be consulted by any other counterparty that intends to understand more about Maker’s stance with regards to real-world assets, as well as the onboarding process as a whole. Although what described above doesn’t intend to be exhaustive of what the teams have been working on, we hope we have provided the community a good sense of what to expect in the upcoming month. We remain available for discussion, here and during RWF’s weekly office hours. ",
                    "links": [
                        "https://forum.makerdao.com/t/sg-forge-ofh-token-transaction-update-march-2022/14334",
                        "https://forum.makerdao.com/t/mip65-project-clydesdale-monetalis-arrangement-i-liquid-bond-strategy-execution/13148/37",
                        "https://forum.makerdao.com/t/mip68-monetalis-vault-v2/13789/11",
                        "https://forum.makerdao.com/t/mip68-monetalis-vault-v2/13789/16",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-7-13-2022/14624",
                        "https://forum.makerdao.com/t/mip6-india-power-green-bonds/14485/10",
                        "https://forum.makerdao.com/t/mip6-emerging-markets-green-opportunity-financing-for-atd-combustors-egyptian-power-plant-efficiency-projects/14489/14",
                        "https://forum.makerdao.com/t/a-letter-to-the-cus-on-community-impatience-and-trust/14560/15"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.564377289377289
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#2",
                    "likes": "0",
                    "time": "09/04/2022-00:15:09",
                    "content": "Thank you for this, it’s very helpful to get a high level overview.  Would love it if this could be updated regularly.  Quick question…how were the priorities decided upon?  Was it just first come first serve?  Will MIP 65 get the same prioritization once the proposal is redone? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.209523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "2",
                    "time": "09/04/2022-00:51:40",
                    "content": "Could you please formally place our current DC vault holders: NewSilver/Centrifuge and 6s in the above status update as it seems entirely unclear to many people as to the actual state of these two existing RWA vaults. Can and should governance extend or restrict DC on these or not, and why? Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#4",
                    "likes": "1",
                    "time": "09/04/2022-03:30:53",
                    "content": "Regarding your 6S questions this new 6S thread was just started and appears to be an good place to discuss and address such questions.     6s Structure Updates Governance   @mrabino1 - thank you for this helpful update and being responsive to some of RWF and the incubating Legal and Transactional Service core units’ concerns with the 6S Capital legal structure and/or commercial terms.  A few initial points for consideration. I will also look back at our earlier inputs to 6S Capital and revert with any additional questions.  Deletion of “common” from the phrase “total common equity”  The proposed deletion of “common” from “total common equity” in the definition of “…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.948863636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#5",
                    "likes": "3",
                    "time": "09/04/2022-12:45:59",
                    "content": "Totally ‘not helpful’ regarding a simple one line status update here for each existing vault. I re-ask the basic questions more directly.   Regarding approved vault RWA001-A with DC of 15M what is the status of this vault from RWF perspective in relation to DC and to material status. a)  DC Reduce (to what), leave same, increase? b)  Material structure,  satisfactory, unsatisfactory,  being worked on, not being worked on.? c)  Any other issues as RWF sees them that should be brought up   Exact same questions on HTC-DROP with DC of 7M as (1) above.   Exact same questions on FFT1-DROP with DC of 15M as (1) above.   Exact same questions on CF-DROP which looks to be setting up with DC 2 M as (1) above.   Informational purposes.   RWA vault DC Used   RWA001-A 15M 14.209M   HTC-DROP 7M 1.73M   FFT1-DROP 15M 2.915M   CF-DROP 2M 0M   Suggestions for simple answers to the above in terms of ‘status’ for MakerDAO and governance. What I would like to see here is additional columns RWF DC recommendation - What does RWF recommend be done with DC and vault?  DC reduce (to what) or 0, DC same DC increase (maximum RWF recommendation)  RWF vault legal structure acceptability - What is the current structural status?  Acceptable Not acceptable and being improved. Not acceptable and not being worked on.  RWF client working relationship  working not working (i.e. closed, still open)  Should governance act/when  RWF request governance action(s) (YES/NO) If YES above when should governance act by (DATE) If YES above then what are RWF recommended governance actions to be taken by (DATE) above. (feel free to insert suggested multiple actions and dates)  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.308035714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#6",
                    "likes": "1",
                    "time": "09/04/2022-14:06:11",
                    "content": "Thanks for this post RWF and LOVE. Was wondering if there was any guidance on older Centrifuge projects that have been greenlit, thinking of ones like PA-DROP (Wintech) that went their vote in May of last year. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#7",
                    "likes": "1",
                    "time": "09/04/2022-14:11:00",
                    "content": "Thank you @prose11 and @MakerMan, The status posted above had no intention to be comprehensive, but a status update on what has been received and what the teams will be working on this upcoming month. I will let @williamr and team reply to your questions on the rest of the pipeline and on the status of the existing vaults. I have strongly encouraged RWF-001 to be more proactive and comprehensive in providing the community with an update on all topics, and will monitor this closely as prospective Oversight facilitator. Regards ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.555555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#8",
                    "likes": "0",
                    "time": "10/04/2022-16:52:40",
                    "content": "Maker - you are asking essential questions.  I meant to give you a broader reply as this is a KEY issue. Under what criteria does RWF recommend that Maker close a vault?  Is there such a criteria that the Community and MKR holders have approved?  When RWF recommended a zero debt ceiling for Monetalis SME v1, it was criticized by key MKR token holders, and attacked for being entangled with their own pipeline and gatekeeping.  These token holders didnt address the key arguments presented by RWF on Monetalis, suggesting that RWF does not have a clear, Maker approved criteria for screening investments and proposing a zero debt ceilings if they so qualify on this criteria. At this point perhaps RWF should assess and opine on two key issues for investments (existing and potential new ones):  Risk Level (Investment Grade) On Market Structure/Pricing  Once RWF reports on these two metrics (and other ones if so desired), the MKR token holders vote on the next step for the investment across a wide range of possible actions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2183441558441555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#9",
                    "likes": "0",
                    "time": "11/04/2022-02:03:11",
                    "content": "@Eumenes thank you for this. I think it’s a good occasion to remind the community of the MIP67 that will be voted during this monthly voting cycle, and that asks for on-chain approval over the Methodology and Process that RWF follows and on which the team based its assessment. In the case such MIP67 gets approved, I would expect RWF-001 to provide clear guidance over currently greenlit and approved DC vis-à-vis the Methodology and Process. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#10",
                    "likes": "0",
                    "time": "10/07/2022-02:03:18",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}