{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/growth-cu-nov-dec-jan-review-and-weekly-updates-march-11/13907",
            "title": "Growth CU Nov-Dec-Jan review and weekly updates: March 11 ",
            "index": 13907,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "9",
                    "time": "14/03/2022-21:22:02",
                    "content": " General Updates  Q3 Overview (Nov, Dec, Jan). The general outline of our traditional cycle consists of the following phases: Outreach → Initial conversations → Project formalization and commitment → Activation support (technical or marketing support) → Pre-launch growth → The partner Launch (close deals) → Maintenance and growth. In Q1 (May-June-July) we closed 33 integrations, in Q2 (August-September-October) we closed 41 integrations and in Q3 we closed 28, but increased the number of T1 integrations, continuing with our strategy of focusing on strategic partnerships for Maker.  724×436 15 KB  This is the picture of the opportunities in the latest stages of the Growth Process cycle, before closing the integration (Project Formalization, Activation support, and pre-launch).  724×436 8.3 KB  As shown before, we continue with the same distribution of deals in the different stages as in the previous quarters.  B2B Activations. Check what we did with our partners last quarter: B2B Activations report Q3  Quarters synch. During our offsite, we decided to coincide Growth quarters with the calendar quarters to simplify communication. That means, in April we will initiate Q2-22.  Next Events.  EthRio (March 11th): @Lozadaluis12  Panel: Stablecoins and settlement 15/Mar → 10:00 @Corina  presentation: DAO Governance, MakerDAO lessons 15 Mar → 14:35 Corina’s Panel: DAO & Governance experiences with Harmony, 1inch & Julien Boutelup 15/Mar → 15:05 Cambridge Blockchain Society (March 12): Rajiv is attending the event Circle/USDC - Building the Crypto Economy - London (March 17)Rajiv is attending the event EthDubai (March 29th): we are planning a side event with Polygon    Star of the week.   Bitmar listed DAI. They are an exchange with ​​over 1 million daily active users.  MakerDAO twitter Account. Twitter followers: 201.2k (+0.95% WoW) Number of tweets: 23 (+228% WoW) Twitter engagement rate: 0.62% (-43% WoW)   During this week we worked on defining a Tweets calendar and a process for CUs to add their tweets to the calendar. We hire a media agency to support us whenever we need more than written content in our threads to improve the content assets.    We strongly increased the number of tweets and the number of impressions (+500% on a 28-day basis).   The drop in the engagement rate shows us the engagement (actions that people do in our tweets: likes, comments, retweets), is not increasing at the same rate as impressions.   We will tweet more content that helps us initiate conversations with our audience, replicating the interaction we got with this tweet, as it gave us good results in engagement.   If you want to include your announcements in the MakerDAO twitter, please read this post.    MakerGrowth Tweet of the week   twitter.com    MakerDAO Growth @MakerGrowth  💰 Now you can pay for your insurance with Dai, covering all positions within your wallet, through@SolaceFi.  How does it work? 👇  1/12 https://t.co/scw6PxnCkS   2:59 PM - 3 Mar 2022           21                5            ",
                    "links": [
                        "https://twitter.com/MakerGrowth/status/1499387113783103489",
                        "https://twitter.com/MakerDAO/status/1500121216757215245?s=20&t=K-VYt94l3Wz_k1yKvfAa1w",
                        "https://forum.makerdao.com/t/content-for-the-makerdao-twitter-account/13819",
                        "https://twitter.com/MakerGrowth/status/1499398994392334345",
                        "https://twitter.com/MakerGrowth/status/1499398994392334345",
                        "https://twitter.com/MakerGrowth/status/1499398994392334345",
                        "https://twitter.com/SolaceFi",
                        "https://t.co/scw6PxnCkS",
                        "https://twitter.com/MakerGrowth/status/1499398994392334345",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-march-2022/14712"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.486666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "12/06/2022-21:22:13",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}