{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/target-rate-feedback-mechanism-trfm-not-easy-to-understand/1872",
            "title": "Target Rate Feedback Mechanism (TRFM) Not Easy to Understand ",
            "index": 1872,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "trfm"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/shoshana",
                    "index": "#1",
                    "likes": "0",
                    "time": "02/04/2020-18:49:39",
                    "content": "From this article, I read:  When Dai below the target price the following happens:  The Target Rate increases. This causes the Target Price to increase at a higher rate. This causes Dai generation via CDP to become more expensive. The increased target rate causes an increase in Dai demand. The combination of reduced supply and increased demand causes a rise in Dai’s prices pushing it towards the Target Price.   This is supposed to be an explanation showing the effect of TRFM, but still I do not understand. So far, my understanding is that:   The target rate increase. So, if DAI is .90 USD, then target rate is 11% to bring back DAI to 1 USD?   This causes the Target Price to increase at a higher rate. I thought target price was always set to 1 anyway so that 1 USD = 1 DAI. So, why there is a need to increase the target price?   This causes Dai generation via CDP to become more expensive. I guess we are talking about mining? So, there’s a cost to mine DAI like mining BTC? I thought that by depositing, for example, 1 ETH into a vault, I’d get 66 DAI (if 1 ETH = 100 USD) without effort. So, apparently, there is an “effort” to mine DAI. I don’t understand. Why creating DAI out of thin air would involve some cost?   The increased target rate causes an increase in Dai demand. Well, again, this is not obvious to me. I don’t see any connexion between an increased target rate and higher demand for DAI.   The combination of reduced supply and increased demand causes a rise in Dai’s prices pushing it towards the Target Price. That is 101 economics. I understand.   ",
                    "links": [
                        "https://forum.makerdao.com/t/emergency-peg-management-governance-and-risk-meeting-wednesday-july-29-6-00-pm-utc/3446/5",
                        "https://forum.makerdao.com/t/the-target-rate-feedback-mechanism-an-introduction/2319"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1923076923076925
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#2",
                    "likes": "0",
                    "time": "02/04/2020-20:59:53",
                    "content": "This idea has been discontinued until further notice afaik ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}