{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rocking-the-defi-chasm-3-are-defi-kpi-goals-possible-and-what-if-the-dao-airdropped-makerbreaker-for-further-decentralization/12419",
            "title": "[Rocking the DeFi Chasm #3] Are DeFi KPI Goals Possible and What if the DAO Airdropped MakerBreaker For Further Decentralization ",
            "index": 12419,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "defi",
                "op-ed"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "6",
                    "time": "30/12/2021-18:25:03",
                    "content": "Legal Disclaimer : This op-ed communication is provided for entertainment purposes only. The views expressed here are those of Flip Flop Flap Delegate LLC who present said materials and are not the views of MakerDAO, or its affiliates. This content is provided for entertainment purposes only, and should not be relied upon as legal, business, investment, or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only, and do not constitute any recommendation for any action or an offer to provide investment advisory services. This content is not directed at nor intended for use by the MakerDAO community (“MakerDAO\", and/or \"community”), and may not under any circumstances be relied upon when making a decision to purchase any other digital asset referenced herein. For guidance regarding the possibility of said risks, one should consult with his or her own appropriate legal and/or regulatory counsel. Charts, graphs, memes, and url links provided within are for informational purposes solely and should not be relied upon when making any decision.  Woke-up this morning and I had a dream about this hidden Gem  called Breaker I’m not sure if you recall, but in the spring of 2021 Dog tokens were all the rage. Anybody who had a few Dollars to spend could easily become Doge & Shiba Rich by purchasing thousands, or hundreds of thousands of these meme tokens for under 0.001 Conti ($0.001) or less, and more than likely feeling mighty good about it. Back then, a couple of brilliant minds realized that if being “Dog-token Rich” attracted end-users, then why not feel DeFi-token-Rich by breaking expensive tokens like YFI, or MKR (as an example) into a dynamic pricing divisible product and create a meme token, in this case—they named it Breaker.  image772×884 36.5 KB   Memenomics validity to it I believe the logic behind this meme is that if you break an expensive token like MKR, folks might feel like they can afford BKR and become apart of a DeFi protocol and not only Govern a great protocol like MakerDAO, but also have a say in the future of the DAO. For those not familiar with Maker’s meme token, “Breaker”—or as I personally like to call it breaker, breaker—here’s the contract address (PLEASE DO NOT SEND ANY TOKENS TO THIS CONTRACT ADDRESS–AND AS ALWAYS, PAY ATTENTION TO THE LEGAL DISCLAIMER ABOVE) 0x0ff5E7B1a54387458F4dD2F04CDdA7D1246C34D9 “And if you don’t know, now you know” —The Notorious B.I.G. Using this beauty of an interface “makerbreak”, you can essentially swap MKR for BKR, and get that  breaker, breaker rich feeling,  or BKR back to MKR.  image970×532 45.4 KB   Okay, so you ask what does this have to do with an Airdrop??? With 74,000 MKR in the treasury—why not take 20,000 MKR and break them into BKR—and orchestrate the following airdrop to further decentralize MKR governance:  Break first batch of 10,000 MKR to BKR Remaining batch of 10,000 MKR use for Delegated Governance incentives Airdrop the first batch (10K MKR) to All DAI holders on Ethereum, Avalanche, and Polygon. Distribute evenly: total float of the of BKR divided by number of DAI token holders — example: 10,000 MKR = 96,000,000,000,000 BKR  Recipients of Airdrop will receive restricted BKR (rBKR) that can only be free if the rBKR is used for Governance purposes for at least 36 months—example:  Jane receives 1,000,000 rBKR (equivalent of 0.001 MKR), she then takes her rBKR and delegates it to a Governance Delegate. Delegate UI Contract calculates that Jane is the recipient of rBKR, or 0.001 MKR and assigns the prefer Delegate-of-choice the equivalent voting power of 0.001 MKR. During the 36-month lock-up-period, as an incentive for participation Jane earns a proportional incentive/reward of more non-restricted BKR (this comes from the remaining 96Quadrillion BKR out of the remaining 10,000 MKR) for locking up her Airdrop in the Governance Contract. In the Claiming UI airdrop recipients can delegate immediately similar to what has been done with ENS  Claimants can also opt-in to become MakerDAO Delegates. Take a snapshot of Wallets holding DAI, like yesterday   This could possibly lead to MMs creating an AMM pools w/BKR for liquidity purposes.  Alright, alright call me a dreamer. But airdropping BKR is more than just about making Jane and Joe feel meme-token-rich. It’s about expanding token ownership and decentralization for MakerDAO, and more importantly allowing the Jane’s/Joe’s of the world to have an opportunity to become apart of this amazing community. If anything, this crazy dream can be interpreted as food-for-thought on how the community can expand… or as “influencer” Crypto Cobie likes to say, grab some “Attention” and show the world how MakerDAO is more than just another DeFi protocol…  KPI Goals For DeFi? I recently heard an influential DeFi Founder say that asking DeFi protocols for KPIs is like asking Facebook in 2006 for the same thing. Impossible they say. At such an early stage of innovation, it’s all about ”numbers go up!” Well, the thing is that we as Maker community members have expectations, right? As an example–and not to pick on this Core Unit—but say the KPI goals for TOCU where set by a Working Group and the TOCU facilitator. We can then perhaps agree that if the WG + facilitator set a goal that by Q4 of 2022, this here Forum will be on a decentralized open-source Cloud, the TOCU team will then have a KPI goal for 2022. Sure its not a revenue goal, but it’s  a performance metric that can help MKR token owners measure the performance of TOCU. The simple point is, that KPIs in DeFi are possible–if we ALL know in what direction the DAO is pointed at. As one of the few Recognized Delegates for this DAO, I can tell you that Delegates should also have KPIs—such as helping provide Growth direction and initiatives, accessing and monitoring KPIs, helping set KPIs for CUs via the WG, KPIs for Governance participation, KPIs for attending meetings, etc. the list goes on and on. So, what are the primary metrics of KPI goals? One metric is “ Value” which equals Revenue. The other is Users. And not just users that have had a few DAI in their wallet for the last 24 months, but recurring end-users. As an example, we can say that 1M Ethereum wallets hold DAI but that is the equivalent of having 1M email addresses that signed up, but provide no recurring revenue. And if we sit hopeful that those 1M stagnant users will eventually start using DAI the product—That’s a trap 🪤— active users are more serious about your product than inactive users. Think about that. And last but not least, does active users equate to revenues? Are institutional Vaults the only metric MakerDAO should track? Is user retention important? Perhaps there is no metric that tells 100% of the story. But I think that we can agree that retention, revenue churn, customer acquisition cost, gross margin, burn rate, etc., are some of the metrics we need to think about going into 2022. Happy and healthy New Year Maker Fam!! Stay positive and stand tall in 2022. ",
                    "links": [
                        "https://makerbreak.io/",
                        "https://forum.makerdao.com/t/weekly-relay-dec-14-2021-jan-3-2022/12463",
                        "https://forum.makerdao.com/t/relay-semanal-14-de-diciembre-de-2021-3-de-enero-de-2022/12531",
                        "https://forum.makerdao.com/t/forum-at-a-glance-dec-16-2021-jan-6-2022/12507",
                        "https://forum.makerdao.com/t/mip40c3-sp56-modify-core-unit-budget-risk-001/12587/7"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.633640501655208
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#2",
                    "likes": "5",
                    "time": "01/01/2022-20:11:54",
                    "content": "Not against this type of marketing moves but I personally think     flipflopflapdelegate:  2021 Dog tokens were all the rage.   we are too late in this bull cycle for this type of marketing moves. Honestly, at this point I think it is more productive to keep up with Maker’s notorious ‘serious/boomer/boring’ approach to things. It will pay back at some point, I am fairly sure. This said, a serious tokenomics re-work (including perhaps moving from 1M to 1B or 1T MKR around by breaking) should be part of a much deeper design in 2022 (e.g., Sagittarium engine, etc.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.729166666666666
                }
            ]
        }
    ]
}