{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/the-wbtc-dc-limit-should-be-increased/2750",
            "title": "The WBTC DC limit should be increased ",
            "index": 2750,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "rates",
                "wbtc"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#1",
                    "likes": "2",
                    "time": "06/06/2020-01:04:54",
                    "content": "Please don’t always wait for something to happen before you take action. We should predict in advance of any matter and then take steady and gradual action. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-adjust-the-wbtc-debt-ceiling-and-risk-premium/2824"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#2",
                    "likes": "5",
                    "time": "06/06/2020-01:44:18",
                    "content": "Right now W-BTC Vaults are essentially being subsidized by MKR holders in order for Vault owners to profit off of a carry trade (with the benefit to us being improved Dai peg). Increasing debt ceilings with no compensation for risk is not something that should be so automatic, though, especially with the unquantifiable aspect of the counterparty risk. When rates normalize, we will find the true demand for WBTC vault, and I think from there we can select a more appropriate debt ceiling. My personal opinion is that uncompensated risk should stay confined to ETH because at the very least we don’t have to reason about counterparty risk there for now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7785714285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#3",
                    "likes": "1",
                    "time": "06/06/2020-02:48:52",
                    "content": "Most of the wbtc total supply is locked in maker right now. At the very least we should have a discussion about the risks associated with essentially all of the wbtc supply being locked in the maker protocol before we raise the debt ceiling any higher. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.538095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#4",
                    "likes": "1",
                    "time": "06/06/2020-06:27:33",
                    "content": "At present, all of our vault owners are profiting from arbitrage transactions (because our interest rate is the lowest in the market), MKR holders have been dedication. The risks are relative. While increasing the interest rate of WBTC, slightly increase the upper limit of WBTC (leaving space for small and medium users). I think this is feasible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#5",
                    "likes": "7",
                    "time": "06/06/2020-07:01:18",
                    "content": "Any increase in debt ceiling should be paired with an increase in stability fee to mend the risk-reward profile of WBTC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#6",
                    "likes": "0",
                    "time": "06/06/2020-11:32:28",
                    "content": "    cyrus:  When rates normalize   Do we have enough data to tell what the normal rate should be? Or are we thinking ~5%? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#7",
                    "likes": "0",
                    "time": "06/06/2020-16:35:55",
                    "content": "I think that’s a rough ballpark for btc as a standalone. Need an additionall premium for the custodial aspect of it, too, though. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jeffshaw",
                    "index": "#8",
                    "likes": "2",
                    "time": "06/06/2020-16:51:58",
                    "content": "I believe MKR holders should forego short term compensation for the additional risk of raising the WBTC debt ceiling for the long term benefits of growing the dai supply faster while not creating instabilities to the system. I think deferentiating compensation for risk and acceptable risk tolerance thresholds is an important distinction. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#9",
                    "likes": "1",
                    "time": "07/06/2020-18:09:38",
                    "content": "Does risk team have any “framework/model” for calculating premium for custodial risk? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mosayeri",
                    "index": "#10",
                    "likes": "5",
                    "time": "11/06/2020-18:50:06",
                    "content": "In this specific case, it seems like retail interest will uptake a bit more gradually than institutional. I wanted to highlight that it’s very important to raise the debt ceiling to maintain the use case avenue open for retail users. There has been a tremendous amount of effort from various projects in the space to educate the retail user base on this use case and that effort would be halted if the debt ceiling is reached. This could be a very gradual but consistent increase in the ceiling that’s mitigated with fee increase. The risk team could have a look at the amount of WBTC that has been minted since beginning of May that did not end up locked in Maker. This could be a light indicator on increased liquidity around the market. The other factor to consider is the new integrations that make the market more efficient for Maker such as, wbtc.cafe and the renBTC<>wBTC pool on Curve. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6838203463203465
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#11",
                    "likes": "2",
                    "time": "12/06/2020-00:30:57",
                    "content": "Let us not underestimate retail users, they can bring better network effects. Let’s raise the WBTC limit slightly to allow retail users to participate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#12",
                    "likes": "1",
                    "time": "12/06/2020-13:10:27",
                    "content": "    hongbiao_li:  Let us not underestimate retail users, they can bring better network effects. Let’s raise the WBTC limit slightly to allow retail users to participate   You can’t really prevent current largest user to increase their position. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#13",
                    "likes": "1",
                    "time": "13/06/2020-01:04:58",
                    "content": "We can use a slow growth rate to increase the DC cap by 500,000 DAI every week and increase the interest rate to 5%. Trade time for space, and squeeze out institutional arbitrageurs by raising interest rates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#14",
                    "likes": "0",
                    "time": "13/06/2020-17:56:35",
                    "content": "    cyrus:  I think that’s a rough ballpark for btc as a standalone. Need an additional premium for the custodial aspect of it, too, though.   So some people throwing around a 5% risk premium for BTC. I understand there’s custodial risk also, but not exactly understanding what makes Bitcoin that much more risky than Ethereum. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#15",
                    "likes": "1",
                    "time": "13/06/2020-19:04:51",
                    "content": "    Jiecut:  So some people throwing around a 5% risk premium for BTC. I understand there’s custodial risk also, but not exactly understanding what makes Bitcoin that much more risky than Ethereum.   Idk that it is necessarily. I think that the true state of affairs is that we are ALSO subsidizing the ETH stability fee to spur on lending and otherwise control the peg at the moment, and that is where the discrepancy in the rates are coming from. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.90625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#16",
                    "likes": "4",
                    "time": "13/06/2020-23:29:40",
                    "content": "    [Signal Request] Adjust the WBTC Debt Ceiling and Risk Premium Governance       The WBTC DAI minted has been effectively capped by the debt ceiling for a week. WBTC is the most popular collateral after ETH with 8.08% of DAI minted. There has been strong demand for minting DAI from WBTC, maybe even stronger demand than from ETH. This is important to help stabilize the peg, and add DAI liquidity in this 0% rate environment. WBTC is in a unique position being the only active Bitcoin collateral on MCD.  There has been some discussion in the community regarding raising the WBTC …     ",
                    "links": [
                        "https://forum.makerdao.com/t/the-wbtc-dc-limit-should-be-increased/2750"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.734375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#17",
                    "likes": "1",
                    "time": "14/06/2020-02:01:55",
                    "content": "Great perspective, this is significantly a sort of amputation to lock all WBTC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.9375
                }
            ]
        }
    ]
}