{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/obtaining-a-marketing-core-unit/12917",
            "title": "Obtaining a Marketing Core Unit ",
            "index": 12917,
            "category": [
                "Governance"
            ],
            "tags": [
                "marketing",
                "core-unit"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "18",
                    "time": "28/01/2022-13:45:21",
                    "content": "Over the past few months, I’ve heard multiple individuals bemoan the lack of a marketing core unit. For those that are unaware, there is a concrete governance action you can take that should make it easier for MakerDAO to attract individuals or entities wishing to fulfil this role. This action was laid out in MIP13 and was specifically designed to help resolve this issue.  A declaration of intent is a statement that declares an intention Maker Governance has to the wider ecosystem. Such declarations should be made with the aim of prompting action in a certain area. - MIP13c1   The point of this structure is that it allows authors to declare something ie: \"MakerDAO wants to employ a marketing core unit\" And then have it be voted on formally, such that it becomes something that MakerDAO as a whole has declared. This declaration can then be used as evidence / motiviation / etc for potentially interested parties. It can also help guide the structure of any applications proposals.  There is no limit to what a declaration of intent can include. For example authors could include statements in the form of any or all of the following:  MakerDAO intends to reward valid marketing core unit proposals with 10,000 DAI, even if those proposals are unsuccessful. MakerDAO intends to deliver successful marketing core units a 100,000 DAI signing bonus. MakerDAO intends to deliver a 1,000,000 DAI performance bonus after a marketing core unit has 1 year of continuous service. MakerDAO intends to reward valid marketing core unit proposals with 5,000 DAI if they their proposals follow the SES Core Units guidelines correctly, even if unsuccessful. MakerDAO intends for a marketing core unit to respond to requests for marketing support from other core units. MakerDAO intends for a marketing core unit to deliver a cohesive marketing vision for MakerDAO after 3 months of operation. MakerDAO intends to reward the author and contributors of this Declaration of Intent with 5,000 DAI apiece if this Declaration of Intent passes through governance successfully. MakerDAO intends to reward the author and contributors of this Declaration of Intent with 5,000 DAI apiece if this Declaration of Intent is met within 6 months.  Like the possibilities here are only limited by the authors imagination and their ability to convince MKR Holders that their ideas for incentivisation have merit.  Like, you all have the power to make a difference in the DAO, to fix the problems people are seeing etc. In many cases, you can literally write in bounties to yourselves for producing a successful proposal into the proposal itself. The only thing GovAlpha will definitely veto is payments to delegates or voters for voting in favour of a given proposal on the grounds that this can be considered a governance attack. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP13#MIP13c1",
                        "https://forum.makerdao.com/t/forum-at-a-glance-jan-27-feb-3-2022/13019"
                    ],
                    "GPT-summary": "The author of the post is explaining how to create a marketing core unit for MakerDAO and how to incentivize it. The post also suggests using a declaration of intent to make it easier to attract individuals or entities to fulfill this role. The post provides examples of what a declaration of intent can include and encourages the community to use their imagination to create proposals and incentivize them. The post also mentions that payments to delegates or voters for voting in favor of a proposal will be vetoed by GovAlpha.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.712053571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#2",
                    "likes": "18",
                    "time": "28/01/2022-15:52:22",
                    "content": "Please note that besides the direct governance options that @LongForWisdom is outlining, SES will also be collaborating with the Growth CU to run a dedicated Incubation Program track next quarter, focused on outreach (including marcomms, design, community development, developer relations, etc.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/02/2022-13:58:36",
                    "content": "   MIP41c5-SP5: Facilitator Offboarding   Anyone is able to do this through MIP13. I’m not 100% sure why it isn’t utilized more.   Is it because it is just words? What does that mip do? I look at mip 13 so far and it does not make anything happen. Maybe I do not read it correctly? Thank you  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip41c5-sp5-facilitator-offboarding/13005/18"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "15/02/2022-14:04:15",
                    "content": "It allows the DAO to vote on arbitrary statements. For example: “MakerDAO is looking for proposals for a x Core Unit” The body of the proposal can contain conditions / desires / etc. This can then be publicized to groups that may be interested. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#5",
                    "likes": "0",
                    "time": "15/02/2022-14:18:09",
                    "content": "Is that binding? There is reputation of being unwilling to pay people after many marketing attempts, off board content soon after budget, the farm land company… I do not know that I would put in work to make a professional proposal if it was me  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#6",
                    "likes": "0",
                    "time": "15/02/2022-14:42:08",
                    "content": "Moved this to a different thread because it’s off-topic. It isn’t binding no. It’s a declaration of Intent. Intents can change. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "17/05/2022-20:43:00",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}