{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-gbmkr-a-proposal-to-benefit-long-term-mkr-holders/12756",
            "title": "[Signal Request] gbMKR, a proposal to benefit long-term MKR holders ",
            "index": 12756,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "sig-status-rejected"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/paraficapital",
                    "index": "#1",
                    "likes": "14",
                    "time": "20/01/2022-21:55:34",
                    "content": "Authors: Adam Cader, Mika Honkasalo Thanks to Kurt Barry and Hexonaut for review of the proposal Summary of the proposal Instead of voting with MKR, as is done today, this proposal suggests gbMKR (governance-boosted MKR) replace MKR in governance voting. MKR would be locked up to 4 years in a contract to mint gbMKR. The voting weight is equal to: voting_weight = MKR * duration_locked/4_years. Motivation The current Maker governance system allows any holder of the MKR token to vote on proposals that have meaningful long term effects on the protocol. gbMKR improves on existing MKR governance by empowering long-term token holders.  Security.  Currently, governance attacks are possible via borrowing MKR on a platform such as Aave or Compound, or alternatively through an OTC desk like Genesis, and using the MKR to participate in an adverse change to the protocol . As a locked token, gbMKR would aim to secure the MakerDAO system and mitigate such governance attacks.   Long-term value alignment.  gbMKR would benefit MKR holders who intend to hold tokens for a long period of time and be active participants in governance.   Locking MKR supply off the market.  A decrease in the MKR supply means less of it is available on the open markets to sell. This is important because the protocol is healthier if MKR price is higher given MKR backstops any collateral shortfall.   Increase the incentive for DAOs to hold (gb)MKR.  DAOs and protocols can more easily accumulate voting power to influence governance (asset listings, collateral parameter modification, stability fees, etc.). DAOs vote to increase respective debt ceiling or lower the borrowing rate specifically Still, they would have to remain aligned with the long-term growth of the project because of the lock up. For example, lending protocols direct the D3M to their respective money market protocols.    Mechanics Instead of voting with token amount a, MKR tokens are lockable in a VotingEscrow for a selectable locktime t1, where t1 < tmax, and tmax = 4 years. After locking, the time left to unlock is t ≤ t1. The voting weight is equal to: w = a*t/tmax. The voting power of gbMKR decreases linearly as a function of time since lock. For example, when a user sets a 4 years lock for some amount of gbMKR - that amount has an initial 100% voting weight. After 1 year the weight will be 75%, after 2 years the weight will be 50% and so on. gbMKR holders must continually extend their lock time to maintain voting weight. gbMKR is a non-transferable token. However, as pointed out by YFI, this can be “bypassed via wrapped derivatives such as the Yearn yveCRV vault or Convex’s cvxCRV product.” As additional consideration, users could unlock their gbMKR back into MKR before the set lock time. The tradeoff for the early unlock would be a MKR penalty that is distributed back to the other gbMKR holders. Engineering Considerations Mandate for Maker Developers to create the components at their discretion.  Emergency Shutdown module (deposit gbMKR). Modifications to governance contracts (Voting is based on the internal balance of the caller with the Chief contract. Delegation. Participation in governance could be lower if not considered.  Future considerations This proposal gives gbMKR token holders a governance boost but no additional economic incentives. The following could be implemented later to introduce further incentives:  Ability to borrow DAI at an attractive rate (0% or even negative interest rates). Distribute a part of protocol fees (stability fee + liquidation revenue) directly to gbMKR holders.  Once the maximum level of surplus is reached, DAI is sent to gbMKR holders. Based on community and core team feedback we notice a preference for DAI yields instead of MKR tokens.   Use stability fees to buy back MKR and distribute to gbMKR holders. gbMKR could be added as a collateral type to MakerDAO at an advantageous collateralization ratio, pro longed liquidation time when oracle is called, and 0% stability fee  Additional notes This proposal was partly inspired by the Rune’s comments on his Sagittarius Engine (borrow Dai using their MKR as collateral at a 0% rate with preferential liquidation) proposal: “MKR holders don’t want to borrow money, they want to get money.” The key problems identified with the Saggiratirus Engine proposal was that:  Increasing MKR supply (by an additional 2m MKR) would devalue MKR.  MakerDAO has previously said not to MKR rewards for depositors, borrowers, etc. Existing MKR holders would be diluted.   The SE is too complex and hard to understand.  Compared to existing similar token models such as veCRV, gbMKR initially would be focused on long-term governance participants. Next Steps We welcome any feedback and would like for the community to discuss this proposal and for it incorporate items as needed.    Should MakerDAO implement gbMKR with the described implementation:  Yes Yes (with additional economic incentives including burn, fee distribution, and buyback) No Abstain     0 voters     Signal ends in 7 days (2022-02-08). ",
                    "links": [
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-febrero-de-2022/13294",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-10-17-2022/13292",
                        "https://forum.makerdao.com/t/weekly-relay-february-8-14-2022/13239",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-3-10-2022/13167",
                        "https://forum.makerdao.com/t/relay-semanal-01-07-de-febrero-de-2022/13151",
                        "https://forum.makerdao.com/t/signal-request-allocate-20m-to-protocol-owned-uniswap-v2-mkr-dai-lp/13150",
                        "https://forum.makerdao.com/t/weekly-relay-february-1-7-2022/13103",
                        "https://forum.makerdao.com/t/monthly-governance-review-january-2022/13052",
                        "https://forum.makerdao.com/t/forum-at-a-glance-jan-27-feb-3-2022/13019",
                        "https://forum.makerdao.com/t/forum-at-a-glance-january-20-27-2022/12887",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-17-24-2022/13425",
                        "https://forum.makerdao.com/t/weekly-relay-february-22-28-2022/13499",
                        "https://forum.makerdao.com/t/relay-semana-22-28-de-febrero-del-2022/13587",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-febrero-del-2022/13404",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-24-march-2-2022/13590",
                        "https://forum.makerdao.com/t/weekly-relay-february-15-21-2022/13348"
                    ],
                    "GPT-summary": "The post is a proposal for a new governance system for MakerDAO, called gbMKR, which would replace MKR in governance voting. The proposal suggests locking up MKR for up to 4 years to mint gbMKR, which would benefit long-term MKR holders and secure the MakerDAO system. The post also includes mechanics, engineering considerations, and future considerations for gbMKR. The post welcomes feedback and asks the community to discuss and vote on whether MakerDAO should implement gbMKR.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "0",
                    "time": "20/01/2022-22:11:12",
                    "content": "Under Engineering Considerations,     paraficapital:  Participation in governance could be lower if not considered.   What does this mean? (Nevermind, see @NikKunkel’s reply below)     paraficapital:  The following could be implemented later to introduce further incentives:   I like the simplicity and incremental nature of the vanilla proposal that includes no additional economic incentives. It seems more feasible to reach consensus with the smallest possible change.     paraficapital:  gbMKR holders must continually extend their lock time to maintain voting weight.   Considering gas prices, this gives me pause. Instead of a continuous linear curve, how about discretized 1, 3, or 6-month linear steps (if this isn’t clear, happy to provide a formula)? Also, it seems reasonable to allow a locktime t1 > tmax as long as the voting weight is set to min(t,tmax)/tmax.     paraficapital:  As additional consideration, users could unlock their gbMKR back into MKR before the set lock time. The tradeoff for the early unlock would be a MKR penalty that is distributed back to the other gbMKR holders.   I like the idea, but I’m not sure whether this could be implemented in a gas efficient way. Would the early withdrawal penalty be distributed proportional to the amount of MKR locked in gbMKR or proportional to the gbMKR voting weight?  Misc questions Some work is needed to map out how to transition from MKR to gbMKR. How much gbMKR must exist before we switch over? Could Core Unit MKR budgets be distributed in locked gbMKR instead of MKR? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.40625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "0",
                    "time": "20/01/2022-22:14:41",
                    "content": "    paraficapital:  This proposal was partly inspired by the Rune’s comments on his Sagittarius Engine (borrow Dai using their MKR as collateral at a 0% rate with preferential liquidation) proposal: “MKR holders don’t want to borrow money, they want to get money.”   Right on–within the first paragraph the Sagittarius Engine came to mind      paraficapital:  Ability to borrow DAI at an attractive rate (0% or even negative interest rates).   Unbacked DAI? I believe SE Bucket avoids this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.294642857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#5",
                    "likes": "18",
                    "time": "20/01/2022-22:41:25",
                    "content": "I think protecting the protocol from being affected by borrowed MKR is a worthwhile endeavor, and that this is one solution to this problem. You cite two factors as a motivation for this proposal that I believe warrant further investigation:  governance participation may suffer locking MKR supply off the market  My hypothesis is that: Without economic incentives for locking up MKR, this proposal would:  decrease the already paltry governance participation the lockup mechanism will be ineffective at relieving sell-side pressure on MKR  You have three sets of MKR holders: A. a large majority who have no interest in participating in governance B. a small minority who delegate C. an even smaller minority who actively participate in governance Adding lockups without incentives to participate in governance won’t stimulate anyone in set A to lock-up their tokens. Members of Set B and C are already participating in governance and empirically tend not to sell, but some subset will stop participating in governance due to the undesirable restrictions of locking up their tokens. Conclusion: This proposal would add a defense mechanism against a subset of governance attacks utilizing borrowed MKR. It does not cover the cases where the rewards of executing an attack outweigh the fair market value of the borrowed MKR. It will not decrease sell-side pressure on MKR and may even increase it. The proposal does this at the expense of governance participation which will likely further decline if it’s implemented. I suspect you already know this, and you mention that this simplified mechanism was chosen because it is more likely to pass Maker Governance. My premise is that without incentives it’s a net negative rather than a net positive. My suggestion to ‘fix’ the proposal would be that you remove MKR burning (or dai yield to MKR holders) and only burn gbMKR (or Dai yield to gbMKR holders). And at that point you may as well just go full Sagittarius Engine mode and let people generate Dai against gbMKR with favorable rates to further incentivize lockups. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.472196454339311
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#6",
                    "likes": "1",
                    "time": "20/01/2022-22:52:03",
                    "content": "This ^ . Any solution must address both incentives to hold and then to vote with Maker. Right now there is no acute reason to hold MKR. Governance participation should further enhance the base incentive mechanisms. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.9821428571428577
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#8",
                    "likes": "0",
                    "time": "20/01/2022-23:22:08",
                    "content": "    NikKunkel:  My suggestion would be that you remove MKR burning from the protocol and only burn gbMKR.   I love that idea, but the whole point of gbMKR is that it is time locked. Nobody would be able to sell in auctions? Or maybe you thought of a clever way to make it work? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.366666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#9",
                    "likes": "0",
                    "time": "20/01/2022-23:59:53",
                    "content": "    NikKunkel:  My suggestion would be that you remove MKR burning from the protocol and only burn gbMKR.   I think something like this could adversely impact the perceived value of MKR at the expense of increasing the attractiveness of gbMKR. Hence, as Nik suggested, a solution needs to first address a base incentive for all MKR holders, then apply an additional incentive for those who want to be active in governance. I believe this was the goal of the SE, even if the first implementation was not perfect. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#10",
                    "likes": "6",
                    "time": "21/01/2022-05:44:51",
                    "content": "Maybe I am oversimplifying but it seems like the goal of avoiding borrowed MKR attacks can be achieved with a simpler change. Is it possible to change the voting power of MKR tokens from the current function where each token has the same weight to some function that depends on how long it has been since that token was deposited into the voting proxy or a delegation contract? For example, deposited MKR has a voting weight that increases linearly for x days until it reaches it’s full voting weight. This way, there’s no lockups or incentives or new token but those who have participated in governance for longer get a bigger say in the outcomes of polls while freshly deposited MKR gets a much smaller say. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.409090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#11",
                    "likes": "1",
                    "time": "21/01/2022-13:02:43",
                    "content": "You’d start a cat and mouse game with an intermediary contract that keeps its MKR always in the voting proxy vs. governance blacklisting these contracts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#12",
                    "likes": "4",
                    "time": "21/01/2022-13:15:45",
                    "content": "Thanks @paraficapital for working on this proposal which is highly relevant given the recent discussions re: MKR tokenomics and governance attack vectors. I do however agree with Nik’s hypothesis which foresees that the outcome of this mechanism likely won’t be positive without proper incentives in place.     NikKunkel:  Adding lockups without incentives to participate in governance won’t stimulate anyone in set A to lock-up their tokens. Members of Set B and C are already participating in governance and empirically tend not to sell, but some subset will stop participating in governance due to the undesirable restrictions of locking up their tokens.   I would be interested in seeing to what extent this proposal can be regarded as a subset/component of a larger MKR tokenomics redesign (ie. Saggitarius Engine ). I was intrigued by this idea by @AstronautThis though:     AstronautThis:  Is it possible to change the voting power of MKR tokens from the current function where each token has the same weight to some function that depends on how long it has been since that token was deposited into the voting proxy or a delegation contract? For example, deposited MKR has a voting weight that increases linearly for x days until it reaches it’s full voting weight.   This would be like an activation period affecting the voting weight of MKR tokens that enter the governance system from outside. The countdown affecting an actor’s voting weight would start once their MKR is deposited in Maker governance through either the Chief contract, a delegate contract or a vote proxy. Not sure how we’d account for the MKR that’s simply held in their wallet though—currently these funds to contribute to poll voting weight.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3061868686868685
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#13",
                    "likes": "0",
                    "time": "21/01/2022-16:53:42",
                    "content": "    0xdeniz:  Not sure how we’d account for the MKR that’s simply held in their wallet though—currently these funds to contribute to poll voting weight   The initial voting weight can be nonzero to address this concern. For example, MKR simply held in a wallet could have a voting weight of 0.5 which would be the same as the voting weight of MKR deposited into the contracts on Day 1. You could increase that weight all the way to 1 over some period. This choice doubles the cost for an attacker using borrowed MKR. With some work, we can figure out what the correct initial weight and rate of increase should be. @swakya’s point is a more interesting objection though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fede",
                    "index": "#14",
                    "likes": "1",
                    "time": "21/01/2022-17:02:40",
                    "content": "This is a very interesting proposal @paraficapital! I’m a big proponent of transferring governance power to long-term believers to improve decision making and (valuable) participation. However, as @NikKunkel pointed out, the main flaw in your proposal is that there aren’t enough incentives in place for tokenholders to lock their tokens. I propose the following changes to your proposal: In order to increase their governance power, users must stake MKR in a voting proxy or delegation contract. In doing so, they will earn gbMKR over time. gbMKR is a non-transferrable token which gives you a boost in governance power and will emit according to the amount of MKR you staked and how long it’s been staked for. This means that:  The more MKR you stake, the more gbMKR you get The longer your MKR has been staked for, the more gbMKR you get The more gbMKR you hold, the more your governance power is boosted  Basically, gbMKR’s sole purpose is to determine the extent of your governance power boost. Tokenholders should be able to unstake their MKR from the voting proxy whenever they want (with no lock-up). However, if they unstake even just a tiny fraction of their staked MKR from the voting proxy, they would lose all of the gbMKR they accrued over time. This would make sure that if a tokenholder sells even just a tiny fraction of their MKR, they would lose their boosted governance powers, since they’d have to unstake their MKR from the voting proxy to do so. A flaw that could emerge from this mechanism: tokenholders could just create multiple addresses to earn a controlling amount of voting power in the protocol. To prevent this from happening, there would be a max amount of gbMKR that could be earned over time. This would increase the voting boost linearly for x days until max voting boost is reached. This is just an initial idea that came to mind after reading the proposal and comments, so it would need refinement of course. I encourage you to poke holes in this mechanism and share your thoughts. But overall, I do believe that it would be a better mechanism as users wouldn’t need to lock their tokens up to boost their governance powers. Also it would make sure that they lose their boosted powers as soon as they sell any of their MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.29265873015873
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#15",
                    "likes": "4",
                    "time": "01/02/2022-18:32:19",
                    "content": "I made minor edits so that this meetings the requirements laid out in the signal request guidelines.  Added Abstain option Added TL2 group-limit Set results to be on-vote. Set multiple choice in order to capture people that want to vote yes regardless of incentives.  I would also strongly recommend the following changes:  Extending this signal to two weeks in length. Modifying the title to match the signal request convention.  As another sidenote, generally it’s preferable to create a new thread for a signal request, rather than editing a previous one. It’s more likely to be noticed and receive more attention. Note that this isn’t something we would usually cover in a signal request either. If this does succeed and go to an on-chain vote. The vote will be framed in terms of terms of Core Units investigating implementation of the gbMKR structure. IE: “Should Core Units investigate implementation of a governance boosted MKR structure?” @paraficapital if you want to pursue a more binding decision on whether MakerDAO should implement something like this, the MIPs Process would be the correct governance structure to use. Specifically either a subproposal under MIP13 (aka a Declaration of Intent), or as a completely new MIP. If you have questions about any of the above, @prose11 and I are available. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP13"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.729797979797979
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#16",
                    "likes": "24",
                    "time": "03/02/2022-18:33:34",
                    "content": "I’m not a fan of veTokenomics, and will try to share my main reasons for skepticism below. Reduced investor base Governance decentralization depends on a broad group of stakeholders/token holders sharing power. Long term token locking (such as veCRV tokenomics) makes it difficult or impossible for many persons or entities to own MKR; this could include defi or custodial index funds (see DPI index exclusion of CRV due to locking), VC fund holdings, closed end funds and trust products (eg. Grayscale funds), and small to medium sized retail owners. Simply put, many potentially valuable stakeholders and investors don’t have the luxury to be able to accept long term illiquidity. So adopting long term locking could lead to concentration of governance power and less decentralization. Staking derivatives In the same vein, long term locking creates incentives for staking derivatives which can potentially split economic interest from voting power while concentrating control over the protocol. Examples of this within the Curve ecosystem include yveCRV and cvxCRV. This has the potential to reduce governance decentralization (eg. Convex has around 50% of Curve voting power), and also leads to incentive alignment issues because users have no way to exit or withdraw voting power from a poor manager and managers have only indirect exposure to asset value. Short term incentives In a market as volatile as crypto, we can expect investors to use a high discount rate when judging risk adjusted returns. When combined with long term (eg. 4 year) token locks, this heavily depresses the net present value at stake for each unit of voting power. As an example, if an investor assumes a 20% discount rate on their investment and 4 year lockup, the net present value of their locked tokens is only 48% of the current market value. For owners or protocols that continuously relock their stake to maintain maximum voting and earning power, their return becomes similar to a perpetual bond, where the value of locked tokens drops to $0 and only payouts are included in NPV. This can create perverse incentives, where locked token holders can increase the net present value of their stake by favoring short term focused payout increases (either through risky protocol changes or accepting bribes) at the expense of long term value creation. Bribery Bribes are often touted as a huge benefit of the veCRV token mechanism. There’s no denying that they can be lucrative. But Curve represents a special case, as protocol governance doesn’t have access to user funds and doesn’t offer insurance to LPs. This means the financial risk of accepting bribes for Curve voters is limited to just the cost of any CRV incentives issued. For other protocols with large treasury reserves, user funds at risk, or protocol level insurance, governance faces much higher risk. This makes bribery unsuitable for lending or stablecoin protocols like MakerDAO. Projects bribing for liquidity incentives are only willing to pay up to a certain percent of expected reward value as bribes (otherwise they would just incentives liquidity directly), meaning that the deal is always value negative for Curve before accounting for extrinsic value of incentives (higher TVL, better overall protocol adoption, trading fees, etc). But as long as the bribe yield (bribes paid / CRV rewards) is higher than the percent of CRV locked, veCRV holders still come out ahead by essentially profiting from dilution of unlocked holders. This is a troublesome dynamic which could lead to potentially worse outcomes for protocols with more expansive governance power like Maker. For example, if potential credit losses from onboarding a low quality collateral are less than bribes paid divided by share of tokens locked in governance, voters would come out ahead by accepting the bribe (private gains, socialized losses). By forcing investors to effectively discount the value of their tokens through locking, the threshold to get owners to accept bribes (even if they are negative for token price) is much lower. We can also expect a portion of investors may lose confidence in the project while their tokens are still locked; for investors expecting a large markdown due to mismanagement and self-dealing, there’s almost no financial incentives at stake to prevent accepting value destructive bribes. Prisoners’ dilemma Vote locking is praised for raising the cost of governance attacks; attackers can’t sell their voting stake back to the market so any tokens used are effectively a sunk cost. But vote locking also raises the cost of defense against governance attacks and takeovers. Resisting a takeover would require starting or increasing token locks, which imposes significant costs on defenders (risk of losing relevant governance votes, plus factoring in illiquidity discount on locked holdings). Large owners may find it difficult to safely exit their investment, with long periods of declining governance power and system security before tokens can be sold on the market to new owners. Whenever there is a transition of ownership, the amount of MKR “on the hat” would fall for multi year periods. We can’t depend on leaving investors to relock their tokens to defend the protocol. In addition, owners may further discount the expected exit value of their tokens due to governance risks as they withdraw; this would exacerbate issues of poor governance and incentive alignment caused by low value at stake. I personally consider veTokens to be uninvestable due to these incentive issues and high likelihood of governance breakdown. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-february-2022/13512",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-17-23-2022/14191",
                        "https://forum.makerdao.com/t/relay-semanal-22-28-de-marzo-de-2022/14333",
                        "https://forum.makerdao.com/t/weekly-relay-march-22-28-2022/14300"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.134488693930184
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hasu",
                    "index": "#17",
                    "likes": "3",
                    "time": "04/02/2022-11:15:55",
                    "content": "I fully agree with @monet-supply‘s arguments against veTokenomics and will add one more thing:  In order to get holders to lock up, you need to incentivize them with an additional reward (e.g. a dividend in the form of more MKR or DAI.) But if everyone locks and receives the dividend, no one gets any richer, it’s like walking on a treadmill - in fact, everyone gets poorer from racking up taxes on these artificial gains.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#18",
                    "likes": "1",
                    "time": "04/02/2022-12:39:17",
                    "content": "Same as @monet-supply and @Hasu . I didn’t time to research that more, but if you make MKR less liquid, there should be a liquidity discount. Even more so if you incentivize some long-term holders. From a governance perspective, it would centralize more which is not what is needed. The hat protection can be done by weighting voting power by time in the chief contract. So, it would hurt the MKR price, centralize governance while we could solve the problem in an easier way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#19",
                    "likes": "0",
                    "time": "04/02/2022-13:13:45",
                    "content": "I’m not very clear with the economics, but one thing that could work as incentive is adding more voting power to the ones that lock for more time the MKR. In the initial proposal says 100% of the voting power they introduce if they lock the MKR for 4 years, this is not even an incentive when they are in the 2 years period for example. How about giving 200% voting power to the ones that lock MKR for 4 years, this can incentive the ones with less voting power to lock their MKR right? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.900488400488401
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#20",
                    "likes": "2",
                    "time": "04/02/2022-14:17:12",
                    "content": "    Lozadaluis12:  this can incentive the ones with less voting power to lock their MKR right?   From the 2 biggest MKR holders in the chief contract, the biggest should lock for 4 years. A16Z (the second one) will probably not. Let’s assume all the others lock (or not). Hence you end up with a higher concentration of voting and more power for the first one. This is how I see it, I can be wrong. If you are a small investor, you have less influence so less incentive to lock. In the scenario above (even in case only the first one lock, you can lock as much as you want, you still don’t matter much. If you get 4x your voting power, but the major ones get also 4x the voting power, nothing changes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.233816964285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#21",
                    "likes": "2",
                    "time": "04/02/2022-16:10:35",
                    "content": "There are shortcomings of the ‘ve’ model. However I believe this to be an area worth researching. Avoiding tactical block purchases to steer votes and then dump the same tokens to avoid downside is something worth avoiding. We don’t have that issues now with a concentrated holding and a delegate system, but as we move to a more and more decentralised world, it will be a problem to deal with. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#22",
                    "likes": "5",
                    "time": "04/02/2022-17:12:36",
                    "content": "Agree that this discussion should take place in the context of the larger MKR tokenomics review that is underway. Not sure if the Signal Request is set up this way, but I think it should be a signal to incorporate the approach into the larger proposal. It should not be a signal to consider the topic in isolation. I’m not a fan of being hyper focused on token tricks that pursue a theoretical quantitative incentive alignment. The best hodlers will be the ones who believe the whole system operates well and is likely to succeed in scaling the utility and usage of the protocol. How do we inspire that kind of substantive confidence? It won’t be because we burn or have a complicated lockup mechanism. I’d like to see the community incorporate other fields of knowledge about governance and psychographics into our thinking about how the tokenomics incentivize and activate participation. Highlighting this discussion Research-Driven Insights About DAO Governance - how do we bring these conversations together? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#23",
                    "likes": "0",
                    "time": "04/02/2022-19:43:54",
                    "content": "    luca_pro:  There are shortcomings of the ‘ve’ model. However I believe this to be an area worth researching.   From the point of view of the large owners and the whales, thinking in purely financial terms, it is indeed a problematic system. But let’s look at it from the perspective of the small and very committed owners. I think a long term vested MKR is good for the protocol and equally good for these small long term owners, because:  Combined with a proper reward system, it can be a great benefit for smaller MKR owners who do not have to bear the risks of another lending protocol and their long-term vested MKR will benefit them in the present.  Depending on the amount of tokens committed, this method can mitigate the risk of price falls generated by stop loss orders, panic selling, etc. in the event of sudden market dumping such as we have just experienced.  If we assume that in the long run a “many small owners - at most one or two large owners” is a more desirable ownership structure for the Maker than a “dozen large - small amount of little”, then this could be a good direction, it is a question of who we want to favour. I voted to abstain because in the absence of a reward system, I see no point in talking about “ve” tokenomics due to lack of motivation, and the Saggitarius Engine also contains an adequate solution to the problem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.87298044217687
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#24",
                    "likes": "1",
                    "time": "07/02/2022-12:46:29",
                    "content": "Bumping this thread, a little light on votes here especially with all the abstaining votes. If you have thoughts on this Signal, please consider voting before the poll is set to close tomorrow! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.354166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ribbit-0",
                    "index": "#25",
                    "likes": "0",
                    "time": "08/02/2022-21:22:19",
                    "content": "Did this proposal die? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#26",
                    "likes": "0",
                    "time": "08/02/2022-21:54:05",
                    "content": "This Signal Request ends today. At the moment “No” is the leading non-abstain option, in the event that this is the case when the poll ends, the Signal Request will be marked as “rejected”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#27",
                    "likes": "2",
                    "time": "09/02/2022-20:59:10",
                    "content": "This Signal Request has now ended. The winning option is “No”. Therefore, no further action will be taken at this time. Thank you to everyone who contributed to this Signal Request. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#28",
                    "likes": "0",
                    "time": "12/03/2022-06:59:29",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}