{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/delegate-protocol-treasury-mkr-to-independent-third-parties/10068",
            "title": "Delegate Protocol Treasury MKR to Independent Third Parties? ",
            "index": 10068,
            "category": [
                "Governance"
            ],
            "tags": [
                "delegation",
                "governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#1",
                    "likes": "0",
                    "time": "30/08/2021-03:37:53",
                    "content": "Take a look at what a16z is doing with some of their governance tokens.  They are selecting multiple  independent third parties and delegating voting power to them. Some highlights:  delegation helps to increase near-term engagement by giving more participants a say in the process   Delegation provides a way to elevate community members who demonstrate early leadership in governance. These tend to be active users who understand the protocol and want it to grow, but otherwise lack sufficient tokens to participate meaningfully.   Delegation provides a tool to incorporate new perspectives into a protocol’s ecosystem for the first time. These are often individuals or groups who are interested in crypto, and who bring valuable and unique skill sets, but have not yet had a chance to get involved. Since delegation requires little or no upfront cost on their part, it provides the all-important foot-in-the-door, which is typically all they need to start contributing.  Delegates include Non-profit Organizations, Startups, University Organizations, and Crypto Community Leaders. They are provided a de minimis stipend to ensure their gas costs are covered. MakerDAO currently has a high concentration of voting power which a program like this could help mitigate and a Protocol Treasury of 84,000 tokens which, since they are owned by the protocol, are not used to govern.    Should MakerDAO seriously consider a program to delegate Protocol Treasury MKR to independent third parties?  Yes No Abstain     0 voters     ",
                    "links": [],
                    "GPT-summary": "The author proposes that MakerDAO should delegate Protocol Treasury MKR to independent third parties, similar to what a16z is doing with their governance tokens. The proposal highlights the benefits of delegation, such as increasing engagement, elevating community members, and incorporating new perspectives. The author suggests that MakerDAO's high concentration of voting power and Protocol Treasury of 84,000 tokens could be mitigated by such a program. The post ends with a poll asking whether MakerDAO should seriously consider the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.3626325757575755
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "1",
                    "time": "30/08/2021-04:20:45",
                    "content": "    Spidomo:  Protocol Treasury of 84,000 tokens   This is a fiction. Those tokens are as good as burned. Wby not mint another million tokens and associate them with delegates?     Spidomo:  Delegates include Non-profit Organizations, Startups, University Organizations, and Crypto Community Leaders.   Like people with no skin in the game? Okay, say I’m driving a car. I decide that instead of driving myself, I should invite a selection of random people     Spidomo:  who bring valuable and unique skill sets   to my transportation experience. I arrange for them to drive my car for me, by remote control. Is this an accurate analogy? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.696428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#3",
                    "likes": "0",
                    "time": "30/08/2021-04:56:30",
                    "content": "    psychonaut:  This is a fiction. Those tokens are as good as burned. Wby not mint another million tokens and associate them with delegates?   I completely agree that the the Protocol Treasury is the economic equivalent of burned tokens, and how many MKR tokens are currently owned by the Pause Proxy is not really relevant here since an arbitrary number could be minted.     psychonaut:  Like people with no skin in the game? Okay, say I’m driving a car. I decide that instead of driving myself, I should invite a selection of random people   If a car was piloted by dozens or hundreds of people (like MakerDAO is), training a few carefully selected new drivers by granting them 0.10% or 0.01% participation might be a good way to bring in new driving talent.     psychonaut:  Is this an accurate analogy?   Not really, because a car has one driver at a time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.521390374331551
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#4",
                    "likes": "0",
                    "time": "12/09/2021-01:39:20",
                    "content": "Poll Results Summary: In a landslide, unanimous (excluding abstainers) vote, there is absolutely no support for drawing fresh participants into MakerDAO at almost no cost by granting selected organizations temporary delegated voting power. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "12/12/2021-07:39:45",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}