{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/the-quest-for-dao-operational-maturity-with-retro-drinks-w-makerdao-delegates-now-on-lenstube/19344",
            "title": "The Quest For DAO Operational Maturity with Retro - Drinks w/MakerDAO Delegates now on LensTube! ",
            "index": 19344,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegate-platform",
                "community-delegate-vlog",
                "drinks-maker-delegates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "6",
                    "time": "08/01/2023-00:01:35",
                    "content": "  Starting 2023 by Launching Drinks w/MakerDAO Delegates on MakerTube via Lens Protocol   The MakerDAO community show, “Drinks with MakerDAO Delegates” will now be featured via MakerTube.lens as we gradually transition away from Centralized Content providers. To kick-things-off in the New Year, we sit down with Retro of MakerDAO’s CES ( Collateral Engineering Services) Core Unit and discussed the operational hurdles that DAOs encounter, as well as defining Maker’s EndGame Constitution. We really enjoyed discussing many MakerDAO topics with Retro, as well as reviewing our favorite Drinks and hope you take time to enjoy this discussion to kickoff 2023.  Watch the Decentralized Version on MakerTube.Lens and collect it as an NFT!! https://lenstube.xyz/watch/0x01a2c6-0x02  Not Financial Advice This Content is for entertainment and informational purposes only, you should not construe any such information or other material as legal, tax, investment, financial, or other advice. Nothing contained on the Drinks With MakerDAO Delegates YouTube Channel, and/or MakerTube.lens Channel constitutes a solicitation, recommendation, endorsement, or offer by @Retro @ultraschuppi a.k.a, Tim Schuppner @ElProgreso a.k.a, Frank Cruz @rspa a.k.a, Raphael Spannocchi, Flip Flop Flap Delegate LLC, Flipside Crypto, or any third party service provider to buy or sell any cryptocurrencies, securities, or other financial instruments. Nothing in this YouTube Video constitutes professional and/or financial advice.  The Tastings: UpOnly! Schuppi: Some type of German Lemonade    Germany  4.3 Stars     Raphael: Rum-Red Wine-Grape Liquor from Kraeuteropa  Germany  4.4 Stars      Retro: Hills Bros 100% Arabica Coffee   4.5 Stars     El Pro: Trader Joe’s Mango Smoothie    4.6 Stars     THE CENTRALIZED VERSION        ",
                    "links": [
                        "https://www.xn--kruteropa-w2a.de/",
                        "https://www.walmart.com/ip/Hills-Bros-100-Arabica-Whole-Bean-Coffee-Premium-Gourmet-Medium-Roast-32-oz/46142519",
                        "https://www.youtube.com/watch?v=KpbW8vpzBME"
                    ],
                    "GPT-summary": "The post is an announcement of the MakerDAO community show, \"Drinks with MakerDAO Delegates,\" which will now be featured on MakerTube.lens. The post explains that the show will discuss operational hurdles that DAOs encounter, as well as defining Maker's EndGame Constitution. The post also includes a review of the drinks tasted during the show. The post is an advertisement for the show and the MakerTube.lens platform, and a positive feedback is given by the author about the discussion with Retro.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.50770202020202
                }
            ]
        }
    ]
}