{
    "poll_list": [
        {
            "title": "Inclusion Poll for Declaration of Intent - Maker Protocol Cover with Nexus Mutual (MIP13c3-SP8)- January 11, 2021",
            "index": "5056",
            "option": "No",
            "supporting_mkr": "32,249",
            "highest_fraction": 0.35
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip13c3-sp8-maker-protocol-cover-with-nexus-mutual-declaration-of-intent/5056",
            "title": "MIP13c3-SP8: Maker Protocol Cover with Nexus Mutual (Declaration of Intent) ",
            "index": 5056,
            "category": [
                "Maker Improvement Proposals"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Hugh_Karp",
                    "index": "#1",
                    "likes": "13",
                    "time": "09/11/2020-11:34:07",
                    "content": "Preamble MIP13c3-SP#: 8 Author(s): Hugh Karp (@hughkarp) Contributors: n/a Status: Request for Comment (RFC) Date Proposed: 2020-11-09 Date Ratified: <yyyy-mm-dd> Declaration Statement: Maker Governance wishes to engage Nexus Mutual to provide cover for the Maker Protocol. Declaration to Replace: n/a  Specification Context and Motivation  The Maker Protocol burns MKR in good times when surplus is being generated and mints MKR in bad times when debt is accrued. As was demonstrated on Black Thursday this tends to result in MKR being burned at high prices and minted at low prices. It can be beneficial to purchase cover on Nexus Mutual that provides DAI when bad debt accrues to dampen MKR minting, with the cover purchase being paid for using high MKR prices. Recognizing this procyclical nature of MKR minting and burning, MakerDAO wishes to purchase tailored cover on Nexus Mutual to provide DAI claims when material bad debt is accrued by the protocol. Over cycles this is expected to result in a lower MKR supply. MakerDAO may also benefit from more material tail risk coverage in the future which can be worked towards as Nexus Mutual grows as it would be a relatively easy extension of the proposed solution.  The following is declared: Declaration Detail   Provided pricing is at or below 4% pa (to be discussed in RFC stage), MakerDAO wishes to purchase four (4) tranches of Maker Protocol Cover of 3,000,000 DAI per tranche for a period of 365 days (up to 12,000,000 DAI total) on the basis of the following claims payment terms:  If the Maker Protocol accrues bad debt of more than 5,000,000 DAI in any 30 day period, one tranche of 3,000,000 DAI claim will be paid; and If the Maker Protocol accrues bad debt of more than 10,000,000 DAI in any 30 day period an additional tranche of 3,000,000 DAI claim will be paid; and If the Maker Protocol accrues bad debt of more than 15,000,000 DAI in any 30 day period an additional tranche of 3,000,000 DAI claim will be paid, and If the Maker Protocol accrues bad debt of more than 20,000,000 DAI in any 30 day period an additional trance of 3,000,000 DAI claim will be paid, up to a maximum of four (4) tranches and a total claim payment of 12,000,000 DAI. Maker Protocol bad debt definition to be defined in detail through discussions with the working group (see below), so that a) it is simple to determine if a claim should be paid; and b) can’t arbitrarily be triggered by MKR holders; and c) doesn’t weaken MKR holders incentives to build surplus.    Note: the above is a suggested framework and can be altered through discussion with working group.   The MakerDAO community, wishes to enact a working group titled “Maker Protocol Cover Group” led by TBA to:  Review the claims wording before it is launched on Nexus Mutual to start the price discovery process, in particular the specific definition of bad debt and how it can be measured in the Maker Protocol; and Review if any changes should be made to the Maker Protocol to ensure flop auctions can be avoided via direct claim payment into the protocol; and Determine the best way for MakerDAO to technically interact with Nexus Mutual’s smart contracts including;     a) the cover purchase process;  b) payments made from the Maker Protocol; and     c) submission of claims. Review the pricing threshold and claims payout structure outlined in the declaration detail and make changes if considered appropriate.    Relevant Links MakerDAO Protocol Cover Using Nexus Mutual Presentation to Governance and Risk Meeting ",
                    "links": [
                        "https://youtu.be/0v3E_kpLxFg?t=3066",
                        "https://forum.makerdao.com/t/maker-relay-ep-27-happy-2021/6016",
                        "https://forum.makerdao.com/t/a-maker-community-2020-summary/5848",
                        "https://forum.makerdao.com/t/maker-relay-ep-26/5759",
                        "https://forum.makerdao.com/t/maker-relay-ep-25/5671",
                        "https://forum.makerdao.com/t/informal-poll-would-the-maker-community-want-to-onboard-a-new-collateral-e-g-wbtc-b-backed-by-b-protocol-that-has-lower-cr-with-the-same-sf/5652",
                        "https://forum.makerdao.com/t/strategic-direction-integration-with-defi-or-protocol-base-layer/5646",
                        "https://forum.makerdao.com/t/maker-relay-ep-24/5534",
                        "https://forum.makerdao.com/t/week-24-dai-distributions-sourcecred-funding-mip13c3-sp6/5223",
                        "https://forum.makerdao.com/t/maker-relay-ep-21-en-espanol/5199",
                        "https://forum.makerdao.com/t/maker-relay-ep-21/5181",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/5",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-118-thursday-november-12-16-00-utc/5008/8",
                        "https://forum.makerdao.com/t/maker-relay-ep-20-en-espanol/5084",
                        "https://forum.makerdao.com/t/maker-relay-ep-20/5078",
                        "https://forum.makerdao.com/t/alm-framework-for-makerdao/12994/5",
                        "https://forum.makerdao.com/t/guide-navigating-feedback-from-governance-and-the-greater-makerdao-community/8303",
                        "https://forum.makerdao.com/t/weekly-mips-update-25/6092",
                        "https://forum.makerdao.com/t/maker-relay-ep-27-en-espanol-feliz-2021/6035"
                    ],
                    "GPT-summary": "The author proposes that Maker Governance engage Nexus Mutual to provide cover for the Maker Protocol. The proposal suggests purchasing four tranches of Maker Protocol Cover of 3,000,000 DAI per tranche for a period of 365 days. The post also outlines the claims payment terms and the working group that will review the claims wording and determine the best way for MakerDAO to technically interact with Nexus Mutual's smart contracts. The post does not contain any advertising or entirely positive/negative feedback on the proposal.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.955083655083655
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hugh_Karp",
                    "index": "#2",
                    "likes": "0",
                    "time": "09/11/2020-11:35:23",
                    "content": "Hi all, really interested in feedback on the above and if there any individuals interested in forming part of the proposed working group please get in touch. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#3",
                    "likes": "3",
                    "time": "09/11/2020-21:35:36",
                    "content": "This is really great to see and I hope that several people volunteer for the working group. My one comment would be that we should find an alternative measurement to “bad debt.” I say this to protect Nexus, not MakerDAO. If the MKR holders wanted, they could mechanically trigger these contracts by collecting fees beyond 100% collateralization (by turning off liquidations) and using this Dai to buy MKR. This would technically be “bad debt” but the MKR holders in reality would be double-dipping. I would defer to the working group to see the best specific language for the coverage, but I think what you’ve presented so far is more than enough to move forward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#4",
                    "likes": "2",
                    "time": "10/11/2020-00:54:35",
                    "content": "  Maker Protocol bad debt to be measured after applying any surplus buffer or any other assets outside the surplus buffer that are not automatically used to cover bad debt.   How I read the provision above: If MakerDAO allows a 4 million DAI surplus buffer to accumulate, then would need to incur 9 million DAI liquidaiton shortfall to trigger first tranche coverage. If MakerDAO allows only a 1 million DAI surplus buffer to accumulate, then need to incur a 6 million DAI liquidation shortfall to trigger it. Do I understand that correctly? If so, doesn’t that create a (perverse) incentive to not hold a surplus buffer? In my view, “bad debt” is the shortfall when a specific vault is liquidated but the amount recovered after disposing of the collateral is less than the outstanding debt.  The sum of all such vaults is the total bad debt. Why should the surplus buffer matter any more than how much money you have in the bank matters when you get an insurance payout for your house burning down? ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-24/6052",
                        "https://forum.makerdao.com/t/weekly-mips-update-23/5914",
                        "https://forum.makerdao.com/t/maker-relay-ep-26-en-espanol/5768",
                        "https://forum.makerdao.com/t/maker-relay-ep-25-en-espanol/5680",
                        "https://forum.makerdao.com/t/maker-relay-ep-24-en-espanol/5574",
                        "https://forum.makerdao.com/t/maker-governance-review-november-2020/5453",
                        "https://forum.makerdao.com/t/maker-relay-ep-23-en-espanol/5442",
                        "https://forum.makerdao.com/t/maker-relay-ep-23/5419",
                        "https://forum.makerdao.com/t/weekly-mips-update-22/5416",
                        "https://forum.makerdao.com/t/maker-relay-ep-22-en-espanol/5290",
                        "https://forum.makerdao.com/t/maker-relay-episode-22/5288",
                        "https://forum.makerdao.com/t/weekly-mips-update-21/5222"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.657118055555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "0",
                    "time": "10/11/2020-10:41:17",
                    "content": "    Spidomo:  If so, doesn’t that create a (perverse) incentive to not hold a surplus buffer?   Yeah, I was thinking about this as well. I do think we need to come up with a better definition of bad debt. Is anyone interested in being part of the proposed working group? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hugh_Karp",
                    "index": "#6",
                    "likes": "1",
                    "time": "10/11/2020-11:10:14",
                    "content": "I struggled to come up with the right definition here as it needs technical input. Probably best guided by the working group. I can change the Declaration of Intent to be more objective based. ie \"Bad Debt definition to be defined so that:  It is simple to determine if a claim should be paid; and can’t arbitrarily be triggered by MKR holders; and doesn’t weaken MKR holders incentives to build surplus.\"  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.616071428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "2",
                    "time": "10/11/2020-11:17:42",
                    "content": "Yeah, I think that makes sense. The more flexibility you leave in the Declaration of Intent the better really. The focus should be on the core question ‘Does Maker Governance wish to engage Nexus Mutual to provide cover for the Maker Protocol?’ If the answer comes back as yes, then time and effort can be spent on a concrete implementation which can then be confirmed by governance and put into practice. Showing awareness in the declaration of the issues still to be resolved is a positive, but they don’t need to be solved at this point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.173295454545454
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#8",
                    "likes": "9",
                    "time": "11/11/2020-03:10:54",
                    "content": "This proposal would cost MakerDAO a large sum of DAI, up to 480,000 for one year of coverage. I think it’s widely agree that the coverage would have a negative expected value to MakerDAO (based strictly on the premium vs. expected payout). The main proposed benefit to MakerDAO is avoiding the need to auction of MKR during a time of depressed MKR prices (which seems likely to be correlated with bad debt, such as during the March 2020 crash). Some things to consider:   There are other ways to avoid large Flop auctions during a time of crisis, such as:  Increasing the Debt Buffer (how much debt is allowed before Flop auctions start) Limiting how much MKR can be out for auction at a time by adding  the same Litter/Box functionality recently added to collateral auctions    B. Protocol has reduced the chances and amount of any potential bad debt. If MakerDAO wanted to spend some Dai to reduce the chances of bad debt further, it could grant some Dai to the rewards pool to further incentivize vault holders to move over.  Even 5% of the proposed cost of this proposal would probably go a long way.   This kind of coverage is highly gameable because interested parties can easily ensure they never need to make a payout. All they need to do is run some auction keeper bots. In fact, anyone potentially on the line to pay out millions of DAI if bad debt accrues would be irresponsible if they did not do so (remember, it was only the lack of sufficient well-functioning keepers that caused the losses of March 2020). This may be a valuable behavior to incentivize, but B. Protocol incentivizes behavior with similar results but no payments from MakerDAO.   If MakerDAO is mismanaged, and despite all points above the system incurs large amounts of bad Debt, is it really undesirable to conduct auctions of MKR at the prevailing market price? Doing so would dilute the voting power of MKR which badly managed the system and give newly minted MKR a chance to do a better job.  It could be that’s actually beneficial in the long run.  In other words, this coverage could be a moral hazard.   This is a proposal to charge MakerDAO a premium of hundreds of thousands of DAI, per year. Unless there’s a lot I’m missing here, this seems extremely expensive what what MakerDAO gets. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.725490788281486
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#9",
                    "likes": "2",
                    "time": "11/11/2020-07:45:05",
                    "content": "    Spidomo:  Unless there’s a lot I’m missing here, this seems extremely expensive what what MakerDAO gets.   I generally agree with your point of view. Insurance is great when you want to outsource the risk management. But MakerDAO is directly managing its risk profile (Risk Teams), it is setting up the min. coll. ratios to handle it, and corresponding SF. All in all, I feel like MakerDAO should handle the risk internally (as it was always designed to do) and do it well. One notable exception are stablecoins: we might want to insure ourself against the crash in value of any of the stablecoins we use. This is because it would be very unlikely that we can handle such situation with the tools at our disposal (margin calls and auction mechanisms) since the coll. ratio is 101%. But hopefully we will reduce our exposure to stablecoins in the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.05
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hugh_Karp",
                    "index": "#10",
                    "likes": "2",
                    "time": "11/11/2020-10:42:54",
                    "content": "I think the main point here is that you don’t know what all the risks are, and this is a catch all solution. Perhaps B.Protocol plus making some protocol adjustments deals with everything, perhaps it doesn’t, you can never be sure. Also, I think incentivising extra keeper bots can only be a good thing for the Maker Protocol. On the moral hazard point, I think this is a genuine concern and is why I suggested a maximum 60% payout. It provides significant dampening but maintains alignment of interest. From my experience if you start getting close to 80% there can be problems. Of course there is a question on value for money, and that will always be hard to answer, as we’re talking about extreme risk. While the EV in DAI terms over cycles should be negative, if large claims occur early and prices subsequently rise then Maker can choose not to renew. Expectations always differ from actual results when dealing with risk transfer. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.579761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#11",
                    "likes": "0",
                    "time": "11/11/2020-17:43:59",
                    "content": "    Hugh_Karp:  I think the main point here is that you don’t know what all the risks are, and this is a catch all solution. Perhaps B.Protocol plus making some protocol adjustments deals with everything, perhaps it doesn’t, you can never be sure.   This is a good point. For example, a true Black Swan event (which March 2020 was not). If the ETH price went from $450 to $4.50 in 30 minutes (and didn’t rise above $5 for a long time), MakerDAO would have a lot of bad debt. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#12",
                    "likes": "3",
                    "time": "12/11/2020-02:51:07",
                    "content": "Just curious, is insurance fund stored as ETH or NXM? In that case, if the whole system faces the black swan event, wouldn’t the value of ETH and NXM also significantly go down and can’t fullfill the cover even if it’s voted and approved for payout? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.722222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "1",
                    "time": "12/11/2020-03:30:33",
                    "content": "    LongForWisdom:  Is anyone interested in being part of the proposed working group?   I nominate @ejbarraza @MakerMan @SebVentures @mrabino1 @iammeeoh @g_dip and @Spidomo to balance it out. I believe these community members have the intelligence and the skill set to point us in the right direction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.3392857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hugh_Karp",
                    "index": "#14",
                    "likes": "2",
                    "time": "12/11/2020-10:13:09",
                    "content": "Most of Nexus’ funds are currently held in ETH (NXM is not used to fund payouts at all) but we’ll be transitioning to a mix of DAI and ETH as we grow. It’s important to match the currencies of assets held with potential claim liabilities to avoid this exact scenario. Right now it’s less of an issue as there is quite a high degree of over-collateralisation in Nexus but it’s an important consideration. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.016137566137566
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#15",
                    "likes": "4",
                    "time": "13/11/2020-15:42:12",
                    "content": "Only because of the mention did I find my way here so thanks for that. I want to echo some sentiments.     iammeeoh:      Spidomo:  Unless there’s a lot I’m missing here, this seems extremely expensive what what MakerDAO gets.   I generally agree with your point of view   Let me add a few points.  Excuse me if I may not get the number accurately here but I am roughing it here.   I see 3M on every 5M lost on top of the 4M or so banked.  So we are looking at maximum of 12M coverage on 27M(40% coverage) loss (4M of which is already covered by surplus).   Maker takes a 12M Nexus covers 3M (25%), 17M, 6M(33%) etc.   so even if this was bonded to the full 12M (which it won’t be) the money earns 4% which isn’t bad in the current near zero rate environemnt. Honestly have to wonder what scenarios this is going to mitigate losses.   I mean if we are looking at catastrophic events it literally is like 10M or 200M here with a DAI outstanding of almost $1B.   The idea that somehow a 12-25M loss could be targetted with this kind of insurance on a potential 1B outstanding seems ill thought out here.  When I resolve risk in this case there aren’t many circumstances where this isn’t an all or nothing insurance. Once we got to 1B and had some reasonable fees 2-4% ( skip the debate on USDC-A here on surplus) the protocol is earning 20-40M/yr and a 10M hit while distasteful is something the protocol ‘should’ be able to handle via fees and risk management. (imo).  Do we really want to give someone else .5M/yr for a up to 12M insurance policy? Then a thought came to mind that led to the following questions for Nexus Mutual here:  Does Nexus Mutual own MKR currently? If yes to 1 - does it vote that MKR? If no to 1 - does it intend to buy MKR if this insurance is accepted? or voluntarily declare not to buy MKR to avoid any possible governance conflicts of interst while insurance contracts are active?  My problem here is that someone could literally take 5-10M now and buy MKR and vote to affect Maker actions to reduce the risk here and guarantee profit (as well as added extensions/increases in price etc. potentially).  Which if you think about it is a good incentive one might even want to require of such an insurer (that they place their money where their mouth is on insurance by owning AND voting the MKR).   But this could also become a double edged sword an insurer with vested interest in Maker not wanting Maker to take on risk to grow… So before I would vote to accept an insurance contract I want to know up front whether our insurer has a stake in MKR, plans to obtain some conditionally on insurance being accepted, or whether they fully intend to avoid any conflict of interest here by not owning MKR so I could have full disclosure at least on intentions. Generally I think Maker should take a more global look at this issue, characterize risk events and whether we should even try to offload pieces of the risk profile on to other players. Other questions.   Where does this player expect to source DAI during such events? What is the time frame for calling on insurance and delivery of DAI funds?  Minutes, hours or days? End result of this is unless I have missed some other more lengthly forum thread/discussion avenue I think a more general risk and risk mitigation discussion should be had within MakerDAO, with some polling on this generally.   Where do Maker risk teams sit on this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.503102836879432
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#16",
                    "likes": "2",
                    "time": "14/11/2020-03:47:37",
                    "content": "MakerMan moves with the speed of a centipede and can injure any contender. Straight up and down–the Maker Community truly appreciate your input.  There a few points I totally missed, or did not think about–thanks again @MakerMan . I want to hear from @mrabino1 (if possible) and @ejbarraza and yes would like to know what @Primoz and @Vishesh are thinking–but as a Community we need to grab the bull by the horns and start learning how to be independent of Maker Foundation employees. Hence, @SebVentures @g_dip (yea I know, but you’re almost one of us) @Spidomo @iammeeoh tells us watcha thinking? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#17",
                    "likes": "3",
                    "time": "14/11/2020-08:26:55",
                    "content": "    flipflopflapdelegate:  MakerMan moves with the speed of a centipede and can injure any contender. Straight up and down–the Maker Community truly appreciate your input. There a few points I totally missed, or did not think about–thanks again @MakerMan   My hobby since I was a child was entomology and lots of people have used bug analogies to describe aspects of me.  Honestly the nicest compliment I have received in a while and I have been beginning to think people would wish I would just shut up on this stuff and write medium articles or something. Thanks @flipflopflapdelegate you made me smile late this evening. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.571428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#18",
                    "likes": "8",
                    "time": "14/11/2020-09:03:00",
                    "content": "As you know, I try to avoid making decision based on sentiment. I have therefore not much to add from my previous comments. I prefer to have Strategic Reserves, but being insured can make sense while slowly building those reserves. I would start by framing the problem before jumping on the solution (buying insurance up to 12M). The problem is how to optimize our solvency. What solvency means in the Maker context for a start! That’s something we need to figure out before we reach DAI = 10B. A rule in Basel III (the regulation for banks) is to have equity > 3% of the assets (the loans here). We are at 0.34%. ",
                    "links": [
                        "https://forum.makerdao.com/t/makerdao-protocol-cover-using-nexus-mutual/4761/40",
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaration-of-intent-strategic-reserves-fund-srf/3765"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.9305555555555554
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#19",
                    "likes": "2",
                    "time": "16/11/2020-10:14:11",
                    "content": "3% is for the real risk takers :). Prudential regulations go way over than that. And most banks maintain an economic vs regulatory capital which is usually higher than the regulated (and strictly audited) one. Economic capital will be more in the 10-15% if the regulators have done their job appropriately  And basel IV is already under implementation in some jurisdictions too, which will impact that further. Personally, I would be very surprised if the regulator(s) (which jurisdiction, who knows!) were not to knock at the door asking prudential questions before we reach 10B DAI. In my jurisdiction (a small country but still an OECD one ) 10B would put Maker closer to some of the tier 1 banks which are very regulated. For illustration: https://bankdashboard.rbnz.govt.nz/summary ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 6.1394230769230775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#20",
                    "likes": "1",
                    "time": "16/11/2020-23:09:16",
                    "content": "I see the point you guys are making, but I would exclude stablecoin loans from your calculations. The risk of those assets is binary and existential. In my opinion, there’s no sense in adjusting capital levels around their presence. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#21",
                    "likes": "2",
                    "time": "17/11/2020-19:37:04",
                    "content": "Well I have laid out my view of using three buckets of insurance/reinsurance. Namely a liquidity pool of DAI, self-insure using strategic reserves in BTC, and reinsure using Nexus Mutual cover. I think B. Protocol can take the place of a liquidity pool. If I had to make a decision on either of the next two taking priority I would say building a strategic reserve is of paramount importance. Without a rainy day fund Maker is playing a dangerous game. If the above has been implemented then I would say at that point we can move towards a bespoke insurance policy from Nexus Mutual. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#22",
                    "likes": "3",
                    "time": "18/11/2020-16:23:56",
                    "content": "    ejbarraza:  reinsure using Nexus Mutual cover   Interesting…mechanically speaking, are you saying we would buy insurance on the buffer itself? I still haven’t thought of a good way that we can structure this with Nexus. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hugh_Karp",
                    "index": "#23",
                    "likes": "1",
                    "time": "18/11/2020-16:51:46",
                    "content": "@g_dip I presume it’s relatively easy to measure any protocol losses that occur that would reduce the buffer, if so we can use that as the trigger instead. eg if losses > $xm within a month then trigger a claim payout. You can also get more complicated if required, eg by linking the claim payout to some combination of strategic reserves and losses incurred. This would allow you to calibrate to the right level of self insurance vs reinsurance. @ejbarraza your structure makes sense to me. One point, cover with Nexus is probably more valuable to Maker when you haven’t built up any strategic reserves yet, as this is when you are more exposed. It may make sense to implement cover first and then build up strategic reserves rather than the other way around. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.152529761904761
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#24",
                    "likes": "1",
                    "time": "18/11/2020-16:59:37",
                    "content": "@Hugh_Karp The reason I suggest building a strategic reserve first is that having the funds in place means Maker DAO can move quickly to stabilize the system if necessary. If we opt for buying Nexus cover without first having reserves, then we are at the mercy of the claims payout timeline. I presume that it will not be immediate which in DeFi can lead to catastrophic losses (e.g. Black Thursday). How long do you think it would take from a legitimate claim being filed to the point of Maker DAO being compensated? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.513888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hugh_Karp",
                    "index": "#25",
                    "likes": "0",
                    "time": "18/11/2020-17:18:01",
                    "content": "@ejbarraza Claim payout will most likely be finalised with 2-3 days, at most 1 week. I believe this fits within the current flop auction time window (but I’m not 100% on that). This would be a technical detail to pick up in the working group. The goal would be to get the claim payment in before the auctions start. re reserves, my only point was you still have to build reserves up whether you have Nexus cover or not, and building them up will take time. Nexus cover can help bridge that gap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#26",
                    "likes": "2",
                    "time": "13/12/2020-22:23:53",
                    "content": "So this feedback is coming a little late, but I wanted to make a suggestion. With some of the recent Declarations of Intent we’ve found that having the contents be highly specific has caused frustration on all sides when it comes to implementation. Generally, with something like this the domain teams may want to provide feedback and analysis regarding the numbers and mechanics involved. Given their current workload the domain teams aren’t going to have time to look at something until it’s passed a governance vote. However, it is possible that they will feel obligated to recommend changes to the proposed numbers / mechanics after the Declaration of Intent vote takes place. This can cause problems if governance or the author of the subproposal thought they were voting for specific numbers / mechanisms that were already set in stone. I think this process will move more smoothly if the Declaration is more general. This also helps capture support from those that agree in principle, but disagree with the specifics. I would maybe clarify in the wording that the pricing and / or tranches is a starting point, and is subject to change pending recommendations from the working group and / or relevant domain teams. I’d also like to clarify that the domain teams aren’t obligated to work on implementation or analysis of this declaration if it does pass through governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.415277777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hugh_Karp",
                    "index": "#27",
                    "likes": "1",
                    "time": "05/01/2021-09:29:50",
                    "content": "This MIP has now been categorised as a Formal Submission. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#28",
                    "likes": "0",
                    "time": "03/02/2021-22:58:30",
                    "content": "This MIP did not pass the January Governance cycle, it failed at the Inclusion Poll stage. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                }
            ]
        }
    ],
    "group_index": "2914"
}