{
    "poll_list": [
        {
            "title": "Ratification Poll for Adding Sidestream Auction Services Core Unit, SAS-001 - November 8, 2021",
            "index": "10796",
            "option": "Yes",
            "supporting_mkr": "71,955",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp43-adding-sidestream-auction-services-core-unit-budget-sas-001/10799",
            "title": "MIP40c3-SP43: Adding Sidestream Auction Services Core Unit Budget - SAS-001 ",
            "index": 10799,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "1",
                    "time": "06/10/2021-14:46:47",
                    "content": " MIP40c3-SP43: Adding Sidestream Auction Services Core Unit Budget - SAS-001  Preamble MIP40c3-SP#: 43 Author(s): @danik Contributors: @BracketJohn, @lukass, @builderman, @wouter, @juan, @Petru_Catana, @lollike, @Njoku_Emmanuel Tags: core-unit, cu-sas-001, budget, dai-budget Status: Accepted Date Applied: 2021-10-06 Date Ratified: 2021-11-22 Ratification Poll URL: https://vote.makerdao.com/polling/QmPnAkS4?network=mainnet#poll-detail Forum URL: https://forum.makerdao.com/t/mip40c3-sp43-adding-sidestream-auction-services-core-unit-budget-sas-001/10799/2   Sentence Summary MIP40c3-SP43 adds the DAI budget for Core Unit SAS-001: Sidestream Auction Services.  Paragraph Summary The SAS CU budget is designed with the following in mind:  Paying for the operational costs to run the core unit Having a buffer for unexpected legal, technical, or financial expenses  Therefore, a vote to ratify this MIP means MKR holders make a commitment to:  Funding a 3 month run-way for SAS CU Replenish this runway on a monthly basis as described in the SES top-up mechanism    Specification  Motivation Based on the nature of the work done by the Sidestream Auction Services Core Unit (SAS), the budget reflects the needs of the team to ensure continuity of the work described in our MIP39. This is summarized in, but not limited to:  Visualize auction data to increase transparency and generate insights Provide intuitive UIs and well-maintained APIs for interaction with the auction mechanism (to increase accessibility and adoption) Help ensure that there is always sufficient auction participation, even in extreme circumstances such as  Protocol upgrades (e.g. new collateral types) Inefficient market conditions     Core Unit ID  SAS-001   Budget Implementation  2021-10-27_2052551799×452 46.1 KB   Monthly Budget Statement Within the first 5 days of each month, we will submit a Monthly Budget Statement to the signers of the Auditors Wallet with the following sections:   Budget Forecast: The amount of Dai that is required to maintain a 3-month runway for the team based on available information  Previous Month Actuals: The actual expenses (DAI and MKR) of the month that just ended  MKR Vesting Overview: A schedule of the expected MKR vesting amounts for the current team configuration, grouped by the pay-out month.  Transaction Amounts  The required DAI amount for the Operational Wallet to replenish the 3-month runway Any DAI amount exceeding the 3-month runway that will be returned to the Auditors Wallet.    The Monthly Budget Statements will be added to the MakerDAO forum. The originals can be found here  Monthly Payment Flow Once the Monthly Budget Statement has been delivered, the following payment flow will be executed:   Budget Statement Review  SES Accounting will review the monthly budget and check that its expenses reflect the allocated budgets in the budget MIP. SES Accounting may ask the SAS team to clarify or correct the budget statement. In case of disagreements, the payments will be paused, and SES Accounting will escalate to the Maker Community.    Top-up transaction  The auditors will pull the available amount from the DssVest contract. Once the Auditor Wallet signers are satisfied with the monthly budget statement, a top-up transaction from the Auditor Wallet to the SAS Operational Wallet will be made. The top-up amount will replenish the 3-month runway based on the forecast in the monthly budget statement.    Return excess funds to protocol  After the top-up transaction has been completed, the Auditor Wallet signers will return any funds to the protocol that exceed 2x the monthly budget cap.     Wallets SAS Auditors Wallet (2:3)  Controlled by the SAS Auditors Address: 0xb1f950a51516a697E103aaa69E152d839182f6Fe Signers  SES Accounting (1:2, 0xA2A855Ac8D2a92e8A5a437690875261535c8320C) SES Auditing (1:2, 0xB2da57e224949acDDe173a5b8A8160c023ea86e6) Maker Protocol (MCD_PAUSE_PROXY, 0xBE8E3e3618f7474F8cB1d074A26afFef007E98FB)    SAS Operational Wallet (2:3)  Controlled by the SAS Core Unit team Address: 0x465AA62a82E220B331f5ECcA697c20E89554B298 Signers  0x274736890166046f00f424fEB64b2E468841ebfE 0x4f3B7fb6204C614B28F0e1f50Dc1C99175631678 0xD95802afC02B49e5C1a6016D44d08fe37EAfEc9d     Initial Seed Transaction The initial seed transaction covers three months runway based on the forecast in the budget statement:  3 x $81,912.50 = $245,737.50   Transactions / Approvals   Initial Seed Transaction From: Maker Protocol Surplus Buffer To: SAS Auditors Wallet (0xb1f950a51516a697E103aaa69E152d839182f6Fe) Amount: 245,737.50 DAI When: Upon approval of this MIP (approx. Dec 1 2021)   DssVest Streaming Budget Cap From: Maker Protocol Surplus Buffer To: SAS Auditors Wallet (0xb1f950a51516a697E103aaa69E152d839182f6Fe) Amount: 1,130,392.56 DAI Start: 1 Dec 2021 00:00:00 End: 30 Nov 2022 23:59:59    List of Budget Breakdowns  Dai Expenditure We’re asking for a Total Budget Cap of 282,598.13 DAI, spanning a 3-month runway. The budget cap differs from the actual expenses of the core unit. The cap refers to the maximum that the core unit can request for operating, and it includes room for unforeseen circumstances. Contributor Compensation     Type Monthly Cost Quarterly     Grand Total $54,337.50 $163,012.50    Budget Breakdown     Summary Monthly Cost Quarterly     Permanent Contributor Compensation $54,337.50 $163,012.50   Travel & Events $2,500.00 $7,500.00   IT & Subscriptions $1,500.00 $4,500.00   Gas Costs $2,000.00 $6,000.00   Office Space $1,575.00 $4,725.00   Professional & Legal Services $5,000.00 $15,000.00   Engineer Contractor $10,000.00 $30,000.00   Other Contractor Services (e.g. Audits) $5,000.00 $15,000.00        Total $81,912.50 $245,737.50   Contingency Buffer (15%) $94,199.38 $282,598.13     Budget Details Providing additional detail regarding the above line items:  Permanent contributor Compensation: The permanent team consists of five permanent team members (3.5 FTE). The total cost of an employee includes only compensations as a contractor. Contractors have to take care of their health insurance and other expenses.      Team members Headcount FTE (Full-Time Equivalent)     Facilitator 1 0.5   Designer & Product Manager 1 1   Full-stack Engineer 3 2   Total 5 3.5      Travel and Events (*): The team may travel to present at industry events, attend conferences or participate in a team off-site.  IT, Infrastructure & Subscriptions (*): We anticipate a variety of costs related to software subscriptions, cloud services, analytics, and tooling. Our infrastructure costs are around $1,500 per month, coming from the previous costs that the team’s applications have incurred. We will work to lower these expenses to a reasonable amount by optimizing network usage.  Gas Costs (*): The gas cost assumes testing auction and keeper features on mainnet. $2000 per month is allocated for this purpose.  Office Space (*): Every permanent team member gets a desk paid in a co-working space (to enable working together physically)  Engineering Contractors (*): Currently two non-permanent team members work together with the team during the incubation period and will likely continue working on Auctions UI where it makes sense (potentially becoming permanent at a later point when we have a need to scale up, or reduce if the extra hours aren’t needed).  Professional & Legal Services (*): Coverage for legal services, financial services, and payment processor fees. In the first months, these costs will likely be around the estimate as we have to work with lawyers on terms & conditions and other topics to cover liabilities. Later on, the costs are likely to decrease.  Contractor Services (*): The core unit may occasionally need to hire additional contractors, other core units, or professional services (Security auditing, quality assurance, etc).  Contingency Buffer (*): Approximately 15% of the total cap costs added in case of additional urgent expenses, such as:  Spikes in gas prices Additional need to defend the CU legally/financially Error in budget planning    (*) = These are estimated values. The team will generate financial reports and return the excess capital through the top-up mechanism. Any changes to these amounts will be reported in the transparency report and reviewed by our budget auditors. This reporting framework and the monthly top-up mechanism are adopted from the SES. Thank you to SES for their incubation program and guidance.  Related Documents  MIP39c2-SP25: Adding Sidestream Auction Services Core Unit - SAS-001 MIP40c3-SP44: Adding Sidestream Auction Services Core Unit MKR Budget - SAS-001 MIP41c4-SP26: Sidestream Auction Services Facilitator Onboarding - SAS-001  ",
                    "links": [
                        "https://github.com/makerdao-sas/transparency-reporting",
                        "https://forum.makerdao.com/t/mip39c2-sp-adding-sidestream-auction-services-core-unit-sas-001/10796",
                        "https://forum.makerdao.com/t/mip40c3-sp-adding-sidestream-auction-services-core-unit-mkr-budget-sas-001/10802",
                        "https://forum.makerdao.com/t/mip41c4-sp-sidestream-auction-services-facilitator-onboarding-sas-001/10797",
                        "https://forum.makerdao.com/t/mip41c4-sp26-sidestream-auction-services-facilitator-onboarding-sas-001/10797",
                        "https://forum.makerdao.com/t/mip40c3-sp95-modifying-sidestream-auction-services-core-unit-budget-sas-001/19737",
                        "https://forum.makerdao.com/t/mip39c2-sp24-adding-immunefi-security-core-unit-is-001/10810/21",
                        "https://forum.makerdao.com/t/mip40c3-sp44-adding-sidestream-auction-services-core-unit-mkr-budget-sas-001/10802",
                        "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-20-sidestream-auction-services/10959",
                        "https://forum.makerdao.com/t/mip39c2-sp25-adding-sidestream-auction-services-core-unit-sas-001/10796",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/3",
                        "https://forum.makerdao.com/t/mip40c3-sp85-modify-sidestream-auction-services-core-unit-budget-sas-001/18253"
                    ],
                    "GPT-summary": "The post is a proposal for adding a DAI budget for Core Unit SAS-001: Sidestream Auction Services. The proposal outlines the budget breakdown, the monthly budget statement, and the payment flow. The post also explains the motivation behind the proposal and the work done by the Sidestream Auction Services Core Unit. The post does not contain any negative feedback or constructive criticism, but it does extend an invitation to the community to collaborate and provides information for those interested in the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.389843374218374
                },
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#2",
                    "likes": "2",
                    "time": "27/10/2021-19:48:17",
                    "content": "The opening post was updated with the payment implementation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/liberuum",
                    "index": "#3",
                    "likes": "0",
                    "time": "16/11/2021-11:44:53",
                    "content": "As part of our broader effort to bring more transparency to the CU budget structure, we have documented the wallet setup of this CU and others;  1439×788 83.2 KB  Read more about it here: Introducing the CU Budget Transparency Map ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#4",
                    "likes": "2",
                    "time": "16/11/2021-20:20:15",
                    "content": "The auditors wallet addresses are now available… If a MIP editor could fill out the addresses in the OP, would be appreciated:  Update 1:     danik:  Wallets SAS Auditors Wallet (2:3)  Controlled by the SAS Auditors Address: -ADDRESS- Signers  SES Accounting (1:2, -ADDRESS- ) SES Auditing (1:3, -ADDRESS- ) Maker Protocol (DSS_PAUSE)       Address: 0xb1f950a51516a697E103aaa69E152d839182f6Fe  Signers  SES Accounting (1:2, 0xA2A855Ac8D2a92e8A5a437690875261535c8320C) SES Auditing (1:2, 0xB2da57e224949acDDe173a5b8A8160c023ea86e6) Maker Protocol (MCD_PAUSE_PROXY, 0xBE8E3e3618f7474F8cB1d074A26afFef007E98FB)    (Please correct the 1:2 here too.)  Update 2:     danik:  Transactions / Approvals   Initial Seed Transaction From: Maker Protocol Surplus Buffer To: SAS Auditors Wallet ( -ADDRESS- ) Amount: 245,737.50 DAI When: Upon approval of this MIP (approx. Dec 1 2021)  DssVest Streaming Budget Cap From: Maker Protocol Surplus Buffer To: SAS Auditors Wallet ( -ADDRESS- ) Amount: 1,130,392.56 DAI Start: 1 Dec 2021 00:00:00 End: 30 Nov 2022 23:59:59    SAS Auditors Wallet (insert twice): 0xb1f950a51516a697E103aaa69E152d839182f6Fe  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.5
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp44-adding-sidestream-auction-services-core-unit-mkr-budget-sas-001/10802",
            "title": "MIP40c3-SP44: Adding Sidestream Auction Services Core Unit MKR Budget - SAS-001 ",
            "index": 10802,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/lukass",
                    "index": "#1",
                    "likes": "2",
                    "time": "06/10/2021-15:15:20",
                    "content": " MIP40c3-SP44: Adding Sidestream Auction Services Core Unit MKR Budget - SAS-001  Preamble MIP40c3-SP#: 44 Author(s): @danik Contributors: @BracketJohn, @lukass, @builderman, @wouter, @juan, @Petru_Catana, @lollike, @Njoku_Emmanuel Tags: core-unit, cu-sas-001, budget, mkr-budget Status: Accepted Date Applied: 2021-10-06 Date Ratified: 2021-11-22   Sentence Summary MIP40c3-SP44 adds the MKR Incentive Plan budget for SAS-001: Sidestream Auction Services Core Unit.  Paragraph Summary MIP40c3-SP44 adds the MKR Incentive Plan budget for SAS-001: Sidestream Auction Services Core Unit. It contains:  Total MKR Expenditure Cap Estimated MKR Expenditure (based on the current team) Escrow Wallet mechanism  The Sidestream Auction Services Core Unit supports the Sustainable Ecosystem Scaling Core Unit (SES-001) and Oracles Core Unit (ORA-001) proposal for MKR Vesting. MKR incentives have been determined based on the Program discussed here. This is a 3-year vesting plan with 1-year cliff vest.  Specification  Commitment Date The SAS Core Unit has been working under the incubation program of the SES since 21st June of 2021. The members of this core unit will take that as the start date for the vesting schedule.  Total MKR Expenditure Cap The total MKR Expenditure will not exceed 731.3859 MKR. This covers the entire 3 years plan for 3.5 FTEs.  Estimated MKR Expenditure The Estimated MKR Expenditure is our best guess of how much MKR will be used with the current team configuration. Reasons why the Actual MKR Expenditure could rise closer to the MKR Expenditure Cap:  A raise for a member of the team New hires Repricing (and resetting) the program, in the case of bear market  Price floor: -30%. If any Contributor chose to reprice their program, they could do it at a maximum of -30% from the set MKR price.  Permanent Team Forecast For the permanent team, assuming the team configuration remains the same as today, this would result in the vesting schedule below.     Date Amount     December 21, 2021 0   June 21, 2022 243.7953   December 21, 2022 121.89765   June 21, 2023 121.89765   December 21 121.89765   June 21, 2024 121.89765   Total 731.3859    This covers the total vesting schedule of 3 years for the current 3.5 FTEs. On average, this yields 69.6558 MKR per FTE per year. Any changes to these amounts will be reported and reviewed by our budget auditors.  Parameters     Parameter Value     MKR/USD lock-in Price MKR = $2604.72   MKR Price Floor -30%   Vesting Period 3 years   Cliff Vest 12 months   Vesting Schedule After cliff has expired, biannual MKR amount   Vesting Interval 6 months   Manual Repricing yes   Auto-Renewal yes     Payment Implementation This payment implementation is based on the SES MKR budget proposal  1811×411 44.4 KB   The Monthly Budget Statement contains the MKR vesting schedule. This schedule specifies when in the future MKR is vesting, and how much. To keep the risk acceptable for Maker governance as well as for the team, the MKR is moved from the protocol to the contributors in stages:  Following the MKR vesting schedule, any MKR that is vesting in 6 months or less, will be included in the top-up transaction which is added to the executive vote. This will move the MKR from the protocol to the Auditors Wallet, which then acts as an escrow wallet. Following the MKR vesting schedule, after review and approval by the auditors, any MKR that is vesting in 3 months or less, will be included in the monthly top-up transaction that moves funds from the Auditors Wallet to the CU’s Permanent Team Operational Wallet. When the MKR has vested, it is paid out to the contributor, either directly or through an intermediate payment processor.   Any excess MKR in the Auditors Wallet or the CU’s Permanent Team Operational Wallet will be returned to the protocol, following the monthly payment transactions.  This payment implementation makes no assumptions about the origin of the MKR. It can either be moved from the protocol’s treasury, newly minted, or obtained from another source. The MKR that’s held by the Auditors Wallet and the CU’s Permanent Team Operational Wallet will not be used for voting or any other type of governance participation. It will remain in the wallets untouched until it moves to the next step in the process. The CU may consider alternative payment flows compliant with DssVest if the standardized flow is compatible with the vesting schedule and that the risk is deemed acceptable by the team.  Related Documents  MIP39c2-SP25: Adding Sidestream Auction Services Core Unit - SAS-001 MIP40c3-SP43: Adding Sidestream Auction Services Core Unit Budget - SAS-001 MIP41c4-SP26: Sidestream Auction Services Facilitator Onboarding - SAS-001  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp17-sustainable-ecosystem-scaling-core-unit-mkr-budget-ses-001/8043",
                        "https://github.com/makerdao-sas/transparency-reporting/tree/main/Monthly%20Budget%20Statements",
                        "https://forum.makerdao.com/t/mip-54-dssvest/8025",
                        "https://forum.makerdao.com/t/mip39c2-sp-adding-sidestream-auction-services-core-unit-sas-001/10796",
                        "https://forum.makerdao.com/t/mip40c3-sp-adding-sidestream-auction-services-core-unit-budget-sas-001/10799",
                        "https://forum.makerdao.com/t/mip41c4-sp26-sidestream-auction-services-facilitator-onboarding-sas-001/10797",
                        "https://forum.makerdao.com/t/mip40c3-sp43-adding-sidestream-auction-services-core-unit-budget-sas-001/10799",
                        "https://forum.makerdao.com/t/mip41c4-sp26-sidestream-auction-services-facilitator-onboarding-sas-001/10797",
                        "https://forum.makerdao.com/t/mip39c2-sp25-adding-sidestream-auction-services-core-unit-sas-001/10796",
                        "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-20-sidestream-auction-services/10959",
                        "https://forum.makerdao.com/t/mip40c3-sp95-modifying-sidestream-auction-services-core-unit-budget-sas-001/19737",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/3",
                        "https://forum.makerdao.com/t/mip40c3-sp85-modify-sidestream-auction-services-core-unit-budget-sas-001/18253"
                    ],
                    "GPT-summary": "The post is a proposal for adding the MKR Incentive Plan budget for SAS-001: Sidestream Auction Services Core Unit. The proposal includes details on the total MKR Expenditure Cap, Estimated MKR Expenditure, and Escrow Wallet mechanism. The post also provides information on the vesting schedule and payment implementation. The proposal has been accepted and ratified. The post does not contain entirely positive or negative feedback, but it does provide information for those who want to collaborate or ask questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.207927489177489
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#2",
                    "likes": "2",
                    "time": "11/11/2021-06:05:44",
                    "content": "    lukass:  The SAS Core Unit has been working under the incubation program of the SES since 21st June of 2021. The members of this core unit will take that as the start date for the vesting schedule.   Forgive me for the timing here but, shouldn’t your vesting begin when you start working for the protocol and not the incubation program? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#3",
                    "likes": "0",
                    "time": "12/11/2021-07:13:03",
                    "content": "I agree, core units should only start earning vested MKR once they have been voted in by the community. I think applying rewards retroactively creates a horrible precedent. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#4",
                    "likes": "8",
                    "time": "15/11/2021-22:00:45",
                    "content": "    twblack88:  Forgive me for the timing here but, shouldn’t your vesting begin when you start working for the protocol and not the incubation program?       Zarevok:  I agree, core units should only start earning vested MKR once they have been voted in by the community. I think applying rewards retroactively creates a horrible precedent.   Thanks for brining up these questions. MKR compensation remains one of the most tricky topics, not least of all because there is no consensus in the DAO on how to deal with them. In cases like the incubation program, the waters get even murkier and, honestly, it’s everyone’s guess what is supposed to be reasonable or not. I want to clarify the way we’re thinking about it at SES. And I want to confirm that the Sidestream Auction Services team has followed these recommendations without changes. The ultimate decision is up to Maker governance, but I want to make sure we’re considering the full picture here. Apologies for the wall of text, but I want to provide all the relevant context. Our reasoning is as follows: A. What we probably agree on:   Without the incubation program, it’s near impossible for an external team without prior Maker experience to create a core unit from nothing. They need to commit at least 3 months between the point where they form the team and decide to go for it (at least one month), post the MIPs RFC (another month), and await the final executive vote (one more month.)   This is highly problematic because it means that the growth of MakerDAO’s foremost moat, its human capital, is severely handicapped and will no doubt lose out to other more competitive DAOs in the long term. Moreover, core units that minimize the time invested in preparatory work have a higher chance of failure, or often don’t follow best practices.    As such, we created the incubation program as a more attractive route for entirely new teams, for example Sidestream, as a powerful mechanism for entire teams to join the DAO and be set up for success in the long run.  B. What SES recommends to incubation teams: What is the deal we recommend teams pursue with the DAO? We want it to be a good deal for the DAO in that (1) it requires a clear commitment from the team so that we grow our moat of loyal DAO participants and (2) it delivers quality and results in a core unit that delivers real value and follows best practices. At the same time it needs to be balanced, that’s the point of the program. It should not be so risky that talented teams turn down the offer. In other words, it has to be reasonably close to other engagements that the team does not pursue, that is to compensate the opportunity cost. So we structure it as follows:   During the incubation program, the team will receive guidance and feedback from SES to help them identify a core unit scope (mission, vision, strategy, roadmap) that makes sense for MakerDAO, and we’ll support them only as long as they meet our quality criteria (following best practices.)   The team shows commitment by adhering to our standards and by working (for months on end) for a discounted rate (compared to other engagements) throughout the incubation program.   SES of course cannot guarantee that the core unit will be accepted by governance, so clearly there is a substantial risk that the core unit will never graduate from the program.   If the core unit fails either the SES filter, or the governance filter, that is the end of it, and this is a risk that the team should be willing to take if they want to join MakerDAO.   If the core unit graduates, this is seen as delivering a first milestone. It means they followed through on their commitment and worked through the entire program, hoping that they’ll get accepted in the end.   Now, because the MKR retention program is all about commitment, the vesting date is defined as the moment that the team committed to join Maker (while the DAO from its side only commits months later during the ratification polls.) This is no special rule for incubation teams, the same criterion is used for everyone (according to our model.) For the reasons mentioned above, we think that it indeed shows commitment to join a program for months while working on a relatively risky project for a discounted rate, while foregoing other opportunities. As such, it seems reasonable that the teams vesting date starts when they first joined the incubation program. This definitely makes the program a lot more attractive. But we want it to be attractive in order to stay ahead in the war for talent. C. Is this a good deal for the DAO? SES believes this is a reasonable deal and wants to defend it, because we highly value the capability of the DAO to onboard talent into the ecosystem. Once again, as long as the teams provide real value, this will grow MakerDAO’s moats and keeps us competitive in the long run. Think about it this way: how many talented teams do we want to risk foregoing the incubation program to join a DAO with a much lower barrier to entry, for the profit of saving a few months MKR vesting? Our assessment has been that it’s better to err on the side of onboarding more teams, definitely at the time when Sidestream joined. (I do however recognize that this equation may change over time.) Of course, this fits within a certain strategy and it may well be possible that MKR voters or delegates disagree with the strategy, or even just slightly want to tip the balance towards requiring more commitment for the same value. The next question then becomes whether it’s the right move to block this particular proposal, or if it’s better to change recommendations for future core units? If the DAO wants to avoid adding unnecessary risk for new joiners (by turning one down that followed recommendations), the latter may be the better approach. D. Closing points   One more thing to keep in mind is that the Sidestream Auction Services core unit has already produced real tangible value. They demoed this on the G&R call last week. This is one of the expectations that we have for core units that join the program: they need to hit the ground running, as we put it.   It’s also useful to take the changing landscape of the DAO into consideration. Today we have multiple core units up and running. New teams who are at the beginning of their journey at least see that many have preceded them. Back when Sidestream joined the incubation program, things were a lot more uncertain. This is one argument for tightening the rules in the future rather than turning down CUs that already went through the program.   Lastly, a clarification to address the (slightly unrelated) point that PaperImperium has been making elsewhere: the MKR retention bonus is very explicitly tied to the commitments of individuals, not teams. If one Sidestream team member leaves the core unit and another joins, the MKR vesting resets for the new member. We’re very explicitly renting long-term brain space here because it’s the experienced Maker contributors that deliver the greatest value. It’s most definitely not a team performance bonus.   ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-167-thursday-november-11-17-00-utc/11588/3",
                        "https://forum.makerdao.com/t/ultraschuppi-delegate-platform/11193/10"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.840022718328504
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#5",
                    "likes": "1",
                    "time": "15/11/2021-22:42:09",
                    "content": "@wouter First off, thank you for writing such a detailed response. You have actually changed my opinion. I look forward to seeing this proposal go through the formal governance process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#6",
                    "likes": "2",
                    "time": "16/11/2021-17:26:05",
                    "content": "Thanks for your thoughtful and detailed response Wouter, as always.     wouter:  The next question then becomes whether it’s the right move to block this particular proposal, or if it’s better to change recommendations for future core units? If the DAO wants to avoid adding unnecessary risk for new joiners (by turning one down that followed recommendations), the latter may be the better approach.   FWIW, this is the crux for me. Avoiding precedence that there is any favoring. Also, I didn’t intend to block, was just running down the budget and got curious to see why. sorry @danik if I added any stress! Maybe we can suggest that the vesting is bumped upon acceptance into working for the protocol? Sort of a bonus multiple? So an aggressive first year or shorter cliff when folks are hitting the ground running through incubation might work. That might also lead to more strong candidates entering the program as well which helps SES source new teams. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.607347828938738
                },
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#7",
                    "likes": "0",
                    "time": "22/06/2022-05:10:39",
                    "content": "Triggering the Manual Repricing according to MIP.  Parameters after Repricing     Parameter Value     MKR/USD lock-in Price MKR = $1823.30   MKR Price Floor -30%   Vesting Period 2 years   Cliff Vest 12 months   Vesting Schedule After cliff has expired, biannual MKR amount   Vesting Interval 6 months   Manual Repricing yes   Auto-Renewal yes     Permanent Team Forecast after Repricing     Date Amount MKR     December 21, 2022 0   June 21, 2023 348.28   December 21, 2023 174.14   June 21, 2024 174.14   Total 696.56    This covers the total vesting schedule of 3 years for the current 3.5 FTEs. On average, this yields 99.5086 MKR per FTE per year. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#8",
                    "likes": "2",
                    "time": "22/06/2022-15:44:38",
                    "content": "@MIP-Editors think it would be good to get this added to the SAS MKR Budget MIP as an addendum so people can see the new numbers. Might also be good to hear from auditors that the calculation was preformed correctly @SES-Core-Unit . ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party extending to proposal",
                        "None"
                    ],
                    "Sentiment": 7.5606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#9",
                    "likes": "0",
                    "time": "14/07/2022-02:44:43",
                    "content": "Can @sidestream-core-unit provide some updates on how many users have participated in auctions from their interface? Also, how many months do you need to complete work? Please also clarify whether there is any underlying smart contract work on auction mechanics or if this CU only works on the UI? Thank you in advance ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.314285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#10",
                    "likes": "3",
                    "time": "14/07/2022-07:54:58",
                    "content": "Hello Ippy, Thank you for your interest in our work. Regarding usage data, we received a similar request in our Discord channel and we are already preparing some stats for our next sprint release notes (this week). Regarding the scope of our work, saying that we ‘only work on the UI’ is an understatement: We currently actively develop, maintain and operate 3 products for the DAO: Unified Auctions UI, Auction Keeper, Auction Twitter bot. Those are complex software products with many moving parts that all need to work well on scale (→ on liquidation days). Given that Maker keeps developing their products (onboard new collaterals, L2s etc.), I don’t believe we can reach a stage of ‘work complete’ (IMO this is in general not what to expect for actively maintained software). To add a bit more context: We completed the majority of products and features that were obvious at the inception of our CU and some additional features. As we serve different ‘user’ groups (e.g. various types of auction participants, other software engineering core units), there is a long list of new features that are under consideration. While we don’t actively develop new smart contracts today, we are working very deeply with the existing contracts that are related to our mandate, meaning we can expand vertically even further into that part once required. I understand that the cost tag might seem quite high in the current market conditions. But I strongly believe that the code we write every day will justify the expenses in the long term. After going through a steep Maker-mechanics-specific learning curve in the beginning, I believe our small CU is running on a good velocity to keep shipping throughout the bear market and beyond  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.331798140131474
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip39c2-sp25-adding-sidestream-auction-services-core-unit-sas-001/10796",
            "title": "MIP39c2-SP25: Adding Sidestream Auction Services Core Unit - SAS-001 ",
            "index": 10796,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "6",
                    "time": "06/10/2021-14:08:53",
                    "content": " MIP39c2-SP25: Adding Sidestream Auction Services Core Unit - SAS-001  Preamble MIP39c2-SP#: 25 Author(s): @danik Contributors: @BracketJohn , @lukass , @builderman, @wouter, @juan, @Petru_Catana, @lollike, @Njoku_Emmanuel Tags: core-unit, cu-sas-001, mandate Status: Accepted Date Applied: 2021-10-06 Date Ratified: 2021-11-22   Sentence Summary MIP39c2-SP25 adds SAS-001: Sidestream Auction Services Core Unit.  Specification  Motivation Liquidations and auctions are important security mechanisms to keep the Maker protocol free of debt. A healthy auction ecosystem helps to operate the protocol sustainably and therefore increases trust. Besides, a healthy auction ecosystem helps with better outcomes for vault owners in cases of liquidations, which can increase user satisfaction. These factors are the motivation for having a dedicated Auction Services Core Unit.  Core Unit ID SAS-001  Core Unit Name Sidestream Auction Services  Core Unit Mandate  Mission Improve security, transparency and accessibility of the Maker Protocol by providing and maintaining auction services through open-source development.  Vision To provide and maintain systems on top of the auction mechanism that contribute to security and growth of the Maker Protocol. Those systems:  Visualize auction data to increase transparency and generate insights  Provide intuitive UIs and well-maintained APIs for interaction with the auction mechanism (to increase accessibility and adoption) Help ensure that there is always sufficient auction participation, even in extreme circumstances such as  Protocol upgrades (e.g. new collateral types) Inefficient market conditions     Strategy Sidestream Auction Services CU’s strategy is centered around solving the anticipated challenges of the selected problem space in order to execute the mission and vision. The following describes a selection of anticipated challenges. Afterwards, we discuss different aspects of the strategy that pave the way to overcome those challenges.  Anticipated Challenges  1246×738 107 KB  1. Fail-Safety As Black Thursday has shown, it is necessary that the auctions system is extremely fail-safe. Therefore,  We have to understand the consequences of auction mechanisms failure and how to mitigate them We have to ensure that our solutions work in emergencies We have to create trust that our solutions are fail-safe  2. Informed Decision-Making Currently, it is hard to make data-driven decisions regarding auctions and liquidations. This needs to change in the long term. For that, governance needs to know how auctions and liquidations are performing. (First attempt to empirically evaluate auctions and liquidations performance.) Things governance needs to know:  Is participation healthy? How many people are using the UIs, and how is usage changing over time? How healthy is the current keeper ecosystem?  3. Prioritization As we are not building a closed system, we have ensured that our efforts and choices are integrated into the big picture of the protocol. Therefore, we need to answer the following questions:  How do we ensure that we build the right things in the right order? How do we ensure that we don’t block other core units while following the defined mission? How do we balance long-term plans of our roadmap vs. new requirements in a fast-changing environment (e.g. onboarding of new collateral types)?  4. Intricacies of Emergency Infrastructure: A part of this CU’s problem space (e.g. “ensuring an efficient keeper ecosystem\") is hopefully never needed, but if needed it needs to work flawlessly. The emergency aspects lead to the following challenges:  How do we maximize the likelihood that fire escapes work in case of a real fire? How do we consistently keep the quality high? Unexpected failures can have a tremendous negative impact on the protocol itself. How do we ensure that the auctions infrastructure scales with the rest of the protocol (e.g. more users and more liquidations, new collateral types)?  5. Building For A Heterogeneous User Base: The auction mechanism is used by a heterogeneous user base of 1. technical and non-technical, 2. experienced and new, 3. protocol interest aligned and unaligned users, leading to the following challenges:  How do we ensure that the auction mechanism is accessible for new users? How do we ensure that the auction mechanism stays relevant for existing users? How do we measure the accessibility of the auctions mechanism?   Strategies to overcome the challenges The team has worked out a number of mitigation strategies for the anticipated challenges, grounded in solid software development and product management principles. The team has worked together for several years and rigorously refined its practices. 1. Simulation of Failure Modes The following strategies help us to overcome the challenges when building tools for emergency scenarios:   Modelling the risks: During the incubation program, we have become familiar with different failure modes that are related to the auctions mechanism (e.g. DAI to USD peg lost, protocol accumulates more debt than it can cover). Detailed theoretical knowledge of risks and solutions ensures that we build the right emergency solutions.  Conducting regular fire drills: Fire drills shall increase the likelihood that our solutions mitigate the risks and that our implementations are flawless. Therefore, we will simulate different emergency scenarios (e.g. inefficient market conditions, market crashes) and test edge cases (e.g. transactions with a loss, vaults that are immediately liquidated) to remove any unknowns and have the closest guarantee that our solutions work as intended under those extreme conditions.  Providing transparency on emergency prevention: We will document, record, and publish all thoughts, models, and simulations on failure modes. This will ensure that all stakeholders are informed about the auction mechanism’s state of security. Therefore, the community’s trust and our core unit’s accountability to the community are maximized.  2. Emphasis on Product Management A number of the challenges that we identified can be mitigated by ensuring that the team is following solid product management practices. Three elements we want to highlight:   Leverage our learning curve: We can leverage our learning curve, as we are quite new to the Maker system. In the beginning, we will prioritize being a community-informed core unit. Over time, we will rely more on our expertise while still keep gathering input from the community. An edge that we leverage in the beginning is our outsider perspective: While learning about Maker and the auctions mechanisms, we thoroughly documented our struggles and started to build applications that are more accessible to outsiders.  Involve a wide range of stakeholders for requirements gathering: We will dedicate a significant amount of time to gather the requirements of all stakeholders. That’s important as auctions are relevant for several core units (e.g. smart contracts CU, oracles CU and testing infrastructure CU) and different types of community members (e.g. keepers, developers, liquidity providers). Once we have established better monitoring and visualization tools, we hope to become more data-driven in our decision-making. We will also advocate for our opinion when other core units make relevant decisions.  Agile Practice: We will execute in bi-weekly sprints and release cycles. Mostly we will follow the roadmap, still the agility ensures that we can easily adjust our execution when circumstances change. Every sprint ends with a screen-recording of the implementations that is publicly accessible.  3. Review- and Metric-Driven Development Process Many of the challenges centre around ensuring maximum possible implementation quality, which we will ensure through our rigorous development process   Functional reviews: Functional reviews are done early in the implementation process already - modular development and tools (e.g. Storybook) help to ensure that the desired functionality and UX of every developed component are in place.  Code reviews: No code is merged before receiving at least one thorough code review, transparent to everyone inside the pull request.  Quality metrics: To ensure that the development is objectively good, we will have metrics in place that track relevant facets (e.g. deviations from release dates, time till new collateral type was integrated, test coverage).  4. Shorten Time-to-Market through Automation and Standardization While our development process focuses on quality, we will still ensure that our execution speed keeps up with the fast-changing environment through automation and standardization.   Development Automation: We use continuous integration (CI) and continuous deployment (CD) pipelines that run on every commit and are integrated into our code review process. This ensures that we don’t merge any broken code and increase reproducibility.  Modularity: Our product management and development is very modular to ensure that as much as possible can be reused. Especially features that are often extended will be developed in that way (e.g. onboarding of new collateral types).  Standard Operating Procedures (SOPs): To increase efficiency and accessibility, we work with SOPs, guides, and checklists as much as possible. There will be SOPs on different abstraction levels, for technical and non-technical processes (e.g. Scaffolds for new projects, how to submit a Pull Request, Steps to onboard a new collateral type).  5. Transparency and Reporting To maximize trust inside the DAO we will have a high emphasis on making all our actions and deliverables as transparent as possible.   Open-source software: All software that we develop for the auction mechanism is open-source. This shall lead to more trust among all stakeholders, easier contribution, and better accessibility for technical users.  Monitoring systems: We will build systems to monitor auctions and our solutions (e.g. data visualizations of current and past auctions, GitHub Status like system for our solutions) to increase trust and to help to derive conclusions on the overall auction system’s performance and health and to inform future developments.  Technical Reporting: To increase accessibility to our work, we will document all discussions and decisions in our web presence, Core Unit Twitter account, a public Notion space, and our GitHub repositories (README, Kanban board, and Issues).   Team The team is composed of 5 permanent members (3.5 FTE)  1 Facilitator (Daniel - 0.5 FTE) 1 Designer & Product Manager (Lukas - 1 FTE) 3 Full-stack Software Engineers (incl. DevOps) (Valentin - 1 FTE, Nils - 0.5 FTE, Ben - 0.5 FTE)  The team has completed a variety of end-to-end software development projects including specifications, design, frontend, backend and infrastructure. The team consists of the founders and core team of the software development agency SIDESTREAM that is known for high-quality software development. You can find our portfolio here. The core unit will be a separate business unit of the company.  Work in Progress Since joining the SES Incubation Program in June 2021, the team has already been working to deliver value to the community. We hope to hit the ground running as a new core unit and are looking to have a first release around the time our MIP is formally submitted. The first release is a MVP of a new, unified Auctions UI. The MVP enables participation in flip auctions.  You can find the release here. The code is Open Source and can be found here.  The core features of the MVP are explained below: One-click arbitrage through flash lending: It is the first UI in the Maker ecosystem that leverages flash lending of collateral. This means a user can engage in one-click arbitrage opportunities without the need for any DAI funds. With this new possibility, a higher number of keepers can participate in flip auctions, which leads to increased security of the Maker Protocol in case of inefficient market conditions and a high number of liquidations. In the case of inefficient programmatic keepers, the UI can also be seen as a backstop solution. Two Interaction modes for different user groups: Following our mission to increase the accessibility and trust of auction services, we built two interaction modes for the UI. A narrative-based approach explains the functionalities and the usage of the UI to inexperienced users and leads them through the whole auction participation process from start to end. For experienced users, we built an expert mode that disables the explanations and shows only the most relevant information. It is possible to switch between those two interaction modes anytime.  Future Enhancements/Roadmap/Next Steps In our next steps, we continue to take over and adjust auctions-related tools and services that require a permanent owner in the post-foundation area. Unified Auctions User Interface The goal is to unify monitoring and participation in different types of auctions in a unified User Interface.  For the monitoring part of the UI, there will be overviews of vaults at risk of a liquidation, overviews of active auctions and data about past auctions and their participation. The participation part of the Unified UI shall be fully based on liquidations 2.0 (inc. Flash Lending functionality for all auction types). As some auction types weren’t migrated to liquidations 2.0 yet, there will be temporary solutions for the time being. The functionality around auctions shall be further extended, e.g., with limits, notifications and Twitter Bots.  Keepers Next to the user interfaces, we are planning to take over, maintain and run all auction-related keepers. Currently, capital is required for pre-liquidations 2.0 keepers, so running will be possible after migration. Support New Protocol Upgrades We will adjust auction services to follow protocol engineering’s efforts to scale the reach of Maker. For example, this includes onboarding new collateral type and extension to L2s in the future.  Related Documents  MIP40c3-SP43: Adding Sidestream Auction Services Core Unit Budget - SAS-001 MIP40c3-SP44: Adding Sidestream Auction Services Core Unit MKR Budget - SAS-001 MIP41c4-SP26: Sidestream Auction Services Facilitator Onboarding - SAS-001   Links  CU Website CU Presentation CU Launch Pod Session   Contact Reply below with any questions or comments or contact danielkr#9058 directly on the SES Discord ",
                    "links": [
                        "https://sidestream.tech/",
                        "https://www.sidestream.tech/en/reference-projects-software-development",
                        "https://auctions.makerdao.network/",
                        "https://github.com/sidestream-tech/unified-auctions-ui",
                        "https://forum.makerdao.com/t/mip40c3-sp-adding-sidestream-auction-services-core-unit-budget-sas-001/10799",
                        "https://forum.makerdao.com/t/mip40c3-sp-adding-sidestream-auction-services-core-unit-mkr-budget-sas-001/10802",
                        "https://forum.makerdao.com/t/mip41c4-sp-sidestream-auction-services-facilitator-onboarding-sas-001/10797",
                        "https://sidestream.tech/maker-dao",
                        "https://drive.google.com/file/d/16TKUTpuzUnT06P0nvnm2Z9bgvkum6ftF/view?usp=sharing",
                        "https://www.youtube.com/watch?v=kho5870UY2E&ab_channel=MakerDAO",
                        "https://discord.gg/ZuSWPACGV4",
                        "https://forum.makerdao.com/t/mip40c3-sp43-adding-sidestream-auction-services-core-unit-budget-sas-001/10799",
                        "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-20-sidestream-auction-services/10959",
                        "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-20-sidestream-auction-services/10959/5",
                        "https://forum.makerdao.com/t/ses-updates-11-11-2021/11594",
                        "https://forum.makerdao.com/t/maker-relay-ep-70-en-espanol/11569",
                        "https://forum.makerdao.com/t/mip40c3-sp95-modifying-sidestream-auction-services-core-unit-budget-sas-001/19737",
                        "https://forum.makerdao.com/t/mip40c3-sp85-modify-sidestream-auction-services-core-unit-budget-sas-001/18253",
                        "https://forum.makerdao.com/t/maker-relay-ep-70/11528",
                        "https://forum.makerdao.com/t/ses-updates-04-11-2021/11447",
                        "https://forum.makerdao.com/t/ses-updates-28-10-2021/11264",
                        "https://forum.makerdao.com/t/mip41c4-sp26-sidestream-auction-services-facilitator-onboarding-sas-001/10797",
                        "https://forum.makerdao.com/t/ses-updates-7-10-2021/10832",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/35",
                        "https://forum.makerdao.com/t/sas-001-incubation-recap-milestones-and-key-learnings/11917",
                        "https://forum.makerdao.com/t/maker-governance-review-november-2021/12000",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/ultraschuppi-delegate-platform/11193/10",
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/under-construction/12274/15"
                    ],
                    "GPT-summary": "The post is a proposal for the addition of a new core unit, SAS-001, which will provide and maintain auction services for the Maker Protocol. The proposal explains the motivation, mission, vision, and strategy of the core unit, as well as the anticipated challenges and strategies to overcome them. The post also provides information about the team, their work in progress, future enhancements, and related documents. \n\nNote: None of the topics listed match perfectly, but the closest matches have been provided.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.687633336162748
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "06/10/2021-21:54:57",
                    "content": "    danik:  Support New Protocol Upgrades We will adjust auction services to follow protocol engineering’s efforts to scale the reach of Maker. For example, this includes onboarding new collateral type and extension to L2s in the future.   Personally I would also like to see an upgrade to tools via an IPFS based front-end and how Maker can have decentralized storage via a front-end that lives on a decentralized cloud. Do you see this CU eventually supporting such and guiding CUs on how the protocol can scale via IPFS tools? Hopefully my question makes sense  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.4356060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "2",
                    "time": "06/10/2021-21:57:56",
                    "content": "BTW do you plan on exploring how Bridges will connect to each other and how Maker/DAI can benefit from such? (if i was a betting man, I’d bet that bridges will be the talk of DeFi in 2022) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#4",
                    "likes": "2",
                    "time": "06/10/2021-22:00:16",
                    "content": "    flipflopflapdelegate:  IPFS   And don’t forget about the up-and-coming Swarm project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BracketJohn",
                    "index": "#5",
                    "likes": "1",
                    "time": "07/10/2021-16:23:24",
                    "content": "@BracketJohn here from sidestream Auction Services CU. So, IPFS is a super interesting technology and I can see that in the long run it could be the solution to an internet that is truly independent of any hoster, node availability, … Right now we’re going to go with current, more “established” technologies (that we also know better!) to run our services and focus on the goal of our CU: Improving the security, transparency and accessibility of the Maker Protocol with a focus on auction services. Along the way we’ll learn a lot and I believe, at some point, may have the opportunity to switch stack to decentralized storage. As our goal is to supply mission critical services, we’ll evaluate this well and then make a switch once we can ensure that our goal is not hindered by that switch. All the knowledge gained in the process (whether using centralized or decentralized storage tech) will be shared with all other CUs and extended even just other devs for that matter: After all the goal also includes accessibility. Does that make sense? As for bridges: If you ask me personally, I’d probably also be willing to take the bet (; I’ll redirect to @danik to see if they have anything to add to that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.819302721088436
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BracketJohn",
                    "index": "#6",
                    "likes": "0",
                    "time": "07/10/2021-16:25:37",
                    "content": "Looks super interesting! Related to that: Cloudflare as a centralized player has recently also moved more in this space, see https://blog.cloudflare.com/announcing-web3-gateways/. Very good to see some central players push these topics. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving positive feedback on proposal",
                        "3rd party providing related information to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.691666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "1",
                    "time": "08/10/2021-03:49:15",
                    "content": "    BracketJohn:  Does that make sense?   Understood. It’s just that most of the DeFi application that we see/use have some centralized back-end behind them. They’re running on AWS, sometimes on dedicated servers or stuff like that—you know—it is still centralized. If a government agency wants to shut down a DeFi protocol that is organized like that, they can, right. But for sure, finding/discovering/building a storage mechanism, that guarantees consistency and is decentralized—is half-the-battle.  Thank you for your reply. I hope your CU keeps these things in mind. Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.879298941798941
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#8",
                    "likes": "2",
                    "time": "08/10/2021-04:41:47",
                    "content": "That’s actually the main reason why the mission states:     danik:  through open-source development.   Decentralization of the infrastructure is definitely needed, but centralized infrastructure is quickly remedied as long as the software is open-source, well-documented and easy to set up. If that’s the case for a frontend, and it typically is, it’s a matter of deploying on IPFS and done. Backend infra can easily be spun up with a different hosting provider, or indeed dedicated hosting, in a different jurisdiction… if the setup isn’t too involved, which is usually no issue. The one exception may be backend infra for indexing data from the blockchain. That is quite involved. If the Sidestream CU uses the Graph as operational data provider, that part too is decentralized. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.579545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#9",
                    "likes": "1",
                    "time": "08/10/2021-05:53:57",
                    "content": "+1 for importance of bridges. I think we’ll eventually cover at least auction-related aspects for that. But bridges will be a big topic by itself, so I can imagine a dedicated CU to emerge. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.25
                }
            ]
        }
    ],
    "group_index": "179"
}