{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/seeking-opinions-financing-invoice-financing-via-a-fund/20081",
            "title": "Seeking Opinions: Financing Invoice Financing via a Fund ",
            "index": 20081,
            "category": [
                "Core Units",
                "Strategic Finance"
            ],
            "tags": [
                "summary",
                "public-call",
                "rwf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Kvman",
                    "index": "#1",
                    "likes": "1",
                    "time": "08/03/2023-07:29:31",
                    "content": "Hi Everyone, I have been scanning the various investments the communities have discussed in regards to Financial Instruments. Overall I found it being positive, with good diligence in regards to Expenses and possible conflict of interest. I wanted to garner the communities position in making proposals for DAI Financing for established Invoice Financing/Factoring. The concept being: Financing is collateralized by business invoices (in well established legal frameworks per country) and local legal agreements. (Invoice Financing] This is a highly established industry globally, and returns can range from 1 to 2.5% per month (12% - 30% p.a) I believe the community can generate stable and consistent returns in this manner, by diversifying away from purely digital collateralization but rather traditional or real-world assets. Would love to hear folks opinion on this. (Concept deploy via established invoice financiers and having MakerDAO as a limited partner) ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6768262987012985
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kvman",
                    "index": "#2",
                    "likes": "0",
                    "time": "14/03/2023-08:11:31",
                    "content": "Hi Community, I havent seen much interactions here yet, so curious to know if this is an area of interest? If there are queries on how the interest would calculated I jot down some thoughts here: Example: Singapore business, in this case a freight forwarder, seeking 30,000USD to cover the GST and tariffs they are paying on behalf of the importer (to be collected 30 or 60days after goods arrival). If we partner up with a financier who provides these loans, the MakeCommunity or we issue DAI to cover up to 80% of this at 1.5% per month. When the Freight Forwarder repays after recieving payment from the client, the DAI is repayed back and burned. Example: SG Biz - $30,000 USD required Financing partner: Scores and structure short-term loan contract Maker: $24,000 DAI is minted for the loan Interest: 1.5% per month (or 18% p.a.) Term: 60days Interest Gained: $720USD Financing Partner Fees: 2% p.a Fees Finance partner receives: $80 Maker Earning: $720 minus $80 = $640 USD  In this example the financing partner takes a 2%p.a. on the deployed capital. This amount will vary depending on the partner and negotiation, but the concept remains similar. Of course, with what I am advocating, we can try to negotiate that the financier takes ALL liability of the initial capital deployment, to reduce our downside risk. (ie guarantee the $24,000USD in this case). Would love to hear the communities thoughts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.215277777777779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "0",
                    "time": "14/03/2023-09:56:16",
                    "content": "Considering the current path the Maker protocol is approaching, such risky assets don’t seem like of interest to the protocol. Currently, money market funds and US treasury bonds is where the protocol wants to focus on ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hajive",
                    "index": "#4",
                    "likes": "1",
                    "time": "14/03/2023-23:05:54",
                    "content": "Hi @Kvman , This is a market segment that we do actually have some experience with via the Tinlake ConsolFreight Pool and you might find this pilot transaction we did last year, where we integrated Maker funding with the MasterCard Provenance solution, interesting   twitter.com    Maker @MakerDAO  A Maker Vault was used to finance a shipment of Australian Beef from Brisbane to Hong Kong.  On top of that, the entire operation is currently being tracked using @Mastercard Provenance, a blockchain traceability solution.  This is how it was possible  👇🧵   9:57 PM - 10 May 2022           290                71            The size of the market opportunity is clear and our original plan was to scale things following this pilot transaction, with an ambition to position Maker & DAI to transform supply chain operations by providing easier access to alternative sources of capital, 24/7 global availability, faster approvals for financing, and blockchain traceability. However in a case of unfortunate timing we concluded the pilot just as Luna/UST imploded - and the resulting scrutiny on the regulatory status of DeFi markets & stablecoins meant we put plans on hold ! As Doo says, think still too early to revisit - but hopefully that time does come soon ! ",
                    "links": [
                        "https://twitter.com/MakerDAO/status/1524146761752891392?s=20",
                        "https://twitter.com/MakerDAO/status/1524146761752891392?s=20",
                        "https://twitter.com/MakerDAO/status/1524146761752891392?s=20",
                        "https://twitter.com/Mastercard",
                        "https://twitter.com/MakerDAO/status/1524146761752891392?s=20"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.348214285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kvman",
                    "index": "#5",
                    "likes": "0",
                    "time": "18/03/2023-16:29:39",
                    "content": "In short, the direction is a lower risk profile of returns. My thoughts were, if we can negotiate a guarantee on the initial capital (not on returns) with the right legal contract the return premium could be worth it? We are not discussing excessive risk loans out, but for example we can tier it to  Small SME Loans in easy to chase jurisdictions (example Directors or Personal Guarantees by verified directors, from solid companies, say in Singapore) - Side note there are public accessible records on directors bad debts/companies outstanding loans etc in Singapore Financing Invoice Factoring for SME or businesses that sells to large corporations (Above 30million SGD annually), where the risk is mitigated as the factoring only comes through if the Large MNC buyer agrees to assign the payments  The thought process is, if we can find altnerative slightly higher yield returns in a pretty low-risk manner, could this be something the protocol is open to if not in the short-run (considering SBV etc etc) but medium term prior to a nice market trend? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5266563146997925
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kvman",
                    "index": "#6",
                    "likes": "0",
                    "time": "18/03/2023-16:31:39",
                    "content": "Yeah market turmoil is not great now, but would love to see if we can start exploring this in advance? The need for loans/financing/factoring will be higher during these conditions now, while returns can be decent 10%-24%p.a. on short-term financing, I’d be curious if we should start talking to some of these Invoice Factoring firms/platforms and see if they are open to our capital and negotiate ways to mitigate our risk ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.347222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#7",
                    "likes": "0",
                    "time": "19/03/2023-18:20:56",
                    "content": "    Kvman:  My thoughts were, if we can negotiate a guarantee on the initial capital (not on returns) with the right legal contract the return premium could be worth it? We are not discussing excessive risk loans out, but for example we can tier it to   It’s oxymoron to have guarantee on the initial capital and have high return. It really shouldn’t be on Maker’s focus ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5598214285714285
                }
            ]
        }
    ]
}