{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ruble-gold-standard/15758",
            "title": "\"Ruble gold standard\" ",
            "index": 15758,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "gold",
                "ruble"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#1",
                    "likes": "3",
                    "time": "13/06/2022-06:18:24",
                    "content": " Russia returning to the Bretton Woods agreement? The Russian government has used virtually every means at its disposal to strengthen its currency amid a supply chain, energy, food, and financial crisis. In March it was confirmed that the Ruble is pegged to the gold standard, (5000 RUB = 1 gram of gold), yet another reason why it is necessary to have a DaiRUB pegged to the RUB, which spreads the risk a little more, instead of putting all the eggs in one basket which we know is the reference and most used, but the economy is moving elsewhere, changes to which we must adapt as soon as possible, as the Achilles heel of the Dollar is becoming more visible and vulnerable. It may also be the case that what Russia is doing with its national currency cannot be sustained in the long term as some think, but whatever happens in the future the best option will always be the diversification of Dai pegs, the cons are that it would be more difficult to keep pace with what is happening with the different pegs, and would entail more costs for the current system, but also this could increase adoption in countries where there are problems with the banking systems in terms of limits on the amount or limited time for the use of money, CBDCs are intended to be efficient transactionally but with restrictive limits to the citizens.  RUB - USD1585×863 79.7 KB  ",
                    "links": [
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-09-15-de-junio-de-2022/15954"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.724064625850341
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Khan",
                    "index": "#2",
                    "likes": "1",
                    "time": "13/06/2022-15:36:52",
                    "content": "What is the tangible demand for Ruble pegged Dai? Or Dai pegged to any other currency for that matter? If you’re staying crypto-native, pegged to the current universal unit of account seems useful and user facing concerns can be accounted for via front-end localization (e.g. denominate assets in Ruble’s worth of Dai). If you’re going into domestic or tradfi networks, then the crypto asset doesn’t truly matter as you’re exchanging out anyways and the dollar peg is probably most useful again. The Russian central banks approach is certainly interesting, but I think we’re far from the economy moving elsewhere just yet. Even if it is, it’ll be a slow move in any direction. When it comes to CBDCs, the only interesting narrative worth watching is the projects based in Asia. Although the Yuan is far from internationalizing just yet, the sheer volume of economic activity with mainland China makes for compelling interest in cross-border conversations. Worth noting that outside of the eCNY there is this project in which the PBOC is a primary participant and this project being led out of Singapore. I personally wouldn’t bet on a single CBDC project ever making it to the light of day in time, except for the work that the People’s Bank of China is involved with. They’ve got the right mix of desire + capability to make some interesting things happen… ",
                    "links": [
                        "https://www.bis.org/about/bisih/topics/cbdc/dunbar.htm"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.855229591836735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#3",
                    "likes": "6",
                    "time": "13/06/2022-16:45:54",
                    "content": "Just some data to consider: Here a recent poll among central bankers:  image700×300 24.6 KB  Quote from one poll participant:  It’s not about absolute security. It’s about the relations between selected currencies. And measured by relative value, USD is still the largest economy in terms of taxes generation, it is the most technological economy (the largest global technology companies are from the US), it has the biggest financial market, the most transparent regulation and the longest tradition.   A chart of the composition of official foreign currency reserves since 2000 showing that the dollar continues to play the role of the world&#39;s reserve currency, with over 50% of the global total700×500 60.8 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#4",
                    "likes": "1",
                    "time": "17/06/2022-02:53:17",
                    "content": "The problem is that currently with this recession situation will cause less taxes to be collected and cats will go up in how much to import especially energy and other things, in short it seems not enough taxes and other revenues to cover expenses and save this economy, so probably save it at the expense of the usd. What gives the value to usd is the US ministry of defense practically, not counting the adverse effects. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.864583333333333
                }
            ]
        }
    ]
}