{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/nuts-bolts-alignment-of-interests-junior-senior-capital/12613",
            "title": "NUTS & BOLTS: Alignment of Interests & Junior/Senior Capital ",
            "index": 12613,
            "category": [
                "Governance"
            ],
            "tags": [
                "discussion",
                "rwa",
                "monetalis"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#1",
                    "likes": "2",
                    "time": "13/01/2022-15:57:32",
                    "content": " Capital Structure Choices I want to offer up some added colour on thinking about alignment of interest and capital. Maker desires extremely low risk real-world assets, which, I think, we have by now all, in the community generally translated into looking for senior secure positions in various credit asset classes with exceptionally low loss history. But, as the ‘senior’ suggests, there is a question of junior/equity capital and where this should come from? We have a few options:   Professional Junior Capital funds: not a bad choice - they are usually fairly hard-nosed experienced credit operations and add value in evaluating the originator. Their terms can though, sometimes, be hard to swallow for the senior funding provider and the originator/underwriter of the end-borrower loan. Just as an example, at Monetalis we’d certainly favour this capital source (if the terms are right).   Equity by the Originator/Underwriter of the end-borrower loan - again not a bad choice - does put the underwriters hands on the hot-plate. But, it is important to understand that this choice comes with a material misalignment between senior funder and the underwriter, that ultimately means detailed, hardcore, monitoring is required by the senior funder to pull this off appropriately. Again, as an example, at Monetalis we are happy to use this source of capital, because this is exactly the type of heavy monitoring and control Monetalis engages in with our underwriters/originators.   Equity by the Entity that has an approved RWA Maker Vault. So, in the example of Monetalis that would mean we would be providing the junior capital (or at least a portion and leave a portion for the ultimate originators). However - just like in option 2 - this does produce a material misalignment that would require substantive oversight by Maker. In short, it would not be my favoured way of ensuring junior capital availability or alignment between this type of entity and Maker - there are better ways   Before we discuss ‘better ways’, let us just get the misalignment clear.  The Junior/Senior Misalignment When a credit portfolio is performing it doesn’t matter too much who provides what capital, as everybody’s happy. It is when the credit portfolio starts misbehaving that who provides what capital starts to matter and the misalignment of interests between junior vs senior capital starts expressing itself in potentially detrimental actions by the various capital parties. The first capital piece on the chopping block is Junior Capital, and so, when a deteriorating credit portfolio blow through any reserves and starts potentially eating into Junior/equity capital, you can image the party owning this equity/junior capital will start taking action - and action that often is not in the interest of the Senior capital provider. Perhaps you have heard the terms ‘extend & pretend’ or ‘delay & pray’? It is the commonplace short-form for the practice of banks to rather extend a non-performing loan and hope it recovers than crystallising a loss and taking a hit on their equity. Sometimes this practice ends well - as in the borrowers really did just need a bit more time to perform on their loans - but other times it can end horribly with large scale losses exacerbated by the delay in recognizing them. Because a bank includes all parts of the credit chain internally they could engage in “extend & pretend” to their heart’s content and the outside world would be none the wiser. Only robust regulatory reporting, monitoring and oversight curbs this - but only to a degree, because, for sure, there are banks that are “extending & pretending” today. So, as junior capital starts getting eaten away in a deteriorating portfolio, do you think the junior capital providers would prefer “extend & pretend” actions (and as such raising the risk of the portfolio markedly) or crystallising the losses of junior capital? And do you think this action would be in alignment with the senior capital provider? That, in essence, is the primary practical junior/senior misalignment we worry about.  Working with the misalignment So when, at Monetalis, we accept junior/equity capital from the underwriter/originator, we are somewhat in the same situation as you see with the banks - we need serious monitoring and controls in place to ensure no ‘extend and pretend’-type shenanigans is going on inside the originator/underwriter in an attempt to protect their junior/equity capital. That is absolutely fine - Monetalis (and other wholesale lenders) are specifically set up to deal with this misalignment (we control bank accounts, monitor payments, review individual loan applications etc - nigh impossible to do “extend and pretend” with us breathing down their necks). As you can imagine it is less of an issue when you have professional junior capital providers instead - in this case you don’t have capital and underwriting/servicing decisions integrated - and so even easier to control. That leaves us with the situation with an entity such as Monetalis provides the junior/equity capital ‘ahead’ of Maker Vault-based capital, in which case, Maker, would be the party worried about Monetalis engaging in “extend & pretend” actions to protect its junior/equity capital. In my opinion, Maker, by no means, is set up (nor probably should be) to be able to prevent or monitor for this. A better alignment mechanism should probably be sought. But, says the sceptic, whilst this misalignment exist, doesn’t it get outweighed by the motivation created by the junior capital exposure to get the credit giving right first time and not allow the portfolio to run into difficulties in the first place? Well, in my experience, with appropriate controls and monitoring to handle the equity/senior misalignment, at the originator/underwriter level where the end-borrower loan is made and the servicing happens, this ‘hand on the hot plate’ works well. In fact with Monetalis we would encourage this. But, the further back in the capital chain you move, with more differing alignments away from the ultimate end-borrow loans (junior vs senior), the more important it becomes to have direct, proportional alignment with the capital source - and not disproportional or indirect alignments from being directly aligned with the end-borrower lending position. For example: Professional junior capital funds will have managers co-investing personal capital (~1%) on the same terms as the fund investors - not large amounts (10%+) put up as “junior junior”/first-loss exposure to the junior capital. A side note to this, but also important to consider, is the implicit legal liability situation that a misaligned capital exposure generates: i.e. in the above example of the professional junior capital fund in a situation where the managers have a large first-loss exposure, should the fund start experiencing losses, it becomes a lot easier for the capital participants in the fund to argue for mismanagement on grounds of the fund manager having focused on saving their first-loss position, and as such have taken outsized risks on a deteriorating portfolio, rather than just focusing on saving the capital of the fund participants. And unfortunately, as I hope to have explained above, the capital participants might not even be wrong in their assessment. I hope that added a bit of food for thought on this important aspect of getting alignment structures for RWA right. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-relay-january-11-17-2022/12699"
                    ],
                    "GPT-summary": "The author discusses the misalignment of interests between junior and senior capital in credit portfolios and the potential risks associated with it. The author presents different options for junior capital sources and explains the need for appropriate monitoring and controls to prevent \"extend and pretend\" actions. The author also suggests seeking better alignment mechanisms and proportional alignment with the capital source.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.6556667538810395
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#2",
                    "likes": "3",
                    "time": "17/01/2022-16:04:43",
                    "content": "good topic. I have been thinking about this and from my perspective one of the best alignment mechanisms is having an asset manager with significant experience in their asset class and an associated track record and reputation. Historical performance of a manager is one of the best predictors of future performance. An establish asset manager’s reputation is very important (& valuable) to them as they need it to raise future funds. From my experience significant investment/subordination by the asset manager is important, too, particularly in private/illiquid investment funds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0621212121212125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#3",
                    "likes": "1",
                    "time": "17/01/2022-22:37:24",
                    "content": "Thanks for the detailed description @Allan_Pedersen, Although this topic isn’t new and has been widely researched and refined in the credit industry for the last decades, it might be new to some in the community. Your post eloquently describes some of the critical moral hazard happening along the lending stack. That is why, in reality, most investors go for a combination of the above, as no single one is sufficient. Having worked for a 40b+ investment office (Partners Capital) that heavily invested also in credit funds, I can testify that senior investors (being creditors or limited partners in a fund structure) implement a long shopping list to protect themselves. The Methodology just published by @Eumenes is a fantastic guide about how that could look like in the case for Maker. More specifically, senior credit investors are not necessarily fuzzy about the nomenclature “senior”, but rather want to transmit the fact that they are not interested in highly leveraged structures that offer higher returns but also higher risk. Typically, in the case of a mortgage for example, that seniority comes from the realisation value of the asset itself (i.e. the fact that the repossession value of the house is higher than the outstanding mortgage itself). Alternatively, those credit investors look for buffer capital along the stack, and not only in one place. That mitigates significantly the moral hazard you point to, e.g.:  The borrower doesn’t want to lose the asset because he or she has significant equity value outstanding (you don’t want to miss a payment and risk losing the equity in your house) The originator must be motivated by skin in the game to originate high quality stuff if their model is not that of keeping the loans on the balance sheet but rather to sell it to someone else The aggregator/ fund/ arranger must stay motivated significantly to do a good job for their investors to do a good job by having their economics tied to performance and co-investing a significant amount in the structure The aggregator/ fund/ arranger, in addition, must prove to have had proven performance history in comparison to the quantum raised, since the Limited Partners will by the nature of things always have more to lose than the General Partner, etc.  I believe that there is no single aspect that is more important than the others, but it is the combination of all of them that will need to be assessed by the teams involved in a risk assessment. A good balance will depend on the single assets financed. Lending, unfortunately, and most probably for a very long time ahead, will still be an art rather than a science. For this reason, also the proven track record of those who assess the applications is of paramount importance. We all trying to attract the best and most visionary talents in the industry within Maker and make this a reality. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.985979091830156
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "0",
                    "time": "18/01/2022-02:47:22",
                    "content": "Hey Allan, nice post–learning many things on how to think about capital structures–question? Might not be 100% related to the Junior/Snior misalignment–but with regards to assessing default risk for Junior/equity capital, would an Arranger be better suited to creating tranches based on a higher default risk? As an example, say there is a subordinated note of $100M and the default risk is 15%, should an Arranger/Agency create tranche notes into both a Junior & Senior tranche? And how would you determine how much  of the $100M pie is sliced into the Junior tranche? Would you do 10-90, 20-90 (Junior, Senior). Also, I was reading over the weekend about the increased popularity of “unitranche” financing–which if I understood correctly it mixes conventional loans with unsecured debt. What are your thought son such? Thanks in advanced! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.303571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "18/04/2022-02:48:04",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}