{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rwa-international-ltd-update/14478",
            "title": "RWA International Ltd. - Update ",
            "index": 14478,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "1",
                    "time": "06/04/2022-10:54:47",
                    "content": "Toward the end of 2021, the corporate service provider for RWA International Ltd was transferred from Crestbridge to Zedra. Corporate services providers are professional firms with seasoned staff (usually attorneys) in jurisdictions such as the Cayman Islands in this case that provide a corporate domicile as well as directors for an entity. This transfer was initiated by Crestbridge and Zedra agreed to accept the role of Director. Zedra is a world-class service provider and familiar with MakerDAO. Nothing material has changed with this transfer less the Director of record in the Cayman Islands. All interaction (e.g. flow of funds & custody of assets) with WSFS and RWA Senior Lending Trust remains unchanged. In addition to the above, starting in early January discussions started on acceptable mechanisms that could be put in place that would be acceptable to the Directors as to who could be in this optional administrative (non-decision making) role of an “authorized representative”. Further, this role could even be eliminated at this stage. They have agreed to only accept a new authorized representative as part of an established process (on their end) and that the person / entity  must ultimately have the “affirmative vote” of MakerDAO. The MakerDAO process will be included in my upcoming MIP that further outlines how this will work (or we could remove this role completely). For any specifics, please DM me. Thank you. ",
                    "links": [
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-march-2022/14712"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.311174242424243
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "06/07/2022-16:55:43",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}