{
    "poll_list": [
        {
            "title": "MIP9 Community Greenlight Poll - USDT (Tether USD ERC20) - July 20, 2020",
            "index": "3044",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "37,000",
            "highest_fraction": 0.95
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/usdt-mcd-collateral-onboarding-application/3044",
            "title": "[USDT] - MCD Collateral Onboarding Application ",
            "index": 3044,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "mips",
                "usdt"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/colekennelly",
                    "index": "#1",
                    "likes": "5",
                    "time": "03/07/2020-21:39:33",
                    "content": "Hello Maker community, This is my proposal to include Tether USD (USDT) as a collateral asset for MCD. Note: This proposal refers to the ERC-20 implementation of Tether USD.  1) Who is the interested party for this collateral application? Cole Kennelly (@ColeGotTweets)  2) Provide a brief high-level overview of the project, with a focus on the applying collateral token. USDT is a collateralized ERC-20 token that is pegged to the US Dollar. USDT is the largest stablecoin in the crypto ecosystem in terms of market capitalization and supply.  3) Provide a brief history of the project. The precursor to Tether, Realcoin, was announced in July 2014. The first Realcoin tokens were issued in October 2014 on the Bitcoin blockchain using the Omni Layer Protocol. In November 2014, the Realcoin project was renamed to Tether. USDT was deployed to the Ethereum network on November 28, 2017 and formally announced on January 5, 2018. Since launch, ~1.5 million unique addresses have made more than 40 million USDT transfers.  4) Link any available audits of the project. Both procedural and smart contract focused audits. OpenZeppelin Audit  5) Link to any active communities relating to your project. Twitter Blog Email  6) How is the applying collateral type currently used? USDT is used by businesses, such as exchanges, wallets, etc., to use US Dollars on the Ethereum blockchain. USDT is also used as a collateral asset by leading decentralized finance protocols and applications built on the Ethereum blockchain, such as Compound.  7) Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? Tether Holdings Limited bears responsibility for USDT. Tether Holdings Limited is a British Virgin Islands-based entity.  8) Where does exchange for the asset occur? Exchange of USDT occurs on approximately 100 different secondary exchanges including centralized exchanges such as Binance, OKEx, Bitfinex, Kraken, FTX, and KuCoin. The entire list of exchanges where USDT trades can be found here. Thank you, Cole Kennelly ",
                    "links": [
                        "https://blog.openzeppelin.com/tether-token-audit-438d561a380/",
                        "https://twitter.com/Tether_to",
                        "https://tether.to/category/announcements/",
                        "https://etherscan.io/token/0xdac17f958d2ee523a2206206994597c13d831ec7#tokenExchange",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/30",
                        "https://forum.makerdao.com/t/uni-v2-dai-usdt-mip6-collateral-onboarding-application/5865",
                        "https://forum.makerdao.com/t/maker-relay-ep-6/3517",
                        "https://forum.makerdao.com/t/weekly-polls-2020-07-20/3275",
                        "https://forum.makerdao.com/t/weekly-mips-update-9/3269",
                        "https://forum.makerdao.com/t/weekly-polls-2020-07-27/3403",
                        "https://forum.makerdao.com/t/maker-relay-ep-5/3406"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.389339826839827
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#2",
                    "likes": "5",
                    "time": "05/07/2020-23:25:14",
                    "content": "Tether has never undertaken a real audit to confirm their reserves. Their relationship with Bitfinex is murky. The risk of accepting USDT as collateral is far greater than any risk premium Maker would be able to charge for accepting it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monteluna",
                    "index": "#3",
                    "likes": "4",
                    "time": "06/07/2020-01:28:38",
                    "content": "I don’t necessarily agree. While I think it’s risky, to say there is absolutely no parameters that MakerDAO should allow for it is a bit much. The point of MakerDAO is to allow a basket of assets, some of which may be risky, under the assumption that the risk is very low for the combined basket to undercollateralize the existing Dai supply. I think Tether should have extremely high requirements for vaults, driving users to submit other tokens besides Tether. Specifically a very low debt ceiling and a very high reserve ratio requirement. I would be happy with USDT taking up no more than 10% of the total reserves by having an extremely low Debt Ceiling that doesn’t increase ($10M), along with a possibly 10x USDT to DAI reserve ratio. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.343461538461538
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#4",
                    "likes": "0",
                    "time": "06/07/2020-01:38:17",
                    "content": "It’s a stablecoin though, so at some point with these conservative risk parameters… what’s the point? Now if someone could convince tether to audit their reserves… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/freiza",
                    "index": "#5",
                    "likes": "4",
                    "time": "06/07/2020-04:01:43",
                    "content": "Like it or not, as participants in crypto, we are already exposed to Tether risk, which arguably prop up Bitcoin and Ethereum prices.  A crises in Tether would affect our system anyway and would have ripples across the entire crypto ecosystem. I am for using Tether in our vaults; it is the third largest cryptocurrency and can add stability and expand supply for Dai.  By adding Tether, we are continuing to diversify our underlying risk, increasing stability and liquidity, and expanding Dai supply. I agree we should manage the risk by introducing it with a low debt ceiling so we don’t become a Tether-credit factory. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#6",
                    "likes": "2",
                    "time": "06/07/2020-04:27:05",
                    "content": "    freiza:  I am for using Tether in our vaults; it is the third largest cryptocurrency and can add stability and expand supply for Dai. By adding Tether, we are continuing to diversify our underlying risk, increasing stability and liquidity, and expanding Dai supply. I agree we should manage the risk by introducing it with a low debt ceiling so we don’t become a Tether-credit factory.   I agree with your opinion. The market value of USDT ranks third in the market and ranks first in the stablecoin market. The idea of excluding USDT is inappropriate. As long as a lower debt ceiling is set, risks can be limited. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.107142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#7",
                    "likes": "2",
                    "time": "07/07/2020-19:40:06",
                    "content": "Tether in the current form is something that we should stay away from as a collateral.  The risk of at some point it going to zero overnight are too high. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#8",
                    "likes": "5",
                    "time": "07/07/2020-19:46:22",
                    "content": "There is a difference between indirect and direct risk.  If someone came to me personally and requested a loan offering Tether as collateral the answer would be No, so why should this be any different? Also, just because we have unintentional Tether risk already does not mean we need to add more intentionally. “Realcoin, Tether, USDT” is not trust worthy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.907986111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#9",
                    "likes": "6",
                    "time": "08/07/2020-00:12:54",
                    "content": "We need to draw the line at USDT.   Its a complete shit show- i don’t care how big the market cap is.  They’ve never done an audit.  It’s highly vulnerable to complete wipe out- which MKR holders would have to pay for.  Stay far away! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#10",
                    "likes": "3",
                    "time": "08/07/2020-01:16:06",
                    "content": "I’m not convinced that eth and btc exposure automatically gives us exposure to tether just because it’s another large player in the market. Stablecoin and non-stablecoin cryptocurrencies tend to be anticorrelated, so the market cap of tether is not directly reflected in the price of eth and btc. There are some arguments to make about liquidity, and whether tether alters the volatility of eth, btc, and other cryptocurrencies, but I think the effects are subtle and complex. If tether were to have a major scandal tomorrow and become worthless, it’s not obvious that this would negatively affect prices for the rest of the market, and possible it could prop up other top currencies as holders exit in mass. Overall I just don’t think this speculation about maker’s current exposure to tether should hold any weight in our decision of its viability as onboarded collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.551232993197279
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#11",
                    "likes": "5",
                    "time": "08/07/2020-09:36:48",
                    "content": "Because USDT does not serve US customers and does not operate in the US it is complementary to US-regulated stablecoins like TUSD and USDC. It’s valid risk diversification with the right parameters. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#12",
                    "likes": "3",
                    "time": "08/07/2020-09:38:59",
                    "content": "    latetot:  It’s highly vulnerable to complete wipe out   So-long as they are able to process redemptions it won’t go far below $1. There are dollars backing it; it’s just a matter of how many dollars. Even if there were a shortage of $1B it wouldn’t matter unless so few tethers remained. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#13",
                    "likes": "0",
                    "time": "26/07/2020-20:03:02",
                    "content": "As far as I can tell, tether/bitfinex don’t even pretend to care any longer :   twitter.com    Stuart Hoegner (bitcoinlawyer)  I have a Tether joke, but I only remember 74% of it.  8:53 PM - 25 Jul 2020     730          62            Assuming USDT is only 74% solvent, to have each DAI 120% backed by underlying fiat (like USDC) would require a 162% liquidation ratio.     wjmelements:  Because USDT does not serve US customers and does not operate in the US it is complementary to US-regulated stablecoins like TUSD and USDC. It’s valid risk diversification with the right parameters.   The US can eject Deltec or any other institution from the USD financial system by preventing banks with Fedwire accounts from acting as correspondents. Regardless of Tether being based outside the US, they are still subject to US jurisdiction. Most importantly, lending against USDT goes against the first “C” of credit: Character. “A man I do not trust could not get money from me on all the bonds in Christendom.” - JP Morgan ",
                    "links": [
                        "https://twitter.com/bitcoinlawyer/status/1287128783498215428",
                        "https://twitter.com/bitcoinlawyer/status/1287128783498215428"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.518353174603174
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#14",
                    "likes": "0",
                    "time": "30/07/2020-11:58:20",
                    "content": "Why would you assume USDT is 74% solvent?  Because somebody tweets? What is this number based on? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#15",
                    "likes": "0",
                    "time": "30/07/2020-15:45:35",
                    "content": "They admitted that in legal proceedings. Not necessarily current info but we have no grounds to believe it has improved afaik. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gregory_Klumov",
                    "index": "#16",
                    "likes": "0",
                    "time": "03/08/2020-13:43:28",
                    "content": "What’s more importantly is that community needs to LOWER the DAI stab rate not increase it. IT is only possible by bringing in assets that has the LEAST risks embedded in them so the transition of low interest rates from capital markets could be the most EFFICIENT. Check out USDT borrowing rates - its double digits. Because of unknown collaterization ratio and inability to check to what the issuing entity has access too. Still, there are some 30+k MKR holders who dont understand the way credit risk is valued ;( ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.555555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#17",
                    "likes": "4",
                    "time": "03/08/2020-14:06:01",
                    "content": "    Gregory_Klumov:  Still, there are some 30+k MKR holders who dont understand the way credit risk is valued ;(   Or they hold different values, or they know things you don’t, or they do understand and just disagree. If you want to take a greater role in governing the Maker Protocol, we are more than happy to welcome you. That said, please don’t imply that MKR Holders are ignorant or unaware of the risks. It’s bad form. I know Tether makes as easy target, but I would much prefer that you jump into governance and become a member of this community more generally rather than focusing on competing collateral types. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.401515151515151
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gregory_Klumov",
                    "index": "#18",
                    "likes": "0",
                    "time": "03/08/2020-14:31:12",
                    "content": "sorry, i guess i have been around crypto markets long enough, traditional markets way longer, living through last 5 crisis-es (98, 2001, 2008, 2013 and last one) to judge some its easy to find out the source of the votes but we wont go into details just facts, that since dai stepped on the path of touching assets from the real world it should pick the best ones credit risk wise ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.037878787878787
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jeffshaw",
                    "index": "#19",
                    "likes": "2",
                    "time": "11/08/2020-13:14:37",
                    "content": "I believe many in this community want some inquiry into the backing of the Tether reserves and composition to fully evaluate risk, and if onboarded, be able to select an appropriate risk premium to mitigate the additional collateral risk. Is there a Tether representative that MakerDAO could request additional information from regarding the composition of Tether’s reserves? Tether surely should understand that they have something to gain by being included as collateral on the MakerDAO protocol and maybe be willing to at least make some attempt to answer some risk questions we have. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sarahblumfeld",
                    "index": "#20",
                    "likes": "0",
                    "time": "13/07/2021-14:17:25",
                    "content": "hi everyone! i’m a newbie here and basically new to crypto… i am doing some research on who deals crypto and generally who accepts usdt this is one of the articles i found, but i’m also interested in more offline businesses. it would be really helpful if you provided me with any information on this!! i really want to contact business owners on this so they could tell me pros and cons of using crypto in their business. thank you so much in advance!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.258116883116883
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#21",
                    "likes": "1",
                    "time": "13/07/2021-14:20:12",
                    "content": "For USDT use cases, this is not a good place to find unfortunately. But from what I heard, you can also use USDT for crypto cards like Binance card and crypto.com which then you can use like a normal card ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.8333333333333335
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#22",
                    "likes": "0",
                    "time": "13/07/2021-14:32:32",
                    "content": "In Venezuela there is this page https://www.criptolugares.io/ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#23",
                    "likes": "0",
                    "time": "14/07/2021-00:46:37",
                    "content": "Thanks Diego for sharing it, there you will find a good report of businesses that accept various types of cryptocurrencies, it is not global, but it is quite updated in Venezuela. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sarahblumfeld",
                    "index": "#24",
                    "likes": "1",
                    "time": "19/07/2021-11:56:24",
                    "content": "thanks so much for suggestions—they are really appreciated!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1875
                }
            ]
        }
    ],
    "group_index": "2460"
}