{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-money-creation-in-decentralized-finance-a-dynamic-model-of-stablecoins-and-crypto-shadow-banking/9483",
            "title": "[Discussion] \" Money Creation in Decentralized Finance: A Dynamic Model of Stablecoins and Crypto Shadow Banking\" ",
            "index": 9483,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "research",
                "academic-papers"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "6",
                    "time": "22/07/2021-13:56:18",
                    "content": "After minimal effort, it has become clear that stablecoins are being talked about a lot in academic and policy circles. Naturally, there are zero conferences or papers I’ve discovered coming up that actually involve anyone that issues or uses stablecoins. In an effort to at least keep us informed, I will try to regularly post summaries and thoughts on the current research. This paper (\" Money Creation in Decentralized Finance: A Dynamic Model of Stablecoins and Crypto Shadow Banking\") is being presented at an economic conference today (CESifo on Macro, Money, and International Finance). The focus of this paper is to evaluate stablecoin price stability and its relationship to reserves. While MakerDAO even warrants a mention in this paper, there are two main takeaways:   Focus is solely upon stablecoins backed by fiat reserves and that raise money by issuing tokens into the marketplace. It is clear that other breeds of stablecoin – such as DAI – are either unnoticed or completely misunderstood. DAI in particular seems to stand alone as the only significant stablecoin that is neither redeemable nor algorithmic. We have a lot of work to do to make sure we educate academics and policy makers about this, as we are almost assuredly more “regulation friendly” without any onerous obligations.   This is the first paper I’ve seen that begins to wonder aloud if the value of transaction information will be the main driver of revenues for platform stablecoin issuers (like Diem when it comes). There is some discussion and mathematical modeling about ideal reserve requirements for this type of stablecoin, and an ultimate conclusion by the authors that regulation should focus upon reserves and not a hard peg, which they postulate will serve to lower total welfare in their models.   This isn’t really a controversial paper, but one that makes regulatory recommendations and is typical in lack of involvement from us or anyone else in crypto for both the paper and the conference. I’ll leave it here for reference if anyone wants to read it. ",
                    "links": [
                        "https://poseidon01.ssrn.com/delivery.php?ID=115120071099084005075071106107105081006040072045048074065004107125072120119109004029030006032052005113101003108104077090019105021043008005016104109018124028107125102028065038094092109110003080001071086119019030097068070072005108091073095095114103009067&EXT=pdf&INDEX=TRUE",
                        "https://forum.makerdao.com/t/maker-relay-ep-55-en-espanol/9715",
                        "https://forum.makerdao.com/t/maker-relay-ep-55/9531"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.60669191919192
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "22/07/2021-14:41:05",
                    "content": "    PaperImperium:  “regulation friendly”   What do you mean by regulation? Are you talking about KYC and AML, or about being stable and having a sound monetary policy? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.770833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "0",
                    "time": "22/07/2021-14:52:10",
                    "content": "    Saludiego_201:  What do you mean by regulation?   A lot of the most recent discussions seem to focus on reserve ratios and whether redeemable tokens are subject to “bank run” liquidity problems. That’s an area where Maker is well positioned, because there cannot be a literal run on DAI, and collateral backing DAI is readily available to those who can pull the data off the chain (which many agencies cannot currently do, though) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.657738095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#4",
                    "likes": "0",
                    "time": "23/07/2021-20:04:59",
                    "content": "Excellent, thanks for sharing Paper, it is a bit general, but I think maker is well positioned, but we should not sleep on this. More than anything it seems a precedent for currencies backed entirely in usd. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#5",
                    "likes": "0",
                    "time": "23/07/2021-23:54:20",
                    "content": "you are masters at that without a doubt, a fully supported system, not like the fiat we know today with the interest rate trap. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}