{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/speaker-series-3-representative-ted-budd-wednesday-july-28-12-00-edt-16-00-utc/9458",
            "title": "[Speaker Series] #3 - Representative Ted Budd; Wednesday July 28, 12:00 EDT/16:00 UTC ",
            "index": 9458,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "guest-speaker",
                "pubcall-:-speaker-series"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "18",
                    "time": "20/07/2021-22:09:21",
                    "content": "Our third guest speaker has just confirmed, and it is Representative Ted Budd. Q&A will be on Wednesday July 28, 12:00 EDT/16:00 UTC.  Have a question for the Congressman? Submit it here.  I’m very excited to have the Congressman, who sits on the US House Financial Services Committee. He also is on the Subcommittee for Consumer Protection and Financial Institutions — which oversees regulators such as the Federal Reserve and the FDIC. This is a unique opportunity for us to get insight into the conversations that the US Congress is having about crypto regulation. Questions can be submitted anonymously here. You may also post them in the comments below, or ask them at the link for the event. Those watching live will, of course, also be able to suggest questions in real time. Due to limited time with Representative Budd, make sure your questions are relevant and interesting.  image1334×750 64.2 KB  ",
                    "links": [
                        "https://app.suggestionox.com/r/VPqPdb",
                        "https://app.suggestionox.com/r/VPqPdb",
                        "https://forum.makerdao.com/t/maker-relay-ep-56/9649",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-151-thursday-july-22-17-00-utc/9423/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-55/9531",
                        "https://forum.makerdao.com/t/paperimperium-delegate-platform/8992",
                        "https://forum.makerdao.com/t/maker-relay-ep-55-en-espanol/9715"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.100811688311688
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#2",
                    "likes": "7",
                    "time": "20/07/2021-23:41:50",
                    "content": "Great work paper! Looking forward to engaging and having a thoughtful discussion with Representative Budd. Very important we talk with legislators, hear their views, and educate them on MKR and the benefits of DeFi. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.9
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#3",
                    "likes": "4",
                    "time": "21/07/2021-00:21:53",
                    "content": "Excellent job, @PaperImperium. Rep. Budd is a great voice in Congress and definitely someone who understands and supports our space. Look forward to attending. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#4",
                    "likes": "4",
                    "time": "21/07/2021-18:34:26",
                    "content": " Episode #3 - Representative Ted Budd  Agenda   00:07: Introduction  01:38: Questions and Answers   Introduction  Chris Cameron 00:07 U.S. Congressman Ted Budd  Good morning, MakerDAO and anyone else listening in. Today we have our third installment of our Guest Speaker Series with Representative Ted Budd of North Carolina, who sits on the House Financial Services Committee. Ted Budd is also from my home state- Go, North Carolina! Just had to plug that in there. Let me begin by saying the views and opinions expressed here are not necessarily those of MakerDAO, a decentralized organization.  I cannot bind them to any views or opinions. Thank you so much for joining us, Ted Budd. Crypto has been in the news a lot. I want to start out by saying that I have looked into it. I am sure you are the first publicly elected official anywhere in the world to meet with a DAO. Thank you, this is a small moment of history for DAOs.  Ted Budd: Wow, we are making history as we speak here. Fantastic. Chris Cameron: it’s a small history, but it’s something. Ted Budd: It’s still significant. Chris Cameron: we have many questions submitted in advance that cover a wide range of topics. Before we get too far into the weeds about things like regulation, let me just start with one about governance.     Questions and Answers  Ted Budd  Q: We are very decentralized, which means that many members are involved; this is a very flat hierarchy. You are also in an organization with many members that have to reach a consensus about things and coordinate positions before voting. Do you have any advice for how we can herd cats a little better to reach a consensus without taking years? 01:38  I know we are probably of various ages on this call but let’s go back and find the EDS Superbowl ad from probably around the 90s. It was cowboys herding cats as the theme. But one has built great relationships. You know, if you are trying to talk with those in the traditional finance world and don’t burn bridges and realize that we are all people at the bottom of this, even if it’s a decentralized organization role here. There will be many firmly held opinions, and that’s okay, but just realize that human-to-human interactions are still significant, so do what you can to build relationships and understand others before seeking to be understood. Those are some good rules to live by as you proceed, whether working in congress here or working inside a decentralized organization like MakerDAO.  Chris Cameron: Awesome, thank you. It is sometimes a little complicated, and things get heated. I will be the first to admit that sometimes I get mad about stuff… Perhaps I should just let it go. Ted Budd: You have spoken like a true North Carolinian.     Q: Speaking of viewing each other’s humans and trying to view things calmly, there were some inflammatory statements made by some senators yesterday who will remain nameless in the senate banking committee. We are all political novices over here at MakerDAO. We are not a big corporation that has access to lawyers and lobbyists. Should we expect this to be simply theater acting, or should we really be concerned? 03:21  I’m going to give you a firm ‘yes.’ Either-or, questions always contain a little bit of both when it comes to politics. C-SPAN had changed things when our opinions and meetings were all on-air since the late 1970s. Then people began playing on camera and the external audiences rather than working towards consensus and understanding inside the room. When it comes to new technology, sometimes it breaks down along generational lines. I’m going to have to go and look up those comments you mentioned because some on the senate side and the house fear the blockchain, DeFi, and how it will evolve. I think their fear is whether it will hurt our national sovereignty and destabilize the dollar. Is it a threat to national security? Some in the house that sits not too far from me on the House Financial Services Committee would call blockchain a financial 9/11. I totally disagree with their opinions. I think we need to be very open to this new technology. We need to make the US the place where this flourishes and develops. As a new technology, it’s going to evolve. I’d rather have it evolve here in the US than in Singapore or Estonia or even other nations that could be hostile to us. I’d rather it be on our shores to have a regulatory framework where people can expect what the future will look like. They can then develop inside that framework.   Q: Speaking of reaching out and cooperating with regulators, Maker’s is not an entity, and that said, the US is the most important financial market in the world. Most of our token holders that are identifiable are either US citizens or US entities. We’re not looking to pretend that we are cowboys here. We have found it hard to establish a dialogue or even get in contact with these regulators. How can a grassroots organization like ours get in front of some of these very busy people with full schedules dealing with many technical sides of these regulations and proposed regulations? As I said, we don’t have lobbyists or a marketing department at the moment. So how do we, as the fourth largest stablecoin issuer, get in front of some of these parties to open the lines of communication and share information? 05:48  I would encourage your members to know their legislators in the house, particularly in the US house. Since it’s a stablecoin and it’s a matter of US currency, understand who is on the financial services committee and members of congress. Suppose you’re very focused on your business’s technology or doing life work, whatever you’re doing. In that case, you’re not really focused on what’s going on in Washington. We are focused on that because that’s what we do. I would make sure you know them when they are back in the office. They have a schedule; There are about three weeks out of the year. We travel back most weekends, and there’s that fourth week of the month when we’re back in the district. You can meet at one of their district offices and call their district director to set up a meeting/ call their scheduler and ask to get on their calendar for 15 minutes or just propose it. It might be intriguing because we don’t get a lot of meetings. We mostly get veteran-related issues and constituent service. Still, we don’t get a lot of things that are stablecoin-related. I would not provide a tech-heavy speech to these folks. Still, if you can explain it clearly and ask how they think about these things or propose the questions ahead of time, We’re accessible to discuss it. You can talk to the staff members dedicated to all things financial services. I would reach out and speak to the staff and ask questions. A former speaker shared with me within my first few days here back in 2017 to think of Washington like an old black and white TV show with a switchboard. If you’ve seen one with the switchboard and the operator is really busy moving plugs around, that’s kind of like Washington DC. All interests sort of flow through DC because of the regulatory frameworks that come out of this place’s laws, but many relationships go along. Make a trip to DC, get on their calendars, schedule a meeting like this through Zoom, Webex, or any of these platforms that we’re using. People think these video platforms are going backward or that we ought to be in person. I actually think this augments; it’s like adding the telephone or adding the e-mail. These platforms are wonderful.   Q: I’m seeing a question in the chat regarding the financial transparency of traditional financial institutions versus blockchain. I actually want to build on that because one of the things that we taut on our end, at least for Maker, is that you can see precisely what collaterals are backing Dai. However, in the past week, a central bank and an international finance organization that issues guidelines both had researchers ask us how to get this information publicly available. It’s clear that just having it out on the blockchain is not going to be enough. How can we get this kind of information that we have sitting out here, which is public knowledge, but you require some technical skill to bridge that gap between people who want to know about it? 09:57  I imagine since it’s decentralized that it’s very open source. Now I am technically compatible but not entirely up to speed on all the inner working as MakerDAO. I would say as you develop this information, have somebody make it user-friendly. If you want it to be user-friendly, you have to answer that as a community, but I would also say put it in a PDF format that you can bring to that member of Congress or their staff. It should show why MakerDAO is transparent, how to look, how it is safe, how it is not a threat, how it is good for the country. It could just be a one-pager. There is a lot of information that flows through DC and through our brains. The simpler you can be, the better for us. We can dig in deeper when we want to. Potentially add some footnotes on how to look further along with other resources. I would say a lot of what you do here is seeking not to be misunderstood. All the members and staff are available online. A good place to start is Wikipedia, or you can even go to our house website and just see who the members of congress are and what committees we’re on, which is pretty essential.  Chris Cameron: Yeah, I will send your staff some tools that are being discussed in chat right now.     Q: A lot of media and political news discussion now focuses on financial regulation and stability. It makes sense because there are a lot of interested parties. Right now, Maker is already actively financing RWAs. We have residential improvement loans. We have Solar Farm asking us for some financing. There are several other projects, including a proposal to even get into the treasury market. Is the question even on the radar yet, about how we can let traditional and DeFi access each other? We want safer access to liquidity and safer assets. On our side, there’s a lot of yields that I’ve seen hedge funds express interest in. Has there been any thought about how to make it easier to interface those two worlds? Or is it still mostly like, “Let’s get our arms around the crypto thing first and then worry about how we can put them together?” 12:29  In the book “The hard thing about hard things,” Marc Andreessen says, “Watch what the nerds do on the weekends, and that’s the next thing.” So if these are the shadowy people from the previous question who are programming, coding, and developing this network, how to translate that to the casual user or the traditional financial user? How do you make yourself not compete with trusted third parties and banks but find somebody you can communicate with? Do they become a node that resells or connects their customer base with what you have to offer? You have to make what you do simple for it to be widely adopted. You are figuring that out as a community, and I’ve been on your side. It seems very well explained. Still, the easier it is for people to understand, the more readily they adopt it. There’s also a vocabulary challenge. Not only do people not know where to get started, but they also don’t understand the concepts. They don’t know the difference between DeFi and NFTs. Some still confuse blockchain with Bitcoin and can’t tell the difference. There’s a need for a “who to go to” and an explanation of the concepts and vocabulary of your industry.   Q: More generally, when you look at the proposed regulations or an area that you’re interested in examining further while you’re on the Financial Services Committee, what do you all talk about? What’s the process? Do you have a checklist for due diligence and fact-finding before you decide what you want to do? What will you look for? Can you walk us through it and tell us a bit about how the sausage is made? 15:34  Well, it’s definitely a sausage! I wish it was a great process like you described. But it’s not agile; it’s not quick. It really depends on who’s in leadership and what they want to do with the committees and subcommittees. A colleague of mine, Warren Davidson from Ohio, who I imagine has been or will be a guest here, is one of the top three or four people on the Committee who understand this DeFi. So the process is really more about the function of his office, my office, offices of those of us who get it and want to learn more, and lastly, our own internal processes. Think about each congressional office, not as employees of a larger organization but as our own little organizations or subsets. Each office has its culture, its own style, and its own process. Some members push initiatives for years and have to wait to catch lightning in a bottle at the right time. Right now, everybody talks about the valuations of particular cryptocurrencies. You get the “Elon Musk’s” of the world talking about certain things, etc. Suddenly, people, who usually wouldn’t pay attention and think it’s out of reach, are interested. I would use those moments. They may be eye-rolling to some of you, but at the same time, you may ride that wave and explain to some of your potential clients what you do, how you’re different, and how you create value in the marketplace.   Q: When it comes to informing legislators, and government organs, not just in the US, about half a dozen conferences are coming up for central bankers and finance organizations. There are also at least a dozen papers that are on their way. These are the ones specifically about digital currencies, distributed ledger technology, and even stablecoins. What strikes me and struck me again yesterday in the Senate Banking Hearing is that there’s really no involvement with the actual people involved in this stuff. It’s a group of people outside looking in and then discussing amongst themselves. My question out of that observation: are we the first ones who tried to reach out to you? Obviously, we don’t know what everyone else’s doing. Is it that people don’t want to talk to us, or have we been dropping the ball in trying to talk to you all? 17:40  I think it’s a newer technology. To you, it probably doesn’t feel new as you do it every day, but to the outside world, it is new. Clarify this a little bit, if you would. By “outside people looking in,” do you mean most elected people and what you saw in the Senate?  Chris Cameron: Yeah. When you look at the choices of who they bring to be their experts to question or at conferences that several central banks have scheduled, e.g., for the ECB in October, there’s no involvement from actual market participants. If there is, it’s very little. When it comes to us, if you throw #cryptotwitter up as a hashtag and start following a bunch of people who show up, you will find a lot of conversations like, “Why is this and that person here” or “Why are they asking this and that person.” Many of this is in the academic circles. Still, it seems like we are doing a poor job advertising our availability. Ted Budd: That makes sense, Chris. With all of the advantages of decentralization, it’s probably one of the downsides. The personnel from the government affairs office on D Street in Washington DC don’t know who to call. As the MakerDAO community hears wind of House Financial Services or Senate Banking Committee having a committee, then it’ll want to reach out to groups like mine that it has already built relationships with. Like right now, it’s easy for you to call Francesco on my team or call me and say, “Hey, we heard about this committee. Can you ask if we can be involved?”. A little inside secret, not so secret: it’s very political who they bring in. They want the witnesses to fit their agenda for the hearing. As a Republican, I’m in the minority right now. The hearing will ultimately lead to legislation. The legislation leads to something called a markup, where we all mark up the bills. If that passes, it goes to the floor and gets a vote. The process starts with a hearing. So if you’re for or against regulation, you have to build those relationships that can get you in front of a hearing. Because you’re decentralized, that’ll affect how you approach things. Chris Cameron: Sounds like we were a little naive on our end about it. Ted Budd: Look, you’re new, you’re decentralized. You can go fast; there’s a lot of innovation. But maybe there’s also no coordination when it comes to government affairs. It’s just a trade-off. I wouldn’t worry about it but just be happy to learn about it and fix it. It can be building some friendships. When people understand what you’re up to and that you’re good actors, not a threat, they’ll want to help you out and connect you to the right places.     Q: For those who don’t think we’re good actors, short of just closing up the shop and saying, “You’re right, the party’s over,” what’s your advice for making it clear that we want to make a good-faith effort? It’s not our mission, but we’re out there carrying forth the flag of the dollar as the reserve currency. We’re doing so without taking anyone’s deposits. We don’t custody any money except for our own, unlike some of our competitors. Perhaps that’s a valid thing to look at there. What’s your advice as a first step in reaching those who call us shadowy figures? 22:45  It’s kind of cool, right? Not a bad brand! It’s what we all wanted to be at some point in life! A lot of this is a generational breakdown, not a partisan breakdown. It’s not always Republican versus Democrat. Let’s say there are 60 members on the House Financial Services. You’ve got one member, e.g., from California, who hates this stuff. Maybe you can talk to his staff, or you can also speak to the other 59 members. I would build on islands of health and strength, as Peter Drucker would say. Go where your message is heard. As he also would say, I would gather those members and offices where you’re understood. Over time, more and more people will understand.   Conclusion  Ted Budd 24:30  I’m getting a note from Francesco that it’s time for me to go over and vote. I really appreciate you having me, Chris. Hopefully, you’ll have me back, and I can be helpful to you.  Chris Cameron: Absolutely! Thank you so much for making history with us. I won’t keep you from your duties. Thank you! Ted Budd: I appreciate what you do and hope to see you again.     Common Abbreviated Terms DAO: Decentralized Autonomous Organization RWA: Real-World Asset DeFi: Decentralized Finance  Credits  Andrea Suarez produced this summary. Artem Gordon produced this summary. David Utrobin produced this summary. Sonya Olechnowicz produced this summary. Everyone who spoke and presented on the call, listed in the headers.​  ",
                    "links": [
                        "https://youtu.be/y834c0P1Crw?t=98",
                        "https://youtu.be/y834c0P1Crw?t=7",
                        "https://budd.house.gov/",
                        "https://youtu.be/y834c0P1Crw?t=98",
                        "https://youtu.be/y834c0P1Crw?t=201",
                        "https://youtu.be/y834c0P1Crw?t=348",
                        "https://youtu.be/y834c0P1Crw?t=597",
                        "https://en.wikipedia.org/wiki/United_States_Congress",
                        "https://www.house.gov/",
                        "https://youtu.be/y834c0P1Crw?t=749",
                        "https://youtu.be/y834c0P1Crw?t=934",
                        "https://youtu.be/y834c0P1Crw?t=1060",
                        "https://youtu.be/y834c0P1Crw?t=1365",
                        "https://youtu.be/y834c0P1Crw?t=1470",
                        "https://forum.makerdao.com/t/maker-relay-ep-56-en-espanol/9812",
                        "https://forum.makerdao.com/t/maker-relay-ep-56/9649"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.610042587376924
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#5",
                    "likes": "4",
                    "time": "22/07/2021-01:14:15",
                    "content": "Amazing Paper, I will be very attentive to this event.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.800000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#6",
                    "likes": "7",
                    "time": "28/07/2021-20:00:18",
                    "content": "This call is no longer available on the MakerDAO youtube channel. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#7",
                    "likes": "8",
                    "time": "28/07/2021-20:34:26",
                    "content": "This was a very good interview. Ted put down the guidelines for engaging with members of congress. Good and practical next-steps-related questions from your side @PaperImperium.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.318055555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#8",
                    "likes": "8",
                    "time": "28/07/2021-21:50:17",
                    "content": "I have watched the interview this is so interesting! He made clear that MakerDao should reach out to politicians, glad to see that he is excited about Defi and crypto. I dont know how things in the US are, in my counrty politicians dont have a personal opinion they represent the party, when they have a different view on things the party replaces them with someone who is brainless. Thats why I love crypto, its fresh to see that systems are not rigged from the begining! I was happy when he mentioned it is not a party conflict with crypto more like a genereation one, Im trying to be optimistic when it comes to regulatory from the us, it could lead the way for other countries. Im watching how the topic regulation is evolving, it is non transparent actually I dont find any valid statements, (the statment from Rep. Warren is a lot of noiseI dont know if it is serious) I am also afraid one day they come out and over regulate it or trying to ban it! Super work @PaperImperium thank you so much! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.984375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#9",
                    "likes": "4",
                    "time": "28/07/2021-22:59:15",
                    "content": "I liked the tone of the conversation @PaperImperium very good job.  Maker needs to make itself known in the regulatory world and with these tips it’s a good start, with these key connections. The mention to the senator of the shadowy super coders haha super cool. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1416666666666675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#11",
                    "likes": "3",
                    "time": "29/07/2021-01:24:03",
                    "content": "I believe so. Certainly the first elected official of any major country. As for policy maker, the House and Senate oversee the Fed, so definitely outranks our previous guest from the St Louis Fed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3601190476190474
                }
            ]
        }
    ]
}