{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/fire-drill-vote-now/16461",
            "title": "Fire Drill - Vote Now! ",
            "index": 16461,
            "category": [
                "Governance"
            ],
            "tags": [
                "polls",
                "drill"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "12",
                    "time": "09/07/2022-13:07:50",
                    "content": "Hello! GovAlpha has been informed of a “suspicious” poll on the Voting Portal! Good news is it was us that put it there in collaboration with @immunefi-core-unit and the Security Stakeholder Initiative team. Please vote on the poll as quickly as you are able to! This is a drill, so please stay safe and don’t go overboard rushing to submit your vote. The goal here is to see how much MKR we can get to vote on the drill in a 48 hour period to test our response time. Here is the poll link - https://vote.makerdao.com/polling/QmQXTMw1#vote-breakdown - we’ll be posting a report detailing this drill in the next two weeks. @Recognized-Delegates your participation will be noted in this drill but it will not affect metric scores or compensation. Whether you are a delegate or casual voter please consider voting here so we can see how much MKR would have been around to respond to an urgent event this weekend  . ",
                    "links": [
                        "https://forum.makerdao.com/t/fire-drill-postmortem-informal-poll/16677"
                    ],
                    "GPT-summary": "The post is a call to action for the MakerDAO community to participate in a fire drill poll to test the response time of the community. The post also mentions that the poll was put in place in collaboration with the Immunefi-core-unit and the Security Stakeholder Initiative team. The author encourages all members of the community to participate in the poll and notes that the participation will be noted but will not affect metric scores or compensation.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 6.00462962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#3",
                    "likes": "1",
                    "time": "09/07/2022-13:08:54",
                    "content": "Next time do it at midnight in another timezone please to keep it fair;) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#4",
                    "likes": "1",
                    "time": "09/07/2022-13:09:55",
                    "content": "Also… 48h, srysly? That’s not even close to a proper response time for urgent things… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#5",
                    "likes": "0",
                    "time": "09/07/2022-13:42:37",
                    "content": "I mean that’s what the community voted on last time I think ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.21875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#6",
                    "likes": "0",
                    "time": "09/07/2022-13:47:37",
                    "content": "At the last urgency exec 48h would have been far too long ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#7",
                    "likes": "1",
                    "time": "09/07/2022-14:28:41",
                    "content": "Abstained. I really like the idea but it seems there might be things to adjust based upon feedback. Stay vigilant everyone. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#8",
                    "likes": "1",
                    "time": "09/07/2022-16:35:54",
                    "content": "Since I read the Fire Drill here I think it would have been helpful to get some feedback from people with this drill. This came from @Doo_StableLab in Delegate chat. \"Review This is a drill to test MKR Voter response time. Please vote in this poll to indicate you would have been able to assist the protocol in an urgent/emergency situation. Since you’re already submitting a vote why not give us a little info. Please submit your vote for yes, no, or abstain to participate in this drill. Vote Yes if you believe these “fire drills” are a valuable use of resources. Vote No if you do not think these “fire drills” are not a valuable use of resources. Vote Abstain if you are not sure or do not wish to give an opinion on the value of these drills. This discussion thread will give you more information on the motivation behind this drill. A thread will be posted in response to this fire drill once this exercise has been noticed by the community.\" I believe these fire drills are useful for GSM exec protection,  but I also believe if any info on ES is to be gleaned in terms of response it has to come not from delegates but actual MKR holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.330357142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "08/10/2022-22:36:28",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}