{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip6-blocktower-credit-transaction-documents/19019",
            "title": "MIP6: BlockTower Credit: Transaction Documents ",
            "index": 19019,
            "category": [
                "Updates",
                "Integrations"
            ],
            "tags": [
                "mips",
                "centrifuge",
                "rwa-010",
                "rwa-011",
                "rwa-012",
                "rwa-013",
                "rwa",
                "blocktower"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/BlockTower",
                    "index": "#1",
                    "likes": "1",
                    "time": "02/12/2022-04:51:06",
                    "content": "Hi Maker Community, In finalizing the MIP6: BlockTower Credit collateral onboarding, we would like to share the final legal documents pertaining to this transaction. The links and IPFS hashes below provide access to the executed versions of the following:   TACO Foundation Documents - QmZ1SYS9Vu4QwqrX8eySwyVzU7G2oqVqNJuGAWqEc4H3kJ   Master Participation Agreement - QmZmtWPgJHqNff9SLWLpZpKLHh6FzJZnSKqViy1cKNfSWj   Servicing Agreement - Qme7m42naniTY3pPQaNxibS538UD18Mk14UEssg6hxqoQH   DAI Loan Agreement - QmVh4NyhNw8cPEXVGatKNGHDrPTkQKw9ESE69886CiiiyQ   Trust Indenture Agreements (I - IV) - QmP7VBQG7bqJJ31p6GnBaxu4Vke9HGjQg2x87YuzAi6th4   With MKR tokenholder approval of the executive spell, the relevant parties will then execute and / or file (and we will post) the agreements and instruments to implement the terms of the primary agreements, including:   DROP SPV Security Agreements (I-IV) - QmPfp4Laa3kzR6bUeFGJBPodWSRuyn92GnWAGN8XdaASor   Issuer SPV Security Agreements (I-IV) - QmeUt8FkV8TeFV4eK7XnzzTaTb2D27P7LWkdCwzKbnSF1g   DROP SPV Pledge Agreements (I-IV) - QmPKQTtMDJwcSWkNtJ4VxAM4cChSyq3YvMsSwzCqqXi6Kj   Issuer SPV Pledge Agreements (I-IV) - QmRFJW2L4XP4hqGemfGgfAdhbcC5wsuZJS34AL3YswnFCx   Tokenholder Representative Appointment Letters (I-IV) - QmUNTnfnXo56XABxsuYv6hhk8RFYK8YJsAkaYBMV62An5m   Ankura Disclosure - QmPWRd8SuG2UEHQoL7BvSnjqsyB3wYXEb28ciaVEzPPRHa   DROP Subscription Agreements - Qmcvqdq2qCmusHW1vT69V5k86eWbWPSC2Y4aRjWpBCPjHE   UCC-1s Filings - QmYrm6qNUDTnBQm3h1Q2oCsunBBLhm1KStKfuW5CQD1jde   The execution and/or filing of each of these ancillary instruments is a further condition to the first minting of DROP Tokens - see Schedule 2 of the DAI Loan Agreement. We want to thank @christiancdpetersen for his diligence and the rest of the Maker deal team for their work on getting this transaction complete. We’re excited to move forward and to continue adding to our partnership with Maker! Finally, we understand that it’s a busy period for Maker, but should the community value a live conversation regarding this deal, please let us know and we’d be happy to continue engaging in an office hours or AMA type session. Thanks! ",
                    "links": [
                        "https://blocktowercredit.infura-ipfs.io/ipfs/QmZ1SYS9Vu4QwqrX8eySwyVzU7G2oqVqNJuGAWqEc4H3kJ",
                        "https://blocktowercredit.infura-ipfs.io/ipfs/QmZmtWPgJHqNff9SLWLpZpKLHh6FzJZnSKqViy1cKNfSWj",
                        "https://blocktowercredit.infura-ipfs.io/ipfs/Qme7m42naniTY3pPQaNxibS538UD18Mk14UEssg6hxqoQH",
                        "https://blocktowercredit.infura-ipfs.io/ipfs/QmVh4NyhNw8cPEXVGatKNGHDrPTkQKw9ESE69886CiiiyQ",
                        "https://blocktowercredit.infura-ipfs.io/ipfs/QmP7VBQG7bqJJ31p6GnBaxu4Vke9HGjQg2x87YuzAi6th4",
                        "https://blocktowercredit.infura-ipfs.io/ipfs/QmPfp4Laa3kzR6bUeFGJBPodWSRuyn92GnWAGN8XdaASor",
                        "https://blocktowercredit.infura-ipfs.io/ipfs/QmeUt8FkV8TeFV4eK7XnzzTaTb2D27P7LWkdCwzKbnSF1g",
                        "https://blocktowercredit.infura-ipfs.io/ipfs/QmPKQTtMDJwcSWkNtJ4VxAM4cChSyq3YvMsSwzCqqXi6Kj",
                        "https://blocktowercredit.infura-ipfs.io/ipfs/QmRFJW2L4XP4hqGemfGgfAdhbcC5wsuZJS34AL3YswnFCx",
                        "https://blocktowercredit.infura-ipfs.io/ipfs/QmUNTnfnXo56XABxsuYv6hhk8RFYK8YJsAkaYBMV62An5m",
                        "https://blocktowercredit.infura-ipfs.io/ipfs/QmPWRd8SuG2UEHQoL7BvSnjqsyB3wYXEb28ciaVEzPPRHa",
                        "https://blocktowercredit.infura-ipfs.io/ipfs/Qmcvqdq2qCmusHW1vT69V5k86eWbWPSC2Y4aRjWpBCPjHE",
                        "https://blocktowercredit.infura-ipfs.io/ipfs/QmYrm6qNUDTnBQm3h1Q2oCsunBBLhm1KStKfuW5CQD1jde",
                        "https://forum.makerdao.com/t/blocktower-credit-monthly-report-2-1-2023-2-28-2023/20006",
                        "https://forum.makerdao.com/t/overview-of-rwa-related-spfs-and-funding-requests/17814",
                        "https://forum.makerdao.com/t/blocktower-credit-monthly-report-12-21-2022-01-31-2023/19614"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.168371212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#2",
                    "likes": "3",
                    "time": "02/12/2022-11:43:54",
                    "content": "I wanted to let the Maker community know that I reviewed and commented on each of the BlockTower Credit transaction documents. I worked collaboratively with BlockTower’s external counsel and the BlockTower team to ensure that Maker’s interests are protected. I can confirm that BlockTower will not be able to mint DROP Tokens until BlockTower satisfies each of the conditions precedent outlined in Schedule 2 of the DAI Loan Agreement and external counsel confirms such satisfaction via delivery of a conditions precedent satisfaction memorandum. @BlockTower ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BlockTower",
                    "index": "#3",
                    "likes": "0",
                    "time": "02/12/2022-18:59:40",
                    "content": "Hi @Recognized-Delegates, tagging the group for visibility! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#4",
                    "likes": "2",
                    "time": "02/12/2022-22:25:43",
                    "content": "Re-tagging @Recognized-Delegates to make them and MKR holders aware that given the overwhelming support for onboarding BlockTower Credit with only 0.17% of MKR voters opposing these legal documents will be going into the executive spell next week. Special thanks to @christiancdpetersen for working tirelessly to get these out to the community despite repeated delays from the other legal firms working on these documents. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.878968253968254
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "0",
                    "time": "02/12/2022-22:58:48",
                    "content": "Using Egan-Jones Ratings for rating requirements, eh?   Haven’t heard that name since the 2000’s RE run-up and subsequent down-draft. In the MPA portion related to the NFT “Eligibility Package”, there’s a decent amount of metadata that needs to be captured. How is it audited for accuracy since you’re capturing a good amount of fields (Invoice #, amount, currency, etc.) ? Is this Intex Solutions the structured finance analytics provider you’re referring to here, or a typo:  @christiancdpetersen nitpicking here, but on the MPA–should the “Maker Token” also be define as MKR or irrelevant in a court of law? But more importantly–what is the difference between defining the BUYER on the MPA with  a section like “Credit Decision & Information” (acknowledging that the Buyer is  a sophisticated Person) versus, just using the section labeled, “Buyer’s Representations and Warranties”? Does anybody know if the “Settlement Report” will be plugged into a dataset dashboard by either Centrifuge, or Data-Insights CU? This ecosystem is desperate for visual proof or reserves/assets, liabilities, or anything that can be kept on-chain… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4259259259259265
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#6",
                    "likes": "0",
                    "time": "06/12/2022-15:45:21",
                    "content": " SEC Charges Egan-Jones Ratings Co. and CEO with Conflict of Interest Violations https://www.sec.gov/news/press-release/2022-111 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/humancapitol",
                    "index": "#7",
                    "likes": "1",
                    "time": "06/12/2022-17:06:10",
                    "content": "Apologize for the delayed response! Below: Egan Jones: To be honest, we don’t encounter Egan Jones in public securitizations. We added them here for completeness sake in the documents, making it as easy as possible for Ankura to act as Loan Verification Agent i.e. they don’t need to guess what is an equivalent investment grade rating for Egan Jones, if it ever came up. (cc: @ejbarraza - you may also like this article from Matt Levine for more context: Bloomberg - Are you a robot?) NFT “Eligibility Package”: The underlying loan or offering documents are provided to the Loan Verification Agent to provide the source data for review/audit. Keep in mind, we are also 1) auditing the information we receive from an originator or seller, as we are making an investment decision and need to ensure we have absolute accuracy on details and 2) we make legal reps that the information we send to the Loan Verification Agent are accurate (and have legal liability for gross negligence here) Intex: Yes it’s Intex Solutions Settlement Report: The payments on DROP tokens, via Centrifuge, can already be tracked on-chain (see this message from Seb, for example). Centrifuge also has a number of 3rd party initiatives building data dashboards on top of the Tinlake protocol. We’ve spoken with a number of companies building similar (for example, RWA Company), and will utilize every innovation in this space that we can to deliver information in a transparent and timely manner. For our settlement reports, we’ve already been (and will continue to) work with CES to provide this information in an as transparent (and on-chain native) way as possible, with the intention to move more and more of this on-chain over time (in accordance with the guiding meta of the Spring Cluster i.e. bring RWA on-chain in a more transparent manner vs. focusing on deployment off-chain). Hope this helps but, as always, please feel free to reach out with any more questions! Thanks, Kev ",
                    "links": [
                        "https://discord.com/channels/893112320329396265/899667119426371625/1044638259826917479",
                        "https://gov.centrifuge.io/t/centrifuge-insights-an-analytics-dashboard-for-the-centrifuge-ecosystem/4429",
                        "https://forum.makerdao.com/t/spring-cluster-introduction-and-proposal/18398/3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.439583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "06/01/2023-03:06:18",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}