{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ask-circle-to-freeze-50m-usdc-of-dai-reserve-to-protect-markerdao/20154",
            "title": "Ask Circle to freeze 50M$ USDC of DAI reserve to protect MarkerDAO ",
            "index": 20154,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "meta-governance",
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Lionel",
                    "index": "#1",
                    "likes": "0",
                    "time": "12/03/2023-10:12:32",
                    "content": "Context: Today, about 1% of total DAI supply is hold by 1-2 single hackers wallets from Nomad Bridge hack, about 50M$. These hackers are certainly from North Korea, Iran, or Russia. This can have huge consequences on Marker DAO and its founders. We are urging Maker DAO to take the preventive steps before it is done by regulators and enforcement bodies. Proposal: Discuss and explore all technical solution to solve this dangerous problem from all DAI holders and all partners quoted bellow. Some tokens issuers and stablecoins issuers have recently been forced to freeze tokens and mint into a new deployed smart contract, excluding bad actors. Exemple : NZDS stablecoins regulated. https://twitter.com/techemynt/status/1623491674541539329?s=46&t=WpQlH-fvYyyjL7a8pnkq0g Other technical solutions exist that need to be discussed. A class action of 558M$ have been submitted: Nomad Crypto Bridge Class Action Says Simple Programmer Mistake Allowed $186M Hack in 2022 Defendants are Nomad, Circle, Coinbase, Opensea, Consensys, Archetype, Connext Network, Polychain. A separate lawsuit against MakerDAO and its founders is currently in preparation. Nomad investors are: Polychain, Opensea, Algae, Coinbase, Crypto.com Capital, Wintermute Trading, Gnosis, HackVC, Lattice Capital, Figment, Triblock, Coinbase, A&T Capital, Breyer Capital, Polkadot, Gavin Wood (Polkadot co-founder), Tokensoft, 1kx, Seed Round, Avalanche, Robot Ventures, Circle, Wave Financial Group, Dialectic , Ethereal, Mina, LedgerPrime, ,Amber Group, Hypersphere, Robert Habermeier (Polkadot co-founder), Jack Platts (ex-Polkadot/Web3 foundation business dev.), Continue Capital , Gitcoin, Open Web Collective, Archetype , Cosmos Network ,Ethan Buchman and Jae Kwon, Celestia, The Graph. Partners and ecosystems (short list) : Moonwell, Moonbeam, Evmos, Connext, Cronus Finance, Diffusion Finance, ExSwap, SpaceFi, Coslend, Milkomeda, MyTrade, StellaSwap, EvmoSwap, Blockchain at Berkeley, Saddle Finance, Neon, Zenlink, Covalent, LI.FI, Iagon, Osmosis, Lemuria, Orbital Apes, Earnmos, OccamX, Coslend, MuesliSwap, The Graph, ElasticSwap, Blueshift, Hummingbot, Superfluid, Aurora, Centrifuge, BeamSwap, Athos Finance, Linear Finance, Archway, Circle Ventures, Stakely. We are urging all partners and investors to take preliminary steps to protect users and the whole ecosystems. Several actions are into the works as Nomad founders disappeared from several months and we do not have any of question answered into Nomad Discord. If some entities or person can argue its Nomad fault and all in their hands, this problem can not be solved by Nomad alone and need the participation of all partners and investors quotted above. ",
                    "links": [
                        "https://www.classaction.org/news/nomad-crypto-bridge-class-action-says-simple-programmer-mistake-allowed-186m-hack-in-2022#embedded-document",
                        "http://Crypto.com",
                        "http://LI.FI"
                    ],
                    "GPT-summary": "The author of the post is proposing that Circle freeze $50M USDC of DAI reserve to protect MakerDAO from hackers who hold 1% of total DAI supply. The post discusses the potential consequences of the hack and urges MakerDAO to take preventive steps. The proposal suggests exploring technical solutions to solve the problem and mentions a class action lawsuit against Nomad Crypto Bridge. The post also lists partners and ecosystems and urges them to take preliminary steps to protect users and the whole ecosystem. The post explains the proposal and provides constructive criticism while also advertising the proposal and asking questions about it.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 4.873701298701299
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lionel",
                    "index": "#2",
                    "likes": "0",
                    "time": "12/03/2023-10:22:58",
                    "content": "MakerDAO, if they want to avoid enforcement, should act in a brief delay. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aleksandr",
                    "index": "#4",
                    "likes": "0",
                    "time": "12/03/2023-15:48:34",
                    "content": "Добрый день . Как вернуть деньги случайно отправленные на контракт ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaiSeller",
                    "index": "#5",
                    "likes": "0",
                    "time": "13/03/2023-05:29:38",
                    "content": "AHAHAHAHAHAHA is this thread not all the proof you need that DAI is just wrapped USDC at this point? good job “decentralized” governance! You have proven to be completely useless yet again ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.9375
                }
            ]
        }
    ]
}