{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/founder-and-ceo-of-off-shore-cryptocurrency-derivatives-platform-sentenced-for-violating-the-bank-secrecy-act/15328",
            "title": "Founder And CEO Of Off-Shore Cryptocurrency Derivatives Platform Sentenced For Violating The Bank Secrecy Act ",
            "index": 15328,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "legal",
                "regulation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#1",
                    "likes": "4",
                    "time": "23/05/2022-17:11:56",
                    "content": "Recently in the news, Damian Williams, the United States Attorney for the Southern District of New York, announced that Arthur Hayes was sentenced to six months of home detention, in connection with his violation of the Bank Secrecy Act (the “BSA”), through his willful failure to establish, implement, and maintain an anti-money laundering (“AML”) program at the cryptocurrency company he co-founded and owned, Bitcoin Mercantile Exchange or “BitMEX”. U.S. Attorney Damian Williams said:  “While building a cryptocurrency platform that profited him millions of dollars, Arthur Hayes willfully defied U.S. law that requires businesses to do their part to help in preventing crime and corruption.  He intentionally failed to implement and maintain even basic anti-money laundering policies, which allowed BitMEX to operate as a platform in the shadows of the financial markets. This Office will continue to vigorously enforce United States law intended to prevent money laundering through financial institutions, including cryptocurrency platforms.” BitMEX  had a U.S.-based operation and served thousands of U.S. customers, notwithstanding alleged false representations to the contrary by the company.  From at least September 2015, and continuing at least through the time of the Indictment in September 2020, Hayes willfully caused BitMEX to fail to establish and maintain an AML program, including a program for verifying the identify of BitMEX’s customers (a “KYC” program).   Allegedly, in May 2018, Hayes was notified of allegations that BitMEX was being used to launder the proceeds of a cryptocurrency hack but neither Hayes nor the company filed a suspicious activity report thereafter, nor did they implement an AML or KYC program in response. This is not a new case and really preceded Biden’s executive order as to crypto.    justice.gov – 20 May 22    Founder And CEO Of Off-Shore Cryptocurrency Derivatives Platform Sentenced...      ",
                    "links": [
                        "https://www.justice.gov/usao-sdny/pr/founder-and-ceo-shore-cryptocurrency-derivatives-platform-sentenced-violating-bank"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.297348484848485
                }
            ]
        }
    ]
}