{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-making-maker-fractionally-reserved-originally-posted-on-reddit/11103",
            "title": "[Discussion] Making Maker fractionally reserved (originally posted on Reddit) ",
            "index": 11103,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/samskiter",
                    "index": "#1",
                    "likes": "3",
                    "time": "19/10/2021-22:06:26",
                    "content": "I’ve been out of the Maker loop for a while now so excuse my ignorance (imagine I wrote “IIRC” in front of every sentence!) if anything here is out of date or just stupid, but here’s something I’ve been mulling over in the shower for a few months: Why a fractional reserve *might* be a good idea The TRIBE showed a clear appetite for a fractional reserved stable coin - just the stability mechanism didn’t work. And it now seems like they are proposing backing FEI with DAI… which seems… pointless. Well I had a look at MAKERs collateral stats and $3.5BN of $14.8BN TVL is other stable coins. Put another way: $3.5BN of $6.8BN total supply is backed by stable coins. 23% of Makers collateral is other stable coins and 51% of DAI is backed by stable coins. It does raise the question - is DAI truly an algorithmic stablecoin is 50% of it is ultimately backed by real dollars somewhere? The other point to add about all this stablecoin collateral is it has a constant cost on Maker/DAI - it all accrues interest through stability fees. I’ve posted before about viewing DAI governance as a PID (proportional, integral, derivative) problem. Through this lens you could see that over the long term, there is some stable “base” demand for DAI. The problem is the only control we have at the minute is the stability fee and we can’t push that negative to inflate the base supply of DAI. (A PID controller would push the lever negative to ‘integrate up’ the supply of DAI). As a result we’ll always have some cost in the system working against DAI… How fractional do you go? Following on from the idea of a ‘steady state’ demand for DAI I think there’s a less scary way to look at fractional reserves - not as some endless pool of money that we keep printing, but as something we can algorithmically control. I.e. we embrace PIR control and think about what is the integral term? i.e. “over the past 5 years, total DAI in circulation has never dropped below $2.3bn, so let’s aim to have $1bn unbacked DAI in circulation so we have some wiggle room”. I’m proposing that the proportion of unbacked DAI is controlled by governance votes and careful analysis of the historical demand for DAI. Options for a fractional reserve   Negative interest rates on loans - This is the most often talked and argued about system to decouple DAI from collateral. The problem is that the interest rate becomes both the stability mechanism AND the way we inflate or deflate how much DAI is fractionally owned. If we want to drastically change the amount that is fractionally held, we would have to drastically change the stability fee. Example: If the total DAI in circulation decreased and came close to some threshold, we would therefore want to decrease the unbacked DAI by increasing interest rates - this would bump up the price of DAI. Granted a decrease in DAI in circulation is probably due to a lower price - but with only one lever to pull we can only respond to EITHER price OR the fractionally backed amount at a time, not both.   Don’t destroy all repaid DAI - So here’s my shower thought - currently the DSR is funded by interest on loans. When you pay off your collateral debt, you pay the DAI you borrowed back, which is destroyed, plus a little extra. This DAI is sent to pay the DSR pool and any excess is used to buy and burn some MKR. Rather than destroying *all* the DAI when you repay, we could keep some back and either put into the DSR pool or use it to buy and burn MKR - this would create unbacked DAI. We can remove unbacked DAI by doing the opposite - destroy both the repaid DAI AND the stability fee. So now we have a new lever to pull - how much DAI is destroyed when repaying debt and how much is kept around. This allows control of the fractional reserver that is separate from the stability mechanism. The ultimate backstop is still MKR, which could be used to buy up any spare DAI (provided the market cap of MKR is kept above the total Unbacked DAI).   I know unbacked DAI/negative interest rates is a controversial topic - but genuinely up for civilised discussion about this  Originally posted on Reddit here: https://www.reddit.com/r/MakerDAO/comments/q8thdv/discussion_making_maker_fractionally_reserved_a/?utm_medium=android_app&utm_source=share ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-14th-october-21st/11135"
                    ],
                    "GPT-summary": "The author proposes the idea of a fractional reserve for MakerDAO's DAI stablecoin, arguing that it could be algorithmically controlled and used to stabilize the supply of DAI. The post discusses the potential benefits and drawbacks of this proposal, including the use of negative interest rates and the retention of repaid DAI. The post invites discussion and feedback on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.701907467532467
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#2",
                    "likes": "1",
                    "time": "20/10/2021-04:35:58",
                    "content": "Welcome to the forum! It certainly is an interesting and controversial topic. It might be a good idea to either add an informal poll to your post or a full blown signal request to get a better sense of how open the community is to this direction! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.571428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/samskiter",
                    "index": "#3",
                    "likes": "1",
                    "time": "20/10/2021-22:00:53",
                    "content": "Thanks! Don’t think this is really worthy of a vote yet, I’m just a punter looking to chat about ideas ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333332
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "3",
                    "time": "21/10/2021-16:38:07",
                    "content": "Welcome to the forums @samskiter     samskiter:  The problem is the only control we have at the minute is the stability fee and we can’t push that negative to inflate the base supply of DAI. (A PID controller would push the lever negative to ‘integrate up’ the supply of DAI). As a result we’ll always have some cost in the system working against DAI…   This has been discussed multiple times particularly last year.   When I find time I will link to old forum articles because there was a number of ways presented to ‘do negative rates’. Previous DAO Polling regarding minting ANY unbacked DAI was shot down so hard it wasn’t funny.  The no on this signal was probably one of the strongest I have ever seen from MakerDAO. Put simply MakerDAO politically has zero appetite for minting unbacked DAI or doing anything like fractional reserves.  This was all brought up in relation to problems with DAI PEG being consistently high btw and is what caused the USDC/DAI PSM to be brought on-line and why now there is so much USDC in the protocol So no - MakerDAO will NOT be doing ‘fractional reserves’. I have countered with an idea that some people don’t want to even try which one can do in multiple ways that can achieve negative rates and allow for Maker to compete in the LP farming space (and is created to be sustainable long term)! Conceptually one could use MKR to reward vault holders.  Or if you want to decouple the rewards from MKR just issue another MKR-R token which is coupled to some fractional % R of the MKR burn (i.e. take R% of MKR purchased and use it to re-purchase MKR-R).   In this way since the rewards token should get some actual value one can use the rewards token value to achieve negative rates.   Reward particular vault deposits, as well as have a reward component to DAI borrow, or whether CR is above a certain value, etc. A MKR-R token allows governance to explore other governance options, brings new people into Maker and Maker governance, and most likely creates a coin of new value to Maker with significant value, without formally diluting existing MKR. We don’t have to go to fractional reserves, Maker just has to be willing to use rewards via a second token to increase growth in deposits and particularly in borrow across all vaults. There are more issues here to consider as well regarding Impossible Trinity that I brought up as the maker trilemma.     Maker Trilemma - PEG, Decentralization, DAI 1:1 collateral backing - USDC Discussion Proposal Ideas       Decentralization is lack of capital controls  IMHO the entire issue is completely anomalous in the context of the 21st century. Generally a financial institution would have places to deploy its capital safely. Here, exclusively because of the delays in onboarding RWA, Maker cannot achieve a proper balance sheet and has to resort to extreme measures. I am fully dedicated to making sure the onboarding comes sooner rather than later.     The real reason why there is so much stablecoin in the protocol is because Maker rates are still not normalized against rates of return available elsewhere in DeFI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2044052879990375
                }
            ]
        }
    ]
}