{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/call-for-grant-applications-the-relationship-between-daos-and-their-intangible-assets-and-ip/16709",
            "title": "Call for grant applications - the relationship between DAOs and their intangible assets and IP ",
            "index": 16709,
            "category": [
                "Core Units",
                "Dai Foundation"
            ],
            "tags": [
                "daif-001",
                "grant"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#1",
                    "likes": "6",
                    "time": "20/07/2022-08:26:25",
                    "content": " Call for grant applications - the relationship between DAOs and their intangible assets and IP  Grant theme Dai Foundation hereby call for grant applications to produce a scientific/discussion paper that analyzes different ways DAOs handle their intangible asset and intellectual property and discusses different ways the relationship between DAOs and their assets can evolve.  Grant amount The grant amount is up to $15,000 DAI. It can be granted to one project, but we are also interested in supporting several smaller projects that deliver on the same theme.  Documentation of planned project In case the grant is split between several projects the amounts granted will be relatively small, and application does thus not need very elaborate documentation as long as the following points are covered:  What is the envisioned deliverable? The planned synopsis for the paper or what needs researching before the synopsis can be determined The process that will used to produce the paper and a timeline Include a budget describing how the amount applied for will be used, and suggested payment milestones   Application deadline The Dai Foundation board will continuously assess applications received until the end of 2022 or until the grant amount has been allocated. The Dai Foundation will continue to provide for grants after the deadline in line with its foundation principles, but will change themes as the ecosystem evolves.  Further information For information on where to send the application, evaluation criteria and mandatory information in the application see the Dai Foundation Grant Policy. ",
                    "links": [
                        "https://forum.makerdao.com/t/daif-cu-update-q3-2022/18211",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-junio-del-2022/16923",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-14-20-de-julio-del-2022/16911",
                        "https://forum.makerdao.com/t/governance-and-risk-200-thursday-july-21-at-17-00-utc/16736/3",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-june-2022/16783",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/6"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.410714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#2",
                    "likes": "1",
                    "time": "20/07/2022-15:50:43",
                    "content": "Is 15k sufficient to attract the skilled legal minds needed to do a solid job? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#3",
                    "likes": "1",
                    "time": "20/07/2022-16:29:05",
                    "content": "Hi @Eumenes My own expectation is that this grant can produce deliverables that help broaden the understanding of the IP issues DAOs face and potential ways to solve them. Our call should not be read as an RFP for the ultimate bible on this topic, but a grant to build and disperse pieces of knowledge. This grant may or may not cover what a legal services provider would charge professionally for a specific commissioned task. We will see what kind of applications we receive. One could look at it as compensation to help the author(s) create a product in an area where they have personal interest. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#4",
                    "likes": "0",
                    "time": "20/07/2022-16:33:01",
                    "content": "I’m very happy to see we’re directing efforts in this direction, I’m concerned with the current status quo, specially in the area of Software Development. We have several Core Units working in several software (being Smart Contracts, Dashboards or Tools); since payment for their work is coming from the protocol, it is natural to think that MakerDAO should be the owner of any work produced by them; but I’m not sure how we could accomplish this, this should be one of the topics addressed during this research. Firstly, given the nature of a DAO, we should ensure that the software built by our CUs is open source, and that developers being paid by the CU waive their moral rights in any work created under it. I could be wrong, but probably some of the work being developed at this moment by some CU belongs to it (or its legal representation, if there’s any); this means that these CU could be removed from the protocol, and they could demand their right to protect the software they created, which means that the money the DAO invested to maintain these CU was thrown away. There’s also the topic on when this IP is transferred to the DAO (or the entity representing it for these matters). While a CU is working on a piece of software, even while being paid, there are cases in which this development is hidden (is not even in public repositories), and I’ve seen cases of denial to access this code. This shouldn’t be a case for a DAO, and facilitators should always guarantee transparency to any work produced (even if it is not ready). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.414021164021165
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#5",
                    "likes": "1",
                    "time": "20/07/2022-17:06:05",
                    "content": "I hope this works!  its a key issue Have you had good results with this approach historically? In my experience, I have often found that cutting edge innovative lawyers tend to be rather in demand and pricey. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ClausClowes",
                    "index": "#6",
                    "likes": "1",
                    "time": "20/07/2022-18:20:16",
                    "content": "Hi @sorenpeter I’m definitely interested in applying for this project! I’ll put something together towards that end.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "18/10/2022-08:26:49",
                    "content": "This topic was automatically closed after 90 days. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09090909090909
                }
            ]
        }
    ]
}