{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dai-usdc-largest-pair-in-uniswap/16746",
            "title": "DAI/USDC Largest pair in Uniswap ",
            "index": 16746,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "usdc",
                "dai",
                "uniswap-v3"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#1",
                    "likes": "9",
                    "time": "21/07/2022-15:50:48",
                    "content": " image1920×484 48.2 KB  Currently, DAI/USDC is the largest currency pair in Uniswap and not only that DAI is the second most liquid currency behind only USDC. This is great news considering our liquidity compared to other stablecoins such as USDT. It would be interesting to know what is the reason for this trend of DAI deposit in Uniswap. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.637499999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#2",
                    "likes": "6",
                    "time": "21/07/2022-16:06:03",
                    "content": "Makes sense given the rapid decline in prices that there has been a massive flight to safety pools and reducing IP risk is a main concern. Out of the top 10 coins by volume four are stablecoins and out of the top 10 pools by TVL five are stablecoin pairs, that should provide insight into the kind of current market risk appetite.  Screenshot_20220721-115956_Chrome1080×2320 133 KB  This graph is really interesting, volume has been pretty stable even as asset prices have rapidly decline. IMO this means that market participants are bullish crypto even though speculative trading might be on the decline, economic activity in ETH remains strong.  Screenshot_20220721-120404_Chrome1080×1070 96 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.574999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#3",
                    "likes": "1",
                    "time": "21/07/2022-17:54:33",
                    "content": " It would be interesting to know what is the reason for this trend of DAI deposit in Uniswap.  Users are already aware of the security and reliability of Dai over other Defi stables. Dai is an example that you can achieve a lot with little, you don’t need to have a lot to achieve a lot, even though USDT is 9.4 times bigger than Dai. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "1",
                    "time": "21/07/2022-19:35:38",
                    "content": "    TRUEMAKER:  This graph is really interesting, volume has been pretty stable even as asset prices have rapidly decline. IMO this means that market participants are bullish crypto even though speculative trading might be on the decline, economic activity in ETH remains strong.   I feel it may be because capital is being more “analytical” when buying certain cryptos, this is normal in bear markets. I am not surprised in what is for me the “Stablecoin Summer” in which we will undoubtedly be with the next participants in the ecosystem, it would be interesting to see how the movement would be. For now DAI and USDC are the favorite stablecoins to open a Liquidity pair against another stablecoin or another crypto and that gives us certainty between the lines of what the market is looking for. USDT basically does not have its market in the DEFI sector, it is traded more in centralized exchanges or by TRON. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4221611721611715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#5",
                    "likes": "2",
                    "time": "21/07/2022-19:49:32",
                    "content": "1.4B are supplied just by our GUNI-vaults:   so, almost everything  if this metric would be important, we could just drop SFs to 0% (they are already at 0.01% or 0.05%) to boost this even more. I personally don’t think this makes a lot of sense… ",
                    "links": [
                        "https://makerburn.com/#/collateral/guniv3daiusdc1_a",
                        "https://makerburn.com/#/collateral/guniv3daiusdc2_a"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#6",
                    "likes": "0",
                    "time": "21/07/2022-20:04:48",
                    "content": "Maker unfortunately does not survive on good deeds. It would be different if it were in the PSM, which could be beneficial, but at the vault I don’t think so. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#7",
                    "likes": "1",
                    "time": "21/07/2022-20:09:18",
                    "content": " we can totally control this. if we increase the SF to make 50x leverage not profitable, this will unwind USDC in PSM is generating no yield for the protocol right now, the GUNI vaults are effectively moving USDC from PSM to uniswap (which creates a tiny bit of revenue for the protocol). in any case, USDC risk is already lethal(*)  (*) if you are worried about it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.154761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fishy",
                    "index": "#8",
                    "likes": "0",
                    "time": "22/07/2022-10:36:38",
                    "content": "I think there’s a strong argument to be made that allowing others to reap valuable LP fees for little to no gain for MakerDAO is a poor use of DAI. Moving a significant amount of USDC from the PSM to Protocol-owned DAI/USDC 1bps LP on Uni v3 could help to make acquiring DAI easier for small users, while bringing increased revenue for the protocol. While lending DAI may technically be safer than protocol-owned liquidity, the risk of USDC falling to partial collateralization is likely far lower than it falling to no collateralization (which lending does not save us from). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.983796296296296
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#9",
                    "likes": "2",
                    "time": "22/07/2022-10:52:25",
                    "content": "unfortunately the expected revenue is not that big - looking at the fees of both pools: 0.05% and 0.01%. huge opportunity costs ",
                    "links": [
                        "https://info.uniswap.org/#/pools/0x5777d92f208679db4b9778590fa3cab3ac9e2168"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fishy",
                    "index": "#10",
                    "likes": "1",
                    "time": "22/07/2022-11:02:15",
                    "content": "Assuming an average fee of 2.5k/d or 912.5k per year (a conservative estimate based on the Uniswap 1bps chart), the DAO loses out on roughly 812.5k/y per billion DAI lending rather than LPing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#11",
                    "likes": "1",
                    "time": "22/07/2022-18:45:27",
                    "content": "Took a quick look at fees collected on Optimism over the last week, and it’s pretty underwhelming. Worth noting, that this aggregates volume from both fee tiers, but most of that goes through the 0.01% pool regardless. Definitely great to see volume picking up, but echoing @ultraschuppi and @fishy - the DAO’s missing out on north of $1M/yr by lending. Something to keep an eye on as L2s flesh out for sure.    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.552083333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#12",
                    "likes": "1",
                    "time": "22/07/2022-18:47:07",
                    "content": "I understand that Velodrome is taking most of the stable liquidity in Optimism. I do not know if this is true, I have not validated it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#13",
                    "likes": "0",
                    "time": "28/07/2022-18:30:30",
                    "content": "Good call on that one; stable volume on Velodrome was strong last week! Another potential source of rev if those fees keep trending up.        ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666666
                }
            ]
        }
    ]
}