{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-in-the-next-few-weeks-months-parallelism/294",
            "title": "Governance in the next few weeks/months: Parallelism? ",
            "index": 294,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "alignment"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#1",
                    "likes": "3",
                    "time": "23/08/2019-07:57:54",
                    "content": "It’s great to feel that MCD is finally very close to release. Rich has explained very well in his answers that there is a strong need for urgency in the governance steps the Maker community need to follow. And nobody here wants to delay the release of MCD. At the same time, some people (see excellent posts of LongForWisdom for an overview) feel that this accelerated rhythm is hard to follow: just one week for discussion and one week for vote, it’s not really enough to let emerge ideas, sentiments, alternatives, to educate people and help them vote, etc. It somehow feels like: “Please vote (fast!) YES for this. Thank you.”. We could spend time and energy saying things like: “damn! We should have started earlier then!”. But this is, as Rich called it, a “metaphysical” way to approach a problem. And I agree. Let’s be concrete and deal with the current needs. I have a very simple suggestion to push forward. This is not at all perfect (see advantages and disadvantanges below) but I’d be interesting in hearing your thoughts. My suggestion:  Rather than presenting one question/mandate/poll/vote at the time, each to be digested in about 2-3 weeks, let’s put them in parallel as much as possible. What I mean is that we should trust the MKR community to be able to discuss multiple things at the same time. Suppose there are 3 topics to vote on, T1, T2 and T3. Each requiring about 2 weeks in the current model (2 weeks x 3 = 6 weeks under optimal circumstances). I suggest we present T1, T2 and T3 all at the same time and give all of them a window of discussion/vote of 6 weeks. Advantages:   If somebody is not available for a couple of weeks (maybe holidays, maybe a short disease, maybe work duties) He can still catch up and don’t miss on a specific topic.   If someone is not interested (e.g., He does not have the competences) in studying/evaluating T1 and T2, they can invest 6 full weeks on understanding, discussing, explaining to others the topic T3. Maybe this work will help other people who didn’t have enough time/competences to digest topic T3!   Others?   Disadvantages:   Having too many topics in parallel could create some noise. Maybe one “cool” topic will set shadows on other less exciting topics which will get kind of ignored.   Having one topic at the time ensures greater control. If one topics does not progress well, there will be a delay of 4-5 days, maybe even 10! But the damage is under control. If instead T1+T2+T3 do not progress well, there will be a potentially long delay at the end of the 6 weeks.   Others?   ",
                    "links": [],
                    "GPT-summary": "The author proposes a solution to the issue of the accelerated rhythm of governance steps for the Maker community. The proposal suggests presenting multiple topics to vote on at the same time, each with a window of discussion/vote of 6 weeks. The advantages and disadvantages of this proposal are discussed. The post also mentions the need for urgency in governance steps and the difficulty of following the current accelerated rhythm.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.7972222222222225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#2",
                    "likes": "0",
                    "time": "23/08/2019-20:05:25",
                    "content": " I doubt (scheduled) proposals are already finished, so they can’t really post it in advance. My guess is that boostrapping schedule is already internalized by the teams as their deadlines. I def. agree that if any of the proposals are finished earlier, they should be posted immediately. the only effect of your proposal might be postponing polling: not that this is bad by itself, but it would in effect probably delay mcd even more. We also should not assume (as 100p certain) all proposals will get confirmed. i would ‘vote on this forum’ for shifting on chain polling for at least 1 week  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.196428571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "0",
                    "time": "26/08/2019-10:26:35",
                    "content": "I agree parallelism would maybe be more efficient in this case, but I think I would aim to avoid releasing everything at once, the docs are already overwhelming, having 6 or 7 the size of the facilitator or risk docs in a single day would be too much. Personally I would have liked a system where they were released one a week, but we vote on all of them after six weeks. The most important/longest documents could have been released first to get the most scrutiny, while less important and smaller docs could have been pushed to later. On a meta note, I am a huge fan of listing advantages and disadvantages to ideas/proposals when they are suggested. So props for doing that, I think it’s useful. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.325680272108843
                }
            ]
        }
    ]
}