{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/outstanding-dai-is-now-above-90mm/62",
            "title": "Outstanding DAI is now above 90mm ",
            "index": 62,
            "category": [
                "Governance"
            ],
            "tags": [
                "debt-ceiling"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "1",
                    "time": "01/07/2019-17:09:49",
                    "content": "With an unknown MCD launch date, more DAI being minted (even with an elevated SF), we are starting to push closer to the debt ceiling. Arguments for it… would be that we don’t want to make it too much higher… (e.g. not 150mm)… as the higher we allow it to be the more possible risk we take of a whale minting a large amount of DAI to market sell on the market… estimating that it will take 2-3 weeks of discussions before a vote is implemented… at the pace DAI has been minted it would theoretically be at 97mm area… which is somewhat tight… supply and demand are getting closer by the day… and if demand exceeds the supply the price will be pushed up… the only way to let off the price pressure would to encourage more supply… (via a rate cut)… .if we do a rate cut, more supply … and we are / would be close to the ceiling… (note: if the underlying collateral starts a bull run an unknown amount of DAI will be minted for leverage) so we need something more than 100… normally 110 would be fine… but if the scenario plays out as listed above, we might get extra DAI we were not planning… so leaving an additional buffer above that. I do not see a downside to increasing the debt ceiling at this point. ",
                    "links": [],
                    "GPT-summary": "The author of the post is explaining the need to increase the debt ceiling for DAI due to the increasing demand and potential risks of a whale minting a large amount of DAI. The post also mentions the possibility of a rate cut to encourage more supply. A 3rd party could give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.9035714285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "01/07/2019-17:56:09",
                    "content": "We are seeing a surge in Dai supply recently. I agree we should raise the debt ceiling, the only question in my mind is how much. I also think that we should do this sooner rather than later. As in have a poll this week or next week at the latest. We don’t really have a framework for calculating a safe/ideal debt ceiling based on the collateral risk yet, so seems like we should just eyeball it. Here are the trade-offs I’ve managed to come up with. Significant increase (to 150-200 mil) + We shouldn’t have to revisit the debt ceiling before MCD hits. - More value at risk in the case of a catastrophic failure of the system. - Puts the peg in danger in the event of a significant sustained bull-run that prompts mass-printing of Dai of to the new limit. Moderate Increase (to 110-120mil) + Less value at risk in the event of catastrophic failure. + Puts the peg in less danger in the event of a significant sustained bull-run that prompts mass-printing of Dai. - Increased likelihood of having to revisit the debt-ceiling if we get close again. Personally I like the idea of a significant increase, despite the risks. In the event of a massive bull-run we should be able to disincentivize solely using the stability rate (even if this means a large hike). If Dai continues to be minted at the current rate, this is going to come up again in two months or so. I’d rather kick the can further than two months down the road. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.525685425685426
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#3",
                    "likes": "1",
                    "time": "01/07/2019-18:28:08",
                    "content": "I would argue that revisiting debt-ceiling is not a “big minus”, IF polling improvements (multiple polls) are available. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "01/07/2019-18:55:51",
                    "content": "Multiple polls does make it less expensive, but not by much. The problem is more the time spent discussing and forming consensus. If this comes up again, how much time is spent deciding how much to up the ceiling by next time? Perhaps we can take a compromise route, and decide something permanent now that commits us to actions in the future without discussion, such as: ‘Until MCD is launched we will increase the debt ceiling by 20mil if the current Dai Supply gets within 10mil of the current ceiling.’ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#5",
                    "likes": "0",
                    "time": "01/07/2019-19:11:55",
                    "content": "Yes, I believe something like that was already proposed on the chat. Increase ceiling to limit X, but also propose threshold Y (less than X) which triggers/signals that ceiling discussion should be started. I don’t have strong convictions regarding ceiling limit, except maybe that 110m is too low. I probably would vote for anything between 120m-150m. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.444444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#6",
                    "likes": "0",
                    "time": "01/07/2019-19:42:56",
                    "content": "Is there some history on how CDP activity impacted liquidity during previous price decreases and/or some analysis on how it would fare in a reasonably bad scenario at different debt ceiling levels? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 3.5555555555555562
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#7",
                    "likes": "0",
                    "time": "02/07/2019-04:47:12",
                    "content": "Paging @Vishesh. Do you have some science you can drop here? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#8",
                    "likes": "0",
                    "time": "05/07/2019-14:03:32",
                    "content": "the recent SF increase may have bought us some time. even after the increase I still believe we should increase to $120mm. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "0",
                    "time": "05/07/2019-17:47:51",
                    "content": "I agree that we still need to take action here, is it worth putting up a signalling (forum) poll to try and get a rough consensus for the path forwards? I don’t get the feeling that there is lots of disagreement on this subject, but it would be good to be able to point to a number and say ‘x people want this.’ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.111111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#10",
                    "likes": "0",
                    "time": "05/07/2019-17:59:18",
                    "content": "any signal at this stage is useful. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "1",
                    "time": "05/07/2019-18:56:19",
                    "content": "Polls are pretty easy to add. Use the ‘options’ cog on the bar above where you type your reply. Some details here on proposed formatting and such, doesn’t seem to have anyone actively disagreeing: Meta Governance: Signal Requests Don’t have time to write one up right now, so if no one gets to it before I next find time, I’ll set one going. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.596938775510204
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#12",
                    "likes": "1",
                    "time": "05/07/2019-22:53:57",
                    "content": "The poll was put up by @tbone here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}