{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/stablecoin-for-nigeria/7720",
            "title": "Stablecoin for Nigeria ",
            "index": 7720,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "stablecoin"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/nathanwindsor",
                    "index": "#1",
                    "likes": "4",
                    "time": "29/04/2021-03:15:21",
                    "content": "Hi All- I’d like to understand a little about stablecoin design when it comes to building solutions for countries in Africa where Crypto<>Fiat conversions are prohibited. Could I have any suggestions from the Maker community? While it is important for them to get them an actual bank account, our group would like to help them leapfrog into DeFi where they can: 1.) get better rates for keeping their tokens staked (similar to yEarn/Celsius). 2.) Get access to better loans from DeFi platforms 3.) Build credit I’m thinking about designing a system where a company has a bank account to serve their users and uses the collective company assets in that bank account to create a stablecoin. This company would have to burn/mint tokens to keep the ratio of tokens/cash the same at the end of the week/month. I’m not sure it needs to be algorithmically managed, though I’m not opposed to it being built like a MKR/DAI approach, but I do not want to build it on Ether, I want to build it on Avalanche (AVAX). I’m Nathan Windsor, CEO fo Volta Inc, we’re building products in the DeFi space, I’d be glad to chat. Thank you Nathan ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#2",
                    "likes": "4",
                    "time": "29/04/2021-03:40:51",
                    "content": "Hi Nate! Long time no speak  First of all, there’s a few Dai ambassadors on the ground there that you should talk to. @Sahabia is in the region, for one. To answer your question, it seems like the key is in developing cash on/off-ramps that use the existing savings infrastructure. It’s not easy to do as you have certain technological limitations to overcome, but I think this could be our next big market. You should also speak with the Growth Core Unit to see if there’s a way to align initiatives. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.998511904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nathanwindsor",
                    "index": "#3",
                    "likes": "2",
                    "time": "29/04/2021-03:46:23",
                    "content": "Agreed, glad to see you. The existing savings infrastructure is only cash. Our problem is that currently, you cannot go from crypto to cash as their gov just basically banned it. We’d have to create a system that doesn’t allow cashing out, but somehow allows the users to access the benefits of DeFi. @Sahabia, let’s chat sometime. N ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#4",
                    "likes": "2",
                    "time": "29/04/2021-04:04:15",
                    "content": "If cashing out is banned, do we expect DAI to still be used as a mode of payment in Nigeria but just permanently disconnected from the regular cash/banking ecosystem? This seems like a difficult situation where people need to be convinced that the one-way bridge from cash to crypto is still worth crossing. Interestingly, your ideas will probably apply to a few other countries too, where the government wants to try and enforce similar bans. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.109375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nathanwindsor",
                    "index": "#5",
                    "likes": "1",
                    "time": "29/04/2021-21:10:11",
                    "content": "The current idea we have is to onboard our users into a managed bank account where all our users’ funds are put into an account owned by the company (or the company has some access to). My thought is that if the company has a managed account, they can use those assets to issue tokens based on those assets. From my understanding, if crypto<>fiat is banned, I’m not sure what other solution is available. Thoughts? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.03125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#6",
                    "likes": "1",
                    "time": "30/04/2021-04:38:05",
                    "content": "When you say tokens based on those assets, you’re saying basically DAI right? Or did you mean your own token? If you meant your own token, I’d be worried. There’s not much stopping you from taking their cash and running away and legal recourse is not available precisely because your service is designed to circumvent a law. I’m gonna assume you mean you’ll send DAI to your customers in return for cash in this paragaph. Here, it wasn’t clear if cash → crypto is also banned yet but if not, there’s no reason to use your company to buy crypto. You’d just be providing them a service to sell DAI and get cash. If you can achieve this, it’s pretty neat. I imagine you’d have an overseas account that sells DAI for cash and then uses traditional banking to transfer that cash into a Nigerian account. Of course, if the government does ban cash → crypto as well, then your service would work in reverse too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.629464285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sahabia",
                    "index": "#7",
                    "likes": "1",
                    "time": "06/05/2021-06:21:52",
                    "content": "Hey @nathanwindsor I think your idea is good. But i can’t imagine the possibility of that now. I will like to talk more on that with you and if there is anything I can contribute, I will love to do. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TalkSpotNigeria",
                    "index": "#8",
                    "likes": "2",
                    "time": "02/06/2021-08:27:50",
                    "content": "Hello Mr. Sahabia, I’m a user researcher, blockchain enthusiast and advocate from Nigeria, I will love us to work on a proposal for Africa regarding the blockchain technology. @nathanwindsor can as well key on this open source infrastructure i’m proposing. i can be reached at [email protected] ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#9",
                    "likes": "3",
                    "time": "02/06/2021-11:42:40",
                    "content": "    nathanwindsor:  From my understanding, if crypto<>fiat is banned, I’m not sure what other solution is available. Thoughts?   There’s this South-American country that’s been looking for solutions for years. The result is a spread.  Blue Dollar AKA Dolar Blue or unofficial dollar is parallel dollar rate of USD in Argentina. This is the cost of buying and selling a physical dollar bill in a cueva, or clandestine financial house in Buenos Aires. https://bluedollar.net/  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.015625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#10",
                    "likes": "1",
                    "time": "02/06/2021-15:18:50",
                    "content": "The other possible solution is P2P trading where you have verified merchants with your accounts and only you would handle fiat money. This is very common in Latin countries. In Venezuela the country where I live cryptocurrencies are legal but there are many obstacles and you can not buy cryptocurrencies directly like Nigeria we resort to the p2p market. For example here is very famous p2p services such as Binance, LocalBitcoins, Remitano, among others, we have the highest volumes of trade through these platforms. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.464256198347107
                }
            ]
        }
    ]
}