{
    "poll_list": [
        {
            "title": "Ratification Poll for Supplement to Collateral Onboarding Application (MIP6c3-SP1) - November 8, 2021",
            "index": "10433",
            "option": "Yes",
            "supporting_mkr": "71,697",
            "highest_fraction": 0.97
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip6c3-sp1-rwa-only-supplement-to-collateral-onboarding-application/10433",
            "title": "MIP6c3-SP1: (RWA Only) Supplement to Collateral Onboarding Application ",
            "index": 10433,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#1",
                    "likes": "13",
                    "time": "22/09/2021-12:44:04",
                    "content": " MIP6c3-SP1: (RWA Only) Supplement to Collateral Onboarding Application  Preamble MIP6c3-SP: 1 Title: RWA Only Supplement to Collateral Onboarding Application Author(s): Christian Petersen (@christiancdpetersen) Contributors: @sebventures, @williamr, @e_rapp Tags: Status: Accepted Date Proposed: 2021-09-22 Date Ratified: 2021-11-22   Specification  Motivation Today the MIP6 application is not specifically geared for the requirements of real-world asset (RWA) collateral onboarding and review. This proposal to supplement the MIP6 application for RWA only is intended to enhance the onboarding applications and facilitate the onboarding process. A MIP6 application supplement for RWA will facilitate the process as applicants will be required to provide RWA specific information at a higher level of detail than at present. This MIP6 application supplement is the result of learnings gained over the last 12 months of the RWA program.  List of Changes to Application Questions The following questions to be added to RWA collateral onboarding applications only:   Provide (a) proposed legal structure for transaction including, type of legal entities, (offshore/onshore, form (trust, corporate, other)) and jurisdiction(s) of legal entities, and (b) likely funds flow (DAI => Fiat => DAI).   Provide details on the organizational structure of the interested party, beneficial ownership, governance/control, key personnel, capital/funding resources and past financial performance.   Provide detailed summary of the proposed economic terms of the transaction, including, without limitation, commitment term, principal amount, interest rate, frequency of principal and interest payments, disbursement schedule, equity amount, funding ratios (equity/debt pro rata, equity first, etc.), collateral security, coverage ratios, currency (if not DAI) and other material terms. The quality of the proposed economic terms will be a consideration for the prioritization process.   Identify in reasonable detail the risks associated with this collateral application and the underlying asset(s) and proposed mitigants (if any). The risk summary should address, without limitation and to the extent relevant, market risks, commercial risks (e.g., diversification, credit, etc.), interest rate risks, legal and regulatory risks, general industry risks, competition, etc.   Outline the applicant’s underwriting guidelines/policies, origination strategy (marketing, sales, channels), servicing strategy (charge-offs, collections) and historical asset performance.   Outline the applicant’s risk monitoring and operations guidelines/policies (e.g. charge-offs, collection, recovery provisions, data collection and technology, etc).   Describe the regulatory regime applicable to the underlying asset (if any) and the applicant’s legal and compliance program relating thereto.   Identify any 3rd party persons likely to be relied upon by applicant to implement the transaction (legal, accounting, servicers, trustees, etc.).   ",
                    "links": [
                        "https://forum.makerdao.com/t/ultraschuppi-delegate-platform/11193/12",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/ultraschuppi-delegate-platform/11193/10",
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-70-en-espanol/11569",
                        "https://forum.makerdao.com/t/maker-relay-ep-70/11528",
                        "https://forum.makerdao.com/t/weekly-mips-update-60/11347",
                        "https://forum.makerdao.com/t/weekly-mips-update-59/11186",
                        "https://forum.makerdao.com/t/weekly-mips-update-58/11074",
                        "https://forum.makerdao.com/t/weekly-mips-update-57/10921",
                        "https://forum.makerdao.com/t/real-world-finance-core-unit-report-2021-09/10825",
                        "https://forum.makerdao.com/t/weekly-mips-update-56/10691",
                        "https://forum.makerdao.com/t/maker-relay-ep-64-en-espanol/10548",
                        "https://forum.makerdao.com/t/maker-relay-ep-64/10540",
                        "https://forum.makerdao.com/t/weekly-mips-update-55/10539"
                    ],
                    "GPT-summary": "The post is a proposal for a supplement to the MIP6 application for real-world asset (RWA) collateral onboarding. The proposal aims to enhance the onboarding process by requiring RWA-specific information at a higher level of detail. The post lists the changes to the application questions and provides a brief explanation of each. The proposal is authored by Christian Petersen and has been accepted. A 3rd party could give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.184210526315789
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "22/09/2021-13:05:03",
                    "content": "Much needed! Thank you RWA contributors & Christian ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                }
            ]
        }
    ],
    "group_index": "117"
}