{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/poll-discussion-voices-of-mkr-progressions/6456",
            "title": "[Poll & Discussion] Voices of MKR Progressions ",
            "index": 6456,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "signaling"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#1",
                    "likes": "3",
                    "time": "09/02/2021-15:46:23",
                    "content": "I’ve completed CDIPs 30 & 40 to produce four pilot episodes for the Voices of MKR podcast and am seeking feedback on how to progress with this project. Any feedback or discussion of relevant topics or ideas would be appreciated. The episodes are available on the MakerDAO youtube channel and Anchor.FM. One of the major benefits of Anchor is it allows us to upload content to Spotify, Google Podcasts, Breaker, Pocket Casts, and RadioPublic for free from a single platform. Overall, we averaged (per episode) 38 views on YouTube, and 11 listeners on Anchor.FM. This is a good start for a new podcast but we need help optimizing the content! I’d love your feedback in order to help me decide best the appropriate direction(s) to take this project in. We’re currently producing an audio version of Maker Relay to provide a weekly, ten-minute update on governance. Do you find audio updates helpful? Would you prefer more evergreen content? What would you like to see? Please share your feedback using the polls and commenting below.    Do you find it useful to have the Relay in an audio format?  Yes No Abstain     0 voters        Which would you prefer to listen to?  Governance updates Educational Content Both Neither     0 voters        What other types of content would you like to see in audio or visual format?  Deep Dives into MIPs Deep Dives into Signal Requests How-to Info (voting on-chain, creating a vault, etc) Dives into Collateral Types (existing and potential) Edited call recordings that pinpoint informative conversations Something else (and it’s in the comments)     0 voters     Some feedback I would specifically like to target includes (but is not limited to);  What type of information feels a bit weird in this format, as a listener? Would it be helpful to create more concise updates (5 mins or less, opposed to 10), with separate dives into some of what those updates mean? ( example: descriptions about what the DC-IAM is, or why core units have been proposed etc…) Are there community members who may be interested in finding ways to collaborate & create more visually involved content? Are there community members who would like to collaborate to create in-depth, evergreen, auditory (or visual) content, based on their area of expertise within the protocol?  ",
                    "links": [
                        "https://www.youtube.com/playlist?list=PLLzkWCj8ywWPolnUhRn_HWeZJX35PuT53",
                        "https://anchor.fm/voicesofmkr",
                        "https://open.spotify.com/show/2oQkhWmMhbfARAjJBdhcgt",
                        "https://www.google.com/podcasts?feed=aHR0cHM6Ly9hbmNob3IuZm0vcy80NDQ2MTA2MC9wb2RjYXN0L3Jzcw==",
                        "https://www.breaker.audio/voices-of-makerdao",
                        "https://pca.st/d7yy3iks",
                        "https://radiopublic.com/voices-of-makerdao-Wxvm2O"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9021086440441275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "09/02/2021-18:13:26",
                    "content": "Visually I think showing the Maker Relay “newsletter” would be helpful. I like the way David does it on the Community Call. But showing a visual of the rates, votes, MIPS, proposals, would be super cool. Especially for youtube. I have not listen to the podcast version of spotify/anchor. Also, maybe you can add a “snippet” of an audio comment by a MIPS author? Maybe I am asking for too much. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.736111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Uncle",
                    "index": "#3",
                    "likes": "1",
                    "time": "09/02/2021-22:06:13",
                    "content": "I’ve thought about this a lot.  Maker more than any protocol requires a news outlet.  I feel like there should be a core set of episodes just to bring people up to speed, and then branch off into new MIPs and news topics.  Maily, I’d like to hear discussion on what the MIPs mean for Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.539772727272727
                }
            ]
        }
    ]
}