{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/sagittarius-engine/10852",
            "title": "Sagittarius Engine ",
            "index": 10852,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "tokenomics"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "36",
                    "time": "07/10/2021-23:12:14",
                    "content": " Sagittarius Tokenomics Engine design document  CVB09QiudYJOktOccw34ZsRsuJ8jAZElUlOi0Y9sP5U5AzshY8FeLfv1PiStCZLrwN5xd5aBYVTH7mOPS0WwQKPE78ljM5rh_JEOslPj-RCb_EuYZewyEE9PyhhVWfL-bCZ0RzRN=s01200×800 195 KB   I think the verdict is in both from this thread and from various private conversations: this first iteration of a tokenomics redesign isn’t exciting enough to average MKR holders. MKR holders don’t want to borrow money, they want to get money. The most crucial aspect of a tokenomics system is that it is appealing and exciting to be a part of - so I’ve now started to design a v2 proposal that incorporates the feedback I’ve received. The main goal will be to provide a high real APY (of money you get, not borrow) for locking up MKR long term.  Overview MakerDAO first introduced smart contract based tokenomics with token burn in the original Single Collateral Dai protocol in 2017. Since then, there have been numerous breakthroughs in the DeFi industry related to tokenomics, including concepts such as yield farming and rewards based on staking or locking. Notable projects that have innovated and showcased the raw power of tokenomics are Sushiswap, Curve and OlympusDAO. Now that the Maker protocol is feature complete and ready to enter a new phase of scaling, it is the right time to revisit tokenomics and implement something that properly taps into this power. I’m proposing something specific with the Sagittarius Engine, but before I get into that I think the most important thing to emphasize is that we should take this opportunity to rethink and reconsider how we can upgrade the tokenomics of Maker and learn from the innovation in the rest of DeFi. There is no better cause than climate action to direct the atomic bomb of financial gamification towards. We should not hold back on considering the most powerful forms of tokenomics that are working elsewhere in the ecosystem, that can maximize our growth and ability to have an impact on the world. My own ambitious proposal may just be inspiration for the community to come up with something even more powerful. The goal of the Sagittarius Engine is to better direct the value flows of the Maker Protocol towards long term governance participants - the core of MKR holders that participate based on genuine interest in the project and its potential. In particular, a key goal is to help provide the push it takes to get a passive MKR holder to begin participating, by e.g. participating in sourcecred on the forum. By empowering the old guard and drawing newcomers into the core of the community, all other stakeholders will also see indirect benefits, including traders and end users, because the overall quality and value of the project depends on the core community members and good governance. Additionally, the Sagittarius Engine also has a powerful “burn-like” effect as it locks up and remove large amounts of MKR in a short amount of time. This is achieved through a novel design that is inspired by the most successful tokenomics models in DeFi, including Curve, Sushiswap and Synthetix. The basic concept is that the Sagittarius engine gathers the cash flows of the protocol into a capital pool called a Bucket, which is then used to offer long term MKR holders the ability to borrow Dai from the Bucket using their MKR as collateral at a 0% rate, fixed forever, and with preferential liquidation (a very long grace period). This approach to borrowing Dai from Maker based on MKR collateral does NOT create solvency or collateral risk issues for Dai, because the Dai is NOT “freshly generated”, but rather it was previously generated and then accumulated into the Bucket (The protocol owned capital pool) and is thus guaranteed to be overcollateralized by hard assets just like any other Dai. The locked MKR that is used as collateral is not being used to back the Dai. To be able to access this benefit MKR holders need to lock up their MKR between 1-4 years, where a longer lockup gives access to a proportionally greater share of the benefit of being able to borrow Dai at beneficial rates - manifesting in a higher Debt Limit Growth rate which has some similarity to an APR by determining how much cash the user can borrow per day at the beneficial rate. Additionally, locking up MKR this way also increases the voting power of the locked MKR by up to 2x, helping to better align governance decisions with the will of voters that are verifiably exposed to their consequences for the long run. The primary advantages of the design:   Direct Cash Flow with minimal capital leak. On one hand The Sagittarius Engine allows the maker protocol to provide cash directly to core community members and committed MKR holders, but at the same time no capital ever directly leaves the protocol, and the protocol will simply continue to gather a larger and larger capital pool over time, with no outgoing capital flows through burn or dividends. The cash flow is represented as a continuous increase in the amount of Dai you can borrow with your locked MKR at preferential terms. It is not an APY, but it will feel like it, and it will be quite high:    A limited amount of MKR will be locked into the Sagittarius Engine     anyone who exits will have to return their borrowed Dai, boosting the Debt Limits of everyone else     we can use MKR issuance and yield farming to massively boost the cash flows that run through the system     Because the Sagittarius Engine doesn’t leak much capital, it is a lot less risky to do aggressive token issuance, and there is much less risk that it just causes a short term pump and dump Because Sagittarius users have their MKR locked up, and also have an increased voting power with their MKR, they are more motivated to spend a little extra effort to intelligently participate in governance, by e.g. delegating their MKR, so that they can ensure their MKR remains safe and grows over the period of their lockup. The Sagittarius Engine is easy to enter, hard to exit. It encourages MKR holders to keep their tokens forever, and never leave the community, both because the barriers to exit is high (you have to pay back your entire loan, and then wait the lockup duration), but also because the benefits of staying locked up comes in the form of a high, direct cash flow, so it negates much of the downside of having your capital locked up. To prevent users from getting stuck with their assets in the SE, the design also allows for a “fast withdrawal” which means users can leave at any time if they really need to, it just requires them to pay a penalty which then benefits other, more patient users (The loan still has to be repaid as well). Because the Sagittarius Engine design doesn’t leak capital over time to a specific group of users, it is not benefitting one group over others. Even though the value flows are directed towards the long term, locked up holders, regular MKR holders also benefit because the capital ultimately accrues inside the Maker protocol and permanently is deployed for the benefit of MKR holders as a whole, by incentivizing long term lockup by core community members. This also means that theoretically the Sagittarius Engine could be turned off again, and all users could have their lockups removed and their positions unwound. Maker would then be able to recover all of the capital gathered in the engine and spend it on something else. The Sagittarius engine means that now MKR will finally be considered a token that you can use for some sort of benefit, which matters a lot in a DeFi landscape where many users have become used to always using or deploying all of their tokens in some way. Instead of just being a token that you hold, and vote with (for no direct benefit), with Sagittarius MKR would be known as a token that holders acquire in order to use it for something: locking it up to access preferential borrowing terms.   Technical Design  Glossary of terms Governance Lockup Vault (GLV): Special vaults that are available to Sagittarius users, that enables them to lock up their MKR for between 1-4 years and get access to Dai borrowing on preferential terms. Users can always increase their lockup period instantly, in order to get more benefits, but cannot decrease them without unwinding the GLV completely and making a new one. GLV Debt Limit: The personal debt ceiling available to each GLV, which increases over time as the Bucket fills up with Dai. Each GLVs Debt Limit increases with a proportional share of the Buckets increases based on the amount of MKR locked * the lock duration. GLV Max Collateral Ratio: The Max Collateral Ratio of a GLV is the highest LTV it can be drawn to. The GLV Debt Limit also stops growing once a GLV hits its Max Collateral Ratio, which results in higher Debt Limit growth of other, newer GLVs. GLV Unlock: GLV Unlock the standard way to withdraw MKR out of the Sagittarius module, and works similarly to withdrawing collateral from standard Maker Vaults, except when the GLV has been made, the MKR is then transferred into an unlocking state which lasts for the duration of the lockup period. GLV Fast Withdrawal: It is also possible for users to instantly withdraw MKR out of a GLV, but this then incurs a fast withdrawal penalty, which is significant, but still less than the liquidation penalty. (e.g. fast withdrawal penalty could be 15% if GLV liquidation penalty is 20%). MKR that is withdrawn this way is then sold through flop/clop auctions and the proceeds are funneled to the bucket buffer to benefit other GLV users. Bucket: The “reserve” account of funds that are used for the token mechanics of Sagittarius. GLVs only get access to borrow at most the amount of Dai that is available in the Bucket - meaning Sagittarius cannot generate unbacked Dai. It’s called a bucket rather than reserves to indicate its unique economic impact on the protocol, since while on one hand it accumulates capital, on the other hand this capital is made available for MKR holders to generate with MKR as collateral. As such the Bucket can’t be considered true reserves that directly contribute to the stability of Dai, but is instead value and tokenomics drivers that benefit MKR holders. Bucket buffer: a transitory account that receives Dai when the surplus buffer is full (less the Surplus Cut), and distributes it smoothly to the Primary Bucket to smoothen out the Debt Limits accruing to the GLVs. Funnel Rate: A parameter that determines how fast Dai moves from the Bucket Buffer to the Bucket. Possibly calculated as a % of total per day. Surplus Cut: A parameter that determines how much of the surplus cash flows are sent from the surplus buffer to the Sagittarius Bucket system, and how much is sent towards  An example journey through the Sagittarius Engine from a cash flow perspective The Sagittarius Engine “starts” at the point where the surplus buffer is full and Dai from stability fee income or other income sources would today be sent to buy and burn auctions. With Sagittarius, most of this surplus cash flow is instead sent to the Bucket Buffer, which holds Dai temporarily and smoothly funnels it over time into the Primary Bucket, where it then becomes available to use by the Governance Lockup Vaults. The part of the cash flow that doesn’t flow into the Sagittarius Engine is called the Surplus Cut, and represents cash that can be sent to other things, such as a burn engine or long term reserves. MKR holders will look at the current cash flows streaming into the Primary Bucket to decide if they want to lock up their MKR. Once locked up, every time the primary buffer increases, the Debt Limit of each GLV also increases proportionally to the amount of MKR they have and the duration they are locked up. Example: Assume there are only two GLVs, GLV 1 with 1000 MKR locked up for 4 years, and GLV 2 with 1000 MKR locked up for 1 year. The Maker Protocol then earns income from stability fees that result in the Primary Bucket increasing by 1000 Dai. This results in the Debt Limit of GLV 1 increasing by 800 Dai (as it has a relative weight of 4000), and the Debt Limit of GLV 2 increasing by 200 Dai (as it has a relative weight of 1000). A GLV doesn’t have to use its Debt Limit, but if it uses it, it may have to pay a stability equal to the DSR, or a one-time up front cost of e.g. 0.1%, or some other cost that the community decides. The community may also decide that it should simply be free to use the Debt Limit. A GLV has a max collateral ratio which is determined by its lockup duration. The max collateral ratio doesn’t just determine how much the GLV can borrow, it also determines how high the GLVs Debt Limit can grow. Once the Debt Limit of a GLV hits the max collateral ratio it is hit, the GLVs Debt Limit stops growing and other GLVs that have not yet hit the limit will grow faster instead. 1-2 years = 20% max LTV 2-3 years = 30% max LTV 3-4 years = 40% max LTV 4 years = 55% max LTV (These are just some example parameters, the community will need to decide the actual numbers) There will need to be decentralized, incentivized keeper functionality that turns GLVs “on and off” based on whether they have hit their max collateral ratio yet, which also requires an anti spam cooldown to minimize gas costs. This shouldn’t be a big issue assuming that it will take many years for a GLVs Debt Limit to hit its max collateral ratio. All GLVs regardless of lockup period have a liquidation ratio of 150% (66.7% LTV), however the liquidation terms are very lenient. If a GLV falls below the liquidation ratio, the user has a long period to recover (1 week or maybe even 1 month), but also a very high liquidation penalty (e.g. 20%). This way there is no stress or real risk in using GLVs, it really is mostly a benefit with minimal drawbacks other than the lockup period. Again, the community will need to decide and fine tune what the sweet spot is for these parameters to achieve the desired outcome. When a user wants to unlock MKR from a GLV, they can only withdraw MKR until they hit the max LTV of their collateral ratio. If they want to withdraw more than that, they have to pay down their debt first to hit the desired collateral ratio. If they have remaining free Debt Limit that hasn’t been used, then if they withdraw MKR, their available Debt Limit is reduced to the max collateral ratio based on the amount of MKR that remains locked up. MKR that is being unlocked goes into a special unlock state, where it is frozen and can’t be accessed (other than for voting), until the lockup duration has passed for that specific block. (so a user could also be in the process of withdrawing two blocks of MKR from a single GLV, one that was initiated a year ago and still has 3 years left, and one that was initiated 2 years ago and still has 2 years left, for instance) Fast withdrawal is another option, but it has a penalty of e.g. 15%, the proceeds of which goes to the Bucket Buffer to benefit other GLV users. The high fast withdrawal penalty and high liquidation ratio is necessary to make sure it doesn’t just become the standard way to exit the Sagittarius Engine, but is only used in exceptional circumstances. GLVs also have increased voting power depending on their lockup duration. A 4 year lockup GLV has 2x the voting power, so 1000 MKR can vote as if it was 2000 MKR. Other lockup durations have proportionally increased voting power (1 year 1.25x, 2 years 1.5x, 3 years 1.75x) As stated multiple times, all of the example parameters I’ve written here need to be decided and justified by the community in a public process.  Ember, a more advanced burn engine Ember is the Sagittarius burn engine, which is meant to run with a lot less capital available (funded through the Surplus Cut), but produce more efficient results and more burns in the long run, as well as boosting MKR liquidity instead of reducing it. It works by holding a reserve of Dai, and then activating MKR purchasing “sprints” when the price of MKR falls below a level determined by a valuation model based on things like dai in circulation, income from stability fees, assets held in saggitarius and in reserves etc. The MKR purchased this way is then used to provide uniswap style liquidity in the MKR/DAI trading pair, and burned. The ratio between burning and liquidity would be set by governance to be e.g. 50/50 Ember can be developed separately, after the main Sagittarius deployment as it has no short term implications and only plays a role in the longer term.  Full burn In the edge case where all the GLVs in the Sagittarius Engine have reached the max collateral ratio, there would be no benefit to funnelling more capital into it. In that situation the system should then enter a “Full burn” state where all cash flows that would normally go to the Sagittarius Engine, instead go straight to buy and burn in Ember, boosting it significantly. This should then help drive the price of MKR up to a point where Sagittarius Users can again begin to accrue debt limit, and this way it is guaranteed that money accrued in the system directly contributes to the value of MKR.  MKR issuance and yield farming The Sagittarius engine provides a strong platform for Maker to unleash the power of yield farming and MKR issuance in a way that builds on top of what protocols like sushi have achieved, but with the new benefit that all tokens issued ultimately result in profit accruing, and accumulating within, the protocol. That’s a separate topic which I’ll expand more on later but there are some extremely powerful synergies that create the possibility of “having your cake and eating it too” in terms of both creating clear and direct value and benefits to MKR holders, and also removing all constraints on resources available for e.g. core units, and safety buffers and capital reserves the DAO can build up for other needs. The MKR issuance will be tightly coupled with the vision, and be designed to last for the entire Age of Sagittarius, acting as a force of economic gravity that drives the direction of the community, increasing governance stability. In total I propose that it will last over a period of 50 years, with an initial boost phase, followed by a ramp-up phase and a long tapering phase. This corresponds to the critical decade in the 2020’s where fossil fuel emissions must peak and then begin a period of rapid decline, followed by several decades where the impacts of global warming will be felt strongly in the global economy, while global infrastructure must still continue the march towards full electrification and decarbonization. In total I propose that 2 million additional MKR gets issued, bringing total supply to 3 million, and where it can potentially be restricted from further changes due to governance initiatives that use bureaucratic and political means to lock down the ability to propose MKR issuance. (the Ice Age concept) Maker Governance should experiment heavily with different ways to distribute the new MKR, and figure out the ideal mix that provides the desired results. There are many options, including:  Providing MKR as standard yield farming rewards for users who have specific flagship collateral vaults, such as ETH, or ETH-LP tokens Providing flagship collateral vaults a special “discounted option” to purchase MKR pre-locked in Sagittarius at a steady rate, on e.g. a weekly basis, with a discount equivalent to the fast withdrawal penalty. Directly selling MKR for Dai using dutch auctions Directly selling MKR for Dai at a discount using “bonds” (A recent innovation by OlympusDAO) Directly selling MKR pre-locked in Sagittarius at a discount  Experimenting with these different options and figuring out which ones provide the outcomes we are looking for will be key to making the overall project a success and giving Maker the momentum it needs to grow to the next level.  Black Holing The final option for yield farming I think should be considered, is the ability for Sagittarius users to also benefit from the “discounted option” yield farming plan. This means that once you lock your MKR into Sagittarius, you also have the ability to continuously purchase more at a discounted price, increasing your stack of MKR further. However, this needs to be used very carefully since it puts the user in a position where they don’t have liquid assets to pay off their debt again, making it very hard to exit and comparable to entering a “black hole” of long term MKR exposure (and Sagittarius benefits). Such users will likely become active contributors and participate in the project for the long term, and to further boost this we could have an early boost phase where extra yield farming incentives are allocated towards black holding. The overall schedule of yield farming that I have considered would consist of 3 phases. Boost phase year 1-4  100k MKR per year towards general yield farming:  MKR rewards on flagship collateral Discounted sale of pre-locked MKR for flagship collateral Open dutch auctions   100k MKR per year exclusively for black holing  Ramp up phase year 5-10  80k MKR per year towards general yield farming 20k MKR per year for black holing  Tapering phase year 11-50  The remaining 600 MKR would be distributed at a linearly decreasing rate over the remaining 40 years.  Example calculations: If MKR price is stable at 2000 USD during first year of boost phase 100000 MKR is sold to the market for 200 million USD 100000 MKR is sold to black holers for 170 million USD (15% discount) The surplus cut is at 15%, meaning 85% - 314,5 million is funneled to the SE (for simplicity we’re gonna say 860000 Dai per day) The SE has 300,000 MKR supply locked up, 15% of that is black holing On Day 1 both the normal and black holer GLVs get 2.86 Dai per MKR (equivalent to a debt limit growth of 52% per year). Black holers also get a value accrual of 0.52 USD from their discounted MKR (equivalent to a value growth of 9% per year) Towards the end of the first year, black holers would get a larger share of the debt limit growth as they would have more MKR in the pool. Haven’t done the detailed calculation but my estimate is that they would get a debt limit growth of something like 3.5 Dai per originally locked MKR, or equivalent to a debt limit growth of around 65% of the value of originally locked MKR. I could have easily made some mistakes on the math, so it would be great if someone else would check the numbers and assumptions. The compounding effect of the black holers would become more significant over the full 4 year boost period. This example suggests that the Sagittarius Engine users would quickly hit their max collateral ratio, regularly putting the system into the full burn state. In practice this would probably also be balanced by attracting more new users into the Sagittarius Engine, increasing the amount of MKR that’s locked up and drawing more users into becoming long term contributors.  Impact NFTs Impact NFTs are the concept that intangible artistic, historic and social value is created when a DAO executes on a vision of public good, and achieves results that directly relate to the vision and create public good. To help make the creation of positive externalities and public good profitable and more self-sustainable, this intangible value can be tokenized in the form of NFTs that reference the real world achievement, while also adding a layer of art and “bragging rights” (such as statistic relating to clean energy created, carbon equivalent offset etc). Because of their direct relationship to positive social impact, society as a whole has an incentive to make this kind of NFT valuable, as that will further drive the public good created. Maker can use this principle by tokenizing the “bragging rights” of each flagship project it finishes, such as wind turbines, solar fields, battery stations, carbon sequestration projects and more. Once tokenized, the NFTs are then distributed to Sagittarius users in a lottery model, meaning that when you lock up MKR in Sagittarius, you are continuously competing to earn these NFT’s, and if you get one, you can then use it as a profile picture or similar to signal your involvement in climate action, potentially encouraging others to action as well. Beyond that, gamification features can be developed for the NFTs, and third parties might be incentivized to develop on top of Impact NFTs to support their own positions on climate action. These characteristics of the NFTs also make it possible for them to become liquid and have market value which can then be sold and speculated on, and to further incentivize active trading of the NFTs by climate supporters, while capture some of the value, the NFTs can have a royalty fee that goes toward charitable climate action which can then produce even more rare impact NFTs, such as tokenized mangrove forest or rainforest.  Synergy with vision, narrative and community purpose The most powerful effect a tokenomics design can have is to synergize with a broader vision and narrative. The Sagittarius engine is well positioned to be presented alongside a new vision for Maker returning to its root principle of Sustainable Finance and rebuilding its core around that. This narrative will then help drive the excitement for people to engage with the tokenomics beyond just for the financial benefit, but also to be a part of the movement and share the community values that they agree with. ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-10-17-2022/13292",
                        "https://forum.makerdao.com/t/weekly-relay-february-8-14-2022/13239",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-3-10-2022/13167",
                        "https://forum.makerdao.com/t/signal-request-allocate-20m-to-protocol-owned-uniswap-v2-mkr-dai-lp/13150",
                        "https://forum.makerdao.com/t/improving-governance-participation-rate-at-makerdao/11706/38",
                        "https://forum.makerdao.com/t/pecu-q4-highlights-and-looking-forward-to-2022/12430",
                        "https://forum.makerdao.com/t/improving-governance-participation-rate-at-makerdao/11706/22",
                        "https://forum.makerdao.com/t/govalpha-gov-001-quarterly-review-q1-2022/15589",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/14",
                        "https://forum.makerdao.com/t/mip39c2-sp23-adding-the-deco-fixed-rate-core-unit/10224/46",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-7th-october-14th/11003",
                        "https://forum.makerdao.com/t/maker-relay-ep-66-en-espanol/10982",
                        "https://forum.makerdao.com/t/maker-relay-ep-66/10950",
                        "https://forum.makerdao.com/t/signal-request-should-we-mint-new-mkr-for-protocol-expenses-or-fund-them-with-mkr-from-the-makerdao-treasury/11629",
                        "https://forum.makerdao.com/t/prioritization-framework-sentiment-polling/15554",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-24-march-2-2022/13590",
                        "https://forum.makerdao.com/t/relay-semana-22-28-de-febrero-del-2022/13587",
                        "https://forum.makerdao.com/t/weekly-relay-february-22-28-2022/13499",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-17-24-2022/13425",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-febrero-del-2022/13404",
                        "https://forum.makerdao.com/t/weekly-relay-february-15-21-2022/13348"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.755362240400999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#2",
                    "likes": "1",
                    "time": "08/10/2021-00:23:11",
                    "content": "So far I like all of this.     rune:  The MKR purchased this way is then used to provide uniswap style liquidity in the MKR/DAI trading pair, and burned. The ratio between burning and liquidity would be set by governance to be e.g. 50/50   This part is really cool, and much like what I proposed here:  In the simplest form, this mechanism stores the Dai allocated to it until needed for flop abatement. However, a further iteration could employ a second storage strategy: Holding it’s assets in a custom DAI/MKR Automated Market Maker  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6499999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "3",
                    "time": "08/10/2021-03:30:54",
                    "content": "They say a pivot is really about driving business model discovery. And I believe in the long-term the Maker Community will discover the right Sagittarius Engine model. This is innovative. And for sure, pivots are really hard and they can be painful to do. But IMO this pivot has the right “business model”, the right stuff. I can’t wait to see it develop from zero to one. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.665922619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#4",
                    "likes": "10",
                    "time": "08/10/2021-07:13:34",
                    "content": "Thanks for this post Rune - this is all very exciting. I just have a couple of super low-level questions at this time.   Do you envision the SE to be compatible with delegation or an incentive to active protocol participation? For example, does a MKR holder who has delegated their MKR get access to the same benefits from the SE?   Do you think the unlock period and fast withdrawal penalty may impact the ability of Governance to perform an Emergency Shutdown if required?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#5",
                    "likes": "2",
                    "time": "08/10/2021-10:12:50",
                    "content": "Yes, the SE should be optimized for governance participation, including delegation. This would require a deep technical integration and an upgrade of the voting contract. A custom integration for the ESM would also be required. It should be possible to directly move MKR from the SE to the ESM, and the voting multiplier from the SE should not count towards the ESM ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#7",
                    "likes": "8",
                    "time": "08/10/2021-12:58:45",
                    "content": "I appreciate your points, and it is definitely important to carefully discuss and consider what users actually want. I’ll probably try to set up some polls for this soon. I would argue that the people who are willing to lock up their MKR for a very long period of time will not distinguish much between getting dividends or just borrow in a way that is essentially risk and cost free. In both cases you are holding on to your MKR, and getting cold hard cash out of the protocol. The advantage of SE vs regular dividends is that you are getting much more cash out, you dont have to deal with the complexity of tax, and you benefit whenever someone else leaves. And keep in mind there is also a real “dividend-like” cash flow that occurs when users “black hole”, which is the most aggressive option where users compound their MKR holdings by taking advantage of discounted MKR sales by the protocol. In the basic example I did above the value gain from this was a theoretical APR of 9% (in an illiquid asset, which may mean it isn’t taxed in some jurisdictions), which is on top of the massive growth in debt limit of 65% (which probably isnt sustainable, but if it is then you will quickly end up with an asset that has a permanent cost free line of credit at a good LTV (which btw probably could be more than just 30%, we may want to be more aggressive on this). Finally, for the rest of the MKR holders that just want to hold MKR and see its circulating supply go down, they will be able to see this effect immediately, and much greater than buy and burn today. If they don’t (if the SE isn’t drawing in new MKR) the GLVs max out their LTVs and the system enters full burn anyway, and regular MKR burning resumes. But for sure this is meant to be complex. I would argue that specifically when it comes to tokenomics you actually do want complexity, because its about gamification of finance and to create the conditions for what I call the “casino effect” to emerge. It’s something for degen types that are looking for extreme risk/reward, or people who truly want to go down the maker rabbit hole. Regular people can just continue to hold MKR and trade MKR like today, the only difference is that there are more powerful forces pulling MKR out of circulation - unless the system goes into full burn in which case the effect is the same as buy and burn of today. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.709971877869605
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#8",
                    "likes": "16",
                    "time": "09/10/2021-08:48:22",
                    "content": "I’ve made a spreadsheet to understand the impact of SE on the price of MKR. I probably didn’t understand all parts of the SE (especially the 50% APR). I’ve made a few assumptions, you have all the spreadsheets to make others. I’ve started with a “somewhat” stable situation for MakerDAO with a 1 trillion balance sheet and investors asking for 15% return on their capital. It’s easier than modeling all the future with discounted cash flows. The input MKR price on the top right is important as the whole thing being based on leverage it is reflexive. NIM is the interest spread.  image943×371 14 KB  Therefore, based on earnings, if you don’t leverage (borrowing from MKR to buy MKR), you end up by removing half of the MKR value. Which makes sense as you are wasting capital. I thought initially that with leverage you would end up getting the full MKR value. It is not the case. For that, you need to sell the MKR for SE filling at the end price. And obviously, you will not sell MKR at 126k today or the next year (the spreadsheet uses an issuance price of 50k). Using a sum of parts approach, you could argue that the price of MKR is the sum of the market value of the lending business + the assets of SE that you can borrow for “free” (hence a cash component of a sort). Using this approach would give an MKR price of 88k, still way below what would have been done without SE (it’s in the spreadsheet). In both cases, the problem is that the SE is a cash drag that doesn’t compound. In the model, the return over equity of MakerDAO (the lending part) is an awesome 63%. The SE RoE is 0% (or whatever the lending rate is). Therefore, so far, it is my understanding that the SE destroys MKR value. Governance objectives can be achieved differently (I’ve proposed in the past to increase MKR power by the time it is stacked). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.69973544973545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dalin",
                    "index": "#9",
                    "likes": "4",
                    "time": "09/10/2021-08:53:56",
                    "content": "as a heavy MKR holder , I am strong opposite the idea , I think it is complex and may not works.  very big dilution (MKR from 1M to 3M) , I invest MKR because I think it is undervalue . MKR is positive income now , and have organic growth , it is not wise mint more MKR for sell now. it will destroy long term holder’s faith on  MKR after such big dilution. lock in MKR just delay the sell pressure , so burning is very different from (mint more MKR + lock in ) I don’t think  the zero lending interest is good incentive model . let’s do the math , assuming MKR revenue take rate is 2% , the valuation of MKR is 10 PS. if long term  mint 1T Dai , the revenue is 20B , and the MKR valuation is 200B . the zero lending interest value is 20B*2%=0.4B. It means the protocol just return 0.2% MKR market value to holders. and the Dai lending out can’t grow value , it means only lock MKR get the value , but not all mkr holder farming incentive ROI not clear . farming is useful to bootstrap a network , but Maker is so big now . Maker have 7B Dai now , and 2.5B market value . if Maker grow to 50B , how much MKR should reward ?  if the apy is 10% , the farmers will want 5B MKR to reward . farming incentive model works for early project , such as Liquity ,  it’s lusd also from 0 to 0.6B , if the farming apy is 10% , just give 10% token to farmers if it market value is 0.6B . MKR is undervalued , and many small protocols enjoy the valuation hype . I don’t think it is the right long term strategy using very big  dilution for growth.  so, I think we should not change tokenomics at this time . the current tokenomcis is not perfect but not the high priority . we just need up the system surplus for future growth , and buy more ETH as protocol treasure , Maker need strong balance sheet .I suggest 1/3 burn , 1/3 DAI , 1/3 ETH ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.462807668521954
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#10",
                    "likes": "7",
                    "time": "09/10/2021-13:05:41",
                    "content": "Thanks for at least taking a stab here. I just don’t have the time to go over this proposal fully and get into analytical detail. When I read back on this whole model I don’t see that it takes into account the times when Maker doesn’t have DAI income.   This idea that MKR in the system can earn a 50% APR from cash flows in perpetuity I don’t think is sustainable and definitely would be a massive cash drag. There is a real conflict issue btw with MKR being available for market making and in governance that is exasperated by this proposal.   I am not even sure if it can be corrected by altering this proposal to using Uni V2 MKR-DAI LP to follow my DeepLiquidity thesis for DAO value building. DAO DeepLiquidity - 1Hive The point here is that each time a token is paired with a stablecoin we have that user defining a liquidity price point.  If this is governance which can be very sticky with their LP (users tend to be fickle unless there are incentives and can remove their LP) and build a significant v2 Token-stablecoin LP ideally in one DEX (like Uniswap, but it can be any v2 type LP venue) these holders get:  fully democratic sharing of trading fees on the DEX auto compounding of return. V2 Token-stablecoin LP price is sqrt(token) in terms of volitality If > 33% of the tokens are paired in this way at a price this sets a price floor There is no way to flash crash the price to 0 via this type of LP.  Based on my analysis I believe the better LP is the token-DAI pairings.   But I want to echo another poster in this thread.     Ethranger:  Maker has to aim for simplicity. The proposal smell too complex. In the end, the goal is to have more active MKR participants & also increase the value of the protocol. Masses understand cash flow, they don’t understand complexity. The proposal is comparable to rewarding Apple stock holders with 0% interest rate credit for any Apple products, rather than paying the stock holders with cold hard cash dividends. It’s unnecessary complexity, to achieve the same results.   I agree completely with this sentiment.  This proposal needs to be simplified dramatically.  It also needs to have steps laid out to determine if this can be approached in a step-wise fashion. I also want to point out that governance has repeatedly said no to any type of MKR rewards for depositors, borrowers, as well as governance participants.    My feeling on this was that Maker needed to create a more dynamic and liquid trading environment around its core value (MKR) and we could experiment quite a bit with a rewards token manufactured out of thin air (MKR-R) that is coupled into the burn model.   When MKR is sent to burn bucket we can allocate some % of this MKR to buy MKR-R giving MKR-R a similar value component.   Sure it potentially splits the MKR value into MKR-R based on the % but the point here is to create more value for the community and to diversify the distribution and trading model.   The fact that MKR-R would burn with some % of MKR burning should mean that MKR-R would trade with the same ratio to MKR as the burn ratio.   MKR-R gives governance a free hand in experimenting not just with other governance models but also distribute a new token to get our borrowers involved in the Maker ecosystem. Personally when it comes to these grand vision ideas I really want to open this up to anyone to post their ‘grand vision for Maker’ for a period of like 6-12 months.   Lay them all side by side for us to discuss the pros and cons of.  The complexity of a grand future plan isn’t something to just jump into with polling but is something the entire community - particularly including our CUs should be involved in. Stuff like this makes me wonder if Maker needs a leadership unit to deal with vision, scope, and general organizational reign in (in terms of work, quality assurance, expense control, and business direction). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.618392255892256
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#11",
                    "likes": "9",
                    "time": "09/10/2021-20:40:36",
                    "content": "Thx a lot for the thoughtful comments and feedback. Will post some quick thoughts, and my plan is to later set up an open call where we can discuss tokenomics and pros cons. I think its a big mistake to try to use tradfi models (especially assuming some future mature stage) to consider the value of a tokenomics design. It’s the kind of “NGMI” mistake the Maker often falls into and what we can’t afford to make when considering our tokenomics. The whole point is to create a narrative that will drive people to buy and to participate, to jumpstart our next phase of growth. one of my core assumptions is that doing large scale MKR issuance is good at this stage, especially if it’s combined with a new and clear vision. The fact that the MKR price is considered low is actually a good thing, the whole point is to create a new ground floor that a new and much larger generation of community members can join at, and feel happy about it knowing that they bought at a great price, creating positive energy that will get them to contribute as community members and generate the momentum we need. In the long run this will come back as profits, and overall derisk the likelihood that maker is gonna make it and really grow to global scale. another core assumption is that we want to incentivize lockups of MKR. I just believe this is the best possible way to do tokenomics in Maker, lockups is just such a great fit for a DAO because our main problem is that we need to push people over the edge to actually become active contributors that care about the project as a whole, not just the price. If you’re someone who’s locked up anyway for the long term, I think it is more attractive to be able to get a high rate of cash out that you don’t have to pay tax on, rather than a lower rate that they also have to be taxed on. I don’t think in practice many people who lock up will actually consider that the cash they get out needs to be paid back, as long as the rate is 0% and the liquidation terms are very lenient, it will really just feel like “free money”, and on top of that having no tax on it will make it feel basically like a tax free dividend. People who are not locked up will benefit from all the energy and hype and genuine contributions of those who are locked up, but more importantly they will benefit from the effective burn the lock up will create. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2962557909926335
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#12",
                    "likes": "8",
                    "time": "10/10/2021-08:51:29",
                    "content": "I feel the Sagittarius Engine is perhaps trying to bundle a bit too many issues into one possible solution. Long-term community building, MKR lockup, user and stakeholder engagement, financial returns to MKR holders and governance quality - all is rolled up into one package. I say we discuss, vote, observe and iterate each of these issues separately. Doing it all at once could create more problems than it solves. With regards to MKR issuance: this is highly problematic. Issuance of 2,000,000 new MKR is supposed to kickstart the Sag Engine and bring more people into the community.  These are worthy goals and the intention is of course the very best. I do however feel that this approach will not lead to the intended result. Please pause and consider the game-theoretical aspects of this. Buying MKR and locking it up sounds like a good proposal, except that there is no stop to minting. We, the Maker community, have since 2016 communicated “There is only 1 million MKR, and only if the protocol needs to cover losses will more be printed”. This worked fine for 5 years until MIP54 which all of a sudden opened up for printing MKR for bonuses. And now we have a proposal for printing of 2 million MKR, which on top of it all will have to locked up for years to achieve real potential. Potential new MKR holders have absolutely no guarantee that no further MKR will be printed.. New MKR holders could lock up MKR for 4 years and then after trustingly doing their part for years risk a further massive devaluation of their stack “because somebody had a great idea”.  This is not winning. Instead of issuance there are other things we could do:  Modify MIP54 so it becomes a DAI bonus after the present 84k MKR has been spent. Think deep, long, and hard and come up with a method of preventing any MKR printing whatsoever except when the protocol is under water. Like none - no matter intentions or ideas. If preventing MKR printing for some reason proves impossible, the way we return value to MKR holders must be rethought. There are multiple options available such as options or even a lottery that can be used if we are unable to implement “MKR is scarce”.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.649441786283892
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#13",
                    "likes": "12",
                    "time": "10/10/2021-09:02:44",
                    "content": "    rune:  I think its a big mistake to try to use tradfi models   The model is public and everyone can contribute to add non-tradfi items (whatever that means). I think it’s necessary for a protocol that pretends to use scientific governance to provide models (and for sure all models are wrong, but some are useful). We can debate on intuition as much as we want, but that’s not scientific. I understand you have intuitions: MKR farming will drive new community members that will accrue value to MKR That’s true. The question is the scale. If you spend $1B of capital to get 10 more participants … it’s obviously a net negative. Doing RWA brings some TradFi community members. Having an ESG mandate will probably bring a lot of people as well. Being good value bring us @PaperImperium (and myself). Yet it’s not a cost but a side-effect. I have the intuition that we shouldn’t incentivize community members based on their capital (which seems what the SE does) but on their contributions. It would be way more efficient. Locking is good it brings use together with no escape Works until there is a strong derivative market. I would not bet against DeFi innovation (which is nothing new in TradFi anyway). As SE destroys MKR value (until my model is prove false), it might make them go elsewhere in the first place. But assuming you want people to lock, let’s just issue 5% MKR each year* (or it could be the MKR buyback) only for those that lock 4 year. This will not destroy value, just tranfert value from short-term holders to long-term holders (you might still get a discount on the MKR price due to the illiquidity premium). * If the 1M MKR limit is important, you can just rebase (which would be a SC mess). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.77209595959596
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#14",
                    "likes": "10",
                    "time": "10/10/2021-21:24:49",
                    "content": "    Planet_X:  absolutely no guarantee that no further MKR will be printed   This is why it all has to be considered in a broader context. I think it is crucial to understand that vision, narrative, tokenomics, governance, community sentiment etc are all linked. This is how it relates to the concepts of governance earthquakes vs governance ice ages. Right now I would argue there is a much greater chance of random and unpredictable minting, because the entire governance community isn’t in very good shape - if you look around this forum, and even more in rocket chat, a huge amount - I would say half - of all discussion, and especially all significant discussion and decision making, is being done by core units right now. There are very few pure community members participating that don’t have some kind of role in the bureaucracy, and I think this is a big problem because it is a bit like the lunatics running the asylum - without a strong backbone of regular community members to keep a check on the core units and the bureaucracy, it will be hard to prevent the bureaucracy from slippery-sloping towards serving itself rather than the community over the long term, and that would eventually almost for sure mean printing MKR in some form.  That’s true. The question is the scale. If you spend $1B of capital to get 10 more participants … it’s obviously a net negative.  Agreed, and I would argue the way to estimate this is to consider the empirical evidence offered by literally. every. single. other successful project in the entire space. Are we really gonna be so arrogant that we are going to fail to take an opportunity that is so clearly spelled out by the market already?  Doing RWA brings some TradFi community members. Having an ESG mandate will probably bring a lot of people as well.  Completely agree, but the magic happens when you combine this with strong financial incentives as well, which comes in no better form than token exposure + lock up IMO  Being good value bring us @PaperImperium (and myself). Yet it’s not a cost but a side-effect.  I would argue this is actually proving my point. Both you and paper are not regular community members, you are both playing specific roles in the bureaucracy. That is important, and that is why it also obviously involves the expectation of specific and generous compensation to make sure the job is done in a professional way. But that’s also exactly why we need a way to also recruit more active regular community members to balance this out - they need to vastly outnumber the bureaucracy to keep it in check or it is bound to spiral out of control over time. These regular community members will be motivated by the vision, for sure, but for them to really spend the energy it will take to try to control a giant, massively funded bureaucracy, they need to also have some kind of value upside that keeps them going.  Works until there is a strong derivative market. I would not bet against DeFi innovation (which is nothing new in TradFi anyway).  This is why I think we need to offer the “fast withdrawal” option. If someone changes their mind they should be allowed to just quit, as long as they just pay something for the privilege which will then benefit everyone else, making everybody better off.  As SE destroys MKR value (until my model is prove false)  Can you point me to any other succesful tokenomics program anywhere else in DeFi that is “proven” by some sort of spreadsheet calculation? DeFi is a new paradigm based on behavioural economics, not homo economicus assumptions. We need to get with the times or we’re NGMI.  But assuming you want people to lock, let’s just issue 5% MKR each year  This was my starting point. Give people MKR inflation for locking up. The main issue that drove me towards my current idea of subsidized lending is  it significantly leaks capital, meaning it very clearly benefits those that lock up and makes it uncomfortable being just a passive holder that doesn’t lock up It means imposing a huge tax inefficiency on the system that means we are starting from negative rather than from zero, and will have to rely much more on the hope that our tokenomics will drive people to the community and start buying MKR Because of the above implications, we would only be able to do very conservative token issuance. This goes against my core assumption which is that right now, when we are aligning on a long term vision and begin the first step of a new journey, is the perfect time to really go pedal to the metal on extremely powerful tokenomics and token distribution. Tokens, tokenomics and community are all interconnected with the vision. Crypto is more personal than just holding stonks, and the way we capitalize on this is to do highly aggressive token distribution right at the moment we are trying to create a movement and a new generation of governance participants. Dividends/cash payments are clearly features of an investment. This restricts how we can market and spread the word about it, especially in the real world with ads etc. Cheap inherent credit is instead an inherent utility of the asset that on one hand provides clear tangible value, but it’s something new and completely unique that isn’t traditionally associated with regulated investments. A big part of the overall idea is that we need to aggressively market and advertise Dai as clean money, but also aggressively market MKR on the metro or whatever, spread the word to regular people as their first taste of the magic of DeFi that you can buy MKR to help save the planet and even get a unique benefit through this unique, inbuilt cheap credit that means you can still get cash out again.  Really appreciate the feedback and discussion about this, and I hope we can talk about this in further detail on governance call. Additionally, I plan to soon set up a call specifically for tokenomics as well, to go further in depth. One thing I want to add that might help clear up concerns about capital inefficiency, is a feature that was originally a part of the design that I decided to remove to reduce the complexity. It is the concept of Asset Buckets, which are basically secondary buckets that hold assets like staked ETH or ETH/DAI LP tokens. These Asset Buckets could then be used in special vaults to generate the Dai that then goes into the Primary Bucket. This way it doesn’t just have to be Dai that the SE accumulates over time, it could also be a way to directly affect what is backing the Dai in circulation and give the protocol exposure to the performance of some great assets - and one thing I think is great is that the performance of these assets gets directly channeled onto the utility of MKR because it will directly increase the amount of Dai in the Primary Bucket. We cant have a digixdao situation where MKR doesnt get more valueable even if it holds a lot of ETH that is getting more valueable because market participants arent able to directly feel the performance of those assets since theyre just sitting there ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.865541042926539
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#15",
                    "likes": "5",
                    "time": "11/10/2021-00:44:07",
                    "content": "Thanks for the post @rune and welcome back to the forums. Perhaps I’m in the minority, but one of the reasons I became interested in the project was because the tokenomics and value accrual were clear and transparent - there are clear KPIs that help any stakeholder understand the financial health of the project and ecosystem and it’s difficult to find one with more transparency. With that said, I’m not opposed to ‘modernizing’ our tokenomics provided any changes are made crystal clear to all stakeholders. The community needs to be truly aligned on the problems we are trying to solve, and incentives created in any design should improve or at least maintain the existing economics of the MKR token.     rune:  The goal of the Sagittarius Engine is to better direct the value flows of the Maker Protocol towards long term governance participants - the core of MKR holders that participate based on genuine interest in the project and its potential. In particular, a key goal is to help provide the push it takes to get a passive MKR holder to begin participating, by e.g. participating in sourcecred on the forum   If our goal is to increase the breadth of the community and engagement, I think there are some ‘quick wins’ the DAO can make to start.   Targeted Marketing about MakerDAO and the benefits to participating in Governance (SourceCred, job opportunities, etc). @PaperImperium joined the community six months ago as a small token holder and is among the top 3 earners all time in SourceCred and has the most MKR tokens delegated out of all delegates. If that’s not a success story for decentralized Governance I don’t know what is. a. Where? I’ll leave that to marketing experts, but first thoughts would be: Podcasts (e.g. Bankless), YouTube (e.g. Finematics), and anywhere providing educational crypto content.   Outreach - reaching out to leading University blockchain clubs, educating and engaging with them on MakerDAO. There are tons of brilliant young minds that we can reach through these clubs - people who are already interested in crypto and could maker valuable contributions to the DAO.   Improving the ‘onboarding’ experience of new forum members. From a new member’s perspective, opening the main page of the forums is overwhelming. This same is true for a lot of DAOs. I think having resources and educational documents for how the DAO works and how someone can get started participating is incredibly important.       rune:  To be able to access this benefit MKR holders need to lock up their MKR between 1-4 years, where a longer lockup gives access to a proportionally greater share of the benefit of being able to borrow Dai at beneficial rates - manifesting in a higher Debt Limit Growth rate which has some similarity to an APR by determining how much cash the user can borrow per day at the beneficial rate. Additionally, locking up MKR this way also increases the voting power of the locked MKR by up to 2x, helping to better align governance decisions with the will of voters that are verifiably exposed to their consequences for the long run.   I really like the idea of increasing voting power the longer tokens are locked up, and am interested in implemented it regardless of Governance decides to fully implement the SE. If I oversimplify the SE concept, it seems that instead of just burning MKR, the excess equity would be held in reserves to provide additional utility to MKR token holders in the form of an interest free loan. While this utility could potentially be tremendous depending on how much a token holder’s DC is, it is a drag on equity as @SebVentures mentions as the capital is not being used to generate any return. The contributions from new community members brought in through this proposal would have to significantly outweigh that fact and I’m not sure that just paying them directly through SourceCred, Grants, or CU work wouldn’t be superior.     rune:  Maker Governance should experiment heavily with different ways to distribute the new MKR, and figure out the ideal mix that provides the desired results. There are many options, including:  Providing MKR as standard yield farming rewards for users who have specific flagship collateral vaults, such as ETH, or ETH-LP tokens Providing flagship collateral vaults a special “discounted option” to purchase MKR pre-locked in Sagittarius at a steady rate, on e.g. a weekly basis, with a discount equivalent to the fast withdrawal penalty. Directly selling MKR for Dai using dutch auctions Directly selling MKR for Dai at a discount using “bonds” (A recent innovation by OlympusDAO) Directly selling MKR pre-locked in Sagittarius at a discount    If the community is open to issuing MKR, I would want to add incentives to new vaults/collateral types that support the clean money initiative. Specifically RWAs that meet sustainability and ESG criteria. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.033600971100971
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#16",
                    "likes": "4",
                    "time": "11/10/2021-18:25:05",
                    "content": "    rune:  a huge amount - I would say half - of all discussion, and especially all significant discussion and decision making, is being done by core units right now.   This is very important indeed. Indeed I, as a normal MKR holder following the forum but not belonging to any CU, have been feeling the risk recently that: RISK: governance’s incentives might shift towards rewarding contributors (CU members and other paid people) more than MKR holders (despite MKR vesting).     rune:  But that’s also exactly why we need a way to also recruit more active regular community members to balance this out -   Originally I thought people like @Planet_X, @flipflopflapdelegate and @PaperImperium @monet-supply etc would be these type of profiles, as delegates: people having to protect their interests. But indeed governance seems to have shifted towards paying them as well. While I am happy to see them rewarded for their good work, they now fall out of the category @rune is talking about. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2975563909774435
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#17",
                    "likes": "5",
                    "time": "11/10/2021-18:38:20",
                    "content": "    Aes:  If our goal is to increase the breadth of the community and engagement, I think there are some ‘quick wins’ the DAO can make to start.  Targeted Marketing about MakerDAO and the benefits to participating in Governance (SourceCred, job opportunities, etc). @PaperImperium joined the community six months ago as a small token holder and is among the top 3 earners all time in SourceCred and has the most MKR tokens delegated out of all delegates. If that’s not a success story for decentralized Governance I don’t know what is. a. Where? I’ll leave that to marketing experts, but first thoughts would be: Podcasts (e.g. Bankless), YouTube (e.g. Finematics), and anywhere providing educational crypto content. Outreach - reaching out to leading University blockchain clubs, educating and engaging with them on MakerDAO. There are tons of brilliant young minds that we can reach through these clubs - people who are already interested in crypto and could maker valuable contributions to the DAO. Improving the ‘onboarding’ experience of new forum members. From a new member’s perspective, opening the main page of the forums is overwhelming. This same is true for a lot of DAOs. I think having resources and educational documents for how the DAO works and how someone can get started participating is incredibly important.    This is great but we don’t just need quick wins. We need a complete overhaul of the political dynamic of Maker Governance so that regular MKR holders and community members come back into the central focus, and the thing that’s gonna bring us there is to combine these things PLUS aggressive and ambitious tokenomics.  as the capital is not being used to generate any return  The fact that the Dai is being lent out at 0% is exactly “the return” you’re looking for. It gives people a reason to be interested in MKR because of this unique and inherent advantage, driving them to lock up. As they lock up it creates a burn effect that benefits everyone else, so the capital is absolutely being deployed to benefit MKR holders. Whether it is better or worse than doing direct payments rather than cheap lending is what I think the discussion about “capital efficiency” should focus on. IMO cheap lending is more exciting even if it is harder to wrap your head around when thinking about it abstractly, but either way I am interested in moving forward with tokenomics that drive people to lock up their MKR, taking the blood oath and begin participating in MKR governance en masse to help save the world and get rewarded some way, whether it is direct payments or cheap credit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1812289562289555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dalin",
                    "index": "#18",
                    "likes": "3",
                    "time": "12/10/2021-05:38:28",
                    "content": "the growth of Maker need more people involve contributing capital and hardworking . but the problem Maker face is lack of incentives for Maker security , if there is a deficit , all MKR holders loss . It’s big challenge when Maker grow to 100B+ , many traditional banks go bankrupt when can’t handle the risk. I think that is why MKR is undervalued now , when USDC blacklist or other deficit risk happen , all MKR holder suffer the centralised risk . I think Ether has a simple and powerful tokenomics model : staking , burn , programmable SoV. staking is for cost for security , and burn is revenue from usage , SoV for holder without tax problem . so , we need a broad community to solve the risk when onboard more RWA with proper incentives , maybe like staking model , someone staking MKR and carefully handle the collateral risk , happy get the revenue share , and MKR holders can also sleep well with decentralised security guard . @Planet_X write the some articles about staking worth reading Planet_X Delegate Platform I also like the idea of zero interest loan for MKR , and I think the Dai in Surplus is too small to loan , and the Dai in surplus should buy ETH and MKR for long term holding . so I suppose we can just lend Dai to MKR holder with a lock vault  with limit supply to reduce death spiral risk. ETH is the economics bandwidth of ether ecosystem , and I think MKR also should be the bandwidth of Maker ecosystem . Maker is credit business , the market value will be the gravity . the higher MKR market value , the more collateral with lower risk, the more revenue Maker have , and the more MKR holder have confidence hold and lend free money , the more MKR locked and price up  . as MKR has utility , it will boost the demand of MKR , and lock the supply of MKR  image988×617 31.9 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.211309523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sberex",
                    "index": "#19",
                    "likes": "2",
                    "time": "12/10/2021-08:25:07",
                    "content": "I am as a small MKR investor completely oppose this proposal. My rational for a few years was based on solid fact that there is only 1 mln MKR. Printing 2 more millions is a complete disaster and market already pricing this proposal negatively as price of MKR token is falling. Protocol is turning into cash cow for dubious initiatives at the expanse of MKR holders and investors. Proposal is actually trying to lend DAI to MKR holders which is actually should be payed out as dividends to MKR holders without any preconditions. If this proposal will be accepted it will turn into real BLACK HOLE for vanishing MKR holder value. To be on positive side:  Don’t touch what already works for a few years (existing MKR burn mechanism). Allow MKR as a collateral for 0% DAI loans. Don’t triple MKR issuance from 1 to 3 mln MKR. Pay excess DAI to MKR holders if there is a problem to spend it.  Thank you and hope for the DAO to vote against this radical value destroying proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.797979797979798
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#20",
                    "likes": "9",
                    "time": "12/10/2021-09:29:03",
                    "content": "I am a long-time forum lurker who thought I would make an account to offer an idea about how further token emissions could work in alignment with the Sagittarius Engine. I wonder if there is a bold but (relatively) simple solution that might alleviate some of the criticisms of Rune’s design. From posts in this thread, it seems as though chief concerns about the SE include:  2 million further additional MKR is too many, and will destroy MKR’s value governance has previously said no to MKR rewards for depositors, borrowers etc the SE is too complex and hard to understand New MKR yield farming avenues will not lead to improved governance/long-term stakeholders (I would add that I think this is a strong point and that other DAOs, like Compound, are actively rethinking their token emissions for exactly this reason - dedicated yield farmers are rarely aligned with a project’s long-term interests, and lead to constant downward drag on a token’s price)  As a potential adjustment to the SE design to accommodate these concerns: what about issuing another 1 million MKR over a five-ten year period, proportionately distributed to holders who choose to lock their MKR in the Sagittarius Engine? This distribution would take the place of any other issuance and there would be no traditional yield farming. MKR distributed in this way would be locked on the same terms as the other locked MKR. This approach shares the advantages of the ‘black hole’ design set out by Rune above, but distributes the MKR more widely (to every participant in the SE, rather than just those who want to buy more at a discounted price). This is a simple, easy-to-understand approach to new issuance and should supercharge the launch of the SE. It rewards stakeholders with a long-term commitment to the protocol, in a more direct and quantifiable way than simply receiving additional governance votes. It also ensures that all of the token emissions go directly towards setting the SE alight (so to speak), rather than a more haphazard approach of standard yield farming that doesn’t necessarily help launch the SE. This narrower, more SE-aligned distribution of new tokens also has some distinct advantages in terms of meeting some of the critiques of Rune’s design so far:   Quite clearly, this approach will direct emissions towards long-term stakeholders at the expense of yield farmers who are not aligned with the protocol. This should improve Maker’s governance by expanding the array of people with an active and vested interest in the protocol’s development, and expand the (relative) influence and voting power of those willing to commit for the long term. This should be a much more important goal for Maker than maximising the number of people farming the token (given many of them will just sell the token and move on once the program is complete, as seen throughout DeFi).   It is very unlikely to harm MKR’s value, because all of the new tokens are directly locked up in the SE - they cannot be released early and sold before the end of the lockup period, even if the user chooses to pay the 15% withdrawal fee to withdraw their original MKR holdings.   In fact, it should lift MKR’s value, because (presumably) many MKR holders will want to lock up their holdings to receive the new tokens, and - in so doing - reduce the circulating supply. This is how MakerDAO can have its cake and eat it, too - drawing in new participants by incentivising long-term stakeholders with new tokens without reducing MKR’s value. This also gives the DAO a four-year period to successfully execute the ‘Clean Money’ vision and prove the value of the new tokenomics.   While the SE is still relatively complex, this approach simplifies it to a significant degree. Locking up now has a very clear, quantifiable benefit - token emissions - alongside the cheap credit Rune has outlined. There is no other yield farming or new emissions to worry about.   Maker can distinguish itself from other yield farming protocols, as this is not yield farming like it has been seen before. This is a point of difference for the DAO and a signal towards current and future contributors that the DAO will align the incentives of the protocol with long-term stakeholders - encouraging greater participation.   I appreciate that Rune detailed some problems with simply adding MKR inflation for locking up. The approach I’ve set out above is quite different to permanent 5% inflation. It’s more akin to leaning in fully to the black-holing approach, except that users don’t need to purchase the MKR.  Responding to some of the specific problems, Rune argued that focusing rewards solely based on lockups would make it “uncomfortable” just being a passive holder. My view is that it is fine to make things slightly less appealing for passive holders who don’t lock up. If there is no clear value add for SE users, then they won’t be locking up their MKR for four years or more - and while cheap credit is great, this isn’t nearly as simple or obviously beneficial as more MKR for SE users. I would argue passive holders also benefit from a protocol with a stronger narrative and tokenomics, as well (as above, I think MKR’s price is likely to increase with more targeted, SE-focused emissions). I also see no reason why rewarding SE users has to necessarily involve conservative token issuance - I agree with Rune that this is the perfect time to go pedal to the metal and supercharge the SE. The main downside with this approach may be the tax inefficiencies, but I see this downside outweighed by the benefits I’ve set out above (particularly as a simpler, clearer benefit to SE holders should see the whole system enjoy greater adoption and viability). Looking forward to further discussions about the SE and Maker’s next steps. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.711287150349651
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#21",
                    "likes": "7",
                    "time": "12/10/2021-09:30:57",
                    "content": "Thank you @rune for sharing this path-breaking and controversial vision. I think it is incredibly powerful to have someone outside of operations presenting a longer-term perspective on where we might take this ship. In the context of a DAO I deeply appreciate and respect individuals who present leadership without having explicit power or mandate—using earned trust and respect instead. There are quite a few of those in Maker, but I won’t namedrop because that’s not the point of this reply.  Personal views on the presented vision For what it’s worth, I’m sharing my views as someone who recently joined a CU as product manager, but also as a millennial. A millennial who is painfully aware of the climate change problem being the single largest human coordination problem we face today, and as a millennial who has grown deeply skeptical on our ability to coordinate change—nurtured by the incompetence shown by our governments facing global issues. One of the driving forces behind my obsession with crypto is the belief that money, as a social construct, is the most important and powerful coordination mechanism that we have today. Our ability to evolve money into a more fair and (even) more powerful form is something that makes me cautiously optimistic. I am excited to challenge my own climate skepticism through experimentation with DeFi’s novel coordination mechanisms in this context. In addition to the above, which is very personal, I also believe that this proposal is an opportunity for us to improve some components of Maker that feel archaic in the face of DeFi’s latest innovations. Think of a more powerful token economics design, a more focussed and deliberate growth strategy, and improvements to our governance process (eg. reduced cost of participation, improvements to composability for custodians and crypto indices) Thoughts on how to move forward It’s good to see lively discussion in the related forum threads, however I echo @wouter’s call for drafting a set of principles that we can use to 1) gauge community support for this direction and 2) coordinate the pivot when the time is right. I am looking forward to the work @luca_pro presented last week and I will try to make myself useful in this initiative, as well as some of my team members at DUX Core Unit.  As a product manager I think that it will be challenging for the CUs to coordinate a pivot like this—let’s not forget about the status quo that is currently holding over 13.5B worth of assets! I want to share a mental model that might prove useful in this context; Horizon 1/2. More below. Working on two time horizons in parallel The idea is as follows: Core Units work on two time horizons in parallel, being:  Horizon 1 (ie. iterating on the status quo and keeping the Maker system running safely and smoothly) Horizon 2 (ie. long-term work that is related to the pivot, such as architecture design for the Sagittarius Engine).  Horizon 1 work is subject to planning and roadmapping, however Horizon 2 work is experimental and explorative by nature. Therefore, in to prevent things from getting messy, I propose that Horizon 1 and 2 work should remain separated in CU operations. Separated in…  …time: eg. Dedicate one full weekday to Horizon 2 work and spend the other days on the status quo. …tooling: eg. Maintain a separate kanban board, documentation environment, and repository for Horizon 2 work. …team: CU team members could take on different roles for Horizon 2 work if they feel called to it.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.917483274301456
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#22",
                    "likes": "8",
                    "time": "12/10/2021-11:14:03",
                    "content": "That’s a great post, but I think you are underestimating the tax inefficiency. Income tax for regular people can easily be 30-40%, so that is 30-40% of all the MKR that’s being issued and going to regular people that is just being dumped and sent straight to governments. If you then add the fact that the new MKR would be locked, then you have an even worse situation because now where there might be people that get into a financial disaster because they didn’t know what they were getting into and suddenly are dealing with a tax bill they don’t have the cash to pay. If there isn’t a substantial risk of forfeiture then you are typically taxed up front when receiving tokens that are locked up. Overall I think going this route isn’t as simple as it seems, unfortunately. But if we do go that way, my intuition is that we’re better off giving people cash so they can easily pay their taxes and so the feeling of a direct, tangible benefit is maximized ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.480113636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#23",
                    "likes": "11",
                    "time": "12/10/2021-12:41:43",
                    "content": "I’ve thought of a new way to do compounding MKR yield farming with MKR that does not trigger income or capital gains tax prematurely Its based on using the locked MKR to borrow/generate Rewards-MKR “rMKR” which is the token that then gets staked/wrapped PETH-style to earn the yield farming reward, and then once you pay back your rMKR debt you can convert the remaining rMKR into regular MKR. Should allow us to distribute MKR to those who lock up their MKR long term with no efficiency loss unless I discover some fatal flaw. Will report back later when I can describe it in full detail. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.311688311688312
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#24",
                    "likes": "3",
                    "time": "12/10/2021-13:00:18",
                    "content": "    rune:  unless I discover some fatal flaw   The fatal flaw would appear to be that we’re actively designing tokenomics such that users pay less-or-no tax. Seems like a bad look with respect to all governments that we want to not regulate DAI and MKR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.6111111111111116
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#25",
                    "likes": "4",
                    "time": "12/10/2021-13:42:44",
                    "content": "I understand your concern in terms of how tax-optimized tokenomics could sound like by someone who’s looking to smear us, but MakerDAO is going to be paying plenty of taxes on things like RWA income, and there is no way to design tokenomics so that the users pay no tax, or less tax. It is possible to optimize the cash flows in a tokenomics design so those tax bills don’t coming up front when what’s happening is just that we are moving around tokens internally, not actually doing any economic activity in the real world (income from which, of course, morally and legally is taxable and can never be deferred). The tax still gets paid, in fact more tax gets paid this way because the tokenomics can work with greater efficiency and the taxes are paid at the end, after all the efficiency has compounded. Similarly, the more we optimize our tokenomics for tax, the more we can feel good about making sure that we are paying all the tax we need to, in our various real world deals or core unit money flows. Any sane business takes this approach to optimize when it’s possible to do so, but also strictly follow the law. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.175925925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#26",
                    "likes": "0",
                    "time": "12/10/2021-14:42:50",
                    "content": "“rMKR” earned by the user is likely recognized as income at least in the US – much the same as ETH earned on one’s stETH is income. But perhaps things are different in Europe/Asia. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sberex",
                    "index": "#27",
                    "likes": "0",
                    "time": "15/10/2021-18:54:45",
                    "content": "Still sorry, but I do feel an attempt to hide dissolving shares of existing MKR holders by 66,6% (2/3) behind tasty proposal of complexity and offering as a loan what MKR holders and investors actually rightfully own. Would be very happy to be wrong. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sberex",
                    "index": "#28",
                    "likes": "5",
                    "time": "16/10/2021-08:05:23",
                    "content": "The best option from my point of view would be:  Value for MKR holders:   MKR holder stakes his / her MKR tokens for 4, 5 or even 10 years (with penalty if early unstake from 10 to 25%). Monthly or quarterly MKR staker may claim his / her rewards in DAI which consists of say 33% of protocol revenue for this period. While staking MKR investor may vote for Governance proposal with increase in voting power depending on stake term (say 1,5 vote power for 4 years stake - 3 for 10 years stake).   Continue burning MKR   33% of protocol revenue goes to buy out and MKR burning as it was before   Protocol development and support   33% (and no more) goes to protocol development initiatives and support (not 50%, not 150% as it is sometimes happen now)  Note regarding taxes: Protocol does not have to save you or somehow help you to avoid taxes. It is everyones responsibility to pay taxes. Maker DAO is not tax consultent or optimizer. The are 197 countries in the world and each country has its own tax rules. It is crazy to try to take into account all these rules. \"…in this world nothing can be said to be certain, except death and taxes.” Ben Franklin ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.886904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tru_Greg",
                    "index": "#29",
                    "likes": "1",
                    "time": "17/10/2021-10:57:09",
                    "content": "    rune:  I don’t think in practice many people who lock up will actually consider that the cash they get out needs to be paid back, as long as the rate is 0% and the liquidation terms are very lenient, it will really just feel like “free money”, and on top of that having no tax on it will make it feel basically like a tax free dividend.   I guess it’s difficult to discuss taxes, regulators scrutiny, etc. on a public forum  I think your ideas are solid, and especially given your longterm “Maker-for-Life” perspective + the attempt to design a better system given current legal uncertainty around stablecoins / utility or rather pseudo-equity tokens… Yet people are a bit afraid that whatever the amount of MKRs they hold currently could loose value in short term (and that’s rather pretty certain) vs. quite complex and again uncertain outcome of the SE in the long term… As always some want their voices to be heard, others share very thoughtful and solid counters and some are fighting for what you’ve all managed to built over the years (including wealth). Long live the diversity, long live MKR! G ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.494030136530137
                },
                {
                    "author_link": "https://forum.makerdao.com/u/someone",
                    "index": "#30",
                    "likes": "3",
                    "time": "17/10/2021-19:02:32",
                    "content": "    rune:  Step 3: Reach final form with a permanent superpowered line of credit at 55% LTV, 0% interest rate, forever. Step 4: Spend it or farm with the money - it’s worry-free debt as it doesn’t accrue interest, and you have a one week grace period if you are at risk of liquidation.   A few interrelated questions:   In the early days when there are less DAI in the SE than the value of MKR that depositors want to lock up, who will get priority on loans? For example, the market cap of MKR is currently ~$2.5B. At a max LTV of 55%, the maximum possible demand for loans would be 1.375B DAI. But it will take a long time for the protocol to generate and deposit into the SE that much in pure profit. Until then, which MKR holders will be able to access the few millions of DAI in the SE? First-come-first-serve?   If some day there are more DAI in the SE than (market cap of MKR) * (max loan to value ratio), will the excess DAI be un-withdrawable? For example, suppose we send average of 1B DAI per year into the SE for the next 5 years, and after 5 years MKR’s total market cap is $7.5B. Then at at 55% max LTV, only 4.125B of the 5B DAI in the SE can be withdrawn as loans. What about the remaining 875M DAI?   Rather than calculating the amount of DAI that one MKR of collateral is allowed to withdraw as a LTV ratio based on the price of the MKR token, why not calculate it as a ratio of the total number of MKR tokens? For example, right now there are approximately 1M MKR tokens extant. In the early days if there are only 10M DAI in the SE, each MKR token would be eligible for 10 DAI. Later if there are 5B DAI in the SE, then each MKR token would be eligible for 5000 DAI.   Then the early/late-stage issues of a mismatch between MKR market cap and DAI in the SE would be sidestepped.   If we also have 0% interest rate, then it should remove most of the liquidation risk, even in the case of a MKR token price crash.   Then the only remaining liquidation risk would be dilution / new issuance. If we make the eligibility a fraction of the total planned issuance, that should take care of almost all liquidation risk (barring catastrophic situation where lots of MKR must be printed to cover bad debt). For example, if we are planning to issue 2M more MKR for a total of 3M, then each MKR token would be eligible for 1/3,000,000th of the DAI in the SE, even today before the new MKR are issued. This would also act as a soft enforcement mechanism of the total planned issuance number (a proposal to issue 4M MKR total rather than 3M would put many MKR-holders’ loans into liquidation, so it would have to be a very compelling reason for them to approve it).     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.308244206773619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#31",
                    "likes": "1",
                    "time": "17/10/2021-21:34:35",
                    "content": "    Matt_NZ:  the SE is too complex and hard to understand   Welcome! I don’t feel it’s any more complex than the original concept. It took time to see that through. It can be understood by anyone who takes the time and effort to understand it.     Matt_NZ:  proportionately distributed to holders who choose to lock their MKR in the Sagittarius Engine   As I understand it, the reason for the share dilution in this case is that the maker wants to expand this way, wants to raise additional capital, and not just to distribute additional shares among the previous owners.     Matt_NZ:  2 million further additional MKR is too many, and will destroy MKR’s value   It is generally believed that share buybacks have a positive effect on future share prices, while equity dilution has a negative effect. However, the comprehensive research in Share Buyback and Equity Issue Anomalies Revisited could not detect a strong negative effect. It can be a positive effect on the price of a stock dilution. I think its depends on the success of the project financed by the dilution money. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.538636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#32",
                    "likes": "13",
                    "time": "17/10/2021-22:05:02",
                    "content": "Updated the post intro to note that I am not happy with the reaction to this proposal overall, and as a result I’m now designing a v2 that I think will be a lot more powerful and provide MKR holders with a real, high APY from the MKR issuance and protocol income. It is absolutely crucial that if we do a tokenomics overhaul, it has to be to a new tokenomics system that gets people pumped and excited to hold MKR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.719602272727274
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#33",
                    "likes": "1",
                    "time": "18/10/2021-10:43:11",
                    "content": "Just a few stray thoughts!     purrfection:  As I understand it, the reason for the share dilution in this case is that the maker wants to expand this way, wants to raise additional capital, and not just to distribute additional shares among the previous owners.   I’m not sure that this ‘share dilution’ is about raising additional capital for the protocol per se - instead, it’s about better aligning long-term stakeholders with the platform (and incentivising better governance). I agree that this goal should be separate to a potential distribution of additional tokens among existing MKR holders and I don’t think anyone is suggesting that - if you’re an existing MKR holder, but don’t lock up in the SE, this tokenomics revamp won’t do too much for you and I think that’s just fine. The key is to try to align the protocol with long-term governors and there’s a few different ways that could be done.     rune:  Updated the post intro to note that I am not happy with the reaction to this proposal overall, and as a result I’m now designing a v2 that I think will be a lot more powerful and provide MKR holders with a real, high APY from the MKR issuance and protocol income. It is absolutely crucial that if we do a tokenomics overhaul, it has to be to a new tokenomics system that gets people pumped and excited to hold MKR.   This makes sense and I’m looking forward to seeing the revamped plan. Just to throw a few points out there that are outside the square - I think the better alignment we can ensure between the ‘Clean Money’ direction outlined in another post, and the SE tokenomics outlined here, the more successful the whole pivot will be. I note that on a different thread somebody thought they could be voted on separately. I think that’s understandable given that you could (theoretically) be proposing the SE tokenomics in the abstract - I don’t think at present there’s enough really connecting it to the Clean Money vision (other than maybe the climate NFTs, which I love). I don’t have any brilliant ideas about how to unite the SE with the Clean Money narrative (and it is tricky), but there’s a massive opportunity to (as you say) get people excited and pumped to hold MKR. If Maker switches to funding many clean energy projects, there could be some interesting ways to think about linking this with the the tokenomics. A couple of ideas:   ‘Bonus’ MKR, on top of whatever the main incentives for locking up end up being, distributed to MKR holders in the SE depending on how many clean energy projects were successfully financed in a particular year. It could be called a ‘clean energy KPI’ - and help incentive MKR holders to get more active in finding/supporting appropriate projects in line with the new project. There is some moral hazard risk if passive MKR holders vote in any/all clean energy projects notwithstanding due diligence, so the bonus should be relatively small.   This idea is definitely outside the square, but building on that core concept of cheap credit, one option could be to give grants of MKR (or even loan the MKR from the DAO for a long period of time) to real-world climate funds/projects who present a plan to the DAO for how they would draw upon the cheap credit. They then are granted/loaned MKR that is locked up in the SE, can’t be unlocked, but gives them that credit stream. This introduces new stakeholders into the Maker ecosystem with clear value alignment on Clean Money as a vision, and helps turbo-charge the pivot to financing clean energy projects - literally powered by SE cheap credit. I haven’t given this idea nearly enough thought and I understand it might not be popular! A less extreme alternative could be to spin up a new grants program, solely aimed at distributing MKR to climate researchers/smaller projects (I prefer this to yield farming as it will hopefully get new stakeholders with better alignment into governance)   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.035343434343434
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#34",
                    "likes": "0",
                    "time": "17/01/2022-16:43:41",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}