{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/delegate-pre-vote-notice-why-flip-flop-flap-delegate-will-vote-yes-to-the-community-greenlight-poll-for-robinland/12668",
            "title": "[Delegate Pre-Vote Notice] Why Flip Flop Flap Delegate Will Vote YES to the Community Greenlight Poll for Robinland ",
            "index": 12668,
            "category": [
                "Governance"
            ],
            "tags": [
                "mip6",
                "rwa-applications",
                "greenlight-polls"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "6",
                    "time": "15/01/2022-18:28:26",
                    "content": " Founder Artistry Great founders are anti-fragile. The more challenges you throw at them the better they get. The more impossible the situation the more focus they get. The Founder of Robinland (RBLD) Holdings LLC Scarlet Chen has recently displayed these characteristics. Scarlet’s relentless actions to join this community is currently being displayed in this Forum. From reaching-out and opening Forum discussions with Recognized Delegates, to researching the entry-points of the upcoming RWA requirements, we believe Scarlet has the elements of a founder who can understand and empathize. Most founders under the same circumstances would only analyze and sell. But we believe that Scarlet is on a mission to learn the MakerDAO way and become part of this great Community.  Improvising like a Jazz band The improvisation of the jazz band analogy describes how business teams are like jazz musicians who are able to improvise on the fly and just go with the rhythm  . Great startup teams are similar. Their creations are original based on insight and improvisation. The RBLD team has recently released an improvisational composition describing the five (5) reasons why they believe their MIP-6 applications deserves to be green-lighted for further review. These character traits signify a talented team that has the ability to respond to an improvisational jazz band riff . Rather than just playing the same musical tune that most MIP-6 applicants play, we believe that Scarlet and her team are willing to adapt to Maker’s request of onboarding via a RWA Arranger model, or a Delaware Statutory Trust (DST) legal structure. It is because of the reasons stated above and the ability for RBLD to understand the requirements needed to onboard via an approved Arranger, or via a DST set-up, that Flip Flop Flap Delegate will vote YES to green-lighting this MIP-6 application for further consideration.  3F Delegate Believes the Greenlight Polling Process will Improve As we all know this is a Community Greenlight Poll to indicate if RBLD will be added to the Collateral Prioritisation Sheet by the Governance Facilitators. But some Recognized Delegates believe that these greenlight polls are too opaque, and therefore many Abstain from taking a firm stand. Maker Governance along with @GovAlpha-Core-Unit understands that this is an obstacle. We believe that Delegates cannot continue to turn-away every MIP6 applicant. Its also understandable that Delegates do not have the resources, or ability to determine if an applicant deserves a “second-look.” Therefore, we believe that Delegates must improvise and do their best to take a stand on Greenlight Polls, in order for future MIP6 applicants to not get discouraged from joining the Maker community. With regards to the health of the proposed RBLD Collateral Type, the Real-World Finance Core Unit will be providing further guidance to MKR token owners. The incoming RWF Core Unit composed of a two-tier jazz band which includes “giga-brain” individuals like @williamr @Eumenes @luca_pro who have already set a game-plan in motion that will allow MKR token owners, and Delegates to make better decisions. The future is bright MakerDAO. Onwards and upwards! \"Like a great Artist, a great DAO also moves people beyond their logic\" -Unknown ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1IX9e2fyfz7djtDMKn5gMyGsyFxHoY75GncMbAjnSXrM/edit#gid=0",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/69",
                        "https://forum.makerdao.com/t/forum-at-a-glance-january-14th-20-2022/12752"
                    ],
                    "GPT-summary": "The post explains why the Flip Flop Flap Delegate will vote YES to the Community Greenlight Poll for Robinland. The author praises the founder of Robinland for her relentless actions to join the community and her ability to understand and empathize with the MakerDAO way. The post also highlights the improvisational skills of the RBLD team and their willingness to adapt to Maker's requirements. The post ends with a positive outlook for the future of MakerDAO.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 6.4081196581196584
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#2",
                    "likes": "2",
                    "time": "15/01/2022-19:43:13",
                    "content": "    flipflopflapdelegate:  like jazz musicians who are able to improvise on the fly and just go with the rhythm   A great analogy. It’s worth adding that those who can do this are those who can put the common goal before their own truth. Because I think that’s kind of how it works:  image760×670 49.9 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.357142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/quntangled",
                    "index": "#3",
                    "likes": "4",
                    "time": "15/01/2022-22:56:33",
                    "content": "As a fellow MIP applicant who is going through the collateral onboarding assessment process I am glad to see Robinland’s application is getting greenlit by such a prominent delegate @flipflopflapdelegate. Also I found Rune’s comment reassuring:    MIP6 Collateral Onboarding Application: Stable+; US Treasury Securities Up To 12 Months Duration   becoming an arranger shouldn’t just be a popularity contest,   as it gives great signal for those of us who are relatively new to the way MakerDao works. By the time we lodge the MIP6 applications, a lot of work and risk capital would have gone in. It is therefore great to see serious applications being given a fair chance. At the same time, we are willing to share our experience, knowledge and observations to improve the onboarding process so that Maker can lead the RWA space and achieve its vision. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-application-stable-us-treasury-securities-up-to-12-months-duration/12503/7"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.728650137741047
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Scarlet_Chen",
                    "index": "#4",
                    "likes": "2",
                    "time": "16/01/2022-00:54:40",
                    "content": "We really appreciate the support! We’ve been adding to our proposal answers to the feedback from the community as comments. As Elprogreso pointed out, we’re always here to discuss w/ the community to understand Maker’s concerns, amend our proposal/structure in a way to accommodate them, and we’re currently also looking into (1) a DST structure and (2) the Arranger model. We see lots of synergy between Robinland and Maker as Robinland has real estate industry specific expertise and connections and Maker is a leader in the blockchain world embracing RWA. Would love to keep the conversation going beyond the greenlight and we’re confident that we can build something innovative together that achieves Maker’s vision! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.482142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Scarlet_Chen",
                    "index": "#5",
                    "likes": "1",
                    "time": "18/01/2022-07:10:10",
                    "content": "Over the past weekend, the Robinland team has been looking into the Real World Sandbox (RWS) report Maker SES put forth last Oct (discussion 1, discussion 2) and discovered lots of similarities between Robinland’s proposal and the RWS structure and would like to summarize it here:  Robinland essentially serves as an Arranger based on the analogy of the Fed, commercial banks, and ultimate borrowers in the RWS report:  ‘MakerDao is the sovereign issuer, conduits are vaults, and ultimate borrowers are the users of those vaults. MakerDAO, like the Fed, writes the rules at which ultimate borrowers can access those discount windows.’ As pointed out above, Maker wants to operate as the Fed, thus needs arrangers in the Maker Monetary System to conduct the operational side of the tasks (because the conduits are vaults, but the vaults cannot execute those tasks themselves). In the Trad-Fi world those conduits are commercial banks, or better authorized deposit-taking institutions who can handle money flows and heavy-operations. As pointed out in our proposal, Robinland already acts like an Arranger to conduct heavy operational tasks such as project selection, risk management, foreclosures and court hearings.  Robinland brings stability to the Maker Monetary System by bringing in collateral that satisfies Maker’s requirement:  ‘Stability as core value. There is another point of contact: MakerDAO, like the Fed, should have the stability of the currency as its core value. … It is therefore very important, in my view, to converge on a vision of what type of lender could or should Maker be in the real-world financing stack.’ Whether it’s the RWS model or the Arrangers model, the key concept here is to bring stability to the Maker Monetary System. Again as mentioned in our proposal, Robinland controls stability at the source of the capital stack by selecting only full-recourse senior secured loans. ‘Maker should aim at becoming the ultimate lender against the highest collateral quality, leaving the rest of the value chain to allocate other portions of the risk spectrum.’ As an example for ECB, Robinland’s model is a type of Asset-backed security (terminologies in Trad-Fi). The underlying assets consist of senior real estate loans, which consist of A, AA, AAA bonds in credit rating, which are mentioned in the RWS report. ‘Real estate loans are often characterised as secured loans with the first charge over the collateral and returns lower than other asset classes. In this lending category, real estate marketplaces are solving the problem of construction companies and entrepreneurs and enables them to access capital quicker and at the affordable borrowing cost. Real estate loans include mortgages, bridge loans, refurbishment loans, as well as development or construction loans.’ The above are exactly the type of projects Robinland is going to onboard: full-recourse senior lien projects by real estate developers with top ratings, to help us build a better physical world with fast and cheap financing. Robinland packs all of the senior loans and creates a security token RBL that is backed by the entire portfolio which brings further stability by having mutual insurance of loan projects against each other in a portfolio. ‘We have identified (1) short-term corporate loans…(3) consumer loans…and (5) bank loans as the credit types that are more easily accessible with our vision of Maker’s positioning in the lending stack. To those categories, we might add so-called capital markets ready credit products that are often based on large, highly institutionalised, corporate and real estate loans. When coupled with the appropriate access structure (more on this below), those credit types do not typically require intensive oversight and offer a good combination of manageable size, velocity, standardisation, and regulatory oversight to mitigate Maker’s impact in case of delinquency. Other types of exposures should be assessed on an ad hoc basis, but for those higher requirements in risk/ return terms should be required.’ Again the type of collateral Robinland is bringing on board is exactly what the RWS report is talking about - easily accessible, capital markets ready credit products. As mentioned in our response to delegates’ questions, the reason why Robinland chooses full-recourse senior lien real estate debt is precisely because it’s highly institutionalized and very standardized. There’s a robust secondary market for this type of collateral, so even when Robinland needs to offload the asset it can happen in a matter of 1-2 weeks.  Robinland is precisely the ‘counterparty’ mentioned in the RWS report:  ‘As we have discussed in Maker’s Best Position Within the Lending Stack, we do not envisage Maker to deal directly with the ultimate borrowers, but rather with wholesale intermediaries. This means that the underlying credit collaterals will come packaged in some way by one or more financial intermediaries that will be Maker’s main counterparty.’ This is precisely what Robinland does as it satisfies the (1) seniority in the capital stack (2) deals with the ultimate borrowers for Maker (3) act as wholesale intermediary (4) package the underlying collateral into portfolio to issue the RBL token (which is then used as collateral to access Maker’s financing) ‘It is the Author’s belief that acting as a super-senior, programmatic, lender of the highest quality collateral in passive partnership with sophisticated and motivated intermediaries could be consistent with Maker’s core mandate of protecting the DAI, as well as with the principles of economic sustainability, decentralisation and dynamism at the base of the project.’ Robinland is precisely such ‘sophisticated and motivated intermediaries’ who can act as quality controller, risk manager, and executor of real-world operational-heavy tasks. Robinland developed a proprietary Credit Risk Model for internal risk management. The goal of the Credit Risk Model is to assess the expected loss of Robinland’s entire portfolio of loans under different portfolio combinations and projected economic conditions in the near future, which we can share upon request. Robinland’s measurement and collateral packing are highly matched with the recommendations mentioned in the RWS report. Robinland are the ‘sophisticated intermediaries’ who can bring value to the MakerDao community.   Lastly, we are aware of Maker’s internal risk control, and we intend to offer Maker the safe harbor as a super-senior lender by creating a DST structure. We’re in the process of scheduling to chats with some of the key person behind the Maker DST structure put forth in the 6s capital case.   The following is a bullet-point style summary of what Maker is looking for, and highly coincides w/ what Robinland mentions in its proposal:   'For this reason, after having identified the credit types that are more indicated as RWF collateral, we should do the same with the counterparties. There are a set of characteristics that associated with all counterparties, e.g.:  Alignment of interest (and especially skin in the game)  Regulatory status  Geography  Size (i.e. AUM)  Track record, for both the management and the credit underwriting teams  Management experience  Ability to originate/ scalability (asset class specific)  Ability to service (asset class specific)  Credit performance management (e.g. managing arrears, recovery, seasoning)  Data quality  Investors/ co-investors profile  Ability and proactivity to deal with the peculiarities of MakerDAO as DeFi counterparty Each credit type will have its own minimum threshold of quality for each of those characteristics, and it will be the underwriting teams’ responsibility to assess them. Funding Structures Typical funding structures. There are several structures that are common in the credit/ alternative credit markets – i.e. structures that are used by financial intermediaries to package credit assets to distribute them to other investors. Structuring becomes even more complex in the context of a DeFi-TradFi bridge. In TradFi, financial institutions access credit that hasn’t been directly originated by them in several forms; the list below, although not comprehensive, describes some of the most important, in order of complexity:  Bond (rated) issued by the lending platform – using underlying credit as additional collateral  Tranche (senior, rated) of a securitised pool of originated loans  Share of fund, directly owning and managing the underlying credit  Direct loan to the lending platform – using underlying credit as additional collateral  Forward-flow of originated credit, sitting in a bankruptcy-remote special purpose vehicle (SPV) Maker’s additional criteria. The specific (non) legal and technological nature of MakerDAO requires additional criteria that should be assessed when evaluating an available structure, e.g.:  Direct, non-intermediated, access to the collateral pool (in tokenised form)  Engagement of external auditors regularly providing financial and business reviews  Available, liquid, secondary market in support of a semi-automated liquidation  Presence of junior investors or pari passu co-investors with credit servicing abilities  Presence of mandated legal entities that might act in the interest of the DAO’ ",
                    "links": [
                        "https://forum.makerdao.com/t/real-world-sandbox-final-deliverable-for-consultation-round/11915",
                        "https://forum.makerdao.com/t/ses-project-real-world-sandbox/10910",
                        "https://www.ecb.europa.eu/mopo/assets/standards/marketable/html/index.en.html"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.621535036778939
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "19/04/2022-13:10:43",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}