{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/crimson-creator-cluster/18241",
            "title": "Crimson Creator Cluster ",
            "index": 18241,
            "category": [
                "Governance"
            ],
            "tags": [
                "endgame",
                "metadao",
                "creator",
                "cluster-intro",
                "metadao-cluster",
                "crimson-cluster"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "43",
                    "time": "05/10/2022-13:51:50",
                    "content": " Crimson Creator Cluster We are the Crimson Creator Cluster, and aim to become the core team of a Creator MetaDAO (pending governance approval) that builds a large userbase with a easy to use DeFi frontend offering both Maker products, yield farming and innovative new products - starting with our own advanced lending engine. Anyone will be able to farm the Creator tokens with Dai, ETH or MKR through our frontend, and participate in building the DAO from the ground up, developing its brand and governance culture. We provide the technical and business skills to amplify and spread this community through growth hacking and innovative features that set us apart. As a Cluster, we are not launching a MetaDAO. We are preparing to make a proposal to the governance process of a MetaDAO created by Maker after tokens have been distributed via yield farming and it is capable of independent governance decisions.  Cluster Pitch  What problem are we solving? Maker’s superpower has always been cheap cost of capital due to the success of DAI as the most popular decentralized stablecoin. However, Maker has struggled to gain traction on the supply-side. Our primary lending use case during the last bull run was as a wholesale lender to CEXes who would pocket the interest spread. This demonstrates there is strong demand for frictionless, fast, low fee user experiences. The only ones providing this at the moment are centralized exchanges. Although Maker is capable of providing credit to these protocols / CEXes, their missions may not align with the DAO. Maker is dependant on external counter-parties.  What is our solution? We want to bring to life new products on top of Maker with the best rates in the market due to low cost of capital via D3M injection. Our solutions will provide seamless, high quality user experiences all with best in class security practices. Safety and scale is our mission to support the DAI ecosystem. The initial product will be a fork of a best-in-class lending engine retrofitted to integrate directly with Maker via D3M. This will provide the MetaDAO with access to new markets such as higher collateralization (no OSM delay), rehypothecation of collateral (delta neutral / short strategies) and cross-collateralization. Features we know existing users of Maker have requested in the past. We will be focused on large scale market segments. We are not interested in supporting long tail assets - only ETH, BTC and staked eth derivatives. Security is a big component of borrowing confidently at scale. As such we will aim for redundancy across two oracle networks - Maker and Chainlink. A third, potentially on-chain, oracle network can be investigated in the future as well. DeFi users of the future will expect chain-agnostic, multichain user experiences that abstract away the individual blockchains and just give them the best rates and the lowest fees. We are including this trend in our thinking from the start. An additional upside and source of long term income is that we can provide all of our in-house projects for other MetaDAOs to copy, and in return pay our MetaDAO a revenue share under the Plug and Play Protocol model. We will implement a new model of community-led product innovation whereby we will involve and incentivize our users in the product development process. It is our thesis that combining a best-in-class frontend with the security and permissionless nature of the blockchain will be a winning formula. As more scaling solutions such as zk-rollups come online we feel we are best situated to capture this new market of users wanting fully decentralized, high quality interfaces.  Community Meta  The role of our community Initially, users will come looking for lowest rates, security and robustness. We will convert them to long term community members by building a high quality brand / UI and engaging them in the definition of the future developments. Users will be able to farm the MetaDAO token, giving them a direct stake in the DAO. The self-emergent community of token holders that farm the tokens will make the fundamental decisions about the brand and name of the MetaDAO, although we will of course provide our professional input and support (the Crimson cluster name is temporary and meant to be replaced with a name decided by the community). New markets can be identified by crowd-sourcing high quality DeFi products and build opportunities by the metadao community members. For example, if there is large demand for a high speed derivatives product or a margin solution we can prioritize accordingly. We will promote a culture of data-driven recommendations and user involvement. We want ecosystem actors to be part of our community, as we will collaborate with them to provide services wherever possible to ensure we have a rapid go-to market strategy. This is encouraged from the projects themselves. We want the teams to keep building by providing revenue share for their hard work. We can all win together. The MetaDAO core team will be focused on coordination, integration and branding and less on building new products.  3770×2100 510 KB   Supporting community governance We will support the community with providing market research, trends, and product usage report to enable data-driven governance decisions. We will incentivize users to provide feedback and be involved in the product development. We believe establishing a tight, collaborative feedback loop of between the experience of the community and the MetaDAO team is a major opportunity most DAOs are getting wrong. Community members with more commitment to the research and bringing new opportunities to the MetaDAO should have a bigger say in product decisions.  Team My name is Sam MacPherson (aka hexonaut), and I’ve been a serial entrepreneur all my life. I currently work on the Protocol Engineering team. We have 4 others in this cluster (TBA) with a wide range of skills to cover all our bases.  Cluster Membership Sam - Cluster Facilitator TBA1 - MetaDAO Facilitator TBA2 - Contributor TBA3 - Contributor TBA4 - Contributor ",
                    "links": [
                        "https://forum.makerdao.com/t/defining-the-crimson-creator-cluster-with-hexonaut-on-drinks-w-makerdao-delegates/18773",
                        "https://forum.makerdao.com/t/relay-semanal-20-de-octubre-28-de-octubre-del-2022/18703",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/19",
                        "https://forum.makerdao.com/t/announcing-phoenix-labs-and-spark-protocol/19731",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/24",
                        "https://forum.makerdao.com/t/relay-semanal-29-de-octubre-4-de-noviembre-2022/18729",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/23",
                        "https://forum.makerdao.com/t/governance-and-risk-214-november-03-at-17-00-utc/18637",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/22",
                        "https://forum.makerdao.com/t/relay-semanal-14-20-de-octubre-2022/18516",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-15/18478",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/21",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/21",
                        "https://forum.makerdao.com/t/relay-semanal-29-de-septiembre-6-de-octubre-de-2022/18363",
                        "https://forum.makerdao.com/t/mip40c3-sp85-modify-sidestream-auction-services-core-unit-budget-sas-001/18253/3",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/23",
                        "https://forum.makerdao.com/t/4-boletin-de-noticias-febrero-de-2023/20078"
                    ],
                    "GPT-summary": "The post explains the Crimson Creator Cluster's proposal to become the core team of a Creator MetaDAO that builds a large userbase with an easy-to-use DeFi frontend offering both Maker products, yield farming, and innovative new products. The proposal aims to solve Maker's struggle to gain traction on the supply-side by providing new products on top of Maker with the best rates in the market due to low cost of capital via D3M injection. The post also discusses the role of the community in the proposal and the team behind it. The post may receive constructive criticism and questions from third parties, and the author may be open to collaboration.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.915334896584897
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#2",
                    "likes": "1",
                    "time": "05/10/2022-16:25:45",
                    "content": "This is exciting. @hexonaut, I know you’ve been championing canonical DAI and mutli-chain strategy at Maker, a vision I found exciting and sensible. Is this still part of this metaDAOs vision? ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/19"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#3",
                    "likes": "4",
                    "time": "05/10/2022-18:03:42",
                    "content": "I’ve asked Sam to join the Endgame call happening today, in one hour. (You can find the invite link on MakerDAO discord #meetings channel) It will be a great opportunity to ask any questions about the Crimson Cluster specifically, or the MetaDAOs and clusters more generally, and especially discuss the practicalities of how to actually do it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.35
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#4",
                    "likes": "11",
                    "time": "05/10/2022-18:03:45",
                    "content": "Absolutely. Ethereum will be turning more and more into a settlement layer, and it’s becoming increasingly clear that high-throughput applications are likely to move to Layer 3. My personal view is that we will see: Layer 1: Settlement Layer 2: General Purpose / High Liquidity Layer 3: Application-specific / High Throughput We want to be present on all these, so we can make the proper trade-offs to deliver optimal user experience. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.883333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#5",
                    "likes": "2",
                    "time": "05/10/2022-18:28:53",
                    "content": "Do you envision a DAI payments app being built as a layer 3? If so, would this creator metadao have any part in its creation? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#6",
                    "likes": "4",
                    "time": "05/10/2022-18:31:53",
                    "content": "We are focused on DeFi-native and less interested in interacting with the fiat world, but I wouldn’t rule anything out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#7",
                    "likes": "4",
                    "time": "05/10/2022-20:11:14",
                    "content": "Writing as a community member, not official ISCU communication. I’m really excited to see this proposal. It’s even more ambitious than MIP75c3-SP1: Onboard Task Force - Growth Task Force To me, this looks like the beginning of Maker as a startup incubator. Wonderful! This is framed as part of the EndGame, but why couldn’t Maker do this without MIP84/POVE? ",
                    "links": [
                        "https://forum.makerdao.com/t/mip84-activate-protocol-owned-vault-emulation/17713"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.65625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ekryski",
                    "index": "#8",
                    "likes": "1",
                    "time": "05/10/2022-23:26:32",
                    "content": "    lyt:  Do you envision a DAI payments app being built as a layer 3? If so, would this creator metadao have any part in its creation?   Happy to step in to see if we can help with this if it’s not a focus of crimson cluster. Some more details here and here for some additional context. Exciting stuff!  ",
                    "links": [
                        "https://forum.makerdao.com/t/argentines-seek-usd-exposure-via-stablecoins-amid-surging-inflation/16320/32"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#9",
                    "likes": "7",
                    "time": "11/10/2022-12:17:00",
                    "content": "The main upside of the Endgame Plan and MetaDAOs is the capacity to contain a lot of innovation, features and complexity in the Maker Ecosystem without weighing down Maker Governance with a linear amount of risk and relationship management. Instead of the current top-down approach of the Core Units we can use “Self-Contained KPIs” such as Revenue Share and overcollateralized Lines of Credit to greatly simplify, derisk and thus scale up how much activity can be simultaneously supported in the ecosystem. This first cluster announcement by Sam and his potential team does a great job in making that upside a lot more tangible than all other material so far. I’m very happy we have gotten to this stage before the voting actually begins so that voters can consider all of the implications and actual value the Endgame Plan brings to the table. I think the first order value proposition is clear: A lean, skilled and fully aligned team set up with the necessary complimentary skillsets and a broad and flexible mandate to execute within the framework of the Self-Contained KPIs. Maximum innovation, minimum red tape, and MKR holders get to directly participate in the upside without having to micromanage or take direct risk. Very excited to hopefully see it play out in action and see how such a high potential team will synergize with a fully decentralized and autonomous community that will have its own will and spirit self emerge through the magic of permissionless tokens and yield farming. The thing I’m most excited about from this announcement and vision, though, is that it is already paying off on the “fractal scalability” thesis that multiple people have proposed during the development of the Endgame Plan where MetaDAOs themselves will attempt to scale through similar extremely scalable “Self-Contained KPI” mechanisms as Maker Core, and amazingly the Crimson team has already come up with the major innovation of voluntarily sharing a portion of their rev share with fork partners, in order to derisk and scale their ability to fork a lot of different projects and use them to generate value in the Maker and MetaDAO ecosystem. The Endgame Plan offers an extra upside to this kind of radical organizational innovation at the edge, as such an agreement can actually be made enforceable through the Ecosystem Scope in Maker Core, making it possible for a MetaDAO to offer a deal to a fork partner that they cannot then run away from, as it will be a valid enforceable Ecosystem Agreement regulated through the Maker Core Ecosystem Scope collateralized by the MetaDAOs assets. Being able to put such a strong and unescapable guarantee on the table should make such deals much more attractive and reliable, increasing the likelihood of fruitful and deep collaborations. This is probably just the first example of more radical innovation that can occur at the edges of the Maker Ecosystem through the power of permissionless innovation that MetaDAOs unleash. We can expect orders of magnitude more innovation like this as the MetaDAO ecosystem actually goes live and scales to multiple generations of continuously evolving MetaDAOs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.095619328882041
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#10",
                    "likes": "2",
                    "time": "12/10/2022-23:15:13",
                    "content": "Appreciate the kind words and support Rune. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cwalk",
                    "index": "#11",
                    "likes": "2",
                    "time": "11/11/2022-04:12:26",
                    "content": "Hello, my name is Chris Walker (aka cwalk). I am one of the two co-founders of Debt DAO, along with Kiba Gateaux. We both have a long history in crypto, tech, and finance having worked at startups, JP Morgan, ConsenSys, and numerous DAOs over the past 5 years. After participating on the Governance & Risk call last week, one quote stood out in particular from @hexonaut… “We are not focused on RWA. We have no plans for that in this metaDAO.” This reiterated our belief that we are fully aligned with the long term vision of the Crimson Cluster. Cryptonative credit (CNC) introduces the concept of automated operations and programmatic enforcement to credit products. Debt DAO is a p2p marketplace for CNC built on our secured lending solutions. Our Spigot contract secures borrowers’ on-chain cashflows to automatically repay lenders in a trustless manner. We want to co-chair a seat on the Crimson Cluster. Our mandate will be to build CNC products and the supporting infrastructure & services in an effort to increase DAI supply through:  DAO credit lines with fixed interest rates Liquidity-as-a-Service credit lines Financing leverage token products Crypto M&A, facilitated by transfer of ownership/control via Spigots Receivables financing   Cryptonative Credit (CNC)  What does it really mean? In traditional finance, bond and loan obligations are enforced in bankruptcy courts based on a signed loan agreement between borrowers and lenders. Bankruptcy proceedings can take anywhere from 6 months to multiple years depending on the type of bankruptcy. With CNC, there are no legal entities and the agreement is executed on-chain, trustlessly, with recourse programmed to take a higher percentage of revenue for loan repayments or to liquidate collateral to repay debt automatically with no delay or legal fees. CNC is an emerging market with outsized growth to be seen in the years ahead. When compared to global fixed income markets, CNC today is over 80,000x smaller in market value ($125 trillion global credit markets vs $1.5 billion peak crypto credit)  Benefits of CNC For Lenders  Increased security through collateralizing a DAO’s on-chain revenue via the Spigot with trustless assurances that a borrower will repay Recourse via priority repayment, programmatically enforced Withdraw deposited capital on-demand if funds aren’t drawn down by a Borrower Receive a return on deposited capital even if funds are not drawn down Compete with other Lenders in Borrower credit facilities via differentiated interest rates  For Borrowers  On-demand liquidity. Only use what you need, when you need it Flexible and sustainable financing for both OpEx and longer term growth initiatives Leverage future cash flow/revenue (assets you don’t even have yet) to drive growth No need to sell governance tokens or ETH at depressed valuations in a bear market   Crimson Cluster Proposal  - Productizing Credit We believe it makes sense to develop and explore CNC together. There are many common players in the Maker/Crimson Cluster ecosystem and the Debt DAO Marketplace. We propose to have one seat in the Crimson Cluster devoted to CNC and focused on helping Maker DAO create, develop and be a key lender within CNC markets. We (cwalk and Kiba) would co-chair the membership together. We would contribute to helping MakerDAO build products that will increase DAI’s stablecoin dominance and increase total supply. CNC will mesh well with Maker’s efforts to increase the adoption of DAI as the preferred stablecoin for DAO treasuries and to further back DAI with on-chain economic activity. To summarize, our mandate will be to build CNC products and the supporting infrastructure & services in an effort to increase DAI supply through:  DAO credit lines with fixed interest rates Liquidity-as-a-Service credit lines Financing leverage token products Crypto M&A, facilitated by transfer of ownership/control via Spigots Receivables financing   What is Debt DAO? To learn more about Debt DAO, please find some helpful links below:  Fundraise announcement GitBook GitHub  ",
                    "links": [
                        "https://twitter.com/debtdao",
                        "https://twitter.com/KibaGateaux",
                        "https://www.sifma.org/resources/research/research-quarterly-fixed-income-outstanding/",
                        "https://dune.com/octavionotpunk/debt-dashboard",
                        "https://docs.debtdao.finance/products/line-of-credit/revenue-backed-financing",
                        "https://mirror.xyz/meta-gov.eth/t4E8nbM4RDlNfSQjH_iqMvBiej_NG8BZM5UHy2BROPM",
                        "https://docs.debtdao.finance/overview/what-is-debt-dao",
                        "https://github.com/debtdao"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.169402356902357
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#12",
                    "likes": "0",
                    "time": "10/02/2023-10:13:20",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}