{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/deco-q3-2022-forum-update/18401",
            "title": "Deco Q3, 2022 Forum Update ",
            "index": 18401,
            "category": [
                "Core Units",
                "Deco Fixed Rate"
            ],
            "tags": [
                "cu-update",
                "deco-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#1",
                    "likes": "9",
                    "time": "17/10/2022-22:55:46",
                    "content": " Deco Q3, 2022 Forum Update 22.10.15 Deco is pleased to update the Maker community regarding its Q3 progress. Deco has formally verified the dss-gate smart contracts. The formal verification was performed using the Certora Prover Tool. Utilizing CVL specifications, no bugs were found in the dss-gate contract. The Certora specification has been committed to the repository and a detailed report is available, which contains the Certora results, setup, and installation instructions. We would like to thank the Protocol Engineering team for their extraordinary support in assisting the Deco team in completing the formal verification. The Gate and Claim Fee Maker contracts are now deployed to the Goerli testnet. We have utilized Gate’s ability to run a standalone without being linked to VAT and governance to facilitate testing. You can utilize the deployment scripts repo for your local deployment and testing purposes. On the Sales side, the Deco Core unit has held initial discussions with the Growth Core Unit to identify potential institutional customers who may be interested in locking-in a rate using Deco. Q4 Tentative Plan We will be making additional progress on the Patent, Copyright, Securities, and other pertinent legal issues review. We will deploy Claim Fee Maker on mainnet and create a Spell contract library to support governance in its execution of necessary actions. We will continue our collaboration with the Growth Core Unit and plan to do a test run on mainnet with at least one vault customer. We are available to chat in #deco-fixed-rates-public or can be reached at [email protected] ",
                    "links": [
                        "https://github.com/deco-protocol/dss-gate/blob/master/certora/Gate1.spec",
                        "https://github.com/deco-protocol/code-reports/blob/main/Deco-Dss-Gate-FormalVerification-Report.pdf",
                        "https://goerli.etherscan.io/address/0xdbf193627ee704d38495c2f5eb3afc3512eafa4c",
                        "https://goerli.etherscan.io/address/0xa4e51a338a29cdb7a160b18c6a0b5c21e301e840",
                        "https://github.com/deco-protocol/deploy-claim-fee-maker",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-september-2022/18288",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-october-2022/18650"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.811649659863946
                },
                {
                    "author_link": "https://forum.makerdao.com/u/freehold",
                    "index": "#2",
                    "likes": "1",
                    "time": "14/11/2022-02:28:29",
                    "content": "Super excited to see this type of interest in innovating on top of Maker in an accretive way to the protocol.  Have you considered partnerships to provide offerings to Aave Arc or Compound Treasury customers? Honeypot of institutions that are willing and able to generate yield / borrow against their assets in DeFi. Fixed rate borrowing may be an attractive option particularly in this macro environment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.890625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "12/02/2023-02:28:39",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}