{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/core-unit-on-strategic-planning/15250",
            "title": "Core unit on strategic planning ",
            "index": 15250,
            "category": [
                "Core Units"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Ashish",
                    "index": "#1",
                    "likes": "9",
                    "time": "18/05/2022-11:12:39",
                    "content": "Hi Maker DAO community, I think the core unit framework is a best in class idea with DAOs. I was looking around to see  whether there has been any discussion on forming a core unit for ‘Strategic Planning’. However could not find any discussion on it. If i have missed something, please point me to it. In my mind a Strategic Planning core unit would play these roles  Be a catalyst for ideation and alignment on key priorities for Maker DAO Work with other core units to formulate a coordinated action plan Help with status checks and trigger discussions on any course corrections required  I believe something like this could be helpful in strengthening the DAO and our market position. Thanks, Ashish ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.175000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "3",
                    "time": "18/05/2022-18:08:00",
                    "content": "You have not.  This was something I mentioned in a previous G&R call that would be ideal for Delegates to forum since they are the active governance participants on the MKR side of the Maker. I didn’t get much traction to the discussion at the time. Rune seems to be leading a MKR governance discussion trying to get more MKR holders to participate in some way with governance but I don’t believe those discussions have evolved enough to embrace the above topic. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.928571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ashish",
                    "index": "#3",
                    "likes": "0",
                    "time": "19/05/2022-11:29:39",
                    "content": "Thank you for your reply @MakerMan The way i am looking at it, this would be more of a planning and coordination team. It would not be in the same stream as governance work stream. How i think it helps: Maker DAO is already doing a good job with the core units structure. The Strategy core unit can make Maker a stronger entity by aligning everyone and increasing efficiency. This team would deliver   Priorities for Maker DAO This can align all stakeholders and be used to attract new ideas and proposals  An action plan . This will help all core units work more in tandem and allocate resources efficiently  Review and updating To check progress on plans and make necessary changes  This will not be a top down process. Will need to be collaborative, with the other core units & the community.  Having delegates in this team is a great idea. Do you think this is something that would interest you. We could flesh out a structure and see if it interests the community ? Thanks, Ashish ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.314920033670034
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#4",
                    "likes": "8",
                    "time": "19/05/2022-12:01:09",
                    "content": "Hi Ashish, who is “we” in this context? While there is no core unit who does this kind of planning, the elements you are mentioning have definitely been considered and some efforts have been made to accommodate strategic planning: Creation of cross-core unit initiatives with stakeholder engagement, requirements analysis, ideation and solution design, and ultimately the creation of roadmaps and planning. Currently the major initiatives are L2 (currently facilitated by @Derek), Collateral Management On-Chain (CMON, currently facilitated by @Davidutro), Collateral Management Off-Chain (CMOFF, currently facilitated by @Retro), security (SEC, currently facilitated by @psychonaut) and Resilience Improvement (RES, currently facilitated by myself). RES is the first one that also includes delegates as stakeholders. One way of looking at this emergent structure from high-level vision and strategy to practical tasks:   MKR Voter Committees - connect MKR holders and delegates   Strategic Initiatives - connect delegates and core units (such as RES)   Cross-CU Initiatives - coordination among core units around roadmaps and launch plans (such as L2, CMON, CMOFF, and SEC)   Internal CU roadmaps   We (@SES-Core-Unit) have been supporting the formation of these collaboration structures. We are also working on our DAO Performance API and Dashboard which will formally document these elements in one place. Happy to add more details if you would like to learn more. ",
                    "links": [
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207/53"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.690625000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ashish",
                    "index": "#5",
                    "likes": "0",
                    "time": "23/05/2022-12:43:40",
                    "content": "Thank you for the detailed reply @wouter I appreciate it. And i do not mean to question and team. Maker DAO is way ahead in terms of setting best practices. The SES mandate is also very nicely thought through. The cross-core unit initiative sound like a great idea. I am guessing it must help a lot with alignment, planning and coordination. I am cognizant of your time, but am tempted to ask for some more details. In case these items have been considered at some point, what was the thinking, etc. These can provide useful inputs for both scaling & developing moats  An external perspective  Environment scanning Competition scanning   Internal analysis  Performance (protocol, earlier initiatives, etc)   A top down approach from the protocol POV  Vision & platform level targets to → strategy, priorities and projects Innovation around core product  and operations (operating teams can at times be blindsided to these)    My questions are not intended to underplay the great work being done, i hope it is not coming across as that. I do understand that we are in an evolving space and believe that core units are already breaking new ground. I am a DAO enthusiast myself and was attracted to the core units concept of Maker, and am just curious to see how it works and if i can help with anything. Thank you for your patience. Best, Ashish ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.916781788472965
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#6",
                    "likes": "1",
                    "time": "23/05/2022-21:58:07",
                    "content": "This sounds like extra bureaucracy with little value add. A Strategic Planning CU would be yet another group that other CUs would need to organize with, which could easily turn it into a net negative for Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.850694444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#7",
                    "likes": "1",
                    "time": "23/05/2022-22:19:00",
                    "content": "   Open Decentralized Voter Committee Tuesday 5pm CEST - join if you are an MKR holder   The goal of these general voter committees will be to try to agree on an overall top down structure of how to categorize the activities and strategic initiatives of MakerDAOs decentralized workforce, in order to create more specialized voter committees that cover each category.   For this upcoming call, tomorrow tuesday at 5pm CEST, I have asked Sustainable Ecosystem Scaling to provide a short overview of the different initiatives that exist within the core units now. The goal will be to try to find categories that already have enough interest for MKR holders to join if we begin arranging voter committees for them. So far there has been interest in an RWA voter committee. Will post a link here in this thread       Open Decentralized Voter Committee Tuesday 5pm CEST - join if you are an MKR holder Governance       After the success of last weeks Tuesday Voter Committee where almost 100 people showed up, I will be repeating the calls every week at Tuesday 5pm CEST.  The goal of these general voter committees will be to try to agree on an overall top down structure of how to categorize the activities and strategic initiatives of MakerDAOs decentralized workforce, in order to create more specialized voter committees that cover each category.   [image] [image]  For this upcoming call, tomorrow tuesday at 5p…     ",
                    "links": [
                        "https://forum.makerdao.com/t/open-decentralized-voter-committee-tuesday-5pm-cest-join-if-you-are-an-mkr-holder/15330"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6080246913580245
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ashish",
                    "index": "#8",
                    "likes": "3",
                    "time": "24/05/2022-12:09:05",
                    "content": "It is interesting you say this @CodeKnight  Though in my limited experience, i have seen quite the opposite. I believe it comes down to how the process is run. I worked on strategic planning in an organization that had a distributed and matrix structure, and each team was lead by an experienced senior leader. These teams actually felt more confident and empowered as they had more information and perspectives to take their decisions. They regularly sought us out, and also invited us to their internal working teams, which they really did not need to. For DAOs in general, if i can just elaborate through a few simple points   Is this important / helpful?   The process lets the team consider more inputs. This should help with their decisions and plans   An organization is the aggregation of its teams. So this adds up to a stronger organization - better growth, competitive leadership and moats   We should also be mindful that Web 3 will get into a more competitive phase now and will face an evolving market     Who should work on  it   For domain specific areas, it should rest within the relevant teams (e.g. customer acquisition strategy will be made by the growth team)   Strategy team comes into play for 2 things - 1. Sourcing more information and insights, 2. Facilitating an organizational level perspective and discussion This makes overall operations more efficient, because the alternate is that each team will need to add some of these skills / knowledge.     How should it be run  Each team is the owner of its domain.The strategy team works as - 1. A facilitator, 2. An extended arm to these teams, if required for any special projects.    Such a structure will not bring in bureaucracy, rather it will bring more collaboration and reduce friction. Specifically on Maker DAO. I believe some part is already being done. And i personally believe the DAO has been quite smart about it. Thanks, Ashish ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.202256944444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#9",
                    "likes": "2",
                    "time": "30/05/2022-15:19:29",
                    "content": "Thanks for your comments and contributions here, Ashish. I agree that we have available to us an effective approach that would bring greater coordination, planning and execution which does NOT add bureaucracy. My current thinking is that Core Unit facilitators are the right group to own this work, not Delegates or committees of MKR holders. As you mention, some of what this looks like is already forming organically as @wouter outlines in his comment above Core unit on strategic planning - #4 by wouter. We’ll just need to expand our education and refine our approach to how leadership, work, incentives and compensation should be approached and managed in a large decentralized organization. I recently posted some thoughts and resources on Twitter following an update to the ACREinvest Delegate Platform to encourage the community to think about leadership differently. https://twitter.com/fhomoney/status/1530170545781760001?s=20&t=DZcYzsM97cKrIZoan3HfLw ",
                    "links": [
                        "https://twitter.com/fhomoney/status/1530170545781760001?s=20&t=DZcYzsM97cKrIZoan3HfLw"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ashish",
                    "index": "#10",
                    "likes": "1",
                    "time": "06/06/2022-13:06:38",
                    "content": "Thank you for sharing your thoughts @ACREinvest . It was a great read. I agree, “we need more decentralization and not less”. Your view of tying in the leadership aspects with the strategy aspects is very astute and valuable. This is an important area for all DAOs to work on, to build sustainability. And has given me some thoughts to mull over ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.498333333333333
                }
            ]
        }
    ]
}