{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/in-need-of-some-urgent-assistance/9507",
            "title": "In need of some urgent assistance ",
            "index": 9507,
            "category": [
                "Governance"
            ],
            "tags": [
                "core-unit"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/tariq.haji",
                    "index": "#1",
                    "likes": "0",
                    "time": "24/07/2021-15:42:22",
                    "content": "Hi, I’m new to this forum and was trying to DM an admin but couldn’t seem to figure it out so I’m going to write a post instead. I have been trying to get help for this situation for 2 weeks now from others but been struggling to get help. Basically, I accidentally sent $35k DAI to the MATIC contract address instead of my MetaMask address. I understand these mistakes are not reversible, but given how big the amount is, I understand that Maker governs DAI. I understand that this would need to pass through governance, but I can see DAI has a mint and burn function; so I was wondering if this error is possible to be returned to me. I will copy the code function mint(address usr, uint wad) external auth {     balanceOf[usr] = add(balanceOf[usr], wad);     totalSupply    = add(totalSupply, wad);     emit Transfer(address(0), usr, wad); } function burn(address usr, uint wad) external {     require(balanceOf[usr] >= wad, \"Dai/insufficient-balance\");     if (usr != msg.sender && allowance[usr][msg.sender] != uint(-1)) {         require(allowance[usr][msg.sender] >= wad, \"Dai/insufficient-allowance\");         allowance[usr][msg.sender] = sub(allowance[usr][msg.sender], wad);     }     balanceOf[usr] = sub(balanceOf[usr], wad);     totalSupply    = sub(totalSupply, wad);     emit Transfer(usr, address(0), wad); }  Can some admin help me out here and let me know if governance can approve this and thus burn the tokens from the matic contract address and mint them back in my wallet. Thank you so much for your time; feel free to contact me here or reply to the thread.  Tariq  ",
                    "links": [],
                    "GPT-summary": "The author of the post is seeking urgent assistance regarding a mistake they made while transferring $35k DAI to the MATIC contract address instead of their MetaMask address. They are asking if it is possible for Maker governance to approve the return of the tokens to their wallet. The post does not fit into any of the listed topics except for 3rd party asking questions about proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.4602272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "0",
                    "time": "24/07/2021-18:04:01",
                    "content": "Hello, Unfortunate that that has happened. However, as you can see from Dai contract itself, there are several that sent large amounts of Dai to Dai contract and there’s no way to help them at the moment as the protocol can’t just mint additional Dai at will. However, maybe it’s possible for you to submit a formal governance proposal to mint additional. Thank you ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.642857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "1",
                    "time": "24/07/2021-18:07:41",
                    "content": "Here are some previous similar requests. Unfortunately, they didn’t work out.     Returning ERC20 tokens accidentally sent to the DAI contract Miscellaneous       Hello everyone,  I don’t know if it’s the right place for it, but I’m taking a chance. Despite several years of daily use of ERC20 tokens, I unfortunately managed to make a mistake and send  some ERC20 tokens  to the DAI contract instead on another wallet. Here is the DAI contract address : 0x6B175474E89094C44Da98b954EedeAC495271d0F  Could you please tell me if there is a way to get those ERC20 tokens back? Maybe using the read & write features of Etherscan?  I am very sorry for the inconvenienc…         Minting New DAI to Offset Lost DAI Miscellaneous       After chatting with dev and coming to understand that I permanently lost $10,064 DAI by accidentally sending it to a “sweep” address that catches all TUSD  transactions for Trust Token in the TUSD redemption process, I was encouraged to post here in the forum for future decisions of the DAO that may consider minting  new DAI to retrieve lost DAI, which will prevent the USD peg from breaking someday as more DAI gets lost in similar ways. I have used the Oasis app many times ND am not a newbie how…     https://forum.makerdao.com/t/need-help-from-team-dai-team-community/4686/20 ",
                    "links": [
                        "https://forum.makerdao.com/t/minting-new-dai-to-offset-lost-dai/6396",
                        "https://forum.makerdao.com/t/need-help-from-team-dai-team-community/4686/20"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.913924963924964
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tariq.haji",
                    "index": "#4",
                    "likes": "1",
                    "time": "25/07/2021-18:21:38",
                    "content": "Hi! Thanks for the response. How do I submit something like that? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#5",
                    "likes": "4",
                    "time": "25/07/2021-20:01:38",
                    "content": "    Doo_StableLab:  Here are some previous similar requests. Unfortunately, they didn’t work out.   My impression is that there is no strong objection to refunding lost DAIs, but it’s difficult to delimit the boundaries of several different cases. In this specific case (sending DAIs to the DAI address), I think that:  If some whale user did send 500m by mistake to the DAI-address, we’d probably intervene to refund them. This is because 500m DAI lost would have a negative effect on the peg (despite what @SebVentures correctly said in one of the thread cited above about the role of the PSM in this). So it seems fair to intervene also for non-whales. There is little controversy in this specific situation (e.g., “what if these DAI’s are not really lost, etc”) since there are no 3rd parties involved here.  For the above reasons I think there is space for trying to push this refund process forward. @tariq.haji my suggestion to you is to enter the MakerDAO chat, and ask around for guidelines on how to make a forum poll/proposal. In that proposal you should try to advocate that it is a good idea to develop the tools to revert transactions that sent DAIs to the DAI-address. Keep in mind that, since this will likely involve some smart-contract development/assistance, this might take months. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.841435185185185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#6",
                    "likes": "3",
                    "time": "25/07/2021-20:44:27",
                    "content": "    iammeeoh:  my suggestion to you is to enter the MakerDAO chat, and ask around for guidelines on how to make a forum poll/proposal.       Guide to the Signaling Process Signal Requests   Overview This is an informal guide on how to participate in the signaling process at MakerDAO by starting a signal request. Signal requests and their role in the governance process are described here.  This post covers the considerations before starting a signal request, how to construct a signal request, what the author is expected to do during the signal request and steps to follow after a signal request is concluded.   Before the signal request Consider starting a discussion on the forum and…     ",
                    "links": [
                        "https://forum.makerdao.com/t/about-the-signal-requests-subcategory/4550",
                        "https://forum.makerdao.com/tags/c/governance/5/discussion"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "25/10/2021-02:44:48",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}