{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/weekly-relay-march-22-28-2022/14300",
            "title": "Weekly Relay: March 22 - 28, 2022 ",
            "index": 14300,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "2",
                    "time": "29/03/2022-13:53:38",
                    "content": " 1730×382 255 KB  Hi everyone, thanks for checking out the Weekly Relay! Whether you hold MKR or DAI, own a vault, or want to get more involved in governance, this is your one-stop shop for MakerDAO updates. The public PDF version is available here. Show some love to our Medium account   Current Events  This Week in Governance  Community Deep Dai-ve  Mark your Calendar  Useful Links  Have Feedback?   Current Events  Tokenomics Debate Rages On  Improving MKR tokenomics to provide the best value for MKR holders and achieve other goals for stakeholders in the Maker ecosystem has been a hot topic in the community since its inception. In last week’s Relay, we covered stkMKR, a proposal to bring staking functionality to MKR through a new stkMKR token, aiming to increase governance participation, improve the value accrual narrative for MKR token, increase governance security, and increase resilience to credit losses. In that same issue, we also covered @cryptenthusiastic’s proposal for a tokenomics model that decouples the value of Dai from the inflation factor of fiat currency, helping make Dai the stablecoin of choice for investors taking profits during bull markets and making it attractive to institutions and businesses. Last week, members of the A16z team, including Luca Pro, co-authored a four-part proposal titled “Suggestions for Community Discussion: Innovating MakerDAO’s Token Model.” Let us dive in and see how this latest proposal compares and contrasts with the discussion we have seen so far. A16z MakerDAO Tokenomics Proposal Overview In the initial overview post, the team explored the existing MKR tokenomics model and introduced its three-pronged approach to innovating it. Under the existing model, Maker’s profits are directed to filling a System Surplus Buffer. When the Buffer has a surplus, MKR tokens are permissionlessly bought back and burned to boost the price of the MKR token. As has been pointed out by several Maker contributors, the buy-and-burn model may not be optimal for achieving the community’s broader long-term goals. With the aims of “maximizing value creation, creating new utility for the MKR token, adding yield-bearing layer of financial resiliency, and increasing the durability and efficiency of governance processes,” the team has put forward three proposals for discussion, each with its separate post.  The following posts were submitted as a three-part thread, which has a separate overview available summarizing all three proposals: A16z MakerDAO Tokenomics Proposal One: Adding Utility Functionality to the MKR Token This proposal, split into three sub-proposals, focuses on increasing the utility of the MKR token. Sub-proposal 1: Require MKR as additional on-chain collateral for RWA-based or structured vaults involving less transparent off-chain liquidation mechanisms, ideally as a first-loss capital. This MKR can also be combined with other external assets like ETH as an on-chain collateral package. This requirement would be in addition to the normal RWA collateral structure. This change could help improve the alignment of the borrower and serve as an additional margin of safety. Sub-proposal 2: Create a Secondary Surplus Buffer to serve as an additional layer of consumer protection (in line with the Self Insurance Fund proposal) that offers a yield distribution to those who voluntarily stake their MKR. Much like other major DeFi insurance pools, these tokens would be used to help backstop a potential shortfall event, in this case, one beyond that of the System Surplus Buffer. Sub-proposal 3: Incentivize auction participants to stake MKR in collateral auctions, better aligning the interests of auction participants with the overall interests of the system. The main idea is to offer a discount, applied as a rebate, to the collateral auctioned for participants who stake their MKR in the auction. A16z MakerDAO Tokenomics Proposal Two: Aligning Governance Incentives This post, focused on aligning governance incentives across the Maker ecosystem, is also broken down into three sub-proposals. Sub-proposal 1: Incentive Alignment: One idea to address incentive alignment among the MakerDAO workforce, MKR delegates, and MKR holders is to reward both regular voters and official delegates with a vesting bonus denominated in MKR tokens based on MakerDAO’s long-term performance and each contributor’s cumulative activity. Sub-proposal 2: Participation: There are various pros and cons to weigh regarding a possible Curve-inspired “veToken” model application to MakerDAO. There could be some benefits to rewarding long-term participants with more voting power; however, @NikKunkel and @monet-supply raised excellent counterpoints against the implementation of the proposal as written. Sub-proposal 3: Information and Expertise: One item that could be especially helpful to the community is a new governance dashboard that clearly shows the linear flow for proposals, provides links with details to discussions (the forum is like a maze even for experienced users, let alone new ones), and organizes topics in a way that any newcomer can easily understand. A16z MakerDAO Tokenomics Proposal Three: Increasing Financial Resiliency and Fostering Growth The series concludes with the third and final proposal: Increasing the System Surplus Buffer to begin aligning it with calculated, vault-specific expected losses related to credit and liquidation risk as to the primary insurance pool for MakerDAO. To summarize the reasoning, “@krzkaczor elegantly outlined why MakerDAO should focus on aggressive growth with retained earnings: capital is hard to come by and should be used most efficiently to achieve more long-term earnings. Given the start-up nature of MakerDAO and its incredible potential, capital could be reinvested in ways to improve Maker’s profitability and sustainability as it grows.” For now, the team suggests that MakerDAO could keep the Surplus Buffer at $250M while the community decides on capital allocation routes and finalizes the metrics that determine its size.   This Week in Governance  Maker Improvement Proposals (MIPs) Weekly MIPs Update #80  1031×586 25.5 KB  March Ratification Polls Just Closed.  RFC and FS Dates for reference and existing proposals can be seen on this proposal tracker (WIP).\\ If you have any questions about the voting process at MakerDAO, the Practical Guide to Voting will be useful.   Nine March Ratification Polls that entered the Monthly Cycle closed today at 16:00 UTC and have all passed. There are two ongoing weekly-cycle Ratification Polls that will run for three days:  MIP55c3-SP3: SPF ETHAmsterdam Event MIP4c3-SP2: MIP62 Amendment  There are 20 recent/active proposals with RFC status, most eligible to enter the April Governance Cycle.  Pre-MIP Discussions  Anti-inflationary Proposal Auction-backed DAI IAM for Surplus Buffer Proposal Ideas on the Forum [Pre-MIP] Using Gyroscope to cut through Dai’s Gordian knot: its USDC dependency An RWA style solution to replace the PSM   Executive Vote Authorizing the ESM on DssFlash and Adding Support for TUSD Implementation This executive proposal passed on March 26, and the following changes occurred within the Maker Protocol:  Authorizing ESM on DssFlash to Remove Governance Permissions Based on this post from the Protocol Engineering Core Unit, the Emergency Shutdown Module was authorized on the Flash Mint Module. This change is intended to patch a vulnerability discovered in the interaction between the Emergency Shutdown Module and the Flash Mint Module. Specifically, this change prevents a malicious governance action from re-activating the DssFlash module after the FlashKiller contract disables it.  Adding Support for New TUSD Implementation Based on this post from the Protocol Engineering Core Unit, support for the new TUSD implementation address was added. This addition is intended to resume the collateral operations for TUSD-A, which automatically halted after the February 24th change from the TUSD team pointed to a new implementation address. For more information, please consider reading this thread on the last time the TUSD contracts were changed.  Active Governance Polls     Poll Name Discussion     Investigate Implementation of a Notional Finance D3M Discussion   Short Ratification Poll for MIP62 Amendments (MIP4c3-SP2) Discussion   Initial Parameters for StarkNet Simple DAI Bridge Discussion   Short Ratification Poll for SPF ETHAmsterdam Event (MIP55c3-SP3) Discussion    Check out March 21st’s issue of Weekly Relay for more information on the most recently concluded polls.  Community Greenlight Polls There were no active community greenlight polls for the week of March 15 - 21, 2022. Check out an “at-a-glance” view of the current Vault types and their parameters on MakerBurn.  Active Signal Requests [Signal Request] Onboard PAXG Sebastien from the Strategic Finance Core Unit revisits the topic and attempts to push PAXG to be onboarded. All risk assesments have been submitted during 2020:  [PAXG] ERC20 Token Smart Contract Domain Community Assessment [PAXG] Collateral Onboarding Oracle Assessment (MIP10c3-SP16) [PAXG] Collateral Onboarding Risk Evaluation  Additionally, PAXG was previously approved for onboarding through a governance poll. Today, both market cap and liquidity for PAXG have significantly increased, and the Uni V2 poll, although small, is handling 2M of hourly volume and 50M daily. Parameters proposed for PAXG are a Debt Ceiling of 5M, a Liquidation Ratio of 125% (which may be instead set to 130%), and a Stability Fee of 4% that may also be altered based on current situations. Sebastien provides the pros and cons of onboarding PAXG and concludes the signal request by asking the community whether they want to onboard PAXG as a collateral type in Maker’s MCD? Vote will run until April 5, 2022. Here are the current voting results:  1677×995 137 KB    Community Deep Dai-ve  Tweet of the Week   twitter.com    Dan Wu @itsdanwu  Token holders when you ask them to responsibly delegate voting power they’ll never use: https://t.co/DZKBzaOoY6   1:20 PM - 28 Mar 2022           26                3             Forum Insight Towards taking asset risks - A primer  This week, we are highlighting @SebVentures’ post exploring ways to invest the MakerDAO balance sheet into productive assets. In the Asset-Liability Management (ALM) Framework for MakerDAO, asset risk is defined as “asset fluctuation risk over the long-term,” plus an additional value at risk (VaR), thought of as “the minimum amount of equity required to safely hold such an asset and be in line with MakerDAO risk appetite.” If you want to learn more about VaR, check out Measuring Market Risk by Kevin Dowd and Risk Management in Banking by Joël Bessis. (Note: It is important to be aware, as the author points out, that the VaR paradigm remains fiercely debated in the finance world.) After providing a formal definition of VaR, we encounter our first case study: ETH. The Internal Rate of Return (IRR) of ETH, while volatile, is impressive overall.  966×583 18.7 KB  As @SebVentures points out, we know that much of the price action going forward will be linked to the burning mechanism and the inflation rate. While these are expected to eventually settle into low single-digit numbers, a 50% or 100% metric for return on assets (RoA) is prudent for the coming years. The VaR/RoE model is given below for 50%, 100%, and 200% RoA.  Judging by our model, @SebVentures concludes that ETH seems to be an investment option worth exploring despite its high volatility. However, this strategy will require a bigger Surplus Buffer and will not help make Maker’s idle assets more productive. Check out the full post for further case studies and conclusions on gold, short-term corporate bonds, short-term treasury bonds, and short-term blended bonds.   Articles   Making MakerDAO Matter Again  “Today, Andreessen Horowitz, the venture capitalist firm with massive stakes across crypto, including in Maker, proposed adding “functionality to the MKR token” to make it a more attractive investment and protocol. The details of each are worth looking into if you’re interested (it’s above my head, to be honest), but in short, both are proposals to expand the range of assets Maker interacts with and the way it manages collateral and fees. Maker has reinvented itself in the past. In November 2019, the protocol launched “multi-collateral” dai, allowing users to collateralize additional assets, including Basic Attention Token (BAT). Similar functionality for wrapped bitcoin (wBTC) came a few months later. More recently, the project has been expanding further into the world of traditional finance, allowing users to use real estate to finance loans. In September, French banking giant Société Générale (SG) applied for a $20 million loan in DAI.”      Meetings and Events  Last Week’s Call Recordings  Governance and Risk | Ep. 183   Video | Forum    Focus On #08 | stkMKR: Staking & Tokenomics Revision   Video | Forum    Focus On #07 | RWF Lending Principles   Video | Forum      Upcoming Calls  Issue Discussion Call #5 | Budget Modification Process - March 30th at 5 PM UTC   Join Link | Forum      Governance & Risk   Join Link | Agenda - Thursdays at 17:00 UTC   Core Unit Office Hours   Join Link | GovAlpha Governance Q&As - Mondays 17:00 UTC  Join Link | Immunefi Security - Tuesdays 00:00 UTC  Join Link | Protocol Engineering - Tuesdays 15:00 UTC  Join Link | Sustainable Ecosystem Scaling - Tuesdays 15:30 UTC  Join Link | Growth - Wednesdays 17:00 UTC  Join Link | Real World Finance - Wednesdays 17:00 UTC  Join Link | Governance Communications - Fridays 18:00 UTC    Useful Links Forum and Maker Chat Discuss and debate MakerDAO. Call Calender | Votes & Event Calendar Subscribe to both for all public calls, votes, and other reminders. Participation Tools Library of useful links for stakeholders: protocol analytics, DAI analytics, collateral & liquidation metrics, governance history, and auctions data. Governance Portal Voting dashboard for MKR voters. MIPs Portal MIPs dashboard for everyone. Learning Portal and Technical Documentation Learn more about the Maker protocol.   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only.  Credit @Artem_Gordon @nothsa ",
                    "links": [
                        "https://medium.com/@MkrGovComms/makerdao-current-events-governance-signals-and-calendar-28a3b7030575",
                        "https://forum.makerdao.com/t/a16z-makerdao-tokenomics-proposal-overview/14134",
                        "https://forum.makerdao.com/t/weekly-relay-march-15-21-2022/14119",
                        "https://forum.makerdao.com/t/stkmkr-maker-staking-and-tokenomics-revision/13890",
                        "https://forum.makerdao.com/t/anti-inflationary-proposal/13928",
                        "https://forum.makerdao.com/t/a16z-makerdao-tokenomics-proposal-overview/14134",
                        "https://forum.makerdao.com/t/against-the-burn/13412",
                        "https://forum.makerdao.com/t/a16z-makerdao-tokenomics-proposal-overview/14134",
                        "https://forum.makerdao.com/t/a16z-makerdao-tokenomics-proposal-one-adding-utility-functionality-to-the-mkr-token/14135",
                        "https://forum.makerdao.com/t/self-insurance-fund/10563",
                        "https://forum.makerdao.com/t/a16z-makerdao-tokenomics-proposal-two-aligning-governance-incentives/14137",
                        "https://forum.makerdao.com/t/signal-request-gbmkr-a-proposal-to-benefit-long-term-mkr-holders/12756/16",
                        "https://forum.makerdao.com/t/a16z-makerdao-tokenomics-proposal-three-increasing-financial-resiliency-and-fostering-growth/14138",
                        "https://forum.makerdao.com/t/against-the-burn/13412",
                        "https://forum.makerdao.com/t/weekly-mips-update-80/14274",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://manual.makerdao.com/governance/voting-in-makerdao/practical-guide-voting",
                        "https://forum.makerdao.com/t/weekly-mips-update-79-pinata/14106#things-to-come-crystal_ball-4",
                        "https://forum.makerdao.com/t/anti-inflationary-proposal/13928",
                        "https://forum.makerdao.com/t/auction-backed-dai/13011/11",
                        "https://forum.makerdao.com/t/premip-iam-for-surplus-buffer/11584",
                        "https://forum.makerdao.com/c/mips/proposal-ideas/21?order=activity",
                        "https://forum.makerdao.com/t/pre-mip-using-gyroscope-to-cut-through-dai-s-gordian-knot-its-usdc-dependency/8865",
                        "https://forum.makerdao.com/t/an-rwa-style-solution-to-replace-the-psm/8705",
                        "https://vote.makerdao.com/executive/template-executive-vote-authorizing-the-esm-on-dssflash-and-adding-support-for-tusd-implementation-march-25-2022#proposal-detail",
                        "https://forum.makerdao.com/t/proposed-security-fix-to-be-added-in-the-march-25th-2022-executive-spell/14197",
                        "https://mips.makerdao.com/mips/details/MIP38#protocol-engineering-pe-001-",
                        "https://makerdao.world/en/learn/governance/emergency-shutdown",
                        "https://manual.makerdao.com/module-index/module-flash-mint-module",
                        "https://forum.makerdao.com/t/flash-loan-debt-manipulation-during-emergency-shutdown-vulnerability-postmortem/14036",
                        "https://github.com/makerdao/flash-killer",
                        "https://forum.makerdao.com/t/2022-03-25-adding-support-for-the-new-tusd-implementation-address/14189",
                        "https://mips.makerdao.com/mips/details/MIP38#protocol-engineering-pe-001-",
                        "https://etherscan.io/tx/0x125823f2914e4f14e06b9b1b30fe9dd9512b36354cc1f6c063118c4fe03d8287",
                        "https://forum.makerdao.com/t/tusd-disabled-due-to-unannounced-token-upgrade/2747",
                        "https://vote.makerdao.com/polling/QmcBwWAx#poll-detail",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782",
                        "https://vote.makerdao.com/polling/QmXZPYAu#poll-detail",
                        "https://forum.makerdao.com/t/mip4c3-sp2-mip62-amendments/13779",
                        "https://vote.makerdao.com/polling/QmUnhQZy",
                        "https://forum.makerdao.com/t/mip4c3-sp2-mip62-amendments/13779",
                        "https://vote.makerdao.com/polling/Qmb9brx3",
                        "https://forum.makerdao.com/t/starknet-simple-bridge-limit-poll-risk-assessment-mitigation/14158",
                        "https://forum.makerdao.com/t/weekly-relay-march-15-21-2022/14119",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-onboard-paxg/13768",
                        "https://forum.makerdao.com/t/paxg-erc20-token-smart-contract-domain-community-assessment/3443",
                        "https://forum.makerdao.com/t/paxg-collateral-onboarding-oracle-assessment-mip10c3-sp16/5376",
                        "https://forum.makerdao.com/t/paxg-collateral-onboarding-risk-evaluation/4833",
                        "https://vote.makerdao.com/polling/QmYwY5gP",
                        "https://twitter.com/itsdanwu/status/1508433956177330179",
                        "https://twitter.com/itsdanwu/status/1508433956177330179",
                        "https://twitter.com/itsdanwu/status/1508433956177330179",
                        "https://t.co/DZKBzaOoY6",
                        "https://twitter.com/itsdanwu/status/1508433956177330179",
                        "https://forum.makerdao.com/t/towards-taking-asset-risks-a-primer/14265",
                        "https://forum.makerdao.com/t/alm-framework-for-makerdao/12994",
                        "https://www.wiley.com/en-dk/Measuring+Market+Risk,+2nd+Edition-p-9780470013038",
                        "https://www.wiley.com/en-us/Risk+Management+in+Banking%2C+4th+Edition-p-9781118660218",
                        "https://www.nasdaq.com/articles/making-makerdao-matter-again",
                        "https://youtu.be/7rxxNBmcIFk",
                        "https://forum.makerdao.com/t/governance-and-risk-183-thursday-march-24-17-00-utc/14150",
                        "https://youtu.be/uGvBI_L9jaI",
                        "https://forum.makerdao.com/t/focus-on-8-stkmkr-staking-tokenomics-revision/14001",
                        "https://youtu.be/0PHMxH9zsR4",
                        "https://forum.makerdao.com/t/focus-on-7-rwa-lending-principles/14000",
                        "https://us02web.zoom.us/j/83222037524",
                        "https://forum.makerdao.com/t/issue-discussion-call-5-budget-modification-process/14226",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com",
                        "https://chat.makerdao.com",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/relay-semanal-22-28-de-marzo-de-2022/14333",
                        "https://forum.makerdao.com/t/weekly-relay-march-28-april-4-2022/14450"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.750349857573884
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "12/04/2022-13:53:40",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/weekly-relay-february-22-28-2022/13499",
            "title": "Weekly Relay: February 22 - 28, 2022 ",
            "index": 13499,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "2",
                    "time": "01/03/2022-02:03:45",
                    "content": " 2150×445 112 KB  Hi everyone, thanks for checking out the Weekly Relay! Whether you hold MKR or DAI, own a vault, or want to get more involved in governance, this is your one-stop shop for MakerDAO updates.  The public PDF version is available here.   Current Events  This Week in Governance  Community Deep Dai-ve  Mark your Calendar  Useful Links  Have Feedback?   Current Events  Contributor Compensation Discussion Continues The GovAlpha team has continued exploring directions for improving how participants are rewarded for contributing to the Maker ecosystem. The series began with a post, aiming to clarify objectives: What do we hope to achieve with better off-chain governance? GovAlpha believes we should focus on three primary goals:  Retaining new community members and compensating their time and energy. Encouraging community members to take the initiative and get more heavily involved in the off-chain portion of Maker governance. Encouraging meaningful forum engagement from Recognized Delegates.  The next post shifted from objectives to practical solutions. The post outlines seven options, weighing the pros and cons of each one, and proposes two possible plans of action: Recommendation 1a:  Slightly increase existing delegate compensation to balance removed access to SourceCred rewards. Use the third delegate metric (engagement) input into the existing delegate compensation formula.  Recommendation 1b:  Create a new SourceCred instance for Recognized Delegates and divert some of the SourceCred budgets to this instance. Change the payout formula to 100% recent contributions.  Finally, @LongForWisdom put together an extensive comparison of SourceCred and Coordinape, a similar tool. Areas of comparison include how each tool works and is used, the ease of onboarding new users, how decentralized each tool is, and more.  Debating the Burn @krzkaczor published a two-part series of posts detailing his arguments for why the MKR burn isn’t achieving its intended objective of increasing MKR’s market price. As an alternative, he argues for increasing the size of the Surplus Buffer—where protocol revenue (DAI) is stored—and using it to invest in longer-term growth initiatives. The MKR burn has been paused in response to this discussion while the community considers adding a new parameter, lid, to the rate limiter mechanism, to make the bidding process more competitive and protecting Maker from low bids. The on-chain vote is currently underway.   This Week in Governance  Maker Improvement Proposals (MIPs) Weekly MIPs Update #76  1034×589 25.4 KB  RFC and FS Dates for reference and for existing proposals can be seen on this proposal tracker (WIP)! February Ratification Polls have just closed today, Monday 28, at 16:00 UTC. Out of eight Ratification Polls, seven passed and one failed. Find more details on by checking out the MIPs update. Pre-MIP Discussions:  Auction-backed DAI IAM for Surplus Buffer Proposal Ideas on the Forum [Pre-MIP] Using Gyroscope to cut through Dai’s Gordian knot: its USDC dependency An RWA style solution to replace the PSM   Executive Vote GUSD PSM Maximum Debt Ceiling Increase, MakerMan Retroactive Delegate Compensation - February 25, 2022 This executive proposal passed, and the following changes were made to the Maker Protocol:  GUSD PSM Maximum Debt Ceiling (line) Increase As per this governance poll, the Maximum Debt Ceiling (line) of the GUSD PSM was increased by 50 million DAI from 10 million DAI to 60 million DAI. For further information, please see the initial Signal Request on the MakerDAO forum here.  MakerMan Retroactive Compensation for November 2021 As per this governance poll, a one-off retroactive payment was made to MakerMan as a result of changes to the ongoing Delegate Compensation Trial, detailed below.   8,245 DAI transferred to MakerMan at 0x9AC6A6B24bCd789Fa59A175c0514f33255e1e6D0.  This payment covers work done as a Recognized Delegate during November 2021 that did not qualify for compensation at the time, but after changes to the Delegate Compensation Trial, it now qualifies for compensation. For further information, please see the initial Signal Request on the MakerDAO forum here.  Active Governance Polls     Poll Name Vote Discussion     PPG - Open Market Committee Proposal Vote Ends 03/03 at 4 PM Discussion   Adding Rate Limiter to Flap Auctions Vote Ends 03/03 at 4 PM Discussion    Check out February 21st’s issue of Weekly Relay for more information on the most recently concluded polls.  Community Greenlight Polls     Collateral MIP9 Poll MIP6 Application     PUNK (NTFX CryptoPunk) Ends 3/07 4PM UTC Application    Check out an “at-a-glance” view of the current Vault types and their parameters on MakerBurn.  Active Signal Requests Implement Governance Mining Trial Signal Request Ends March 2nd In recent months, a decline in governance participation has been brought to light. Unfortunately, attracting engaged, informed voters is a problem that has largely gone unsolved. @GFXlabs believes it is time to take an actionable approach through a governance mining trial to help improve voting participation to compare polls treated with potential payments vs. polls before and after the treatment and the difference between treated/untreated and governance participation one year earlier. The initial trial is aimed at polls, with more straightforward metrics to monitor. The design of this trial includes an assurance payment of .1 MKR provided to any address that contributes ≥ 1 MKR in a non-abstain vote on at least one low-turnout poll. A maximum of .1 MKR may be awarded to any address for any individual closing date of this trial. All MKR rewards will be sourced from the MakerDAO treasury. A budget of 8 MKR will be reserved for this trial. This trial will be in effect until the MKR budget is exhausted or after six weeks, whichever occurs first. This design offers the potential for payouts without guaranteeing that MakerDAO will incur expenses and provide a meaningful reward to smallholders willing to provide a public good at their own expense. @GFXlabs agrees to take management of the reporting and administration of this trial. They will track and provide public updates on which addresses (if any) are eligible for assurance payments following the close of each trial date. @GFXlabs will provide a written report (via forum post) and oral report (if desired) on a Governance & Risk call after the close of the trial.  Pros:  Potentially increases governance participation, particularly among smaller holders Offers payments only when marginal increases in participation are needed Allows experimentation with a novel mechanism without committing to large or ongoing payments Trial will be administered by GFX Labs to avoid adding to the governance burden of core units    Cons:  Could incur a maximum expense of 8 MKR and 1000 DAI May not generate conclusive results If chosen to be extended or made permanent, this program would likely require an increased workload to administer on an ongoing basis Will require some measure of marketing/communication to make MKR holders aware of the trial program If the assurance payment amount of .1 MKR is too low to attract voters to polls, then rewards would accrue to those already voting rather than the marginal voter   @GFXlabs is asking the community whether MakerDAO should implement the Governance Mining Trial. Allocate 20M to Protocol-Owned Uniswap V2 MKR/DAI LP Signal Request Ends March 3rd In response to a recent discussion, @psychonaut believes the simplest method for improving MKR liquidity is to add protocol-owned Dai/MKR LP shares to UniV2. He asks the community whether Maker should allocate 20M to a protocol-owned UniV2 MKR/Dai LP and presents his argument that the pros outweigh the cons:  Pros:  Simple No need to wait on sweeping tokenomic redesigns that have had difficulty finding consensus (e.g. Sagittarius Engine, gbMKR, etc.) Mostly orthogonal to MKR flap auctions  Helps identify a minimum and maximum MKR price for both flap and flop auctions Automatically buys low, sells high and captures the spread Obtains some return on otherwise idle capital sitting in the surplus buffer Extremely gas efficient (i.e., set it up and forget about it)  Cons:  Potentially interferes with the ability to raise large amounts of DAI from MKR sales Trading strategy is nearly the opposite of flop auctions    Bring Back the MKR Burn Part II Signal Request Ends March 4th @ultraschuppi states that the recent executive vote to temporarily disable Surplus Auctions and MKR burn had intentions to return to the original lerp mechanic. However, an on-chain poll added the Rate Limiter to the Flapper Module. In response, Schuppi asks the community whether the protocol should return to the previous partial burning configuration as agreed in November, but with the following conditions:  The Rate Limiter has been installed on the mainnet; this will take a couple of weeks. An initial configuration for the Rate Limiter has been set.  Fund Ambassadors Program Pilot Signal Request Ends March 4th The Ambassador Program, which provides non-English-speaking communities with resources and educational materials, had its funding disrupted by the offboarding of MKT-001. @Kat took the initiative to spearhead the Program without the attachment of a Core Unit and is seeking 25,000 DAI to complete the pilot and associated projects over the next three months. She is asking the community whether MakerDAO should fund the Ambassador Pilot Program.   Community Deep Dai-ve  Tweet of the Week     twitter.com    monetsupply.lens @MonetSupply  sharing some current and upcoming multichain opportunities for the humble $DAI farmer https://t.co/CvL0bQ78lO   6:44 AM - 27 Feb 2022           88                9             Forum Insight Flipside Crypto Delegate Platform Welcome to @fig and his governance team at Flipside Crypto, who have thrown their hats into the ring and announced their recognized delegate platform. Flipside Governance was established in September 2021 to directly support, contribute to, and drive participation in partner communities, helping improve the efficiency of this critical piece of protocol health. The team operates in various DAOs and communities, such as Aave, SushiSwap, ENS DAO, OlympusDAO, and many others. Flipside Crypto presents some of its accomplishments to show its value as a delegate in the MakerDAO community. Flipside Crypto believes there is plenty of room for improved proposals, a greater understanding of the governance landscape, and strong relationships with key players and stakeholders. The team believes governance is best achieved through:  Proper education (what votes mean and why) Fairly distributed voting power (quadratic voting, voting rewards) Engaged, rewarded community members  Flipside aims to represent the views of a range of users and provide unique analytics to justify their data-driven decisions. As delegates, Flipside Crypto promises:  Constant monitoring of votes and participation in each vote Open discussion and contribution to the DAO forum and Discord Transparency about when they vote and how they vote A shared commitment to the future success of Maker  Conflicts of Interest:  ENS Delegation Paladin Delegation/Transferability Committee Aave Grants  Also, check out the latest Forum at a Glance post for additional forum insights.  Articles New Silver Launches DeFi Securitized Mortgage Fund for Real-World Asset Investing  New Silver, a leading technology company that provides fast financing to real estate investors, today announced the launch >of its new decentralized finance (DeFi) securitized mortgage fund (“Fund”). The Fund will allow accredited investors in the U.S. and worldwide to >gain exposure to a pool of short-term mortgages collateralized by residential, U.S.-based real estate. In an industry first, accredited investors can generate income by investing in a revolving pool of short-duration mortgages that have been securitized on the >blockchain using liquidity from DeFi, without having to go through the complexities of transacting on the blockchain. The Fund makes investing, redeeming, and >collecting quarterly income easy for investors who do not want to transact on the blockchain. New Silver’s securitized asset pool is built on Tinlake, a DeFi protocol developed by Centrifuge to allow access to leverage and significant liquidity from >MakerDAO, Aave, and other DeFi protocols. With this novel securitization approach and utilizing the technological advantages of the blockchain, the Fund has a >14% hurdle rate and aims to return a 17-22% yield annually. This novel approach has the mechanics of a traditional MBS securitization. Each loan is held in a bankruptcy-remote SPV and then ‘minted’ on the blockchain as >a Non-Fungible Token (NFT), creating a digital representation of the asset. The assets are then locked into the DeFi pool, providing New Silver liquidity and >generating income for investors. A third-party servicer collects payments from borrowers and distributes them to the SPV. “DeFi is improving the way financial transactions are done, including asset-based securitizations,” said John Coury, Head of Capital Markets at New Silver. >“With this first of a kind approach, accredited investors can participate in this new economy and its benefits, without having any blockchain knowledge and >with no cryptocurrency exposure risk.” Investors interested in New Silver’s decentralized finance securitized mortgage fund will have access to multiple DeFi protocols that do not correlate to >central bank rate adjustments and a significant amount of potential liquidity. The fund will also handle all operational needs related to cryptocurrencies, >exchanges, custody, transactions, and tax reporting, making investors more seamless. New Silver is the first “real-world asset” lender to partner with a DeFi protocol. To date, the company has originated more than $90 million of loans with more >than $25 million of loans securitized on the blockchain, creating the largest known DeFi pool or securitized real-world assets. For more information, please visit: https://newsilver.com/defi/. About New Silver Lending LLC: New Silver is a technology company that provides fast financing to real estate investors who focus on fix and flip residential projects. New Silver’s >proprietary software accelerates, automates, and streamlines loan originations while using data to reduce default risk. Additionally, New Silver’s FlipScout >tool uses intelligence to help find real estate investment projects with the highest ROI. For more information please >visit https://www.newsilver.com    Meetings and Events  Last Week’s Call Recordings  Governance and Risk #179 | Video  AMA: Centrifuge Team | Video    Upcoming Calls  Meet Your Delegate #10 - Doo | 2022-03-02T18:00:00Z   Forum | Join Link      Governance & Risk   Join Link | Agenda - Thursdays at 16:00 UTC   Core Unit Office Hours   Join Link | GovAlpha Governance Q&As - Mondays 17:00 UTC  Join Link | Immunefi Security - Tuesdays 00:00 UTC  Join Link | Protocol Engineering - Tuesdays 15:00 UTC  Join Link | Sustainable Ecosystem Scaling - Tuesdays 15:30 UTC  Join Link | Growth - Wednesdays 17:00 UTC  Join Link | Governance Communications - Fridays 18:00 UTC    Useful Links Forum and Maker Chat Discuss and debate MakerDAO. Call Calender | Votes & Event Calendar Subscribe to both for all public calls, votes, and other reminders. Participation Tools Library of useful links for stakeholders: protocol analytics, DAI analytics, collateral & liquidation metrics, governance history, and auctions data. Governance Portal Voting dashboard for MKR voters. MIPs Portal MIPs dashboard for everyone. Learning Portal and Technical Documentation Learn more about the Maker protocol.   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only.  Credit @Artem_Gordon @nothsa ",
                    "links": [
                        "https://forum.makerdao.com/t/off-chain-governance-incentive-objectives/13298",
                        "https://forum.makerdao.com/t/off-chain-governance-list-of-options-and-recommendations/13373",
                        "https://forum.makerdao.com/t/sourcecred-and-coordinape-tool-comparison/13299",
                        "https://forum.makerdao.com/t/in-defense-of-bigger-surplus-buffer/12875",
                        "https://forum.makerdao.com/t/against-the-burn/13412",
                        "https://forum.makerdao.com/t/rate-limiter-parameter-proposal/13193",
                        "https://vote.makerdao.com/polling/Qmdd4Pg7",
                        "https://forum.makerdao.com/t/weekly-mips-update-76/13493",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://forum.makerdao.com/t/auction-backed-dai/13011/11",
                        "https://forum.makerdao.com/t/premip-iam-for-surplus-buffer/11584",
                        "https://forum.makerdao.com/c/mips/proposal-ideas/21?order=activity",
                        "https://forum.makerdao.com/t/pre-mip-using-gyroscope-to-cut-through-dai-s-gordian-knot-its-usdc-dependency/8865",
                        "https://forum.makerdao.com/t/an-rwa-style-solution-to-replace-the-psm/8705",
                        "https://vote.makerdao.com/executive/template-executive-vote-gusd-psm-maximum-debt-ceiling-increase-makerman-retroactive-delegate-compensation-february-25-2022?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/polling/QmWPYU9c",
                        "https://manual.makerdao.com/module-index/module-dciam#maximum-debt-ceiling-line",
                        "https://forum.makerdao.com/t/signal-request-raise-gemini-dollar-gusd-psm-debt-ceiling-to-60-million-dai/12961",
                        "https://vote.makerdao.com/polling/QmR2DX4L",
                        "https://vote.makerdao.com/address/0x22d5294a23d49294bf11d9db8beda36e104ad9b3",
                        "https://etherscan.io/address/0x9AC6A6B24bCd789Fa59A175c0514f33255e1e6D0",
                        "https://forum.makerdao.com/t/signal-request-makerman-retroactive-delegate-comp/13051",
                        "https://vote.makerdao.com/polling/QmPhbQ3B?network=mainnet",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-2022-02-24/13434",
                        "https://vote.makerdao.com/polling/Qmdd4Pg7?network=mainnet",
                        "https://forum.makerdao.com/t/rate-limiter-parameter-proposal/13193",
                        "https://forum.makerdao.com/t/weekly-relay-february-15-21-2022/13348",
                        "https://vote.makerdao.com/polling/QmWT8dH6?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/punk-collateral-onboarding-application/12992",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-implement-governance-mining-trial/13271",
                        "https://forum.makerdao.com/t/improving-governance-participation-rate-at-makerdao/11706",
                        "https://forum.makerdao.com/t/signal-request-allocate-20m-to-protocol-owned-uniswap-v2-mkr-dai-lp/13150",
                        "https://forum.makerdao.com/t/sagittarius-engine/10852",
                        "https://forum.makerdao.com/t/signal-request-gbmkr-a-proposal-to-benefit-long-term-mkr-holders/12756",
                        "https://manual.makerdao.com/parameter-index/surplus-auction",
                        "https://manual.makerdao.com/parameter-index/debt-auction",
                        "https://forum.makerdao.com/t/signal-request-bring-back-the-mkr-burn-part-ii/13146",
                        "https://vote.makerdao.com/polling/QmUqfZRv?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/rate-limited-flapper/13056",
                        "https://forum.makerdao.com/t/rate-limited-flapper/13056#next-step-setting-lid-3",
                        "https://forum.makerdao.com/t/signal-request-fund-ambassadors-program-pilot/13199",
                        "https://vote.makerdao.com/polling/QmYk1XN5?network=mainnet#poll-detail",
                        "https://twitter.com/MonetSupply/status/1497824869903265795",
                        "https://twitter.com/MonetSupply/status/1497824869903265795",
                        "https://twitter.com/MonetSupply/status/1497824869903265795",
                        "https://t.co/CvL0bQ78lO",
                        "https://twitter.com/MonetSupply/status/1497824869903265795",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456",
                        "https://flipsidecrypto.xyz/",
                        "https://forum.makerdao.com/tag/forum-at-a-glance",
                        "https://www.yahoo.com/now/silver-launches-defi-securitized-mortgage-120500996.html",
                        "https://pr.report/Zp2ydJYg",
                        "https://pr.report/ErOivyDJ",
                        "https://pr.report/1bS5T2pZ",
                        "https://www.youtube.com/watch?v=71jiZxW2cHE&t=789s",
                        "https://www.youtube.com/watch?v=AWFKI4SRIrI",
                        "https://forum.makerdao.com/t/meet-your-delegate-10-doo/13248",
                        "https://us02web.zoom.us/j/86837152053?pwd=dE9lWXFWaEt6T005a3hrUUcwQzhXZz09",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com",
                        "https://chat.makerdao.com",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/relay-semana-22-28-de-febrero-del-2022/13587",
                        "https://forum.makerdao.com/t/weekly-relay-march-1-7-2022/13731",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-feb-28-mar-11/13887"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.728002030740795
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/03/2022-02:04:37",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "743"
}