{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/compensation-levels-in-a-global-organization/15342",
            "title": "Compensation levels in a global organization ",
            "index": 15342,
            "category": [
                "Core Units"
            ],
            "tags": [
                "compensation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#1",
                    "likes": "6",
                    "time": "22/05/2022-15:27:45",
                    "content": "   The MKR holder Confessional   But 250 MKR is literally life changing money for almost all people, regardless of where you live.   Well, yes, in some places it changes more than just one person’s life. I sense a kind of misguided egalitarianism in the salaries. I think that this kind of well-intentioned approach of using wages in developed countries as a benchmark for all countries is flawed and can be damaging in the medium to long term. It could put us at a competitive disadvantage with other protocols that take advantage of what it gives. The whole system should not be measured against the salaries used to lure professional finance and IT professionals and crypto rock stars. I understand and appreciate the concept, but I don’t think we should give everyone in the world an American-style salary.  Not yet. We need to compete in a LOCAL labor market with fair, competitive wages. If that means we can employ more people for the same amount of money and thus achieve greater bandwidth, then that’s what we should do. I believe that if we can give more people a job at a lower wage and give them a chance to start a better life, that is nothing to be ashamed of. ",
                    "links": [
                        "https://forum.makerdao.com/t/the-mkr-holder-confessional/15164/47",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-7-traduccion/15632",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-7/15618",
                        "https://forum.makerdao.com/t/relay-semanal-24-30-de-mayo-de-2022/15594",
                        "https://forum.makerdao.com/t/weekly-relay-may-24-30-2022/15488",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-19-25-2022/15397"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.169823232323233
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leggevents",
                    "index": "#2",
                    "likes": "5",
                    "time": "22/05/2022-16:03:38",
                    "content": "    purrfection:  We need to compete in a LOCAL labor market with fair, competitive wages. If that means we can employ more people for the same amount of money and thus achieve greater bandwidth, then that’s what we should do.   Would this approach mean that a Dev from the USA and a Dev from Bangladesh in the same position would get paid different salaries based on their Geo-location? Despite having the same skill set? Please correct me if I have misunderstood. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.770833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#3",
                    "likes": "4",
                    "time": "22/05/2022-20:59:32",
                    "content": "Absolutely! Many may think that this is some kind of racist attitude, but it is far from it. Of course, some people use it for that unfortunately, which is why it’s important to talk about it. What’s important to understand is that there are a lot of talented people looking for a chance to find something better beyond the opportunities offered by the local labour market, but for some reason (language, education, gender) it’s not available to them. Of course, there are successful exceptions everywhere but they are a tiny minority. They are the ones who should be reached by a global organisation like Maker. The channel is of course a question. This one looks good to me:   omnipresent.com    Omnipresent - Global Employment For Remote Teams Let Omnipresent be your global HQ. We manage your payroll, benefits, compliance and taxes, so you can focus on growing your team. Book a call today.      Of course it is raised that all this is exploitation and contrary to the principles of the DAO. I do not agree with that. If you offer above-average salaries, a significant proportion of applicants will come from countries with above-average incomes. Why? Because for them it is worth working here and that’s fine, that’s the goal. They are a very important resource for us that is not available elsewhere. But they are very expensive. In a developed country, a highly skilled LOCAL workforce is full of good opportunities so logically they expect a high wage to work here. We compete with global big banks and multinationals for these people. If we weren’t capital rich and flexible we wouldn’t be able to bring them in, even though they are the backbone of the Maker at the moment.  They’re no longer the cypherpunk minded team that started Maker (ahh they were great guys too… but back to reality). In developing countries the salaries offered here seem astronomical.  That fact alone turns off a lot of applicants who would come from developing countries, because they know they don’t stand a chance against well-qualified Western applicants. Conversely, they would be very keen to join sometimes just for the opportunity to practice and learn while doing the “wood choping” that eats up so much of the time of the expensively paid highly skilled labour. I’m not saying they write our Smart Contracts.  But they can help a lot, as can the AI assisted programming. Unfortunately everyone blows the basic economic theorem that: more is more. It is time to start thinking differently and realize that often: less is more. Give them less and give them an offer they can access. I think they are happy to join us! This will be a great opportunity for them to show off their knowledge. Later, of course, they become equal. But the point is that they have overcome the barrier to entry, which is to everyone’s advantage. If you don’t believe ask the Lat-Am guys… I feel they confirm me, even though I’ve never talked to them about it. ps. No offence, only straight words. For me it’s looks like a waste of money that you organised the Amsterdam event from the US. I would have thought the same thing if Maker had organised the Denver party from the EU. I know there are many arguments for and against it but logic dictates that for cost effectiveness. Maker should use local professionals.  In this case, we are talking about the Netherlands, a pretty developed country, they have everything, it’s only the matter of time and money. But maybe I’m wrong, Im not not a professional party organizer. ",
                    "links": [
                        "https://www.omnipresent.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.903607503607503
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#4",
                    "likes": "9",
                    "time": "23/05/2022-01:07:25",
                    "content": "You have to remember that in crypto, there are anonymous members who don’t even share where they are working from and get paid quite well. Geography doesn’t mean much and would be unfair to discriminate for those who do disclose for example working in Latin America or India where average salary is lower. But that being said, extra spending that is going towards operations especially for US based entities is a growing issue in my opinion as that itself is accounting for more than 10% for certain budgets. And I don’t think they have an incentive to change it to cut such cost because it literally never failed the voting before. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.100892857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#5",
                    "likes": "2",
                    "time": "23/05/2022-20:04:54",
                    "content": "In this post, I try to highlight the negative effects of giving our first employees a six-figure salary without hesitation. I am not calling for discrimination here. In my view, a high starting salary is a “barrier to entry” that significantly narrows the pool of successful applicants.  I am thinking here of a lower starting salary model, followed later by a merit-based catch-up, which would eliminate the initial inequality over time, while at the same time alleviating the barrier to entry mentioned above. Salary is only one component. It seems to me that here at Maker it is the only motivation for attracting new employees. What about the other important, non-negligible factors that Maker offers? If you are not aware of the inhumane and abusive conditions in which some people work, I suggest you read what Goldman Sachs employees can expect in return for high pay: golden handcuffs. High starting salaries can take a psychological toll on employees. It distorts their perception of their salary and prevents them from pursuing a more meaningful career. Moreover, the initial positive effect of high starting salaries soon wears off and they want more. It is not their fault, they are human beings. It is a systemic failure. Of course, what I described here only applies to jobs that can attract a wide range of job seekers from all over the world.  In specialised, ‘rock star’ professions, the narrow market dictates the high price, and we have to adapt. Last but not least, if we do not want to be unfair, we have to take into account the geographical situation in terms of the cost of living. It is not uniform even within a country, and there are even greater differences in between countries and continents. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.356337767923134
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#6",
                    "likes": "3",
                    "time": "23/05/2022-21:20:49",
                    "content": "We should not be taking into account cost of living unless we need people in a specific region. Just like we wouldn’t pay someone more because they have kids or support elderly parents. You mention concern over psychological impact of high salaries, but paying some workers less because of where they live is really going to create division. Now I do agree we are overpaying for some positions, particularly non-technical ones, but we don’t need to bring geography into it. Lower paying roles will naturally attract people from cheaper areas anyway. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.609090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#7",
                    "likes": "1",
                    "time": "23/05/2022-22:30:35",
                    "content": "I hope this articles can add more context for this :    wrkfrce – 9 Mar 22    Does Location Based Pay Help to Recruit & Retain Employees? With remote work permitting companies to recruit from areas with a wide range of living costs, many companies are considering location-based salary systems. Looking at the pros and cons of location-based salaries, the picture is more complex than it...      A fair offer can be made to everyone after all the circumstances have been taken into account. ",
                    "links": [
                        "https://wrkfrce.com/is-location-based-pay-right-for-your-company/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#8",
                    "likes": "4",
                    "time": "23/05/2022-23:56:29",
                    "content": "That article overlooks the issue that jobs are a competitive space. Lets say we hire a programmer who lives in Brazil and decide to pay him 80k because that’s still a good salary for his country, below what we are paying American programmers. If he does good work, another DeFi app that doesn’t care about CoL adjustments can just offer him 120k to move over. All you are doing is making it a lot harder for Maker to hire/retain talent who lives in cheaper parts of the world, because they will constantly get poached by DeFi apps that don’t care. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#9",
                    "likes": "1",
                    "time": "24/05/2022-05:09:52",
                    "content": "   The MKR holder Confessional   Lets say we hire a programmer   I’m not talking about them, as I wrote:     purrfection:  Of course, what I described here only applies to jobs that can attract a wide range of job seekers from all over the world. In specialised, ‘rock star’ professions, the narrow market dictates the high price, and we have to adapt.   They and some professionals with special knowledge are the exception.  I know we have a lot of such highly paid people with special knowledge.  Let us not forget that they are in a privileged position in the labor market.  That is why conclusions about the whole labor market should not be drawn from their situation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.519047619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#10",
                    "likes": "6",
                    "time": "24/05/2022-09:46:51",
                    "content": "    Doo_StableLab:  But that being said, extra spending that is going towards operations especially for US based entities is a growing issue in my opinion as that itself is accounting for more than 10% for certain budgets. And I don’t think they have an incentive to change it to cut such cost because it literally never failed the voting before.   We have also noticed this and are not convinced that the value delivered is there. We are reaching out to and working with individual CUs to help reduce this expense wherever we can. We do not have the mandate or desire to interfere with other CU’s operations but to the extent that we can help (counterparty negotiations, propose alternative and more efficient organizational structures, etc), we are happy to. If any CUs are using external payroll services or administration providers costing >10% of budget please DM me to have a chat. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.972402597402597
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#11",
                    "likes": "6",
                    "time": "24/05/2022-12:48:18",
                    "content": "    CodeKnight:  All you are doing is making it a lot harder for Maker to hire/retain talent who lives in cheaper parts of the world, because they will constantly get poached by DeFi apps that don’t care   This is the most important part about the “retain” narrative, we live in crypto and anything (regarding salaries) should remain competitive within the same ecosystem not caring about where the contributor lives. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.78030303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#12",
                    "likes": "11",
                    "time": "24/05/2022-13:14:56",
                    "content": " TL;DR It’s usually not about the money. It’s about the quality.  \"Your margin is my opportunity.\"  Aristotle.  If we create a rule to set the compensation at a given level artificially, we will have two things happening:  other organizations will poach the best talent without restrictions you will probably be overspending on talent   Localized Companies Historically, talent and companies would go to the big cities to find each other. This would create a more expensive cost of living that, ideally, would be offset by a higher salary.  Remote Companies If your company is remote, your company doesn’t care where you’re based. So you’re competing with the world (more or less). This is important because now you’re competing against the whole world. If you’re the best in the world, you should get compensated for that. If you’re not the best, you should be cheaper.  Conclusion If you’re argument is “but I live in this expensive place” instead of “I have 3 proposals from your competitors”, then we’re having the wrong conversation. The apparent symptom will be Core Units based on expensive locations that are not as high-quality as we deserve. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.592645202020202
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#13",
                    "likes": "1",
                    "time": "25/05/2022-08:49:29",
                    "content": "    juan:  The apparent symptom will be Core Units based on expensive locations that are not as high-quality as we deserve.   I agree that location should be just ignored. if you work remotely, all that matters is your performance/quality, not the address of your appartment. This said, there is a reason if most production facilities have moved to China. Designers may work in NY city, but t-shirts are physically producerd are in China. Why? Because you actually need a lot of talent to make a cool t-shirt (I guess… maybe bad example lol) but you just need cheap labor + economy of scale to produce a sufficiently-high quality t-shirt. So salaries need to be a function of required quality. If ‘enough’ quality is available for cheaper (as it is for tshirts production/China) then salaries should be lowered. There are some activities in MakerDAO that require skill, but a skill found in many places of the world and not only in San Francisco/NY. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.607142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#14",
                    "likes": "9",
                    "time": "25/05/2022-08:58:36",
                    "content": "There is a related but separate reason why MakerDAO compensation based on location doesn’t make sense:   MakerDAO contributors aren’t exactly factory workers who only have limited mobility in the job markets they can access.   On the contrary, the vast majority of MakerDAO contributors can work from wherever they want, because the work is digital and their language and professional skills allow them to easily access this global digital market, and they can relatively easily move to other locations if that is still required.   As a result, it’s a misconception to think that contributors are part of their local job markets, misinformed by their physical location. They are part of the global, digital job market that has its own rates. Whether someone works from a beach in Bali or a tiny apartment in the most expensive neighborhood in New York, it’s just not relevant. So the title of the thread is misleading: it’s not about being a global organization. For Coca Cola it would probably be a disastrous business decision to make salaries independent of geography. For MakerDAO, it’s about being a digital-native organization, where physical location is irrelevant to the job. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.066037357704024
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Breezy",
                    "index": "#15",
                    "likes": "0",
                    "time": "25/05/2022-11:24:44",
                    "content": "I am not to fused about the salaries, that is not the problem.  The problem is alignment of incentive to performance.  Issuing MKR tokens as equity without any strike price means there is no incentive for a contractor to deliver value and increase token price.  MKR should only be issued as options with a stike price equal to or higher than current market price.  That way if the contractor wants to be rewarded “incentive” they have to increase the value of MKR.  Not simple sit on their no KPI contract for 12 months and still make off with US$250k even though the price dropped from $2k to $1k per MKR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#16",
                    "likes": "2",
                    "time": "25/05/2022-11:38:56",
                    "content": "    Breezy:  The problem is alignment of incentive to performance.   Your points may be entirely valid. However, while the current MKR bonus is designed to align incentives, it is actually not a performance bonus but a retention bonus. As such they are similar to Restricted Stock Units. It may well be true that options might be better. In the current circumstances with MKR token price dropping since forever, there would be no incentive left and people may have experienced a lower barrier to have moved on. I would also imagine that individual contributors feel quite powerless in steering the MKR price in the face of a crypto bear market. The retention bonus is meant to retain talent also through the bear when things look bleak. Maybe what you would want is to drive people out if the MKR price isn’t appreciating. But it’s not what was intended so that may explain the apparent “obviously bad design choices” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#17",
                    "likes": "1",
                    "time": "25/05/2022-12:06:02",
                    "content": "If Maker wants to attract top talent from various professional fields, location will be factor imo. It might not necessarily be a driving factor but I think it should be considered. Many top tier professionals live in very expensive cities, I think that’s reasonable to assume. Their current compensation might reflect that (high costs of living, high salary based upon advancement in their respective fields etc.) and they would be unable to take a pay cut. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4354545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Breezy",
                    "index": "#18",
                    "likes": "1",
                    "time": "25/05/2022-12:13:39",
                    "content": "I don’t think they are “apparently bad choices”, they are bad choices.  It is the same risk with every option issued as an incentive for retention in any company.  Regardless of volatility.  Crypto means increase downside and upside risk.  Increased volatility means also being overly rewarded when the market moves in your favor too.  So we are only issuing to allow for upside?  There should be no risk in the downside?  Again points to poor understanding of how structure of incentive. I would suspect in a down market people would definitely be staying at the attractive salary levels already being offered.  This is not a retention issue.  I hear no where in the community channels that there is a retention issue within MKR due to compensation.  We have some of the highest base salary compensation in the industry. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.959722222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#19",
                    "likes": "0",
                    "time": "25/05/2022-12:24:10",
                    "content": "That can work for CEOs, but few workers have a significant influence over the price of Maker. For most people, that would just add a lot of randomness to their salary. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#20",
                    "likes": "0",
                    "time": "25/05/2022-12:26:41",
                    "content": "    MFeinberg:  If Maker wants to attract top talent from various professional fields, location will be factor imo. It might not necessarily be a driving factor but I think it should be considered. Many top tier professionals live in very expensive cities, I think that’s reasonable to assume. Their current compensation might reflect that (high costs of living, high salary based upon advancement in their respective fields etc.) and they would be unable to take a pay cut.   No one is proposing a pay cut. Talent has a price, regardless of the city where they live. If the price of a top-tier [lawyer] is X, it should not matter to the DAO if they are working in an expensive city or in the middle of nowhere. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.261868686868687
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#21",
                    "likes": "1",
                    "time": "25/05/2022-13:08:09",
                    "content": "I am coming forward in support of @wouter here, for what matters. It is very easy to point fingers and indicate easy silver bullet solutions. Unfortunately it is also grossly misrepresenting reality. Literature on the impact of incentives is VAST and anyone with serious experience in designing incentive mechanisms and compensation schemes will tell you there is no perfect solution or obvious bad choices. Issuing options is just another tool to retain and motivate people to generate value for [token] holders, but is far from being perfect. The shortcomings are numerous, e.g.:  Extreme difficulty to price the value of an option for an illiquid or low-liquidity underlying asset Asymmetric upside (a call option equals to a levered stock purchase) leading to vicious incentives to pump up temporarily price - maybe at the expense of risk Non-linear impact on incentives in bear phases where most options go out of the money lowering entry barriers exactly when we need them to retain Inability to impact price for any specific employee  Typically, stock option plans with very clear price targets are issued for top managers where they are the apex of an organisation focused on delivering value for shareholders. Those plans are also MASSIVE, meaning that if you do good you leave with an incredible amount of money. The same cannot, and is typically not applied, to mid-low tier employees. Even traders or investment bankers get their bonus partially in vesting shares, not options. My point is simply to demonstrate that things are difficult when you look at them professionally. There is no easy answer, as there is no obviously flawed behaviour, most of the times. The world is complex, and what matters the most is the good faith and humility of those that are trying to improve the status quo and the tools to reach certain goals. I can personally attest that @SES-Core-Unit is deeply involved in doing so. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.392449874686717
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#22",
                    "likes": "1",
                    "time": "25/05/2022-13:16:31",
                    "content": "    juan:  If the price of a top-tier [lawyer] is X, it should not matter to the DAO if they are working in an expensive city or in the middle of nowhere.   Yes. I think in many cases you will find people at the height of their profession typically living in metropolises where the cost of living is high and all that. So I think people need to be mindful of that when they are analyzing whether compensation is excessive. I understand location as to compensation might not be as relevant in some job fields (as opposed to others). I would like to encourage people to look at it with an open mind and be aware of all of the factors when judging whether compensation is reasonable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.296666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xAlcibiades",
                    "index": "#24",
                    "likes": "0",
                    "time": "26/05/2022-20:36:10",
                    "content": "I’ll just chime in here and say that I have something in the works should Maker want to be able to provide contributor token options. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#25",
                    "likes": "0",
                    "time": "27/05/2022-14:26:27",
                    "content": "    0xAlcibiades:  token options   I don’t know if anyone is familiar with Fairmint, their platform enables “community members the ability to invest time or money in exchange for a stake in their business.” They offer startups equity crowdfunding and RSUs for an annual subscription fee. They are open, transparent, and legally compliant. Seems like a step in the right direction. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.075892857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#26",
                    "likes": "7",
                    "time": "27/05/2022-19:18:52",
                    "content": "As someone who has been involved with hiring 100’s of people in my career as well as just have built a new team for the CES Core Unit, the market is pretty efficient in setting compensation regardless of your location. It’s no secret that people in say Central or South America have a lower cost of living. When recruiting talent, all companies know this. It’s hard to find great talent in this industry. If you find someone, anywhere, we’re all competing for that person using about the same compensation and any local or geographic differences that would have existed in the past do not apply. Now, there are jobs where this might apply but not the types of high demand positions we tend to hire. We have to retain talent as well so that means using incentive models that are very generous. I have debated this over the years and for me, it comes down to, given the dynamics of the industry, supply/demand, etc., what do we think will work today. I can’t predict the future or the price of MKR. When the initial core units were proposed, many saw at those incentives as, look how rich those people are going to get. Today, we sit around $1100 per MKR (from a peak of 6k+) and while it still potentially represents a lot of money for people, it’s what is true, today. There is an equal probability that MKR will moon or dive based upon the performance of the protocol. If we get rugged somehow (and there are PLENTY of opportunities for that esp. with some of the new collateral technologies that carry a lot more risk), those people that received an incentive when hired will receive very little. No one wants that. There is an incentive to both protect AND grow the protocol. It’s not all about growth and that’s important. I don’t see a situation where people are making off with MKR. If someone is hired and supporting a dying protocol, it’s probably out of their individual control and the problems need to be addressed on a different level. I also want to make sure people are being incentivized during bear markets and crypto winters. It’s one of the most important times for a protocol. If we are concerned that people aren’t working or there is a lack of direction/information to know if each CU is adding value, that is a different discussion. In CES, we use industry best practices to manage our processes and work. The visibility is too great for anyone to just hang out and collect a paycheck. Yes, this requires experience to know how to run a business and team. As far as direction, we are a DAO and CES has a mandate. Those two work together. As a DAO, we’ve clearly identified the issue with clear/competing directions and it looks like we’re going to fix this. Having team goals/KPIs is very different when we lack strategic direction. Basically, CUs do the best they can based upon their mandate and what they know to be true about common knowledge. When you add in high level objectives, those goals/KPIs are modified to support the higher level objectives. So when we say a CU isn’t adding value, we need to be careful and understanding why that might be the case. This reply isn’t directed at anyone or a specific reply. Just a collection of thoughts based upon a lot of valuable feedback from others. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.962413377965703
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#27",
                    "likes": "0",
                    "time": "27/05/2022-19:22:36",
                    "content": "    wouter:  For MakerDAO, it’s about being a digital-native organization, where physical location is irrelevant to the job.       purrfection:  Conversely, they would be very keen to join sometimes just for the opportunity to practice and learn while doing the “wood choping” that eats up so much of the time of the expensively paid highly skilled labour.   I wanted to point out that physical location is a major determinant of the quality and quantity of the local workforce through factors such as quality education and health care, but also factors arising from psychological, cognitive, emotional, cultural and social differences. Living in a developed country gives a much better chance of becoming a digital-native workforce. The lack of entry-level, from our perspective, free or low-paid (in developing countries this may even mean sufficient income) contributor jobs that are readily available, significantly reduces the potential labour force base. In the EU, programmes such as Defi-Talents, which is advertised free of charge by Frankfurt Business School, attract hundreds of talented people from all over the world every year and they are first piled with offers from programme partners and sponsors. So these supporter companies are not only competing in the labour market for staff, they are also investing to broaden the pool of people they recruit from. This is a possible path, and an alternative example of this is the path of people who have become active workers through participating in this forum. I know there are such initiatives here, but the question is, we are not choosing the most expensive way to create something that already exists and working well. I think onboard a CU and then offboard, if its don’t perform properly at work is always the most expensive for us. Is it possible to reduce the compensation later? It is a difficult matter because financial loss is more painful for the individual than ever thought. Recognition of this has previously received the Nobel Prize. ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Prospect_theory"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.184259259259259
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#28",
                    "likes": "4",
                    "time": "28/05/2022-16:11:28",
                    "content": "Funny thing, drawing some form of geographical borders on a borderless tech development ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#29",
                    "likes": "12",
                    "time": "28/05/2022-16:39:21",
                    "content": "Instead of talking about reducing salary we should talk about reducing headcount. Better to have a smaller workforce that are paid what it takes to fully motivate them and deliver accordingly, than a huge workforce that isn’t properly motivated which only looks good on paper but will not deliver the proper results. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.142857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#30",
                    "likes": "5",
                    "time": "28/05/2022-18:00:42",
                    "content": "    rune:  we should talk about reducing headcount   Ahoy, Cap’n! Which heads be we reducin’? This tired ol’ buccaneer can make a request fer them to walk the plank if’n needs be  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#31",
                    "likes": "1",
                    "time": "28/05/2022-19:50:24",
                    "content": "Whomever get’s reduced, I agree it should be via walking the plank. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#32",
                    "likes": "4",
                    "time": "28/05/2022-19:51:34",
                    "content": "The issue is as you can see, despite some community and some delegates’ concerns, proposals to increase budget and head count pass most of times. And only time that the community proposed to reduce headcount and passed was probably offboarding of contents CU, which itself was quite painful. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#33",
                    "likes": "2",
                    "time": "28/05/2022-20:05:05",
                    "content": "    Doo_StableLab:  And only time that the community proposed to reduce headcount and passed was probably offboarding of contents CU, which itself was quite painful.   They kinda just laid down and took it by pretending an anon’s proposal wouldn’t pass, too. Really easy to be popular handing out money, even if it shouldn’t be done. Really hard to be anything other than a reptile when firing people, even if it should be done. I bet if we had secret ballots the budget would be way lower ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.600694444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#34",
                    "likes": "2",
                    "time": "28/05/2022-20:49:27",
                    "content": "And to add on, reducing salary is also unpopular so unless there’s a major initiative or is forced (due to potential widening deficit), don’t see that happening. In fact, unless there’s a big change, the protocol will probably vote to raise capital if in deficit than cut spending because that’s the current landscape unfortunately. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.383928571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#35",
                    "likes": "3",
                    "time": "28/05/2022-21:38:57",
                    "content": "Talking about laying someone off is a good way to drain their motivation to work. If we are going to do layoffs, it ought to be a short discussion that gets acted on quickly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.722222222222221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#36",
                    "likes": "0",
                    "time": "28/05/2022-22:17:15",
                    "content": "Unfortunately, our whole industry is in its infancy, so market conditions can change rapidly in negative directions, as they are now, and we all suffer because of it.  The current market situation is clearing the way for us, but at the same time the situation is very painful, especially because that in the chase for growth we have made some decisions that now seem wrong. The question is what decisions will be taken now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.7437500000000004
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#37",
                    "likes": "2",
                    "time": "28/05/2022-22:33:50",
                    "content": "Not all of us who were born in underdeveloped countries currently live in underdeveloped countries, and not all of us who currently live in underdeveloped countries work for organizations based in underdeveloped countries. If the work and the service provided are the same, the pay must be the same. If you pay less, you will get less. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.94949494949495
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#38",
                    "likes": "2",
                    "time": "28/05/2022-23:44:22",
                    "content": "    purrfection:  in the chase for growth we have made some decisions that now seem wrong   Higher interest rates have a way of revealing unsustainable business practices. I assure you many Silicon Valley startups are scrambling to make hard decisions like hiring freezes, layoffs, and austerity. If the US Treasury yield hits 5%, many zombie companies will become insolvent. MakerDAO is at an inflection point for better or worse based on how they underwrite loans to these RWA borrowers. Whoever survives the downturn wins market share (e.g. LUNA). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.536458333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#39",
                    "likes": "2",
                    "time": "29/05/2022-04:08:39",
                    "content": "I don’t disagree but, as controversial as it is, I just don’t see any forced reduction in spending happening.  I don’t know how you even go about identifying who should be let go and I’m scared to even imagine what such a discussion might look like.  What may be easier is to get delegates to freeze headcount where it is. I think what we as a community can do is appeal to delegates and core unit members to acknowledge the detrimental impact of unprofitability to the protocol.  If you want to play the long term game, it helps immensely to stay profitable.  I’m confident CU members who are aware of what has happened to protocol income will collectively find creative ways to be more cautious with spending while working expeditiously toward new revenue streams.  Nobody wants the protocol to fail and my hope is that CUs recognizing the danger will naturally try to minimize costs.  In fact, I feel there has already been a shift in tone recently with CUs trying to cover new proposals and requests with existing budgets. And if there’s ever another explosion in revenue…I hope we’ve learned our lesson and think harder about the way we increase expenses. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.447860962566845
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#40",
                    "likes": "1",
                    "time": "29/05/2022-05:25:47",
                    "content": "I agree that this a strange conversation to have in the context of a global organisation. Why pretend that the relevant labor market is a DeFi professional’s local geography, when we know that the same professional can work remotely for any project in the world? As @juan says:     juan:  If your company is remote, your company doesn’t care where you’re based.   There is an extremely small pool of people in the world with the skills to competently build a DeFi protocol. That scarcity means that those professionals are highly sought after. It just seems like a fiction to think that these professionals are only getting job offers from their local community or country. They’re being sought after by crypto protocols around the world, and their salaries will reflect that. Maker should hire the best people possible, and they deserve to be paid salaries according to the value they can add - no matter where they live. That isn’t virtue signalling, but in the direct interests of the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.551674641148326
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#41",
                    "likes": "2",
                    "time": "29/05/2022-05:31:06",
                    "content": "    Traster_Tray:  forced reduction in spending   “Heading into this year, we planned to triple the size of the company. Given current market conditions, we feel it’s prudent to slow hiring and reassess our headcount needs against our highest-priority business goals” from Coinbase. According to Sequoia: \"winning in the years ahead is going to depend on making hard, decisive choices confronting uncomfortable challenges that may have been masked during the exuberance and distortions of free capital over the past two years.” Their advice is to extend runway, focus on sustainable growth and recognize that an economic recovery may be a ways away. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6990740740740735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#42",
                    "likes": "0",
                    "time": "29/05/2022-18:49:29",
                    "content": "    Matt_NZ:  There is an extremely small pool of people in the world with the skills to competently build a DeFi protocol.   Yes, this is the most distorting factor at the moment. However, we assume that in the medium to long term the situation may change and the distorting factor of scarcity will ease and the rules of the global labour market will also apply in our market. To offer balanced employment opportunities that provide long-term personal financial development, balanced incentives need to be in place. As a global company, it is worth thinking about how to solve this problem, because there are solutions, such as this one:     Of course, in some crypto-native professions, scarcity today means that we have to enter the ring to attract hard-to-get workers. Let’s not forget that there is ALWAYS someone offering more, so it’s much more likely that tailored packages will keep the workforce here. As the DAO grows, more and more functions will be created that do not require highly specialised crypto-native skills and this should also be taken into account when making or accepting an offer from someone. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#43",
                    "likes": "2",
                    "time": "30/05/2022-04:25:35",
                    "content": "Just pay the swabbies what they’re worth. Doesn’t matter what port they call home  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#44",
                    "likes": "6",
                    "time": "30/05/2022-08:47:44",
                    "content": "Btw want to clarify that I am not for reduction in headcount - in fact I think we can achieve both higher compensation, higher headcount, and lower budgets using MetaDAOs. But in the context of discussing reducing salary it’s just almost always the right choice to reduce headcount rather than lowering salary. If you lower someones salary you may as well lay them off because from then on they will have 0 motivation to do any work. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.309523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/squid",
                    "index": "#45",
                    "likes": "0",
                    "time": "30/05/2022-10:23:41",
                    "content": "If employees are compensated based on location or subject to compensation cutbacks, shouldn’t recognized delegates also? But this is a voting conundrum just like MPs voting for their own salary in many places… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.555555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#46",
                    "likes": "1",
                    "time": "30/05/2022-14:08:11",
                    "content": "This is a complicated topic. What happens when you find two candidates equally qualified for a job but in two different locations? Do you hire the person based on their location where the cost of living is low? Isn’t that discrimination? Granted, in most cases salary is based on geography but this is (in MOST cases) true when the employer is also based in the same geography. The argument in this thread is based on the assumption that people working in CUs are all based in high-cost living areas, whilst that might be true, looking to hire people from the low-cost living areas will inadvertently end up creating geographic bias.  image1792×880 193 KB  Source: Numbeo cost of living map Now the argument for, we are also assuming that in every case if we hire people and pay them based on the location they are in, they won’t be happy. This is perhaps not true, most people want to live in their own homes in their own countries and if we are forthcoming and transparent then perhaps this won’t be an issue. Who knows? Reducing unnecessary expenses is important, but I believe what’s more important is to create a diverse workforce from all over the world and should be the primary focus. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.240340909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#47",
                    "likes": "1",
                    "time": "30/05/2022-14:54:35",
                    "content": "I feel like there’s ideal and pragmatic side to this discussion. Let’s say we end up taking geography into consideration, there would be need to be a separate proposal to adjust all 140+ members of CU (which I doubt will pass). There would be a need to study to see what’s the right comparison which likely itself will take time and resources. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.976190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#48",
                    "likes": "7",
                    "time": "30/05/2022-16:35:49",
                    "content": "I watched Office Space again the other night and I am reminded of many nuggets of truth in that movie. It’s easy to jump right to cutting headcount when revenues are down. I think the more important exercise is to look at aligning strategic objectives with the proper allocation of resources. That exercise can yield a very different result than asking all core units to reduce headcount by one or to offboard a core unit or two. We may decide to stay a little heavy on the people (or not) to ensure we can execute today in preparation for post bear market. The way to understanding and acceptance of these decisions is to ensure we’re aligned at a strategic level. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.354580026455027
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#49",
                    "likes": "0",
                    "time": "30/05/2022-19:55:38",
                    "content": "What I learned here is that no matter how much I try to be precise, it’s very difficult to show my point of view. It’s very easy to misunderstand especially when we are talking in the context of a possible negative event. Consensus is easier to build in the light of positive events. What I see is that it’s easy to attract a lot of people with high salaries but it’s hard to retain them and get them to work in an efficient, productive, coordinated way. Pay cuts are not an option because they can have very painful consequences for both sides. Therefore, later the significant fixed costs of salaries should be kept under tighter control even when we are in a state of jubilant optimism about a growing market and rising revenues. We are often tempted to attract talent solely on the promise of high pay. I think who comes easy, goes easy when money is all that matters. I’ve tried to mention that high starting salaries are a barrier to entry. It also protects those already in. We need to keep the valuable people in, there’s no question about that. The question is whether it is only the higher salary than competitors or rather a complex and fair reward system with a good company culture and great opportunities that keeps them here? Something that goes beyond salary: a sense of mission and the faith in the development of the DAO.  I know we have a lot of that people here, but we can never have enough good participants and employees. Location-based pay systems can be just a means a way  to index the global salaries to the local cost of living. I think the Geographic Differential Index is just a parameter to take into account the following costs based on geographic location:  Goods and Services Housing Income Tax  I don’t think anything that could happen about it, that would significantly affect Maker’s balance sheet, but this thread illustrates how difficult it is to reconcile differing viewpoints on even a relatively low impact issue. Well let’s practice  DAO brings together a lot of different perspectives, but we need to come up with a common perspective on DAO that is best for DAO as a whole. This viewpoint is unlikely to be fully shared by any of us individually. Some will be more vocal in their opinions, others may not speak the whole time, and that’s OK it will always be that way. But it is important that all points of view are heard, including those who remain silent. So I’m going to be silent here to give others the opportunity to express their views. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.704142488716957
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#50",
                    "likes": "1",
                    "time": "30/05/2022-20:59:05",
                    "content": "    purrfection:  The question is whether it is only the higher salary than competitors or rather a complex and fair reward system with a good company culture and great opportunities that keeps them here? Something that goes beyond salary: a sense of mission and the faith in the development of the DAO. I know we have a lot of that people here, but we can never have enough good participants and employees.   See, now this here is the million dollar question and it is worth striving for. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.749999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#51",
                    "likes": "2",
                    "time": "30/05/2022-21:04:20",
                    "content": "    purrfection:  It’s very easy to misunderstand especially when we are talking in the context of a possible negative event   I agree. But don’t let that deter you. Sometimes it may just take a little longer and more explaining. This is a tough and touchy topic. I appreciate your feedback. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.133531746031746
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#52",
                    "likes": "3",
                    "time": "05/06/2022-21:27:56",
                    "content": "No doubt it can become a sensitive topic because of its connotations, but I think this sentence nailed it:     Matt_NZ:  Maker should hire the best people possible, and they deserve to be paid salaries according to the value they can add - no matter where they live. That isn’t virtue signalling, but in the direct interests of the protocol.   Like @Doo_StableLab also said, much of the ecosystem prefers discretion regarding personal issues such as their place of residence. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.960227272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/v18n_asia",
                    "index": "#53",
                    "likes": "5",
                    "time": "07/06/2022-16:04:30",
                    "content": "    purrfection:  We need to keep the valuable people in, there’s no question about that. The question is whether it is only the higher salary than competitors or rather a complex and fair reward system with a good company culture and great opportunities that keeps them here? Something that goes beyond salary: a sense of mission and the faith in the development of the DAO. I know we have a lot of that people here, but we can never have enough good participants and employees   Compensation, while important, is indeed not the key differentiator in attracting and retaining talent. You can pay through the roof but if you don’t have a mission with purpose, a healthy culture (values, core principles, expected leadership behaviors) and don’t provide an excellent contributor experience in terms of hiring, learning, career mobility etc. your DAO will be nothing more than a revolving door. This was already the case in traditional companies and will be even more so in open source environments like web3. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.661764705882352
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JWizard",
                    "index": "#54",
                    "likes": "0",
                    "time": "28/06/2022-21:22:56",
                    "content": "One should also look at value alignment via salary levels. It’s a well known tactic of SpaceX to pay slight sub-market rate - it solidifies the idea that your work is not purely your salary, you are fucking working on sending people to space! Same should be though about Maker - you are building the first decentralized credit facility in the world. Its a privilege to work for Maker. The argument I see in the above replies of someone changing protocols because of higher salary levels is thus completely off-base. If a MakerDAO contributor is paid “well” and gets a better offer somewhere else and accepts it - maybe they weren’t really in it for the long run anyways? So the key here is to find a salary range that is competitive, yet pay slightly under it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.022893772893773
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#55",
                    "likes": "0",
                    "time": "28/06/2022-22:36:25",
                    "content": "    JWizard:  So the key here is to find a salary range that is competitive, yet pay slightly under it.   If it could only be that easy. I think that is a good tactic but sometimes falls flat. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.784722222222223
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#56",
                    "likes": "3",
                    "time": "28/06/2022-22:45:45",
                    "content": "Salary is a compensation to the value provided, geography has nothing to do with this. Looking at where somebody lives to decide how much their work is worth is not only contrary to the ethos of crypto, pretending to have a group of people working side by side, doing the same or similar jobs, but paying them differently based on where they live, is a terrible idea for an organization. It would also put Maker at a disadvantage considering that some organizations do this, but not all, especially in crypto. I know if Maker offers to pay me less for a certain job because I live in Latam, I’ll try to find another place where this is not the case. The talented people with most options will be the first to go, and the rest would follow as they find better options. Or people would simply refuse to tell Maker where they live. By the way, what about with digital nomads? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.501677489177489
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#57",
                    "likes": "0",
                    "time": "11/07/2022-20:24:30",
                    "content": "    Leandro:  By the way, what about with digital nomads?      euronews – 4 Jun 22    This is how much you could earn in your job if you moved abroad The salary calculator shows how average salaries for different jobs vary across the 38 OECD countries.      This article came out recently and has an interesting link about the differences within the OECD.  There is a link to that nice calculator:  Work Abroad Calculator | William Russell And a true digital nomad might want to study that too before picking up his backpack: Cost of living Estimator Unfortunately, it always turns out that if you want to get the same value for the same work, it’s going to be difficult today. And it seems that at the moment the world is not moving in the direction of making those differences disappear. They are sharpening, and believe me, the wage gap is a serious problem within the EU. You can move freely here but few people will move unless there is a real crisis in living standards. So I think digital nomads are the exception, a tiny minority that proves the rule. Equal pay for equal work? From a global perspective, I think this is an overly simplistic formula that does not take into account the important variables that affect individual quality of life beyond income. These include the country’s infrastructural development, housing, health, safety, security, the tax system and last but not least the natural environment such as weather, average temperature, number of hours of sunshine… …then there are the social and individual variables such as language, culture, local food, … and so on. There are a lot of parameters that influence quality of life, all of which (should) be taken into account. And everything has a (local)price. It would be better and fairer to have the same quality of life for the same work. ",
                    "links": [
                        "https://www.euronews.com/next/2022/06/04/want-to-live-abroad-as-a-digital-nomad-this-how-much-you-could-earn-in-your-job-in-38-coun",
                        "https://www.william-russell.com/international-health-insurance/work-abroad-calculator/",
                        "https://www.numbeo.com/cost-of-living/estimator_main"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.184210526315789
                }
            ]
        }
    ]
}