{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/vault-compensation-plan-v3-a-vault-compensation-support-dao-to-assure-a-better-makerdao-governance/4456",
            "title": "Vault Compensation Plan v3 - A Vault Compensation Support DAO to assure a better MakerDAO Governance ",
            "index": 4456,
            "category": [
                "Governance"
            ],
            "tags": [
                "signaling",
                "black-thursday",
                "vault-compensation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/sepu85",
                    "index": "#1",
                    "likes": "11",
                    "time": "29/09/2020-11:15:59",
                    "content": "TL;DR: community have proposed a very legit plan for compensation Black-Thursday Vault Victims, it has been passed but, we did not prepare ourselves against not supportive MKR whales. There’s a way to counteract this power, we just need to do an extra effort. Let’s create the incentives to make a new poll pass by the creation of a Vault Compensation Support DAO. @monet-supply has made a very compelling post-mortem analysis twitter threat that might worth to read in case you are not familiar with what happened. Background  12th march --> 8 million were lost in Vaults due to 0-bid actions attacks during network congestion  6-13th April --> MakerDAO Governances agrees on Compensating the victims’s loss 62,483.37 MKR (65.14%) against 33,441.10 MKR (34.86%) that voted no. 13-16th July --> First Compensation Plan  was rejected by 25,803.43 MKR (59.05%) of token holders against 17,897.49 MKR (40.95%) who where in favor. A new Plan is needed. 8-22nd September --> Second Compensation Plan which pivoted to proposed to compensate victims by minting new MKR was rejected by 57,589.05 MKR (65.52% of que poll quorum of 87,899.67 MKR).  A Governance Issue Having diverse stakeholders (MKR holders, engaged community, vault victims) with different interests and incentives brings natural entropy, confusion, and conflicts in the collective entity. No one said Decentralization would be easy, but it’s necessary for the wealth of not only MakerDAO but the entire crypto space. Executing governance polls that don’t overcome the 10% forum is a classic form of centralization due to disengagement of the token holder communities, the many reasons for this lack of engagement within MakerDAO token holders have been explored here. I, as a vault victim, and as an MKR holder, particularly identify with reason #4. Whales outweigh most other voters, making voting feel like a waste of gas. As a matter of fact, I have voted in neither of the 3 above polls, even if I’d obtain particular benefits out of a particular outcome. I’m glad I didn’t vote as I didn’t spend that gas and my short MKR balance wouldn’t have made any difference at all in the outcome. At the same time, I’m super sad we (referring to the >90% of MKR holders) did not vote. I do believe the aggregated of the Crypto community (including MAkerDAO of) prioritize ethics and fairness before the selfishness and personal profit. It becomes clear the cost of voting (in terms of transactions cost as well as cognitive costs) becomes an entry barrier for the vast majority of voters allowing individuals (mostly MKR whales) to decide on behalf on their own interest despite what the rest of the community care about but was not able to manifest. There’s still some hope in the numbers though, so far, among the 3 related polls, the most supported one was that one in which MKR decided to compensate Vault victims, just that we had no plans back then. A Skin in the Game Issue I’m not complaining about whales looking to care about their own interest, it’s natural the way, they would be the most impacted out of an MKR inflation action, even if we are talking about <2% of its supply (minting ~18k MKR against ~1M of supply) this would mean significant costs for them assuming the demand of the MKR does not suffer any variation. My thoughts are on the regular MKR holders (including myself of course), especially the vault victims, that besides supporting and defining two different, complex, and hard-working compensation plans, did nothing to assure enough incentives to attract more voting weight to come into the poll and/or assuring a counterparty incentive that would overshadow an assumed lost due to MKR inflation. Realigning the incentives by Community Coordination In the realm of the Open Source, community cohesion shall be a priority, otherwise, you will be forked and the community will migrate towards the tribe that better aligns with their values. We got the best example one week ago after Uniswap distributed their tokens just after suffering from a Liquidity Vampire attack. If you want your protocol to be sufficiently adopted to stay in a leadership position,  you want your users to be happy and wealthy. It’s my personal opinion that the outcome we had the last 22nd of september, and the fact that there’s an ongoing lawsuit against the Foundation, is making and will make the community felt apart, which is not good to the Maker mid-long term. Community and user engagement is the competitive advantage of web3, we can’t just despise it when we make decisions. Yes, individuals will take care of their own self-interest, but guys, this is a DAO (or at least it’s what the name tells me, otherwise MakerDAO would be a lie… don’t you think?), there are collective interests we need to care for as well, and if they are not in line, we have now the tools and the ways to re-align them… Let’s see… Vault Victims and compensation supporters have coordinated to present not one but two refund proposals to the Governance body (special thanks to @psychonaut @LongForWisdom @MakerMan @monet-supply @Vault2288 @befitsandpiper and others I might be missing), but unfortunately it was not enough. Assuming that Vault Victims do not currently represent a significant governance weight in MKR decision-taking, the next thing to do is to place a mechanism in which we do ensure this to happen. Yes, I’m talking about buying MKR decentralized coordination while assuring that voting power will go in favor of compensation. And we need to do it together. A Vault Compensation Support DAO to counteract MKR whales within MakerDAO We need to define and strength the collaboration of compensation supporters in a more tangible way, to propose a structure and place the proper mechanism of incentivizing this group to work together and fulfill the purpose on getting together enough voting power that will assure us increase voting participation to influence in a better way the outcome of the poll. Voting delegation is not there already, but there are ways in coming together and fill a common pool of MKR, sum voting power, while being able to cashback your MKR whenever you want (better if after voting :-). The first coming to my mind is the Dandellion Aragon DAO that allows an onboarding process with a governance token allocation according to the tokens (MKR) you add to the common pool (while allowing you to redeem accordingly to cash out) and program the interaction with the MakerDAO voting contract via the Aragon Agent. But why don’t we just commit to buy MKR and vote independently of a new DAO Again, it’s about the skin in the game and making it visible to us all and assure people we are getting our shit together and taking care of our money. If we want our money back, we need to fight for it, and at this point is very clear we can only do this together. The collective effort of reaching a proper amount of MKR tokens could also improve the MKR performance in the market and counteract implicit losses in the targeted MKR inflation. Make the community stronger while assuring wealth yo token holders. There are also other things that this DAO could resolve, for example (and this is ofc up for discussion) in the last couple of plans, the need for some development emerged as it was clear its need for distributing back the funds address by address. With the Vault Compensation Support DAO (VCS DAO from now on) we could make the new claim of the compensation to be addressed to this DAO and then we redistribute it all according to the value we had lost AND the skin each of us is putting on this new game. VCS DAO Launching Scheme First of all, we need to assure the VCS DAO members are inline with the purpose of fairly compensating Vault victims. There are many variables to consider here. Now it’s not only about the amount of debt and collateral lost but also about the skin in the game placed in the VCS DAO. This opens the possibility first to Vault victims to opt-in the VCS DAO with a capital capacity corresponding to their capital loss. For Example vault 3789 has a net loss of ~5k USD (~ 9.87 MKR price on Sept 27th). This would allow the individual owner of the address corresponding to that vault to participate in the DAO with a max of 9.87 VCS DAO share token corresponding to a maximum tribute of 9.87 MKR (1 tribute MKR = 1 VCS DAO share). Once the first onboarding of only Vault Victims is done, this seed community will decide then on who they want to accept (e.g. with members sponsoring candidates) as well as the price in MKRs to set to the VCS DAO new-comers. Once the amount in MKR is acceptable for going to a new poll, the onboarding process ends and the MakerDAO Governance poll is triggered.   Outcome A: MakerDAO approves the Compensation MakerDAO will deposit the total amount of compensation into the DAO vault. VCS DAO has fulfilled its purpose and now it’s ready to disappear by the redemption of the funds (unless they want to find a new purpose to this DAO with its funds, which would be perfectly valid). Vault Victims and Sponsored Investors will be able to redeem back their MKRs with their DAO share tokens which will be of course   Outcome B: MakerDAO rejects the Compensation DAO Members will find themself with a wealthy Organization with no purpose to follow, but with a wealthy fund. People will have the choice of remaining in the DAO and look for usage to give to the money, or just opt-out; in this case, it’s important to realize that MKR supporters that entered in a later phase (no Vault Victims) will receive a lower amount of MKR than what they invested in the first place, this due to the difference in share prices offered to them.   Challenges and Drawbacks  Economical Challenges: as you can see, I haven’t made the maths around the MKR markets dinamics. We are facing >10k MKR gap that we need to gather in voting power. I think this is super important, but it’s actually not my thing. Hopefully someone here will help us out in this matter. According to @monet-supply we are talking now about ~2.5 M we might be tackling to recover. So this might not worth the effort (in a profit sense), although if we succeed, we would be sending a right message against MKR whales, and who knows, maybe this create a precedent for the future of Decentralized Organizations. Technological Challenge: Aragon is super cool (we could use also MolochDAO), but it might not fulfill entirely our needs and some customization/development might be needed. For example, it would be cool to whitelist the seed DAO membership to addresses belonging to Vault Victims in a first phase, and then allowing new members sponsors. Again, I’m sure we can gather some dev help as well. Community Challenge: we need to assure a way to reach all Vault Victims and invite them to participate in this, clarify the benefits but also the risks. We need to prioritize absolute collaboration among us, this is the only way to counteract such a whale power that prevent us to have our compensation one week ago. Legal Challenge: well… I’m not the right person to make any comment here, I’d personally like us to resolve our conflicts on-chain without the arbitration of legacy jurisdictional systems. But this seems like an opportunity to dismiss the lawsuit against the Foundation that a group of people legitimately decided to enable.  Follow-up The above expose the motivations and plan for moving forward with the Black Thursday crash Vault Compensation Governance Proposal, and presents a draft plan to move forward. I’m aware there are still some other considerations to take and flaws to discover, which I expect would be discussed and considered properly in this forum. ",
                    "links": [
                        "https://medium.com/@whiterabbit_hq/black-thursday-for-makerdao-8-32-million-was-liquidated-for-0-dai-36b83cac56b6",
                        "https://vote.makerdao.com/polling-proposal/qmwfvvguaf8rz8xwgv2cqnzzt9t5h6epzh17qmk2ue99y4",
                        "https://forum.makerdao.com/t/vault-compensation-plan-proposal/2900",
                        "https://vote.makerdao.com/polling-proposal/qmzcg1cq8c27vtd3ydfzer8hzon7mdwuu2enfzugxwqpbm",
                        "https://forum.makerdao.com/t/vault-compensation-plan-v2",
                        "https://vote.makerdao.com/polling-proposal/qmnxitxuc5u4inynq8ekh5vvbgomjzl6fudwzhawbshhgh",
                        "https://forum.makerdao.com/t/why-arent-mkr-holders-voting",
                        "https://news.bitcoin.com/black-thursday-liquidations-sparks-28m-lawsuit-against-maker-foundation/",
                        "https://1hive.org/getting-started-with-dandelion-organizations/",
                        "https://tokeneconomy.co/aragon-agent-and-the-future-of-daos-ac27d831e22e?gi=5220fe7fda0b",
                        "https://defiexplore.com/cdp/3789",
                        "https://github.com/MolochVentures/moloch",
                        "https://www.coindesk.com/makerdao-users-sue-stablecoin-issuer-following-black-thursday-losses",
                        "https://forum.makerdao.com/t/black-thursday-vault-owners-report-thread/1566/108",
                        "https://forum.makerdao.com/t/maker-vault-compensation-updates-and-status/2583/215",
                        "https://forum.makerdao.com/t/vault-compensation-plan-v2/3584/156",
                        "https://forum.makerdao.com/t/maker-relay-ep-15-en-espanol/4576",
                        "https://forum.makerdao.com/t/maker-relay-ep-15-pt-br-portugues/4597",
                        "https://forum.makerdao.com/t/maker-relay-ep-15/4574"
                    ],
                    "GPT-summary": "The author of the post explains a proposal for a Vault Compensation Support DAO to counteract the power of MKR whales within MakerDAO and ensure compensation for Black-Thursday Vault Victims. The post also includes constructive criticism of the current governance system and proposes a plan for community coordination and collaboration. The author invites discussion and collaboration on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.65427740030389
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sepu85",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/10/2020-18:23:08",
                    "content": "Thanks to all of you that have shown some love about the proposal above. I realize that if we just have a voting delegation system a lot of the complexity above could be abstracted and we would only need to fine a trustworthy pro-compensation delegated. But I have no visibility about the evolution of this conversations within MakerDAO. Maybe @LongForWisdom can share some guidance here (?). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.930555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#3",
                    "likes": "3",
                    "time": "05/10/2020-20:58:58",
                    "content": "Hi! It would be nice to see a DAO emerge to represent the interests of some people within the MakerDAO… just like a political party! I hope you can push this forward! Disclaimer: just to be clear, even if I am not a whale, I am kind of against the vault compensation. But still I hope you can make this happen! One question: have you thought about the opportunity of borrowing the required MKR, rather than buying? Like on Aave or something? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "3",
                    "time": "05/10/2020-21:35:06",
                    "content": "Vote delegation will most likely be delivered with the upcoming governance contract upgrade. Not sure about the current timeline though. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/W34Z3L",
                    "index": "#5",
                    "likes": "1",
                    "time": "24/10/2020-02:54:59",
                    "content": "Is there any activity besides the post mortem thread by @monet-supply (which was much appreciated and also very sad) Again huge thanks to all of you who tried to make this work. Where can I find information about the lawsuit? https://www.coindesk.com/28m-makerdao-class-action-lawsuit-arbitration How can we join and what does arbitration mean? Who from the Maker foundation is involved in that? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.8375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#6",
                    "likes": "0",
                    "time": "06/11/2020-05:19:57",
                    "content": "Will there ever be compensation made after it was voted on? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/supermisa",
                    "index": "#7",
                    "likes": "3",
                    "time": "09/11/2020-20:57:14",
                    "content": "Hellooo anybody ?  so what is happening after all ? come on MakerDAO it/s been almost 8 months since black Thursday, are you going to pay us back or not? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "1",
                    "time": "10/11/2020-10:47:35",
                    "content": "Maker Governance already voted down the most recent Vault Compensation plan (v2) poll, opting for no vault compensation. At that point the working group disbanded, as this was a clear signal that MKR Holders were unlikely to approve compensation. @Sepu85’s plan here was a proposal of how the affected parties might wish to proceed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.944444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fullname",
                    "index": "#9",
                    "likes": "2",
                    "time": "01/12/2020-19:18:37",
                    "content": "Hi, so what are the next steps for the compensation of the 8 millions$ lost by MakerDao’s early adopters in March? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#10",
                    "likes": "0",
                    "time": "02/12/2020-00:42:06",
                    "content": "What do you feel is owed @fullname? As much as I sympathize with those that faced losses, the price decline in March was due to an overall sell off across financial assets, not just crypto. While there does seem to have been some malicious actors on the auction side of the bad collateral, a guaranteed excess of collateral was never guaranteed by the system. IMO nothing was owed to vault owners, but the community made a good faith effort to restore some losses due to the auction exploit. The holders of MKR however could not be convinced to devalue their holdings as as such no compensation measure was passed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.96875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ID.MCD5077",
                    "index": "#11",
                    "likes": "4",
                    "time": "17/12/2020-14:33:38",
                    "content": "hi I am the owner of mcd 5077 that got cleaned out by the ‘drawdown’ bug I lost 6500 Eth because Maker did not work how it should of, up til now I have been to ‘Ill’ to deal with this but now L feel strong enough to fight it, can anyone else help with this, thank you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sepu85",
                    "index": "#12",
                    "likes": "2",
                    "time": "17/12/2020-15:14:25",
                    "content": "hey @ID.MCD5077 I think the only way to move this forward is to find someone (rather if just one individual or a group of people gathered together on the same cause) with a voting power of > 50k MKR to signal that they want to challenge the outcome of the previous vote and make a new proposal, but this time with an stronger proposal from the community. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.96969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hdh",
                    "index": "#13",
                    "likes": "3",
                    "time": "22/12/2020-09:19:08",
                    "content": "Vault 3834 here, lost 100 ETH. Still want it back, i’m with you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/W34Z3L",
                    "index": "#15",
                    "likes": "0",
                    "time": "03/01/2021-20:23:15",
                    "content": "Honestly it would be okay if the 0 bid a**hole just donates the money he made now. This despicable being will have an easier life then. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mexfogel",
                    "index": "#16",
                    "likes": "1",
                    "time": "03/01/2021-21:47:00",
                    "content": "Even thought I lost money that night calling them “despicable” is a bit much. Not sure about the exact technical details about running an auction-keeper but it is very possible that they won the bids without being malicious. If they set their automatic bidding to drop until zero they may not have known until hours later what their bots did. Them not returning the money is not surprising in an anonymous decentralized environment. There are no rewards for being honest. Doing something noble in real life pays you with reputation, you may even get laid but on the internet your only reward is internet points and after a while no one cares or remembers and you go back to become that broke person. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mkrGoxxed",
                    "index": "#17",
                    "likes": "2",
                    "time": "04/01/2021-00:39:26",
                    "content": "    mexfogel:  Even thought I lost money that night calling them “despicable” is a bit much.   That person had/has the chance to be decent and make this right by returning the money. His ETH address was initially funded via Kraken which does mandatory KYC, so it’s not that anonymous. My bet is that this was an insider job, that’s why all the tabu around this topic. At that time, there was probably a handful of people that knew how to bid on those auctions without proper documentation. Maybe there was a bot malfunction, maybe it was an intentional exploit, maybe it was by design - it doesn’t matter, the best course is to return the money. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.3769841269841265
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mexfogel",
                    "index": "#18",
                    "likes": "4",
                    "time": "04/01/2021-02:16:18",
                    "content": "I don’t care about the ppl that took the money, they are unknown and there isn’t much we can do about them. What we do know is that 36% of all makerdao vaults were affected that night and suffered losses and we also know that now a mere 5.8% of the maker community voted on this issue and therefore it took only 3.7% of the maker community to kill the existing plan to compensate them. Lets not forget that the original vote with 10% participation had already agreed for compensation 6 months earlier. This was not a decision by consensus but the exact opposite. This issue needs to be brought up again with proper leadership. Vitalik didn’t sit on the sidelines when the DAO got hacked in 2016, it wasn’t his contract that failed yet he indicated his support for compensation as a leader and therefore it retained attention and 14% of Ether users eventually were able to get their money back. MakerDao also lost 4 million dollars on black Thursday, it is beyond clear that the contract had a flaw and different parties were affected. If the community found it necessary to repay the bad debt and losses of MakerDao then it is also logical to pay the losses of all the remaining parties affected by the same event. The clock is ticking, as Ether prices rise there are more incentives to find a resolution. A mere 10K loss on Black Thursday wasn’t worth getting a lawyer for but today that would be 90K + damages.  Right now you only have one court case in arbitration here in SF, keep waiting sitting on the sidelines and that will soon change very quickly. It would be best for all to reach a resolution here not to mention the right thing to do. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.329719387755102
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amosrendao",
                    "index": "#19",
                    "likes": "0",
                    "time": "04/01/2021-06:47:48",
                    "content": "I lost my life savings on Black Thursday and I’m willing to contribute what I can to get something successfully passed to return to those the portion of collateral that has been unfairly lost. But to be honest, I’m losing faith in the governance system. We passed compensation, but then there’s a second vote? And just because the turn out is so low on the second vote, all Black Thursday victims lives are determined by a few wales who aren’t thinking of fairness, only their own financials? Let me know what I can do to help get progress on this. Thanks to everyone who has been pushing the needle forward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5256410256410255
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sepu85",
                    "index": "#20",
                    "likes": "1",
                    "time": "04/01/2021-09:50:37",
                    "content": "hey there! the first step to do if we really want to move this forward, is to signal that there is someone(s) (individuals and DAOs) with a voting power of +50k MKR is willing to support this cause. I’m not deeply involved within the MakerDAO community, so I’m not able to lead this myself. My post above was to look to support in terms of MKR voting power, but this haven’t happened in 4 months already. Today, after reading all this messages I just thought about asking support from WhalerDAO, an external community that has the mission to improve this kind of unfairness in the DeFi space --> https://discord.com/channels/740450057136111667/740450057681240096/795582777583075330 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.65625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/W34Z3L",
                    "index": "#21",
                    "likes": "0",
                    "time": "04/01/2021-16:26:07",
                    "content": "Yes that is why I asked earlier to get in touch with the guy who started the lawsuit. (Peter Johnson?) But it doesn’t look like he reads this thread? On a different note I also don’t think a lawsuit is fair in this space, as already noted figures like Vitalik have to speak up to bring solution to this issue, else whales (+foundation) just wont care. Again it is indeed funny that the first vote actually went through and now we are in this mess. Lets hope for the best, looks like more people monitoring this thread already in the last weeks, so that’s a good sign. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.465909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mexfogel",
                    "index": "#22",
                    "likes": "0",
                    "time": "04/01/2021-17:03:55",
                    "content": "Here all the details of the current law suit by Peter Johnson. He is being represented by: Adam Spencer Heder (503) 968-1475 Fax: (503) 968-2003 Harris Berne Chrstensen, Harris Berne Chrstensen 15350 SW Sequoia Parkway Suite 250 Portland, Portland, OR 97224    CourtListener    Docket for Johnson v. Maker Ecosystem Growth Holdings, Inc., 3:20-cv-02569 -... Docket for Johnson v. Maker Ecosystem Growth Holdings, Inc., 3:20-cv-02569 — Brought to you by the RECAP   Initiative and Free Law Project, a non-profit dedicated to creating high   quality open legal information.      ",
                    "links": [
                        "https://www.courtlistener.com/docket/17067712/johnson-v-maker-ecosystem-growth-holdings-inc/"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.008333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mexfogel",
                    "index": "#23",
                    "likes": "0",
                    "time": "04/01/2021-17:18:39",
                    "content": "I’m not suggesting for Vitalik to speak up. I mentioned what he did as an example of what the Maker Foundation should do in this case instead of just allowing 3.7% of the maker community make the decisions for them. At the end it is the Maker Foundation that will be sued not the 3.7% of the selfish community members. They have a role in this issue and staying out of it is becoming an act of negligence and abandonment of its users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#24",
                    "likes": "0",
                    "time": "04/01/2021-20:05:46",
                    "content": "Hey, @mexfogel.     mexfogel:  not the 3.7% of the selfish community members   I’m not sure that calling names to a portion of the community that disagrees with your point is the healthiest way of communicating. Arguably [100% - (the portion that did not vote for it)] is “the selfish side” (and not 3.7%), as they have not moving their MKR for this cause. I’m not sure if you’re proposing the Foundation to override the decision of the MKR holders. That might set horrible precedence. If I remember correctly the main argument of the people voting against (in case you care) is that the Protocol worked exactly as expected. Several measures have been taken by the Community since then to improve the situation (and prevent undesirable outcomes for everyone), but if you can’t convince the majority of the MKR holders, I’m not sure what you’re expecting the Foundation to do.     mexfogel:  ’m not suggesting for Vitalik to speak up.   Maybe you should. MKR holders might listen to him. Just my 2 cents. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.509259259259259
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mexfogel",
                    "index": "#25",
                    "likes": "2",
                    "time": "04/01/2021-21:21:08",
                    "content": "Since Black Thursday MakerDao twitter feed has posted 12 announcements and reminders about the auction details focused to repay its own bad debt and to create a auction surplus buffer. They all passed and the surplus was even raised from 2M to 4M. Yet it has only bothered to post a single one announcing the compensation plan for its users on April 6th which did pass with 10% participation. When its about their own debt they remind everyone to participate, when its about its users they haven’t mentioned anything in 8 months. I don’t expect the Foundation to override anything. I expect them to bring them same attention and spotlight to us as they put into repaying their own debts. I expect them to bring the issue up for voting again and announce to everyone to participate 12 times like they did for their own debt. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.812169312169312
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#26",
                    "likes": "1",
                    "time": "04/01/2021-22:06:46",
                    "content": "I don’t think it’s fair to measure the effort of the Community solely based on the activity of Twitter. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mexfogel",
                    "index": "#27",
                    "likes": "0",
                    "time": "04/01/2021-22:42:59",
                    "content": "The blog and the twitter feed is not run by the community. It is a reflection of what the foundation cares about and brings attention to. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#28",
                    "likes": "0",
                    "time": "04/01/2021-22:49:59",
                    "content": "I just hope people don’t judge me based on my Twitter posts, then. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amosrendao",
                    "index": "#29",
                    "likes": "1",
                    "time": "05/01/2021-09:57:00",
                    "content": "@sepu85, Thank you for the positive contribution here! Were you thinking of joining their next call to discuss possible solutions? What’s your recommendation? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party wants to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.473484848484849
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sepu85",
                    "index": "#30",
                    "likes": "1",
                    "time": "05/01/2021-10:09:51",
                    "content": "sure! when is that call? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mkrGoxxed",
                    "index": "#31",
                    "likes": "2",
                    "time": "05/01/2021-17:36:54",
                    "content": "Voting on this issue is flawed by design. After losing all the collateral and all trust in MakerDAO, what sane 0-bid victims will still hold MKR (or CDPs) and be engaged enough to vote? It’s been almost a year. Some of us rarely check on this subject, but we’re still very interested to recover our losses, while MKR owners are very active and have an economic incentive to avoid compensation. This issue requires proper leadership from the Foundation and from the Ethereum community leaders to repair the image of DAOs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.9906250000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mexfogel",
                    "index": "#32",
                    "likes": "3",
                    "time": "06/01/2021-01:01:47",
                    "content": "I believe the compensation plan would pass without a doubt if it simply received more attention.  When the 2016 DAO hack/exploit happened within days Vitalik announced the soft-fork solution and it was implemented in less than a month with miner support of 65%-85%. All 14% of Ethereum users got their money back including me. It wasn’t an easy decision and some people argued against it stating that the “code is law” and then created ETC out of the old Ethereum blockchain. Look now after 5 years at what happened to the chain that stood by its users and look at what happened to the one who thought they should loose their funds. ETH is today $1085 and ETC is $7 Never abandon your users, 36% of vaults were affected. The Maker Foundation needs to take a more active role and bring attention to the community to address this issue. For the sake of fairness I want to correct my previous claim that MakerDao had only posted one single tweet announcing the vault compensation polls. They tweeted it 3 times. One in April, one in July and one in September. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.382631257631258
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amosrendao",
                    "index": "#33",
                    "likes": "1",
                    "time": "07/01/2021-22:55:19",
                    "content": "@sepu85 , I’m not actually sure when the call is, but I found their discord and have posted a comment asking for any help they can offer. There are two of us in their making our points heard about why this wrong needs to be righted if defi is to grow in a healthy direction, but we could use more voices from people who are willing to bring respect and kindness to the table and not accusatory anger. Please feel free to go join the convo going on right now if you think you can contribute something healthy. Thanks! You can find the discord link here: https://whalerdao.org/whalertalk/ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.617857142857144
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mikaleo",
                    "index": "#34",
                    "likes": "0",
                    "time": "19/01/2021-01:11:24",
                    "content": "I took a look the courtlistener and felt that the outcome of the lawsuit was not very good… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/W34Z3L",
                    "index": "#35",
                    "likes": "2",
                    "time": "19/01/2021-14:51:03",
                    "content": "With the recent bull market, governance should surely have enough funds to cover the losses here. How often can one bring a vote forward? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amosrendao",
                    "index": "#36",
                    "likes": "0",
                    "time": "22/01/2021-00:12:22",
                    "content": "Agreed. Surely there’s something that can be done in the present market. Does someone know what next steps are for setting up a vote where we actually have more than a couple whales vote? I’m sure we can use a lot of the materials that have been developed thus far for this situation and update them where needed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amosrendao",
                    "index": "#37",
                    "likes": "0",
                    "time": "22/01/2021-19:13:14",
                    "content": "Yo @mikaleo, where did you see it on courtlistener? I’m not finding it? Any chance you could link me? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amosrendao",
                    "index": "#38",
                    "likes": "0",
                    "time": "22/01/2021-19:17:08",
                    "content": "@mikaleo, never mind, I found it, I was searching the wrong archive. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mikaleo",
                    "index": "#39",
                    "likes": "0",
                    "time": "23/01/2021-08:56:43",
                    "content": "Hoping everything goes well.@amosrendao ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#40",
                    "likes": "2",
                    "time": "23/01/2021-18:30:48",
                    "content": "I’ve considered compensation a lost cause for some time now. The whales simply do not care enough about you. You won’t get compensation, and it could lead to a fork. Maybe they’d care about that–MKR losing a lot of value because a large part of its community picked up and left for greener pastures. But honestly, I doubt that’ll happen; people are happy to suffer until the problems become so unbearable that the system simply cannot function any longer, and that could take a very long time. Meanwhile, the victims seem to want to correct the problem within the system, not realizing that the system no longer serves them–if it did, we wouldn’t be having this discussion for the third time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.860714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amosrendao",
                    "index": "#41",
                    "likes": "1",
                    "time": "25/01/2021-19:10:31",
                    "content": "Is there anyone reading this that has experience launching a vote? and experience creating awareness around that vote to get more community involvement (which would neutralize selfish whales who aren’t even considering the extreme unfairness of black thurs victim’s situation)? I’m willing to put in the work and help get a fair vote to the community with a valid explanation of why we should support Black Thursday victim’s and their unfair 100% loss of collateral. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 4.994791666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/W34Z3L",
                    "index": "#43",
                    "likes": "1",
                    "time": "26/01/2021-09:37:07",
                    "content": "I think bringing this up again in one of the maker governance calls could be an idea. Then again, I do not know if this would be a relevant discussion topic over there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fullname",
                    "index": "#44",
                    "likes": "5",
                    "time": "04/02/2021-00:55:35",
                    "content": "I am a CDP owner and one of the victims of Black Thursday. I find it regrettable that no help or communication has been made concerning the losses of these thousands of early adopters, seriously left behind because of an under-tested contract and whose logic, in my opinion, has been exploited. I will find it very positive, both for the community and for the Press, that something could be done for these users who actively participated in the first moments of MarkerDao’s life and for these active users of dapps like InstaDapp and DefiSaver, on which I was one of the first users. I had that day 840 Eth in collateral which largely disappeared. Try to turn this mishap into a long term opportunity, it will only be positive. The only question to ask yourself is: are these early adopters important. I have a child of a few months and I would like to proudly tell him in 15 years: I knew DeFi was the future. People never forget … ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.408863066757803
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sepu85",
                    "index": "#45",
                    "likes": "1",
                    "time": "04/02/2021-10:13:25",
                    "content": "this is actually a very good point… maybe the complex initial proposal about making a DAO to gather enough MKR weight to fight back a couple of whales is not needed… maybe we just need to raise again the last vote, this time building an stronger ethos on this cause advertising it in different mediums… I think we need of course the support from people who work in this voting proposal last year so I’m tagging them here in order to understand their perspective on this. @Joshua_Pritikin @LongForWisdom @MakerMan @monet-supply @Vault2288 @befitsandpiper ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.38125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#46",
                    "likes": "1",
                    "time": "07/02/2021-17:06:02",
                    "content": "I unfortunately don’t have any guidance to offer with respect to getting another proposal up for a governance vote other than what we have already done. I do think it would be important to find at least one large MKR holder to sponsor such an initiative.  Having a clearly worded poll would be important especially when it involves the manner and amount of compensation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.105158730158729
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amosrendao",
                    "index": "#47",
                    "likes": "0",
                    "time": "12/02/2021-16:44:50",
                    "content": "Well said! This is exactly how I feel about the situation too. @MakerMan @sepu85 and anyone else reading, how do we get a large MKR holder to sponsor such an initiative? Is there really nothing any of these people (https://makerdao.com/en/about) can do to create a higher probability of a fair and equitable outcome on this matter? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.345238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#48",
                    "likes": "1",
                    "time": "12/02/2021-19:56:15",
                    "content": "The people on that website are doing something…they are dealing with the lawsuit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrpickel",
                    "index": "#49",
                    "likes": "0",
                    "time": "13/02/2021-08:50:36",
                    "content": "I can understand how the last compensation vote did not pass as the lawsuit against the foundation is still ongoing and probably would have continued even if the compensation vote had passed in favor of some compensation. If the lawsuit was never filed, perhaps there would have been enough votes for compensation in the last September vote, possibly preventing a “bite the hand that feeds you” situation. That would likely have been a much preferable route for everone in the end as it would probably have been a quicker process and more cost effective than paying legal fees.  It seems to be it would have been better to wait for a successful compensation vote and completed compensation distribution to the black Thursday vault holders, and only then start to consider moving forward with legal action if no compensation materialized after about a year. At todays prices, I lost what would now be seven figures in USD on black Thursday and am curious if there may be a new compensation vote before or after the current legal issues are settled. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.738257575757576
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amosrendao",
                    "index": "#50",
                    "likes": "0",
                    "time": "16/02/2021-01:32:59",
                    "content": "@mrpickel I think it’s easy enough to say that if you’re taking the compensation, you sign away your ability to take legal action, solving the problem and making sure all is handled fairly. I don’t think it’s good to sit on this, letting massive opprotunity pass us by. We need to do what we can. @MakerMan @sepu85 , did y’all see my last message? Does anyone know how to get a large MKR holder to sponsor the initiative? Anything else we can do to get progress on this? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.408008658008658
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#51",
                    "likes": "1",
                    "time": "16/02/2021-22:44:13",
                    "content": "    amosrendao:  I don’t think it’s good to sit on this, letting massive opprotunity pass us by. We need to do what we can. @MakerMan @sepu85 , did y’all see my last message? Does anyone know how to get a large MKR holder to sponsor the initiative? Anything else we can do to get progress on this?   Yeah I saw the last message.  I honestly have no clue whether a large MKR holder could be brought forward to support this.   What else people can do?   Buy MKR and vote with it?   Honestly that is all I have at this point. I worked pretty hard on this whole issue only to watch governance turn it down for all of the affected vault holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.896672771672772
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#52",
                    "likes": "3",
                    "time": "16/02/2021-22:57:12",
                    "content": "Just be patient. We cannot do much as long there is no court ruling. The only option would be to propose a vote to protect the foundation from damages in case the court rules in favor of the vault users. The Maker protocol is not yet decentralised. We need the foundation not only to survive, but to thrive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.916666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sepu85",
                    "index": "#53",
                    "likes": "0",
                    "time": "18/02/2021-09:52:56",
                    "content": "yes I saw it! and no, I don’t know any whale. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/W34Z3L",
                    "index": "#54",
                    "likes": "2",
                    "time": "25/03/2021-10:55:11",
                    "content": "   reddit    r/MakerDAO - Black Thursday for MakerDAO: $8.32 million was liquidated for 0 DAI 60 votes and 28 comments so far on Reddit      “If Maker wants to be the leader they have to do something urgently!” Good times. RIP the dude with 35k ETH. ",
                    "links": [
                        "https://www.reddit.com/r/MakerDAO/comments/fio0af/black_thursday_for_makerdao_832_million_was/"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fullname",
                    "index": "#55",
                    "likes": "1",
                    "time": "31/03/2021-00:42:15",
                    "content": "I hope that the upcoming class action will punish their incapacity to communicate to their decentralized-customers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/W34Z3L",
                    "index": "#56",
                    "likes": "1",
                    "time": "01/04/2021-02:24:14",
                    "content": "    fullname:  n will punish their incapacity   There is another one coming up? Any more info on this one and how to join? Still don’t think that’s the way to go, but here we are a year later. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mikaleo",
                    "index": "#57",
                    "likes": "0",
                    "time": "01/04/2021-14:56:36",
                    "content": "We need to wait for the result of the arbitration and believe that there will be a fair judgment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/make_dao_2020",
                    "index": "#58",
                    "likes": "1",
                    "time": "02/05/2021-09:31:17",
                    "content": "It’s a sin that MakerDao will carry forever. Web3 will never forget… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/make_dao_2020",
                    "index": "#59",
                    "likes": "1",
                    "time": "02/05/2021-09:34:55",
                    "content": "I actually don’t understand. Other protocols have been distributing tokens generously to their users, while MakerDao refuses to compensate a cent… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#60",
                    "likes": "0",
                    "time": "02/05/2021-14:39:41",
                    "content": "Why don’t you draw up some simple proposal and put it out for comment? The community will consider it and, if reasonable, may pass it. Passing blame on the DAO for the compensation advocates’ failure to convince people that their recommended path was the “right” one is unfair. I’d say come up with another matrix and release it for review. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.229166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fullname",
                    "index": "#61",
                    "likes": "0",
                    "time": "02/05/2021-20:03:43",
                    "content": "I don’t understand neither why they don’t communicate, I tried to contact the CEO on LinkedIn and a lot of their employees, they read my message but didn’t answer. Nobody from the administration want to talk, are they hiding something? The community voted Yes to compensate the victims, and yet nothing has been done… our losses are amounts in ETH, and this loss is higher and higher every week… My loss is approximately calculated at 700k$ right now. ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-30-may-6/7883"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.482142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fullname",
                    "index": "#62",
                    "likes": "0",
                    "time": "02/05/2021-20:16:16",
                    "content": "I really think that we can retry a compensation poll, now that ETH is much higher, i feel that the community/voters will welcome this poll more positively than early 2020 when everything was going badly for everyone. @MakerMan @LongForWisdom can you do something? We need a voice, I think at this point I’m ready to pay any service fee to recover my money, if needed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.985795454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#63",
                    "likes": "6",
                    "time": "02/05/2021-20:25:04",
                    "content": "    fullname:  @MakerMan @LongForWisdom can you do something? We need a voice, I think at this point I’m ready to pay any service fee to recover my money, if needed.   I can’t personally. Governance voted against it once and that means that I shouldn’t spend DAO-funded time on it. I’m afraid I have enough work to do as it is to want to spend my free time on it (not to mention it’s something of a conflict of interest for me to be paid by outside parties to produce governance proposals.) If anyone wants to work on a new proposal they are welcome to do so. My contribution would need to be limited to advising those involved about how to navigate the Maker governance processes (something I currently do for anyone that asks). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.484061393152302
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#64",
                    "likes": "5",
                    "time": "03/05/2021-03:24:10",
                    "content": " I don’t understand neither why they don’t communicate, I tried to contact the CEO on LinkedIn and a lot of their employees, they read my message but didn’t answer  The Foundation does not run MakerDAO anymore. They will be dissolved soon. The “people in charge” are MKR holders.  My loss is approximately calculated at 700k$ right now.  I hope you realize that the compensation amount (if you expect it to be the ETH value of what you lost) being higher also makes it less likely for a proposal to pass? I am sorry for your losses but I think it’s good to keep your expectations in check about what could happen. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.120748299319729
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#65",
                    "likes": "2",
                    "time": "03/05/2021-12:53:39",
                    "content": "That sounds reasonable but you should probably temper your expectations. The calculations for what people allegedly “lost” isn’t simply what one may have had in his or her vault; you have to deduct Dai drawn against it PLUS the actual value of Eth at that time (not today). Only then can one get a fair assessment of their purported losses at the time of alleged harm. Any other way would be to offer the individuals a windfall, which the DAO would likely not support. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.319444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/W34Z3L",
                    "index": "#66",
                    "likes": "0",
                    "time": "04/05/2021-13:44:19",
                    "content": "I am in and probably many more if we properly start preparing a signal request here in the forum. Best to use the templates provided by previous poll starters for the compensation plan. Problem of course is that Maker Voters have more and more power. Still we evidently won the first compensation plan until everything went under. But as others say, we have to limit our expectations. Then again all of us are doing that since more than a year now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.916666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mikaleo",
                    "index": "#67",
                    "likes": "1",
                    "time": "04/05/2021-16:44:39",
                    "content": "As a victim, I don’t think we should limit our expectations, because we were in an unfair game from the beginning, and of course all of this is getting better.  We don’t need to limit our expectations, we just need to make reasonable demands. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.7250000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#68",
                    "likes": "0",
                    "time": "04/05/2021-19:12:14",
                    "content": "I think you need to limit your expectations because it only takes a few whales to torpedo the whole thing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#69",
                    "likes": "0",
                    "time": "04/05/2021-20:47:59",
                    "content": "Well, that’s fine. But one thing to reiterate – and this goes to a question of fairness – is that if the next comp proposal gets approved and paid out, those who would receive payment should be barred from participating in or joining the class action case. Otherwise, they set themselves up for potential windfalls, which is the opposite of “fair”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.516666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#70",
                    "likes": "2",
                    "time": "05/05/2021-04:06:27",
                    "content": "Note also that a lot of people, including myself, would dispute the notion of unfairness here. MKR holders also lost substantial amounts of money due to minting to cover the bad debt and were victims of the events of that day too. For example, the MKR/ETH ratio has still not recovered to pre-BT times. In general, if you’re at the cutting edge of fintech, it’s not going to be plain sailing. Any compensation would come from generosity, not obligations, of MKR holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 3.4107142857142856
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrpickel",
                    "index": "#71",
                    "likes": "5",
                    "time": "05/05/2021-08:02:47",
                    "content": "Just to put some numbers in perspective based on current prices (please correct me if anything is incorrect): Assuming about 62,892.93 ETH were liquidated in the zero bid auctions, and assuming compensating at 24.67% (theoretical maximum auction yield), that would be 15,515.68 ETH or 9,724 MKR or about $50 million at current prices. The MKR market cap is currently about $4.66 billion. So total compensation would be about 1% of the MKR market cap assuming the most generous 24.67% compensation percentage.  To me this seems like it would not be a big deal for the Maker community to come up with this amount in some way to finally put the Black Thursday issue to bed. @AstronautThis Agreed, MKR holders have previously signaled a generous intent by voting to compensate and it would be indeed generous to follow though with the act of compensation. Last compensation vote failed with only 38 unique wallets voting with most votes from only a handful of MKR whales.  If there is ever another future compensation vote, perhaps times will be different and compensation action will be passed by a margin of one or two bighearted MKR whales. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1688596491228065
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mikaleo",
                    "index": "#72",
                    "likes": "0",
                    "time": "05/05/2021-13:56:32",
                    "content": "@ejbarraza You know there are mkr whales, so the community is not decentralized as we think. @Tosh9.0 Okay, this is another discussion about fairness: eth holders mortgage eth and cast dai. Why does eth mortgager have no right to vote? We have to think about who cast dai.  Is it an mkr holder? @AstronautThis Responsibilities match obligations. Generosity is not a charity for victims to request compensation. I reiterate my wishes: justice in the legal sense,fairness in the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.928571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#73",
                    "likes": "4",
                    "time": "05/05/2021-19:52:12",
                    "content": "    mrpickel:  about $50 million at current prices.       mrpickel:  To me this seems like it would not be a big deal for the Maker community to come up with this amount   I suspect most people here do not agree with this. Since ~Dec2020 we have been postponing burning to build a healthy Surplus buffer, now sitting at about 30m usd (after months!) 50m is a huge amount of money.     mrpickel:  about $50 million at current prices.   I just don’t see how one could even imagining asking for reimbursement at current prices. That seems crazy. But maybe it’s just me.     AstronautThis:  In general, if you’re at the cutting edge of fintech, it’s not going to be plain sailing. Any compensation would come from generosity, not obligations, of MKR holders.   I 100% fully agree with this.  MakerDAO lost money and had to mint new MKR tokens to compensate the losses. MKR holders lost money because their MKR dropped in value from 650usd to 250usd. Vault holders lost money because they were liquidated 100%.  So all of you and all of ‘us’ lost money. And this is what (might) happens when you experiment with new protocols, potentially containing bugs and exposed to systemic risk. Just to be more clear: even if we have the best devs, and they follow the best practices in the industry (audits, formal verification, etc), black swan events could (and likely will!) happen again. Every participant in the protocol should know this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely negative feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.716693722943723
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#74",
                    "likes": "4",
                    "time": "05/05/2021-20:56:15",
                    "content": "Reimbursement should definitely be calculated at the point of failure rather than after a huge bull run. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.138888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#75",
                    "likes": "5",
                    "time": "05/05/2021-21:42:48",
                    "content": "Let’s also not lose sight of the fact that current MKR holders may not be the same ones from then. My sympathies are extended, but I would feel like my pockets were picked. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#76",
                    "likes": "3",
                    "time": "06/05/2021-04:31:24",
                    "content": "    mikaleo:  Generosity is not a charity for victims to request compensation. I reiterate my wishes: justice in the legal sense,fairness in the DAO   On the blockchain, legality, fairness etc. is written into the code - hence the saying, code is law. There shouldn’t even be talk of compensation on an obligatory basis because it’s a smart contract. Any compensation is as an act of goodwill from MKR holders to vault owners. I am aware that not all vault owners can be painted by the same brush but the assumption that “justice” or “fairness” entitles vault owners to compensation is pretty unreasonable. Equally unreasonable is the expectation that MKR holders should pay out in ETH value. Let me ask you this: If ETH has crashed to $10, would you be asking for compensation in ETH or in DAI value of the vault at the time? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.761904761904761
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mikaleo",
                    "index": "#77",
                    "likes": "2",
                    "time": "06/05/2021-06:14:10",
                    "content": "I don’t know if I will claim compensation when the price of eth drops to $10. It depends on the investment expectations and the performance of the market. In other words, you cannot simply preset a condition to get a result. The market is complex, the result is the weighted performance of various factors.  I don’t know if code is law, but law is not always perfect. Just like buggy code is not always done right, and communities are not always democratic, just like the existence of whales is a challenge to community democracy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.717261904761904
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#78",
                    "likes": "0",
                    "time": "06/05/2021-11:04:26",
                    "content": "I still don’t understand something, During a well ordering liquidation process, and we saw it recently, all the collateral is liquidated and the dai overleft is returning. So why would you ask for Eth or mkr as compensation for an issue during the liquidation process? Also even during a bull market the dai returned is pretty low. The last eth-b liquidation for 23M was sold with a high discount, and I am not even sure the vault owner gets something back. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6499999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#79",
                    "likes": "4",
                    "time": "06/05/2021-16:38:40",
                    "content": "    alexis:  During a well ordering liquidation process, and we saw it recently, all the collateral is liquidated and the dai overleft is returning.   Actually it is the excess (if any) vault collateral (ETH in this case) that is returned to the vault after liquidation proceeds pay off the outstanding Dai loan (+ liquidation penalty). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#80",
                    "likes": "0",
                    "time": "06/05/2021-17:42:48",
                    "content": "Oh I see thanks, And just by curiousity what was the average percentage retour just before the 0 bit auction? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#81",
                    "likes": "1",
                    "time": "06/05/2021-18:05:22",
                    "content": "I don’t have that exact value, but here I proposed a methodology for determining how much collateral would have been returned in the auction market had operated efficiently.     Vault (near) zero Dai Bid Liquidation Compensation idea Governance       Assume each vault self-liquidated with a flash loan, plus 13% liquidation fee and auction profit of 3%.  Then all we need to know is the price of Dai.  Dai was expensive at the time, and would have been more so if all vault sourced Dai to self-liquidate (price was already spiking over $1.10 without it).  Let’s say everyone pays $1.20 for Dai.  Example:  Vault with 100 DAI debt, holding 1 ETH. ETH price gets to $150, self-liquidate (100 DAI + 13 DAI penalty)*1.03, so owes 116.39 DAI which cost $1…     It’s important to include the fact that the price of Dai spiked at the time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#82",
                    "likes": "2",
                    "time": "06/05/2021-18:49:30",
                    "content": "As long as market rules are active, the liquidation is considered fair = 0 compensation. However, if a technical error in the system turns off the market rules, compensation may be considered by the party responsible for ensuring that the system operates according to the market rules. Self-liquidation cases are not candidates for compensation. Self-liquidation is just speculation = normal market dynamics. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.722222222222221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#83",
                    "likes": "0",
                    "time": "06/05/2021-19:10:51",
                    "content": "Thanks very useful, You wrote 3% auction inefficiency. And 10% to 20% for the dai price. It is easy to forget the dai was quite volatile at that time. The 3% seems underestimated, on the last auction you got easily 10 to 20% cut during a bear market.     mrpickel:  Assuming about 62,892.93 ETH were liquidated in the zero bid auctions, and assuming compensating at 24.67% (theoretical maximum auction yield), that would be 15,515.68 ETH or 9,724 MKR or about $50 million at current prices   So I would say it is around 2.5% of this 63000 Eth. ±1550 Eth so probably around 5M Dai, at eth current price. That doesn’t seem too bad. I think some of you should create a signal request / proposal for that with probably more detail on it, and just a simple question yes or no. I am not too sure where your law case is but it seems complicated to me. PS : just for clarification, I am not a whale. I won’t make it happen. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.483333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#84",
                    "likes": "6",
                    "time": "07/05/2021-20:10:29",
                    "content": "I want people seeking compensation to remember something.   vault owner gets 0 back if the auction yields roughly less than 79% of the DAI borrowed at least at 150% LR vault.   There was nothing special about the 0-bid other than indicating auction efficiency was hampered.   Would anyone have complained if those auctions fetched 50%?   Would anyone have had a reason to complain? There is no reason a-priori to expect a liquidation (especially during market distress) to return ANY collateral. While there was sympathy early on by governance to produce a compensation package support to pass any version of a package appears to have evaporated as time went on.  Also if people want to have any chance of success for such a proposal I suggest to get one large MKR holder on your side as a proposal sponsor.   Literally 5 voters with > 10K MKR have the ability to pass proposals at this point.   The rest of us could vote in affirmative and still have a proposal fail. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0691391941391934
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mkrGoxxed",
                    "index": "#85",
                    "likes": "3",
                    "time": "08/05/2021-19:10:16",
                    "content": "    MakerMan:  There is no reason a-priori to expect a liquidation (especially during market distress) to return ANY collateral.   If this is true, then all UIs were misleading as they just stated a 13% haircut on the remaining collateral. The entire project gained trust (and people’s deposits) to make huge CDPs possible based on false information. The Foundation and Maker holders should own their mistakes, not blame the users for not reading the fine-print. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.678571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#86",
                    "likes": "3",
                    "time": "08/05/2021-21:19:36",
                    "content": "If you believe you have some potential proposal or solution going forward, please propose it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fullname",
                    "index": "#87",
                    "likes": "3",
                    "time": "08/05/2021-21:25:33",
                    "content": "    mkrGoxxed:      MakerMan:  There is no reason a-priori to expect a liquidation (especially during market distress) to return ANY collateral.   If this is true, then all UIs were misleading as they just stated a 13% haircut on the remaining collateral.   Totally agree, a big majority of users came from MakerDAO ads on Coinbase at this time. MakerDAO was advertised as a final product, with 13% fees in case of liquidation. The UI was not advertising a “between 13% and 100% fee”, who would put his money into a tool that can empty everything in seconds? @MakerMan will probably tell us that the code is public, but it’s not for every user to perform stress tests before using the product. And oddly enough, these bugs were fixed in the days that followed. I think we need to get a clear direction going forwards, because otherwise everyone knows that it’s going to keep dragging on (as told us @LongForWisdom last August here https://youtu.be/ZzEbuwyaZRQ?t=2668).     MakerMan:  There was nothing special about the 0-bid other than indicating auction efficiency was hampered. Would anyone have complained if those auctions fetched 50%? Would anyone have had a reason to complain?   @MakerMan the question is not whether we are right to complain, as a reminder:     sepu85:  6-13th April → MakerDAO Governances agrees  on Compensating the victims’s loss 62,483.37 MKR (65.14%) against 33,441.10 MKR (34.86%) that voted no.   MakerDAO Governance agreed for a compensation. So now is the time to compromise and finish what has been started, once and for all. The higher the price of ETH goes, the more judicious it becomes for victims to actively participate and win this battle. Also, let’s not forget that the lost money is currently in the pockets of 1 or 2 people. A priori, these people are registered on this forum and were very familiar with the auctions system. This is why I also find it important to settle this story. Is there someone here that could help us with this new proposal ? ",
                    "links": [
                        "https://vote.makerdao.com/polling-proposal/qmwfvvguaf8rz8xwgv2cqnzzt9t5h6epzh17qmk2ue99y4"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.675736401279879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#88",
                    "likes": "8",
                    "time": "09/05/2021-10:59:54",
                    "content": "    iammeeoh:  I just don’t see how one could even imagining asking for reimbursement at current prices. That seems crazy. But maybe it’s just me.   No it is not you alone. Those crazy demands add up especially to those who don’t like any compensation anyway. Nobody was forced to get liquidated and code is law - this is one of the reasons so far a compensation plan did not pass onchain ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.8333333333333335
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fullname",
                    "index": "#89",
                    "likes": "4",
                    "time": "09/05/2021-18:59:51",
                    "content": "Code is the law when it is supposed to work as it is intended to work. This code was expected to return a part of our ETH after liquidation. What really happened: Someone got our ETH thanks to 0$ auctions. Or maybe you are saying 0$ auctions were designed from the beginning in the code, but we would call it theft. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#90",
                    "likes": "5",
                    "time": "09/05/2021-20:55:01",
                    "content": "Please refrain from unbased allegations, especially with regard to serious activity like “theft.” All the community members in this chat have shown you respect in reading and responding to your various messages, and we simply request the same good treatment (note: you get more flies with honey …). I’ll reiterate what I said earlier – if you have an alternative proposal re compensation, propose it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/W34Z3L",
                    "index": "#91",
                    "likes": "2",
                    "time": "10/05/2021-02:05:41",
                    "content": "Id like to repeat as previous stated that moreover the issue is the system behind the auctions was not transparent enough. And as written here, while not a theft per se: https://medium.com/@whiterabbit_hq/black-thursday-for-makerdao-8-32-million-was-liquidated-for-0-dai-36b83cac56b6  One of the users came up with the idea that problems with the network create a unique opportunity to profit. They began sending minimal DAI fraction in bid at the auction. As there were no competitors at that time, they have received lots up to 50 ETH for their near zero-bid DAI.  Why were there no competitors? I as a user of the vault system understood the basics of the debt bidding but never even thought about being part of the bidding auction process as it was just not transparent enough. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.863095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#92",
                    "likes": "2",
                    "time": "10/05/2021-04:52:01",
                    "content": "    fullname:  Code is the law when it is supposed to work as it is intended to work   Sorry, but that’s not the meaning of “Code is law”.     W34Z3L:  Why were there no competitors?   One thing to remember is that the network was phenomenally congested on that day. You needed insane gas to get a transaction through and this certainly was a contributing factor to the zero bid auctions winning. I’m not sure this conversation is going anywhere at the moment. There seem to be no new proposals - just a rehashing of previous discussions. I think @Tosh9.0 is right - if you would like to see compensation, then please think of a proposal that is both reasonable and differs from the last one, run an informal poll here and see where it goes. Otherwise, this will just be a circular discussion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.870523415977962
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sepu85",
                    "index": "#93",
                    "likes": "2",
                    "time": "10/05/2021-14:28:55",
                    "content": "    fullname:  MakerDAO Governance agreed for a compensation. So now is the time to compromise and finish what has been started, once and for all. The higher the price of ETH goes, the more judicious it becomes for victims to actively participate and win this battle. Also, let’s not forget that the lost money is currently in the pockets of 1 or 2 people. A priori, these people are registered on this forum and were very familiar with the auctions system. This is why I also find it important to settle this story. Is there someone here that could help us with this new proposal ?   I totally agree on this… what I wonder now is what proposal we want to put together… I mean, MakerDAO governance DID AGREE on compensate us victims, but is not accepting HOW to compensate us. I liked very much the last proposal and I think we could repeat that as long as we do have a MKR couple of whales willing to signal at least that they would support it. If not, I think we will be allowed to “spam” the MakerDAO governance with different proposals till the approve one of these.     ultraschuppi:  Nobody was forced to get liquidated and code is law   not sure what you mean, but first, the network congestioncombined wuth the 0 bid auctions  DID FORCE many vaults to be liquidated. And second, code is not law, “code is law” was just a The DAO claim that then was unvalidated by the Ethereum fork actions…     ultraschuppi:  this is one of the reasons so far a compensation plan did not pass onchain   BS, the compensation plan did not pass because MKR holders (actually just a couple of MKR whales) did act in pure self-interest with no consideration of what would be the best for MakerDAO community. In any case, 0-bid auction o black thursday was a Black Swam event with million in losses, so we need to find a way to make MKR holders to take responsability on this, or at least, making it profitable for them. The last proposals included no benefits for MKR holders, just benefits for the victims… How could we incentivize MKR holders to support Black Thursday victims?? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.514033752705628
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#94",
                    "likes": "4",
                    "time": "11/05/2021-15:44:25",
                    "content": "    W34Z3L:  Why were there no competitors? I as a user of the vault system understood the basics of the debt bidding but never even thought about being part of the bidding auction process as it was just not transparent enough.      blocknative.com    Evidence of Mempool Manipulation on Black Thursday: Hammerbots, Mempool... Explore findings from Blocknative's Mempool Archive that shed light on the CDP Liquidations of March 12 and 13. Learn about vulnerabilities that every crypto company should plan for.      Also with regards to:     fullname:  Totally agree, a big majority of users came from MakerDAO ads on Coinbase at this time. MakerDAO was advertised as a final product, with 13% fees in case of liquidation. The UI was not advertising a “between 13% and 100% fee”, who would put his money into a tool that can empty everything in seconds?   As has been stated repeatedly MakerDAO does not control all the UIs to the interface.   All you had to do is read the documentation regarding liquidations to come to understand two basic facts.  Liquidation prices can vary dramatically. Due to (1) IF your vault comes under the liquidation gun you will not get any collateral back if the liquidation price on vaults with LR 150% is below 79% of your borrow.  If you stick your money in a protocol without at least a cursory reading of details of what happens the responsibility is on you, not the protocol.     mkrGoxxed:  If this is true, then all UIs were misleading as they just stated a 13% haircut on the remaining collateral. The entire project gained trust (and people’s deposits) to make huge CDPs possible based on false information.   Show me one single example of where this was stated in this way.  I saw that the 13% liquidation fee is on the entire collateral - NOT the ‘remaining’.    Take your issue to the UI designers for ‘misleading’ you not the protocol that documented these details quite well.    Sure you had to fish around ‘just a bit’ because there are a lot of docs but anyone using this protocol better know details of liquidations as well as how fees are calculated and paid. And let us once and for all take care of this issue:     fullname:  MakerDAO Governance agreed for a compensation. So now is the time to compromise and finish what has been started, once and for all. The higher the price of ETH goes, the more judicious it becomes for victims to actively participate and win this battle.   MakerDAO agreed to form a working group to create a compensation package.   Once the proposal ‘to compensate’ was put forward by the working group it was rejected by governance. The working group achieved the primary goal(s):  To create a compensation package that was as fair as possible to everyone affected. To give governance a full range of choices to not compensate, or to compensate at different levels.  Which would bring me to agreeing with @Tosh9.0     Tosh9.0:  If you believe you have some potential proposal or solution going forward, please propose it.   ",
                    "links": [
                        "https://www.blocknative.com/blog/mempool-forensics"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.642261904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bfalcn09",
                    "index": "#95",
                    "likes": "2",
                    "time": "11/05/2021-17:21:59",
                    "content": "    MakerMan:  As has been stated repeatedly MakerDAO does not control all the UIs to the interface. All you had to do is read the documentation regarding liquidations to come to understand two basic facts.  Liquidation prices can vary dramatically. Due to (1) IF your vault comes under the liquidation gun you will not get any collateral back if the liquidation price on vaults with LR 150% is below 79% of your borrow.    This is an important point that I believe is sometimes missed. If a 150% vault liquidation goes perfect the liquidated collateral would net 13% to the DAO, 66.6% to pay off the loan, and 20.3% back to the vault owner. The vault owner also has the benefit of not having to repay their debt anymore so presumably they receive an effective 87% of collateral. In the Black Thursday scenario vault owners still received 66.6% of their collateral by virtue of not having to repay the debt. So the discussion here is really about that extra 20.3% of collateral max that they could have received if auctions were perfect, not 100%. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.211805555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#96",
                    "likes": "1",
                    "time": "11/05/2021-17:41:32",
                    "content": "Look at this.     MAKER CDP liquidation simulator Community Development   [MAKER CDP SIMULATOR]    For anyone interested in some calculations. Just an excel file. No malware… All restrictions removed.  The BLUE numbers can be changed as you like. The RED numbers are the results of the simulation.  I produced this exercise, because i did not found anything similar on the internet. Maybe someone has some better creation then this?  Maybe the MAKER foundation?  It helped me to better understand the mechanics of CDP’s. This is a steppingstone for more creations.  Please …     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mikaleo",
                    "index": "#97",
                    "likes": "0",
                    "time": "06/06/2021-11:01:32",
                    "content": "Forking mkr to achieve decentralization of governance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#98",
                    "likes": "0",
                    "time": "06/06/2021-15:08:09",
                    "content": "statement? declaration of intent? Wishlist? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mexfogel",
                    "index": "#99",
                    "likes": "2",
                    "time": "18/06/2021-04:37:30",
                    "content": "The fact that MakerDao lost 4M on that day and had to dilute MKR to repay itself speaks very clearly  about what exactly happened on that day. Your suggestions that the auctions where not perfect on that day is an understatement. They malfunctioned and were broken, period. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 4.35
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tedh",
                    "index": "#100",
                    "likes": "2",
                    "time": "18/06/2021-10:06:09",
                    "content": "The reality of the situation is that anyone could have purchased those CDPs for super cheap (yes even you!), but gas was so expensive people didn’t.  Auctions contracts weren’t hacked or not functioning, the players were incorrectly playing with high gas fees and MKR + CDP holders got burnt hard.  It didn’t help the old auction required multiple expensive txns to bid (3 at minimum!). V2 auctions was released to reduce txn count to 1 and was just vetted through the last gas spike we just experienced (200+gwei was yikes). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.238333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#101",
                    "likes": "5",
                    "time": "18/06/2021-14:34:07",
                    "content": "Why not suggest that some portion of the MKR treasury be allocated to compensate the alleged “victims” of BT? Perhaps that would put this all to bed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#102",
                    "likes": "1",
                    "time": "18/06/2021-14:52:46",
                    "content": "Seems like an elegant solution to a long-running problem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amosrendao",
                    "index": "#103",
                    "likes": "1",
                    "time": "28/06/2021-00:08:49",
                    "content": "What would the next step be for getting that officially proposed? If MakerDAO is going to go mainstream, the average laymen is going to need to trust it. With the present tarnished reputation, I see it costing the DAO more in the longterm than it would to compensate the BT victims with the roughly 20% remainder they read would be there in a liquidation scenario (not on third party protocols, but actually read on MakerDAO’s website when considering the risks). Right now I experience so many in person and online conversations with groups getting interested in DEFI, and when MakerDAO comes up it’s nothing but “steer clear” because of how Black Thursday was handled, and that’s before I tell my story. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.508658008658008
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#104",
                    "likes": "0",
                    "time": "28/06/2021-00:18:29",
                    "content": "I don’t know — if you are interested, why don’t you dig into how to draft a MIP and go from there? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#105",
                    "likes": "2",
                    "time": "28/06/2021-18:09:28",
                    "content": "    amosrendao:  Right now I experience so many in person and online conversations with groups getting interested in DEFI, and when MakerDAO comes up it’s nothing but “steer clear”   There might be some confirmation bias on your side. DAI supply has grown to over 5B in the last year so clearly people are using it and far more so than ever before. You are free to try and get the community behind your proposal but it’s worth objectively understanding if the outcome will be what you want it to be. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.925324675324674
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#106",
                    "likes": "1",
                    "time": "30/06/2021-11:50:30",
                    "content": "BT’s liquidations didn’t go according to plan (I think that’s a fact). However, not every liquidation has to be considered for compensation. I also lost a lot at BT. WHAT EVER. I used Maker vaults like before. The only difference - always keep away from liquidation. Thanks to the Maker community! You changed my life forever!  Money Maker1280×721 112 KB  I don`t have the time or expertise to go and analyze all the technical side of the BT events. I think no single person has it. Maybe it would be smart to fund a third party for this work?    Should MakerDAO pay a third party for technical analysis of Black Thursday events?  YES NO     0 voters     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2199074074074066
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fullname",
                    "index": "#107",
                    "likes": "1",
                    "time": "12/08/2021-00:03:04",
                    "content": "This silence from Maker Foundation concerning this 8 millions leak/bug is unbelievable. After 1 year of patience I now have the energy and the money to sue them. PM me if you want to take part of this action. They offered us a ridiculous amicable settlement last year, that we refused, but this time they will pay back the right amount that we all deserve. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.8353174603174605
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mikaleo",
                    "index": "#108",
                    "likes": "1",
                    "time": "12/08/2021-01:42:17",
                    "content": "The process and results of the arbitration are not yet known ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#109",
                    "likes": "2",
                    "time": "12/08/2021-04:03:33",
                    "content": "At the risk of sounding like a broken record, see above: if you believe you have some potential proposal or solution going forward, please propose it [to the DAO]. There are kind and reasonable people here who would certainly listen to and discuss your ideas. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.511904761904763
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mkrGoxxed",
                    "index": "#110",
                    "likes": "1",
                    "time": "12/08/2021-09:50:25",
                    "content": "This is just an excuse for DAO’s passivity to the problem showing how unimportant Black Tuesday has become. It’s also the wrong ownership for solving this mess - why would you think CDP owners are equipped to find and suggest a fix? It’s even more difficult as MKR holders interests are not aligned with those of CDP owners that got burned during BT. There’s a strong need of true leadership to make progress. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.717592592592593
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sepu85",
                    "index": "#111",
                    "likes": "1",
                    "time": "12/08/2021-11:49:10",
                    "content": "    fullname:  This silence from Maker Foundation concerning this 8 millions leak/bug is unbelievable. After 1 year of patience I now have the energy and the money to sue them   don´t bother man… the Foundation does not exist anymore!!  MakerDAO to dissolve Foundation and become truly decentralized again     Tosh9.0:  if you believe you have some potential proposal or solution going forward, please propose it [to the DAO]    ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.0234375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#112",
                    "likes": "1",
                    "time": "13/08/2021-01:34:28",
                    "content": "See my response above, please. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#113",
                    "likes": "2",
                    "time": "13/08/2021-07:52:13",
                    "content": "    mkrGoxxed:  This is just an excuse for DAO’s passivity to the problem showing how unimportant Black Tuesday has become.   I hate to be that guy but from a big picture point of view, Black Thursday compensation is not the most pressing issue that the DAO has to deal with it. Quite far from it. That is why you’re being repeatedly asked to propose a reasonable solution instead of expecting someone else to do it for you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.564814814814815
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mikaleo",
                    "index": "#114",
                    "likes": "0",
                    "time": "14/08/2021-02:06:28",
                    "content": "So what are the things makerdao need to deal with urgently ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#115",
                    "likes": "4",
                    "time": "14/08/2021-21:33:47",
                    "content": "Instead of trying to engage in balancing what is or is not “important” for the DAO,  why don’t you come up with a framework for compensation and propose a MIP? That way, people can discuss,  debate and vote. Otherwise,  y’all just going around in circles. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mikaleo",
                    "index": "#116",
                    "likes": "0",
                    "time": "15/08/2021-03:55:15",
                    "content": "Why？You don’t really think that community governance and voting are democratic and fair, do you? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#117",
                    "likes": "0",
                    "time": "15/08/2021-04:59:11",
                    "content": "sigh … Proposal please. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mikaleo",
                    "index": "#118",
                    "likes": "2",
                    "time": "16/08/2021-12:36:23",
                    "content": "Moving beyond coin voting governance   vitalik.ca    Moving beyond coin voting governance      ",
                    "links": [
                        "https://vitalik.ca/general/2021/08/16/voting3.html"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/W34Z3L",
                    "index": "#119",
                    "likes": "0",
                    "time": "03/09/2021-10:36:21",
                    "content": "God, I love Vitalik. Let’s hope future generations won’t have to deal with the loss of past hacks etc. In our case black Thursday of course. With how wildly NFTs are going right now, I hope a good samaritan just opens a DAO for such compensation payouts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.730654761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mkrGoxxed",
                    "index": "#120",
                    "likes": "0",
                    "time": "03/09/2021-22:44:46",
                    "content": "Can somebody please remind me why the minted and auctioned MKR on Black Thursday only covered the $4 milion bad debt of the system and none of the $6 milion worth of ETH lost by CDP owners at that time? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.291666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#121",
                    "likes": "1",
                    "time": "03/09/2021-23:12:00",
                    "content": "Sure thing. MKR is minted to cover losses to the protocol. Not to users. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sepu85",
                    "index": "#122",
                    "likes": "0",
                    "time": "04/09/2021-08:02:01",
                    "content": "    mkrGoxxed:  Can somebody please remind me why the minted and auctioned MKR on Black Thursday only covered the $4 milion bad debt of the system and none of the $6 milion worth of ETH lost by CDP owners at that time?   whales decision, the $4 million debt put the protocol in risk, therefore MKR value. While CDP owners lost, just harmed the owners pocket, so whales didn´t care about it really. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.633333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mkrGoxxed",
                    "index": "#123",
                    "likes": "2",
                    "time": "04/09/2021-11:32:14",
                    "content": "If we were to revisit this decision, we should rethink governance by realigning interests. Despite high gas fees which clearly favor MKR whales in casting their votes, CDP owners should be issued some voting power proportional to their borrowed collateral and time (risk). This could be a variant of staked MKR with a vesting schedule (maybe like CRV) that can be used only for voting. It should be unlocked for selling after a long time-period or burned as you repay debt or maybe force CDP owners to mint this staked MKR when they borrow DAI to ensure they have voting power. For lack of voting engagement, there needs to be some proxy voting mechanism to delegate CDP-owner voting power to chosen representatives. Currently, It’s easier to inform and have a few big MKR whales vote than many small CDP owners. There’s not even a way to communicate with them en mass. If all this would be in place, we could mint and auction MKR to rightfully repay Black Thursday victims. It’s pretty clear that the current voting is broken and biased. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.01547619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#124",
                    "likes": "0",
                    "time": "04/09/2021-16:27:35",
                    "content": "@mkrGoxxed See the message above, please.     Tosh9.0:  Why not suggest that some portion of the MKR treasury be allocated to compensate the alleged “victims” of BT? Perhaps that would put this all to bed.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mkrGoxxed",
                    "index": "#125",
                    "likes": "0",
                    "time": "04/09/2021-19:36:50",
                    "content": "That would be a great suggestion, but given the current broken governance, there’s no way it will pass by MKR whales. Then, it will create even more risk of never getting any reimbursement. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#126",
                    "likes": "0",
                    "time": "05/09/2021-02:22:23",
                    "content": "So, what’s the alternative?  Bitch and moan about “broken governance” by “whales”? You noticed that Maker has delegation now, right? Why not convince them that your position is the right one?  The only way you do that is by kicking off a MIP.  It just seems silly to me to even entertain these threads anymore if all they produce are bombastic flim flam and drive by vapid comments. Why not try something?  What do you have to lose?  A few hours writing a MIP? Anyway, that’s my two DAI. Won’t be commenting more in this thread. You can lead a horse to water… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.051020408163264
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mikaleo",
                    "index": "#127",
                    "likes": "0",
                    "time": "06/09/2021-10:44:52",
                    "content": "ETH holders create liquidity, but they don’t have the right to vote for governance. This is really an incredible thing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.964285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mkrGoxxed",
                    "index": "#128",
                    "likes": "1",
                    "time": "26/10/2021-00:07:05",
                    "content": "ETH holders > USDC holders    reddit   r/MakerDAO - Dai collateralized by USDC is now under 40%!    8 votes and 0 comments so far on Reddit   …but not important enough to not be sacrificed to MKR  ",
                    "links": [
                        "https://www.reddit.com/r/MakerDAO/comments/qfrd31/dai_collateralized_by_usdc_is_now_under_40/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#129",
                    "likes": "0",
                    "time": "26/10/2021-09:17:13",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}