{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/notice-about-mkr-powerindex-participation/4894",
            "title": "Notice about MKR PowerIndex Participation ",
            "index": 4894,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PowerPool",
                    "index": "#1",
                    "likes": "1",
                    "time": "27/10/2020-22:57:24",
                    "content": "Hi, Maker community. We are launching a Defi index soon, and possibly your protocol token will be approved to be a participant of the index by our community. The Index is entirely governed by the community (token set, weights, internal fees). Also, the index will use all pooled tokens for votings in composite protocols (we call it meta-governance) and for the Vault strategies as well. All profits will be distributed to the holders of the index token, representing the basket of assets inside the index. We are notifying that we will distribute 1% of TTS to the community of every protocol, which will be approved by our community. It is done for one purpose - provide your community governance rights to manage the index (together with other protocols from the index). More info about all this stuff is here. Have a nice day and feel free to ask questions if there are any. Best regards, The PowerPool team ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.484375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PowerPool",
                    "index": "#2",
                    "likes": "0",
                    "time": "27/10/2020-22:58:00",
                    "content": "PowerPool Meta-Governance as Augmented Governance for Effective Protocol Management: https://medium.com/PowerPool/PowerPool-meta-governance-as-augmented-governance-for-effective-protocol-management-d681260ca09b The Power Universe: Understanding PowerPool’s Ecosystem: https://medium.com/PowerPool/the-power-universe-understanding-PowerPools-ecosystem-50f9d7f0be5 Power Forum: https://gov.PowerPool.finance/ Twitter: https://twitter.com/PowerPoolcvp ",
                    "links": [
                        "https://medium.com/powerpool/the-power-universe-understanding-powerpools-ecosystem-50f9d7f0be5",
                        "https://gov.powerpool.finance/",
                        "https://twitter.com/powerpoolcvp"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "3",
                    "time": "28/10/2020-12:19:20",
                    "content": "Hello unnamed person from PowerPool.     PowerPool:  A person should be elected by the protocol community. For example, Protocol Politicians from AAVE should be elected by the AAVE community   I don’t think we’ll be doing this. Community bandwidth is limited, and I’m not sure why Maker Governance should spend time on figuring out where PowerPool should direct grant money when the purpose of Maker Governance is to govern the Maker Protocol. If any individuals here are interested, I’m sure they’ll get in touch with you. Alternatively, find individuals in the PowerPool community with an interest in Maker, and award the grants to them.     PowerPool:  This grant will be divided into two parts: the main one (900k CVP) will be under control of the MakerDAO community   MakerDAO doesn’t currently have the apparatus to receive and control arbitrary ERC20 tokens. It’s also unclear to me as to what the purpose of the 900k grant is.     PowerPool:  All pooled tokens can be used for fund management strategies.   What exactly does this involve?  I appreciate that you’re trying to build the community around PowerPool, but coming to other DeFi communities and offering grant money contingent on a greater integration with your community and product seems a little sketchy to me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3587454212454215
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "1",
                    "time": "28/10/2020-14:33:28",
                    "content": "I believe PowerPool is also running the grants program for YFI, AAVE, SNX, and COMP. It will get some traction with others (ETH heads outside of the Maker Community). Perhaps a good idea to have someone in the Community look at it a bit more? Not sure. But it seems that many are trying to get Index (a.k.a FTSE 100, S&P 500)  protocols going, like Index (DIP), PieDAO, etc. Also, it looks like they copy and pasted the same message in the YFI, AAVE, SNX, and COMP Forums  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PowerPool",
                    "index": "#5",
                    "likes": "0",
                    "time": "29/10/2020-19:30:28",
                    "content": "yes, it’s copy-paste message, but in each of them we pointed out the features and value we can bring to each protocol. It is insanely complex to make 7 completely different messages, when 80+% of the stuff we want to describe in the post is the same. If you would check out YFI for example, you would find differences. Ofc if you read it carefully. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PowerPool",
                    "index": "#6",
                    "likes": "0",
                    "time": "29/10/2020-19:57:11",
                    "content": "First of all, hi. I am head of research from PowerPool. Nice to meet you here! Our team appreciates your critics.  We understand that MakerDAO governance isn’t about interactions with other projects. But, due to Defi composability, the proxy-governance (or the meta-governance) concept is on developing. It means that soon different projects, accumulating (for any reason) MKR tokens inside their liquidity pools would be able to build an option to use these pooled tokens for voting in MakerDAO governance. Of course, you can ignore that, but once pooled liquidity will be significant, it can influence your votings.  We know that the majority of decisions in Maker is done by big bag holders (investors, whales, etc), so probably these pooled tokens wouldn’t be able to influence votings significantly, but let’s see. Here I just want to point out the fact that MakerDAO governance would interact with other protocols with 100% guarantee, according to the fact that these protocols will interact with MakerDAO’s governance anyway:)   We offered this grant as MKR probably would be index participant and therefore these tokens (locked for some time but with the ability to use voting power) can be used by MKR community to have an influence on index management. We just decided that as the index is entirely governed by the community, the community of each protocol from the index should have the opportunity to change something without buying tokens. If you don’t want to participate, we appreciate it.   Fund management strategies involve using pooled tokens for some activity, which generates cashflows distributed to the index token holders. For example, YFI is used in governance and earned rewards are distributed, AAVE will be used in AAVE staking, SNX for minting synthetic assets, and deriving profits from that. For the MKR we don’t have a clear and (what is most important) 100% safe strategy. It is the reason why we didn’t provide it in this post.   Yes, we are building community (btw we already have it, and it is pretty active). But, as we providing value to each protocol that would be inside the index, we decided to post it and attract more people to the index. It’s fair if you don’t accept that, it is your forum.   Thank you for your feedback, we would change this post to a tiny version and cut off all the stuff regarding Powerpool itself. Thank you for your attention and time, probably our community should vote in another protocol to be index participant. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.293560606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "0",
                    "time": "30/10/2020-11:29:28",
                    "content": "The edited first post feels like a less pushy introduction. I appreciate the response to feedback. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.472222222222223
                }
            ]
        }
    ]
}