{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/how-should-major-dai-marketing-decisions-be-made/606",
            "title": "How should major DAI marketing decisions be made? ",
            "index": 606,
            "category": [
                "Governance"
            ],
            "tags": [
                "marketing",
                "alignment"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#1",
                    "likes": "2",
                    "time": "09/10/2019-16:58:26",
                    "content": "I’d like to start a discussion around whether marketing decisions should be voted on (either informally, in this forum, or formally via governance), or if the Foundation should continue to make these decisions unilaterally. Major marketing decisions involving DAI - including but not limited to new logos, new websites, and name changes - can end up playing a critical role in the success & adoption of DAI. As a 20 yr marketing veteran, I am of the opinion that the importance of these decisions should not be underestimated. Marketing really does have the potential to make or break any project. The Foundation has a marketing team that is working hard on improving DAI branding & marketing. However, if the ultimate goal of the Foundation is to decentralize and dissolve, shouldn’t these kind of decisions be ultimately voted on and ratified by the decentralized community / MKR holders? What are the pros and cons of marketing decisions being guided by forum signaling, or being put to a governance vote? ",
                    "links": [],
                    "GPT-summary": "The author, a marketing veteran, is starting a discussion on whether major marketing decisions for DAI should be voted on by the decentralized community or made unilaterally by the Foundation. The author is seeking feedback on the pros and cons of marketing decisions being guided by forum signaling or being put to a governance vote. The author also asks questions about the ultimate goal of the Foundation and whether these decisions should be voted on and ratified by the decentralized community/MKR holders.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.443491032776747
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#2",
                    "likes": "2",
                    "time": "09/10/2019-17:16:11",
                    "content": "I would start with Foundation Marketing Team talking to the community. I don’t think there is much transparency about their objectives, strategy etc.  who and how is using dai currently (traders long on eth, checking account on compound? etc…) what are next markets (we are probably years from online shopping, but maybe DApps?). Or is DSR the main feature?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.316666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#3",
                    "likes": "2",
                    "time": "09/10/2019-18:36:51",
                    "content": "So far I have been under the impression that marketing was always a Foundation responsibility. At least in my mind the Foundation will not be dissolved until further marketing efforts are somewhat pointless because a) we are not getting anywhere or b) everybody that matters knows about us already. Dissolving the foundation is in other words years and years ahead. But please do share your marketing thoughts, personally I could not market ice cream on a hot summer day so I would love to hear your insights. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.109375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "1",
                    "time": "10/10/2019-13:18:52",
                    "content": "I see this as a trade-off between efficiency and decentralisation. While the Foundation could consult the community on every decision, progress would quickly grind to a halt. I imagine that this was one of the choices where it was judged to be quicker and easier to keep it within the Foundation for the time being. In the future I expect to see this change as we become better at governance, and as the DCS is expanded such that it can pay actors directly. With 20 years experience, I’d love to see you start the first decentralised marketing team. You may well be the most qualified MKR holder there is for that particular job. The advantages to including MTHs are that the decisions would be more decentralised. As with other technical work, I think the creation should be left to nominated teams and validation and ratification should be given to either MTHs or nominated Validation Teams. As an expert, did you have specific feedback about any of the branding changes released? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.973214285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#5",
                    "likes": "2",
                    "time": "10/10/2019-20:49:36",
                    "content": "    LongForWisdom:  As an expert, did you have specific feedback about any of the branding changes released?   I think a vote on a few different logo options would have been interesting. I also would like the community to have some input & insight into the new website design & functionality. There are many unanswered questions - particularly important is new user onboarding and how that will be improved with the new website experience. It might be helpful to gain access to the user research that Henry mentioned in the blog post to gain more insight into UX decisions. The last thing I want to do is undermine or question the Foundation marketing team decisions - this is more about wanting to see a continual progression toward total decentralization and marketing is going to be a big, complicated part of that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.627840909090908
                }
            ]
        }
    ]
}