{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/endgame-v3-summary-lod2/17586",
            "title": "Endgame V3 Summary (LOD2) ",
            "index": 17586,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "endgame",
                "endgame-v3"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "6",
                    "time": "01/09/2022-15:13:47",
                    "content": "Summaries reflect my own work and have not been reviewed by Rune. Any mistakes are mine. They are based on the written posts in this forum from Rune. I do not regularly attend Endgame meetings. I wrote this for 2 reasons:  1. To help get my head around the Endgame Plan so I can form an opinion on it. 2. To improve accessibility of what is an incredibly complicated set of concepts and proposals.   Endgame V3  Intro Goals  Overhaul and improve the Maker Protocol. Create a self-sustainable equilibrium called an Endgame State.  Intrinsically Resilient Scope and Complexity stable Reliable as fundamental infrastructure Resistant to external factors   Reorganizing existing workforce into self-sustainable ‘MetaDAOs’  Maker Core is then simple enough to be effectively governed by token-holders.    Benefits   MetaDAOs and Maker Core are synergistic  MetaDAOs receive significant support from Maker Core. Tokens, liquidity and value from MetaDAOs provide yield farming rewards for Dai/Vault/Active MKR users to power adoption.    This is the 3rd major iteration of Endgame  Simplified Tokenomics. Greater focus on reducing RWA exposure.     Meta   Core underlying concept.  Describes all second order, contextual effects related to human interactions around a particular subject.    Sustainable decentralized equilibrium requires…  A very strong and positive meta that is also highly stable - effectively near unchangeable    What this looks like?  A broadly representative amount of token holders(not dominated by one or a few whales) are active. These token holders are in near agreement about exactly what Maker Core is and isn’t No disagreement about which parts of the system MKR voting can change and make decisions about, and which part it can’t. A “self aware meta” where the concept of meta is understood and actively monitored.  Need to understand the meta in order to defend it from gradual negative changes: centralization, corruption, etc.     Meta Engineering Defined: Using tools and technology to shape and facilitate the meta of a community.  Can be simple or complex, forum tech or full metaverse.  ‘metaverse’: an environment that is more conducive for the development of good meta.   Can also just mean using memes and communication to shape the meta, such as explicit culture development or simply branding. Blockchain + tokens are one of the strongest tools for large scale meta engineering ever created. EG:  Early Bitcoin CPU mining (bootstrapping everything) Yield farming of tokens (UNI) Unit bias of memecoins (Shiba Inu) Financial and social incentives driving NFT profile picture adoption   Endgame Plan aims to use meta engineering in its most effective and concentrated form in order to achieve the overall goals of Maker.  To create Unbiased World Currency that generates tangible benefit to humanity through positive externalities such as Clean Money Resilience against any external threat.     Intro to MetaDAOs  Cornerstone of the Endgame Plan is the continuous incubation of born-decentralized DAOs called MetaDAOs. MetaDAOs are born with self aware meta and fully functional decentralized governance  Strong starting point to segregate complexity from Maker Core. MetaDAOs organize human relationships into self-selecting groups of humans with aligned meta.     Governance tokens of MetaDAOs are distributed through yield farming to create broad, heterogenous communities.    Analogy - L1/L2  Maker Governance can be seen as a slow and expensive, but highly secure “Governance L1” MetaDAOs are fast and nimble “Governance L2’s” that ultimately roll up the security of their governance process to Maker Governance, allowing them to take greater risks.  Analogy - Alphabet/Daughters  Daughter companies in Alphabet, with Maker Core as the Google subsidiary and MetaDAOs as the “Alpha Bets”: the non-core products that synergize with Googles core competencies and have asymmetric upside potential.  Analogy - VCs/Startups  Think of Maker as a VC and the MetaDAOs as startups.  Analogy - Cell Division  Better but more abstract way to think of MetaDAOs: cell division. Precursor cell divides, leaving two new cells which share DNA and essential components and infrastructure Then specialize into the most beneficial function that maximally benefits their symbiosis.   EtherDai (ETHD) and the importance of Ethereum   Ethereum is important.  Effectively guaranteed that the future of DeFi and eventually most global economic infrastructure will run on Ethereum blockspace. Inevitable that ETH will “flippen” bitcoin and become the top fully decentralized cryptoasset in the long run.    Maker is already heavily embedded into Ethereum  Will be increased in Endgame. Ethereum reliance and Ethereum dominance becomes fundamentally intertwined with the permanent end state of Maker Core, and the long term value and stability of Dai.    Key initial step of the Endgame Plan is the launch of EtherDai ($ETHD)  New Synthetic asset that is controlled by Maker Governance and aggregates the top liquid staking tokens for Staked ETH. Long term survival and success of a DeFi protocol comes from their ability to accumulate as much Staked ETH collateral as possible. Whenever Maker incentivizes Dai generation from ETHD, or accumulates ETHD, Maker is also bootstrapping the growth of its own flagship product that may be as important as Dai itself. Initially ETHD is built in a bootstrap version that allows it to quickly begin accumulating liquidity and users.     MetaDAO Token Emissions  Yield Farming is meta-engineering. Each metaDAO has 2 billion tokens. 10 year farming, 1 billion in first 2 years, halfing every 2 years. Also, MetaDAOs emit 3% of their total supply every year towards permanent yield farming.  20% to DAI farm - Creates DAI demand, spreads MDAO token widely. 40% to ETHD farm - Incentive to generate decentralized DAI. 40% to MKR farm - Powerful voting incentive.   Wide and heterogenous distribution of MetaDAO governance tokens while remaining aligned with Maker and MKR holders    Active supply and demand levers  Dai Savings Rate (DSR) and Stability Fee Base Rate (SFBR)  Help protect the DAI peg from downside risk. DSR allows users to earn a simple yield on holding Dai funded directly from the Surplus Buffer SFBR increases the stability fee of some or all vaults, increasing income to help fund the DSR.  Result: Increasing these has upward Pressure on DAI Price  Target Rate (TR)  A mechanism that continuously changes the Target Price of Dai over time.  Once engaged, Dai will free float away 1:1 with USD by gradually changing its price over time according to the target rate. PSMs and liquidations will follow the Target Price when determining their prices.   Extremely powerful tool that enables Maker to put a hard limit on RWA exposure while encouraging more Dai generation from decentralized collateral. However the cost is very high and permanent. Once the peg has been broken, the 1 Dai equals 1 Dollar meme can never be regained. Endgame Plan assumes that a regulatory crackdown on RWA collateral is likely to happen eventually.  Resilience in this case relies on breaking the 1:1 peg. This will have immediate and severe ramifictions, leading to a large outflow in users.   Ultimately worth it as a differentiator against centralized stablecoins.  Results:  Positive TR increases demand for Dai and reduces supply of Dai (theoretically). A negative TR has the opposite effect, it reduces demand for Dai, and increases supply.**   Protocol owned vault  Very different mechanism. Synergetic with negative TR. A special Maker Vault only usable by Maker Governance.  Holds ETHD and potentially other decentralized assets as collateral. Generates Dai against this collateral. Cannot be liquidated and has no Stability Fee.   Used to generate more Dai and purchase ETHD with the newly generated Dai. Directly increases the share of Dai backed by decentralized collateral. A large scale Protocol Owned Vault makes it must safer to activate a negative TR and free float Dai.  It can step in to generate more Dai if the TR gets overly negative. Benefits users of Dai while also allowing the Maker Protocol to earn significant yield both from ETH staking and exposure to debt with negative rates.      Endgame Collateral Categories  Target a portfolio that fulfils the vision of unbiased world currency. Requires decentralized assets for resilience. Requires real world assets for liquidity and stability, and providing tangible positive impact to the world.   Decentralized Collateral  ETH  ETH, Liquid Staking Tokens, EtherDAI, ETH/DAI LP Tokens. Incentivise ETH collateral through MetaDAO farming. Protocol Owned Vault to accumulate ETHD.   Misc Decentralized  UNI, LINK, and LP tokens based on such assets Only rarely scalable to be worth it directly to Maker Core.   MKR  Endgame Plan significantly changes how the MKR asset is used and its economic characteristics. The liquidity backstop is no longer enforced, and instead becomes optional subject to a governance decision. The possibility of passing on a loss to Dai holders through a haircut to the Target Price becomes explicitly possible (it is already technically possible for Maker Governance to do this today, but not supposed to happen based on expectations and current meta).  Why?  The backstop mechanism of MKR isn’t very useful in the first place.  The moment when you actually need it MKR will typically be near worthless anyway, resulting in no effective protection.   Once the role of automatic backstop is removed, MKR becomes a very useful form of decentralized collateral for Dai through overcollateralized vaults. That can…  … generate stability fees for the protocol … also participate in governance … also farm MetaDAO tokens   This allows MKR to play an important role in reducing exposure to seizable RWA.   MDAO  MetaDAO Tokens However, MetaDAOs do have the role of providing a forced backstop to risk generated within the MetaDAOs. As a result the amount of exposure that Dai has to the tokens of each MetaDAO must be heavily restricted.   Real World Asset Collateral  Cashlike RWA  Centralized Stablecoins, Short Term Government Bonds To maximize its usefulness as a currency, especially when growing, Dai needs to have a reliable exchange rate and deep liquidity to other stablecoins and cashlike assets. Achieved through Cashlike collateral, which is a portfolio of on-chain and off-chain stablecoins and low risk, short term bonds. Actively monitored and managed by the Stability & ALM Tribunal (described later). Downside with Cashlike RWA is that it is easily seizable. Total exposure must be limited in the long term.   Clean Money RWA  Renewable energy projects, sustainable agriculture assets. To achieve global adoption a brand that is mainstream relevant is required  Clean Money collateral makes this possible through the positive meta it generates and the Clean Money brand.   Downside is Clean Money RWA assets are easily seizable.  One major advantage on this front is that the positive meta and branding they generate could help create popular resistance and impose a political cost on…  … attempts to seize the assets … attempts to attack Maker in other ways.       Misc RWA  WBTC, cross-chain bridge tokens from L1’s, Security Token Vaults Miscellanous RWAs are on-chain assets that are centralized and don’t fit into another category. Seizable, but can have the disadvantage that they don’t immediately appear to be RWAs and as a result Maker might fail to take proper precaution of the seizure risk.   Physically Resilient RWA  We assume that at a point in the future there will be a severe crackdown on use of RWA in crypto, and anything that can be seized by global powers will be at serious risk of seizure through legal means. Physically Resilient RWA are real world assets that cannot easily be seized, and that a DAO like Maker can retain some level of technical sovereignty over. Challenging concept to design and create, and it will take years or decades before it is realizable. A hypothetical example of what future Physically Resilient RWA could look like are renewable powered drone ships that can be disabled and re-enabled through on-chain governance and operate long term in international waters.    Unbiased World Currency Stances What?   Endgame Plan requires the Maker Protocol to be able to handle the possibility of a significant deterioration of regulatory security alongside global economic and social decline.   To be able to adapt to this changing environment, the Maker Protocol will adopt different “stances” that impact the collateral makeup of the Dai Stablecoin.   This prepares the Maker Protocol to survive and recover from the realistic worst case scenarios that can occur over the coming years and decades.   Overall multi-year strategy:  First focusing on “world currency” by prioritizing keeping the 1:1 USD peg and not putting a limit on RWA exposure Then switching to focus on “unbiased” by allowing the peg to break and enforcing hard limits on RWA exposure. Then switch to a new stance that is triggered by conditions that are set as part of the Endgame Plan approval, providing long term certainty and risk guarantees to users of the Maker Protocol.    There are three stances:  Pigeon Stance where there is no limit to RWA exposure and Dai remains pegged 1:1 with USD Eagle Stance where Dai becomes free floating with a negative Target Rate Phoenix Stance where Dai no longer allows any RWA other than Physically Resilient RWA    Stances have a set of Automatic Targeting Rules  Global rules implemented with automatic smart contracts that measure the state of the collateral portfolio and react by adjusting levers like…  … the Dai Savings Rate … the Stability Fee Base Rate … the Target Rate.       Pigeon  Maker starts in Pigeon at the moment of the Endgame Plan Launch. Suitable as long as the regulatory threat is still minimal and global economic conditions are stable. Make as much money as possible that can be used to accumulate ETHD in the Protocol Owned Vault. Pigeon Stance lasts 2.5 years (30 months), and the protocol then automatically switches to Eagle Stance after having had 3 years of preparation. Should the external threats to Maker be much better understood and it is clear there is no immediate risk, then can be extended.   Targeting Rules  If Cashlike RWA < 10% = DSR and SFBR begin to automatically increase If Cashlike RWA > 15% = DSR and SFBR automatically decrease until 0% If Clean Money RWA < 5% = Propose increase in debt ceilings to MetaDAO Clean Money Vaults if good deals are available. If RWA > 25%: 90% Of protocol surplus must go to accumulate ETHD for the Protocol Controlled Vault. Physically Resilient RWA counts as only half RWA for the purposes of these calculations. So as an example if there is 10% exposure to Cashlike RWA and 20% exposure to Physically Resilient RWA, it would count as a total RWA exposure of 20% for the sake of calculating the targeting rules.   Eagle  Becomes active after 2.5 years of Pigeon, or in a rare situation where it provides a clear regulatory benefit to not have a 1:1 pegged stablecoin. Eagle Stance guarantees that Maker’s exposure to seizable RWA is limited to no more than 25%, and to achieve this Dai in unpegged from the dollar if necessary. The result is that Dai is able to survive even the most severe regulatory crackdown or physical attack…  … but at the same is still able to take advantage of RWA liquidity and Clean Money projects that demonstrate the positive impact of Maker and DeFi.   6 month windup period where there is a limit to how negative the TR can get. This limit is removed after 6 months.   Targeting Rules  Physically Resilient RWA counts as only half RWA for the purposes of these calculations. So as an example if there is 10% exposure to Cashlike RWA and 20% exposure to Physically Resilient RWA, it would count as a total RWA exposure of 20% for the sake of calculating the targeting rules. If RWA > 25% within 6 months of entering Eagle Stance: TR starts to decrease to a minimum of -5% If RWA > 25% after 6 months of entering Eagle Stance: TR starts to decrease with no minimum If RWA < 25%, Cashlike < 10% and TR < 0%: TR starts to increase up to a maximum of 0% If RWA < 25%, Cashlike < 10% and TR = 0%: DSR and SFBR starts to increase If RWA < 25% and Clean Money RWA < 10%: Make governance proposals for increased Clean Money RWA debt ceilings if good deals are available. If Physically Resilient RWA < 25% (after accounting for 50% weight multiplier for Physically Resilient RWA): Make Governance proposals for increased Physically Resilient RWA debt ceilings if good deals are available. If Clean Money RWA + Physically Resilient RWA > 25% (after accounting for 50% weight multiplier for Physically Resilient RWA): Begin to slowly liquidate Clean Money RWA projects.   Phoenix  Phoenix Stance is the final stance of the Endgame Plan, where Maker and Dai reache the form of maximum resilience and survivability. ]  Only triggered if either…  there are clear signs of an impending attack on the RWA collateral there is general global economic and geopolitical instability     No longer allows easily seizable RWA as collateral.  Only Decentralized Collateral and Physically Resilient Collateral. PSMs will no longer function  Target Rate will be modified based on Market Price deviation rather than PSM collateral.     If there are no currencies, inflation of Dai purchasing power relative to a consumer price basket chosen by Maker Governance must be calculated directly by the Stability and Liquidity (Explained further later)   Targeting Rules  Cashlike RWA, Clean Money RWA and misc RWA are not allowed as collateral in Phoenix Stance. Any remaining Cashlike RWA, Clean Money RWA or Misc RWA is “uprooted”, which means that all of the assets are immediately converted to ETHD and the debt and ETHD proceeds is transferred to the Protocol Owned Vault. Physically Resilient RWA has no weight modifier like in Eagle Stance, as it is now the only type of RWA available. If Physically Resilient RWA < 50%: Make governance proposals to increase Physically Resilient RWA debt ceilings if good deals are available.    MetaDAOs  Role of MetaDAOs  Core value propositions…  Segregate, derisk and parallelize Makers highly complex governance processes. Blank slates with resources and processes already in place for a new community and workforce to pursue opportunities in the blockchain ecosystem.   Key is that each MetaDAO is well positioned to develop a new community with a unique, self-aware meta.  Creates a higher likelihood that some of them will be able to achieve strong meta and viral growth with minimal corruption and free rider problems.   MetaDAOs run their governance processes on top of the Maker Core governance infrastructure.  Control of MetaDAO owned protocols and treasury is held by MKR voters. In practice controlled by MetaDAO voters through signal polls that are included in Maker Executive Votes. MetaDAOs can have fully decentralized token distribution from genesis without being vulnerable to governance attacks. Can take more risks that can have unknown impacts on their meta, because the Maker Governance process can always act as an “appeals court.     MetaDAO Frontends  Central to the fundamental value of all MetaDAOs are their MetaDAO frontend.  Primary place for a MetaDAO to express its brand and meta in order to connect with new users and community members.   All have the same base features. Different MetaDAO classes will focus on different features. Initially relatively simple with features copied from other products. Medium term all MetaDAO frontends are fully decentralized and provide redundant options for financial security, financial resilience and financial privacy easily accessible to regular people.   Maker Vaults, revenue share and farming  Main product available on all frontends are Maker Vaults, especially ETHD with active MetaDAO yield farming. MetaDAOs earn 25% of all net stability fees generated from Vaults managed through their frontend. MetaDAO farming allows the MetaDAO to promote farming and holding their own governance token, helping them to expand their community and strengthen their meta. Especially important for Creator class MetaDAOs (see below). Dai farming is also a key feature in the frontends.   Governance Interface  MetaDAOs also run governance interfaces in their frontends.  Internal governance for MetaDAO. Complete end-to-end governance for Maker Core.   Provides easy access to MKR faming of MetaDAO tokens. This diversifies access points to Maker Governance. Focus for Governor MetaDAOs (see below).   Classes  Three classes of MetaDAOs.  Governors, Creators and Protectors. Class determines how it interacts with Maker Core. Otherwise all classes free to do whatever.     Governors  Responsible for organizing the Decentralized Workforce of Maker Core. Enhance governance participation and function of the Maker ecosystem. Operate Councils, Core Units and Tribunals based on the Results Guarantee system.   Results Guarantee System  Works by giving the Governors additional overhead fees on top of the base budgets that are paid to the Decentralized Workforce. In return the Governor can be held accountable for issues that occur.  Transfers the operational risk of running the Decentralized Workforce from Maker Core to the Governors.     Short Deviation into Scopes  Decentralized Workforce and Maker Governance Process is broadly divided into 11 focus areas known as Scopes.  4 Primary Scopes each have…  Single Council Multiple Core Units   7 Supporting Scopes each have…  Single Tribunal     Explained more later.   Councils  Advise Maker Governance on how to best design the transparent, open source Scope Frameworks  Rest of the Decentralized Workforce within that Scope must adhere to this. Also defines KPIs for workforce in that scope.   No operational role No governance privileges or budget responsibility beyond working on the Scope Frameworks.   Core Units  Top-level operational units in the decentralized workforce. Main function is to control the budgets allocated to each Scope Access governance fast track for proposals directly related to their Scope. Each Governor can operate a Core Unit within each Scope.  A Scope can have more than one Governor operating a Core Unit. Creates internal redundancy and parallelization in the workforce.   Core Units work as RFP/outsourcing hubs - no heavy lifting. Specialize in creating public bidding processes for projects defined by the Scope Map for their particular Scope. MetaDAOs and Ecosystem Actors compete to carry out the work under the supervision of the Core Unit, using its budget and governance privileges to execute the work.   Tribunals  Supporting Scopes (usually smaller) are coordinated by Tribunals. Combines the role of Council and Core Unit. All Governors participate in all Tribunals.  Shared responsibility for proposing changes to the Scope Framework and controlling a single, shared budget.     Creators  Focus on growth and innovation in the Maker ecosystem and the fully decentralized, deep crypto ecosystem. Most open ended of the MetaDAO classes in terms of which direction they can take.  Focus is raw innovation and experimentation, both with technology but also with branding and meta development.   Unique interactions with Maker include Vault Adoption of decentralized Vaults and receiving special “home base” benefits on a specific L2s. Creators are particularly well suited to complete MakerCore tasks related to technological development and web3 marketing.   Decentralized Vault Adoption  Creators can “adopt” existing or new vault types on the Maker Protocols Vault Engine. Vault Adoption requires that Maker Governance gives the Creator a Vault Adoption Debt Ceiling, and a Vault Adoption Cost of Capital via MIP. Creator chooses vaults to adopt using internal governance processes. Adopted Vaults behave differently than normal Vaults.  Only pay part of the stability fee to Maker Core, defined by the Vault Adoption Cost of Capital. If they have issues with liquidations or otherwise cause losses, the Creator takes first loss on all downside.   Longer term, adopted vaults are replaced with MetaDAO Lending Engines   Home base  Creators choose a Home Base, which is an L2 or shard with an active Maker Vault Engine. The Creator receives a 1% revenue share of all net stability fee income from that Vault Engine.  This incentivizes the Creator to participate and develop the adoption and integration of the Maker Protocol on the shard. Gives Maker Core a way to directly engage with specific L2s and Shards in a parallelized and decentralized manner.     Protectors  Focused on intermediating Maker Cores interaction with the physical world. Primary focus is to allocate collateral to real world assets Also have responsibility for protecting Maker against physical and legal threats to its RWA collateral. Unique interactions with Maker Core include RWA Vault Adoption and Phoenix Staking. Protectors are well positioned to use their internal workforce resources to execute on projects related to the real world in some way: like marketing / legal work   RWA Vault Adoption  Protectors can obtain a Vault Adoption MIP that provides them with a Vault Adoption Debt Ceiling and a Vault Adoption Cost of Capital. Protectors can only adopt RWA Vaults that either conform to the Cashlike RWA Collateral standard or the Clean Money RWA Collateral standard. Protector can use its internal governance to allocate up to its Vault Adoption Debt Ceiling to its Arrangers.  Return is split between Maker, which earns the Vault Adoption Cost of Capital, and the Protector, which earns anything in excess of that.   The Protector takes first loss with all of its assets. Protector is responsible for paying all expenses related to the Adopted Vaults. Protectors have two distinct Vault Adoption MIPs, one governing their Cashlike RWA collateral, and one governing their Clean Money RWA collateral. Cashlike RWA Collateral can have an effectively unlimited debt ceiling as long as there is excess Cashlike Collateral that must be reallocated according to the RWA Collateral Scope Framework. Clean Money RWA Collateral requires two layers of Junior Capital in order to scale up its debt ceiling, both at the Arranger level and also at the MetaDAO level.   Phoenix Staking  Unique feature that all Protectors must offer once the technology has been developed. Enables users to deposit ETH into a smart contract, where the ETH then both earns staking yield, and on top of that also earns an additional risk premium. The ETH is then used to take first loss if there are RWA losses from Vault Adoption by the Protector, 50/50 alongside the Protectors own reserves. If the Maker Protocol is forced to rapidly exit all of its RWA exposure (An uprooting event when entering Phoenix Stance) due to a severe external threat, all the Phoenix Staked ETH is paid out to Maker Core. Protectors pay 20% of their surplus to fund the Phoenix Staking Risk Premium.   MetaDAO Clustering + Workforce   MetaDAOs have an internal governance process with token voting and delegation which is coordinated through forum and discord discussions.  The most important thing that MetaDAO governance must deal with is onboarding and managing their internal workforce.    Internal workforce of a MetaDAO is split into teams.  Teams must not become black boxes.  Maximum team size of 7 people per team.      MetaDAO cannot be created with pre-existing teams.  Governance is determined by token holders that are unknown until the MetaDAO genesis distribution begins. Instead prospective MetaDAO teams “cluster” in advance of the launch of the MetaDAO. Clustering means preparing proposals and interacting with people considering farming MetaDAO tokens in order to build support for the future proposals.    The clustering process and pre-launch community interaction plays a crucial part in shaping the meta of the future MetaDAO.  The community impacts which teams want to cluster to the future MetaDAO The teams that are clustering to a future MetaDAO also impacts which people will want to farm the tokens of the future MetaDAO. The goal is that the MetaDAO can stabilize its meta quickly following launch, and onboard clusters that are fully compatible and positively contribute to the stabilized meta.    Two types of teams: Administration Teams and Contribution Teams.    Administration Teams  Administration Teams directly interface with MetaDAO governance, make proposals, receive budgets and governance fast-track privileges. An Administration Team is led by one or more Facilitators, who use their governance privileges and budget powers through consensus. Administration Teams are comparable to the Facilitator role of Core Units  Also comparable to Governance Facilitators as a part of their job is to run the core governance processes of the MetaDAO. Due to the small scale and flexible nature of MetaDAOs, their role includes community interaction and management, and taking care of gaps or opportunities.   Initially MetaDAOs will likely be run by a single general purpose Administration Team.  As a MetaDAO scales it switches to having multiple Administration Teams that can specialize within different areas of responsibility.   All members of Administration Teams receive MetaDAO tokens from the MetaDAO Internal Workforce Bonus Pool.   Contribution Teams  Specialist teams that are funded by Administration Teams.  Less exposure to the MetaDAO Governance and don’t make proposals or have governance fast-track privileges.   Focus on more specialized work, such as development, risk or marketing, depending on the class and priorities of the MetaDAO. Can both work to build and improve the MetaDAO, or the MetaDAO can provide the services of their Contribution Teams to external customers, other MetaDAOs or Maker Core for a fee. The fluidity of Contribution Teams helps increase efficiency of the overall Maker Ecosystem as it means people can work where they produce the most value, rather than just where they are onboarded. All members of Contribution Teams receive MetaDAO tokens from the MetaDAO Internal Workforce Bonus Pool  Main characteristic that distinguishes whether something is a Contribution Team or just an ecosystem company.     Ecosystem Actors  Any kind of company, person, entity or DAO that is doing business with the MetaDAO, and isn’t an Administration Team or Contribution Team. A key resource of MetaDAOs comes from interfacing with Ecosystem Actors. Usually highly specialized, and offer their services to multiple or all MetaDAOs, and often also Maker Core. Most common relationship is simple contracting based on a statement of work or an hourly rate.  More advanced and experimental relationships can also be explored.   Ecosystem Actors are paid either by an Administration Team or a Contribution Team from the MetaDAO Internal Workforce.   Arrangers  Specific type of Ecosystem Actor that allocates RWA collateral for Protectors. The intermediary between the decentralized world of DeFi and MetaDAOs, and the traditional financial and legal systems. May only interact with a single Protector The RWA Collateral Scope Framework regulates how much risk concentration a MetaDAO can have to a single Arranger. Can provide both Cashlike Collateral and Clean Money Collateral, and a single Arranger can also have more than one Asset Manager that allocates the underlying capital in the real world financial system.  Clean Money RWA Asset Managers must always have Junior Capital available at the Asset Manager level, based on requirements specificied in the RWA Collateral Scope Framework.     Plug and Play Protocols  Advanced and unique opportunity for Ecosystem Actors is to develop Plug and Play Protocols. Open source protocol features that are able to charge a fee of some sort for usage, and are easily available for MetaDAOs to integrate into their decentralized frontends. Revenue share percentage and minimum fee parameters specified, and a payment address in source code. All fees earned by the MetaDAO from integrating the Plug and Play Protocol are then split with the Ecosystem Actor and sent to their payment address on a recurring basis.  Enforced by Maker Governance, which will penalize the MetaDAO if it fails to properly account for and pay out the revenue share it owes. This creates the conditions for a sandbox of innovation where open source developers can monetize their code without worrying about trade secrets or IP rights.   All MetaDAOs can take advantage of Plug and Play Protocols, but Creators are particularly well suited to experiment with their technology.   7 Launch MetaDAOs  Main event of the Endgame Plan launch is the simultaneous or sequential launch of 6 new MetaDAOs (depending on logistics and pragmatic considerations). Carefully prepared with complete, high quality clusters for each of them so that they can all hit the ground running.  Alongside this, 7 separate forums and discord channels will allow a community and unique meta to emerge, and allow the clusters to connect to the community.   3 Creators, that will onboard developers and build frontend products and on-chain features 2 Protectors that will adopt existing Arranger RWA Vaults, and build redundant, lean deal teams to underwite future arrangers and scale up Cashlike and Clean Money RWA when required 2 Governors that will onboard all the existing Maker Core Units and establish Councils and Tribunals for the most critical Scopes in the short term.   Long Term  After launch, additional MetaDAOs will begin to be incubated through an autonomous smart contract system. No humans involved in the incubation of new MetaDAOs - everything is automated via a smart contract system called the Incubator. Clustering to these MetaDAOs occur with less organization and more competition than the 7 Launch MetaDAOs. Cooldown period will prevent MetaDAOs from onboarding Administration Teams until at least 3 months (exact TBD).  Allows the meta of the new MetaDAO to settle before votes occur.      Maker-Level Governance Roles  Maker Core also has roles that are carried out directly by companies or individuals, without going through MetaDAOs as intermediaries.  None oare elected through a general governance processes.  Instead they are marginally empowered by MKR holders in different ways to represent those specific voters. Provides strong minority stakeholder protections and reduces the risk of Maker level governance actors destabilising the meta.       DVCs  Most important organized governance body Goal is to openly organize and represent regular voters that are incentivized by their MKR token exposure. Needed to counterbalance the influence of the Decentralized Workforce and professional governance roles. Organize broadly and generally as a loose group of voters with aligned overall values and views.  Use chatrooms and forums to discuss their views.   DVCs directly engage in the important high level questions in Maker Governance by organizing Subcommittees and Subcommittee meetings that cover the 11 DAO Scopes.   Recognized Status  DVCs can become Recognized by the Governance Tribunal through a process approved by MKR voters in the Governance Scope Framework MIP and managed by the Governance Tribunal.  Objective is to ensure that the DVC contains real, independent MKR voters that have publicly registered some or all of their MKR stake to be aligned with their DVC. Ensure contribution to Maker Governance in good faith based on their incentives as MKR holders and community stakeholders. Ensure members of the Decentralized Workforce cannot be registered to a DVC.    Benefits  Recognized DVCs name and logo are directly displayed in the Maker Governance frontend and ranked based on MKR support. Registered DVC Subcommittee participants can earn MKR compensation for their participation on the Subcommittees. Recognized DVCs may call Council members, Tribunal members and Core Unit Facilitators to their Subcommittee meetings in order to gain the latest updates, advice and proposals on the specific Scope.  Requirements  Must hold quarterly Subcommittee meetings for each DAO Scope that are verified by the Governance Tribunal.  Verified = at least one publicly registered MKR holder must attend.   Must formalize their internal governance structure to follow a simple majority of registered MKR.  The most important role of the internal governance process is control membership, so the DVC can maintain a single coherent direction and vision.   Major governance disputes inside a Recognized DVC will result in the DVC splitting into two new Recognized DVCs.  Governance Tribunal determines inheritance of branding, usually the side with most MKR.   Must adhere to the overall scope constraints of the Endgame Plan. Responsibility to maintain the stability of the Endgame meta, cash flow incentives and complexity.  Any attempt to change the meta or fundamental rules of Maker must be interpreted as a power grab attempt that aims to directly or indirectly centralize control of the protocol.     Delegates  Play a critical and central role in the governance of Maker. Reliance is further increased in Endgame and used to engineer a stable long term meta, through the MetaDAO token farming incentives to active delegators. Delegates have the potential to gather significant amounts of voting power, shifting the balance of power away from MKR whales and towards the major delegates. Makes regulation of the official governance frontends extremely important, and dealing with this challenge is the main objective of the Recognized Delegate system.   Recognized Status   Can become Recognized by the Governance Tribunal if they post an application and hold a public onboarding meeting.  Used as their independent delegate strategy. Makes them eligible for compensation based on the amount of MKR that is delegated to them and their DVC attendance Gives a higher position in the official governance frontends.    In addition to their independent delegate strategy, delegates can also support one or more DVC strategies.  Makes it possible for voters to delegate MKR to a Recognized Delegate.  Constrained in that the delegate must vote according to the overall principles and values of a particular DVC.      Can freely support any DVC strategy without requiring approval.  DVCs internal governance process can reactively ban a Recognized Delegate from supporting the strategy if the delegate votes against its values. Banning a Recognized Delegate from supporting a DVC strategy prevents them from receiving more vote delegation in support of that strategy Doesn’t remove the existing votes, and the existing votes instead effectively become a part of their independent strategy.    Having additional DVC strategies increases the position of the Recognized Delegates in the official governance frontend.   DVC Subcommittee attendance  Recognized Delegates become eligible to earn compensation based on MKR delegated to them but must attend DVC Subcommittee meetings in order to receive the compensation. Hours required increases as they become eligible for higher compensation, with the maximum achievable compensation corresponding to a DVC Subcommittee meeting attendance and preparation equivalent to a full time job. Delegates can also be banned from attending DVC Subcommittee meetings if they are abusing it to unlock the compensation and not actively contributing.     3 Categories of Delegate and their Frontend Ranking  Frontends categorize delegates into 3 ranks. Randomized within ranks.  Rank 1: Recognized Delegates supporting at least 2 DVC strategies  Forced to be more objective and professional in serving the interests of their voters Less likely to destabilize the meta.    Rank 2: Recognized Delegates supporting less than 2 DVC strategies  At higher risk of being biased and entrenched in their specific single perspective.    Rank 3: Unrecognized Delegates  Any delegate contracts that have not achieved Recognized Status. High risk of sybil attacks.     Budget Allocators  Optional role that provides a tool to allow minority voters to impact budget allocation. Technical system must first be built, and once built must be provided with an Allocated Budget through a MIP (could be fixed or relative.) Companies and individuals can then sign up as Budget Allocators  Recieve delegated budget power from MKR. Can be split from voting power if MKR holder wishes, otherwise goes to delegate then to budget allocator.   Total Allocated Budget split between delegates based on their relative Budget Power (non-custodial).  Can then either pass it on in a continuous streaming fashion, or in lump sum payments to Core Units and Tribunals only.   Maker Governance can freeze the Budget Allocator system at any time and clawback funds.   Recognized Status  Can become Recognized by the Governance Tribunal if they post a public information sheet and hold a public Q&A meeting. Recognized Budget Allocators become eligible for compensation, and are prioritized in the Budget Allocator frontend, but must post continuous updates and transparency reports.  Compensated based on a % of the budget power that flows through them.      Scopes  11 focus areas of Maker Governance that encompass the entire universe of complexity of valid Maker Governance decisions. Chief objective is to create a rigid structure that prevents scope creep or drift over time.  Also ensure that no critical functions are neglected and remain easily accessible to governance.   Each Scope is governed by a MIP called a Scope Framework.  Continuously edited through a ratification process where Maker Governance votes on new versions based on input from all relevant experts and stakeholders Curated by the Councils and Tribunals, run by the Governors.   Two categories: Primary and Supporting. Primary are direct business focused scopes that cover the most critical day to day operations of the protocol.  They have high budgets, and multiple redundant Core Units provided by different Governors. Strong balance of power where Councils are the ones tasked with researching and updating the Scope Frameworks, while the Core Units have to operate by interpreting and following the Scope Frameworks.   Supporting are “backend” functions of the DAO that are necessary for the ecosystem to thrive and function properly in the long run.  Lower budgets, and are controlled by singular Tribunals that all Governors participate in.     Unified Coordination Toolkit (UCT)  Critical that the Decentralized Workforce of Maker Core only use fully transparent and decentralized processes for all operations and decision making. The primary method used to enable this is the UCT. A single open source software system that simultaneously works as a transparency and governance reporting tool, while also functioning as a collaboration tool. Best comparable to github but for operations, and is both used by contributors to directly collaborate on work using streamlined and standardized transparent processes. Also used by Maker Governance and MKR holders to oversee and understand the progress, results and risks of the tasks being undertaken by the Decentralized Workforce, and the information that they are sharing. Also synergizes well with the Decentralized Frontend as it can be bundled as a standard feature alongside other governance related components. The Council or Tribunal of each Scope is responsible for designing the UCT module for their respective Scope.  The UCT module is how the Scope Framework is practically turned into processes that the Core Units and Tribunals can then follow.     Primary Scopes  Decentralized Collateral  Top down parameter adjustment  Process used to change risk parameters such as stability fees and debt ceiling of decentralized collateral vault types. Done at regular intervals, and in special cases done reactively. The research, data collection, processing and recommendations provided are done according to the Decentralized Collateral Scope Framework. Covers standard vaults directly used by end users Covers Vault Adoption and/or D3M connections to Creator MetaDAOs.   Top down collateral onboarding  Cases where Core Unit Facilitators follow the Scope Framework to prioritize new collateral types based on research and data collection, and then use budget to fund the onboarding work of new collateral types.   Bottom up collateral onboarding  Based on a Revenue Share Bounty Plan that is specified in the Decentralized Collateral Scope Framework. Incentivizes MetaDAOs and Ecosystem Actors to take the initiative on developing and deploying new collateral onboarding code, and then bring it to Maker Governance for approval. If approved, the proposer will then earn a revenue share from the net stability fees generated from the collateral type according to the Revenue Share Bounty Plan. Review process and how to determine whether to reject or approve a bottom up collateral onboarding is specificed in the Decentralized Collateral Scope Framework.   RWA Collateral  Top down parameter adjustment  Covers the process of managing risk related to Real World Asset collateral exposure. The RWA Collateral Scope Framework specifies the process used to analyze and modify Vault Adoption or D3M parameters to Protectors, and parameter adjustments of PSMs.  Takes into account several sub frameworks that covers financial risk, physical threat risk and sustainability.     Top down collateral onboarding  The top down collateral onboarding process for RWAs covers specifically the onboarding of new PSMs. This works identically to the top down collateral onboarding process for decentralized collateral, and taps into the same supply chain.   Protocol Engineering  Top down product development and upgrades  Prioritizes and funds the research, development and deployment of the Endgame Plan Product Roadmap. Prioritizes and funds ongoing major feature upgrades  Security upgrades Gas efficiency refactoring Governance submodules such as IAMs.   Protocol feature scope is responsible for preventing scope creep and complexity growth beyond the boundaries of the Endgame Plan. Can expand scope only in rare cases where item fits with Endgame Plan.   Top down protocol expansion  Main long-term focus of the Protocol Features scope is the deployment of new major building blocks across mainnet and L2s. Includes Sharded Vault Engines/Singularity Engines, new Maker Teleport building blocks, and new Synthetic Assets. Responsible for expanding certain backend features such Multichain Elixir and Meta Elixir (explained later).   Bottom up protocol expansion  Based on a Revenue Share Bounty Plan that is specified in the Protocol Features Scope Framework. Incentivizes MetaDAOs and Ecosystem Actors to take the initiative on developing and deploying new  Sharded Vault Engine, Maker Teleport, Synthetic Assets code   If approved, proposer earns revenue share from the net stability fees generated from the collateral type. The review process and how to determine whether to reject or approve a bottom up protocol expansion is also specified in the Protocol Features Scope Framework.   Protocol Security  Responsible for funding continuous audits and security research into the deployed Maker Protocol. Responsible for funding and operating smart contract bug bounty programs.   Growth  Focuses on developing the Maker and Dai brand, and allocate budget to fund various growth and marketing initiatives. Responsible for maintaining the official MakerDAO website design, and design and branding guidelines for MetaDAO frontends.   Supporting Scopes  Finance  The Finance scope builds the financial reporting processes and systems for the UCT, and provide regular comprehensive updates and overviews of the overall state of the protocols financial situation.   Stability and Liquidity  Cashlike RWA portfolio management  Responsible for updating and implementing a framework for the Cashlike RWA portfolio of assets.  Ensure that it balances optimal yield generation with enough liquidity to keep Dai fully useable as a currency.     Target Rate management  After Dai becomes free floating the Stability and Liquidity scope must monitor and research upgrades to the Target Rate algorithm.  In the long run when no external value reference can be relied upon, the scope expands significantly and also engages in aggregating CPI data in order to measure and target inflation rates of Dai.     Protocol Owned Vault management  Responsible for providing advice related to the management of the Protocol Owned Vault.  Using it for optimal benefit for maintaining Dai stability and market confidence. Risk management related research is done by relying on the supply chain of Decentralized Collateral.     Legal Research  Focuses on the broad legal and regulatory impacts on Maker Core and the Decentralized Workforce in the broader ecosystem.   Legal risk monitoring  Defines best practice around avoiding legal risk in the Legal Research Scope Framework.  Continuously monitors the activity of the Decentralized Workforce, the MetaDAOs and the Ecosystem Actors to detect risk. In case activity is detected that could result in e.g. a regulatory backlash or legal liability, it may propose reactive measures to Maker Governance.     External physical threat monitoring  Continuously researches and monitors the possibility of a severe external physical threat that could create considerable risk for Maker’s RWA collateral.  Regulatory crackdown Legislative changes.   In the worst case scenario, the Legal Research Tribunal must advice Maker to activate Phoenix Stance as a reactive measure.   Infrastucture  Details the overall security requirements of the most critical infrastructure of the Maker Protocol.  Keepers Oracles Other Node Network related infrastructure.   Responsible for choosing and funding MetaDAOs that provide Oracle Guarantee services. Responsible for funding bug bounty and similar security focused programs.   Interface  Focuses on the regulation and development of the core elements of the Decentralized Frontend. Includes ensuring that a fully functional and secure decentralized frontend codebase is available that covers:  DSR Vaults MetaDAO farms Governance Auctions Chat Forum Unified Coordination Toolkit     Ecosystem  Governance process  Operates the governance processes of Maker Core, including MIPs and MIP-derived processes   Governance communications  Operates the governance and community communication platforms, and provides easy to access information about the governance process.   MetaDAO monitoring  Monitors the general business practices of the MetaDAOs and proposes reactive measures of a breach of best practices or other malpractice is discovered. Maintains a framework for MetaDAO penalties as a part of the Ecosystem Scope Framework.   MetaDAO agreement enforcement  Interprets and proposes actions to Maker Governance that follow governance agreements or settle disputes between MetaDAOs or Ecosystem Actors.  EG: responsible for paying out the Maker Vault Stability Fee Frontend Revenue Share to MetaDAOs that have complied with best practice in their Decentralized Frontends, including determining who is eligible.   Responsible for enforcing the revenue share agreements of Plut and Play Protocol features adopted by MetaDAOs.   Governance  Final arbitration  Responsible for providing final arbitration on metagovernance disputes. Includes…  … decisions by the Ecosystem Tribunal that have been escalated. … disputes or risks related to Delegate compensation or Decentralized Voter Committee Compensation.   Tries to cover as many edge cases in advance as possible, however in practice disputes that are escalated to the Governance Tribunal are likely to not have any precedents.   Governance frontend regulation  Determines the requirements for Decentralized Voter Committee inclusion and ranking in the Governance frontends.   Recognized Delegate and Recognized Budget Allocator program  Operates the process with which Delegates and Budget Allocators can achieved Recognized status and become eligible for compensation.    Endgame Plan Products  Pregame  Endgame Plan Approval MIP  First step towards implementating the Endgame Plan. Determines commitment to the Endgame Plan  If passed, a version of the Endgame Plan and MetaDAOs will be launched.     Recognized Launch MetaDAO Clusters  Designates Launch Clusters that are attached to existing core units Gives them various privileges.  Privileges are controlled by the Facilitator of the Core Unit that the clusters are attached to. Must be controlled according to the views of the cluster as interpreted by the Facilitator.     Creator and Protector cluster collateral onboarding authority  Creator Clusters take over the responsibility of decentralized collateral onboarding. Protector clusters take over the responsibility of RWA collateral onboarding responsibilities Each receives a preliminary Vault Adoption Debt Ceiling of 250 million Dai.  Vaults are still considered Maker Core Vaults. All stability fees will continue to go to Maker Core. After the Endgame Plan Launch the vaults will then have to be formally adopted.     Collateral onboarding process replacement and collateral application rejection  Replaces the existing collateral onboarding process. Rejects all active collateral applications. Collateral onboarding must go through the collateral onboarding privileges of the Recognized MetaDAO Clusters. Top down process only. No formal application process available at the Maker level. A bottom up collateral onboarding process will only exist if the clusters choose to define and manage one.   Continued Maker Core collateral onboarding of ETH, Stablecoins and D3Ms  Risk Core Unit will also have the authority to prioritize and onboard major, scalable collateral types including:  ETH, or ETH related assets such as Staked ETH or ETH/DAI LP tokens Stablecoin PSMs Stablecoin related collateral such as USDC/DAI LP tokens D3Ms     Preliminary Protocol Owned Vault activation  Immediately activates the Protocol Owned Vault through a Protocol Owned Vault Emulation.  Authorizes the immediate start to a manually executed Staked ETH accumulation strategy.   Executed by allowing the Surplus Buffer to go negative, and the ability of the Pause Proxy to hold governance controlled assets. 40 million Dai from the Surplus Buffer will be used, and will immediately begin acquiring Staked ETH at 2x leverage with a paced dollar cost averaging process. 80 million Dai will be spent from the Surplus Buffer to acquire Staked ETH into the Pause Proxy Lower limit of surplus buffer will be set to -40 million. Additional surplus will be manually used to acquire more Staked ETH. Allows us to spread accumulation over time.  Prevents too much slippage and frontrunning. Begin the dollar cost average accumulation as soon as possible following the Merge.     EtherDai I  Central user facing product of Endgame Plan.  All other mechanisms and incentives aim to drive users towards EtherDai Vaults.   ETHD I is the Pregame implementation of EtherDai.  Uses a “shortcut” approach Goal is to have a staked ETH token under the control of Maker governance that can be upgraded in the future.   Simple ERC20 token wrapper around Lido’s Staked ETH. Free wrapping + unwrapping. Maker Governance has backdoor access to the ETHD collateral Governance can set permissions for minting and burning of ETHD. ETHD will be a very valuable and useful product that can easily generate network effects.  Piggybacks on Lidos best in class security, liquidity and efficiency.   EtherDai must also be onboarded as Maker Vaults.  Possibly with different options for risk parameters Or just with the same risk parameters as Steth.   Liquidity of EtherDai will need to be boosted with captive liquidity.  Initially done using short term yield farming of ETHD/DAI on uniswap (Explained later). Will be replaced by long term liquidity provided through Elixir accumulation (Explained later).   Only pregame products that can be launched before everything else. Development and release is the first priority of the entire Endgame Plan.   Elixir I  Universal long term liquidity solution for Dai, ETHD and MKR in the Endgame Plan. Eventually, it is used to automatically provide sustainable, captive liquidity on all key decentralized marketplaces across mainnet and all L2s. Elixir I is a simple Balancer pool that consists of 1/3rd Dai, 1/3rd ETHD and 1/3rd MKR. During the Early Game Elixir I is accumulated by MetaDAOs by selling their MetaDAO tokens using the Anti-Reflexivity Mechanic (Explained later).   MetaDAO tokens  Simple ERC20 tokens that are controlled by the Maker Pause Proxy. Initial supply is 4.6 billion. The tokens are emitted alongside the deployment of the ERC20 token smart contracts, and sent to a Maker Governance account. From there to:  MetaDAO farms MetaDAO Workforce Bonus Pools MetaDAO Treasury Funding Accounts   Initial launch MetaDAO tokens are manually created. Later, new MetaDAOs are created automatically by the Incubator (Explained in Midgame Products).   MetaDAO farms  2 billion MetaDAO tokens are sent to the MetaDAO farms over a period of 10 years. Farmed by…  Dai holders ETHD Vault users MKR governance participants   Schedule:  1 billion the first 2 years 500 million the following 2 years 250 million the following 2 years Remaining 250 million the last 4 years.     MetaDAO Workforce Bonus Pools  400 million MetaDAO tokens are sent to the MetaDAO Workforce Bonus Pools  Controlled by MetaDAO token governance to provide attractive bonus incentives for the bootstrapping clusters.   Long term MetaDAOs receive only 300 million MetaDAO tokens into the MetaDAO Workforce Bonus Pool   MetaDAO Treasury Funding Account  200 million MetaDAO tokens are sent to the MetaDAO Treasury Funding Account. Automatically sold for Dai (by first selling to MKR via Meta Elixir, and then to Dai via Elixir) over a period of 2 years.   MetaDAO farms  3 types of farms for each of the Launch MetaDAOs must be deployed during the pregame phase, before the Endgame Plan Launch.   Dai farms  Simple ERC20 farms that distribute MetaDAO tokens. 100 million MetaDAO tokens of each MetaDAO is distributed through the Dai farms in first year.   ETHD Vault Debt farms  More advanced than regular farms. Require the user to first open a specific type of ETHD Vault with the Maker Protocol and then deposit the Vault into the farm. Then farm the MetaDAO tokens based on the amount of Dai debt in their vault. 200 million MetaDAO tokens of each MetaDAO is distributed through the ETHD Vault Debt farms in first year.   Delegated MKR farms  Require the user to transfer MKR that is actively delegated into the farm. MKR that is not actively delegating to a delegate (of any type, which can include their own delegate contract), cannot be used to farm with.   MetaDAO frontend   Frontend that exposes the MetaDAO farms. Can be developed further by the MetaDAOs to expose more features such as:  Dai Savings Rate Dai MetaDAO farming Maker Vaults Maker Governance interface    Only the MetaDAO farms need to be available for endgame launch.   Likely that some of the additional features will be developed and ready to launch alongside the Endgame Plan Launch.    Meta Elixir I  Core liquidity pool for MetaDAO tokens against MKR. Goal is to be able to use Meta Elixir as the main source of cross-market and cross-chain MetaDAO token liquidity. Establishes MKR as the main trading currency for MetaDAO tokens across all markets. Meta Elixir I is implemented through a simple Uniswap pool token of MetaDAO tokens paired against MKR. Permanent emissions of MKR is used to accumulate Meta Elixir. During the Endgame Plan Launch, Maker will emit 7500 MKR per year per MetaDAO to accumulate Meta Elixir.   Metanomics I  Core tokenomics system of the Endgame Plan. Emit 50000 MKR per year and distribute towards  Meta Elixir Acquisition MetaDAO Incubation Maker Workforce Bonus Pool.     Meta Elixir Acquisition  45000 of annual emissions are used to accumulate Meta Elixir of each MetaDAO. Following launch of a non-launch MetaDAO, Meta Elixir accumulation is adjusted based on the amount of Elixir each MetaDAO has accumulated in their burn engines. (Further explained in Metanomics II)   MetaDAO Incubation and Maker Workforce Bonus Pool split  Remaining 5000 MKR is split between:  The Incubator, where it is converted to Elixir. The Maker Workforce Bonus Pool where it is used to pay for long term bonuses for  Delegates Council Members Facilitators Tribunal Members.     Maker Governance determines the ratio of the split  Amount of MKR to the Workforce Bonus Pool cannot exceed 2000 MKR per year.     Anti Reflexivity Mechanic  System used by Maker at the Endgame Plan Launch, and by all new MetaDAOs launch and post-launch. Limit order staircase that sells a fixed amount of MKR or MetaDAO tokens for Dai at fixed prices. Earned Dai is then converted to Elixir and accumulated in the Burn Engines of Maker or the MetaDAOs. Prevents overly volatile price action caused by the Metanomics when new MetaDAOs are launched and circulating supply is very low.   MKR Anti Reflexivity Mechanic at Endgame Plan Launch  At the Endgame Plan Launch, all MKR that remains in the MKR reserve that is not sent to the Workforce Bonus Pool is used to set up an Anti Reflexivity Mechanic with limit orders on an external DEX.  The lowest step is set at the MKR price near the market price at the Endgame Plan Launch. Upper steps are determined by Maker Governance in advance.     Anti Reflexivity Mechanic at MetaDAO Genesis  When a new MetaDAO is launched, 4.5 billion MetaDAO tokens are immediately emitted.  2 billion of those tokens are used to fund an Anti Reflexivity Mechanic with limit orders on an external DEX. The limit order staircase has 100 limit orders of 20 million MDAO each with the lowest limit order starting at 0.01 DAI per MDAO. Each additional limit order placed at 0.001 higher increments, until the final limit order at 0.109 DAI per MDAO.     Simple offchain voting  One of the only technical requirements necessary for MetaDAO governance to function.  MetaDAO token holders need to vote in non binding polls that Maker Governance can then interpret and execute. The simplest form of this system, which would be enough to meet the requirement for Endgame Plan Launch would be to directly use snapshot polls with no additional configuration or development needed.   Possible that an adaptation of the Maker rollup based voting system could be available in time.  Would provide a more secure gasless voting solution that also supports delegation (an Early Game Feature)     Endgame Plan Launch MIP Set  When all other pieces are ready, the Endgame Plan Launch is the Endgame Plan Launch MIP Set implements the Endgame Launch. Play fundamental governance roles similar to MIP0 and MIP1 by defining fundamental rules of governance that will be binding on all future MIPs. Many specific decisions and specifications that help maximally define the Endgame Plan Launch  Promote ossification Minimize confusion and uncertainty Minimize ability to switch directions or make fundamental changes to governance.   Implemented entirely through MIPs, meaning it is purely governance proposal text and has no technical component to it, and requires no technical resources.   Purpose and Values  Will contain MIPs that establish a social contract in the community enshrining values such as Clean Money. The MIPs will also spell out the intangible value that the community expects to gain from following the purpose and values.   Immutable Metanomics  Will contain a MIP that defines the permanent and completely immutable tokenomics schedules for the Metanomics that applies to both MKR and MetaDAO tokens. Token emission and distribution schedules should be impossible to change after the fact.  In order to provide certainty and prevent power struggles related to control of token emissions.     Constitution  Will define which aspects of governance processes are immutable and should change minimally. Will define fundamental expectations of different governance participants, including voters and the decentralized workforce. Will define neutrality requirements for different Decentralized Workforce participants  Also explain the reasoning and the risks involved if neutrality isn’t upheld     Endgame Plan Product Roadmap specification MIPs  Will contain a MIP for each Endgame Plan product  Provides as much clarity as possible around their implementation and requirements.   Creator Quest payouts will directly rely on these product specification MIPs.   Early Game  Incubator  System that permanently, automatically without human intervention creates new MetaDAOs at a variable frequency. Automatically deploys the ERC20 token and all other core components and sets up all relevant smart contracts and permissions through smart contract factories. Also accumulates Elixir over time from Metanomics, and automatically transfers all accumulated Elixir to the next MetaDAO to seed it with value. Follows simple algorithms to determine the class of the next MetaDAO, and the incubation period for new MetaDAOs.   MetaDAO Class Algorithm  If there are less than 2 Governors, incubate a Governor If there are more than 10 MetaDAOs and less than 3 Governors, incubate a Governor If less than 10% of all MetaDAOs are Governors, incubate a Governor If less than 25% of all MetaDAOs are Protectors, incubate a Protector Else incubate a Creator   MetaDAO Incubation Period Algorithm  If there are less than 20 MetaDAOs, the incubation period is 1 year If there are equal to or more than 20 MetaDAOs, the incubation period is 1 year per 10 MetaDAOs (rounded down) If there are more than 100 MetaDAOs the incubation period is 10 years   MKR Vaults  MKR Vaults are a simple and very useful feature that provides much greater utility to MKR  Also boosts the percentage of Dai that is backed by decentralized collateral.   MKR Vaults can only be used with MKR that is actively farming MetaDAOs, and consequently is actively delegating.   Maker Teleport  A Useful feature that allows users to instantly transfer Dai from the Ethereum Mainnet to L2’s, or from one L2 to another L2, without a delay or commitment period.   Maker Sharded Vault Engines  Will initially be deployed on Optimism, Arbitrum and Starknet, and will help lower the barrier to entry for vault users and make Dai a much more L2 native asset. Will also enable the Homebase system for Creators, allowing Maker to more effectively connect with the emerging economies and communities on L2s.   Multichain MetaDAO farms  Important tool for boosting Dai and Maker Vault adoption across L2’s. Should be deployed alongside the Sharded Vault Engines in order to immediately drive users to them.   Multichain Dai Savings Rate  The Multichain Dai Savings Rate also helps drive L2 adoption of Dai.   Metanomics II  Changes the Metanomics so that the Meta Elixir Accumulation is now done based on the proportional weight of Elixir controlled by each MetaDAO.   Mid Game  Long Term MetaDAO Tokenomics  MetaDAO token emissions schedule that will apply to all existing MetaDAOs and all future MetaDAOs from their genesis. MetaDAO Tokenomics are denominated in percentages of total circulating supply.  Total circulating supply is the total supply minus genesis MetaDAO tokens that have not yet been farmed and MetaDAO tokens that remain in the Anti Reflexivity Mechanic.   The Long Term MetaDAO Tokenomics emissions schedule  5% of tokens to MetaDAO NFT staking 3% of tokens to MetaDAO Farms 1% of tokens to MetaDAO Workforce Bonus Pool 1% of tokens to MetaDAO Drizzle (Unless Drizzle already contains more than 10% of total supply)     MetaDAO NFT Staking  Staking system that enables MetaDAO token holders to stake their MetaDAO tokens by turning them into a locked NFT. While in NFT Staking, the amount of MetaDAO tokens that the NFT can be exchanged to increases over time due to the MetaDAO Tokenomics Emissions of 5% per year   Ember Burn Engine  A burn engine that accumulates Elixir as “dry powder” Uses a valuation algorithm to deploy the Elixir to burn MKR or MDAO tokens when the market price is low. Valuation Algorithm for MKR is 2x internal capital. The burn engine burns a percentage of its elixir based on the deviation below 2x internal capital, meaning that at 1x internal capital the burn engine will burn 100% of its Elixir per year. Valuation Algorithm for MetaDAOs  Deliberately restricted in order to make them vehicles for long term Elixir accumulation and allow them to benefit as much as possible from the Metanomics. The valuation algorithm is 1x accumulated Elixir. If the market cap of the MetaDAO tokens fall below the total amount of Elixir accumulated in the Ember Burn Engine, the burn engine begins to burn at fixed rate of 0.5% of its Elixir per month.     Drizzle Engine  A reverse Ember Burn Engine that accumulates MKR and MetaDAO tokens, and sells them for Elixir that it sends to the Ember Burn Engine when the MKR or MDAO price is above its valuation model.   Singularity Engine  An integrated Vault, Synthetic Asset, DEX and Farming Engine, optimized for gas efficiency.   Root Engine  A Singularity Engine that also contains  The Maker Governance Functionality The ability for MKR holders to create Governance Lockup Vaults  Gives benefits in exchange for locking their MKR behind a short unlock period and an exit fee.       End Game  Maker Rollup  Based on the Oracle Network   Maker Staking Network  Based on the Oracle Network   Singularity Engine II  Enables MetaDAOs to control their own vault engines that are fully integrated into the Maker Singularity Engines  Allows maximum integration gains and efficiency gains from everything being integrated with a single native DEX. Also supports NFT farming which allows MetaDAO farms to directly farm MetaDAO tokens that are NFT Staking into a single NFT.     Root Engine II  Governance version of Singularity Engine II  ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-and-risk-206-thursday-september-01-at-17-00-utc/17573/2",
                        "https://forum.makerdao.com/t/endgame-index-list/16021"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.521140398903697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "01/12/2022-21:14:34",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}