{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/tooling-lbs-blockchain-envoy-proposal-alerter/18500",
            "title": "[Tooling] LBS Blockchain - Envoy Proposal Alerter ",
            "index": 18500,
            "category": [
                "Governance"
            ],
            "tags": [
                "delegation",
                "tool",
                "governance",
                "delegates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/park",
                    "index": "#1",
                    "likes": "8",
                    "time": "25/10/2022-09:40:08",
                    "content": " The problem As delegates sitting across multiple protocols it can be difficult to keep track of all the new proposals and executive votes coming onto the platform.  Solution We have developed an internal tool called Envoy that we use to keep track of new and expiring proposals. It is a simple Node.js application that regularly scrapes the governance page and forwards alerts to a frontend Telegram bot. We are sharing this tool with the Maker community in case other delegate teams run into the same problem. You can now join the Telegram channel here to start receiving alerts: Telegram: Join Group Chat We have also developed a similar tool for Aave which you can find here: [Tooling] LBS Blockchain - Envoy Proposal Alerter - Governance - Aave  Feedback Any feedback or suggestions on the tool would be greatly welcome. ",
                    "links": [
                        "https://governance.aave.com/t/tooling-lbs-blockchain-envoy-proposal-alerter/10369",
                        "https://forum.makerdao.com/t/governance-and-risk-213-thursday-october-27-at-17-00-utc/18494/3",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/29"
                    ],
                    "GPT-summary": "The author of the post is explaining a tool called Envoy that they have developed to keep track of new and expiring proposals across multiple protocols. They are sharing this tool with the Maker community and have also developed a similar tool for Aave. The author is asking for feedback and suggestions on the tool.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 4.715909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Freakytainment",
                    "index": "#2",
                    "likes": "0",
                    "time": "25/10/2022-10:47:09",
                    "content": "Is this the same type of tool created by Lyft, and is it an L4 or L7 tool ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/park",
                    "index": "#3",
                    "likes": "0",
                    "time": "25/10/2022-12:03:29",
                    "content": "Hmm I’m not too familar with the tool by Lyft so can’t compare. I believe it would be classified as an L4 tool:  A cron job is scheduled to regularly call an API endpoint which runs the scraper function Any new proposals are sent to the Telegram channel as an alert and added to a PostgreSQL DB Expiring proposals are fetched from the DB and alerts sent to TG  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#4",
                    "likes": "0",
                    "time": "25/10/2022-14:31:12",
                    "content": "Joined the group to see how it works. Hope it works ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adamgoth",
                    "index": "#5",
                    "likes": "0",
                    "time": "31/10/2022-07:24:11",
                    "content": "Hey @park. I’m on the team that maintains the voting portal. Are you scraping the polling and executive pages from the portal? If so, we have some public API endpoints for polls and execs which may make things easier: Maker Governance - Account ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/park",
                    "index": "#6",
                    "likes": "0",
                    "time": "31/10/2022-08:48:53",
                    "content": "Hey yes, this looks useful I’ll check it out! The Maker website was much easier to scrape than others as it helpfully provides everything in one JSON Btw Is it possible to implement a push architecture (something like a web socket) to get pinged when new notifs come out rather than us pulling regularly? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.711363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adamgoth",
                    "index": "#7",
                    "likes": "0",
                    "time": "01/11/2022-13:10:30",
                    "content": "All new polls and execs are created on-chain. Our team doesn’t actually create them. We just monitor the chain for those particular events and add them to our database when we see them. This is the repo for the app that does that if you want to take a look: GitHub - makerdao/gov-polling-db So to answer your question, we don’t have anything currently that is set up to ping for new events. But since it is just events on-chain, there are likely a handful of different ways it could be accomplished with other apps or tools. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.285774410774411
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "31/01/2023-19:10:34",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}