{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-why-deploy-on-xdai/6582",
            "title": "[Informal Poll] Why deploy on xdai? ",
            "index": 6582,
            "category": [
                "Governance"
            ],
            "tags": [
                "informal-poll",
                "other-platforms"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#1",
                    "likes": "0",
                    "time": "14/02/2021-22:19:12",
                    "content": "Why to deploy on XDAI 1.Usable for everyday transactions; 2.It uses EVM; 3.Works for over 2 years; 4.Speed of innovation (fail early, fail fast, fail often); 5.Community acceptance; 6.It is more or less a copy paste process. Why not to deploy on XDAI? 1.XDAI can not be considered being even close to the same security or trust level as Ethereum mainnet; 2.It is more or less a testing ground; 3.Risk level is of the charts; 4.Playing with peoples money!!! 5.Playing with the Maker name!!! It is a mater of risk evaluation.    Deploy on XDAI with xDAI cap for ETH:  1’000’000 xDAI 10’000’000 xDAI 100’000’000 xDAI     0 voters         Don’t deploy on XDAI Deploy on a different scaling solution (name it, explain it) Deploy on multiple scaling solutions (name it, explain it)     0 voters        Deploy on xDai  Abstain (still exploring)     0 voters        Deploy with the name  Maker MakerX Different name (please propose)     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/should-we-explore-launching-on-binance-smart-chain-venus-protocol-endangers-dai/6535/40",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-130-thursday-february-25-17-00-utc/6651/2",
                        "https://forum.makerdao.com/t/discussion-eurodai/6521/25"
                    ],
                    "GPT-summary": "The post is an informal poll discussing the advantages and disadvantages of deploying on XDAI. The author explains the reasons for deploying on XDAI and also highlights the risks involved. The post also includes a poll asking for feedback on whether to deploy on XDAI or not, and if so, with what name and cap. Some voters are abstaining as they are still exploring.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.3491834852430555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#2",
                    "likes": "3",
                    "time": "15/02/2021-08:07:17",
                    "content": "Shouldn’t there be an option for “don’t deploy on xDai”? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#3",
                    "likes": "2",
                    "time": "15/02/2021-08:17:39",
                    "content": "Yes. There should be. But- I think it is smart to push it to stay relevant. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.535714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#4",
                    "likes": "1",
                    "time": "15/02/2021-10:22:28",
                    "content": "I voted for YES, but I agree an option for “don’t deploy” is required. @Kukkio please add it. It would be awesome if people voting for NO could explain their hesitations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#5",
                    "likes": "0",
                    "time": "15/02/2021-11:29:34",
                    "content": "I Added the NO option. I voted for the multiple scaling solutions. Ethereum will remain the safe place for the foreseeable future. All the other chains are playgrounds, nothing more (until proven otherwise). Why xDAI first? Because it is the easiest. Time is critical. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.803571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#6",
                    "likes": "6",
                    "time": "15/02/2021-12:17:14",
                    "content": "A few points: Deploy ‘what’ on xDAI - governance or Maker Vaults, liquidations, etc.? I think the ‘Why not’ points are mostly made up.     Kukkio:  1.XDAI can not be considered being even close to the same security or trust level as Ethereum mainnet;   DPOS is the only difference that i can tell.  Less nodes maybe less security but would rather experts speak to this.     Kukkio:  2.It is more or less a testing ground;   This is decidedly NOT true.   xDAI is in use now and NOT a testing ground.  It is also rapidly becoming a L2 hub location with bridges not just to Main net, but soon Matic (March latest), and shortly there after Binance Chain.     Kukkio:  3.Risk level is of the charts;   No clue what this means.   Chainlink is also soon going to be release on xDAI so we will have chainlink pricing oracles (namely for agaave).     Kukkio:  4.Playing with peoples money!!! 5.Playing with the Maker name!!!   These are just made up points.   If you think playing with people’s money on xDAI then you could make the same points of Ethereum… It isn’t just a risk issue but a usability one.    Dust approaching levels that basically make existing small vault liquidations cost too much.  High Main net fees are pretty much pricing the people Maker wanted to serve (the underserved) out of the market. Here is a valid point.    Technically how would Maker Mint DAI for xDAI chain because you can’t just mint DAI on xDAI.  You have to basically mint DAI on mainnet and bridge it in.   But I expect this is easily surmountable by taking part of the surplus and bridging it into xDAI for use by a Maker fork. I think if there was a real point its that a better L2 probably will show up (optimistic) and it might be prudent to wait for that.   I know a lot of development is lining up for optimistic but I also know a lot of L2s are going now (Matic, Binance, xDAI) and xDAI is focused on bridging as well as becoming a L2 hub. Maker can sit and wait and hope main net fees come down or they can decide now to put up an instance somewhere.   Since xDAI is EVM compatible porting should be easiest on xDAI than any other L2.    Development is the primary hitch here and Agave will be released soon on xDAI (everything is ready to go we just need the reliable oracle hooks). Either way DeFI will make it to L2, the real question is whether or when Maker will move there. You also ignore another important point.   Since the token that powers transaction on xDAI is DAI basically fees will always be denominated with tokens that have a fixed value.  100gwei on xDAI is vastly different in cost than 100gwei on ETH. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.613213213213212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#7",
                    "likes": "0",
                    "time": "15/02/2021-12:38:37",
                    "content": "Hey, @Kukkio. Thanks for the informal poll! I’d also ask for an ‘abstain’ voting option for people to show interest in the issue without leaning one way or the other. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#8",
                    "likes": "7",
                    "time": "15/02/2021-12:55:23",
                    "content": "My question is why is the current system where Dai is minted on ETH but bridged over to multiple mainnets and L2 not enough? xDai has TVL of $16.3 million and considering there’s not much compostability (Money Lego) on xDai yet, it seems too early to consider minting directly on xDai. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#9",
                    "likes": "2",
                    "time": "15/02/2021-13:00:40",
                    "content": "I guess for big players, mainnet suffices but there are significant limitations:  You need at least a few 1000s worth of assets, or currently it does not make sense to open a Vault with the tx-fee costing >100usd We currently have a lower-limit of 2000dai minimum.  Vaults in xDAI could be created by small-fishes, who might benefit from having a 100usd worth Vault. And I believe there are plenty of these fishes. Will it have a serious impact in the finances of MakerDAO in the short term? No. Can this be useful to some people, regardless of the money they produce to us? Probably yes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.184027777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#10",
                    "likes": "0",
                    "time": "15/02/2021-13:04:27",
                    "content": "But I guess my point is once let’s say you mint Dai on xDai, is there a lot you can do? Like for example, if it’s on ETH mainnet, you can swap it on Uniswap, lend it out on Compound and AAVE and etc. I don’t think there’s an exchange where you can deposit Dai on xDai either. Happy to hear some Dai use cases on xDai though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#11",
                    "likes": "3",
                    "time": "15/02/2021-13:24:44",
                    "content": "There is quite a bit of stuff already on xDAI, Projects & DApps - xDai STAKE, starting from https://honeyswap.org/ . More is coming soon (Chainlink oracles, Gnosis etc) But even if there was none, it would allows people to:  bridge their tokens assets on xDAI (if they haven’t already) Open a CDP in xDAI (basically no fees and no 2000usd minimum) Bridge back their DAI on Ethereum (if they really want).  (1) + (3), the 2 bridge operations, would cost less than opening a CDP on mainnet. But, again, I personally think that most people will not bring back their tokens if we are talking about small vaults (<1000usd) and just exchange within the xDAI universe (starting from https://honeyswap.org/) ",
                    "links": [
                        "https://honeyswap.org/",
                        "https://honeyswap.org/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.356060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#12",
                    "likes": "3",
                    "time": "15/02/2021-13:29:28",
                    "content": "I didn’t realize some of these are working on xDai. It’s pretty interesting. Thank you for sharing ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#13",
                    "likes": "0",
                    "time": "15/02/2021-14:09:46",
                    "content": "I would like to try xDai (I haven’t) before voting for it. But what worries me is liquidity and projects. Do we have an AMM dapp there?, would we be the only Lending protocol in the network? What other amazing projects are being built for the network? Note that I don’t know much about xDai and questions could have no meaning! But in general, if we deploy in a network simply for users going there and having to come back to Ethereum to do stuff, we’re not solving the issue. IMHO, what is important is to deploy into a network which have DEFI dapps, where you could earn interest on your crypto, with a Uniswap-equivalent, Maker-equivalent, Aave-equivalent, Yearn-equivalent, new projects pumping up constantly. Otherwise we’ll be just spending resources in all this deployment with very low possibility of usage. I’m going to research more, but if these points are not covered, sadly I’ll vote no (and these above would be the reasons). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.4683441558441555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#14",
                    "likes": "0",
                    "time": "15/02/2021-14:18:33",
                    "content": "Great stuff, this is a better ground to support the deployment there. Do you know if the TVL mentioned in DEFI pulse is only related to assets on Ethereum side?, or it can be assumed it is the TVL used within the xDai network? image1114×318 19 KB ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#15",
                    "likes": "1",
                    "time": "15/02/2021-14:22:14",
                    "content": "    smaugho:  I’m going to research more, but if these points are not covered, sadly I’ll vote no (and these above would be the reasons).   Please start from here: Projects & DApps - xDai STAKE I believe you’ll find a positive answer to all your questions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.284090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#16",
                    "likes": "1",
                    "time": "15/02/2021-14:25:00",
                    "content": " it is more like 25M USD. https://blockscout.com/poa/xdai ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#17",
                    "likes": "0",
                    "time": "15/02/2021-14:33:11",
                    "content": "    smaugho:  Do you know if the TVL mentioned in DEFI pulse is only related to assets on Ethereum side?, or it can be assumed it is the TVL used within the xDai network?   Follow the link of @Kukkio : xDai (xDAI) Explorer and look at the top-left. You’ll see something like this on the “i” below “Market Cap”: Screenshot 2021-02-15 at 15.32.24854×454 77.2 KB   All xDAI in circulations are created from locking real DAIs on mainnet: currently about 3.25m   You can bridge ERC20 tokens from mainnet to xdai. Currently about 22.6 (worth in usd) of tokens have been bridged.   These are onchain data, always up–to date. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#18",
                    "likes": "2",
                    "time": "15/02/2021-14:45:19",
                    "content": "I have used Perp protocol on xDAI and it has been a great user experience. I highly recommend trying out xDAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#19",
                    "likes": "3",
                    "time": "15/02/2021-15:23:56",
                    "content": "Don’t get me wrong here. I am a liquidity provider on Honeyswap for quite some time alraedy. I know it works. But a database on AWS and BNB works as well until it isn’t. ETH gas fees are not a problem. It is a feature. ETH gas slows the velocity of money on mainnet just enough, that people are not exiting from their ERC20tokenxxx/WETH pools when the market dumps. It just is not worth it, unless you are a whale. But even a whale might be OK with the profit from a pool. The ETH Gas fee also keeps the not qualified investors away.    Should we explore launching on Binance Smart Chain? Venus protocol endangers DAI!   P.S. I also think the High Ethereum TX Fees are protecting the small & new investors from getting hurt. And that’s a good thing. I heard an attorney say it’s like protecting unaccredited investors.   Maker has an instance on ETH Mainnet. It is the most secure, and should have the biggest vaults. But a high velocity of money environment is also needed. And the Maker vaults were a solution for me, when the fees were low (it is still a solution, because i did ride the wave).  But i cannot recommend it to most of my friends, who are just starting in crypto. ",
                    "links": [
                        "https://forum.makerdao.com/t/should-we-explore-launching-on-binance-smart-chain-venus-protocol-endangers-dai/6535/32"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.808073593073592
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#20",
                    "likes": "2",
                    "time": "15/02/2021-20:47:34",
                    "content": "Dude I just tried HoneySwap --wanted to Swap xDAI for MANA, but it has 39% slippage? What gives? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#21",
                    "likes": "1",
                    "time": "15/02/2021-21:13:42",
                    "content": "All big things start small. In this pool is not much liquidity yet. This is your opportunity. Take some MANA and WETH from Ethereum mainnet. Add to this pool on Honeyswap…You will hold a big proportion of that pool and earn a big chunk of the fees. Still, the risk is yours. Instructions for the bridge are on the xDai homepage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.65
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#22",
                    "likes": "0",
                    "time": "15/02/2021-21:16:12",
                    "content": "    Kukkio:  All big things start small. In this pool is not much liquidity yet.   Yes exactly it works just as Uniswap. LP need to find xDAI advantageous enough to move their funds there. It’s a bootstrapping problem. Clearly not an easy one, but I think there is some organic growth. Screenshot 2021-02-15 at 22.16.052228×1134 199 KB ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.736111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#23",
                    "likes": "0",
                    "time": "15/02/2021-23:13:50",
                    "content": "xDAI has been building around for quite sometime already. Some of the guys I worked with in my previous company were behind the creation of the poa network, which is at the inception of xDAI. It’s a very solid team. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.055555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#24",
                    "likes": "0",
                    "time": "15/02/2021-23:18:05",
                    "content": "Don’t forget to vote or propose a different solution. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#25",
                    "likes": "1",
                    "time": "16/02/2021-00:46:34",
                    "content": "MANA and a lot of tokens just don’t have liquidity for a largish type trade. Fortunately network fees are low enough you can do it piecemeal if you really want to do that trade over time.   I have 6 LPs there and basically manage/arb them between main net and Honeyswap.   I am not even sure MANA is listed in the default token list.   I own some of that but really have not seen a reason to move my liquidity to xDAI yet. So yes liquidity is still bootstrapping and as volume comes LP returns will increase and this will enable more liquidity and volume.  Even uniswap had to start somewhere. BTW:  If you add the xDAI native tokens (HNY for example) total value on the network is approximately 40M.   Yeah not billions but give it time.   A lot is being built pretty quickly given EVM compatibility.  There also is a pretty strong support group on 1Hive discord. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.072916666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#26",
                    "likes": "1",
                    "time": "16/02/2021-05:58:10",
                    "content": "Is there any accessible write-up on the security properties of these L2 sidechains? What happens when an asset is wrapped up and sent to xDAI or BSC and what risks does validator fraud on the sidechain pose to MKR/collateral tokens on the ETH chain? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#27",
                    "likes": "1",
                    "time": "16/02/2021-12:16:30",
                    "content": "I think one of my main concerns here is that other popular/useful protocols are building on more popular Layer 2s, such as Synthetix deploying staking of SNX on Optomism’s L2, and BadgerDAO yesterday announcing a future deployment on StarkNet (StarkWare).  And then there’s Compound announcing what I think was a DPOS blockchain + Compound Cash stablecoin. So, it seems like the composability is starting to spread out all over the place… It’s going to become a Layer 2 battle royal ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.815476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#28",
                    "likes": "0",
                    "time": "16/02/2021-22:47:13",
                    "content": "    zenithlight:  Is there any accessible write-up on the security properties of these L2 sidechains?   The Dai remain in a multisig wallet on ETH mainnet (i am researching, who holds it and how)     zenithlight:  What happens when an asset is wrapped up and sent to xDAI or BSC and what risks does validator fraud on the sidechain pose to MKR/collateral tokens on the ETH chain?   https://www.xdaichain.com/for-stakers/staking-protocol/terminology/operational-terms#ban \"Ban A ban occurs due to validator misbehavior. This may include:   not revealing a secret number more than 55 times in a staking epoch   not revealing a secret number on the last reveal round of a staking epoch   reported malicious behavior by other validators   (for example releasing 2 blocks at the same step or releasing a block out of order)  too many calls to the reportMalicious function (spam calls)  When a validator is banned, they are immediately removed from the current staking epoch and moved to the inactive pool list. They do not receive any rewards from the staking epoch. The current validators (minus the banned pool) are reinstated and rewards are distributed among the remaining validators at the end of the staking epoch. Any funds in the pool (validator and delegator stakes) are frozen for a period of 90 days. During that time, the mining address of the banned validator is prevented from participating in an active pool. At the end of 90 days, the funds are released and can be withdrawn or moved to another pool, and the ban is lifted. To reactivate a banned pool after the 90 day ban is complete, a candidate must increase their stake by any amount, as long as the total amount is equal to the minimum candidate stake requirements. Adding stake calls the stake function and reinstates the pool.\" ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.983796296296296
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#29",
                    "likes": "2",
                    "time": "16/02/2021-22:48:09",
                    "content": "    flipflopflapdelegate:  I think one of my main concerns here is that other popular/useful protocols are building on more popular Layer 2s, such as Synthetix deploying staking of SNX on Optomism’s L2, and BadgerDAO yesterday announcing a future deployment on StarkNet (StarkWare). And then there’s Compound announcing what I think was a DPOS blockchain + Compound Cash stablecoin. So, it seems like the composability is starting to spread out all over the place… It’s going to become a Layer 2 battle royal   Yeah a number of people are working.   Personally I think the first chain with bridges (i.e. the L2 hub is going to become the prime player(s)).     zenithlight:  Is there any accessible write-up on the security properties of these L2 sidechains? What happens when an asset is wrapped up and sent to xDAI or BSC and what risks does validator fraud on the sidechain pose to MKR/collateral tokens on the ETH chain?   I really would like to see a small knowledgeable team tracking these with reports as I think following developments in the L2 space is going to be demanding. I have been wanting to see a matrix list of L2s and features with grades/check marks for a while now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.660256410256411
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#30",
                    "likes": "6",
                    "time": "19/02/2021-11:38:44",
                    "content": "In retrospect, I now wish the entire Ethereum Community would have rallied together and supported xDAI. We fell asleep as the wheel and now Binance is eating our lunch. If there is a PoA that should have been supported while Gas Prices are what they are, it should have been xDAI and not Binance Smart Chain. The sad part is I was under the impression BSC was using the Tendermint client (Cosmos) and it’s actually GETH. Not sure how we missed this golden opportunity… Do you think it is too late? Can we rally Eth heads to move liquidity to xDAI? Ethereum Layer 1 can still remain the playground for Whales, arbitrage bots, and miners and retain it’s Value, IMO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.61734693877551
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#31",
                    "likes": "1",
                    "time": "19/02/2021-13:04:34",
                    "content": "BSC was bootstrapped by Binance users themselves. There was probably a critical point with the amount of people using the network, after which it simply exploded. Now is in a stampede, it has gone from millions to 10 billions in less than 1 month. We sadly cannot have the influence that Binance had over their users, because not many users in fact uses our interface to interact with MakerDAO (and now is even less probable that they do anything there - GAS and DUST to blame). This was told before and IMHO the first step we gave causing us loosing influence over retail investors (many of them probably flying toward BSC now) was a lack of solidification of our UI / UX. I don’t think that it is late though, I propose to reach out the teams in Defisaver and Instadapp, probably the bigger platforms being used to access MakerDAO vaults?, and if we manage to compromise them to help us to promote xDai through their platforms (after we deploy something there of course), then I think we have a good chance to start gaining traction again. With proper UI preparation in those platforms (and in oasis.app) we could route the users toward a deployment in xDai. We’re not guarantee to succeed, but if we don’t try, we’ll don’t have even a chance to know. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.027777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#32",
                    "likes": "6",
                    "time": "19/02/2021-14:14:33",
                    "content": "Here you go. L2 Comparison chart680×714 233 KB    Medium – 18 Feb 21    Evaluating Ethereum L2 Scaling Solutions: A Comparison Framework We provide a guide to evaluate various alternative Ethereum Layer-2 scaling solutions across a number of factors. Reading time: 7 min read       ",
                    "links": [
                        "https://medium.com/matter-labs/evaluating-ethereum-l2-scaling-solutions-a-comparison-framework-b6b2f410f955"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#33",
                    "likes": "4",
                    "time": "19/02/2021-15:11:36",
                    "content": "So zkRollups seems to be the best L2 solution right? I see xDai usefull just as a payment method, not DeFi or Money Legos as we have on Mainnet, mostly because of the liquidity inside xDai, things like this one can happens:     flipflopflapdelegate:  Dude I just tried HoneySwap --wanted to Swap xDAI for MANA, but it has 39% slippage?   But for example, in Vzla we are currently using xDai in exchange for Dai or Bolivares (FIAT) because of the low costs, so as a payment method we can for sure think in a bridge or some service for the ppl. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.904761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#34",
                    "likes": "2",
                    "time": "19/02/2021-16:23:17",
                    "content": "Yes zkrollups (loopring) are the most decentralized L2 solutions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makerel",
                    "index": "#35",
                    "likes": "1",
                    "time": "19/02/2021-20:30:03",
                    "content": "From An Incomplete Guide to Rollups   […] my own view is that in the short term, optimistic rollups are likely to win out for general-purpose EVM computation and ZK rollups are likely to win out for simple payments, exchange and other application-specific use cases, but in the medium to long term ZK rollups will win out in all use cases as ZK-SNARK technology improves.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.4125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#36",
                    "likes": "2",
                    "time": "19/02/2021-22:36:41",
                    "content": "Don’t underestimate smart contract  constructs like Maker +  xDai. Especially because it is easier to keep it up to date EVM compatible. Listen in on what Igor Barinov explains about use cases for Maker +  xDai. Community Collateral Onboarding Call: January 13, 2021 - YouTube. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#37",
                    "likes": "2",
                    "time": "20/02/2021-08:48:02",
                    "content": "I wasn’t much convinced about xDAI because it was too technical and lacked business development and customer focus. RealT is now using xDAI. One article later, I’m too, it’s super easy. The awesome part is that RealT is paying in USDC, but using xDAI you want to be paid in xDAI. This could be awesome for Maker as well.    Medium – 20 Feb 21    What is xDaichain? xDaichain is a stable payment blockchain designed for fast and inexpensive stable transactions. xDai is used for transactions, payments… Reading time: 6 min read       Where is the xDAI Core Unit? ",
                    "links": [
                        "https://medium.com/realtplatform/what-is-xdaichain-ae72fd48e511"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.979166666666668
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MKR1",
                    "index": "#38",
                    "likes": "2",
                    "time": "20/02/2021-09:17:36",
                    "content": "I’m all for integrating with xDAI. This is an EVM compatible solution that works now. I have used Perp on xDAI and it really is a great user experience (try it at http://perp.fi). Rollup solutions will take months from now to be ready and have intricacies that will make implementation time-consuming on top of that. This is a strong interim solution that can help Maker maintain its advantage over the other lending protocols. As Vitalik suggests, xDAI now, rollups later: https://twitter.com/VitalikButerin/status/1294885662332600320?s=20 ",
                    "links": [
                        "https://twitter.com/VitalikButerin/status/1294885662332600320?s=20"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.506944444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#39",
                    "likes": "0",
                    "time": "20/02/2021-13:03:04",
                    "content": "Looks like Saffron v2 will be built on Binance Smart Chain, and Alpha Finance Labs will be integrating w/Saffron v2, and it will be via both Ethereum and BSC.  Have you heard any of the main DeFi Money Legos building on xDAI? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9523809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#40",
                    "likes": "0",
                    "time": "20/02/2021-16:14:31",
                    "content": "    SebVentures:  Where is the xDAI Core Unit?   +1 to this question, we need lot of enthusiasts and more people to get involved in helping bootstrap MakerDAO for a sustainable future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#41",
                    "likes": "6",
                    "time": "22/02/2021-12:39:14",
                    "content": "    flipflopflapdelegate:  In retrospect, I now wish the entire Ethereum Community would have rallied together and supported xDAI. We fell asleep as the wheel and now Binance is eating our lunch.   I don’t think it is late. So many projects are moving to xDAI, and people (even less technical ones) can feel the difference between a (reasonably) decentralised network (xDAI) and a fully centralised database (BSC). We should talk with xDAI devs, and definitely push xDAI adoption as much as we can, even if potentially this will not be the final L2 solution. Something we could concretely do, right now is:  start a xDAI core unit. add liquidity to xDAI (e.g., we could bridge 10m DAI + 10m USDC and LP them on honeyswap). start a Validator node on xDAI (this gets us rewards). pay Sourcecred in xDAI. etc  All of the above require no Smart-Contract knowledge. Of course it would be super cool to have some SC development as well. Like moving Governance and/or Vault creation over there. That would be awesome. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.800793650793651
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#42",
                    "likes": "3",
                    "time": "22/02/2021-17:30:55",
                    "content": "I can’t thank you enough for turning this up.  I am glad to see some discussion going on. BTW:  AGAVE port basically done.   Token drop will happen on 2/28 launch within the week after.    1Hive – 21 Feb 21    Agave Airdrop Announcement Agave Airdrop announcement Agave token page: https://blockscout.com/poa/xdai/tokens/0x7B86cC4cdA0522C963ca4C02BF2FcD6198350811/token-transfers  Agave Aragon DAO:... Reading time: 3 mins 🕑 Likes: 67 ❤      /r/ethtrader already beginning the move of infrastructure.    reddit    r/ethtrader - Comment to receive your $donut distribution on xDai blockchain 81 votes and 546 comments so far on Reddit      I think given today fees cracked 1000gwei there is real demand for some sort of L2/sidechain.  xDAI seems to be the easiest to hit now.  Once better tech hits I believe it is the intention of many players to basically move to the best tech which so far to many looks to be optimistic. Given xDAI has a fair amount of bridge work being done (Matic shortly, Binance via connext soon) it might be a good place to bring some liquidity and infra. Up to the community here. Thanks again for posting this @Aaron_Bartsch I will be posting links in other places I have written about this. ",
                    "links": [
                        "https://forum.1hive.org/t/agave-airdrop-announcement/2373",
                        "https://new.reddit.com/r/ethtrader/comments/ll8wwg/comment_to_receive_your_donut_distribution_on/",
                        "https://new.reddit.com/r/ethtrader/comments/ll8wwg/comment_to_receive_your_donut_distribution_on/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#43",
                    "likes": "8",
                    "time": "22/02/2021-17:34:45",
                    "content": "Hello, I am very interested in this, and I’m sure we can rally other 1hive members over on xdai to help out where possible. There’s lots of exciting stuff now happening on xdai, and with us setting up connext bridges to all the L2 solution we may even be able to have Maker on matic, Maker on polkadot, Maker on bsc too (why not I guess). I believe the rapidly approaching future belongs to L2s and L2 cross-chain aggregation. The window of opportunity is still here, but it’s rapidly closing. There are lots of projects now clamoring to be the powerhouses of L2. I don’t think bsc is it. I just think they’re the canary in the coal mine. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#44",
                    "likes": "3",
                    "time": "22/02/2021-17:50:28",
                    "content": "When xDai Core Unit?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#45",
                    "likes": "3",
                    "time": "22/02/2021-17:51:32",
                    "content": "I’m interested in being a part of this core unit, but I don’t want to write the core unit proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#46",
                    "likes": "1",
                    "time": "22/02/2021-17:52:15",
                    "content": "Haha I’m sure that is the case for many of these things. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#47",
                    "likes": "2",
                    "time": "22/02/2021-17:53:18",
                    "content": "Would be nice if we could “just do it” and formalize the process later. Seems like Maker’s processes bog down getting things done a lot of the time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7407407407407405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#48",
                    "likes": "3",
                    "time": "22/02/2021-18:26:35",
                    "content": "There isn’t really anything from stopping anyone from just doing whatever they want. Core Units are shaping up to be the way to receive consistent funding for some aim, though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kukkio",
                    "index": "#49",
                    "likes": "0",
                    "time": "22/02/2021-19:16:57",
                    "content": "    LongForWisdom:  Core Units are shaping up to be the way to receive consistent funding for some aim, though.   Short term perhaps. Long term this might not be enough to attract the best of the industrie talent. The Maker DAO might be able to attract the best of the best, but some serious monetary incentives are key. The Maker protocol  might be able to finance some limited number of skilled people/organisations (the foundation included). A representative democracy of sorts could be a long term solution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.516156462585034
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#50",
                    "likes": "4",
                    "time": "22/02/2021-23:32:26",
                    "content": "xDAI now! All project running on L1 and costing 100s of USD to use will be obsolete/replaced by the end of this year. The security of xDAI is better than the security of L1 with high fees and congestion and you can probably get an insurance if you’re paranoid. EDIT: running (only) on L1 is a bug and it needs to be fixed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#51",
                    "likes": "0",
                    "time": "23/02/2021-14:18:57",
                    "content": "    bit:  he security of xDAI is better than the security of L1   How do you figure security is better on xDai than on Ethereum L1? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#52",
                    "likes": "2",
                    "time": "23/02/2021-16:15:07",
                    "content": "It is theoretically not more secure but the chance of losing money on xDAI due to theft/misbehaving bridges is very small and it can be somewhat mitigated. On the other hand, if you have a small vault on L1 (<$5.000) there are many ways you could lose money  - i.e. being liquidated at 0 bid (congestion), having to pay $1000+ to manage the vault or lose collateral (high fees)… EDIT: AFAIK - there were no incidents on xDAI causing people to lose money so far. $26M TVL. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.047222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#53",
                    "likes": "0",
                    "time": "25/05/2021-22:15:57",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}