{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ideations-and-suggestions-for-growth-at-scale/16458",
            "title": "Ideations and Suggestions for Growth at Scale ",
            "index": 16458,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "sf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Shravanrajas",
                    "index": "#1",
                    "likes": "3",
                    "time": "08/07/2022-23:19:16",
                    "content": "Salutations to the Maker Community. I spent some time over the past couple months with some suggestions to focus on for future scalability. Keep in mind these are suggestions, however, I do believe the following can add serious value to Maker and Dai’s standing. I would be happy to work and develop these further with the corresponding stakeholders. My line is always open and I am here to help   Help flush out design making frameworks and streamline activation roadmaps / processes for integrations.    A) The stakeholders involved in various growth opportunities from Dexes, AMMs, Liquidity Providers, Wallets, Payments, etc. are different yet fundamentally aligned. How do we project manage the journey from ideation to completion for all stakeholders and for the DAO to see? I seek to create a robust reporting mechanism that allows members of the DAO to easily recognize the challenges, green lights, and successes for Dai adoption across verticals on a timely basis. By having this available for the DAO, strategy and growth is emphasized which will minimize debate. This initiative will boost cross-functional alignment, and reduce friction within the DAO.   B) Expand upon existing process flow diagrams across verticals by utilizing feedback from all stakeholders. I have extensive experience in operationalizing feedback from my time at Qualtrics (the leading experience management company)   C) Use Gantt charts to help efficiently manage and onboard new partnerships.    Remove barriers that prevent growth by understanding and actively benchmarking MakerDAO’s comparative advantage. By defining and benchmarking KPIs across growth pillars (verticals, regulation, decentralization, and more) MakerDAO will better understand its value proposition in relation to growth metrics. This can be done via the following:    A) Mapping the various customer journeys; understanding and referencing KPIs across the customer journey. Data is readily available via Dune. Synthesize what excellent performance looks like to keep our standards high and seize opportunities to improve our offering in the future. Share this information with the Dao at a timely cadence.   B) Creating Business model Canvas across verticals (lending categories, Dai utility, partnerships) to clearly tie strategy with Maker’s CU structure. Maker must lay the foundation to understand adoption at scale - down the road stakeholders will have to interact with other core units. This activity will help prepare for that time as opposed to being overwhelmed when the time comes.    Payments    A) Benchmark and target payment providers including Wallets with Atomic Swap capability. Must be done across geographies against size, utility, regulation.   B) Create a robust framework or template to identify the Minimum Viable Economy to enter and scale organic Dai Adoption   C) Aggressively research Stripe / Plaid APIs that support Bitcoin/Lightning Network - contact teams to understand how to partner with decentralized stablecoin Dai utility   D) *Buy now, pay later with DAI capability. Could look like NFT/DAI vault    Product development for existing partners    A) Identify where DAI utility is stagnating across existing partnerships and identify why   B) Work in collaboration to create growth roadmaps for partnerships with high ROI    Introduce new services and opportunities to expand to the DAO. I have been to many conferences within the past year and have contacts across the industry. Examples below:    A) Social media analytics platform named The TIE to understand social importance across Discord/Twitter using Natural Language Processing on non-bot accounts   B) Blockchain based carbon credit marketplace   C) Micro-loan services in emerging markets   D) Carbon Audit of Dai Stablecoin on L2s   These are some items that I felt could add serious value to Maker. I personally think the Payments section may add great value to the DAO, however, I would be privileged to help out in any iteration of the above or otherwise. Feel free to reach out as well as debate the validity of these suggestions. ",
                    "links": [
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-7-13-de-julio-del-2022/16740"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.589021464646464
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "06/10/2022-23:19:49",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}