{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/tokenized-yield-generating-trade-finance-assets-as-maker-collaterals/1645",
            "title": "Tokenized Yield Generating Trade Finance Assets As Maker Collaterals ",
            "index": 1645,
            "category": [
                "Governance"
            ],
            "tags": [
                "collateral"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/atulkhekade",
                    "index": "#1",
                    "likes": "8",
                    "time": "17/03/2020-11:58:50",
                    "content": "I’ve been part of MakerDAO community for some time now. Been Learning. Holding MKR and DAI. Today was a Historic step in adding a Tokenized cash version coming from centralised entities (USDC) to enhance the liquidity collateral. We have been working on tokenizing Trade Finance Assets through TradeFinex. Trade Finance Assets are over 15 Trillion in value globally. They run the show for basic human consumption. Even as Coronavirus outbreak started, the first thing that people resort to are stacking up supplies from supermarkets. Trade Finance Assets are usually buyer guaranteed (supermarkets are a great example) or confirmed payables and yield 4-9% annually. They are usually exempt from securities act unless there is a securitization that converts them into notes or fixed income bond like instruments. I wanted to introduce TradeFinex to the MakerDAO community with the vision that some of the assets that are tokenized on TradeFinex can act as collaterals for DAI in the near future. We are working with several Trade Banks to standardise the tokenization and distribution method for these assets. Our team is working towards tokenizing about 100 Million of Trade Finance assets by Q2 and scaling it multiple X with Trade Banks (Origination Partners). I’d love to connect with MakerDAO community in getting feedback on how we can effectively scale this and further enhance what MakerDAO has been doing and add healthy mainstream adoption. One thing that still sucks except US is fiat on ramps for cryptos are pretty expensive or time consuming. TradeFinex.org can change that. TradeFinex network of Trade Banks can provide effective fiat on ramps. An Article that explains:    Medium – 4 Mar 20    Stablecoins & Legacy Finance: How can stablecoin-holders earn interest... As banks slash interest rates, Decentralized Finance (DeFi) is increasingly becoming a favorite for savers. Emerging as a game-changer… Reading time: 8 min read       Look forward to building this with community if we get enough support. ",
                    "links": [
                        "https://medium.com/xinfin/stablecoins-legacy-finance-how-can-stablecoin-holders-earn-interest-from-legacy-finance-397ae7f9b7d2",
                        "https://medium.com/xinfin/stablecoins-legacy-finance-how-can-stablecoin-holders-earn-interest-from-legacy-finance-397ae7f9b7d2"
                    ],
                    "GPT-summary": "The author of the post is explaining the concept of tokenized trade finance assets and how they can be used as collateral for DAI. The author is seeking feedback from the MakerDAO community on how to effectively scale this idea and enhance mainstream adoption. A 3rd party is extending to the proposal by offering a network of trade banks that can provide effective fiat on ramps. The 3rd party is also asking questions about how to collaborate with the community and is giving constructive criticism on the idea.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxlev",
                    "index": "#2",
                    "likes": "0",
                    "time": "23/06/2020-23:38:27",
                    "content": "This looks like a total scam. The type of credit receivables you are talking about pledging as collateral are not fungible i.e. two different pools of receivables financed under a PO finance model may have vastly different counter-parties. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/atulkhekade",
                    "index": "#3",
                    "likes": "0",
                    "time": "24/06/2020-04:08:07",
                    "content": "Woh! Calling an idea scam would be the first scam. The whole idea of this is to digitize credit instruments with full transparency so that the insurers, keepers and funders can do their own credit assessment and fund the transactions! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#5",
                    "likes": "4",
                    "time": "24/06/2020-05:29:45",
                    "content": "This idea looks interesting and not like a scam. It’s complex, and tokenization of physical and/or legal assets inevitably have to be. There’s nothing unusual in traditional finance about securitizing things like mortgages, micro cap stocks, etc that are illiquid, and this will inevitably happen in blockchain finance as well if we are to be successful. I am a little concerned about having the primary protocol exist on a separate chain though(specifically the xdc chain), this adds an additional layer of complexity and intermediary/custodian risk on top of all the normal issues with custodial risks of physical assets, and the complexity of securitization. This swapping between xdc and erc20 would essentially need to be done trustlessly with a smart contract to be acceptable. Overall, I think this is probably the most complex token idea we’ve seen proposed so far and I don’t really see this type of product being a priority anytime soon. If it was built with the tinlake protocol instead, and operated through tinlake on Ethereum it would be easier to imagine some kind of onboarding roadmap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.801542207792208
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#6",
                    "likes": "3",
                    "time": "24/06/2020-07:27:45",
                    "content": "I don’t think it is a scam, in theory trade finance could benefit from the use of a blockchain. The product still needs a bit of work to put it mildly. On this page http://exchange.tradefinex.org/aboutus they claim they are a dex, while on the same page offering “extensive customer support”. The site has no tokens available for trade. The function of the XDC coin is not explained anywhere. The best case scenario is that this is a project still being developed and the Maker community will hear from them again when they have a functional product. I guess if they are serious they could build some bridge to Ethereum via Polkadot/Substrate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "3",
                    "time": "24/06/2020-08:54:39",
                    "content": "@maxlev please refrain from calling projects and ideas scams without evidence. There are a number of very obvious scams in the ethereum space generally which cause a lot of harm. It isn’t fair to lump this in with those. If you have doubts about the idea, please express them without the hyperbole. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/atulkhekade",
                    "index": "#8",
                    "likes": "0",
                    "time": "24/06/2020-15:12:51",
                    "content": "Thank you for your support and frank review.  Atomic Swap between XDC Network and Ethereum Network are currently under dev priority. They are being tested. There are 2 reasons why XDC network as a layer for implementation of TradeFinex was chosen  a. It will go down to competitive fee structure for transaction and transaction finality b. Governance model is hybrid. Its decentralised but XDPOS (XinFin Delegated Proof of Stake) works on 2/3rd consensus. We are assuming when large scale real world assets are introduced on the network, the participants are going to demand Governance  The market maybe ready more than we think. Within MakerDAO community it may seem not so much a priority right now but the enterprises that we speak with are heavily inclined to start transactions ASAP.  Looking forward to more feedback from the community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.872222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/atulkhekade",
                    "index": "#9",
                    "likes": "0",
                    "time": "24/06/2020-15:17:16",
                    "content": "Thanks for your reply. Currently there are some pilot transactions live on the network that are not listed there. We had enagaged with Polkadot/Parity team for a bridge from XDC Network to Ethereum. Atomic swap will be live very soon. There are more interoperability features the dev has been working on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9772727272727275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/atulkhekade",
                    "index": "#10",
                    "likes": "0",
                    "time": "30/12/2020-17:43:06",
                    "content": "Just an update on this thread. TradeFinex has started generating staking yields on its pilots with real world finance originators.    TradeFinex    TradeFinex | Trade Finance Distribution powered by XinFin [XDC] Blockchain... A Blockchain Network for Trade Finance Originators to Distribute Trade Assets to the Growing Class of Alternative Asset Investors.      This is how it works Global Trade and Trade Finance combined is close to USD 30 trillion in market. First Element :  Digital Asset Backed DeFi Borrow SGDg/lend SGDg (Globiance issued stable coin on XDC Network) Borrow Xstable/lend Xstable (Synthetic USD backed by XDC - like DAI )  Second Element :  Recording payment obligations from real world originators on XDC Network smart contract Enables credit delegators and lenders to provide liquidity for originators.  Third Element : Credit Delegation in Digital Assets to real world finance originators TradeFinex is live with about USD 100,000 worth XDC staked to generate yields with real world finance originators. Its minuscale compared to DeFi ecosystem on Ethereum network. It may seem before time for some still but the protocol can really scale up by adding more originators and connecting them with liquidity pools. Roadmap 2021:  Need to build more liquidity on XDC (Listed on BitFinex recently) Need more liquidity for Xstable - XDC backed stablecoin Need third party accredited investors/lenders Need third party credit delegators Add more originators Thin margin market making to Xstable against fiat currency  This is third party article. This guy maybe running XDC Master-node. But if there are enough people who do this, XDC may become very liquid and relevant to scale this up.   Medium – 24 Dec 20    Setup XDC:USD and XDC:USDT Automatic Market Making bot With Bitfinex Trading... Introduction Reading time: 6 min read       ",
                    "links": [
                        "https://www.tradefinex.org/publicv/markets",
                        "https://ruslanwing100.medium.com/setup-xdc-usd-and-xdc-usdt-automatic-market-making-bot-with-bitfinex-trading-account-using-d0862488279b",
                        "https://ruslanwing100.medium.com/setup-xdc-usd-and-xdc-usdt-automatic-market-making-bot-with-bitfinex-trading-account-using-d0862488279b"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.788586413586414
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#11",
                    "likes": "2",
                    "time": "30/12/2020-18:30:13",
                    "content": "I think a flow diagram would really be helpful here. I am not following how invoices are pledged and enforced in the system. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/atulkhekade",
                    "index": "#12",
                    "likes": "2",
                    "time": "30/12/2020-18:54:01",
                    "content": "Yes. Will be uploading it next. Its a payment obligation from off-chain originator recorded on smart contract. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5357142857142865
                }
            ]
        }
    ]
}