{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/eth-z-with-100m-4-120-liquidity-disabled/4262",
            "title": "ETH-Z with 100M / 4% / 120% / liquidity disabled ",
            "index": 4262,
            "category": [
                "Governance"
            ],
            "tags": [
                "informal-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#1",
                    "likes": "0",
                    "time": "19/09/2020-12:01:06",
                    "content": "Clearly, the peg won’t go under 1.01 if we don’t do more than the USDC setting. This set up means that we will buy ETH (as debt like USDC) if it is goes down by 20% and give the holder a security over it. It will be a limited time let’s say 1 month or until we fill up the vault then we switch the Debt Ceiling to 0M.     yes no     0 voters     ",
                    "links": [],
                    "GPT-summary": "The post explains a proposal for ETH-Z with specific settings and limitations. The author explains how the proposal works and suggests a limited time frame for implementation. The post also includes a poll for readers to vote on the proposal. A third party may ask questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.173015873015872
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#2",
                    "likes": "0",
                    "time": "19/09/2020-13:15:26",
                    "content": "It is too soon to say that the PEG will not go under 1.01. In fact, if we see how much USDC have been locked in the protocol, I would say that many believe it will go under 1.01 (otherwise, people would not keep locking USDC and probably leveraging risking big fees due to the 4% at these values) There are still ~200M more to mint from USDC and TUSD vaults. Enough that some whales get convinced of this fact, to use leverage in millions and bring the PEG very close to 1.00. If we see those 200M being minted, and still not big drops in the DAI/USDC price in open market, then that would be a stronger indicator to think that current settings are not enough, but TBH, more likely it’ll be preferably to increase the debt ceiling for stablecoins then. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.6826923076923075
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#3",
                    "likes": "1",
                    "time": "19/09/2020-13:36:51",
                    "content": "It won’t, There is no value to lock USDC except to bet on the dai to go to 1 or get the free money above the 1.01. All monies you see is abandoned. They left the debt and took the above money. Regarding the bet on the dai going to 1, curve algo makes it very easy to go from 1.03 to 1.01 To go from 1.01 to 1.00 it is way more tougher, actually exponentially tougher. No one will go down that way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.817361111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#4",
                    "likes": "1",
                    "time": "19/09/2020-13:46:13",
                    "content": "Well, I should tell that today at 7:53 UTC, I was checking Curve and in about 10 mins the DAI price came from 1.013 to 1.0056. It took only to mint 50M (from 200M -> 250M) to accomplish that. It took around 1h - 2h for the arbitrage to take that value back to 1.009. I think this is a proof that it can go below 1.01 and there is margins for profit here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#5",
                    "likes": "0",
                    "time": "19/09/2020-13:57:25",
                    "content": "I meant the whole market not one gauge at 7:53 UTC. Part of it is also for once to be ahead of the problem not on a reaction mode. I don’t mean to do it now but to have a plan and make sure people got the message. And if the peg doesn’t go down be ready to push the button. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.4319444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "19/12/2020-19:57:25",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}