{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/why-sf-dsr-request-for-discussion/1086",
            "title": "Why SF = DSR ? Request for discussion ",
            "index": 1086,
            "category": [
                "Governance"
            ],
            "tags": [
                "alignment",
                "rates",
                "dsr"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#1",
                    "likes": "2",
                    "time": "09/01/2020-08:37:24",
                    "content": "Hi, I have a question. Initially DSR and SF where two distinct values (2% and 4% i believe) but very soon they has been equated. Is there any economical reason for that? I believe In theory SF>DSR since there exists bigger than 0 risk for MKR holders on DAI placed in DSR? I’m aware that MKR holders still benefit from SF of DAI that are in circulation and not in DSR (for taking risk of their price dropping) but I believe MKR Holders also carry non-zero risk on DAI placed in DSR despite the fact that they are out of a circulation, so there should be some risk premium on those DAI as well (expressed in SF being higher than DSR)? I’m aware that both DRS and SF are simply result of voting and as such might be just result of some arbitrary convictions of MKR holders, but since DSR=SF is being voted constantly by big holders I hope there is some reeasoning behind it and It can be clarified here. Also my other thought: maybe we should think about SF as value reflecting risk imposed on MKR holders by DAI in circulation and SF - DSR as value reflecting risk imposed on MKR holders by DAI out of a circulation (in DSR). How this risks differs ? ",
                    "links": [],
                    "GPT-summary": "The author of the post is asking for feedback and clarification on the relationship between DSR and SF in the context of MKR holders' risk. They are questioning the economic reasoning behind equating the two values and suggesting that SF should be higher than DSR due to the risk associated with DAI placed in DSR. The author is also asking for clarification on the difference in risk between DAI in circulation and DAI in DSR.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.330357142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#2",
                    "likes": "0",
                    "time": "09/01/2020-09:40:28",
                    "content": "Is there any reason for using DAI instead of CHAI (tokenized DSR-DAI) if CHAI contract is safe and adopted by major wallets/exchanges? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.40625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#3",
                    "likes": "0",
                    "time": "09/01/2020-09:45:32",
                    "content": "I would say yes. But this might be a question for a new topic. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#4",
                    "likes": "0",
                    "time": "09/01/2020-09:46:50",
                    "content": "    Adam_Skrodzki:  but I believe MKR Holders also carry non-zero risk on DAI placed in DSR despite the fact that they are out of a circulation   Could you elaborate on this? Are you talking specifically about contract risk or broader risks? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#5",
                    "likes": "0",
                    "time": "09/01/2020-09:55:25",
                    "content": "    Adam_Skrodzki:  but I believe MKR Holders also carry non-zero risk on DAI placed in DSR despite the fact that they are out of a circulation, so there should be some risk premium on those DAI as well (expressed in SF being higher than DSR)   The contracts could be upgraded to have an option “apply previous DSR/SF values” if current values activate MKR minting. That would allowe safe DSR>SF parameter values. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.729166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#6",
                    "likes": "0",
                    "time": "09/01/2020-11:56:56",
                    "content": "If Eth drops significantly and MKR system solvency will be at question You can expect withdrawals from DSR and liquidation of DAI to USD which would drive price of DAI down. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.548611111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#7",
                    "likes": "0",
                    "time": "09/01/2020-12:00:39",
                    "content": " Is there any reason for using DAI instead of CHAI (tokenized DSR-DAI) if CHAI contract is safe and adopted by major wallets/exchanges?  I believe DSR DAI defeats whole purpose of DSR (putting DAI out of circulation) and partially also DAI (one of DAI currency related utilities is being unit of acount DSR-DAI is worse in that regard, while it is surely better as a store of value) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.544642857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#8",
                    "likes": "4",
                    "time": "09/01/2020-15:05:49",
                    "content": "Nice of you to start a thread on this. imo.   First when I look at risk.   I look at it to all players NOT JUST MKR holders. So lets look at what risk there is of DAI holders depositing DAI in the DSR.   PEG risk.   There is a real risk that the PEG drops below $1.   The only players who can mitigate this risk are buyers of DAI using other assets like USDC, ETH, etc.   In effect there is a real PEG risk to DAI holders that can wipe out any gains.   I also believe there is an ESM risk to these same holders because IF the ESM is unexpectedly activated the DAI PEG would float against the collateral value.   There is no liquidity risk because Maker does not re-loan the DAI deposited in the DSR (which is a good thing).   Interest rate risk.   In the loosest sense because the rates can change quickly there is a interest rate risk to depositors, but I consider this minimal because if depositors can find a better return the only penalties are network tx costs.   The low end finanically underserved bear more risk here than larger players because network tx costs are fixed.   When it comes to borrowers they end up benefitting from PEG < $1 and are the primary users that would have strong incentive to buy DAI < $1 to pay down debt with less DAI than they borrowed hence netting a return on the borrowed DAI.   But these players have to be in a position to do this (they may not be).   Other DAI buyers may step up but they still have to throw new capital at buying DAI.   Risk to MKR holders to my mind is minimum since the risk premium on borrowers with collateral in vaults is already determined by the risk premium as well as the GSF.    The only risk to MKR holders is a reduced income stream against the total outstanding DAI and when this DAI is locked up in the DSR it is generally not in circulation (not to stabilize the PEG if >$1).    Also every DAI that is minted is paying fees via drip() so there is no such thing as ‘free’ DAI in circulation.   Every one is backed by collateral paying fees.    The only issue to MKR holders is that part of these fees go to DSR depositors.    Unless the DSR rates gets really high I do not forsee 100% of available DAI being deposited in the DSR.   90% sure.   Again these are reasons why I have been advocating taking a fixed % of SF fees to pay the DSR (to create a floating DSR rate based on deposit facility utilization) as well as having a SF rate floats against the debt facility utilization.    As these kinds of floating rates against utilization mechanisms would allow the markets to price and minimize risk, while maximizing the return for MKR token holders via fees.  market driven rates would also require less governance voting than currently because they would have enough wiggle for markets adapt these rates to changing economic conditions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.736370461370461
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#9",
                    "likes": "1",
                    "time": "09/01/2020-15:18:56",
                    "content": "btw:  I realized you asked a question.  Is there any reason the DSR is matching the SF?  I do not believe there is a real valid economic reason because we simply don’t have enough data on this. I have a sneaking suspicion that since the PEG was below $1 we know we wanted to increase either the SF or the DSR, but increasing the DSR above the SF (again a reason why the DSR payout should be a fixed % of the income from the SF) was that if deposits approach 90% Maker would start running a deficit.   So it is logical to both increase the SF and the DSR at the same time to avoid Maker running a DAI deficit and having to auction MKR to make up for it. Also note that increasing the SF and the DSR is a double hammer to move the PEG up, and from what I can see it did this nicely.    What I would like to see next is a slight drop on the DSR rate from 6-5% so we can get some data on the PEG for distinct changes to a single Maker Parameter (DSR) vs. doing both the DSR and SFs at once. But honestly what I am really looking to see is implementation of a fixed % of the SF fees going to the DSR giving a floating DSR rate.    After that to see a utilization curve based adjustment to the SFs so those rates can float as well.     Proposal interest rate adjustment by debt facility utilization Collateral Discussion       Mitote thank you for the consideration and reply.    u in the curve is the Debt facility utilization factor and NOT the collateralization factor.   You are right if the curve was collateralization based it would be horrible.  So again u = actual debt/debt ceiling.   Right now stands at about .74 and so the SF based on my example formula would have the interest fees just starting to rise.   u(.74)=1.031*itarget         A Governance Model for Maker Governance       I may start another thread but I have been thinking of an alternate approach to the DSR by simply paying the DSR based on a % of the fees.  Simple example.  If we were to take 50% of ALL of the fees and pay them out to the DSR it would give the following rates based on DSR utilization.  ~110M in loans at ~5%/yr generates ~5.5M/yr in fees.  DSR utilization is at 30M which using above numbers would be paying a DSR rate of 9.15%  If the DSR utilization were to increase to 60M this rate would be ~4.…     ",
                    "links": [
                        "https://forum.makerdao.com/t/a-governance-model-for-maker/1056/5",
                        "https://forum.makerdao.com/t/signal-request-reduce-the-frequency-of-the-dsr-spread-governance-poll/1207/2"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.348765432098766
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#10",
                    "likes": "1",
                    "time": "09/01/2020-15:23:53",
                    "content": "Using a fixed % of SF fees to pay the DSR would compensate for such an event because DSR rates would go up in this case if deposit utilization drops. In the end the DSR is good because it changes the effective DAI for collateralization in circulation.   Remember ALL DAI minted is paying the SF fees - not just part of it.    In effect if we get 80% DAI lockup the total outstanding DAI can increase 5x without too much change in liquidity in markets.   But you are right that in theory this is correct.   In practice we will get accordion like elasticity in DAI liquidity during bear or bull markets.     Again some of the many reasons I proposed changes to DSR payout, and SF interest rates based on facility utilization to help the markets dynamically sop up or release liquidity via automatic mechanisms vs. what I consider to be the fixed long latency ones (governance). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.334415584415584
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#11",
                    "likes": "1",
                    "time": "10/01/2020-04:07:16",
                    "content": "    MakerMan:  I do not believe there is a real valid economic reason because we simply don’t have enough data on this.   If so that is actually quite scary, because it was sugested in a pooling and then voted in   Using a fixed % of SF fees to pay the DSR would compensate for such an event because DSR rates would go up in this case if deposit utilization drops.   that is interesting proposal, but it is not how system currently works and I’m more asking why current system is being used way it is being used. For reasons I do not understand currently % mentioned by you is fixed on 100 effectively ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.566666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#12",
                    "likes": "1",
                    "time": "10/01/2020-13:54:28",
                    "content": "Well there are some scary things with Maker but how rates are changed by governance isn’t exactly the biggest one (at least to my mind).   Why we have discussions is because people can disagree.  That we don’t have enough data.   This happens frequently in all kinds of systems.   We do have ‘some’ historical data from the SCD/SF that gives us an idea of where rates should land.   What we don’t have is any solid data regarding the DSR effect on the PEG.   What we do know is increasing the MCD/SF and DSR from 4-6% solidly moved the PEG up.   It is looking pretty good but there is a poll running that has us dropping the DSR and SF back to 4%. Also just because the DSR rate = the SF rate you have to factor in outstanding debt now via makerburn.com 82.7:34.7 DAI:SAI or total 117.4M.    daistats.com showing 36.5M in the DSR giving a 44.2% utilization.    This means < 1/2 of the interest from the SF payments goes to pay interest to depositors in the DSR.    Hence the effective percentage payout based on the 6% DSR, and 6% SF is 44.2% due entirely to the 44.2% utilization and not 100%. ",
                    "links": [
                        "http://daistats.com"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4609375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jeffshaw",
                    "index": "#13",
                    "likes": "2",
                    "time": "11/01/2020-14:31:47",
                    "content": "If a fixed % of SF fees to pay the DSR was implemented, what % should we target?     25 50 75 100     0 voters     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#14",
                    "likes": "3",
                    "time": "11/01/2020-16:34:53",
                    "content": "I made an argument for why the DSR should match the SF here: The DSR/SF spread should be as tight as possible to maximize growth Regarding risk premium, I completely agree we should be adding that on top of the SF. I proposed an initial model here to take RPs into account on top of the Global SF: A Governance Model for Maker Since we are not at 100% DSR utilization and it’s not exactly a mature market I think we can get away with DSR = SF for now (ignoring risk premium). There are some technical limitations with the way the fees are structured right now due to SAI requiring 0% fees. Because of this we can’t use the global sf until migration is done. After that I believe we should switch to the model I proposed above. ",
                    "links": [
                        "https://forum.makerdao.com/t/a-governance-model-for-maker/1056"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.396978021978022
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#15",
                    "likes": "4",
                    "time": "11/01/2020-18:59:33",
                    "content": "Thanks for pointing out this interesting thread, somehow it went for me under the radar. I want discuss with it a little though The trick is what word ‘growth’ means Do we want to maximize number of DAI generated by Vaults owners? or We want to maximize number od DAI in circulation? If first then sure, You want to have SF as close to DSR as possible to have maximum utilisation and maximum ratio between DAI Generated/DAI in circulation But I would argue that this is not the thing You want to maximize. What You do want to maximize is amount of DAI in actual circulation. DSR is a tool that allows DAI owners, for which ownership of DAI has low enaught utility, to earn interests on removing DAI their own from circulation, leaving in a system only DAI that are trully needed for use as mean of exchange / unit of account so I would argue that You want to have DSR as low as possible with still maitaining the peg. Actually SF - DSR = risk + utility not just risk if DSR utilisation approaches 100% Maker protocol starts to be similar in it’s function to compound - it simply connects people with USD (in a form of DAI) with people who wants to take collateralized credit (mint DAI) I would argue that main utility of Maker system should be in DAI as stable mean of exchange / Store of value / unit of account not in ability to earn iterests on deposits or take credit deposits and credit are means enabling stable coin to exist not aims themselves ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.422149122807017
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#16",
                    "likes": "1",
                    "time": "11/01/2020-19:04:54",
                    "content": "Thanks for pool I selected 75% but actual answer is “less than 100% but probably somewhere close” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#17",
                    "likes": "3",
                    "time": "11/01/2020-19:06:17",
                    "content": "Growth in this context means growing the DAI supply as quickly as possible whilst maintaining a strong peg at $1. Beyond that it shouldn’t really matter what DAI is being used for. Btw DAI in the DSR isn’t pulled out of circulation. You can use CHAI and still transact with it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.055555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#18",
                    "likes": "1",
                    "time": "11/01/2020-19:12:56",
                    "content": "Thanks for quick answer. In practice when You put DAI to DSR they gets burned and while technically You can have a token which is backed with DSR deposit in practice they are not widely used and I will argue that if they where it would defeat whole purpose of DSR I would argue that main product of Maker is DAI in circulation and kept stable not DAI generated for credit and that in practice DAI in DSR are out of circulation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#19",
                    "likes": "4",
                    "time": "11/01/2020-20:49:35",
                    "content": "Interesting discussion. I think some real discussion of the goals of Maker would be in order before discussing what to do. My problem with rampant growth is that at some point growth has to stop and the system has to find a means to be stable with respect to dynamic markets.   I am more interested in ‘sustainable growth’ and ‘sustainability in general’ as well as adjusting the interest models to be more ‘flexible’ to create a more ‘stable’ system vs. just growth for growth sake. I have a number of attack scenarios to the Maker system that is massively disruptive to markets.  These are particularly effective if the market cap of Maker is less that the total amount of DAI + collateral since it only takes 50K MKR to activate the ESM.    So I for one am not hot to massively grow this system until we can get mechanisms in place that allow for some dynamism of those rates and some real discussion about how MKR worth $1B cap can actually backstop DAI + collateral that is worth say $3-5B and what it means for $50M worth of Maker to be able to freeze the entire system of that 3-5B instantly at any time. I honestly had one question about the DSR.   What was the community goal(s) with this?   To sop up liquidity or to compete with the secondary markets for deposits, added PEG lever or something else?    It isn’t like Maker is doing anything except paying out SF fees for those deposits (it isn’t like the DAI is re-loaned to give additional return). My reaction to the DSR deposits is they are kind of a last stop for liquidity if the PEG rises too much above $1.   So this is a key liquidity provided if markets get too tight and liquidity is low.    There is no way for someone to get the DSR rate and provide liquidity to markets via oasis/save/trade which kind of sucks.   on DYDX I get a return on deposits that are backing orders.   This means that my DAI on DYDX can act as a liquidity mechanism WHILE earning a return.   No such activity is possible with DAI deposited on oasis save which I consider a pretty big negative from a liquidity provision point of view. It honestly would be nice if I could put up my DAI earning the DSR into the oasis contract offer to sell at 1.01 or 1.02 or even over a range as a liqjuidity provider of last resort that also earns interest while waiting to be traded.   Granted once the USDC/DAI trade happens I no longer earn the DSR interest and will have to put in USDC into DAI bids again but I don’t even have the option.   BTW on DYDX I also earn interest on the USDC deposits as well as the DAI deposits. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.816220238095237
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#20",
                    "likes": "1",
                    "time": "11/01/2020-20:58:38",
                    "content": "I generally agree with your comments. In particular (but not entirely obvious) your formula SF-DSR=risk+utility. I think a discussion about whether Maker seeks to be a decentralized monetary provider (i.e. like a bank but one that also uses assets via borrowers to mint ‘cash’ with a well defined value - even if it is only pegged to the $1 USD) vs. something else like not just a bank, but like a business trying to encourage OTHER uses for DAI.    Personally everytime I see a coin or have seen a coin I want to see markets where I can buy services or things.    But this is something that directly competes with governments in terms of monetary creation, and providing an ability for holders of the coin to circumvent normal financial channels to do business. My thought is that Maker needs to focus (for now) on the financial side of things because that is already a pretty large task.   The whole what can I do with DAI will be filled in as the financial markets mature and the system itself is found to be robust and stable particularly with respect to the PEG - the key metric of SOV and usability for the two key elements of the community.  Borrowers who mint DAI and DAI savers or holders that want to have a coin with stable value that is ‘permissionless’ in its movement and use that also can pay a return for being held. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.44016290726817
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jeffshaw",
                    "index": "#21",
                    "likes": "4",
                    "time": "12/01/2020-21:37:51",
                    "content": "Maybe I’m thinking too simply on the goal right now, but I’m in the camp to grow the Dai supply as fast as possible while preserving the peg and not creating any systemic risks. To grow the system faster, I believe it is in the best interests of MKR holders to forgo immediate SF payments to support faster growth. The benefits to MKR holders will be in the long term mass adoption of DAI. By setting SF accrual = DSR interest accrual, the SF would be immediately lowered to 2.75%(DSR stays at 6%). if we target 75% fee utilization, the SF would be lowered to 3.5%. At 50% fee utilization, SF would be lowered to ~5%. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.196428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#22",
                    "likes": "2",
                    "time": "13/01/2020-07:23:10",
                    "content": "@Jeffshaw  Do I understand correctly that You do not agree with my definition of supply ? For me DAI in DSR are out of supply, that is whole point of DSR Looking on a website    daistats.com    Dai Stats Dai statistics live from the Ethereum blockchain.       I say we should maximize “Dai (ERC20) Supply” not “Total Dai” If utilisation rate is very high (and I would argue that on levels above 50% it is) Then MakerDAO starts to be decentralized lending platform (better compound) not stable coin provider and from what I can tell it was created with this second function in mind @rune can You confirm/deny?. Vaults or DSR are means not aim themselves.  By setting SF accrual = DSR interest accrual,  That would require SF<DSR at that point You will immediately attract rent seekers who deposit ETH generate DAI and immediatelly put it to DSR taking profit without using DAI for anything. @MakerMan  I honestly had one question about the DSR. What was the community goal(s) with this?  that is great question that I would also love to hear answer for. For me DSR is a sink where all DAI that are not currently needed on the market in circulation can flow. It is also source of income for keepers who in time of eth bull run are forced to sit on tons of DAI I also expect DSR increase peg sensivity to SF changes.  I think some real discussion of the goals of Maker would be in order before discussing what to do.  I agree that is great candidate for topic on this forum, but I have hard time to believe it has not been created yet ",
                    "links": [
                        "https://daistats.com/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.197391774891775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#23",
                    "likes": "1",
                    "time": "13/01/2020-07:42:29",
                    "content": "Hi @Adam_Skrodzki, We did vote for this not too long ago. If i can find the post i will send you the link. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#24",
                    "likes": "0",
                    "time": "13/01/2020-09:47:52",
                    "content": "Would be great, all I’m aware of is https://vote.makerdao.com/polling-proposal/pollfoundationproposal And if this should be taken under the account then I would argue that “serving underserved” Is more about Organic DAI circulation than being able to deposit your savings on 6% instead of 4%. Underserved usually do not have a lot of savings anyway. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.175000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jeffshaw",
                    "index": "#25",
                    "likes": "2",
                    "time": "13/01/2020-14:35:31",
                    "content": "Sorry @Adam_Skrodzki, when I was writing about “maximizing dai supply”, I was referring to total supply, not just the erc20  dai. My main point is that I think that we need to prioritize growing the system instead of MKR burns right now. To do this we need to get daily DSR interest accrual to match daily SF interest accrual. I do see your point of having a SF lower than the DSR could create rent seeking, but I wonder how many users would perform this action over other investment alternatives. Maybe the solution is a slightly lower SF than the DSR, but not much. Say 5% SF and a 6% DSR would be a good test right now to see what happens. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.440934065934066
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#26",
                    "likes": "1",
                    "time": "13/01/2020-14:57:55",
                    "content": "    MakerMan:  It honestly would be nice if I could put up my DAI earning the DSR into the oasis contract offer to sell at 1.01 or 1.02 or even over a range as a liqjuidity provider of last resort that also earns interest while waiting to be traded.   Yeah, I like this idea. Couldn’t this be made available by some exchanges listing CHAI/USDC and similar? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.6000000000000005
                }
            ]
        }
    ]
}