{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/centrifuge-collateral-a-way-forward-with-a-delaware-statutory-trust-and-the-arranger-model/11566",
            "title": "Centrifuge Collateral: A way forward with a Delaware Statutory Trust and the Arranger Model ",
            "index": 11566,
            "category": [
                "Governance"
            ],
            "tags": [
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/roollie",
                    "index": "#1",
                    "likes": "17",
                    "time": "10/11/2021-20:13:51",
                    "content": " Background & Motivation Before diving into the post, I want to officially introduce myself to the Maker forum, although I’ve posted and visited before. My name is Jeannice and I started with Centrifuge a month ago. My first interaction with Maker was when I posted an MIP6 back in May this year when I was at NAOS Finance. Along the way, I have gone through the due diligence process with @williamr (which I exited completely when I joined Centrifuge), joined the RWA Committee where I got to know some of the delegates and others in the community, and finally bought some MKR. In my pre-crypto experience, I spent 11 years working in banks (e.g. Citi, ABN Amro, Santander) across Asia, Europe and the US, primarily in fixed income syndication, sales and trading, and strategy and analytics. I also spent 2 years as a management consultant in McKinsey focused on corporate valuation. It’s safe to say that my interest in real world assets is not new, and RWA in general has been a great bridge where I feel my traditional finance background is helpful for me (and perhaps others) in the DeFi space. The reason why I was drawn to the space is because I want to help make finance more accessible for all, whether it is building paths where there were none before or making small changes to something that already kind of works. That’s why I resonated with Centrifuge’s mission: Centrifuge unlocks economic opportunity for all by connecting people to borrow and lend money transparently and cost-effectively; free of intermediaries and the inefficiencies of traditional finance. I’m co-authoring this post with Lucas, Centrifuge’s CEO @spin  A look back at Centrifuge’s progress with Maker so far Being a first mover is never easy. And Centrifuge has been the first more than once with Maker. In 2019 we did the first financing of RWA with single collateral Dai (SAI) with the Maker Foundation. We submitted the first MIP6 proposals in May 2020. Centrifuge drove the smart contract standards, an important technical achievement, for MIP21 and MIP22 in September 2020 along with 6S, which enabled RWA financing and liquidations. Whether on-chain or off-chain financing, all players are now using MIP21 and/or MIP22. In April 2021 New Silver minted the first million DAI backed by RWA. It’s hard to imagine now, but when we first started out, opinions on RWA backing DAI were diverse, some much more dissenting than others. Change is always hard, especially the type of big changes that we in the DeFi community are trying to make. In trying to move these large boulders, Maker has always been a key partner for us, and we believe that our interests are aligned in growing RWA and DeFi as a whole. While Centrifuge’s success is not tied to the success of a single issuer, Centrifuge’s success is tied to Maker’s success. We believe in people using DeFi for RWA and that ultimately DeFi will be used to settle these assets on chain. This has benefits beyond just bringing collateral to back DAI but also to drive adoption of DAI itself by creating an ecosystem of real businesses that rely on DAI.  Scaling Centrifuge Pools: Legal and Credit Improvements When the first pools launched, there was $0 RWA in DeFi. Our strategy from the get-go was to experiment, see what works and scale from there. We worked with the Maker community first, and later the RWF Core Unit to put a process and plan in place to scale these assets. We’ve gone from working with early pioneers like New Silver and ConsolFreight who were looking to borrow $5-20M to now bringing pools that are 10x the size. Nebula and Monachil all have the potential and proven track record to scale their vaults to $50M-100M+. As we scale, we are also becoming more thoughtful about our portfolio mix: asset class, geographies, risk-return ratios, etc. We are now exploring green pools. But we should not forget the early believers in a RWA future with Maker who have helped all of us pave the way. The original goal of the MIP22 was to define a first technical/legal setup that could later be iterated upon. We hear the concerns on the legal structure that the community has brought up and want to make it very clear that we do not expect to scale without making improvements. From the early New Silver audit, we have made improvements such as the independent servicer and a stricter process to allow Maker redemption before any changes to the executive summaries. We see the adoption of a trust structure as the next step. In the past few months, we hired legal and credit expertise to work on this and our next steps/first answers in addressing some of the concerns on legal structure are:  Enhance Security interest: we are working on an updated offering structure with our lawyers to bring in professional trustees to manage the pools Give the DAO ownership and enforceability: we are working on a trust structure which considers tax issues, with an independent trustee representing the DAO as beneficiary Work on a safe and scalable DAI-USD on/off ramp  On the credit front, we have been working closely with the RWF CU to make sure we work with the right issuers for Maker. We want to continue with this close relationship with the DAO and we commit to:  Apply institutional-grade due diligence when presenting future issuers to Maker vaults Ensure that such due diligence is transparent to Maker and applied consistently across all originators Align to Maker’s risk appetite (and its evolution), reflecting this in the type and calibre of assets that we bring to Maker.   Centrifuge Arranger for the Benefit of MakerDAO While we still don’t quite know what the future structure for RWA in Maker will look like, we would like to address the Arranger Idea. Centrifuge has aligned incentives with Maker: We want to bring RWA on chain, with Maker as one of our key partners: into Maker as collateral in a scalable and sustainable way. Doing anything that would put Maker at risk would directly threaten the viability of what we are trying to build. In addition, we have proven to be reliable partners to the DAO and now have an interesting pipeline of issuers who are waiting to come on board with Maker with scale. We are sure that Maker has many other interesting assets in the pipeline, and may be fielding other Arranger requests as well. Our key differentiation is that our issuers are all doing on-chain securitization and have on-chain transparency, and a verifiable junior tranche. We want Maker to be just one of our senior lenders. For those reasons we believe Centrifuge should ultimately work on establishing a separate Arranger that will work with issuers that do on-chain securitization and we will create a dedicated team to take on this work.  Next Steps: Our Proposal to the DAO In whatever format the DAO chooses to move forward with RWA (e.g. arranger, etc.), we are happy to collaborate on legal topics as well as how to scale RWA overall. Over the past few days we had a lot of conversations with stakeholders and their feedback has influenced this proposal. Specifically we’ve talked to the RWF CU (@williamr and @SebVentures), @flipflopflapdelegate and @Rune who’ve all been providing their feedback to the proposal below:  In order to stay conservative and not put the DAO at any undue risk, we propose to cap any existing pools at a debt ceiling of $20M each, with no more than $60M in the pools (New Silver, ConsolFreight, HarborTrade, Fortunafi, Peoples Company) under the current legal structure. The current debt ceiling across the pools is $44M. We are committed to improving the legal framework in consultation with the DAO before any new pools go live. We will have an action plan and share updates on a regular basis about our work here both with the community and key stakeholders. As the design and methodology of the Arranger framework takes shape, we will seek to understand what becoming an Arranger entails and work on scoping out what it would look like for us to become an Arranger. We will continue to work with MKR holders as well as official DAO appointed CUs to understand the regulatory, due diligence, underwriting requirements and other controls. For existing pools, we believe that Maker should continue to be a reliable source of funding up to the debt ceiling that Maker is comfortable with, as they believed in us in the first place when RWA on DeFi was not even a thing. We will bring forth a transition plan to the DAO on these existing pools. The existing issuers are aware and are committed to improving the legal setup along with us.  We seek feedback from the Maker community on the above to come to a common agreement with the DAO and MKR holders. Going forward, we will communicate more proactively on our legal process and the above work. Community members, delegates, MKR holders and mandated actors: please don’t hesitate to reach out if you have any questions. We look forward to working with everyone in an open and collaborative manner. Personally, I look forward to engaging with the Maker community more broadly and getting to know everyone here. -Jeannice and Lucas ",
                    "links": [
                        "https://forum.makerdao.com/t/mip21-real-world-assets-off-chain-asset-backed-lender/3917",
                        "https://forum.makerdao.com/t/mip22-centrifuge-direct-liquidation-module/3930",
                        "https://forum.makerdao.com/t/mip22-centrifuge-direct-liquidation-module/3930",
                        "https://forum.makerdao.com/t/on-chain-securitization-roadmap-new-silver-audit/9937",
                        "https://forum.makerdao.com/t/centrifuge-maker-trust-structure-progress-update-dec-2021/12188",
                        "https://forum.makerdao.com/t/consultation-poll-centrifuge-global-debt-ceiling-cap/11619",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-11-18/11713",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/54",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-4th-november-11th/11591"
                    ],
                    "GPT-summary": "The post is an explanation of Centrifuge's progress with Maker and their proposal to scale Centrifuge Pools legally and credit-wise. The author also discusses the Centrifuge Arranger for the Benefit of MakerDAO and proposes a plan to cap existing pools at a debt ceiling of $20M each. The post seeks feedback from the Maker community and emphasizes the importance of collaboration and transparency.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.665034138655463
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "7",
                    "time": "11/11/2021-20:16:47",
                    "content": "Thank you for writing this post @roollie and @spin and thank you for putting MakerDAO first. These are very important improvements that you are proposing, Flip Flop Flap Delegate supports this proposal to bring in Professional Trustees (plural, not singular) and admire that you have a thorough understanding that this legal structure will have iterations–as we are All united in the mission to onboard Real World Assets diligently via a DST structure, when applicable. We can’t even began to tell you how many Sustainable and Socially Responsible RWA companies we have met while at the Conferences in Lisbon. Protocols ranging from South America to Asia, RWA growth via blockchains will be explosive. We thank you for proposing the Centrifuge Arranger and we are fully confident that Centrifuge, 6S, MD Irradiance, Monetalis and many others, will always put MakerDAO first. Thanks again, and we look forward to witnessing the development of this commitment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.554545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#3",
                    "likes": "0",
                    "time": "12/11/2021-03:59:53",
                    "content": "Thanks for the feedback @ElProgreso! Overall we would love to get an indication by stakeholders on the points outlined in last paragraph (Next Steps) before we move ahead to formally get feedback from the DAO in a signal request. Hearing a few more opinions can help us refine these and inform content of the signal request. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#4",
                    "likes": "4",
                    "time": "12/11/2021-04:55:49",
                    "content": "Echoing @flipflopflapdelegate. Thanks @spin and @roollie and the Centrifuge team. We appreciate the effort you’re putting in and the commitment to adapt to a new phase in the interaction with the DAO. Centrifuge and its network of counterparties were among the starters (along with 6s and RWA Co) to give us a “kick in the butt” to get RWA out of the ground. There is a recognition of that fact. While we understand that the changes to an “arranger” model can be somewhat overwhelming for the team and your partners, it’s about time the DAO prepares for scaling. We need to have the appropriate building foundation for that. Keep up the commitment and the DAO will also play its role for the fulfilling of RWA progress. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.670454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/roollie",
                    "index": "#5",
                    "likes": "0",
                    "time": "15/11/2021-21:27:24",
                    "content": "Thanks for the feedback @williamr. I believe the Centrifuge team is up for the challenge, and will love to scale together with the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "15/02/2022-03:28:01",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}