{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/how-to-improve-general-public-perception-of-dai-robustness-and-enhance-the-tools-of-makerdao-foundation-to-make-new-proposals/7914",
            "title": "How to improve general public Perception of DAI robustness and enhance the tools of MakerDAO foundation To make new proposals ",
            "index": 7914,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Ildefons_Magrans",
                    "index": "#1",
                    "likes": "1",
                    "time": "08/05/2021-18:28:05",
                    "content": "~30% respondents “feel” like it is possible a coordinated action on MKR to perturbate the value of DAI (reddit poll). Even if the mechanism is not identified, this possibility may be a factor to deter some users from using DAI. I think this could be alleviated by explaining better the interplay between MKR, DAI and the rest of the crypto market ecosystem. In practice, there are many scenarios that could be simulated using multi-agent simulations. The result of the many scenarios could be published and peer reviewed to demonstrate that DAI is resilient to certain scenarios and not resilient to other scenarios. This work could also help MakerDAO foundation to make more informed proposals. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4940476190476195
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/05/2021-18:44:37",
                    "content": "So I don’t want to dismiss this out of hand, but Reddit isn’t where I’d go for feedback. Their users are not our target customer and polls there are 100% worthless by virtue of being self selecting. I also don’t really follow what you said after saying there was a Reddit poll where 2-to-1 people apparently said they do trust DAI? I’d still be interested in a link to just see it, though. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ildefons_Magrans",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/05/2021-18:47:54",
                    "content": "   reddit   r/MakerDAO - Can Dai stability be perturbed by coordinated action? 0 votes and 6 comments so far on Reddit      ",
                    "links": [
                        "https://www.reddit.com/r/MakerDAO/comments/n6ce10/can_dai_stability_be_perturbed_by_coordinated/?utm_medium=android_app&utm_source=share"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#4",
                    "likes": "0",
                    "time": "08/05/2021-18:52:34",
                    "content": "Thanks for the link. Leaving aside the fact that Robinhood traders don’t know how to vote with MKR, does RH even let you buy MKR? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#5",
                    "likes": "1",
                    "time": "08/05/2021-18:54:20",
                    "content": "    Ildefons_Magrans:  ~30% respondents “feel” like it is possible a coordinated action on MKR to perturbate the value of DAI (reddit poll). Even if the mechanism is not identified, this possibility may be a factor to deter some users from using DAI. I think this could be alleviated by explaining better the interplay between MKR, DAI and the rest of the crypto market ecosystem. In practice, there are many scenarios that could be simulated using multi-agent simulations. The result of the many scenarios could be published and peer reviewed to demonstrate that DAI is resilient to certain scenarios and not resilient to other scenarios. This work could also help MakerDAO foundation to make more informed proposals.   The MakerDAO Foundation no longer exists, so perhaps that is left to some UC on the risk team. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.344642857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ildefons_Magrans",
                    "index": "#6",
                    "likes": "0",
                    "time": "08/05/2021-19:34:18",
                    "content": "How can I get in touch with the risk team? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "0",
                    "time": "08/05/2021-20:21:36",
                    "content": "Do you have a specific concern? Your poll is about whether traders on RH can buy up MKR and then… ??? … thereby wrecking DAI. I’m fairly certain you can’t even buy MKR on Robinhood ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#8",
                    "likes": "1",
                    "time": "08/05/2021-20:25:05",
                    "content": "    Ildefons_Magrans:  How can I get in touch with the risk team?   Thas it https://forum.makerdao.com/g/Risk-Core-Unit ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ildefons_Magrans",
                    "index": "#9",
                    "likes": "0",
                    "time": "08/05/2021-21:12:16",
                    "content": "RH traders is just a place holder/example to formulate a more general problem ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ildefons_Magrans",
                    "index": "#10",
                    "likes": "0",
                    "time": "08/05/2021-21:15:16",
                    "content": "So, what the risk team think about working towards a peer reviewed publication mentioned in my post? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#11",
                    "likes": "0",
                    "time": "08/05/2021-21:17:35",
                    "content": "I would not know how to answer you because I do not belong to that UC, but you could tag them so they can see this post, there in the link that I give you you can see their users. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#12",
                    "likes": "1",
                    "time": "08/05/2021-21:26:11",
                    "content": "So I guess if you’re thinking about governance attacks, around 30% of outstanding MKR sit in four wallets (excluding Aave). Also, the DAO already has some initiatives underway to lessen the general danger of rogue MKR holders posing a threat to the system. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#13",
                    "likes": "1",
                    "time": "08/05/2021-22:04:52",
                    "content": "The main risk I can see, it is a high spike in the MKR price. I think we are all mentally ready for it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.877777777777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ildefons_Magrans",
                    "index": "#14",
                    "likes": "0",
                    "time": "08/05/2021-22:18:03",
                    "content": "Dear Risk Core Unit, My question can be rephrased as how are proposals evaluated before becoming a proposal ready for voting. For instance, if a new proposal emerges to change the burning logic, or any other logic involving MKR or DAI, how are the expected short/mid/long term effects of this new logic evaluated. Is this evaluation based on a qualitative analysis by the expert knowledge of the core team members? or maybe are there in place simulation tools able to simulate the effect of the changes under different scenarios? If you have simulation tools, is it possible to know more about this simulation infrastructure? Thank you very much Ildefons ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.889876033057852
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#15",
                    "likes": "1",
                    "time": "08/05/2021-22:26:52",
                    "content": "Ah! If you want to learn about the governance cycle and process, there’s a Governance section in the forum. I promise you it’s so unwieldy and cumbersome no marauding day traders would ever be able to use it! That said, it’s not impossible, but there are some things underway to further lower the likelihood of what you describe ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.597222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#16",
                    "likes": "1",
                    "time": "09/05/2021-14:00:40",
                    "content": "I’ll do you a favor and tag them for you. @Primoz @williamr @monet-supply @indy @jernejml @rema and @dmitri.z They will be able to answer your questions about it, let them read and they can answer you, they are a highly qualified team. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.65
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#17",
                    "likes": "0",
                    "time": "08/08/2021-20:01:30",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}