{
    "poll_list": [
        {
            "title": "Onboarding PAX Peg Stability Module - August 16, 2021",
            "index": "9683",
            "option": "Yes",
            "supporting_mkr": "12,975",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/create-a-fei-psm/10583",
            "title": "Create a FEI PSM ",
            "index": 10583,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "psm",
                "fei"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/bpm6867",
                    "index": "#1",
                    "likes": "15",
                    "time": "29/09/2021-23:03:09",
                    "content": "Summary I am a core contributor at Fei Protocol and would like to initiate a community discussion on creating a FEI PSM to further diversify DAI collateral with the addition of a decentralized USD stablecoin. We have discussed this initiative with Maker Growth and Risk teams, and are inviting feedback from the Maker community to help us move it forward. At present, DAI is 26.7% collateralized by USDC and 50.8% generated by USDC, which creates a substantial regulatory risk in the Maker protocol. To move forward confidently, DeFi must strive to be decentralized and permissionless. Since it would be beneficial for Maker to reduce the existing USDC exposure, we believe FEI is a safe and decentralized stablecoin to collateralize DAI. FEI’s strength is based on its liquidity and decentralized collateral base. In addition to helping stabilize the price between FEI and DAI, some use cases of a FEI PSM include the Fei DAO utilizing the PSM to market make FEI-DAI. For example, our DAO could use FEI to mint DAI, and provide additional liquidity to the existing Gelato UniV3 FEI-DAI pair, or other platforms like Curve and/or Balancer. Currently, Fei’s Protocol Controlled Value (PCV), is backed by all decentralized assets, including: ETH (81.64%), stETH (9.3%), DAI (6.3%), RAI (1.2%), DPI (1.1%), INDEX (.46%) As part of our proposed partnership with Maker, the Fei DAO intends to use the PSM to diversify the PCV further. It has already opened a bonding curve for 50m in DAI supplied to Compound, with pending proposals about expanding it to up to 150m DAI. Real time FEI analytics can be viewed here and here.  7DE_xJVxv34B0Dr_ZkGDrh7tBIlWRfQOseKG3BFDOEZx1to5D9on_iGpC9ux57usfIfVMkLOwY5OXnt5pf9pKy8o0Q_sMQGTz1Gm6MY220D8gaHBximuFYBq0IXn7zPJm2048×960 78.1 KB  In an upcoming FIP (Fei Improvement Proposal), the community will also vote on disabling the burner role. Our DAO is eager to work with Maker, and use the PSM, helping grow DAI. We also had a great call with the Maker Oracle team @NikKunkel , and plan to use their oracles. Motivation Stablecoins play an important and ever growing role within the DeFi ecosystem, and community sentiment shows more concerns due to centralization and censorship of the largest stablecoins. FEI is one of the most scalable and decentralized stablecoin in DeFi. Use of FEI in the PSM would help reduce reliance on centralized assets, while providing a highly stable and growing diversification asset. Adding FEI PSM would also help reinforce DAI’s decentralization ethos. Specification / Proposal Details The key components of the proposal are listed below. The proposal for the debt ceiling is based on a previous Maker Proposal, per a discussion with @monet-supply , which starts conservatively with plans to increase over time. #1 Add FEI Support to Maker PSM  Debt Ceiling: $125M (25% of total circulating supply) Fee in (tin): 10bps Fee out (tout): 0bps  ",
                    "links": [
                        "https://community-development.makerdao.com/en/learn/governance/module-psm/",
                        "https://daistats.com/#/overview",
                        "https://www.sorbet.finance/#/pools/0x3D1556e84783672f2a3bd187a592520291442539",
                        "https://app.fei.money/analytics",
                        "https://www.withtally.com/governance/fei/proposal/13",
                        "https://www.withtally.com/governance/fei/proposal/21",
                        "https://dune.xyz/storm/FEI-Dex-Activity",
                        "https://dune.xyz/storm/fei_bonding_curves",
                        "https://forum.makerdao.com/t/create-a-pax-psm/9683",
                        "https://forum.makerdao.com/t/maker-relay-ep-65/10697",
                        "https://forum.makerdao.com/t/is-maker-protocol-running-deficit/14741/3",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-24th-30th/10595",
                        "https://forum.makerdao.com/t/maker-relay-ep-65-en-espanol/10784"
                    ],
                    "GPT-summary": "The author is proposing the creation of a FEI PSM to diversify DAI collateral with the addition of a decentralized USD stablecoin. The proposal is aimed at reducing the regulatory risk in the Maker protocol and reinforcing DAI's decentralization ethos. The author has discussed the initiative with Maker Growth and Risk teams and is inviting feedback from the Maker community. The proposal includes adding FEI support to Maker PSM with a debt ceiling of $125M and a fee in of 10bps and a fee out of 0bps.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.650925925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "29/09/2021-23:43:31",
                    "content": "How do you envision the 125M DC gaining traction? Will you incentivize folks by rewarding them TRIBE tokens by using the FEI/DAI PSM? Trying to get an idea of how the DC will be filled (sorry if you described it above and I missed it — on the road and I  skimmed thru it quickly) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.733333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "8",
                    "time": "30/09/2021-01:05:40",
                    "content": "Let me preface with a statement that I do not have a position on this yet. Couple questions:   Given that FEI isn’t always exactly at $1 USD, what makes this appropriate for a PSM rather than a new form of collateral? Maybe this is good for collecting arbitrage fees on our side, though, as long as it’s a narrow band and in both directions?   Building off number 1, the market cap is (for the moment) fairly light. I see how we can stabilize your peg, but between slight deviations and smaller size, has anyone on your side or ours tried to estimate whether this can move (or not move!) the peg for DAI?   There’s some DAI backing FEI. How do we account for this? Do we need to get FEI to agree to some kind of covenant not to let DAI exceed a percentage of their own collateral? Open questions and would love to hear thoughts from anyone on either side.   Given the trajectory of USDP, would FEI be upset if 1/3 or more of its issuance ended up inside our PSM? I can see that as a feature or a bug for you, and just curious what y’all think of it.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.223232323232323
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#4",
                    "likes": "5",
                    "time": "30/09/2021-04:57:01",
                    "content": "Thanks for starting the discussion but I believe this would be not make much sense at all. When we introduce a PSM, we’re assuming that the token in the PSM is more likely to stay pegged to $1 than DAI. With USDC and PAX, this is reasonable because those tokens can always be exchanged with a centralized entity for $1 all the time. This is not the case with FEI. Secondly, while we are exposed more heavily to USDC than we’d like, exposing ourselves to another stablecoin should only be done if that stablecoin’s ability to stay pegged, not get blacklisted, etc. is at least comparable to USDC. Diversification is good but only when the alternative option is as good and secure as USDC. Unfortunately, FEI’s mechanism has not been tested sufficiently and the protocol is too new to make this claim. Here’s FEI’s entire history (six months).  Screenshot 2021-09-30 at 12.45.42 PM1396×848 50.4 KB  I find the risk too high to introduce a FEI PSM with the data we have so far and what we know about FEI’s mechanism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 5.699090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bpm6867",
                    "index": "#5",
                    "likes": "4",
                    "time": "30/09/2021-05:34:30",
                    "content": "Some use cases of a FEI PSM include the Fei DAO utilizing the PSM to market make FEI-DAI. For example, our DAO could use FEI to mint DAI, and provide additional liquidity to the existing Gelato UniV3 FEI-DAI pair , or other platforms like Curve and/or Balancer. I am confident that the Tribe community would be open to providing TRIBE incentives. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bpm6867",
                    "index": "#6",
                    "likes": "2",
                    "time": "30/09/2021-05:36:01",
                    "content": "Hello @PaperImperium thank you for your reply and relevant questions.   FEI clearly has a weaker peg, but has a more decentralized collateral base and desire to leverage the PSM. The benefits include: trading fees, more decentralized collateral and growing DAI supply   Can’t hurt DAI peg due to USDC PSM and relatively small size   Has similar characteristics to D3M, I’m sure FEI holders would be open to a covenant   No, PSM usage is great for us   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.738636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/joey",
                    "index": "#7",
                    "likes": "6",
                    "time": "30/09/2021-06:37:27",
                    "content": "Echoing what Bri said above, there are some pretty clear synergies if the Maker community is open to this addition!     AstronautThis:  I find the risk too high to introduce a FEI PSM with the data we have so far and what we know about FEI’s mechanism.   IF MakerDAO’s goal is to only add assets with strictly greater than or equal to USDC in terms of peg and Lindy that would invalidate pretty much all other decentralized options. Totally respect that viewpoint if that is the case, and FEI would not make much sense to add. However, I want to clarify some things about the data to enhance the argument as to why FEI is both secure enough and brings meaningful value to MakerDAO.  The v1 peg mechanism did not work as you can see from the chart. We migrated to effectively a 1:1 redeemability model in June, with a current global collateralization ratio of over 300%. This has led to the tight peg seen recently. Impressive considering the almost exclusively volatile-asset collateral base (no Fei-equivalent to a PSM) Fei V2 will be announced soon and released in the coming months, further improving on the existing mechanisms and managing tail risk. MakerDAO and. DAI can play a huge role in this upgrade. Fei provides trading fees, decentralization, and DAI liquidity for the relatively small risk incurred by the capped exposure.  Basically MakerDAO would be helping the FEI peg plus issuing a line of credit in exchange for these benefits. I’m personally excited about the potential here and think FEI would be a logical add for MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.677832512315271
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "4",
                    "time": "30/09/2021-09:46:44",
                    "content": "    joey:  The v1 peg mechanism did not work as you can see from the chart. We migrated to effectively a 1:1 redeemability model in June   How does this model work in practice? Are there docs available? Why is this only effectively 1:1 redeemability?     joey:  Fei V2 will be announced soon and released in the coming months, further improving on the existing mechanisms and managing tail risk.   How will V2 related to V1? Is the token changing? The stabilization mechanisms?     bpm6867:  Fee out (tout): 0bps   Assuming FEI does have a robust 1:1 redemption mechanism that allows it to keep its price, it might be worth increasing the out fee in order to keep it in the protocol given that we need (decentrally backed) supply.     bpm6867:  Currently, Fei’s Protocol Controlled Value (PCV), is backed by all decentralized assets, including: ETH (81.64%), stETH (9.3%), DAI (6.3%), RAI (1.2%), DPI (1.1%), INDEX (.46%)   Feels like guarantees as to the backing in the future would be important as well. Will FEI always be overcollateralized? Would DAI be kept below some percentage? What other assets would you consider adding? How does FEI recover from an event that leaves it less than 100% collateralized? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.836805555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#9",
                    "likes": "10",
                    "time": "30/09/2021-10:09:22",
                    "content": "PS: I hold some $TRIBE. Having the other protocol stablecoin on our balance sheet is kind of lending to each other at ~0% cost and creating a counterparty risk. Therefore having a 125M FEI-PSM is extending a $125M credit exposure to FEI. If we abstract the details, both protocols can provide such a facility with a Uniswap V3 pool. You have 52M of $DAI and an infinite amount of $FEI for that. We have an infinite amount of $DAI. the real question is who should do it and who really needs it? I can see why having a tight peg is of strategic importance for FEI. But it’s not really a problem for MakerDAO. Moreover, you have all the tools to make it happen. You could even do a 1:1 exchange rate (as you can use the DAI on Aave Compound to generate fees). 125M is quite a big credit exposure (2.5x our equity buffer) to a new protocol that is quite leveraged and yet it does not achieve much on our side in terms of reducing the USDC-PSM. On the other hand, you can easily have a 125M credit exposure to Maker (and it would provide you 50% of your stablecoin liquidity). You can even profit by putting it to work on money markets. ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-30th-october-7th/10837"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.429279054279055
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#10",
                    "likes": "1",
                    "time": "30/09/2021-10:23:04",
                    "content": "I guess I’m just not clear why this would be appropriate for a PSM rather than a more traditional crypto collateral. I’ve not yet had my coffee, so maybe I’m missing something obvious? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "7",
                    "time": "30/09/2021-10:28:12",
                    "content": "    PaperImperium:  I guess I’m just not clear why this would be appropriate for a PSM rather than a more traditional crypto collateral.   There would be no demand for it as a regular collateral. At least not FEI by itself. It’s meant to be stable, so there is no incentive for anyone to lever up on it. Like, depending on the LR ratio you could do something similar to what we did with USDC initially - but at that point the risks are very similar to the PSM and the PSM is a neater mechanism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.361111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#12",
                    "likes": "2",
                    "time": "30/09/2021-10:36:33",
                    "content": "Thank you. Correct, why would someone lever with a stablecoin for another stablecoin except to yield farm. Time for that coffee… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "1",
                    "time": "30/09/2021-11:01:24",
                    "content": "    SebVentures:  But it’s not really a problem for MakerDAO   True. I can tell you with or without DAI the FEI community will expand their bonding curve via RAI, LUSD, etc., per the community proposals I’ve come across. So, lets see if the Maker community cares, or not. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#14",
                    "likes": "1",
                    "time": "30/09/2021-11:53:29",
                    "content": "Although I like the project, it is too early to talk about making an PSM for a project that is still very new. It’s a risk, and as Paper says here, it’s so new that I see its only use in.     PaperImperium:  Thank you. Correct, why would someone lever with a stablecoin for another stablecoin except to yield farm. Time for that coffee…   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.517045454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#15",
                    "likes": "3",
                    "time": "30/09/2021-13:43:24",
                    "content": "    joey:  I’m personally excited about the potential here and think FEI would be a logical add for MakerDAO.   You may be right and it certainly is exciting but even if I was completely agnostic to the protocol behind FEI itself, the age and corresponding untestedness of it still makes it far too high a risk. My personal opinion is that FEI needs significantly more time to mature before it can be used as collateral that backs DAI whether it be through a PSM or a traditional vault. I encourage you to start a poll or even a signal request, if you’d like to hear the broader community’s opinion on a specific question. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.632397959183674
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#16",
                    "likes": "2",
                    "time": "30/09/2021-13:57:40",
                    "content": "Can you expand on “will expand their bonding curve via…”? I don’t know much about the FEI mechanics and having some info here relevant to Maker and this PSM proposal would probably enrich the discussion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#17",
                    "likes": "2",
                    "time": "30/09/2021-14:28:37",
                    "content": "@swakya FIP28 will provide an idea of the Revamped FEI Bonding Curve: FIP-27: Revamp FEI Bonding Curves - Proposals - Tribe ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#18",
                    "likes": "3",
                    "time": "30/09/2021-16:19:50",
                    "content": "My issues with FEI PSM were mostly pointed out by others already, but they are;  FEI PSM would help stabilize FEI more than dai, as dai has a premium issue (more demand than supply), while FEI has a discount issue (more supply than demand). In instances of large market drawdown demand for dai would further increase as vaults want to repay their debt - in such cases reliable PSMs are crucial to match the sudden demand for dai and prevent an even larger dai premium. Since FEI itself is vulnerable to large market drawdowns as it can become undercollateralized, I don’t think it is suitable as a PSM asset.  I also want to point out that the statements made in this post are contradicting each other, at least from how I see it. USDC backing dai presents a substantial regulatory risk, and to move forward confidently, DeFi must be decentralized and permissionless; and decentralized stablecoin FEI is going to reduce it, while FEI itself wants to increase its exposure to dai and therefore increase its own exposure to centralized assets. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.931547619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#19",
                    "likes": "2",
                    "time": "30/09/2021-17:08:01",
                    "content": "Are there alternatives to a full blown PSM? Maybe one with a low DC? If FEI deviates too hard from peg a huge PSM would not be great for Dai, but smaller scale collaboration between the protocols would still be nice. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.3273809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/joey",
                    "index": "#20",
                    "likes": "7",
                    "time": "30/09/2021-18:36:10",
                    "content": "I’m glad to see so much engagement from the Maker community because adding FEI is not strictly positive, its more of a give-and-take arrangement in terms of the benefits to each side. I largely agree that this integration is early, and given our upcoming v2 we will focus on that rollout and come back to MakerDAO after a successful launch in a few months. I’ll go ahead and address many of your concerns here:  Adding FEI to the PSM will stabilize FEI not DAI:  This is not in dispute at all. By adding a non-zero spread MakerDAO would profit off of FEI volatility in exchange for this extra stabilization. Framing this as a “peg stability benefit” to MakerDAO is incorrect, even though the name is PSM.     LongForWisdom:  How does this model work in practice? Are there docs available? Why is this only effectively 1:1 redeemability?   We plan on announcing V2 very soon and updating our docs accordingly. FEI will be redeemable for PCV collateral with a spread (50bps in the case of ETH). This part of V2 is currently live on-chain.     LongForWisdom:  How will V2 related to V1? Is the token changing? The stabilization mechanisms?   The token is not changing, it is mostly an additive upgrade for managing the scenarios where PCV is undercollateralized and algorithmically rebalancing asset allocations.     LongForWisdom:  Assuming FEI does have a robust 1:1 redemption mechanism that allows it to keep its price, it might be worth increasing the out fee in order to keep it in the protocol given that we need (decentrally backed) supply.   This seems totally reasonable     LongForWisdom:  Feels like guarantees as to the backing in the future would be important as well. Will FEI always be overcollateralized? Would DAI be kept below some percentage? What other assets would you consider adding? How does FEI recover from an event that leaves it less than 100% collateralized?   FEI will always be collateralized over a governance controlled-target which will likely be 100% but could be slightly lower. DAI can be kept below a certain percentage. Any ERC20 is open to be added by TRIBE holders. PCV would algorithmically shift towards stablecoins as it gets closer to 100% collateralized, and if it gets under then TRIBE will inflate similar to MKR.     rema:  while FEI itself wants to increase its exposure to dai and therefore increase its own exposure to centralized assets.   To be clear, Maker adding FEI would both decrease the centralization of DAI and increase the centralization of FEI. I see this as the clearest mirror to FEI gaining additional stability at the expense of additional risk for MakerDAO. The Fei community is actively deepening its usage of LUSD and RAI as collateral. DAI is currently the most liquid and trusted decentralized stablecoin, but other alternatives are growing fast.     swakya:  Are there alternatives to a full blown PSM?   A full-blown PSM would make the most sense given that FEI is a stablecoin and demand would be almost 0 for a normal vault.     AstronautThis:  I encourage you to start a poll or even a signal request, if you’d like to hear the broader community’s opinion on a specific question.   We will aim to get a broader opinion as we roll out V2 to see if the Maker community has any interest at that time. Thanks everyone for the engagement so far! Truly impressed by the thoughtful and diverse perspectives being brought to the table ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.038949013949014
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#21",
                    "likes": "2",
                    "time": "01/10/2021-11:52:24",
                    "content": "I like this proposal but I would change the total FEI exposure to less than 20M, same for other algo stablecoins (the ones that kinda work), I want them in the PSM with a low debt ceiling. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.708333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#22",
                    "likes": "1",
                    "time": "01/10/2021-12:45:57",
                    "content": "I’m not up on FEI’s mechanisms, but is there a reason any not to just park a bunch of your ETH in a vault, generate DAI, and use that to manage your own PSM, or even a pool on Uniswap and Sushiswap? Or use the DAI you already hold to create a PSM? I guess I just don’t see how this can either 1) support the peg for DAI, or 2) generate fees. If you really wanted Maker to do this (our approval alone seems likely to help stabilize FEI’s peg some), maybe there can be some kind of regular payments or additional collateral to cover those times that FEI is under peg to $1 USD? Trying to think outside the box, and I reserve the right for the above statements to be stupid for some obvious reason. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.442857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#23",
                    "likes": "1",
                    "time": "01/10/2021-13:07:27",
                    "content": "I agree with this. It seems FEI would benefit more from deploying a DAI PSM than we would benefit from deploying a FEI PSM ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#24",
                    "likes": "4",
                    "time": "01/10/2021-14:50:15",
                    "content": "Just a quick note: the fact that FEI would benefit more than Maker is not important; you can have mutually beneficial arrangements that are not 100% symmetric yet everyone is happy. The main question is the risk/reward balance for Maker. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#25",
                    "likes": "2",
                    "time": "01/10/2021-15:05:48",
                    "content": "You’re quite right I think I phrased what I meant badly. More accurately: “The risks in terms of FEI peg instability and the distraction of resources from other more pressing (and more profitable) tasks for MakerDao likely outweigh any benefits at this time. For FEI, the benefits of implementing a Dai PSM likely outweigh the risks and this may be a better option for them to explore” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.422619047619048
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brigith238",
                    "index": "#26",
                    "likes": "4",
                    "time": "26/03/2022-18:44:57",
                    "content": " image800×435 36.4 KB  Hi, I’m new at the forum, I have DeFi basic knowledge, I’ve notice that this conversation got cold, like some other things that I have read. Talking about the price, I see FEI on a stable form, with its variations as every stablecoin, as a reference on the State of DAI we see DAI $0.95 and sometimes $1.05.  image800×373 43.8 KB  We see FEI on a more mature form. Now it has a $730 million TLV, where DAI has a  good participation there. It would be interesting if maker took a step ahead an integrates it to its PSM, since FEI has its own PSM to DAI and it has serve in a great way.         ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.305681818181819
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#27",
                    "likes": "4",
                    "time": "26/03/2022-22:32:40",
                    "content": "Very “stable” that it even went below $0.9   e4059b15-45a4-47d3-8cd1-0e400302b5151763×1175 175 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#28",
                    "likes": "1",
                    "time": "27/03/2022-17:25:21",
                    "content": "I like that stability  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#29",
                    "likes": "1",
                    "time": "29/03/2022-18:16:31",
                    "content": " A few premium trades above peg this week.       State of Dai: March 22 - 28, 2022 Updates   [image]  Hi everyone, thanks for checking out the State of Dai. Now separate from the Weekly Relay with the objective to scale and improve all the information you need for your Dai escapades!   The public PDF version is available here. [Peg]   A few premium trades above peg this week.  [7-Day Dai stats]   Max and min clock in at $1.15 and $0.81. Not a surprise by now, but Uniswap V2 was the primary source pushing peg variance. Meeting the sizeable market for arbitrage via semi-illiquid pools…        ",
                    "links": [
                        "https://pdfhost.io/v/iRxopML8._State_of_Dai__March_22_28_2022"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#30",
                    "likes": "1",
                    "time": "29/03/2022-18:20:25",
                    "content": "I almost feel like Maker protocol running a arb bot that uses PSM will generate enough revenue and also help to stablize the Peg more ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#31",
                    "likes": "0",
                    "time": "29/03/2022-18:30:35",
                    "content": "Most of the peg variance is uniswap v2 FWIW on ETH/DAI pair.     Doo_StableLab:  I almost feel like Maker protocol running a arb bot that uses PSM will generate enough revenue and also help to stablize the Peg more    ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/joey",
                    "index": "#32",
                    "likes": "8",
                    "time": "03/04/2022-21:57:06",
                    "content": "Chiming in here, I think Tribe and Maker potential synergies are stronger than ever, and FEI has continued to demonstrate a tighter and tighter peg. I’d imagine direct Fei Protocol demand for a DAI line of credit could stretch towards 9 figures. Let us know what kinds of analysis would be good here to evaluate ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#33",
                    "likes": "6",
                    "time": "03/04/2022-23:18:46",
                    "content": "To be honest, some of Fei leaders have been pretty friendly to Maker so I take back some of my sarcasm. But I do think if there is such PSM with FEI, it will need to have some fees or else, Maker is not catching risk premium at all   twitter.com    Joey 💚’s ERC-4626 @joey__santoro  Maker fud is completely losing the plot  \"Lets build an even tighter dependence on USDC/USDT\" 🤮  Mad respect for@stablekwon@samkazemian but I disagree  The Tribe will continue to stack $ETH, and FEI will pair with decentralized stables preferentially   7:29 PM - 2 Apr 2022           490                29            ",
                    "links": [
                        "https://twitter.com/joey__santoro/status/1510338537291280386?s=20&t=mzb6SHQqfusU_I5yXDxL9A",
                        "https://twitter.com/joey__santoro/status/1510338537291280386?s=20&t=mzb6SHQqfusU_I5yXDxL9A",
                        "https://twitter.com/stablekwon",
                        "https://twitter.com/samkazemian",
                        "https://twitter.com/joey__santoro/status/1510338537291280386?s=20&t=mzb6SHQqfusU_I5yXDxL9A"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brigith238",
                    "index": "#34",
                    "likes": "3",
                    "time": "04/04/2022-13:11:14",
                    "content": "I think your point of view is very positive, I would like this thread to be taken more seriously. Yes, it would be important for maker to make a profit on this and be able to reduce the possible risks associated, maker and fei can work hand in hand and are valuable assets in an increasingly centralized world. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1351010101010095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#35",
                    "likes": "7",
                    "time": "04/04/2022-14:00:51",
                    "content": "For Maker folks, allowing a line of credit between stablecoin protocol was discussed here.     Intra DeFi stablecoin issuers money-market Strategic Finance       I’ve recently published a new piece of research on a decentralized clearinghouse for stablecoins. I will synthesize it and present the link with MakerDAO in the following of the post.   Introducing the ClearingDAO The idea, codenamed ClearingDAO, is solving 2 important issues:   Providing price equivalence to all major DeFi stablecoins ($1). Moving the supply/demand imbalance from the price to an interest rate stablecoins issuers will pay to each other.  The idea is quite simple, a PSM-like inte…     With an exemple being Fei Protocol   image885×607 12.9 KB  Moreover, we could use the ALM Framework in the work to assess the financial risk of Fei Protocol. From what I know Fei Protocol is significantly capitalized and it could be a start of DAO money market lending. Happy to hear thoughts from others. ",
                    "links": [
                        "https://medium.com/@sebastien.derivaux/introducing-clearingdao-a-decentralized-clearinghouse-for-stablecoins-b5d164c00c2c",
                        "https://forum.makerdao.com/t/alm-framework-for-makerdao/12994"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.74948347107438
                },
                {
                    "author_link": "https://forum.makerdao.com/u/joey",
                    "index": "#36",
                    "likes": "7",
                    "time": "04/04/2022-16:54:10",
                    "content": "    Doo_StableLab:  But I do think if there is such PSM with FEI, it will need to have some fees or else, Maker is not catching risk premium at all   Makes total sense to me. Another option could be a PSM against a yield bearing version of FEI such that MakerDAO is earning ongoing yield in addition to swap fees. Fei is investigating a native savings rate inspired by the DSR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#37",
                    "likes": "4",
                    "time": "04/04/2022-17:21:42",
                    "content": "I like the idea of Maker and FEI working hand in hand, as @brigith238  said, this unity of pillars of decentralization is needed in a more centralized world. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#38",
                    "likes": "0",
                    "time": "30/04/2022-12:14:19",
                    "content": "I heard the lost amount is around 80 million. Would it impact its peg?  twitter.com    Beosin @Beosin_com  ⚡️Various Rari Fuse pools of@feiprotocol were exploited for over 28,380 $ETH. (-$80M) Detail analysis Will come soon Beosin team‼️ twitter.com/beosinalert/st…   Beosin Alert @BeosinAlert  Various Rari Fuse pools of @feiprotocol were exploited for over 28,380 $ETH. Exploiter address: 0x6162759eDAd730152F0dF8115c698a42E666157F https://t.co/dkUCDKFNHU    11:14 AM - 30 Apr 2022       ",
                    "links": [
                        "https://twitter.com/Beosin_com/status/1520360903627386881?s=20&t=NfhSVSyst4kLV01cXTWBFw",
                        "https://twitter.com/Beosin_com/status/1520360903627386881?s=20&t=NfhSVSyst4kLV01cXTWBFw",
                        "https://twitter.com/feiprotocol",
                        "https://twitter.com/beosinalert/status/1520357578991185923",
                        "https://twitter.com/BeosinAlert/status/1520357578991185923",
                        "https://twitter.com/Beosin_com/status/1520360903627386881?s=20&t=NfhSVSyst4kLV01cXTWBFw"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#39",
                    "likes": "0",
                    "time": "30/04/2022-12:38:21",
                    "content": "According to Joey: “Fei protocol is technically separate from rari and remains well collateralized, so the fei peg should be safe” Fei peg still looks good. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#40",
                    "likes": "1",
                    "time": "30/04/2022-13:46:04",
                    "content": "I think the most positive thing to do is to wait and see how the news unfolds and the factual event is $80 million. Of course FEI has much more than that in circulation and backing, but it is good to wait. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.40909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#41",
                    "likes": "0",
                    "time": "02/05/2022-15:36:33",
                    "content": "I don’t think it’s smart to say that, when they offer 10 million in bounties for the hacker. It’s still their users’ funds that are compromised. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#42",
                    "likes": "1",
                    "time": "02/05/2022-20:32:54",
                    "content": "I think it’s very difficult to say anything smart at this situation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.9107142857142856
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/create-a-pax-psm/9683",
            "title": "Create a PAX PSM ",
            "index": 9683,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "psm"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/carlkvogel",
                    "index": "#1",
                    "likes": "26",
                    "time": "04/08/2021-14:56:42",
                    "content": "Summary I am a Senior Product Manager at Paxos and lead our DeFi efforts. We propose extending Paxos Standard’s [PAX] involvement in Maker through creating a PAX PSM to diversify DAI collateral and increase DAI trustworthiness.  We discussed this proposal with the Maker Growth team and welcome feedback from the community. DAI is 30% collateralized by USDC which creates a single point of failure in the Maker protocol. More than 60% of DAI is generated by USDC deposits. USDC has been coming under increasing regulatory and community pressure due to its treasury decisions; over 25% is non-government, third-party debt, which introduces liquidity, credit, and interest risk. Given it’s beneficial for Maker to reduce USDC exposure, we believe PAX is the safest and most practical stablecoin to collateralize DAI due to its liquidity, scale, transparency and regulation. PAX is 100% backed either by US dollars held in fully segregated, bankruptcy remote accounts at insured depository institutions or in short term government securities (i.e. US Treasury Bills). Monthly attestations which can be found on our website. Both Paxos and PAX are regulated by a prudential regulator, the NYDFS. This regulation makes PAX more secure in that we are better positioned in the event of potential US stablecoin regulations because PAX has a prudential regulator, unlike other leading stablecoins. As part of our proposed partnership with Maker, we plan to add DAI support on our platform, which means that Paxos Crypto Brokerage institutional clients (eg PayPal, Venmo, Revolut, etc) will be able to offer DAI to their end users. Motivation Stablecoins play an important role in DeFi, and the community is growing concerned that the lack of trustworthiness of the largest stablecoins creates substantial risk for the future growth of crypto. PAX is the most trustworthy stablecoin and its use in the PSM will increase the trustworthiness of DAI while simultaneously diversifying risk to any one token. Specification / Proposal Details Below are the key components of the proposal. The tin, tout, and debt ceiling suggestions are based on a prior Maker Proposal. The proposal’s motivation is to have other stablecoin tin be lower than USDC to incentivize diversification. However, we are open to widening the tin between USDC and other stablecoins, as 10bps may not be enough incentive for diversification. #1 Add PAX Support to Maker PSM  Debt Ceiling: $500M Fee in (tin): 10bps Fee out (tout): 0bps USDC tin: 20bps  #2 Add DAI Support to Paxos Platform By the end of Q1 2022 (if not sooner), Paxos will add DAI to the Paxos Platform, which unlocks the below user flows. We will focus first on DAI minting via PSM. We cannot contractually require any/all institutional clients (eg Revolut) to support DAI for their end users, but we can ensure DAI is an available stablecoin option.  User can swap supported fiat currencies for DAI using the PSM (if best market rate) User can custody DAI User can buy/sell crypto using DAI User can deposit/withdraw DAI  ",
                    "links": [
                        "https://www.paxos.com/pax/",
                        "https://community-development.makerdao.com/en/learn/governance/module-psm/",
                        "https://daistats.com/#/overview",
                        "https://www.paxos.com/a-regulated-stablecoin-means-having-a-regulator/",
                        "https://www.paxos.com/attestations/",
                        "https://www.theblockcrypto.com/linked/111948/yellen-pushes-us-regulators-to-act-quickly-on-stablecoins-during-working-group-meeting",
                        "https://www.paxos.com/crypto-brokerage/",
                        "https://forum.makerdao.com/t/signal-request-tin-tout-parameters-for-new-psms/8789",
                        "https://forum.makerdao.com/t/maker-relay-ep-58/9892",
                        "https://forum.makerdao.com/t/maker-relay-ep-57-en-espanol/9948",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-6th-12th/9823",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-153-thursday-august-5-17-00-utc/9671/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-57/9760",
                        "https://forum.makerdao.com/t/maker-governance-review-july-2021/9758",
                        "https://forum.makerdao.com/t/signal-request-onboard-paxg/13768/36",
                        "https://forum.makerdao.com/t/forum-at-a-glance-july-30th-august-5th/9708",
                        "https://forum.makerdao.com/t/growth-cu-weekly-update-july-30-august-5/9706",
                        "https://forum.makerdao.com/t/paxos-makerdao-partnership-usdp-psm/19469",
                        "https://forum.makerdao.com/t/paxg-collateral-onboarding-risk-evaluation/4833/18",
                        "https://forum.makerdao.com/t/informal-poll-curve-basepool-composition/15347",
                        "https://forum.makerdao.com/t/maker-relay-ep-60-en-espanol/10375",
                        "https://forum.makerdao.com/t/create-a-fei-psm/10583",
                        "https://forum.makerdao.com/t/maker-relay-ep-60/10082",
                        "https://forum.makerdao.com/t/maker-relay-ep-58-en-espanol/9949"
                    ],
                    "GPT-summary": "The post proposes extending Paxos Standard's involvement in Maker by creating a PAX PSM to diversify DAI collateral and increase DAI trustworthiness. The proposal suggests adding PAX support to Maker PSM and DAI support to Paxos Platform. The author explains the motivation behind the proposal and provides details of the proposal. The author welcomes feedback from the community and plans to collaborate with Maker. A 3rd party could give constructive criticism, extend to the proposal, ask questions, or collaborate with the author.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Community and engagement",
                        "Privacy, Security and risk management",
                        "Grants, Funding and resource allocation"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.917304421768708
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "6",
                    "time": "04/08/2021-15:38:39",
                    "content": "I will reserve detailed comments for after reading through a few times and thinking on the specifics, but I want to say that I am very excited about this potential partnership. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.859375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#3",
                    "likes": "4",
                    "time": "04/08/2021-16:02:54",
                    "content": "Hey @carlkvogel Welcome to the forum, excited that finally the pax PSM gets some traction. Regarding tin/tout: this will be up to MKR holders to decide but so far the community and PPGs like MOMC have been in favour for having a very favourable settings for it to support diversification Looking forward Tim ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "2",
                    "time": "04/08/2021-16:58:49",
                    "content": "This will undoubtedly enable DAI to position itself on the direct ramps to FIAT. DAI will certainly be better positioned, so I’m super excited about this proposal and activation of it! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.752604166666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "4",
                    "time": "04/08/2021-21:33:32",
                    "content": "@Growth-Core-Unit Congratulations and Great work negotiating this deal! You totally rock. Excited to see what else the Growth CU will bring to MakerDAO  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.291666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/carlkvogel",
                    "index": "#6",
                    "likes": "0",
                    "time": "05/08/2021-01:00:19",
                    "content": "Thanks @ultraschuppi!  Appreciate the welcome. Re/ favorable settings, would you propose expanding beyond 10bps? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "6",
                    "time": "05/08/2021-01:39:58",
                    "content": "    carlkvogel:  Re/ favorable settings, would you propose expanding beyond 10bps?   This proposed spread is already quite aggressive considering what the PSMs are for. Once we confirm there will be uptake with Paxos, then I could see us adopting a more aggressive spread (temporarily) in order to balance out our “foreign reserves.” But if we make the spread between the two PSMs quite large, that risks affecting our peg if both PSMs aren’t treated as interchangeable by the market for some reason. We definitely want to turn on the PAX PSM spigot, but can’t risk deviations in the peg by turning off the USDC spigot until we know arbitrageurs are ready to use them both agnostically. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.142857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tedh",
                    "index": "#8",
                    "likes": "0",
                    "time": "05/08/2021-18:14:46",
                    "content": "Very excited for a second PSM to allow arbitrage between stablecoins. One thing I’d like to explore would be potential causes of PAX to break its peg?  From what I gauge it looks very similar to USDC (so we’re depending on a single entity to hold the correct amount of physical currency/assets), but I would prefer to be up front about the risks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.346726190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#9",
                    "likes": "2",
                    "time": "07/08/2021-18:52:06",
                    "content": "How incredible, I would have never thought this day would come, good for maker and DAI, success to the team involved.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.166666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/carlkvogel",
                    "index": "#10",
                    "likes": "3",
                    "time": "09/08/2021-23:04:06",
                    "content": "Some thoughts on how PEG could be broken.   Reserves insufficient for Withdraws: In the event that a user could not withdraw USD because of insufficient reserves (eg tied up in illiquid or risky investments) then this would cause the token to break its peg. Note PAX is 100% backed by US Dollars or short term government securities so this will not happen.   Prolonged Operational Outage: In event that Paxos had an outage where users or market makers could not mint/burn PAX then the value of PAX could deviate. We have had to meet the reliability requirements of the largest financial institutions (eg PayPal, Bank of America) and also have manual processes in place to facilitate transactions if automated solutions fail.   Security Breach: If an entity breaches Paxos and illicitly minted PAX. However, in that event we have procedures to determine PAX token holders prior to attack and would take appropriate measures to ensure redemptions of the reserves could be enabled and/or seize the illegitimately minted PAX. Note Paxos has SOC I and SOC II certifications and has robust security protections / procedures.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#11",
                    "likes": "0",
                    "time": "10/08/2021-00:32:55",
                    "content": "We are literally armored in several respects for this PAX PSM. It would be interesting now to take it to a clear operation where these types of errors occur, although with USDC they did not occur I don’t think with PAX they did. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#12",
                    "likes": "1",
                    "time": "10/08/2021-01:19:23",
                    "content": "    Saludiego_201:  It would be interesting now to take it to a clear operation where these types of errors occur, although with USDC they did not occur I don’t think with PAX they did.   To be clear, this PSM (which I am 100% in favor of) reduces credit risk to Circle and also provides a powerful combination of the “next two” stablecoin issuers, but does zero to reduce risk of blacklisting. If our USDC is ordered to be frozen because of a subpoena, you can know that our PAX will be as well. This PSM should be thought of as a really powerful tool for growth and branding. Our main risk with USDC (blacklisting) is not actually reduced here. One last time, though, this is a really, really powerful proposal that I think Maker and Paxos should both get a lot of use out of. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.981481481481481
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#13",
                    "likes": "0",
                    "time": "10/08/2021-02:25:13",
                    "content": "It would be interesting to have a PSM with stable decentralized currencies, FEI or RAI… Of course, we know that they are very small and niche, and they need a long way to go. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#14",
                    "likes": "2",
                    "time": "11/08/2021-15:39:55",
                    "content": "    carlkvogel:  Security Breach: If an entity breaches Paxos and illicitly minted PAX. However, in that event we have procedures to determine PAX token holders prior to attack and would take appropriate measures to ensure redemptions of the reserves could be enabled and/or seize the illegitimately minted PAX. Note Paxos has SOC I and SOC II certifications and has robust security protections / procedures.   If PAX was maliciously minted and then sent into the PSM to mint DAI, what would be the recourse? I’m assuming the PAX that was exchanged to DAI would be revoked and Maker would lose money equal to the amount the exploiter deposited to the PSM. We’d have no way to get the DAI back from the exploiter in this case. (note this is probably the same as how it would work with USDC so doesn’t necessarily mean PAX has excess risk) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.15625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#15",
                    "likes": "7",
                    "time": "11/08/2021-17:03:00",
                    "content": "@Growth-Core-Unit wants to put this proposal up for a vote on Monday 16th as part of the weekly polls. We think this should be included in the weekly cycle asap to continue the process @ultraschuppi started weeks ago and give @carlkvogel and Paxos a quick response. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#16",
                    "likes": "7",
                    "time": "11/08/2021-17:22:26",
                    "content": "Just confirming that we’re fine with this as we feel it falls under MIP41c2 - Facilitator Governance Powers:  Facilitators have the power to propose weekly non-standard Governance Polls (defined in MIP16) related to their Core Units.  Given that we already had a signal request, and that this proposal is more or less in line with the output, feels like there is no reason to run another 2 week signal on this specifically. Poll will go up August 16th. Feel free to discuss any concerns about this process with me and @prose11. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.15
                },
                {
                    "author_link": "https://forum.makerdao.com/u/carlkvogel",
                    "index": "#17",
                    "likes": "10",
                    "time": "24/08/2021-22:42:43",
                    "content": "Hey everyone, just wanted to give a few small updates here:   Governance Poll has passed - thanks everyone for the support! Today Paxos announced we are updating the Paxos Standard (PAX) name to Pax Dollar (USDP), with the primary motivation creating extra transparency to users that PAX is a digital dollar pegged to USD. The only fields we are updating in the contract are NAME and SYMBOL - rest of contract is unchanged. In preparation for the PAX PSM launch, the Protocol Core Engineering Unit is implementing an initial $50M initial debt ceiling, which is within the surplus buffer limit. It is expected debt ceiling will be ramped to $500M after initial launch. CC @brianmcmichael   Thanks, and feel free to ping with any questions! ",
                    "links": [
                        "https://www.paxos.com/the-digital-dollar-that-always-equals-a-dollar-paxos-standard-pax-is-now-pax-dollar-usdp/",
                        "https://forum.makerdao.com/t/2021-august-20-exec-update-pax-psm-at-50m-this-week/9958",
                        "https://forum.makerdao.com/t/paxg-pax-gold-mip6-collateral-application/2584/14"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.285714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jenn",
                    "index": "#18",
                    "likes": "4",
                    "time": "23/05/2022-22:06:23",
                    "content": "I want to provide a quick update on the status of DAI being listed on Paxos infrastructure as they initially proposed last August as part of having USDP added to the PSM. We had been told DAI would be listed in Q1 2022 but that target has shifted two times and now the ETA is possibly end of Q3, yet with no guarantee. This would be (if end of Q3) 12 months after they proposed listing DAI as part of the PSM proposal. They have shared a number of reasons for the moving deadlines; 1. re-evaluating their internal engineering roadmap 2. waiting on regulatory guidance from the NYDFS (which they are regulated by) as there is more scrutiny on stablecoins in general since the UST debacle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.630952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#19",
                    "likes": "1",
                    "time": "24/05/2022-02:22:40",
                    "content": "It’s a pity, we have more interest in them and not them in us, it’s not a 50/50 relationship. I would like more commitment from PAX, it would be a great advantage on and off ramp for the crypto world. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                }
            ]
        }
    ],
    "group_index": "149"
}