{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/collateral-onboarding-call-28-synthetix-wednesday-february-24-21-00-utc/6650",
            "title": "Collateral Onboarding Call #28: Synthetix - Wednesday, February 24 21:00 UTC ",
            "index": 6650,
            "category": [
                "Collateral Onboarding",
                "Collateral Meetings"
            ],
            "tags": [
                "public-call",
                "pubcall-:-collateral"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "3",
                    "time": "18/02/2021-17:23:00",
                    "content": "image1280×720 42.4 KB Time in your local-timezone format: 2021-02-24T21:00:00Z Dial In Details Zoom call Passcode: ONBOARD Intro An open discussion where we discuss projects and potential assets for MCD, open for anyone to join. If you’d like to present, check out this thread. Agenda Intro by @JuanJuan  SNX - https://synthetix.io/  MIP6: [SNX] MIP6 Collateral Onboarding Application \"Synthetix is a decentralized platform on Ethereum for the creation of Synths: on-chain synthetic assets that track the value of real-world assets. Synthetix’s native token SNX is the primary method of collateralization, although minting sETH against ETH and sBTC against renBTC is also supported. SNX holders can stake it as collateral backing newly minted synths, which are freely tradeable ERC20 tokens. Instead of a predictable or DAO controlled interest rate for this loan against one’s own assets, the cost of minting synths is in the form of a debt obligation to back a fraction of all synths, which is proportional to the minted value.\"  Attn: @amyjung, @juan, @longforwisdom, @SebVentures , @charlesstlouis, @davidutro, @twblack88, @aburban90, @monet-supply, @psychonaut, @planet_x, @Haiku, @gustav_arentoft ",
                    "links": [
                        "https://forum.makerdao.com/t/collateral-calls-calling-all-projects/3715/",
                        "https://forum.makerdao.com/u/juanjuan",
                        "https://synthetix.io/",
                        "https://forum.makerdao.com/t/snx-mip6-collateral-onboarding-application/6497",
                        "https://forum.makerdao.com/t/maker-relay-ep-33/6694",
                        "https://forum.makerdao.com/t/maker-relay-ep-34-en-espanol/6815",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-feb-22-25-2021/6736",
                        "https://forum.makerdao.com/t/maker-relay-ep-33-en-espanol/6729",
                        "https://forum.makerdao.com/t/collateral-onboarding-calls-listing-2021-edition/6566",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/18",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-129-thursday-february-18-17-00-utc/6506/5",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-feb-13-18-2021/6648",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-130-thursday-february-25-17-00-utc/6651/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-35-en-espanol/6949"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.266528925619834
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#2",
                    "likes": "0",
                    "time": "21/02/2021-15:39:54",
                    "content": "[Reserved for notes] ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kevinwildenradt",
                    "index": "#4",
                    "likes": "2",
                    "time": "24/02/2021-22:48:25",
                    "content": "One more point to @Davidutro 's question regarding what mechanisms work counter to catastrophic SNX price declines in adversarial market conditions. As with most DEFI tokens, SNX price direction is generally positively correlated with the rest of the market. Market wide drawdowns generally boost trading activity, and decrease the debt owed by SNX stakers so long as open interest remains majority long. This means that while protocol long interest outweighs short interest, staking while the market is trending down results in stakers owing less debt than they originally minted alongside reaping temporarily elevated exchange rewards generated by increased trading activity during periods of high volatility. Similarly, less people choosing to stake results in higher proportional rewards for remaining stakers. This dynamic does run into limitations in in that ultimately market wide drawdowns will result in less open long interest and thus less trading revenues for stakers, so long as interest remains majority long. However, a balancing factor to this cycle is that thanks to inverse Synths and the Infinite Liquidity Mechanism, Synthetix is one of the most liquid and frictionless way to short assets on DEFI. During periods of extended drawdown, short interest on the protocol grows naturally, as existing iTokens increase in value and long interest is traded into short interest through the Synthetix Exchange. Since stakers provide liquidity to whatever positions traders decide to take, in adversarial market conditions open long positions rebalance into open short positions. This at some point balances the total synth value, and generates sustained trading revenues for stakers through bear markets as traders move in and out of short positions. The scenario in fact increases the appeal of staking as a market agnostic activity as the growing short interest begins to balance out the shrinking long interest. This makes the expected value of un-hedged staking less related to the direction of the market and more related to the trading activity on the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.180375982042649
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "27/05/2021-04:49:04",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}