{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/status-update-on-risk-and-governance-roadmap-for-pre-and-post-mcd-launch/673",
            "title": "Status update on risk and governance roadmap for pre- and post-MCD launch ",
            "index": 673,
            "category": [
                "Governance"
            ],
            "tags": [
                "rates",
                "dsr",
                "mcd-migration"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#1",
                    "likes": "11",
                    "time": "20/10/2019-17:10:27",
                    "content": "Hey all, I wanted to give an update on where we stand on risk and governance for the weeks leading up to MCD launch, and the few months afterwards too. I know communication has been a little lacking lately, so hopefully this makes up for it.  Last week on the governance call we began to discuss the migration strategy. The migration is well planned and should go smoothly, but just to be extra cautious we are going to focus the bulk of our efforts from now until launch on this. On this week’s call we can dive a little bit deeper into strategies, and present some potential risk parameters. Hopefully the following week we can formulate a written proposal out of it, and submit for a governance poll. These migration risk parameters will (pending governance approval) be the initialization parameters for MCD. These parameters are heavily influenced by the monetary policy shock that would result from the migration of ~80 million Dai. The proposed strategy is really quite simple. Let’s start the DSR with something low but meaningful (we are thinking 2%), and let’s start the MCD stability fee 2-3% below SCD. This should minimize overhead for governance on our end, and hopefully we can see a large migration occur in the weeks post-launch. We will have to do a bit of work managing monetary policy since the DSR and migration might temporarily de-stabilize the Dai peg. I don’t anticipate anything severe (and, hey, MakerDAO survived 2 months of weak Dai back in March. This should be much cleaner). Unfortunately, this means that our fancy collateral risk models take somewhat of a backseat in the meantime. All of the work we have done to evaluate and quantify collateral risk premiums is simply dwarfed by the relative weight of the migration supply shock. Reviewing 30 pages of materials to find out that the risk premium of a token like BAT is x% is just not significant at this stage of the game. Let’s ensure launch safety, and then we can immediately dive into specific collaterals. That being said, we still are intending to launch with one collateral type other than ETH, namely BAT. The goal is to launch with ETH, BAT, and Sai, but use migration-specific risk parameters. It’s important that we launch with at least one additional collateral type because a) it’s important to test out this functionality as part of launch, and b) we’re excited to be able to support multiple assets. The risk team is still planning on releasing documents for community review/discussion. In early November we’ll release some general documents regarding fundamental analysis and quantitative models. This will outline all of our motivations and methodologies for how risk should be conducted in an otherwise equilibrium state. We just probably won’t have time to discuss them on the governance calls prior to launch, and that’s okay. We expect the migration to take several weeks anyways, and so between launch and end of year we can spend time discussing the models as the migration is happening in parallel. Assuming everything goes according to schedule, we can hold our first official non-migration governance cycle starting in January. This is where we can present our risk reports on ETH and BAT (or we’ll probably release those in December, too), vote on asset priority polls, discuss centralized assets, DSR etc etc. We should probably spend one of our remaining weeks discussing auction parameters. Auctions are a new aspect to MCD, and can be a bit confusing at first. There’s some documentation on auctions here that could be good as a pre-read, and then we can dig into the mechanics and potential initial parameters on the governance call. https://github.com/makerdao/developerguides/blob/master/keepers/auctions/auctions-101.md  There are a few new security modules that need to be discussed as well. Most people already know about the OSM, the 1 hour oracle delay. But there is also the governance security module, as well as the emergency security module which both require some tiny discussion. This can maybe be appended to the end of the auctions call.  Tl;dr: Focus on migration between now and launch. Launch MCD with ETH, BAT, and SAI with special migration parameters. Between Nov 18th and Dec 31st we can discuss risk models while migration occurs in the background. Jan 1st we can start official governance cycles. ",
                    "links": [
                        "https://github.com/makerdao/developerguides/blob/master/keepers/auctions/auctions-101.md",
                        "https://forum.makerdao.com/t/snt-mcd-application-by-status/548/10",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-october-24-9am-pst-4-00-pm-utc/686/3",
                        "https://forum.makerdao.com/t/fund-mcd-application-by-fundament-real-estate-security-token/613/14"
                    ],
                    "GPT-summary": "The author provides an update on the risk and governance roadmap for the weeks leading up to MCD launch and the few months afterwards. The author discusses the migration strategy and presents potential risk parameters. The author also explains the proposed strategy and the collateral risk models. The author intends to launch with ETH, BAT, and Sai, but use migration-specific risk parameters. The author plans to release documents for community review/discussion and hold the first official non-migration governance cycle starting in January.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.26025536963037
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "21/10/2019-10:03:06",
                    "content": "Generally seems great, though I’ll admit I’m excited to get a look at the qualitative and quantitative risk info as soon as possible (it makes sense to do migration first though).     cyrus:  These migration risk parameters will (pending governance approval) be the initialization parameters for MCD…   The specifics here sound good. 2% seems like a good place to start for the DSR. That said, this incentivizes CDP Holders more than Dai holders to switch. (CDP Holders can get 2-3% discount, but Compound supply rate is still higher than 2% DSR.) We will need to be careful to make sure there is liquidity in the CDP migration contract. You seemed to think this shouldn’t be a problem though, so yeah, not too worried.     cyrus:  That being said, we still are intending to launch with one collateral type other than ETH, namely BAT.   I still disagree that we should be adding a second collateral type at launch, it just seems overly risky in terms of supply shock. We either have to tightly control the BAT debt ceiling, or just launch with one collateral type. Reason A doesn’t hold water for me, we are testing the ‘Multi-Collateral’ functionality with the Sai migration CDP type. Reason B makes more sense, but is it really that much less exciting if we launch it in January?     cyrus:  Assuming everything goes according to schedule, we can hold our first official non-migration governance cycle starting in January.   Sounds good, but we should be prepared for this to take longer than a month (I think we’re aiming for monthly cycles?) The first one is going to take longer until we can get precedents set and settle into more of a groove.     cyrus:  There are a few new security modules that need to be discussed as well.   Could we get @wouter (or a dev team member if Wouter is busy) to give us an overview on each of the new security modules during one of the Governance calls? I’m a big proponent of having the dev team talk to us directly about the specifics of how things work. I’d love more participation from you guys generally (last weeks meeting was a great start!) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.312866055513115
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#3",
                    "likes": "2",
                    "time": "21/10/2019-12:14:56",
                    "content": "    LongForWisdom:  Generally seems great, though I’ll admit I’m excited to get a look at the qualitative and quantitative risk info as soon as possible (it makes sense to do migration first though).   Yeah they will be coming out before launch for sure. Just not the collateral specific evaluations. But there will certainly be enough to chew on.     LongForWisdom:  The specifics here sound good. 2% seems like a good place to start for the DSR. That said, this incentivizes CDP Holders more than Dai holders to switch. (CDP Holders can get 2-3% discount, but Compound supply rate is still higher than 2% DSR.) We will need to be careful to make sure there is liquidity in the CDP migration contract. You seemed to think this shouldn’t be a problem though, so yeah, not too worried.   I’m confident there will be a chunk of Sai liquidity at launch due to some integrations partners migrating. And, to be clear, there isn’t anything necessarily bad about CDP owners migrating early. If they do to an extent that the community isn’t comfortable with, we can increase the DSR.     LongForWisdom:  I still disagree that we should be adding a second collateral type at launch, it just seems overly risky in terms of supply shock. We either have to tightly control the BAT debt ceiling, or just launch with one collateral type. Reason A doesn’t hold water for me, we are testing the ‘Multi-Collateral’ functionality with the Sai migration CDP type. Reason B makes more sense, but is it really that much less exciting if we launch it in January?   Great points. So, first, the Sai Migration CDP isn’t a ‘standard’ collateral type (remember, it allows arbitrary users to repurpose the collateral their for their own CDP migration.) So we really need an additional collateral type to test out the full features and functionality. Secondly, we’re also planning on having a low debt ceiling for safety reasons (literally all risk parameters for both ETH and BAT are just migration themed for now). Of course it’s a community decision, but personally I do think it’s a lot less exciting to launch multi-collateral Dai with a single collateral type.     LongForWisdom:  Sounds good, but we should be prepared for this to take longer than a month (I think we’re aiming for monthly cycles?) The first one is going to take longer until we can get precedents set and settle into more of a groove.   The migration will take longer, or standard cycles will take longer than a month? Either way, yeah if the migration moves much slower than expected, then we’ll have to reevaluate. An incomplete migration doesn’t necessarily mean we have to slow down other things, unless there is a lot of monetary policy work to do.     LongForWisdom:  Could we get @wouter (or a dev team member if Wouter is busy) to give us an overview on each of the new security modules during one of the Governance calls? I’m a big proponent of having the dev team talk to us directly about the specifics of how things work. I’d love more participation from you guys generally (last weeks meeting was a great start!)   Yeah I was already planning on getting a dev to pop in for that call. I can coordinate with Wouter to see who would be most appropriate. Although, the modules need to be discussed from a governance/risk standpoint, not necessarily at the technical level. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.984424159629077
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "21/10/2019-12:45:11",
                    "content": "    cyrus:  The migration will take longer, or standard cycles will take longer than a month?   To clarify, I think the first ‘standard cycle’ will take more than a month. (Also probably migration, but that was beside my point.)     cyrus:  Although, the modules need to be discussed from a governance/risk standpoint, not necessarily at the technical level.   They should definitely be discussed from a risk/governance standpoint, but I think that it’s valuable for governance to get a technical overview. Perhaps the governance call isn’t the best place for that, though. There’s probably already documentation, but it tends to be written ‘by devs for devs’. It would be great to get something more on the ‘by devs for governance’ level that less technical MKR Holders can understand. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.201388888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "3",
                    "time": "21/10/2019-13:23:39",
                    "content": "    LongForWisdom:  I still disagree that we should be adding a second collateral type at launch, it just seems overly risky in terms of supply shock. We either have to tightly control the BAT debt ceiling, or just launch with one collateral type.   I think it would attract a lot of criticism if we can’t launch with more than one collateral type. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#6",
                    "likes": "1",
                    "time": "21/10/2019-13:39:13",
                    "content": "    psychonaut:  I think it would attract a lot of criticism if we can’t launch with more than one collateral type.   Exactly, I agree. I think launching with just 1 other token is even stretching it (although there’s actually a good reason for that, which I’ll get into Thursday. Essentially, the only other two highly rated tokens, REP and ZRX, are both undergoing changing token economics as we speak. REP even has a brand new contract, which makes things messy.) I also think it’s perfectly reasonable to launch MCD with migration-focused risk parameters out of an overabundance of caution. It’s actually identical to how SCD runs. SCD has no risk premium baked in, it’s just pure monetary policy with a sensible debt ceiling. All we’re saying is, let’s continue that philosophy for an extra 6 weeks or so until we’re confident that everything is running smoothly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.815827922077922
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#7",
                    "likes": "1",
                    "time": "21/10/2019-13:41:57",
                    "content": "    LongForWisdom:  They should definitely be discussed from a risk/governance standpoint, but I think that it’s valuable for governance to get a technical overview. Perhaps the governance call isn’t the best place for that, though. There’s probably already documentation, but it tends to be written ‘by devs for devs’. It would be great to get something more on the ‘by devs for governance’ level that less technical MKR Holders can understand.   We can definitely do the technical overview. The documentation is indeed available. It’s a matter of presenting a digestible overview. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.2666666666666675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "1",
                    "time": "21/10/2019-13:51:27",
                    "content": "    cyrus:  All we’re saying is, let’s continue that philosophy for an extra 6 weeks or so until we’re confident that everything is running smoothly.   The same argument applies for not including BAT. Let’s wait til we have the SCD setup running on MCD (with DSR) before complicating things. I don’t disagree that the optics are bad, but I feel like it’s the type of recoverable bad-optics that doesn’t stick. One year on, no one will care if the launch of the second collateral type was delayed by a month. On the other hand if we lose the peg significantly that is going to stick around forever. All that said, you’re the head of the interim risk team, if you believe that adding BAT at launch does not add significant risk then I am on-board. As you say, so long as the debt ceiling is small, there is a limit to how bad it can be. What are your thoughts on BAT’s migration-themed parameters? Specifically the stability rate?     wouter:  We can definitely do the technical overview. The documentation is indeed available. It’s a matter of presenting a digestible overview.   Thanks! That sounds good. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.345588235294118
                }
            ]
        }
    ]
}