{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-automate-base-rate-adjustment/4004",
            "title": "[Discussion] Automate Base Rate Adjustment ",
            "index": 4004,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "rates",
                "base-rate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#1",
                    "likes": "2",
                    "time": "06/09/2020-16:22:49",
                    "content": "Motivation Voting is now expensive. The recent spike in gas prices pushed them to a level that is, frankly, absurd. Should this occur again, it could be detrimental to the usability of system; it seems to have harmed the price of ETH at any rate. Voting on the Base Rate every week incurs gas costs that are unnecessary and could be reduced. Proposal I propose we rework the current Base Rate weekly poll system to the following:   The weekly “Base Rate” vote is replaced with a Base Rate Adjustment Algorithm that adjusts the Base Rate on a weekly basis.   A BaseRateLimitRange is created, and is voted on quarterly.   The Base Rate Adjustment Algorithm will monitor the stability of the Dai peg, and adjust the Base Rate up or down accordingly within the BaseRateLimitRange set by governance.   This will save MKR holders on gas by reducing the frequency of voting,  and placing week-to-week adjustment of the Base Rate–and thus, up- or downwards pressure on the overall Dai supply–in the hands of the system, while still allowing MKR holders to control how far in either direction the system is allowed to adjust the Base Rate. I will leave about a week for feedback before making a signal request. ",
                    "links": [],
                    "GPT-summary": "The author proposes to replace the weekly \"Base Rate\" vote with a Base Rate Adjustment Algorithm that adjusts the Base Rate on a weekly basis. A BaseRateLimitRange is created, and is voted on quarterly. The proposal aims to save MKR holders on gas by reducing the frequency of voting and placing week-to-week adjustment of the Base Rate in the hands of the system. The author is asking for feedback before making a signal request. A 3rd party could give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 2.448611111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#2",
                    "likes": "4",
                    "time": "06/09/2020-16:35:04",
                    "content": "personally speaking. i believe zkrollup or vote delegation will serve the community better. Also research has been done on an PID controller for rates. Interestingly, the benefit to such a system is when it is very very young. As a system like this grows, the automation benefits start to dissipate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.13
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#3",
                    "likes": "4",
                    "time": "07/09/2020-05:30:34",
                    "content": "In theory I love any proposal that wants to automate something. However, I have some cons with this proposal  In light of what we have learned about Maker effective rates the last 2 years is that the market reaction is both slow and insensitive. It took rates of 15-20% in order to float Dai out of the 0.97 ditch it got into in 2019, and now even 0% rates does not impact the present 1.02 value. I also feel the proposal is maybe a touch rearward looking. Maker is about to onboard real world collateral - and the need for more stable rates will soon become apparent. If you have a business exposed to fiat rates it is going to be very hard to rely on a bot for rates. You may find you have a business one month, you are unable to finance anything the next before it is business as usual some weeks after that again.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.364583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "2",
                    "time": "07/09/2020-09:20:52",
                    "content": "So this has come up before, but not for a little while. Making the Base Rate (or stability fees directly) fully automated is quite hard and potentially risky. That said, there is possibly a half-way point involving instant access modules. @Derek have you guys looked into IAM’s for base rate / stability fees much? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.011574074074074
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#5",
                    "likes": "2",
                    "time": "07/09/2020-10:28:38",
                    "content": "I have not looked at building an Instant Access Module for base rate or stability fee calculations mostly due to the complexity that Planet_X describes. This is a particularly powerful lever that in my personal opinion would be better suited for a Layer2 solution (to eliminate the voting cost issues we have today), while ensuring we gather consensus across the broader community - vault holders, MKR/Dai owners etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.895833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#6",
                    "likes": "0",
                    "time": "07/09/2020-15:22:47",
                    "content": "    mrabino1:  Interestingly, the benefit to such a system is when it is very very young. As a system like this grows, the automation benefits start to dissipate.   My experience on controls side is that the reverse is true.   Also realize that governace managing this on a weekly basis is probably has the greatest error and biggest lags.   Imo isn’t the point of this to get away from governance doing the micro-management of these and simply managing larger levers that don’t need to be moved very often?     Planet_X:  In theory I love any proposal that wants to automate something. However, I have some cons with this proposal  In light of what we have learned about Maker effective rates the last 2 years is that the market reaction is both slow and insensitive. It took rates of 15-20% in order to float Dai out of the 0.97 ditch it got into in 2019, and now even 0% rates does not impact the present 1.02 value. I also feel the proposal is maybe a touch rearward looking. Maker is about to onboard real world collateral - and the need for more stable rates will soon become apparent. If you have a business exposed to fiat rates it is going to be very hard to rely on a bot for rates. You may find you have a business one month, you are unable to finance anything the next before it is business as usual some weeks after that again.    I agree generally with both of these comments.   I watched carefully Maker cause both a bull market in ETH (with low SFs and DAI much below PEG for quite a while) and then as the markets turned and PEG rose SF’s rise - steadily - bear market ensued causing PEG to move higher and require the SF finally to drop to 0 where we found the PEG would not return to 1 even with 0 rates. I completely agree regarding the business models particularly on borrowing using pretty stable collateral and having relatively stable rates.   I think in these markets it might be prudent both for the borrowers and Maker to treat these really as loan notes and to have fixed rates of return over term having the borrower have to roll debt in the time frame of interest vs. having a facility based floating rate. When I look across the spectrum of DeFI I do not yet see too much evolution of longer term rate bonds though if memory serves there is work going on in this space.   If anyone can take on longer term interest rate risk on collateral through DAI it is Maker basically because Maker controls the conditions underwhich DAI is minted.   Now we can allow 3rd parties to take this on but literally I think our RWA applications would prefer to deal with the bank directly on such facilities than to deal with 3rd parties in this regard, mostly due to liquidity concerns. I defer to @mrabino1 as he and his teams have significant market experience in this regard. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.670734126984128
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#7",
                    "likes": "1",
                    "time": "08/09/2020-01:05:34",
                    "content": "So far I’m seeing a lot of good points.     mrabino1:  personally speaking. i believe zkrollup or vote delegation will serve the community better.   Vote delegation is something I hadn’t considered (for some reason). Now that I’m thinking about it, though, I have a few misgivings about it which I’ll probably post about somewhere at some point, but I’m not sure they’d be considered on-topic for this thread.     Planet_X:  In light of what we have learned about Maker effective rates the last 2 years is that the market reaction is both slow and insensitive. It took rates of 15-20% in order to float Dai out of the 0.97 ditch it got into in 2019, and now even 0% rates does not impact the present 1.02 value.   True, but as Maker grows in usage, wouldn’t that mean that more of the market is paying attention to what Dai is doing? At the time of writing there’s only ~430m Dai in circulation. While significant, if memory serves the traditional lending industry is worth trillions. In such a comparatively small market, I think it’s natural that it would be a little slow to move at first.     Planet_X:  I also feel the proposal is maybe a touch rearward looking. Maker is about to onboard real world collateral - and the need for more stable rates will soon become apparent. If you have a business exposed to fiat rates it is going to be very hard to rely on a bot for rates. You may find you have a business one month, you are unable to finance anything the next before it is business as usual some weeks after that again.   Perhaps. I think we should weight the importance of stable rates vs maintaining the peg. I agree, stable rates are very important, as is predictability in your finances. The problem is, the other end of that equation is upset if the peg is all over the place. If my Dai is worth $1 this week, $1.02 next week, and $0.95 the week after, that makes it difficult to know precisely how much purchasing power I actually have. I think that automating adjustment of the rates would make it easier to keep the peg stable, and limiting it with governance voting on the limits quarterly will ensure that anyone can calculate for a worst-case-scenario for the quarter, at least.     LongForWisdom:  Making the Base Rate (or stability fees directly) fully automated is quite hard and potentially risky.   Indeed, there’s always the risk that a fringe case was missed or that something else goes wrong, and when it does, it’s totally in the hands of the system and thus very difficult to stop before it causes damage. The current system, while expensive, does make sure that governance is carried out with the full knowledge of the holders. Can’t disagree. Personally speaking, I’d buy smart contract insurance for just such a risk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.084578924162257
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#8",
                    "likes": "0",
                    "time": "17/09/2020-20:19:55",
                    "content": "Still looking for some discussion on this topic, especially since the gas prices have spiked again. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-15-en-espanol/4576",
                        "https://forum.makerdao.com/t/maker-relay-ep-15/4574",
                        "https://forum.makerdao.com/t/relay-ep-14-en-espanol/4457",
                        "https://forum.makerdao.com/t/maker-relay-ep-14/4450"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}