{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/implementation-of-the-new-data-api/12710",
            "title": "Implementation of the new Data API ",
            "index": 12710,
            "category": [
                "Core Units",
                "Data Insights"
            ],
            "tags": [
                "din-001",
                "api"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/tmierzwa",
                    "index": "#1",
                    "likes": "13",
                    "time": "18/01/2022-18:00:51",
                    "content": " New Data API From @data-insights-cu we are happy to announce the new Data API! TL;DR You can jump straight into the documentation here: Data API - ReDoc.  The new Data API We’ve refactored the old MCD Vault Tracker API and added endpoints for other domains apart from vaults. We will be maintaing the previous API for the next month to allow everyone to migrate properly. The new Data API allows you to query data from:  Governance: executives, polls, staking, proxies and delegates. Vaults: current & historical states as well as any transaction type. Liquidations: barks (liquidation triggers), auctions themselves and their evolution.   1382×1134 107 KB  We also created a page in our website dedicated to the Data API, which includes a quick getting started guide and release notes. We’ll also post any major updates and issues there. Link to the Data-API Documentation.  Important changes The biggest changes have happened in the backend so you should experience a more consistent and performant api.  The endpoint /vaults_list has been deprecated in favour of /current_state. The functionality remains the same, you can get the current state of a single or all vaults. The new endpoint /vault_snapshot allows you to query the state at a specific time in the past. In future releases we will also allow for querying multiple vaults.   Next Steps Next up we will be releasing the Protocol Parameters dataset, which will also be available via the API. We are constantly improving the functionality and the documentation, so feel free to send us your feedback! ",
                    "links": [
                        "https://api.mcdstate.info/api-documentation/multi-collateral-dai-vault-tracker-api-documentation#introduction",
                        "https://data.makerdao.network",
                        "https://data-api.makerdao.network/redoc",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-january-2022-updated/13094",
                        "https://forum.makerdao.com/t/source-for-getting-collateral-and-dept-balance/12512/8",
                        "https://forum.makerdao.com/t/getting-the-spells/12485/18",
                        "https://forum.makerdao.com/t/forum-at-a-glance-january-14th-20-2022/12752"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.588491481636643
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "18/04/2022-18:01:34",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}