{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/the-team-thats-bringing-spark-back-to-maker-spark-me-up-on-drinks-w-makerdao-delegates/19776",
            "title": "The Team That's Bringing SPARK back to Maker - Spark me up, on Drinks w/MakerDAO Delegates  ",
            "index": 19776,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegate-platform",
                "community-delegate-vlog",
                "drinks-maker-delegates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "5",
                    "time": "10/02/2023-10:28:09",
                    "content": "  If You Spark me up, If You Spark Me Up, I’ll Never Stop!   Hot off the press is one of the most exciting announcements of the Endgame Plan, the clustering of Ecosystem Actors coming together from different walks of life, and different Core Unit teams and forming as Ecosystem Actors. The recent announcement of the Spark Protocol and Phoenix Labs has brought a widespread interest among the DeFi community. We can’t remember this much excitement since perhaps the release of Multi-Collateral DAI (MCD). The team known as Phoenix Labs (wholly owned by MakerDAO) has announced its first solution, the Spark Protocol, which aims to enhance MakeDAO’s features by creating a liquidity market for scalable crypto assets with variable and fixed rates. Spark Protocol’s first product is Spark Lend, a lending market that integrates Maker’s D3M and the PSM. We really enjoyed talking with the Phoenix Labs team and we hope you take time out of your day to inform yourself on MakerDAO’s newest innovative approach.  Watch the Decentralized Version on MakerTube.Lens and collect this Episode as an NFT for FREE!! https://lenstube.xyz/watch/0x01a2c6-0x0b  Not Financial Advice This Content is for entertainment and informational purposes only, you should not construe any such information or other material as legal, tax, investment, financial, or other advice. Nothing contained on the Drinks With MakerDAO Delegates YouTube Channel, and/or MakerTube.lens Channel constitutes a solicitation, recommendation, endorsement, or offer by @Nadia @hexonaut @tadeo @ultraschuppi  of Coldiron.eth, @flipflopflapdelegate @rspa a.k.a, Raphael Spannocchi, Flip Flop Flap Delegate LLC, Phoenix Labs, Spark Protocol, Flipside Crypto, Coldiron.eth, or any third party service provider to buy or sell any cryptocurrencies, securities, or other financial instruments. Nothing in this YouTube & LensTube Video constitutes professional and/or financial advice.  The Tastings: Nadia Tea from Cafè Innovaciòn of Mexico City, Mexico   2.5 Stars    Tadeo: Cappuccino    from Cafè Innovaciòn of Mexico City, Mexico   2 Stars   Sam: Cappuccino    from Cafè Innovaciòn of Mexico City, Mexico   3 Stars    Raphael: RIEDENBURGER Historisches Emmerbier from Munich, Germany   5 Stars      Schuppi: Yin Zhen Bio Tea from China  5 Stars      El Pro: Double Negative by GRIMM Brewery, Brooklyn, United States  4.5 Stars      THE CENTRALIZED VERSION        ",
                    "links": [
                        "https://lenstube.xyz/watch/0x01a2c6-0x0b",
                        "https://www.youtube.com/watch?v=1tgMLOXz3mc"
                    ],
                    "GPT-summary": "The post discusses the announcement of the Spark Protocol and Phoenix Labs, which aims to enhance MakerDAO's features by creating a liquidity market for scalable crypto assets with variable and fixed rates. The post also includes positive feedback on the announcement and an invitation to inform oneself on MakerDAO's newest innovative approach.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.553571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#2",
                    "likes": "3",
                    "time": "10/02/2023-13:08:30",
                    "content": "Great show guys. Thanks for having us on! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.625
                }
            ]
        }
    ]
}