{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip13-declaracion-de-intenciones/4933",
            "title": "MIP13: Declaraci\\xc3\\xb3n de Intenciones ",
            "index": 4933,
            "category": [
                "Latin America"
            ],
            "tags": [
                "mips",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "3",
                    "time": "30/10/2020-01:37:51",
                    "content": "MIP13: Declaración de Intenciones Preámbulo MIP#: 13 Título: Declaración de Intenciones Autor(es): @LongForWisdomContributors: n/a Tipo: Proceso Estado: Solicitud de Comentarios (RFC, Request for Comments) Fecha de Propuesta: 2020-05-12 Fecha de Ratificación: <yyyy-mm-dd> Dependencias: MIP0 Reemplaza: n/a   Referencias MIP13c3-Subproposal-Template.mdMIP13c4-Subproposal-Template.md Sumario Abreviado La MIP13 introduce las declaraciones de intenciones; estas le permiten a la Gobernanza de Maker indicar una intención ante el resto de la comunidad. Sumario Extendido La MIP13 introduce las declaraciones de intenciones; estas le permiten a la Gobernanza de Maker indicar una intención ante el resto de la comunidad. MIP13 define una lista de Declaraciones Activas y también el proceso requerido para declarar, revocar y modificar declaraciones. Estas declaraciones pueden servir para informar a los miembros de DAO o a la Fundación Maker de cuáles cuáles son los asuntos que la Gobernanza considera importantes y cuáles son las prioridades de esta. Sumario de Componentes MIP13c1: ¿Qué es una Declaración de Intenciones? Describe las propiedades deseables en una Declaración de Intenciones y qué debe tenerse en cuenta al crear o modificar una. MIP13c2: Lista de Declaraciones Activas Un componente de lista que contiene una lista de todas las declaraciones de intenciones actualmente activas. MIP13c3: Proceso de Declaración de Intenciones Un componente de proceso que le permite a la Gobernanza de Maker crear, reemplazar o enmendar mediante reemplazo una declaración de intenciones. MIP13c4: Proceso de Revocación de Intenciones Un componente de proceso que le permite a la Gobernanza de Maker revocar una declaración de intenciones. Motivación La MIP13 está diseñada para formalizar y expandir un patrón de comportamiento que se ha manifestado consistentemente en la comunidad de la Gobernanza de Maker. Este patrón de comportamiento tiende a verse de este modo:  Se reconoce que algo debe hacerse. Se discute el problema. Se lleva a cabo alguna votación para asegurarse de que hay una mayoría que quiere hacer algo. Se tiene la esperanza de que alguien haga algo.  Muchas veces hemos visto este patrón surgir, en múltiples áreas y diversos asuntos. Tres ejemplos se dejan pensar fácilmente:  El cierre de SCD. La introducción de la votación jerarquizada on-chain (ranked on-chain voting). La compensación de vaults que perdieron dinero el Jueves Negro.  En cada uno de estos casos no hubo un registro formal de la declaración de intenciones más allá de una encuesta on-chain y varios hilos en el foro que llevaron a la decisión. Al formalizar este proceso en las MIPs, toda persona que desee interactuar con la Gobernanza de Maker podrá descubrir fácilmente y en un solo lugar a qué consenso se ha llegado sobre distintos temas. Además habrá un registro cuándo ocurrió cada declaración y la descripción de las razones para la misma. Especificación / Detalles de la Propuesta MIP13c1: ¿Qué es una Declaración de Intenciones? Definición Una declaración de intenciones declara una intención de la Gobernación de Maker hacia el resto del ecosistema. Tales declaraciones deberían hacerse con el objetivo de incitar a la acción en cierta área. Puede haber otras maneras de usar “declaraciones”; además de intenciones, este sistema podría generalizarse para declarar también otros conceptos como creencias u objetivos. Sin embargo, atentos a los principios de especificidad y brevedad, se sugiere que estas variaciones —si son necesarias— sean definidas como MIPs separadas. Especificidad Las declaraciones deben formularse cuidadosamente de modo que capturen la intención de la Gobernanza de Maker con tanta precisión como sea posible. No obstante, esto no significa que las declaraciones deban ser siempre específicas y precisas. Puede ocurrir que en determinadas ocasiones la Gobernanza de Maker no tenga por importante los detalles de implementación a usarse para la resolución de un problema sino solo la resolución misma del problema. También puede ocurrir que en determinadas ocasiones la Gobernanza de Maker ya haya discutido posibles soluciones para un problema y que se haya puesto de acuerdo en una implementación en tal medida que solo aceptaría esta implementación específica. Las declaraciones de ambos tipos (y los casos intermedios que no se ajustan plenamente a ninguno) deben considerarse legítimas, pero la Gobernanza de Maker debe empeñarse en dejar en claro en qué parte de la escala entre estos dos extremos se asienta cada declaración. MIP13c2: Lista de Declaraciones Activas Esta lista puede ser enmendada a través de subpropuestas creadas bajo las MIP13c3, MIP13c4 y MIP13c5. Las entradas en esta lista deberían seguir el siguiente modelo: Enunciado de Declaración: Número de subpropuesta: #Fecha de ratificación: (aaaa-mm-dd)   Nótese que el código de subpropuesta debería linkear a la subpropuesta relevante. Lista de Declaraciones Activas Actualmente no hay declaraciones activas. Debajo se encuentra una declaración de ejemplo que debería removerse (al igual que este párrafo) cuando la primera declaración ratificada se añada a esta lista. Cuando no hay declaraciones activas, la declaración de ejemplo y este párrafo deberían restablecerse. Enunciado de Declaración: A todos los Facilitadores de Gobernanza debería dárseles chocolate los 30 de febrero todos los años. Número de subpropuesta: MIP13c3-SP0 Fecha de ratificación: 2020-02-30   MIP13c3: Proceso de Declaración de Intenciones La MIP13c3 es un componente de MIP de Proceso que le permite a la Gobernanza MKR crear, reemplazar o enmendar mediante reemplazo una declaración de intenciones a través de una subpropuesta. Si una declaración de intenciones es ratificada por medio de una subpropuesta MIP13c3, debería ser añadida a la lista de MIP13c2 por un editor de MIPs. Si la subpropuesta define una declaración a reemplazar, entonces:  Esa declaración debería removerse de la lista de MIP13c2 por un Editor de MIPs El estado de la subpropuesta de las declaraciones reemplazadas debería cambiarse a Revocada por el Editor de MIPs  Las subpropuestas MIP13c3 tienen los siguientes parámetros:   Período de Feedback: 4 semanas completas  Período de Congelamiento: 1 semana completa  Las subpropuesta MIP13c3 deben usar el modelo ubicado en MIP13c3-Subproposal-Template.md. Este modelo se considerará ratificado si esta MIP avanza al estado de Aceptada. MIP13c4: Proceso de Revocación de Intenciones La MIP13c4 es un componente de MIP de Proceso que le permite a la Gobernanza MKR revocar una declaración de intenciones a través de una subpropuesta. Si una declaración de intenciones es revocada mediante una subpropuesta MIP13c4, entonces:  Esa declaración debería removerse de la lista de MIP13c2 por un Editor de MIPs El estado de la subpropuesta de las declaraciones revocadas debería cambiarse a Revocada por un Editor de MIP  Las subpropuestas MIP13c4 tienen los siguientes parámetros:   Período de Feedback: 4 semanas completas  Período de Congelamiento: 1 semana completa  Las subpropuestas MIP13c4 deben usar el modelo ubicado en MIP13c4-Subproposal-Template.md. Este modelo se considerará ratificado si esta MIP avanza al estado de Aceptada. Esto es una traducción libre del artículo original en inglés. Gracias a @blimpa y @Lozadaluis12  por la traducción. ",
                    "links": [
                        "http://MIP13c3-Subproposal-Template.md",
                        "http://MIP13c4-Subproposal-Template.md",
                        "https://forum.makerdao.com/t/mip13-declarations-of-intent/2461?page=2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0625
                }
            ]
        }
    ]
}