{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/should-we-modify-the-sf-voting-cadence-and-stepping/26",
            "title": "Should we modify the SF voting cadence and stepping? ",
            "index": 26,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "alignment"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#1",
                    "likes": "0",
                    "time": "28/06/2019-05:27:35",
                    "content": "Recently we’ve been in the happy position where the peg is largely stable according to the MKR voters; for the last three weeks we’ve seen polls signalling for ‘no change’. This trend seems likely to continue in this coming week, which creates an opportunity the community to use the Poll itself to address some outstanding issues in the way the system currently works. Context There are a series of limitations in the existing voting system that will be addressed in the coming months. But, currently, users can only place their MKR in one Vote or Poll at a time, and we can only run one concurrent Poll. That means, with a weekly Stability Fee poll, we have no opportunity to use the system to capture signals for any other reason. Questions  Are we seeing engagement fatigue by requiring holders to interact every week when there is no pressing need? Are the 1% increments too fine-grained? Are 10+ Polling options too confusing in the UI? Do 1% changes invite “fiddling” with Rate changes that will have no external effect? Is the weekend really the best time to ask large holders to move their MKR around? How do we allow the existing tool to let us signal for more than just SF changes? How do we stop stake weight and voter turnout dropping when there is no urgency? Do we provide voters enough time to Poll before the next Vote is scheduled?  The problem here is that we use the Polling system to collect signals but the Polling system is the only way to collect signals. Can we use the polling systems here in the forum to gather enough consensus to create a new poll in the voting portal? Possible Solutions   We move to two week voting cadences, then we can use every off-week to conduct other non-Stability Fee based polls. If the market presents the voters with a compelling reason to move the Stability Fee we can cancel the off-week poll and replace with an emergency Risk Poll.   We change the Stability Fee change options to increments of 2%.   We start Votes on Monday, Polls on Thursday. Users with custodial solutions, weekend plans, etc., can vote during the week.   In the following examples we could see less minor tweaking, increased engagement, and add additional flexibility to the current system. New Polls The next Poll could be for the cadence:  The Risk Parameter Poll and Voting Cycle should be every:  One week Two weeks   If the above Poll passes and we have 2 week Stability Fee Votes, we can now use every off-week to hold the following options:  The Risk Parameter stepping for Stability Fees should be:  1% 2%   Then two weeks later we could then revisit the start and end dates of the votes to determine if asking large holders to move MKR on a Friday might be too inconvenient.  Executive votes should start on:  Executive votes should start on Monday and run until Thursday, Polls Thursday till Monday. Executive votes should start on Friday and run until Monday, Polls Monday till Thursday. Etc…   Request for Comments Because this first iteration needs to seek consensus without using the Polling system itself, we should try to gather as much feedback as possible. Please add any comments or concerns here. ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-poll-stability-fee-adjustment-poll-july-15th-2019/135/3"
                    ],
                    "GPT-summary": "The author of the post is proposing modifications to the SF voting cadence and stepping and is seeking feedback from the community. The post highlights limitations in the existing voting system and proposes possible solutions to address them. The author also asks questions to gather feedback and suggestions from the community. The post does not advertise the proposal, but rather seeks constructive criticism and collaboration.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None"
                    ],
                    "Sentiment": 5.422938172938173
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "28/06/2019-13:29:14",
                    "content": "I would like to have the opportunity to vote on other governance issues than the stability fee, further, I think that moving to a two-week cadence will help us get the governance prerequisites for MCD completed more quickly than if we have to wait for the new governance dashboard. The peg has been stable enough the past few weeks. The one risk I can see here is that the price of Eth seems to be more volatile than usual, this could be a reason to wait, but I don’t think that skipping a week will cause any lasting damage to the peg. Two weeks should be often enough. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.268623737373738
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#3",
                    "likes": "1",
                    "time": "29/06/2019-04:42:09",
                    "content": "I agree. I’ve reposted this here for historical context and to keep some of the potential fixes alive. It’s the plan to have a new version of the portal live in a month that will support an arbitrary number of concurrent Polls. I’m thinking that once that feature is live then we can start picking and choosing from this list to see what the voters want. Perhaps we can fire up a set of forum polls for each of the possible solutions and start collecting signals now? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.2556818181818175
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psybull",
                    "index": "#4",
                    "likes": "0",
                    "time": "18/07/2019-17:32:58",
                    "content": "Having discussed this briefly in the Risk call this week, I believe it would be prudent for us to change to a biweekly cadence on rate votes.  Though this is opinion, I do feel that we are drifting into both a ‘voter fatigue’ malaise as well as not being able to properly vet the outcomes of the individual rate changes due to a variety market variables. I fear a scenario is already developing whereby voters merely think ‘DAI below $1, so increase rate’, which IMO is dangerous, as well as the rate choices themselves being fairly arbitrary in the grand scheme of things. It is obviously much more difficult to both design and come to consensus on meaningful changes to the process, but it seems like a good short term plan to just slow the voting cadence and open up to other topics for a bit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.13235294117647
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#5",
                    "likes": "0",
                    "time": "18/07/2019-17:57:43",
                    "content": "Does having a poll like this make sense in the forum? Can we make a decision based on the consensus we gather here?     Allow SF adjustments to be voted on Bi-weekly Keep weekly SF adjustment cadence     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/scientific-governance-and-risk-thursday-july-25-9am-pst-4-00-pm-utc/176",
                        "https://forum.makerdao.com/t/topic/143/19"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kwadrax",
                    "index": "#6",
                    "likes": "4",
                    "time": "18/07/2019-18:54:46",
                    "content": "I was pro 1-week to keep everyone involved but it’s clear the SF is changing too much to be able to actually analyse the data and draw conclusions from it. I’m on board to try bi-weekly. Changed my vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                }
            ]
        }
    ]
}