{
    "poll_list": [
        {
            "title": "Activate Liquidations for Stablecoin Vaults to Clear Bad Debt - October 31, 2022",
            "index": "18376",
            "option": "Yes",
            "supporting_mkr": "64,164",
            "highest_fraction": 0.83
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-clear-vaults-bad-debt-in-the-makerdao-protocol/18376",
            "title": "[Signal Request] Clear Vaults\\xe2\\x80\\x99 Bad Debt in the MakerDAO protocol ",
            "index": 18376,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted",
                "impact-:-high",
                "bad-debt"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/nonstopTheo",
                    "index": "#1",
                    "likes": "2",
                    "time": "14/10/2022-16:37:59",
                    "content": " Overview MakerDAO has DAI 1.3m of Vaults’ bad debt (Vaults with higher debt than collateral) on its Balance Sheet which stems from disabled liquidations in the USDC-A and USDP-A vaults. These borrowers are undercollateralized but were never liquidated even though the collateral value is below the liquidation threshold. While the debt is negligable w.r.t the total DAI supply, it is significantly higher than the one of Aave and Compound, and unlike them does not stem from dust accounts, and thus relatively easy to wipe out.  964×338 77.6 KB  Source: Comparison of bad debt across MakerDAO, Aave & Compound via RiskDAO Bad Debt dashboard  Proposal We think that MakerDAO should set best practices in DeFi for reliability, integrity and transparency. The DAI 1.3m in bad debt is a legacy issue and should be cleared, especially as the DAO moves towards the Endgame. We looked into various options to cancel this bad debt and encourage the DAO’s contributors, tokenholders, delegates and community members to provide feedback and participate in the Signal Request (scroll down for the poll options). Canceling the protocol’s bad debt will have the following benefits:  Distinguishes MakerDAO as the leading lending protocol with best-in-class risk management and liquidation discipline Cleans up legacy issues before MakerDAO transition towards the Endgame Positions MakerDAO as the best-managed Tier 1 lending protocol vs Aave and Compound Comes at a relatively small cost: DAI 1.3m in bad debt corresponds to 1.68% of the Surplus Buffer and merely 0.02% of all outstanding DAI.  In terms of technical implementation, we consider the following three options the most viable:  Liquidate the insolvent accounts Burn unbacked DAI Repay the underwater accounts  Pro:  Clean up the balance sheet. Send the right signals to the DeFi ecosystem that risk management takes center stage at MakerDAO.  Con:  We do not see any arguments against this proposal. The implementation does not require technical changes to the protocol or significant development work. Nor does it require any marketing effort and the sum is immaterial in comparison to the overall DAI balance.   The Backstory USDC-A & USDP-A vaults hold DAI 1.3m of unbacked DAI, where the collateral value is less than the outstanding debt. This bad debt stems from the fact that liquidations for these vaults were disabled. A full list of insolvent accounts for MakerDAO can be found here. Ultimately, stability fee was set to 0 which stopped any additional bad debt to accrue.  Financial implications & technical feasibility To cancel the bad debt, MakerDAO has to do a Balance Sheet adjustment and reduce the number of outstanding DAI. This adjustment should happen in the DAO’s Surplus Buffer which amounts to DAI 77.4m (as of 13 Oct ’22). DAI 1.3m accounts for 1.68% of the entire Surplus and is thus a non-critical adjustment. We consider the below options the easiest to execute:   Liquidate the insolvent accounts: Liquidate the remaining collateral in the accounts, and let the surplus buffer automatically absorb the remaining bad debt.  Burn DAI from the surplus buffer.  Repay the debt of underwater accounts using the surplus buffer.   Polls    Poll #1: Shall MakerDAO clear the vaults’ bad debt?  Yes No Abstain     0 voters        Poll #2: What is the preferred option to clear these bad debts?  Liquidate insolvent accounts Burn DAI from surplus buffer Repay the debt None of the Above/Other (see comments) Abstain     0 voters      Next Steps This signal will run from 2022-10-14T17:00:00Z→2022-10-30T23:59:59Z. If Poll #1 receives > 50% of non-abstain votes in favor, progression to an on-chain poll will depend on the outcome of Poll #2. If Poll #1 ends in favour and one option in Poll #2 receives >50% of non-abstain votes it will proceed to a binary on-chain vote with “No” as the alternative option. If Poll #1 ends in favour and two or more options in Poll #2 receive >50% of non-abstain votes, these options will move on-chain to an approval vote. “No” will also be an option in the approval vote. Due to this poll leading to a state change in the Maker Protocol, the approval winner will require support of a majority of non-abstain on-chain votes. The on-chain vote would commence on Monday, 31 October 2022. ",
                    "links": [
                        "https://api.riskdao.org/bad-debt?platform=ethereum_maker",
                        "https://makerburn.com/#/charts/system-surplus",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/29",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/32",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/108",
                        "https://forum.makerdao.com/t/calblockchain-delegate-platform/18407/2",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/24",
                        "https://forum.makerdao.com/t/riskdao-delegate-platform/18125/6",
                        "https://forum.makerdao.com/t/governance-and-risk-212-thursday-october-20-at-17-00-utc/18427/3",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/29",
                        "https://forum.makerdao.com/t/a-note-on-signal-requests/18501",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/26",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/29",
                        "https://forum.makerdao.com/t/governance-and-risk-213-thursday-october-27-at-17-00-utc/18494/3",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/130",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/73",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/2"
                    ],
                    "GPT-summary": "The post proposes that MakerDAO should clear its bad debt of DAI 1.3m, which is a legacy issue stemming from disabled liquidations in the USDC-A and USDP-A vaults. The proposal suggests three options for clearing the bad debt and encourages feedback from the DAO's contributors, tokenholders, delegates, and community members. The post also provides a comparison of bad debt across MakerDAO, Aave, and Compound and highlights the benefits of canceling the bad debt. The post includes two polls to gather feedback and outlines the next steps if the proposal is approved.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 4.409951159951159
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#2",
                    "likes": "5",
                    "time": "14/10/2022-17:01:02",
                    "content": "Another key point is that USDC-A and USDP-A are locking $230M without yield. As we move towards finding ways to get a yield, these should be kept in PSM as liquidity buffer. It’s either PE or the MOMC that made the situation (a bit of bad debt) in the first place to be sure that we can convert all those stablecoins to a PSM. Nothing was lost, it’s just accounting (one of the accounting technical debt we have). It’s in a TODO list, just not the priority for PE I guess, which, indeed, isn’t today (but maybe in 3-6 months?). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.05
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#3",
                    "likes": "2",
                    "time": "14/10/2022-17:13:47",
                    "content": "    SebVentures:  it’s just accounting   It is just an accounting issue in the sense that the protocol didn’t lose money. But from user’s point of view, there is (small) amount of DAI that is not backed by a collateral. Or at least the smart contract does not force its backing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.44047619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xbocaJ",
                    "index": "#5",
                    "likes": "0",
                    "time": "14/10/2022-21:34:12",
                    "content": "I think instead of burning DAI from the surplus buffer, we should mint MKR to buy back the deficit (and burn the DAI paid for MKR). Economically, I think it should have the same net effect on equity / MKR token, but the added benefit of building a norm that MKR holder bear the under collateralization risk before DAI holders, and it potentially diversifies the pool of MKR holders further. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#6",
                    "likes": "1",
                    "time": "17/10/2022-23:52:49",
                    "content": "    0xbocaJ:  the added benefit of building a norm that MKR holder bear the under collateralization risk before DAI holders   Note that the proposal burns Dai in the surplus buffer which ultimately belongs to MKR holders. It does mean that MKR holders, not Dai holders, pay to cancel the bad debt if that plan is executed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 3.3125000000000004
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nonstopTheo",
                    "index": "#7",
                    "likes": "0",
                    "time": "18/10/2022-09:03:36",
                    "content": "Yes, thanks for clarifying this to the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#8",
                    "likes": "0",
                    "time": "19/10/2022-16:45:18",
                    "content": "We are a bit conflicted on it as the Maker protocol is moving to utilize locked USDC that will give higher yield and also it acts as almost last peg protection if the peg breaks down. Currently, they are not worth paying back as they are underwater but if the peg breaks down then even with underwater, it will be worth to pay back and retrieve the collateral, thus burning Dai supply and help with the peg. So we lean toward 2 or 3 as in that way, the protocol can continue to use USDC in the system to gain higher yield to offset the bad debt in the long term. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.828703703703704
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xbocaJ",
                    "index": "#9",
                    "likes": "1",
                    "time": "19/10/2022-20:45:00",
                    "content": "    AstronautThis:  Dai in the surplus buffer … ultimately belongs to MKR holders.   I think what “belongs” to MKR holders is ambiguous; MKR holders could decide tomorrow that all the Dai in the PSM “belongs” to them and raid it. Or others could vote against any distribution of the surplus buffer. But it’s harder to argue with fundamental supply and demand of MKR on the open market. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#10",
                    "likes": "5",
                    "time": "21/10/2022-21:55:13",
                    "content": "IMO this is really all about prioritization. Seems like it will provide more value to focus on ways to deploy idle stablecoin balances from PSMs first, and then as the liquid reserves decline work on liquidating/shifting stablecoin vault balances into PSMs and recognizing/settling bad debt at that time. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-october-2022/18615"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#11",
                    "likes": "1",
                    "time": "26/10/2022-22:06:34",
                    "content": "Yes, currently it does not seem that DAI holders care much about it, or even aware of it (this debt is likely to exist for over a year now). But as the MakerDAO moves more towards off-chain backing, and consequently off-chain accounting, it might be more appropriate to level the reported balance sheet. Ideally by cleaning the bad debt, but alternatively by putting some DAI on the side as some kind of deceleration of intent. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#12",
                    "likes": "0",
                    "time": "28/10/2022-15:18:33",
                    "content": "The following is GovAlpha’s summary of this Signal Request.  This is a valid Signal Request. This signal request gauges community sentiment towards clearing 1.3M Dai worth of bad debt from USDC-A and USDP-A vaults that are undercollateralized. Three solutions to clear the bad debt are proposed:  Liquidate the vaults and let the surplus buffer automatically absorb the remaining bad debt. Burn Dai from the Surplus Buffer. Repay the debt of underwater accounts using the surplus buffer.   This Signal Request will run until Sunday, October 30. If the over 50% of non-abstaining votes in Poll #1 are in favour of clearing bad debt, there are three possibilites for an on-chain poll on Monday, October 31:   No on-chain vote: If no option in Poll #2 has over 50% of non-abstaining votes, there will be no on-chain vote.  Binary vote: If only one option in Poll #2 has over 50% of non-abstaining votes, then there will be a binary on-chain vote between that choice and not clearing bad debt.  Approval vote: If multiple options in Poll #2 have over 50% of non-abstaining votes, then there will be an approval vote on-chain with those options and the option of not clearing bad debt. This will only pass to an executive if one of the debt-clearing options receives over 50% of non-abstaining votes on chain.   This SR has been assigned Medium-Impact based on the methodology listed here.  Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. Updated 2022-10-28 ",
                    "links": [
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.7142857142857144
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#13",
                    "likes": "1",
                    "time": "31/10/2022-12:07:19",
                    "content": "This SR has now closed. There was a majority in favour of clearing the bad debt. In the follow-up poll, the only option to receive support from > 50% of non-abstain voters was “Liquidate insolvent accounts” with 9/15 supporting it (60%). The next highest option received 7/15 votes (47%). Therefore, an on-chain poll will be posted today asking if we should turn on liquidations for the stablecoin vaults, which will have the effect of liquidating the insolvent accounts and accounts that become insolvent in future. If this poll is approved, GovAlpha will ask the Risk Core Unit to recommend liquidation parameters for the remaining stablecoin vaults. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#14",
                    "likes": "0",
                    "time": "30/11/2022-22:07:22",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1846"
}