{
    "poll_list": [
        {
            "title": "Approve Multisig for Management of Velodrome NFT - October 3, 2022",
            "index": "17777",
            "option": "Yes",
            "supporting_mkr": "66,348",
            "highest_fraction": 0.73
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-create-a-multisig-to-manage-the-velo-venft/17777",
            "title": "[Signal Request] Create a Multisig to manage the $VELO veNFT ",
            "index": 17777,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "sig-status-accepted",
                "impact-:-low"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#1",
                    "likes": "2",
                    "time": "07/09/2022-23:58:00",
                    "content": " Sentence Summary Create a 3/4 multi-sig to manage the airdrop MakerDAO received from Velodrome Finance.  Paragraph Summary After the prior vote passed to manage the veNFT through Executive Spells, I met with @brianmcmichael and the Velodrome Finance team to understand how we could manage the veNFT in a maximally decentralized way. Unfortunately, voting the veNFT is not practical and an inefficient use of the PECU team’s time. A multi-sig was determined to be the best solution for managing the airdrop.  Motivation The veNFT will allow MakerDAO to direct emissions to the liquidity pools of their choosing, increasing liquidity of the chosen pairs and receiving all trading fees and bribes for those pools. Weekly trading fees for the DAI/USDC pair alone have been as high as $150K annualized.  Multi-sig Signers I am seeking four trusted community members to volunteer to be signers for a MIP47 compliant multi-sig to vote MakerDAO’s veNFT on Velodrome Finance. SFCU believe DAI pairs and in particular DAI/stablecoin pairs will be most beneficial for DAI’s utility, but would encourage signers to coordinate with the Velodrome Finance team to maximize DAI liquidity and trading fees.    Create a MIP47 Compliant Multi-sig to manage the $VELO veNFT?  Yes, create a 3/4 MIP47 Multi-sig No, do nothing and receive no revenue from trading fees/bribes Abstain     0 voters     ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmQD5mao#poll-detail",
                        "https://dune.com/msilb7/velodrome-fees",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/54",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/103",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/25",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/66",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/19",
                        "https://forum.makerdao.com/t/governance-and-risk-208-thursday-september-15-at-17-00-utc/17887/3",
                        "https://forum.makerdao.com/t/governance-and-risk-207-thursday-september-08-at-17-00-utc/17794/2",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/17",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/15",
                        "https://forum.makerdao.com/t/off-chain-proposal-bounties-round-up-4/18283",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/122",
                        "https://forum.makerdao.com/t/relay-semanal-29-de-septiembre-6-de-octubre-de-2022/18363",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/15",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/8",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/17"
                    ],
                    "GPT-summary": "The author of the post is proposing to create a 3/4 multi-sig to manage the airdrop MakerDAO received from Velodrome Finance. The proposal aims to manage the veNFT in a maximally decentralized way, and the author is seeking four trusted community members to volunteer to be signers for a MIP47 compliant multi-sig to vote MakerDAO’s veNFT on Velodrome Finance. The post also includes information on the motivation behind the proposal and the potential benefits for DAI's utility. A 3rd party could provide constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.422916666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#2",
                    "likes": "2",
                    "time": "08/09/2022-00:15:47",
                    "content": "ACREinvest volunteers! We voted yes because Kianga is passionate about metaGovernance as a powerful lever for driving several key advantages for the community. ACREinvest is scaling capacity to provide such services via our collaboration with ACRE DAOs, a tokenized community we co-founded to drive innovation and adoption of DeFi, ReFi and crypto primitives for impact investing. Our enthusiasm for the $VELO project and support for MakerDAO’s active engagement was expressed at the time of the initial airdrop [Signal Request] Incoming Velodrome Airdrop on Optimism - $VELO veNFT - #6 by ACREinvest    [Signal Request] Incoming Velodrome Airdrop on Optimism - $VELO veNFT   This is sooooo exciting! I am very interested in assisting with the active governance of this on behalf of MakerDAO so we do not have to rely on the Velodrome team. Would the community support a metaGovernance proposal from ACREinvest and anyone in particular have capacity to help me with a proposal?   Collaboration with Velodrome Finance was envisioned among the responsibilities we later proposed for @DaveringtonPLLC in our Chief Legal Officer SPF proposal (withdrawn during RFC) MIP55c3-SP5: Interim Chief Legal Officer    MIP55c3-SP5: Interim Chief Legal Officer   Establish and lead a MetaGovernance Oversight Committee (MGOC) via MIP46 – Parameter Proposal Groups submission. Similar in structure and operation to the MakerDAO Open Market Committee (MOMC), the MGOC would monitor and manage any governance obligations and opportunities associated with the DAO’s ownership of governance tokens in the MakerDAO treasury.   Happy to proceed with supporting this initiative in cooperation with what’s envisioned here. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-incoming-velodrome-airdrop-on-optimism-velo-venft/15371/6",
                        "https://forum.makerdao.com/t/signal-request-incoming-velodrome-airdrop-on-optimism-velo-venft/15371/6",
                        "https://forum.makerdao.com/t/mip55c3-sp5-interim-chief-legal-officer/15981",
                        "https://forum.makerdao.com/t/mip55c3-sp5-interim-chief-legal-officer/15981/1",
                        "https://forum.makerdao.com/t/mip46-parameter-proposal-groups/6341",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.657894736842105
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#3",
                    "likes": "2",
                    "time": "08/09/2022-01:22:07",
                    "content": "I assume SFCU is doing the hard work and just like our for signers? In that case: happy to help. Probably better to have more people on the multisig to avoid partial offline problems? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.408333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sebix",
                    "index": "#4",
                    "likes": "0",
                    "time": "08/09/2022-10:51:32",
                    "content": "This is a summary of the governance impacts of this Signal Request from GovAlpha’s perspective:  This is a valid Signal Request. This SR gauges community sentiment towards creating a 3/4 Multisig (MIP47) to manage the airdrop received for the newly launched Velodrome protocol on Optimism.  The DAO’s veNFT are currently being handled by the Velodrome team. Multisig was chosen as best option, due to a lack of practical ways for PE to work with veNFT on L2.   This Signal Request will run until Friday, September 21, as stated above. If the outcome is in favour of proceeding, and an appropriate multi-sig on Optimism with named signers is created, an on-chain poll will follow. This SR has been assigned Low-Impact based on the methodology listed here.  Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. Updated 2022-10-03 ",
                    "links": [
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0696022727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#5",
                    "likes": "3",
                    "time": "08/09/2022-12:07:32",
                    "content": "I already Vote with my VELO NFT on Velodrome and pay attention to rewards, so happy to help with multisig and NFT management as well. I would suggest something like a well trusted/known 3 of 5 or 3 of 6 just to make it easier to get 3 signers reasonably quickly but that is up to MakerDAO to do that. FYI to people who are unfamiliar there will also be the following weekly claimable income from the $VELO NFT:  VELO from the locked $veVELO in the NFT Share of the Bribes from the pools voted. Share of the Rewards from the pools voted.  I would suggest basically converting some of the Bribe/rewards into ETH for gas or for MakerDAO and basically re-invest the VELO into the NFT vs. selling it to retain voting weight as VELO rebases. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.888888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#6",
                    "likes": "2",
                    "time": "08/09/2022-13:44:56",
                    "content": "Thank you for volunteering ACREinvest, much appreciated!     ultraschuppi:  I assume SFCU is doing the hard work and just like our for signers? In that case: happy to help. Probably better to have more people on the multisig to avoid partial offline problems?   Thanks for volunteering Schuppi! We would recommend (and are happy to help with) leveraging the Velodrome team’s expertise regarding how emissions should be directed. They’ve spent a tremendous amount of time building models to understand what is optimal for each token. Today, IMO, we should support only DAI pairs, but there’s no reason why we couldn’t support future ecosystem tokens like ETHD, Elixir, and Meta Elixir if the End Game is approved. To be MIP47 compliant, we need 2/3 voters minimum - we could increase the amount of signers to 4/6 but trying to be conscious of the coordination efforts from the signers. Definitely open to changing if that’s what the community desires.     MakerMan:  I already Vote with my VELO NFT on Velodrome and pay attention to rewards, so happy to help with multisig and NFT management as well. I would suggest something like a well trusted/known 3 of 5 or 3 of 6 just to make it easier to get 3 signers reasonably quickly but that is up to MakerDAO to do that. FYI to people who are unfamiliar there will also be the following weekly claimable income from the $VELO NFT:  VELO from the locked $veVELO in the NFT Share of the Bribes from the pools voted. Share of the Rewards from the pools voted.  I would suggest basically converting some of the Bribe/rewards into ETH for gas or for MakerDAO and basically re-invest the VELO into the NFT vs. selling it to retain voting weight as VELO rebases.   Thanks for volunteering MakerMan - excellent to have someone onboard already familiar with voting and bribing within Velodrome. I’m open to changing the signers, but in order for this multi-sig to be Governance-owned and compliant with MIP47, a 2/3 voter quorum is needed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.215909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#7",
                    "likes": "0",
                    "time": "21/09/2022-13:17:28",
                    "content": "This SR has ended with a majority of non-abstain voters voting in favour. We will put a weekly poll on the voting portal on 2022-09-26. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#8",
                    "likes": "0",
                    "time": "21/09/2022-14:41:53",
                    "content": "Hey @Aes , Chatting this over internally with facilitators and MIP authors, this seems like a situation where we would want to get the multisig set up and confirmed before putting this up for vote. Generally, we have avoided doing this before an item is polled on in an attempt to prevent unnecessary spending/labor. However, in this case, we will essentially be instructing Velo to send the NFT to a multisig run by a group of people (that still need to be identified). In order to prevent the NFT being sent to an address that has not been approved by MKR  holders, we should be explicit and provide the address the NFT should be sent to, if this poll passes. We’re 5 days out from when this can be polled, so hoping this is enough time to set up before then. We can delay the poll if need be, but for security reasons we need the following defined before the poll is created:  A multisig address with 3/4 signature requirements (presumably, on Optimism). Confirmations in this thread with addresses from all signers.  Please let me know if you have any questions! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.035714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#9",
                    "likes": "0",
                    "time": "21/09/2022-14:49:43",
                    "content": "@ACREinvest @ultraschuppi and @MakerMan have volunteered as signers. We need one more trusted community member to help out. cc @Recognized-Delegates ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#10",
                    "likes": "2",
                    "time": "21/09/2022-15:38:35",
                    "content": "Flipside can volunteer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#11",
                    "likes": "0",
                    "time": "21/09/2022-15:48:38",
                    "content": "So that would give us 4 signers, just need someone to take the initiative to spin up the multisig and drop the details here  (plus a short, I confirm, this is my signing address from the signers accounts) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Juanbug",
                    "index": "#12",
                    "likes": "0",
                    "time": "21/09/2022-17:26:06",
                    "content": "Penn Blockchain would love to volunteer as well. We’ve been following Velo for quite some time now and would love to get involved. However, if expanding the multisig is out of the picture, hapoy to defer to the first four respondents. How flexible is the extra multisig addition? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#13",
                    "likes": "1",
                    "time": "21/09/2022-18:55:32",
                    "content": "I can spin up a SAFE a bit later, all signers please send your confirmed addresses. Happy to include @juanbug if it makes sense ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#14",
                    "likes": "3",
                    "time": "21/09/2022-19:30:30",
                    "content": "I heard @Juanbug wants to join this multisig so badly I am giving my slot. Too bad this SR is not phrased more flexible because I think a 3/4 can turn unactionable pretty easily. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.986111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Juanbug",
                    "index": "#15",
                    "likes": "1",
                    "time": "21/09/2022-19:57:58",
                    "content": "@ultraschuppi We truly appreciate you for stepping aside and giving us this opportunity. We have pretty good response rates, however when it comes to taking too long to sign, will look into more of the 3/5 or more multisig, through futures signals, if we are inefficient. @rspa Confirming our address is: 0x2165D41aF0d8d5034b9c266597c1A415FA0253bd ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#16",
                    "likes": "0",
                    "time": "21/09/2022-20:32:22",
                    "content": "should we re-signal? @prose11? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#17",
                    "likes": "0",
                    "time": "21/09/2022-20:40:38",
                    "content": "If it’s still going to be a 3 of 4 multisig and you are all happy with the composition it’s fine on my end. I just want an address and explicit confirmation of the signers with their address before we bring it to polling. Reminder (correct me if I’m wrong @Aes) the multisig will need to be on Optimism to receive the NFT and manage it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.194444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#18",
                    "likes": "2",
                    "time": "21/09/2022-22:08:53",
                    "content": "okay. ready to move forward with this. Flipside just recently backfilled OP data to block one, so this is a very natural fit for us. Requesting all signers to confirm their respective addresses here. @MakerMan and @ACREinvest ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.025
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#19",
                    "likes": "1",
                    "time": "22/09/2022-02:43:12",
                    "content": "MakerMan confirming Makerman.eth == 0x9AC6A6B24bCd789Fa59A175c0514f33255e1e6D0 address for Maker Velo NFT Optimism multisig signatures. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#20",
                    "likes": "0",
                    "time": "22/09/2022-02:44:17",
                    "content": "I would have been fine with a 3 of 5 honestly just for some flexibility in signers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.541666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#21",
                    "likes": "1",
                    "time": "22/09/2022-03:26:19",
                    "content": " image786×86 15 KB  (Problems appear bigger in Governance Facilitator) Just so it’s public, I informed @Juanbug and @ultraschuppi that because it was specifically polled as a 3/4 I would not put up a 3/5 option on-chain. If a new set up is desired, it would need explicit governance consent, so I appreciate being able to work this out at a social level so this proposal can appear before the MKR holders as soon as possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.558080808080808
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#22",
                    "likes": "3",
                    "time": "22/09/2022-22:00:43",
                    "content": "VELO/MKR multisig Wallet address for ACREinvest is 0x09ca15aDa7AcDf13C423aC66323489f0E407E8a2 (acreopportunity.eth) @rspa Thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#23",
                    "likes": "0",
                    "time": "26/09/2022-15:28:16",
                    "content": "As the multi-sig wasn’t created in time for the address to be included in a poll this week we will delay polling until we have a confirmed address. This could be as early as next week if everything is sorted. This is so that MKR holders can approve the specific address they wish the $VELO veNFT to be sent to. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#24",
                    "likes": "2",
                    "time": "26/09/2022-16:42:22",
                    "content": "Could one of the volunteers please spin up a multi-sig for this? @rspa @ACREinvest @MakerMan @Juanbug ty  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#25",
                    "likes": "0",
                    "time": "26/09/2022-16:53:04",
                    "content": "We would like some time to complete an internal regulatory compliance review for this commitment. Can this be accommodated and a time scheduled for the multi-sig members to discuss all the details of how this group will operate? If not, ACREinvest will need to withdraw. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Juanbug",
                    "index": "#26",
                    "likes": "0",
                    "time": "26/09/2022-17:31:57",
                    "content": "Happy to chat/hop on call whenever. @ACREinvest whenever your internal review is done, please let us know and we can schedule a chat. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#27",
                    "likes": "0",
                    "time": "26/09/2022-17:55:44",
                    "content": "we’re working on it. should be done by EOD eastern ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#28",
                    "likes": "3",
                    "time": "26/09/2022-18:59:55",
                    "content": "    ACREinvest:  We would like some time to complete an internal regulatory compliance review for this commitment. Can this be accommodated and a time scheduled for the multi-sig members to discuss all the details of how this group will operate? If not, ACREinvest will need to withdraw.   not sure who is in charge of this now, but I guess this should be handled without waiting any longer. I am more than happy to get into the mix (again) 0xd52623EE9A40402A5a9ED82Bb0417e04d88A778C EDIT: since it is just not a big thing to just create a multisig on optimism (hint: it is permissionless) here is one: Safe it is a 3/4 containing   @Juanbug - https://optimistic.etherscan.io/address/0x2165D41aF0d8d5034b9c266597c1A415FA0253bd   @MakerMan - https://optimistic.etherscan.io/address/0x9AC6A6B24bCd789Fa59A175c0514f33255e1e6D0   @rspa (who needs to confirm this adress here i guess) - https://optimistic.etherscan.io/address/0x62a43123FE71f9764f26554b3F5017627996816a  me https://optimistic.etherscan.io/address/0xd52623EE9A40402A5a9ED82Bb0417e04d88A778C   here is the list of users, here the policy. I guess this is fine. ",
                    "links": [
                        "https://optimistic.etherscan.io/address/0x2165D41aF0d8d5034b9c266597c1A415FA0253bd",
                        "https://optimistic.etherscan.io/address/0x9AC6A6B24bCd789Fa59A175c0514f33255e1e6D0",
                        "https://optimistic.etherscan.io/address/0x62a43123FE71f9764f26554b3F5017627996816a",
                        "https://optimistic.etherscan.io/address/0xd52623EE9A40402A5a9ED82Bb0417e04d88A778C",
                        "https://gnosis-safe.io/app/oeth:0x3C39024B9D430e6D6DaED9b0C8EB5747214bD49f/settings/owners",
                        "https://gnosis-safe.io/app/oeth:0x3C39024B9D430e6D6DaED9b0C8EB5747214bD49f/settings/policies"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.291666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#29",
                    "likes": "0",
                    "time": "26/09/2022-19:18:35",
                    "content": "confirm our address is 0x62a43123fe71f9764f26554b3f5017627996816a or flipsidecrypto.eth ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Juanbug",
                    "index": "#30",
                    "likes": "0",
                    "time": "26/09/2022-19:43:54",
                    "content": "Thanks for spinning this up Schuppi, we are fine with this as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#31",
                    "likes": "0",
                    "time": "27/09/2022-17:04:27",
                    "content": "Looks good from my seat. Also as far as I know transferring the NFT to another safe should be easy.   All of the voting, etc. is handled by the NFT mechanics the owner is somewhat irrelevant except if they want to change voting or claim fees, bribes, veVELO etc.    So changing to a new safe should be relatively straight forward should people want to exit the multisig responsibilities. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.293560606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#32",
                    "likes": "0",
                    "time": "27/09/2022-17:17:23",
                    "content": "    ultraschuppi:  not sure who is in charge of this now, but I guess this should be handled without waiting any longer.   Absolutely fine. As everyone knows very well, ACREinvest is a business - an incorporated legal entity led by Kianga Daverington who is the individual making decisions for this Delegate on behalf of the entity. She is in “charge.” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.566666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#33",
                    "likes": "0",
                    "time": "27/09/2022-17:21:13",
                    "content": "    Juanbug:  Happy to chat/hop on call whenever. @ACREinvest whenever your internal review is done, please let us know and we can schedule a chat.   Thank you for the consideration, but looks like @ultraschuppi did not wish to allow time for a response or discussion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#34",
                    "likes": "0",
                    "time": "27/09/2022-18:05:58",
                    "content": "    ACREinvest:  We would like some time to complete an internal regulatory compliance review for this commitment. Can this be accommodated and a time scheduled for the multi-sig members to discuss all the details of how this group will operate? If not, ACREinvest will need to withdraw.   @Patrick_J We note the decision was made to not accommodate our request. Our compliance review is complete and results updated on our Delegate Platform - linked here for completeness of this discussion. ACREinvest Delegate Platform - #47 by ACREinvest    ACREinvest Delegate Platform   DELEGATE PLATFORM UPDATE - September 27, 2022 Following last week’s announcement by the United States Commodity Futures Trading Commission and federal civil enforcement actions against a decentralized autonomous organization, ACREinvest has performed an internal review of its role as a Recognized Delegate for MakerDAO, including when attributed to Kianga Daverington as either a representative of the firm or in her individual capacity. We have determined that we are comfortable continuing our work on behalf of MKR token holders delegating to our contract, and on behalf of the entire MakerDAO community who we also represent and consider stakeholders on our decisions.   ",
                    "links": [
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/47",
                        "https://www.cftc.gov/PressRoom/PressReleases/8590-22"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.363636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#35",
                    "likes": "0",
                    "time": "27/09/2022-18:08:55",
                    "content": "    ACREinvest:  We note the decision was made to not accommodate our request   If this is directed at me or GovAlpha then this is not a correct characterisation. The poll did not go on chain to allow any issues to be sorted out, including your compliance review. I’m pleased to see your compliance review was reassuring. Edit: I see you may be referencing Schuppi’s comment above. The creation of that multi-sig has nothing to do with GovAlpha. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#36",
                    "likes": "4",
                    "time": "29/09/2022-11:24:22",
                    "content": "Following up here, it is GovAlpha’s intention to have this Signal go to polling on Monday. From our end we have a 3/4 multi-sig of volunteers to manage it, as intended by the Signal. So final call if the volunteers want to work something else out, otherwise the multi-sig with @ultraschuppi @Juanbug @MakerMan and @rspa will be the one going on chain. cc: @ACREinvest ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#37",
                    "likes": "1",
                    "time": "30/09/2022-18:38:22",
                    "content": "Drafting now, speak now or forever hold your peace! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#38",
                    "likes": "0",
                    "time": "03/10/2022-20:51:11",
                    "content": "I’m not entirely familiar with how VELO works. How much money/value will the multisig signers have access to? What kind of oversight will be in place to ensure that all funds remain safe and are returned to the DAO? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.390625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#39",
                    "likes": "1",
                    "time": "05/10/2022-04:59:41",
                    "content": "Chris.   I can’t answer the how much value the gnosis safe multisig will hold but I can give some general information about VELO on optimism. https://optimistic.etherscan.io/token/0x3c8b650257cfb5f272f799f5e2b4e65093a11a05#balances I have total outstanding VELO at 567M which at ~$.02 is ~11.34M give or take depending on actual market prices (I have seen VELO as high as .10 and as low as .016ish but this is from memory over past couple months. I would be surprised if Maker ends up with 10% VELO which would be 56.7M (and would be like 15% of the locked voting veVELO if locked in the voting NFT for 4 years).   Will have to wait to hear on specific details. Second point is that to vote on VELO rewards one has to LOCK the VELO into a NFT for some period.   Example is you get one veVELO vote for 1 VELO locked for 4 years.   This ofc changes to something more like 1/208 veVELO for 1 VELO locked for 1 week.    Total voting power is (on last calculation based on voting %'s) about 340-350M veVELO. Point here is that typically people are locking for long periods to get the greatest voting power, and hence the maximum voting rewards (via LP fees, bribes, etc.), once the VELo is locked into the NFT it can’t be removed from the NFT until locking expiration, but one could send the NFT to another wallet. I already started some research on which LPs Maker might want to support and returns on these vary but run from 0% up to something like 200-300% (4-6%/week return) in $$ value.   Depends on how much VELO Maker has, and how long to lock which will determine the veVELO voting power but to put this into some perspective. Every 100K worth of veVELO (assume 1:1 ratio to VELO value for a 4yr lock) worth currently $2K US one can earn up to 4-6%/week (or 80-120 $$ US.weej) in bribes and fees. Since the goal of locking and voting this VELO will probably be to encourage DAI liquidity on Velodrome I don’t expect returns to be as high as above and given the constant VELO rebases for the VELO price to continue to drop over time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.664102564102564
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#40",
                    "likes": "0",
                    "time": "04/11/2022-14:59:58",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#41",
                    "likes": "0",
                    "time": "14/11/2022-11:54:47",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#42",
                    "likes": "1",
                    "time": "14/11/2022-12:50:35",
                    "content": "An interesting topic came up when discussing signing addresses: How can we change the address of one of the signees in case of loss of access, in case a signer’s wallet has been compromised, or in the case of a signer wanting to use another wallet as initially specified? Of course, this is a very small issue, but it highlights the need for an unbureaucratic way to change parameters and affect small-scale changes publicly and transparently. Currently, a signer’s address change on the veNFT wallet would need to go through a MIP, according to @prose11, since the original multi-sig resulted from an ad-hoc signal. A MIP is overblown for a humdrum change like that. We need a low-intensity method to maintain the system’s already approved and working parts. Tagging @rune and @prose11 here for guidance on the ideal process. My proposal: Change request forum polls that cannot propose new items but only change already existing parameters. These change request polls could be delineated so they cannot change or influence any meaningful parameter. In the example above: A multi-sig signer could not be swapped out for a different signer. Just a different address by the same signer or signing organization. Examples: Change multi-sig signer address Change an off-chain parameter ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.745129870129871
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#43",
                    "likes": "0",
                    "time": "14/11/2022-16:41:05",
                    "content": "Suggest using MIP46 Parameter Proposal Groups here. Thanks to @PaperImperium for digging that up. Advantages: Established process Can be well scoped No lone actors (have to be two members agreeing at least) Feedback welcome. (@rune and @prose11) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#44",
                    "likes": "1",
                    "time": "14/11/2022-18:05:47",
                    "content": "Isn’t mip46 about parameters of the protocol? What are the parameters here? Maybe I am not creative enough, but I wouldn’t consider veNFT-management part of the protocol Part of the PPG framework is also the idea of multiple groups with overlapping parameters. This is clearly not the case here. There is just one multisig “owning” the maker-veNFT and performing the management. I actually don’t get why we make such a fuzz about this. @rspa has been approved as part of the multisig and he wishes to change his EOA on it. I fail to see the need for a signal, onchain poll, mip and what not… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.428571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#45",
                    "likes": "0",
                    "time": "14/11/2022-18:43:48",
                    "content": "The wider problem persists, though. MIP46 is about parameters in general, so this might a good thing to use. For the current multisig, I do request change of address from flipsidecrypto.eth to my personal address so I can participate in signings without using wider org resources. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#46",
                    "likes": "1",
                    "time": "14/11/2022-18:51:30",
                    "content": "i wonder if i should go through all mip47-compliant multisigs and check if for every EOA-change there has been a proper procedure preceding the change - any fears?  srysly, this is crazy ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#47",
                    "likes": "3",
                    "time": "15/11/2022-12:14:13",
                    "content": "Hi, we’ve now had a chance to discuss this internally. Ultimately, it is our opinion that voters decided to authorise @rspa as a signer on the multisig, rather than a specific address. In the interests of reducing on-chain governance overhead, GovAlpha proposes the following solution.   @rspa posts signed verification that he is the owner of the new address he wishes to replace his old address on this multisig. GovAlpha will verify the signature and confirm we are happy for a change to be made. We pause until Monday. If there is no significant objection from the community, we can switch addresses for Raphael. If there are significant objections, GovAlpha will propose an on-chain poll for MKR voters to settle the matter. The transaction updating the signing wallet for Raphael on the multisig is posted in this thread for transparency.  Let me or @prose11 know if you have issues with this. Or feel free to post in the thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.902146464646465
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#48",
                    "likes": "1",
                    "time": "15/11/2022-13:17:09",
                    "content": "Thanks for resolving this quickly and efficiently. The larger point remains. The DAO will continue to run into necessary small-scale updates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#49",
                    "likes": "1",
                    "time": "16/11/2022-13:03:04",
                    "content": "I have signed a message proving the ownership of my address. Signature hash: 0xf92a86fa1b5d9df64d21711f1c00164c39d295444ac8c01f05926f1d038db4b165c98ab70084167dd841fd0b560d2381305cd161a43b5c1fca27503e38ea76941c Address: 0x4f62c4228f50875a2f3be0921c4c2c41029a8bae Message: This address is owned by Raphael Spannocchi, username @rspa on the MakerDAO forum. Link: Ethereum Verified Signed Message (etherscan.io) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#50",
                    "likes": "3",
                    "time": "18/11/2022-13:24:30",
                    "content": "I confirm I have verified this signature as valid. Assuming no objections by Monday, we can proceed with the switch-over. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#51",
                    "likes": "2",
                    "time": "22/11/2022-14:53:52",
                    "content": "swapOwner transaction confirmed by the other three owners on 22 Nov 2022 14:48 UTC Optimistic L2 Transaction Hash (Txhash) Details | Optimism (etherscan.io) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#52",
                    "likes": "1",
                    "time": "22/11/2022-14:58:20",
                    "content": "All looks good to me, thanks Raph. For reference, the safe and its signers can be seen here: Safe ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.375
                }
            ]
        }
    ],
    "group_index": "1713"
}