{
    "poll_list": [
        {
            "title": "Ratification Poll for Immunefi Security Core Unit (IS-001) Facilitator Onboarding (MIP41c4-SP38) - November 14, 2022",
            "index": "16348",
            "option": "No",
            "supporting_mkr": "65,686",
            "highest_fraction": 0.86
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip41c4-sp38-immunefi-security-core-unit-facilitator-onboarding-is-001/16348",
            "title": "MIP41c4-SP38: Immunefi Security Core Unit Facilitator Onboarding - IS-001 ",
            "index": 16348,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "is-001",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "2",
                    "time": "05/07/2022-19:52:24",
                    "content": " MIP41c4-SP38: Immunefi Security Core Unit Facilitator Onboarding - IS-001  Preamble MIP41c4-SP#: 38 Author(s): @psychonaut Contributors: Tags: core-unit, cu-is-001, facilitator Status: Rejected Date Applied: 2022-07-05 Date Ratified: N/A Forum URL: https://forum.makerdao.com/t/mip41c4-sp38-immunefi-security-core-unit-facilitator-onboarding-is-001/16348 Ratification Poll URL: https://vote.makerdao.com/polling/Qma7a2fw   Sentence Summary Add @psychonaut (Jpritikin Industries, Inc) as a co-Facilitator for Core Unit IS-001: Immunefi Security.  Paragraph Summary Add @psychonaut (Jpritikin Industries, Inc) as a co-Facilitator for Core Unit IS-001: Immunefi Security.  Specification  Motivation I have worked as Deputy Facilitator for Immunefi Security since its inception on Dec 2021 and, during part of its incubation period under SES, two month prior (Oct and Nov 2021). I have taken charge of the accounting, written status updates, and contributed to our core unit’s goals. Our current Facilitator, @travinimmunefi, continues to lead with long-term strategic planning, but is stretched thin by his many other responsibilities. Often, when Travin has scheduling conflicts, I am asked to attend the weekly Mandated Actor’s meeting in his place. This MIP formalizes what is essentially already the status quo.  Core Unit ID IS-001  Facilitator name and information  Forum: @psychonaut  Discord: psychonaut#7023 Email: [email protected] Telegram: @Psychonaut7023  Ethereum Address: 0xFfC87601A80d3e4F0aF083a899e3fee203C23cF0   Facilitator Commitment  Act as a representative of the CU in internal Maker community and external communications channels Co-manage the social media accounts of the CU Co-lead the public calls hosted by the CU, including, but not limited to, office hours and those open to the Maker ecosystem Be a primary point of contact (non-technical) for other CUs Take lead on collaborations with other CUs  Example: Emergency PlayBook (w/ GovComms)   Create initiatives for the CU to provide a better service to the Maker ecosystem while collaborating with other CUs  Example: Upcoming governance Fire Drill      Facilitator Credentials  Involvement in MakerDAO  Began accumulating MKR in 2017 Contributor to the Black Thursday Vault Compensation Plan (failed)  Recognized Delegate Compensation (passed)  MKR/DAI LP proposal (failed)   Experience Prior to MakerDAO  Former primary maintainer of open source scientific software OpenMx  Author of various statistical software for R: ifaTools, pcFactorStan  Intense hobbyist interest in business design, nutrition science, mental health  2016-2021 Postdoctoral Fellow, Virginia Commonwealth University Ph.D. Quantitative Psychology, 2016 (University of Virginia) 2009–2011 Software Engineer, Palo Alto Software, Eugene, OR 1996–2001 Software Engineer, NatWest/Deutsche Bank, New York City, NY 1993–1995 Software Engineer, Various Companies, New York City, NY  Lots of contributions to free and open source software   Related Documents  Previous failed attempt to onboard as ISCU Facilitator  @travinimmunefi’s Facilitator MIP  Core Unit Mandate MIP Core Unit Budget MIP Core Unit MKR Budget MIP  ",
                    "links": [
                        "https://forum.makerdao.com/t/vault-compensation-plan-v2/3584",
                        "https://mips.makerdao.com/mips/details/MIP61",
                        "https://forum.makerdao.com/t/signal-request-allocate-20m-to-protocol-owned-uniswap-v2-mkr-dai-lp/13150",
                        "https://openmx.ssri.psu.edu/",
                        "https://cran.r-project.org/package=ifaTools",
                        "https://cran.r-project.org/package=pcFactorStan",
                        "https://www.bravenewwork.com/",
                        "https://nutritionfacts.org/video/the-story-of-nutritionfacts-org/",
                        "https://ifs-institute.com/",
                        "https://github.com/jpritikin",
                        "https://forum.makerdao.com/t/mip41c4-sp34-immunefi-security-core-unit-facilitator-onboarding-is-001/14610",
                        "https://forum.makerdao.com/t/mip41c4-sp25-immunefi-security-core-unit-facilitator-onboarding-is-001/10812",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP24",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP58",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP41",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/31",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/29",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/31",
                        "https://forum.makerdao.com/t/weekly-mips-update-112/18708",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/40",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191/33",
                        "https://forum.makerdao.com/t/weekly-mips-update-98/16940",
                        "https://forum.makerdao.com/t/governance-and-risk-198-thursday-july-07-at-17-00-utc/16370/3",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/4",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/24",
                        "https://forum.makerdao.com/t/pvl-delegate-platform/16022/42",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/112",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/137"
                    ],
                    "GPT-summary": "The post is a proposal for adding a co-facilitator to Core Unit IS-001: Immunefi Security. The author explains their motivation and credentials for the role, and outlines the responsibilities and commitments of the co-facilitator. There is no negative feedback or advertising of the proposal, but there is a previous failed attempt to onboard as ISCU Facilitator mentioned.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Community and engagement",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 4.87951912951913
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tbone",
                    "index": "#2",
                    "likes": "2",
                    "time": "05/07/2022-20:58:05",
                    "content": "For reference here is an almost identical MIP from April 2022  MIP41c4-SP34, one paragraph regarding compensation has been removed. ",
                    "links": [
                        "https://forum.makerdao.com/t/calblockchain-delegate-platform/18407/5"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#3",
                    "likes": "1",
                    "time": "05/07/2022-20:58:45",
                    "content": "How is this different than your previous failed onboarding attempt? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.888888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#4",
                    "likes": "0",
                    "time": "05/07/2022-21:28:07",
                    "content": "I believe it might be good to reflect why the previous vote failed and reapply when ready. I voted yes last time (because I believed the criticism was not strong enough to deny the opportunity) but I find it hard to vote yes again under this kind of circumstance ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.180555555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#5",
                    "likes": "1",
                    "time": "05/07/2022-21:35:30",
                    "content": "Can you clarify why you’re resubmitting a recently downvoted proposal, please? This could set a very dangerous precedent where CUs simply resubmit if they dislike a poll result. But I’m hoping there’s a strong reason for your action here. It’s not apparent from the proposal, though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.773611111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#6",
                    "likes": "2",
                    "time": "06/07/2022-16:45:00",
                    "content": " Failed Onboarding Postmortem This is my personal opinion and not an official ISCU communication. In my first attempt to onboard, the MIP marinated on the forum for two months before I received any critical comments. To preserve the option enter the August cycle, I posted this MIP again yesterday; already some Recognized Delegates have commented. I’m glad to have your prompt attention. As @Doo_StableLab and @rspa suggested, I want to offer some reflections on the recently rejected vote. I examined ballots cast with more than 33 MKR.  Feedback Received    On my performance      Flip Flop Flap Delegate LLC Platform   When you’re a facilitator you should more than likely disclosed that your post is your personal Opinion and not the voice of your Core Unit.   I haven’t been doing that. As a rough guideline, posts with the is-001 tag are official ISCU comms and everything else is my personal opinion. I will try to be explicit in the future.    Flip Flop Flap Delegate LLC Platform   A facilitator needs to be a Motivator, a peacemaker, a guide, bridge builder, and among other things a praiser. And Josh lacks these traits   @flipflopflapdelegate wrote a five paragraph explanation for his vote that is hard to summarize, but maybe this quoted chunk sums it up. Thank you for your feedback. I will renew my efforts to broadcast Facilitator vibe.  0x4303c…e46a wrote, “Agree with the sentiments about Joshua. Good community member but he does not have the right skillset to be a facilitator.” Hm, okay, I appreciate hearing your feedback. In a DM, @JustinCase re-iterated roughly the same feedback as already considered in this section.  Focus on the Core Unit, not me   @MakerMan abstained but commented, “wonder if a facilitator is even needed to manage Immunefi.” @ChrisBlec voted No and commented, “It is not apparent why ImmuneFi should be a CU at all. It should be contracted with the DAO and should have stricter obligations, metrics and general oversight than CUs have.” This is helpful. I have been nervous when some of ISCU’s promised deliverables were delayed, but I also wanted to give ample opportunity for our partners succeed. Clearly, we cannot continue to operate with such elastic deadlines. ISCU is pivoting to act on this feedback.  Alternate vote tally About 68,500 worth of anonymous MKR vote No. I listed the larger of these addresses in the No Contact Information section below. Since these voters did not offer feedback and there is no way to contact them, I cannot address their concerns. If I don my optimistic rose-colored glasses  then we can ignore these voters and the MIP lost 20k yes to 30k no. While the August cycle is possible, I won’t move this MIP from RFC to voting until I am confident that I can at least win among identifable voters.  No contact information   I would appreciate it if the following voters could provide some feedback on why they voted No:     Voter Amount     0xbba4c…65d8 18,829 MKR   0x34bbf…0942 10,527 MKR   0x49d56…1be5 9,000 MKR   Shadow Delegate 5,976 MKR   0x000be…6549 5,745 MKR   0x09202…96eb 5,000 MKR   0x250a1…079e 5,000 MKR   0x451f4…2188 5,000 MKR   0x4c0b1…ae7a 4,301 MKR   0xcc1d8…6204 2,900 MKR   0xd8bba…dfc4 1,250 MKR   0x5a849…160f 1,001 MKR     0x07294…a84e 632.81 MKR   0x11c90…9241 45.58 MKR     Abstained  Thank you for support   schuppi, Doo, ACREinvest, monetsupply, 0x4d342…05ce  Special mention   Flipside Crypto, Hasu, Feedblack Loops LLC, Penn Blockchain, GFX Labs, gauntlet, [email protected], and mhonkasalo & teemulau abstained and did not have additional feedback. The amounts of MKR were trivial, but I do appreciate the Yes votes from 0xwalterwhite.eth and 0xtylerdurden.eth. If you are not aware, these are pop culture references.  ",
                    "links": [
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/116",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/116",
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-june/16275#anticipated-soon-2"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.555322128851541
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#7",
                    "likes": "1",
                    "time": "06/07/2022-16:51:40",
                    "content": "I understand that you probably feel like you’re doing the right thing here. However, the fact that you’re still pursuing this so soon after an on-chain defeat indicates to me that @LongForWisdom was quite prescient & accurate regarding the concerns he shared previously. You should consider reading the room, stopping here, and taking a few weeks/months to reflect.     MIP41c4-SP34: Immunefi Security Core Unit Facilitator Onboarding - IS-001 Archive       Aight, fine. In multiple instances he’s made decisions and jumped to actions that are either sub-optimal or harmful in a minor way (I believe minor because he’s not had a great deal of responsibility thus far). Some of these have just been baffling, others irritating, and some infuriating. Most recently:    Announcing to delegates that we would be having emergency drills - normally you’d only get to do an emergency drill with zero prior knowledge once, we didn’t get to do that. This also led to…     ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-101/17392",
                        "https://forum.makerdao.com/t/weekly-mips-update-100/17265",
                        "https://forum.makerdao.com/t/weekly-mips-update-99/17102",
                        "https://forum.makerdao.com/t/weekly-mips-update-98/16940",
                        "https://forum.makerdao.com/t/weekly-mips-update-97/16816",
                        "https://forum.makerdao.com/t/weekly-mips-update-96/16688",
                        "https://forum.makerdao.com/t/weekly-mips-update-95/16504"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.348739495798319
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#8",
                    "likes": "0",
                    "time": "14/07/2022-01:26:22",
                    "content": "Oh, and I just learned of another famous Walter White.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#9",
                    "likes": "0",
                    "time": "16/08/2022-16:03:22",
                    "content": " MIP41c4-SP38: Immunefi Security Core Unit Facilitator Onboarding - IS-001 This is a summary of the potential impact of this proposal, from GovAlpha’s perspective:  This is a valid onboarding proposal under the currently approved governance process. This proposal seeks to onboard @psychonaut (Jpritikin Industries, Inc) as a co-Facilitator for Core Unit IS-001: Immunefi Security. If the onboarding proposal is ratified, @psychonaut will be added as a second facilitator to IS-001  This proposal has been assigned High-Impact based on the methodology listed here. Onboardings of Core Units and Facilitators will be marked as high-impact due to the facilitator’s powers and ability to impact Core unit budget decisions. This proposal has met its required time in RFC, and can enter the next monthly cycle, provided the frozen period and formal submission window guidelines are followed. For more information view MIP51: Governance Cycle Breakdown.  ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP39c2SP24",
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267",
                        "https://mips.makerdao.com/mips/details/MIP51#MIP51c1",
                        "https://forum.makerdao.com/t/weekly-mips-update-101/17392"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.339285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#10",
                    "likes": "1",
                    "time": "07/11/2022-17:24:08",
                    "content": "I should have prefaced this post with,  I respect governance’s recent decision to reject my onboarding proposal. However, I plan to reattempt onboarding once I feel that I may have overcome the reasons for the rejection. Hence, I am putting this 2nd attempt into RFC and will not put it up for vote until later.  I am aware that the EndGame MIP set has passed and that Core Units may evolve into a different organizational model. However, ISCU needs to operate today. Along with a budget renewal and mandate refresh, it seems like a reasonable opportunity to advanced my 2nd onboarding attempt to a vote. As primary bug triager and Deputy Facilitator, I already hold a high trust role in the Maker ecosystem. I ask for official recognition of my more-or-less pre-existing role in the approval of my Facilitator candidacy.  @MIP-Editors Pls advance this MIP to formal submission for the Nov cycle. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp38-modify-immunefi-security-core-unit-mandate-is-001/18208"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.705
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#11",
                    "likes": "0",
                    "time": "15/11/2022-20:27:41",
                    "content": "This subproposal is currently being voted on. Its Ratification Poll will run from 2022-11-14 to 2022-11-28. Please vote here.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "1372"
}