{
    "poll_list": [
        {
            "title": "Ratification Poll for Modifying the Content Production Core Unit Budget, MKT-001 - July 12, 2021",
            "index": "8427",
            "option": "Yes",
            "supporting_mkr": "39,437",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp21-modify-core-unit-budget-mkt-001/8427",
            "title": "MIP40c3-SP21: Modify Core Unit Budget - MKT-001 ",
            "index": 8427,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "core-unit",
                "core-unit-budget",
                "proposal-accepted",
                "archive-mkt-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#1",
                    "likes": "3",
                    "time": "29/05/2021-17:56:01",
                    "content": " MIP40c3-SP21: Modify Core Unit Budget, MKT-001  Preamble MIP41c4-SP#: 21 Author(s): Seth Goldfarb Contributors: Jerry Goldfarb, Tom DeMichele Tags: Status: RFC Date Applied: 2021-05-29 Date Ratified:   Sentence Summary This proposal extends the budget for the Content Production Core Unit for three months.  Paragraph Summary The Content Production Core Unit’s initial budget provides three months of runway (May, June, July) to establish operations in accordance with our mandate. This proposal is for a total of 201,200 Dai to fund the team for August, September, and October. Unless the team significantly expands the scope of its activities, this quarter’s budget should be ~50,000 DAI higher than a typical quarter due to the inclusion of a Continuity Fund to pay contributors in the event a budget is delayed or some other emergency occurs.  Quarterly Focus Our initial budget provides a three-month runway to get the Core Unit up and running. We’ve shared our strategy and OKRs and once we’ve onboarded all of our team members, the focus of our activities will include:  Updating the Community Portal  The Community Portal is our hub for educating people about MakerDAO and facilitate the publication of community-generated content. We’re currently implementing a plan to transfer the domain from the Foundation to the community while preserving SEO and will update the content to make it more accessible.  Creating funnels for lead generation  Distributing content gives us opportunities to catch people’s attention in different ways but that doesn’t do us any good if those people don’t know how to follow up on those opportunities. We’ll be working to ensure the content on our web properties and social channels includes calls to action (CTAs) in our content wherever appropriate and is organized to prevent stakeholders from hitting unnecessary roadblocks.  Engaging the community  Once our web properties and social channels are primed for traffic, we’ll be in a better position to focus on the best ways to drive traffic. We’re encouraged by the enthusiasm toward a mascot and are proposing a Community Management Fund that will allow us to advertise specific initiatives, fund contests and community-generated content, and take advantage of other opportunities to engage superusers, build customer loyalty, and get people excited about MakerDAO.  Quarterly Budget (August/September/October) People There is no change in compensation for any contributors compared with our previous budget, however, we’ve added a part-time role for design. We’re waiting to see how the community proceeds with the MKR Compensation Plans before making any proposal regarding compensation in MKR.     Role Name     Full-Time    Facilitator @seth   Audio Engineer/Podcast Producer @JerryAG   Video Director TBD   Social Media/Community Manager TBD   Editor TBD       Part-Time    Designer aethermilk   Writer/SEO Specialist Tom DeMichele    Programs Community Portal Tech Support - 10,000 Dai - To maintain and upgrade the CMS of the Community Portal. Community Management Fund - 5000 Dai - For promoting AMAs on Reddit and taking advantage of opportunities to host contests, pay community members to write articles, etc. once we have the contributors to coordinate these activities. Admin Based on our current projections for startup expenses and hiring, we’re aiming to retain at least 10,000 Dai from the Contingency section of our previous budget and plan to use those funds to cover any unforeseen expenses that may arise. Gas & Other We’re asking for a month’s worth of salaries (46,500 DAI) to be paid in the August budget distribution to provide a Continuity Fund in the event budget distributions are delayed and we need to pay contributors. This will go into a governance-approved multi-sig.  Breakdown     Item Amount Percentage     People     Salaries 139,500 DAI 85.96%        Programs     Community Portal Tech Support 10,000 DAI 3.372%   Community Management Fund 5,000 DAI 3.372%   Total 15,000 DAI 3.372%        Admin     Total 0 DAI 0%        Gas & Other     Gas 200 DAI    Continuity 46,500 DAI    Total 46,700 DAI 10.37%        Total 201,200 DAI 100%     Budget Implementation Simple Budget Implementation We will set up a Content Production multi-sig wallet in accordance with MIP 47 - details will be shared here once the wallet is set up. 201,200 Dai covers 3 months; we’re requesting: 98,067 Dai in August 51,567 Dai in September 51,567 Dai in October Address: 0xDCAF2C84e1154c8DdD3203880e5db965bfF09B60 ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp5-content-production-core-unit-mkt-001/6823",
                        "https://forum.makerdao.com/t/mip40c3-sp5-core-unit-budget-mkt-001/6824",
                        "https://www.notion.so/Mandate-OKRs-and-Content-Strategy-2bcb2eafb39c4315884faf6120a061fa",
                        "https://community-development.makerdao.com/",
                        "http://aethermilk.com/",
                        "https://mips.makerdao.com/mips/details/60626de7e65b747f996b3d78#simple-budget-implementations",
                        "https://forum.makerdao.com/t/mip47-makerdao-multisignature-wallet-management/6338",
                        "https://forum.makerdao.com/t/adding-content-production-multisig/8428",
                        "https://forum.makerdao.com/t/adding-content-production-multisig/8428",
                        "https://forum.makerdao.com/t/weekly-mips-update-45/9427",
                        "https://forum.makerdao.com/t/maker-relay-ep-53-en-espanol/9330",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-149-thursday-july-8-17-00-utc/9227/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-53/9305",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/40",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-149-thursday-july-8-17-00-utc/9227/4",
                        "https://forum.makerdao.com/t/content-production-bi-weekly-update-june-25-july-7-2021/9257",
                        "https://forum.makerdao.com/t/maker-governance-review-june-2021/9211",
                        "https://forum.makerdao.com/t/mip40c3-sp33-modify-core-unit-budget-mkt-001/10150",
                        "https://forum.makerdao.com/t/weekly-mips-update-42/9010",
                        "https://forum.makerdao.com/t/weekly-mips-update-41/8892",
                        "https://forum.makerdao.com/t/maker-relay-ep-49-en-espanol/8795",
                        "https://forum.makerdao.com/t/maker-relay-ep-49/8763",
                        "https://forum.makerdao.com/t/weekly-mips-update-40/8759",
                        "https://forum.makerdao.com/t/mip40c3-sp33-modify-core-unit-budget-mkt-001/10150/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-46/9532",
                        "https://forum.makerdao.com/t/maker-relay-ep-54/9437",
                        "https://forum.makerdao.com/t/maker-relay-ep-54-en-espanol/9476"
                    ],
                    "GPT-summary": "This post is a proposal to extend the budget for the Content Production Core Unit for three months. The proposal includes a breakdown of the budget and a quarterly focus on updating the community portal, creating funnels for lead generation, and engaging the community. The post also includes a request for feedback and questions from third parties, as well as constructive criticism.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.493243243243243
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#2",
                    "likes": "1",
                    "time": "01/07/2021-17:56:41",
                    "content": "Moving to Formal Submission ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "29/09/2021-17:57:33",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "3721"
}