{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-legal-structures-of-makerdao/4390",
            "title": "[Discussion] Legal structures of MakerDAO ",
            "index": 4390,
            "category": [
                "Governance"
            ],
            "tags": [
                "real-world-finance",
                "legal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "3",
                    "time": "24/09/2020-18:06:34",
                    "content": "Working on real world asset you quickly find yourself with legal contracts and KYC. Currently, MakerDAO and most DAO are dodging the issue. We have ways to continue to dodge it with RWA (by using Maker representatives for instance). We don’t have a legal team yet, but that shouldn’t stop us from thinking. In my understanding a DAO is a general partnership where MIPs and MKR tokens are the agreement and this forum a proof of existence. Each country has its own legal framework and “is a DAO a legal entity?” remains unknown. In any case, a general partnership has unlimited liabilities, so you don’t want to have any responsibility or liability at MakerDAO level. While launching a smart contract protocol can be said to be non legally binding, it’s still a gray area). Not having legal contract make it uneasy to exercice collateral rights on RWA liquidation (as the collateral is not in the vault). Currently, the solution is to use a Maker Representative which is more a bandaid than a good solution and/or a Foundation. A better solution might be to have a limited liability subsidiary to manage real world stuff. What are your opinions on those subjects? Do you have links to documentation (previous court cases with a DAO, other DAO having real world business, …)? Resources:  https://daotalk.org/t/resource-list-dao-legal/533  ",
                    "links": [
                        "https://forum.makerdao.com/t/poll-rwa-working-group-centrifuge-model/4381",
                        "https://en.wikipedia.org/wiki/General_partnership",
                        "https://www.coindesk.com/makerdao-users-sue-stablecoin-issuer-following-black-thursday-losses",
                        "https://daotalk.org/t/resource-list-dao-legal/533",
                        "https://forum.makerdao.com/t/new-collateral-whole-life-insurance/4854/10",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-112-thursday-october-1-16-00-utc/4391/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-14/4450",
                        "https://forum.makerdao.com/t/brainstorm-2021-mission-and-objectives/5809/36",
                        "https://forum.makerdao.com/t/team-funding-experiment-rwa-objectives-and-cost-structure/5954",
                        "https://forum.makerdao.com/t/rwa-resena-de-los-ultimos-dos-meses-actualizaciones-y-lo-que-viene/5272",
                        "https://forum.makerdao.com/t/discussion-the-dao-needs-a-serious-discussion-about-legal-structure/10764/8",
                        "https://forum.makerdao.com/t/rwa-last-2-months-review-updates-and-looking-forward/5225",
                        "https://forum.makerdao.com/t/agenda-discussion-rwa-onboarding-call-1-wednesday-september-30-17-00-utc/4475",
                        "https://forum.makerdao.com/t/relay-ep-14-en-espanol/4457"
                    ],
                    "GPT-summary": "The author of the post is discussing the legal structures of MakerDAO and how it relates to real-world assets. They are seeking feedback and opinions on the subject, as well as any relevant documentation or resources. The post does not advertise or extend to a proposal, nor does it contain entirely positive or negative feedback.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.814331501831502
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#2",
                    "likes": "1",
                    "time": "24/09/2020-19:48:00",
                    "content": "I think we entered all this RWA 2-3 years too early when the ecosystem does not exist and exercising rights is limited to whales and residing in the same country as the issuer. The system might be abused to take advantage of that / scam average users. I think DAI should grow by locking 10%-20% of ETH ($3-$6B at today’s prices) and then look for different options to grow above $10B including RWA. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.898809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#3",
                    "likes": "5",
                    "time": "25/09/2020-11:15:56",
                    "content": "    bit:  this RWA 2-3 years too early when the ecosystem does not exist   I hear you. At the same time, it is otherwise a permanent paradox of waiting for it to exist until we go out and just do it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#4",
                    "likes": "1",
                    "time": "25/09/2020-15:48:38",
                    "content": "Responsibility should reside with some entity.  Just how MakerDAO wishes to structure that entity is something that will inevitably be researched, discussed, and voted on.  The real world cares deeply about responsibility and reputation.  We should aim to develop a good one for this DAO and its subsidiaries. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#5",
                    "likes": "0",
                    "time": "27/09/2020-09:04:38",
                    "content": "Thanks for starting this discussion. I think it is going to be a topic of great importance in the next few years.     SebVentures:  Not having legal contract make it uneasy to exercice collateral rights on RWA liquidation (as the collateral is not in the vault).   Uneasy or impossible? Understanding precisely this point seems key to this discussion. Unfortunately I am not an expert (in fact, I am totally ignorant) of laws and legal aspects, so I don’t know. But it seems to me like we need to understand exactly WHY and TO WHAT EXTENT we need a legal representative. If we can get away without legal entities (even at some cost), we should should try to do that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#6",
                    "likes": "4",
                    "time": "27/09/2020-11:16:54",
                    "content": "I pushed some extra hours researching this subject. The field is still early.  TheDAO did incorporate a LLC in Switzerland to conduct business. TheDAO crashed soon after so not much to be learnt here. OpenLaw provide services to set a DAO as a LLC. But it’s not very relevant here as you need accredited investors and probably KYC.  dOrg did something similar to have a limited liability DAO. I left the security issue out because there is no solution for that. Jurisprudence shows that it’s not that costly (EOS owners had to pay $24M for a 4B issuance). Taxation will probably be a concern as well. In some/most jurisdictions you might have to declare DAI earned in the surplus buffer as taxable income. No one want to do that I guess.   The why of a legal structure ?   Protect MKR holders and workers. Both from early taxation and legal liability. Black Thursday shows that the lack of a limited liability entity move any issue to MKR holders. The Maker Foundation is shielding other MKR holder for now (too big and too easy to attack). In the future, I guess mandated actors will be the first line. They will have a hard time to prove that they were just contractors without any form of contract.   Enforce our rights. If we lend 1M DAI to anyone without collateral control, he can walk away without much fear. We argue that we are, in fact, a general partnership and send someone to represent Maker (not to be confused with the Maker Representative) as a partner. But this very person will therefore be the target of the point 1.    The Maker Representative, coinvestors and trusts There is 3 ways currently to solve this issue and enforce our rights without acting too much like a legal entity.   The Maker Representative: Thanks to @mrabino1 the idea is to have someone outside of Maker to defend Maker interests using it’s own legal stature. My thinking makes me feel that the representative shouldn’t own any MKR token and don’t be participating in governance or he would be an easy target.   The coinvestor: Quite similar to the Maker Representative, the coinvestors is just some that will defend its own interests that will help us as well. For instance, if Circle start stopping USDC conversion, we might expect people to sue them over breach of contract. That will help us as well.   The trust: We might set up a trust with rules that go in our benefits even without having any link with it. Think of the DAI Foundation.   Those options are great to get thing rolling, but they don’t make me feel comfortable. Moreover, they don’t protect MKR holders and workers from litigation. I’m not talking about something hypothetical here. It happened and will happen again.     iammeeoh:  Uneasy or impossible?   I would say uneasy (but okay) at start, impossible at scale. But I start the discussion to have more feedback and ideas. I touched the subject on the [Discussion] MakerDAO in 5 years thread. If we want Maker to be independent and powerful in 5 years (something with a 10-100B market cap), this has to be solved or this will blow up in one way or another. ",
                    "links": [
                        "https://cointelegraph.com/news/dorg-llc-purports-to-be-first-legally-valid-dao-under-us-law",
                        "https://cointelegraph.com/news/maker-foundation-faces-new-lawsuit-demanding-28m-for-black-thursday-liquidations",
                        "https://forum.makerdao.com/t/discussion-makerdao-in-5-years/3804",
                        "https://forum.makerdao.com/t/lending-money-to-any-company-with-assets-in-europe-and-around-the-world-rwa/5508/2",
                        "https://forum.makerdao.com/t/governance-and-general-partnership-liability/8863/10"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.479541292041292
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#7",
                    "likes": "2",
                    "time": "28/09/2020-08:32:35",
                    "content": "In my eyes, a Trust managed by a regulated well established Trustee is the best angle for scale. Structured Asset Backed transactions have been using Trusts for decades. Nothing new here. The novel approach here is to both grant MakerDAO governance levers to control the LendCo <-> Trust agreement (the credit agreement) and when to liquidate the vault. That said, the community needs to have oversight over the LendCo activities. It really shouldnt just be one Maker Representative. The community should advocate for many.     SebVentures:  My thinking makes me feel that the representative shouldn’t own any MKR token and don’t be participating in governance or he would be an easy target.   For this, it doesnt matter if that one Maker Rep has 1 MKR or 100. I dont really understand how anyone would be a “target” (or what that means). MKR Governance always retains the right to add new Maker Reps or just remove or replace them. So, in the scenario that an individual is compromised (e.g. kidnapped or bribed or deemed “dirty”, (s)he / they can be replaced with one vote).     SebVentures:  Those options are great to get thing rolling, but they don’t make me feel comfortable. Moreover, they don’t protect MKR holders and workers from litigation. I’m not talking about something hypothetical here. It happened  and will happen again.   As for attempting to remove all aspects of litigation, not going to happen. The real world is a litigious animal. The question is not how to avoid litigation, it is how can attack vectors be minimized and positioning the structure and the parties to win. There is no way to be immune to litigation and live in a civilized world. For real world asset transactions where capital is deployed from MKR, this is no different. The best protection from any litigation is long standing jurisprudence and an efficient Court of Law while being compliant with Law. For a Trust with a regulated Trust Company (Trustee) as a fiduciary, a Trust Company will only serve in that capacity after they get an enforceability opinion for the Trust Agreement and all operative documents. Their entire business model derives from being compliant with the Law. Further, they have a fiduciary obligation to protect the Trust. They will retain external counsel if the Trust is drawn into litigation. With regard to the Maker Rep, as outlined above, it is an administrative role with the primary responsibility of being a proxy of confidential information to the public. This is a trusted role but one that the Maker Rep can easily resign or be replaced. Even if this partied was drawn into litigation, this should be an indemnified role. The objective of this role is to tell the truth and be honest in his / her assessment of {insert whatever he / she is looking at}. The only true risk this role has is when the party is dishonest and damage is caused. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3426472517381605
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#8",
                    "likes": "1",
                    "time": "28/09/2020-09:01:14",
                    "content": "By target I mean the Maker representative is a public facing role that can easily targeted by litigation by anyone wanting to sue MakerDAO (just like the Foundation was). Indeed, MakerDAO can change him/her quickly. That doesn’t make the previous representative life easier. If MakerDAO is seen as a general partnership, any partner can have unlimited liabilities on any action by MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#9",
                    "likes": "1",
                    "time": "28/09/2020-09:21:50",
                    "content": "    SebVentures:  By target I mean the Maker representative is a public facing role that can easily targeted by litigation by anyone wanting to sue MakerDAO (just like the Foundation was).   Quite possible. This is also true for both of us just having our names on this forum or participating in Maker Governance itself. No one can stop litigation in a civilized society. No doubt it can be make life annoying. Having retained counsel to fight litigation, I can say it is no fun. For certain any party that gets pulled into litigation will also file counterclaims. Therein lies the Maker Reps true defense. He / she is just a proxy to share information and not MakerDAO. The counterclaims that would be filed to sue a rep would / should exceed that of the original claim. Frivolous litigation is well… Annoying to say the least. Is there a way to structure thing to completely remove this? Put simply. No.     SebVentures:  If MakerDAO is seen as a general partnership, any partner can have unlimited liabilities on any action by MakerDAO.   While I am not an attorney, being a part of general partnership (if that is what a DAO is ultimately deemed which is questionable) might make an individual responsible for his / her part of the liabilities, but not all of them. You can imagine the smaller the MKR holders, the less interesting the return per claim. This is the difference between “The Law” and “The business of the Law”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.018690476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lex_node",
                    "index": "#10",
                    "likes": "8",
                    "time": "30/09/2020-17:23:02",
                    "content": "lex_node here 10+ years corporate & tech atty, have been sounding the alarm on this issue for years now; glad some people are starting to pay attention I don’t have easy solutions but let’s just say MakerDAO was lucky not to face a more creative plaintiff’s attorney in the Black Thursday lawsuit. I think what’s ultimately needed is some kind of joint venture among all/many of the DeFi active governance protocols to fund an entity that provides governance execution (and a measure of industry self-regulation) as a service. That entity could, in effect, be paid to take on a lot of the risks that DAO members would otherwise face as general partners. It could obtain insurance, or use self-insurance, to fund recoveries. Responsibility/liability is inevitable and this seems like the best way to get ahead of it. I’d be interested in talking with people who are serious about setting it up and have lost interest in “we’re decentralized so there’s no liabilities!,” which is not an argument that’s going to stand the test of time, believe me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.104166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lex_node",
                    "index": "#11",
                    "likes": "2",
                    "time": "30/09/2020-17:26:51",
                    "content": "    mrabino1:  While I am not an attorney, being a part of general partnership (if that is what a DAO is ultimately deemed which is questionable) might make an individual responsible for his / her part of the liabilities, but not all of them. You can imagine the smaller the MKR holders, the less interesting the return per claim. This is the difference between “The Law” and “The business of the Law”.   No, it’s the exact opposite. A general partnership imposes unlimited joint and several liability–that’s exactly why it’s so much worse than having a gov’t-sanctioned entity (which provides limited liability). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.053968253968254
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#12",
                    "likes": "2",
                    "time": "30/09/2020-17:33:12",
                    "content": "Interesting… so going to move any Maker I may (or may not have) into a single purpose Delaware limited liability company !! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.542410714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "0",
                    "time": "30/09/2020-19:25:29",
                    "content": "    lex_node:  I think what’s ultimately needed is some kind of joint venture among all/many of the DeFi active governance protocols to fund an entity that provides governance execution (and a measure of industry self-regulation) as a service. That entity could, in effect, be paid to take on a lot of the risks that DAO members would otherwise face as general partners. It could obtain insurance, or use self-insurance, to fund recoveries.   So, pretty much you recommend Centralizing All DAO’s and going back to old ways of corporate bank structures? If so, a hierarchical structure—yea… not sure if folks are going to want that. What can you do…  What about SEC Commissioner Hester Peirce proposed safe harbor? The goal of the Maker Community is to fully decentralize within the next 36 months/or, less. And let us be honest–you and I can sue JP Morgan Chase tomorrow morning–regardless of how many registrations, insurance, or different legal entities. It just comes with the territory, IMO ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.514705882352942
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#14",
                    "likes": "1",
                    "time": "30/09/2020-19:31:47",
                    "content": "    lex_node:  I think what’s ultimately needed is some kind of joint venture among all/many of the DeFi active governance protocols to fund an entity that provides governance execution (and a measure of industry self-regulation) as a service. That entity could, in effect, be paid to take on a lot of the risks that DAO members would otherwise face as general partners. It could obtain insurance, or use self-insurance, to fund recoveries.   +1 . Someone had a tweet akin to “who is going to govern all of these protocols” Great insight @lex_node ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.316666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lex_node",
                    "index": "#15",
                    "likes": "1",
                    "time": "30/09/2020-19:48:15",
                    "content": "    flipflopflapdelegate:  So, pretty much you recommend Centralizing All DAO’s and going back to old ways of corporate bank structures? If so, a hierarchical structure—yea… not sure if folks are going to want that. What can you do…   No, I don’t recommend that. It would be moronic. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#16",
                    "likes": "2",
                    "time": "30/09/2020-20:25:51",
                    "content": "The safe harbour (and the Howey test) is more about the securities aspect. I would say that will not help Maker neither but that’s for another topic. You can sue JP Morgan Chase as you want, the JP Morgan Chase shareholder will not really care. They have limited liability so in the worse case they lose their investment. They don’t go bankrupt or in jail. On the other side, if you suggest an emergency signal request and vote the executive that lead to breaching a somewhat non formalized contract with a borrower, this borrower might want to sue you. Would that lead to something? I’m not a lawyer and I hope not, but you would prefer to be a JP Morgan shareholder at this point. One may argue that we are more like a private bank. I’m quite sure the Medici were quite decentralized due to the lack of communication technology of their era. The limited liability is one of the most powerful innovation in the world. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.645408163265307
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#17",
                    "likes": "0",
                    "time": "30/09/2020-20:30:53",
                    "content": "    lex_node:  Responsibility/liability is inevitable and this seems like the best way to get ahead of it. I’d be interested in talking with people who are serious about setting it up and have lost interest in “we’re decentralized so there’s no liabilities!,” which is not an argument that’s going to stand the test of time, believe me.   Great, would love to have a chat with you. If there is interest we can make a meeting and/or working group. Those interested can reply on this thread or send me a message. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.761904761904763
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#18",
                    "likes": "0",
                    "time": "01/10/2020-14:01:01",
                    "content": "    SebVentures:  On the other side, if you suggest an emergency signal request and vote the executive that lead to breaching a somewhat non formalized contract with a borrower, this borrower might want to sue you.   Super valid point Seb. This is probably why some of the VCs that hold MKR in the U.S. are not partaking in the Governance of Maker. What can you do… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#19",
                    "likes": "0",
                    "time": "31/12/2020-20:01:06",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}