{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/product-discussion-maker-owned-fuse-pools-and-maker-fuse-d3m/13955",
            "title": "Product Discussion: Maker Owned Fuse Pools and Maker Fuse D3M ",
            "index": 13955,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "discussion",
                "d3m",
                "fuse"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Sean",
                    "index": "#1",
                    "likes": "23",
                    "time": "16/03/2022-12:49:48",
                    "content": " Overview This post outlines new product ideas regarding Rari Capital’s Fuse Protocol. We aim to explain why we believe that it is worth looking into onboarding a Maker owned Fuse Pool and implementing a D3M for that corresponding Fuse Pool. This post includes (i) a brief introduction to Rari Capital’s Fuse Protocol, (ii) examples of other stablecoin issuers that are currently involved in Fuse, (iii) how MakerDAO could potentially benefit from Fuse, and (iv) an overview of the suggested next steps.  Rari Capital Fuse Pools Rari Capital’s Fuse Protocol allows the creation of lending pools, or money markets, with any combination of tokens for lending and borrowing. To date, lending and borrowing protocols such as Compound and Aave have utilized a single-pool model. This means that all approved assets deposited into the protocol are pooled together. This model has several benefits. It enables increased liquidity, minimises fragmentation and allows for more effective cross-collateralization. However, in order to reduce and manage risk, the type of collateral that can be onboarded is constrained. The onboarding process must be prudent and cautious, as users of the protocol assume the risk of all the tokens in the protocol. As a result, higher-risk assets are excluded. This implies an opportunity cost for more risky long-tail assets. In contrast, the Fuse Protocol isolates risk into siloed pools. These pools can be seen as separated and isolated money markets. This means that the failure of an asset in one pool does not cross-contaminate to other separated pools. Fuse refers to these as Permissionless Pools. They are customised pools that can be created by anyone and can support any conceivable asset with a price feed, without increasing the overall risk of the Fuse protocol. Specific pool parameters can be set, allowing pool creators to determine the exact risk level desired. These parameters include (i) collateral factor, (ii) reserve factor, (iii) whitelisting, and (iv) liquidation incentives. More information about what parameters and preferences that Fuse pool creators can set is available here.  Examples of Fuse Integrations Fuse has circa $875 million worth of supplied value. Several DeFi stablecoin issuers either have their own Fuse Pool or are supplying liquidity to one or several pools. It is useful to examine how other stablecoin projects are engaged with the Fuse Protocol in order to identify how MakerDAO might utilize Fuse for its own benefit. To this end, a few examples are listed below.  Example 1: FEI Protocol and Tribe Fei and Rari have engaged in an extensive collaboration. Recently, the two projects underwent a merger. Notable products include: (i) the FeiRari (Fei DAO Pool) Fuse Pool 8 and (ii) the Tribe Turbo product. At the time of writing, Fei’s Pool 8 is the largest Fuse pool in existence with circa $450 million supplied. The pool offers a diverse range of collateral types that allow for interesting farming strategies. Collaterals include:   D3: D3 is a Curve LP pool consisting of alUSD, FEI, and FRAX. Users can provide liquidity on Curve and then use the LP token as collateral in Pool 8 with added TRIBE incentives.  TRIBE: FEI’s governance token, TRIBE, can be used as collateral within the pool. It can only be deposited and not borrowed. Offering TRIBE as collateral increases the utility of the token without increasing the risk of a governance attack from malicious actors borrowing TRIBE to cast votes in the DAO. Offering TRIBE in the same pool that receives TRIBE incentivised rewards also gives users a place to directly deposit their rewards to compound their farming strategies.  wstETH and ETH: Users can boost their stETH rewards in Pool 8 with a low-risk rate arbitrage strategy. (i) Deposit wstETH in Fuse Pool 8, (ii) borrow ETH, and (iii) stake the ETH on Lido. This process can be repeated several times.  The Tribe Turbo product enables DAOs to bootstrap liquid lending markets with their own protocol tokens. This is achieved by putting up tokens from a DAO’s treasury as collateral in a so-called “Turbo Safe” to borrow FEI. The FEI loan is 0% interest. However, the borrowed FEI is automatically redeployed into an ERC-4626 yield generating strategy on Fuse. The DAO then splits the revenue generated from the yield strategy with the Tribe DAO. This strategy enables any DeFi token to become productive and gives users the ability to borrow FEI against any DeFi token.  Example 2: Volt Protocol Volt, a fork of RAI, is a new stablecoin project built in partnership with the Fei / Rari Tribe. The VOLT stablecoin’s unit of account will start at $1, and then adjust over time according to Consumer Price Index (CPI) data, in order to become “a stablecoin that defeats inflation”. All VOLT tokens will be backed by both user-deposited assets and protocol controlled yield sources that yield a higher return than the prevailing inflation numbers. VOLT will primarily be issued through a Peg Stability Module (PSM). Users will be able to mint and/or redeem VOLT at the current target price in exchange for accepted stablecoins. Initially, only a FEI PSM will be available. The Protocol Controlled Value (PCV) FEI will be deposited into Fuse Pool 8 to earn yield. The Volt Protocol will also issue VOLT directly into Pool 8.  How Fuse can benefit MakerDAO There are several ways that MakerDAO can benefit from Rari Fuse Pools. We have outlined four possibilities below.  Possibility 1: Supporting Long-Tail Assets In the last few months, we have seen occurrences of collateral offboarding. There have been two main reasons for this. (i) The maintenance costs have outweighed the revenue produced. (ii) Certain collateral types have been too illiquid, which has increased the risk of the vaults. Fuse allows pool creators to choose between different third-party oracle providers. In practice, the fees associated with the oracle are subsidized as there are no recurring oracle costs. Fuse normally charges a 10% fee generated from the interest paid by borrowers. However, the key point is that, unlike Maker at present, no revenue threshold from stability fees is required to meet oracle costs. A Maker owned Fuse pool would also allow MakerDAO to support low liquidity assets. The advantage of a Fuse pool, is that creators have greater control of risk parameters. They can mitigate risk by setting supply caps, whitelisting certain addresses, and limiting particular collateral from being borrowed and only supplied. In summary, by adopting Fuse, Maker would have greater flexibility and choice in onboarding either new or previously offboarded collateral types, that we would like to support, but are at present not viable as vault collateral.  Possibility 2: D3M - Full Control of Our Own Secondary Market The D3M is a very powerful tool. However, the exposure of the D3M is normally limited by the particular parameters and conditions of the associated lending market to which the DAI is being issued. This includes solvency and credit risk of the counter protocol. A D3M implementation to a Maker Fuse Pool would allow Maker to extend DAI minting rights to its own lending market. By having full control of the market where DAI is issued via the D3M, Maker could completely eliminate certain counter protocol related risks. However, there would still be other risks involved, such as governance risk, smart contract risk, and competitive risks.  Possibility 3: MKR as Collateral - Safety through Flexibility Fuse pools can be easily customised. This flexibility means that pools can support assets as collateral while disabling the same asset for borrowing. The usefulness of the MKR token would be increased if MakerDAO were to offer it as lending collateral in a Fuse pool to generate yield. By disabling borrowing of the MKR token, the risk of governance attacks or Emergency Shutdown (ES) attacks would be controlled. At present, MKR can be borrowed on Aave and Compound. This entails preexisting governance and ES attack risk. Maker could create a Fuse pool for MKR tokens and several acceptable stablecoins, including DAI and the ones currently held in PSMs. The governance and ES attack risks could be reduced if the incentives for depositing MKR on a Maker Fuse pool were to be higher than on Aave and Compound. To avoid collateralizing DAI with MKR tokens a D3M should probably not be deployed to a pool where MKR is used as collateral.  Possibility 4: D3M - Scaling DAI by Supporting other Fuse Pools D3Ms can also be added to any other Fuse Pool that supports DAI. For example, Maker could implement a D3M to the FeiRari Pool 8 as it supports DAI for both borrowing and lending.  Conclusion The Fuse Protocol offers many new and interesting opportunities. As of right now, we believe that two key opportunities offer the most direct and immediate benefit to MakerDAO: (i) Create our own Maker Fuse Pool and (ii) support it with a D3M. Further discussion, research and development is needed. This would be a cross-functional initiative requiring collaboration between several core units, delegates and other community members. In addition, a deeper analysis of the business case would be necessary to determine the amount of DAI minting that would result from the adoption of the Fuse Protocol. It is also important to note that this product discussion does not suggest the onboarding of any specific collateral types. The aforementioned assets in this post are only mentioned as examples to help illustrate the flexible design and potential of Maker owned Fuse Pools. Voting at a later stage would determine which assets to onboard. The selection of appropriate collateral would most likely require its own collateral onboarding process with input from CES, other core units, and the Maker community at large. It would also be advantageous to examine any partnerships or synergies that could be created with the Fei / Rari Tribe.  Suggested next steps At this point, we would value any questions, ideas, or suggestions from the community. We will gather feedback over the next few weeks. If there are no clear objections, we will proceed by posting a Signal Request to ask the community if Maker should onboard a Maker owned Fuse Pool and a corresponding D3M implementation. ",
                    "links": [
                        "https://newsletter.banklesshq.com/p/is-rari-undervalued?utm_source=url",
                        "https://raricapital.medium.com/rari-capital-permissionless-fuse-pool-guide-ad4da19e0a17",
                        "https://info.rari.capital/products/fuse/#the-following-parameters-and-preferences-are-chosen-by-the-pool-creator-when-creating-a-fuse-pool",
                        "https://thedefiant.io/rari-capital-fei-merger/",
                        "https://app.rari.capital/fuse/pool/8",
                        "https://github.com/fei-protocol/tribe-turbo",
                        "http://curve.fi/factory/57/",
                        "https://twitter.com/joey__santoro/status/1492998265863770112",
                        "https://medium.com/fei-protocol/the-tribe-dao-strongly-believes-that-a-healthy-and-thriving-defi-ecosystem-needs-a-robust-platform-b1faea700dfa",
                        "https://eips.ethereum.org/EIPS/eip-4626",
                        "https://github.com/volt-protocol/whitepaper/blob/main/volt.md",
                        "https://tribe.fei.money/t/fip-88-volt-joins-the-tribe/4007",
                        "https://info.rari.capital/products/fuse/",
                        "https://app.rari.capital/fuse/pool/8",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-march-2022/14424",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-10-16-2022/13977",
                        "https://forum.makerdao.com/t/lending-market-analysis-cross-collateralization-market-opportunity/14763",
                        "https://forum.makerdao.com/t/mip65-project-clydesdale-monetalis-arrangement-i-liquid-bond-strategy-execution/13148/68",
                        "https://forum.makerdao.com/t/fei-mip6-collateral-onboarding-application/14895"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.680048701298701
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MightyOx",
                    "index": "#2",
                    "likes": "5",
                    "time": "21/03/2022-15:37:41",
                    "content": "Fantastic idea. I’ve seen several requests on the forum and Discord for Rari-style vaults that can combine different tokens as collaterals. Strategically working with Rari could be a great way to widen our network and capture these smaller/diversified investors. Another D3M and more decentralized collaterals? Yes, please! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#3",
                    "likes": "16",
                    "time": "23/03/2022-00:29:21",
                    "content": "Big supporter of this. From a technical/scaling side, I’ve taken a first look at the interface and it is straight forward to add to our D3M arsenal. Once we have one D3M setup, we can add a D3M to any pool as easy as onboarding an ERC20 token (it’s even easier actually). This will be super-scalable as PE could offload cool and innovative ideas of new pools to the other teams such as Risk, CES, Growth, etc. Additionally, we will probably be able to get DAI minting up and running on new chains quicker with a skeletal deployment of MCD and just the D3Ms in play first as they don’t have to deal with complexities like oracles prices, liquidations, etc. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.011946386946388
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#4",
                    "likes": "1",
                    "time": "23/03/2022-11:29:24",
                    "content": "Awesome overview. I’m a bit unclear about what is meant by Possibility 1 → Would that mean (1) creating a fuse pool, and onboarding that pool as collateral in Maker, or (2) just a pool owned by Maker governance? If (2), how would that benefit Maker? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "1",
                    "time": "23/03/2022-12:35:52",
                    "content": "Great overview. As someone who has messed around with Fuse Pool #8 I can tell you that it’s Gas intensive (back then, not sure if anything has improved), but also that there’s a dust parameter when borrowing–of at least 1 ETH worth of collateral. Pretty sure you know this. With DAI Borrow supply currently at less than 2M and the APY at 7%++, I’m a supporter of implementing the D3M. But also, the usage of MKR as a collateral type is interesting  As you said, you can disable the asset for borrowing (As FEI does w/TRIBE). Thank you for the improvisation–looking forward to many more. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.196969696969696
                },
                {
                    "author_link": "https://forum.makerdao.com/u/superTricycle",
                    "index": "#6",
                    "likes": "1",
                    "time": "23/03/2022-19:47:31",
                    "content": "I’d like to support another D3M but I’m on the fence because Tribe is directly competing with MakerDAO as a stablecoin issuer with FEI. They’ve said that Turbo is an evolution of Maker and we’d be encouraging people to use them over us. Why would Tribe would want MakerDAO providing DAI when they’ve set up Turbo pools to distribute FEI at 0% interest? This overview thread agrees that their primary objective is to increase adoption of FEI. I don’t see how they would be cool with their main competitor rolling in and using their tech to distribute a rival product and generate revenue (but would be pretty chad of us ngl). It’s a bandaid for Maker’s long-tail crypto collateral expenses. Fuse pools use Chainlink or Uni/Sushi/TWAP Oracles, but we know TWAPs get rekt. There’s no need to compound risk and depend on Rari for smaller collateral. We can cut out FeiRari as the middleman and work with Chainlink oracles on long-tail crypto assets for the same oracle cost savings. We can then control the vault parameters ourselves to mitigate oracle risk and keep users in the Maker wheelhouse. If it’s straghtforward to implement then cool let’s consider it. But let’s discuss if we want to give a direct stablecoin issuing competitor our business when we can work to fix our crypto collateral issues ourselves. ",
                    "links": [
                        "https://www.silo.finance/post/history-of-exploits-rari-capital"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.858333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#7",
                    "likes": "1",
                    "time": "24/03/2022-10:46:00",
                    "content": "This would be a Maker governance owned pool. Advantage of this model is that we have compleat control of all the parameters and assets in the pool, aditionally we would generate some revenue from borrowers, in addition to interest accrued from supplying dai. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#8",
                    "likes": "0",
                    "time": "24/03/2022-23:59:19",
                    "content": "Hi! Maybe a dumb question, but what kinds of pools would Maker want to have? This is basically to be a “second tier” way to lend? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#9",
                    "likes": "0",
                    "time": "25/03/2022-00:21:48",
                    "content": "    superTricycle:  Fuse pools use Chainlink or Uni/Sushi/TWAP Oracles   They don’t need to. A MakerDAO owned pool could use Maker oracles. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/superTricycle",
                    "index": "#10",
                    "likes": "0",
                    "time": "26/03/2022-17:10:43",
                    "content": "That defeats the purpose of this proposal. A key here is to offload operational oracle costs to support more collateral.     Sean:  In the last few months, we have seen occurrences of collateral offboarding. There have been two main reasons for this. (i) The maintenance costs have outweighed the revenue produced. (ii) Certain collateral types have been too illiquid, which has increased the risk of the vaults. Fuse allows pool creators to choose between different third-party oracle providers. In practice, the fees associated with the oracle are subsidized as there are no recurring oracle costs.   Using Maker oracles puts us back at square one for paying to maintain price feeds. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.425595238095237
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#11",
                    "likes": "1",
                    "time": "12/04/2022-07:59:51",
                    "content": "So I don’t know the details but seems like there’s something wrong with liquidation for one of Fuse pools? Can we ensure this doesn’t happen to potential maker owned ones?   twitter.com    FreddieRaynolds @FreddieRaynolds  @_tonychew_@12yearoldwithcc They have no reason to, why pay $1.5M for $5k? Pool already has alot of bad debt so people who lent assets can't withdraw.   1:22 AM - 12 Apr 2022           8                1              twitter.com    Marc Zeller @lemiscate  DeFi governance is useless and boring! Risk parameters? Bla bla bla.  -Famous last words. https://t.co/HueRG7SRtr   7:54 AM - 12 Apr 2022           12            ",
                    "links": [
                        "https://twitter.com/FreddieRaynolds/status/1513688890879660039?t=tLqK-W-wBlM60w3_9jOqcA&s=19",
                        "https://twitter.com/FreddieRaynolds/status/1513688890879660039?t=tLqK-W-wBlM60w3_9jOqcA&s=19",
                        "https://twitter.com/_tonychew_",
                        "https://twitter.com/12yearoldwithcc",
                        "https://twitter.com/FreddieRaynolds/status/1513688890879660039?t=tLqK-W-wBlM60w3_9jOqcA&s=19",
                        "https://twitter.com/lemiscate/status/1513787602490564609?t=gPJYxARmFuPfwOJh_0wPaQ&s=19",
                        "https://twitter.com/lemiscate/status/1513787602490564609?t=gPJYxARmFuPfwOJh_0wPaQ&s=19",
                        "https://twitter.com/lemiscate/status/1513787602490564609?t=gPJYxARmFuPfwOJh_0wPaQ&s=19",
                        "https://t.co/HueRG7SRtr",
                        "https://twitter.com/lemiscate/status/1513787602490564609?t=gPJYxARmFuPfwOJh_0wPaQ&s=19"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.428571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#12",
                    "likes": "4",
                    "time": "12/04/2022-08:56:12",
                    "content": "I am not familiar with what exactly happened here, but it looks like the pool was used as exit liquidity and not a problem with liquidation as a system. I am assuming this is Fuse Pool 136, the main problem here is lack of proper risk parameters. ICHI has a very high LTV factor of 88%, which equates to 113.6% LR in Maker and no debt ceiling. This means that you can effectively “sell” ICHI into the pool for 13.6% slippage assuming there is enough liquidity of other assets supplied like USDC, ETH, WBTC. Something like this would obviously be mitigated in any kind of Rari D3M implementation. In the case where Maker owns the pool, we would have complete control of all the parameters and this can’t happen. Fuse pools in Rari are independent of each other and do not suffer bad debt or potential losses from other pools. ",
                    "links": [
                        "https://www.coingecko.com/en/coins/ichi",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-april-2022/14979"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.206927083333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "4",
                    "time": "12/04/2022-09:07:20",
                    "content": "Indeed—high collateral factor, not enough DEX liquidity, $ICHI used as an inflationary collateral—doubt the Risk Team will ever recommend such parameters or illiquidity for a collateral type—here’s a breakdown @Doo_StableLab https://twitter.com/jacklongarzo/status/1513587622282772487 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#14",
                    "likes": "4",
                    "time": "18/04/2022-23:03:28",
                    "content": "    Sean:  At this point, we would value any questions, ideas, or suggestions from the community. We will gather feedback over the next few weeks. If there are no clear objections, we will proceed by posting a Signal Request to ask the community if Maker should onboard a Maker owned Fuse Pool and a corresponding D3M implementation.   The issue with the D3M is there is a little conflation between the collateral technology and the actual collateral being onboarded. In the development of the D3M, we’ve used a few projects as use cases so I understand where the confusion is coming from. Moving forward, the D3M is a collateral technology and by itself, does not onboard collateral. To onboard collateral, we need to follow the onboarding process and I would suggest a MIP6 for the actual collateral. The only added work is more definition upfront as to the pool/assets we’ll be using. I think the MIP6 timing process is a little quicker (vs the SR/onchain poll) since we’ll have more information at the start of the process vs. waiting until we get into an assessment phase, then follow that up with another onchain poll, once we have a complete picture of the pool/assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.114583333333334
                }
            ]
        }
    ]
}