{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/announcement-at-end-of-term-makerman-will-be-retiring-as-a-delegate/16098",
            "title": "Announcement - At end of term MakerMan will be retiring as a delegate ",
            "index": 16098,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#1",
                    "likes": "50",
                    "time": "27/06/2022-17:20:56",
                    "content": "I have thought long and hard on this, and due to the events of today I am formally announcing that when my contract expires (mid August) I will NOT be renewing my delegate contract or seeking another term. This is not a rage quit, but simply a step down to focus 100% of my available time at writing my own whitepaper.   In the past 30-35 years I have spent probably 10’s of thousands of hours donating my time to intentional communities, co-ops, open-source projects (yes I was a coder once long ago), and now DAOs seeking a better way to conduct an ‘enterprise’.   I have learned a lot about governance, people, money, power, law and complex systems to believe I have a set of solutions to many of the problems we see ‘with equitable and fair treatment’ of all stakeholders conducting enterprise.  Blockchain was the key component to the solution.  What has been created on Ethereum I believe has all the core elements to make a better world (both from a financial perspective, but also from a governance and people one).    I have been working on these pieces, some of which I have already written about and proposed, some which I have not. I want to thank those who supported me in the past, and hope may find interest in supporting a vision I have for the future. I wish all the relevant stakeholders at Maker the best. I will continue to vote, and carry out delegate functions, but should those delegating to me see fit to find another delegate before my contract ends I won’t feel slighted in the least. Sincerely, MakerMan ",
                    "links": [
                        "https://forum.makerdao.com/t/delegate-round-up-june-2022/16570",
                        "https://forum.makerdao.com/t/governance-and-risk-197-thursday-june-30-at-21-00-utc/16216/2",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-9-traduccion/16383",
                        "https://forum.makerdao.com/t/chris-blec-delegate-platform/15544/14",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/28",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/3"
                    ],
                    "GPT-summary": "MakerMan announces that he will not be renewing his delegate contract or seeking another term. He explains that this is not a rage quit, but rather a step down to focus on writing his own whitepaper. MakerMan expresses his gratitude to those who supported him in the past and hopes to find support for his vision for the future. He also states that he will continue to vote and carry out delegate functions until his contract ends.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.745726495726496
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#2",
                    "likes": "2",
                    "time": "27/06/2022-18:33:15",
                    "content": "I was looking forward to collaborating with you as delegates. I wish you all the best with whatever you’re doing next! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "1",
                    "time": "27/06/2022-20:09:15",
                    "content": "Unfortunate to see you moving toward stepping down, but look forward to continue to see your ideas and discussions on the Maker Governance!     MakerMan:  I will continue to vote, and carry out delegate functions   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 3.263888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#4",
                    "likes": "1",
                    "time": "27/06/2022-22:16:08",
                    "content": "Lately there have been several changes of relevant positions, I hope it’s a good decision you’ve made, success MakerMan! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.175000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#5",
                    "likes": "1",
                    "time": "27/06/2022-23:45:12",
                    "content": "A real pain, but life is like that, success in your new directions! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.117424242424242
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#6",
                    "likes": "3",
                    "time": "29/06/2022-02:58:33",
                    "content": "@MakerMan you are a savior. Our community needs people with dedication and passion like yours. Your ideas and feedback are so valuable, albeit a TLDR would have been nice sometimes!  Anyway, thanks for everything great you’ve done for Maker. Wishing you the best in your future projects : ) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 7.708333333333332
                }
            ]
        }
    ]
}