{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-consider-refinements-to-psm-or-release-asap/3165",
            "title": "[Signal Request] Consider refinements to PSM or release ASAP? ",
            "index": 3165,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "pegstab-module"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "0",
                    "time": "10/07/2020-13:46:57",
                    "content": "The PSM is very similar to using a stablecoin like USDC as collateral for Dai, except it enforces a price of 1 USDC per Dai directly in the market. This concept ultimately makes Dai significantly more liquid and stable. In Forum Poll: Deciding the Peg Stabilization Modules Implementation Timeline, it was decided that the PSM will be released at the end of July (31 or 24 maybe). However, the forums have also seen a profusion of proposals to improve or increase the sophistication of the PSM. For example, Peg Stabilization Modules: A Pre-MIP Discussion ; [Agenda/Discussion] Scientific Governance and Risk #100 - Thursday, July 9 9AM PST (4:00 PM UTC) - #6 by FourthStreet ; MakerDAO should consider Open Market Operations to regain control of the peg     Abstain Consider PSM improvements No PSM improvements, release it     0 voters     This poll will run for 1 week. If the majority are in favor of “No PSM improvements, release it” then the various team will focus on this goal and defer any improvements until next month (at the earliest). The only questions to be considered are the initial risk parameters. Perhaps a few sets of risk parameters can be proposed by the risk team and put to on-chain rank choice vote. Trivial improvements like using a spread and diversifying the stablecoin exposure into multiple stablecoins like USDC, PAX, and TUSD are permitted under any poll outcome. ",
                    "links": [
                        "https://forum.makerdao.com/t/peg-stabilization-modules-a-pre-mip-discussion/3045",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-100-thursday-july-9-9am-pst-4-00-pm-utc/3023/6",
                        "https://forum.makerdao.com/t/makerdao-should-consider-open-market-operations-to-regain-control-of-the-peg/3150",
                        "https://forum.makerdao.com/t/liquidity-mining-response-summary/3134",
                        "https://forum.makerdao.com/t/signal-request-quantitative-easing-to-fix-the-peg-aka-manual-psm/3902",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-101-thursday-july-16-9am-pst-4-00-pm-utc/3145/2"
                    ],
                    "GPT-summary": "The post discusses the Peg Stabilization Module (PSM) and the decision to release it at the end of July. The author explains the concept of PSM and how it can make Dai more liquid and stable. The post also mentions various proposals to improve or increase the sophistication of PSM. The author proposes a poll to decide whether to release PSM without improvements or to consider improvements. The post also mentions the initial risk parameters and the possibility of proposing a few sets of risk parameters for on-chain rank choice vote.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.5576923076923075
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#2",
                    "likes": "2",
                    "time": "10/07/2020-14:05:11",
                    "content": "Without the details of what is being released it is difficult to side with releasing something immediately.  There is a big difference between:  A PSM with a small debt ceiling vs a large one A PSM with a swap price of $1.03 vs one that swaps at $1.00 A PSM running as just one vs multiple PSMs with separate ranges. What MakerDao intends to do with PSM funds because letting them simply grow opens up risk to the system especially blacklisting risk.  All of this said, I still voted for immediate because I feel a PSM is an objective improvement to what MakerDao has now and the details I am hopeful will get pinned down prior to the executive.  If not the executive should not be passed.  The details matter! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.654365079365079
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "0",
                    "time": "10/07/2020-14:07:53",
                    "content": "    FourthStreet:  What MakerDao intends to do with PSM funds because letting them simply grow opens up risk to the system especially blacklisting risk.   We have blacklisting risk now; the PSM is an orthogonal concern. The PSM funds will simply grow until the peg is below 1.0, at which point the PSM will drain. Let’s not do anything fancy for the first iteration.     FourthStreet:   A PSM with a small debt ceiling vs a large one A PSM with a swap price of $1.03 vs one that swaps at $1.00 A PSM running as just one vs multiple PSMs with separate ranges.    I agree these questions need answers. I regard these as the risk parameters that the risk team will propose. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.153061224489796
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#4",
                    "likes": "1",
                    "time": "10/07/2020-14:16:07",
                    "content": "Let’s not rush into something MakerDao will have long lasting potential issues with either.  I did vote for immediate, but we need to be clear that the PSM may not simply drain itself as you are hoping.  It is a very real possibility that Dai demand persists and that whatever debt ceiling imposed is hit quickly.  I am unsure what you have planned at that point.  The PSM in such a scenario would sit in the system holding all that risk for a reward that was small and front loaded. I am aware that USDC is already in the system.  I am of the opinion that MakerDao should greatly limit or remove the USDC vaults.  Adding additional USDC risk without any plan that I can see to remove that risk is short sighted and could seriously cause harm to the system.  We have at least a week in either case. let’s get talking everyone. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.289285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#5",
                    "likes": "3",
                    "time": "10/07/2020-14:16:41",
                    "content": "Although I have seen many good ideas, I think the proposal is by far the simplest and easiest to implement. Given the importance of pegging the exchange rate at the moment, I agree with this recommendation and hope to implement it as soon as possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#6",
                    "likes": "1",
                    "time": "10/07/2020-14:22:42",
                    "content": "I agree, MakerDao should implement a PSM.  I am hoping we get a good long term risk vs reward discussion going first though. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "0",
                    "time": "10/07/2020-15:43:20",
                    "content": "    FourthStreet:  details I am hopeful will get pinned down prior to the executive   Yes, they will, via on-chain polls, probably in the last week of July. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.7407407407407405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#8",
                    "likes": "4",
                    "time": "17/07/2020-15:17:47",
                    "content": "This poll is closed. There was an amazing amount of consensus, more than I expected. I am personally very happy with this poll result! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "0",
                    "time": "24/07/2020-15:17:52",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}