{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/advance-mip4c3-sp3-amend-mip64-to-allow-more-flexibility-in-scope-to-on-chain-poll/14435",
            "title": "Advance \"MIP4c3-SP3: Amend MIP64 to allow more flexibility in scope\" to on-chain poll ",
            "index": 14435,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "sig-status-accepted",
                "is-001",
                "impact-:-low"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "2",
                    "time": "04/04/2022-17:47:45",
                    "content": "At issue:     MIP4c3SP3: Amend MIP64 to allow more flexibility in scope Archive   MIP4c3SP3: Amend MIP64 to allow more flexibility in scope  Preamble MIP4c3-SP#: 3 MIP to be amended: MIP64 Author(s): @psychonaut Contributors: @travinimmunefi Tags: amendment Status: Accepted Date of Amendment Submission: 2022-03-24 Date of Ratification: 2022-04-21 Forum URL: https://forum.makerdao.com/t/mip4c3sp3-amend-mip64-to-allow-more-flexibility-in-scope/14200 Ratification Poll URL: https://vote.makerdao.com/polling/Qmad6Lo8   Specification  Motivation During Feb 2022, we had two bug sub…         Yes No Abstain     0 voters     This poll will run until 2022-04-12T06:59:00Z. If Yes exceeds No the amendment will advance to an on-chain poll. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-relay-april-5-11-2022/14590",
                        "https://forum.makerdao.com/t/weekly-relay-march-28-april-4-2022/14450",
                        "https://forum.makerdao.com/t/relay-semanal-28-de-marzo-4-de-abril-de-2022/14495",
                        "https://forum.makerdao.com/t/weekly-mips-update-81/14443",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-31-april-6-2022/14502",
                        "https://forum.makerdao.com/t/weekly-mips-update-82/14570",
                        "https://forum.makerdao.com/t/relay-semanal-5-11-de-abril-de-2022/14616"
                    ],
                    "GPT-summary": "The post is an explanation of a proposal to amend MIP64 to allow more flexibility in scope. The author provides details about the proposal, including the MIP to be amended, the motivation behind the proposal, and the tags associated with it. The post also includes a forum URL and a ratification poll URL. The poll will run until a specific date, and if the \"Yes\" votes exceed the \"No\" votes, the amendment will advance to an on-chain poll. The post does not contain any advertising, collaboration requests, or questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "04/04/2022-17:59:53",
                    "content": "Sir, flexibility how? Can you please expand further. I totally understand the ability to payout bounties fairly with beneficence. The last thing this DAO wants is for whitehats to start posting tweets on how they were underpaid, and had to go thru a wall to negotiate on the worth of their findings. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "2",
                    "time": "04/04/2022-18:04:25",
                    "content": "Our goal is to make severity classification as objective as possible. If it is objective and easy to categorize then we know how much to pay in the bounty. If it is a corner case that we didn’t anticipate then the process of severity determination gets messy and time consuming. We have to negotiate with the whitehat and the core unit to understand the bug report as clearly as possible and then decide on a severity classification that is least frustrating and unacceptable to all party. That is what we have been going through with the web vulns (mentioned in the original post). The point of this MIP is to give us more discretion to specify the scope of the bug bounty program to make the severity classification more objective and better informed by our growing experience. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.574404761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Dairyman",
                    "index": "#4",
                    "likes": "0",
                    "time": "05/04/2022-03:02:07",
                    "content": "I don’t understand this. What discretion do you want but don’t have? There’s not any real limits on the spending now, right? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "0",
                    "time": "05/04/2022-04:58:03",
                    "content": "It’s not a matter of spending or bounty amounts. MIP64 works in concert with the bug bounty program. MIP64 was approved by MKR voters so it takes precedence over the bug bounty program, a secondary document that we wrote, if there are any conflicts. The idea is to specify less in MIP64 so we have more latitude to adjust the bug bounty program. The goal here is to make severity classification as objective as possible. ",
                    "links": [
                        "https://immunefi.com/bounty/makerdao"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.033333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#6",
                    "likes": "2",
                    "time": "05/04/2022-16:07:19",
                    "content": "Yo ho, matey! What be so important this here amendment needs be using a signal instead o’ just using the MIPs cycle? Help an old buccaneer understand  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#7",
                    "likes": "5",
                    "time": "05/04/2022-17:28:11",
                    "content": "Hello, Piratical  Using a signal request is part of the process defined in MIP4c3. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#8",
                    "likes": "1",
                    "time": "05/04/2022-20:33:21",
                    "content": "I strongly believe we should read the post mortem before voting for it    MIP4c3-SP3: Amend MIP64 to allow more flexibility in scope   (post-mortems coming soon).   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 7.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#9",
                    "likes": "0",
                    "time": "05/04/2022-20:38:24",
                    "content": "This amendment will not affect the referenced bugs. The rules in effect when the bugs were reported remain in effect, regardless of the outcome of this amendment. The goal of this amendment is to allow ISCU to refine the scope of the bug bounty program immediately so that bug severity classification can be as objective as possible in reaction to potential new information. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.170454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#10",
                    "likes": "0",
                    "time": "05/04/2022-20:45:51",
                    "content": "But post mortem will help the community understand why such change is needed. Because the team will also explain why such has been a problem.    MIP4c3-SP3: Amend MIP64 to allow more flexibility in scope   A great deal of time was spent trying to find resolutions that seemed fair to both sides,   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#11",
                    "likes": "0",
                    "time": "05/04/2022-21:27:45",
                    "content": "Avast! If ye can give 10000 in hard coin for grog and music in old Amsterdam, why can ye not hand out big bounties to yer likin’?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.680555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#12",
                    "likes": "2",
                    "time": "05/04/2022-21:32:10",
                    "content": "Like I tried to explain above, we are trying to avoid disagreements between whitehat hackers and MakerDAO representatives.     Doo_StableLab:  But post mortem will help the community understand why such change is needed.   I agree. Since these postmortems are slated to be written by Immunefi staff, I am not sure when we can expect them. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "1",
                    "time": "06/04/2022-10:23:19",
                    "content": "    psychonaut:  Like I tried to explain above, we are trying to avoid disagreements between whitehat hackers and MakerDAO representatives.   @Doo_StableLab maybe not the best example — but you don’t want to look like OpenSea when push comes to shove:   twitter.com    Mr. Ø @mr0chill  Opensea has reassessed our previous case and has offered an additional $25k IF WE KYC.   They have also offered a similar reward for yesterday’s vulnerability, after they’ve gauged the severity.  As of now, we respectfully decline and wish them the best of luck finding the bug.   3:27 AM - 30 Mar 2022           4K                400            Bug bounty hunters will burn you  ",
                    "links": [
                        "https://twitter.com/mr0chill/status/1509009462769557504?s=21&t=j_VfoxBx-nEImtMXDH5GOA",
                        "https://twitter.com/mr0chill/status/1509009462769557504?s=21&t=j_VfoxBx-nEImtMXDH5GOA",
                        "https://twitter.com/mr0chill/status/1509009462769557504?s=21&t=j_VfoxBx-nEImtMXDH5GOA"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.944444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#14",
                    "likes": "5",
                    "time": "06/04/2022-10:33:38",
                    "content": "For added context I’ll share my experience as I represented DUX team in the aforementioned discussions with the whitehat hacker.  Context In February Immunefi CU notified us of three vulnerability reports that were related to the Governance Portal—one of which was quite clear-cut (ie. not controversial and easy to classify) thus was handled swiftly. The two other reports were more controversial as the whitehat hackers were arguing for the vulnerabilities to be classified as critical, thus warranting a significantly higher payout. As DUX team we disagreed in both instances—for one the impact of the vulnerability would not warrant a critical classification, and for the other the reported vulnerability could only have been exploited in case of a successful breach of a protected GitHub repository (the community repo controlled by GovAlpha). What ensued in both cases: A tiring and endless discussion on the classifications between me and the whitehat hackers, where they had a huge financial incentive to have the reported vulnerabilities be classified as critical. Common sense and/or increasing security of the codebase were not the focus of the discussions—it was all about the classification. The discussions ended up in a gridlock where I asked the Immunefi CU to step in and make the decision, as I did not feel mandated to decide. Although Immunefi CUs decision on both reports are not final yet, it sure looks like the terms/scope described in MIP64 will be leading as opposed to the actual context of these reported vulnerabilities. imo this will result in disproportionate payouts to the whitehat and thus a net-negative for the protocol.  Problem Although we should respect ‘the rules of the game’ defined by Immunefi, on which these whitehat hackers operate, I do believe that Immunefi CU should be able to iterate on these ‘rules’ based on experience (such as the aforementioned two reports). imo the goal here is to minimize payouts that were disproportionate to the value of the reported vulnerabilities, and thus maximise the value of this bug bounty program to MakerDAO.     flipflopflapdelegate:  The last thing this DAO wants is for whitehats to start posting tweets on how they were underpaid, and had to go thru a wall to negotiate on the worth of their findings.   Agreed, but let’s not forget that whitehat hackers are financially incentivised actors whose incentives are not (necessarily) aligned with MakerDAO.     Dairyman:  What discretion do you want but don’t have? There’s not any real limits on the spending now, right?   Although I agree that Immunefi CU should be able to iterate on the scope definition/terms based on experience I’m also not sure what that would look like. Which permissions does the CU need in addition to the current mandate? I hope to see those being defined in this discussion, as opposed to running a simple yes/no poll. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.595578231292517
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#15",
                    "likes": "0",
                    "time": "06/04/2022-11:29:18",
                    "content": "Thank you for sharing more about this issue. In short, is @psychonaut suggesting to have this modification so IS CU will be able to decide whether the bug is critical or not unilaterally? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TravinImmunefi",
                    "index": "#16",
                    "likes": "2",
                    "time": "06/04/2022-12:41:43",
                    "content": "Hi everyone, Thanks for all the time you’ve spent reviewing this and discussing. I apologize for some confusion as it seems that our intent is misunderstood a bit. With MIP64c2, it’s already part of it that the severity classification system of the program can be modified. This generally comes with a modification of the Impacts in Scope of the bug bounty program as well, but we discovered that this wasn’t explicitly stated in the Accepted Impacts section and we want to make sure that it’s there. There are downsides to this as, for example, we discovered that Injection of text was not clear enough, and so our new severity classification system clarifies that it has to be persistent injection of text since regular injection of text is generally not impactful. In essence, we are learning more about making sure bug bounty programs are clear as Immunefi carries on its existence and we want to take this new knowledge to the MakerDAO bug bounty program. Additionally, MIP64c2 already accounts for steward core unit feedback with reclassificaiton (i.e they can state that for their asset something can be considered Medium instead of High) but this isn’t explicitly stated in the Accepted Impacts section as well. This change doesn’t mean that IS-001 gets to change how any outstanding bug report is handled - because those get considered under the terms that the program had when they were escalated. We are not asking to have the ability to force reclassification of an outstanding bug report after changes are made. Additionally, steward Core Units will be consulted with the changes before they happen so that they can have modifications for the assets for which they are a steward. For example, they can say that Impact A should be downgraded to Medium from High for Asset X. When updating the bug bounty program, we would then make sure this modification is explicit in the program. The modifications can also be very extensive, even to the point of saying that only one specific impact would be accepted in the bug bounty program. I should add that the case being referenced to by DUX is one where this power is actually needed. We want to be able to remove impacts that are not desired, but during the process of the removal we discovered that we do not explicitly have the same amount of flexibility as with the severity classification system. That said, we have indicated restrictions already to the bug bounty program that achieves this in practice, but having text and then adding restrictions for everything is really inefficient and potentially confusing for hackers. It would be best if we could just remove an impact altogether. Lastly, this is also not a request to have IS-001 to have unilateral decision making on the severity of the bug report. What we want is greater clarity and the ability to do so before bug reports are submitted by having explicit freedom of modifying the Accepted Impacts section in coordination with respective steward core units, just like how MIP64c2 already has for the Severity Classification System implemented for the bug bounty program. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.758629261363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#17",
                    "likes": "2",
                    "time": "08/04/2022-02:43:33",
                    "content": "@0xdeniz @Doo_StableLab hack first, bounty later—or bounty first, hack later? To be or not to be GitHub - hats-finance/HackFirstBountyLater ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#18",
                    "likes": "0",
                    "time": "08/04/2022-02:54:10",
                    "content": "That’s a cool idea, but it would only work for certain types of reversible exploits. For example, suppose there is a vuln that allows a hacker to take half of the collateral from a Maker vault. If that collateral is taken by the hacker and put into the escrow contract then the vault would likely be liquidated, which is not (easily) reversible. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.15079365079365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#19",
                    "likes": "0",
                    "time": "08/04/2022-03:21:43",
                    "content": "It’s also the question of clean money versus tornado money. Which route do you take—I’d say if you guarantee a nice payout—most would take clean money—why go through the hassle of machine washing  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 7.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#20",
                    "likes": "0",
                    "time": "08/04/2022-04:39:59",
                    "content": "Yeah, I’d certainly prefer hackers choose clean money  GitHub - hats-finance/HackFirstBountyLater is permissionless so we’d certainly be happy if a hacker chose to use it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 7.301587301587301
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#21",
                    "likes": "2",
                    "time": "08/04/2022-09:47:28",
                    "content": "I think it’s a balance. Of course, we should focus on security but doesn’t mean we should blindly increase budget and allowed authority for the CU. I think it’s more than fair to ask questions regarding the request especially when we initially didn’t have the context. Remember they shared the context only after we asked them about it ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.276785714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#22",
                    "likes": "1",
                    "time": "12/04/2022-08:58:24",
                    "content": "Thanks to everyone that participated in this Signal Request. The majority of non-abstain votes are in favour. Consequently, an on-chain ratification poll will follow next week (Monday 18th). cc: @blimpa ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#23",
                    "likes": "0",
                    "time": "25/04/2022-08:38:38",
                    "content": "Closing the loop here, this proposal passed its on-chain vote and the changes are reflected on MIP64’s listing, viewable on the MIPs Portal. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP64#accepted-impacts"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#24",
                    "likes": "0",
                    "time": "25/05/2022-18:38:43",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}