{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/multi-protocol-stablecoin-stability-vault/13427",
            "title": "Multi-protocol stablecoin stability vault ",
            "index": 13427,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "idea"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/jrkirby",
                    "index": "#1",
                    "likes": "2",
                    "time": "24/02/2022-16:02:39",
                    "content": "There are many other protocols out there trying to build their own stablecoins. They hope to also succeed at the task makerdao has done so impressively. But keeping a stablecoin actually stable is a very difficult task. But it’s here that makerdao could lend a hand to these struggling stablecoins. Not out of charity, but as a strategy to improve Dai stability, help alleviate the demand for Dai, and additionally to provide revenue to the protocol. The model version of the system I’m suggesting is the GUNI-dai-usdc vaults, already in service today. These vaults ramped up quickly, with hundreds of millions of Dai and USDC getting locked up in a vault and used to provide liquidity on uniswap within the first couple weeks. This particular vault is somewhat redundant with the USDC PSM. Since anyone can swap between Dai and USDC in a feeless manner through that service, I assume the onchain uniswap demand is comparatively low. But uniswap AMM between Dai and other stablecoins do not have similar feeless alternatives, so there could be a large untapped swapping demand, if the deep liquidity the protocol I’m suggesting can provide were available. But my suggestion is not exactly the same as GUNI-dai-usdc vaults. There is one innovation that I believe would be key to the success. That would be a cooperation between makerdao, and the stablecoin protocol we are providing this stability vault for. I am suggesting that both protocols jointly back this vault. When someone creates a vault, both protocols will jointly mint stablecoins, such that no stablecoin trade imbalance is needed to create (or liquidate) vaults. This requires getting approval and integration other stablecoin protocols. But I think that many would love to have such cooperation if it were offered - even with terms more favorable to makerdao. I imagine the liquidity provided by a hundred million+ stablecoin pair vault would be something other protocols would jump at the chance for. Risk: What if a stablecoin partner fails at being a stablecoin? Either through bugs, malicious actions, failed protocols, or simply extreme market volatility, there’s always the risk that another stablecoin fails to maintain it’s peg. It is my belief that the strategy I’m suggesting puts a large majority of that risk onto private vault holders. If something happens to the prices outside of normal operating procedures, vaults will be liquidated quickly and would down, limiting the risk that we end up with large amounts of outstanding dai liabilities on our balance sheets. This is in stark contrast to other peg stability features that maker uses, like the USDC PSM. If something happened to the USDC stability, makerdao would be left holding the entire bag - a big bag indeed. Another possible criticism is that such a service would be helping our direct competitors - onchain stablecoin protocols. To that I would say that we can stand to benefit from many stablecoin partners, not just one, allowing us to benefit more than any single individual partner, leaving us still the #1 onchain stablecoin protocol. Additionally, I would hope that we can negotiate protocol conditions favorable to us, such as allowing makerdao to take all or at least a majority of the vault interest payments. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.354093180482069
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "0",
                    "time": "24/02/2022-22:27:36",
                    "content": "    jrkirby:  This is in stark contrast to other peg stability features that maker uses, like the USDC PSM. If something happened to the USDC stability, makerdao would be left holding the entire bag - a big bag indeed.   Here I can assure you something, literally all the USDC is backed 1:1 by cash, if something happens with the onchain parity, in the real world is the backing of those USDC, therefore Maker would not be left with a big bag. I find this interesting reading, do you have more information about it, maybe graphs of how the vaults work that you promise or a diagram to visualize it better? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#3",
                    "likes": "1",
                    "time": "25/02/2022-05:31:39",
                    "content": "Usdt will take on-chain measures against laundering, hackers, among others, so that regulators have no arguments against it. Usdc and soon Usdt are the least risky in terms of price variation as their backing is physical and not by mechanisms that cause their stability in parity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                }
            ]
        }
    ]
}