{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456",
            "title": "Flipside Crypto Delegate Platform ",
            "index": 13456,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegate-platform"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#1",
                    "likes": "16",
                    "time": "25/02/2022-16:53:42",
                    "content": " Flipside Crypto  Key Info Delegate Address: 0x222d46d1229036c7bb6ea3f453406792ca3c3ea2 Forum: @fig @dav @avi @dobby @rspa Email: [email protected] External Website: https://flipsidecrypto.xyz/  Delegates Code of Conduct:  We as Flipside Crypto Governance have read, acknowledge, and adhere to Maker’s Delegates Code of Contact. (Agreed 02/25/22)  Core Values  Authentic Relentless Responsible   Delegate Statement Hey Maker Community, I met @tyler in Denver while chatting about DAO infrastructure and the importance of governance. He mentioned the newly formed recognized delegations and compensation structure. At the time, my thought was “how do we get involved??” Well, here we are! Bravo team. As strong believers of legacy infrastructure, Flipside Crypto and its dedicated governance team (Flipside Governance) would like to serve as a delegate for Maker. Maker has been an inspiration to the ETH community and larger crypto ecosystem. As stewards of the Ethereum, Solana, and Terra ecosystem we view Maker as an integral part of DeFi and a luminary for user adoption.  Who is Flipside Governance?  Flipside Governance, an arm of Flipside Crypto, was established in September 2021, to directly support, contribute, and drive participation in our partner communities - helping improve the efficiency of this critical piece of protocol health. We operate in a range of DAOs and communities, such as Aave, SushiSwap, ENS DAO, OlympusDAO, and many others. We are committed to using this team and experience to improve DAOs one proposal at a time. We are one of the few full-time governance teams dedicated to the complete Web3 ecosystem. We have developed a key understanding of the needs and flow of information in the governance process and key tooling to be successful. A few of our results thus far are as follows:  Passed a $1,000,000 SushiSwap Grant, with 99.83% votes in favor Won awards for activity in Aave, Anchor, and SushiSwap Forums (New User of the Month) Review Committee Member at Aave Grants DAO Transferability Committee Member at Paladin Vote Applied and received ENS DAO & Paladin delegation, representing 6k+ delegated votes Active voting in multiple ecosystems: Aave, Sushi, ENS DAO, Terra, Algorand, and more Research extensively on emerging and legacy Governance structures (SNX, ILV) Active in over a dozen forums, OlympusDAO, Terra, Anchor, to name a few Won multiple grants from Compound, Uniswap, and Aave   Why seek delegation for Maker?  We have experienced firsthand the difficulties of protocol governance and the intricacies of holding voting power. Maker not only rewards informed voting through “recognized delegation” and clear documentation, but $DAI aims to create a more crypto native future. There is plenty of room for improved proposals, a greater understanding of the governance landscape, and relationships with key players and stakeholders. Flipside Governance spends every waking hour focused on exactly this, and we are very excited about the prospect of bringing our expertise to the Maker ecosystem. What we appreciate about Maker? We believe governance is best achieved through:  Proper education (what votes mean and why) Fairly distributed voting power (quadratic voting, voting rewards) Engaged, rewarded community members  Maker helps improve these three things through a modern framework to delegation. Recognized Delegations, as pioneered by Maker, and paying contributors for their efforts is the next step in an engaged and mature governance process. Moreover, the potential for stronger, competent delegates is yet to be realized. Flipside Governance aligns with this mission and would be honored to help improve and streamline processes within the DAO & protocol and bring valuable resources to Maker. By selecting us as delegates, we aim to represent the views of a range of users and provide unique analytics to justify our data-driven decisions. Together with the Maker community, we can create a stronger, more efficient governance process in Maker and partner protocols. Conclusion As delegates, we promise:  Constant monitoring of votes and participation in each vote Open discussion and contribution to the DAO forum and Discord Transparency about when we vote and how we vote A shared commitment to the future success of Maker  Per @twblack88 , here are a few of our coolest things we’ve done in Crypto:  $1,000,000 SushiSwap Grant OlympusDAO: A Sub-DAO for Treasury Asset Governance ENS Governance Enhancement Aave CEA Summary Flipside Community Console for Mirror Protocol   Conflicts of Interest  ENS Delegation Paladin Delegation / Transferability Committee Aave Grants  ",
                    "links": [
                        "https://forum.sushi.com/t/updated-proposal-community-enabled-analytics-for-sushi/6127",
                        "https://forum.olympusdao.finance/d/791-a-sub-dao-for-olympusdao-treasury-asset-governance",
                        "https://discuss.ens.domains/t/rfc-ens-governance-enhancements-flipside-crypto/11100",
                        "https://governance.aave.com/t/flipside-crypto-cea-grant-overview/7073?u=fig",
                        "https://forum.mirror.finance/t/proposal-flipside-community-console-for-mirror-protocol/354",
                        "https://forum.makerdao.com/t/weekly-relay-february-22-28-2022/13499",
                        "https://forum.makerdao.com/t/meet-your-delegate-10-doo-wan-nam-and-flipside-crypto/13248",
                        "https://forum.makerdao.com/t/delegate-round-up-april-2022/15139",
                        "https://forum.makerdao.com/t/weekly-relay-june-14-20-2022/15950",
                        "https://forum.makerdao.com/t/relay-semana-22-28-de-febrero-del-2022/13587",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-24-march-2-2022/13590",
                        "https://forum.makerdao.com/t/delegate-round-up-february-2022/13657",
                        "https://forum.makerdao.com/t/monthly-governance-review-february-2022/13661",
                        "https://forum.makerdao.com/t/delegates-main-index-dmi/10035",
                        "https://forum.makerdao.com/t/delegate-round-up-may-2022/15630",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-16-22-2022/15999",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-16-22-de-junio-del-2022/16204",
                        "https://forum.makerdao.com/t/relay-semanal-14-20-de-junio-del-2022/16062",
                        "https://forum.makerdao.com/t/delegate-round-up-june-2022/16570",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2022/18785",
                        "https://forum.makerdao.com/t/delegate-round-up-march-2022/14586"
                    ],
                    "GPT-summary": "The post is a proposal by Flipside Governance to serve as a delegate for Maker. The proposal explains who Flipside Governance is, their experience in governance, and why they seek delegation for Maker. They also highlight what they appreciate about Maker and promise to constantly monitor votes, participate in each vote, and contribute to the DAO forum and Discord. The post does not contain any advertising, entirely positive or negative feedback, or questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.733347627215552
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "7",
                    "time": "26/02/2022-15:42:35",
                    "content": "Welcome to Maker @fig Help me out with a few answers to questions.  Is your group intending to be a team delegation or will there be a single point individual? How familiar is your group with how Maker works, Both from a governance as well as user perspectives?  Has anyone in your group used a vault for example? This is probably a general question for all delegates btw.  Does your group have significant ownership interests in the DAOs mentioned or in MakerDAO? Is one or more of your group employed/paid directly by any of these other DAOs or How are your efforts compensated for?   Example if you have 4 people in your group do you share the compensation package(s) between them all? Me being a member of a number of DAOs now find it difficult to keep up on Maker much less the 10 or so other communities I can vote/participate in   How does your team intend to manage time with these other DAOs Why do you think quadratic voting power in governance is fairer than other models (stock ownership i.e. linear ownership vs. single vote ala elected board or management group and have you ever looked at conviction voting)? How do you see governance evolving so multiple stakeholders can get a say in protocol governance.   Example Uniswap traders having a say vs. UNI holders, or in Maker’s case DAI holders or vault borrowers vs. just MKR holders? How do you define ‘proper education’? How does your group intend to manage voting in the protocol as a group?   Some multisig or something else? Based on (10) who will actually have control over voting and how will the group decide and enforce their choices when voting?  i.e. what does your internal group politics look like when deciding how to cast votes or to make proposals? Where is your group geographically located? Does your group work under a LLC or have you incorporated as a company.  Thank you for listing conflicts on interest.   Can you explain what the actual conflict of interest is and how your group intends to mitigate it? Thank you in advance for answers! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.172619047619048
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#3",
                    "likes": "7",
                    "time": "02/03/2022-01:58:14",
                    "content": "@MakerMan thanks for your inquiry! Sorry to keep you waiting. Here are a few answers to your questions: 1. Is your group intending to be a team delegation or will there be a single point individual? I will be the point with the help of @dav! We aim to be a team delegation and specialize our team across different networks and sectors. My primary responsibility has been ETH DeFi. 2. How familiar is your group with how Maker works, Both from a governance as well as user perspectives? Has anyone in your group used a vault for example? We are familiar with Maker - its story and growth - and have used vaults. We are familiar / follow governance but are excited to understand and participate at a much deeper level. In crypto there is always more to learn and a need to further integrate into the forums. This is why we are excited by the opportunity with Maker - to learn more, grow, and challenge ourselves as a Governance organization. 3. This is probably a general question for all delegates btw. Does your group have significant ownership interests in the DAOs mentioned or in MakerDAO? Flipside has significant interest in Terra, Astroport, Aave, NEAR, SushiSwap, Algorand, Flow, and THORChain. This interest is a result of multiple CEA (community enabled analytics) programs and retaining digital assets on the balance sheet. We will be acquiring MKR to self delegate and create vested interest. 4. Is one or more of your group employed/paid directly by any of these other DAOs or I am compensated by Paladin and Aave Grants for part-time work. 5. How are your efforts compensated for? Example if you have 4 people in your group do you share the compensation package(s) between them all? We are compensated by Flipside Crypto as part of an annual contract. We believe in the merit of full time governance and partnerships that derive from these forums. 6. Me being a member of a number of DAOs now find it difficult to keep up on Maker much less the 10 or so other communities I can vote/participate in How does your team intend to manage time with these other DAOs As mentioned above - our Governance team breaks down by networks and sectors. We currently have three full-time employees, with one starting March 14, 2022. We also have an intern and part-time contributors. @dobby  has been focused on the Solana ecosystem, integrating into DAOs such as MonkeDAO, Marinade, and Saber. Myself has been focused on the Terra and Ethereum ecosystem, prioritizing Aave, SushiSwap, Anchor, Astroport - and soon Maker. @Avi pioneered the team with experience in large grants with Terra, THORChain, and protocols such as Uniswap, Aave, and SushiSwap. As we add more talent and grow the team - we hope to further specialize and align protocol specialists with their passions. 7. Why do you think quadratic voting power in governance is fairer than other models (stock ownership i.e. linear ownership vs. single vote ala elected board or management group and have you ever looked at conviction voting)? I am particularly keen on the idea of quadratic voting as it comes to governance structures. I have witnessed the shortcomings of stock ownership in the traditional finance world, linear ownership and voter apathy, single vote “ala elected board” with MonkeDAO and risk vectors. I believe quadratic voting has the most potential to fairly reward voters of different size and make individuals truly consider (and price) the importance of their vote. I have not seen conviction voting but it is something I will look into! Two toolings and models we are particularly excited about are Paladin @Figue and tokenized proposals with Automata.fi and des-0. 8. How do you see governance evolving so multiple stakeholders can get a say in protocol governance. Example Uniswap traders having a say vs. UNI holders, or in Maker’s case DAI holders or vault borrowers vs. just MKR holders? There are a ton of creative ideas for this. I will save some thoughts for a separate post, but in the meantime, I would direct you to our ENS proposal posted today which tackles a similar topic: Hope this can give you an idea of what to expect and our willingness to experiment and iterate as delegates. 9. How do you define ‘proper education’? To us, “proper education” means clearly defined documentation that outlines how one votes and what they need to do to gain voting power. Maker has put a strong emphasis on documentation and as a result, boasts a more transparent process. Another part of “proper education” is an understanding of the subject of the votes and how they affect different parts of the protocol. We believe this is an important role that falls on delegates - with our delegation, Flipside hopes to translate this complexity and amplify it to a larger community. 10. How does your group intend to manage voting in the protocol as a group? Some multisig or something else? A mature organization, Flipside’s delegation and day-to-day voting is managed by our governance team with the assistance of the finance team who help us execute the vote. We use institutional custody solutions while also relying on a mix of hard / hot wallets to expedite voting practices. This team is familiar with voting on a range of protocols and on different networks, with the understanding that governance is a priority for our partners. 11. Based on (#10) who will actually have control over voting and how will the group decide and enforce their choices when voting? i.e. what does your internal group politics look like when deciding how to cast votes or to make proposals? Flipside values transparency and respect as an organization. As such, we empower all team members with equivalent voting weight despite their tenure or title. With four members, decisions are made based on supermajority, defined by the following formula: ⌈(N+1) / 2⌉ where N represents the number of current team members. 12. Where is your group geographically located? Our team is fully distributed! We have an office in Boston for those who choose to visit but are spread across the globe - with colleagues located in San Diego, Montreal, New York City, Berlin, San Francisco, and Boston. 13. Does your group work under a LLC or have you incorporated as a company. Yes. We work under Flipside Crypto LLC. 14. Can you explain what the actual conflict of interest is and how your group intends to mitigate it? Actual conflict of interest is time; paid compensation and a penchant for governance within these partner organizations. As we grow and add more members to our team, we view this as becoming less of a conflict.  Hope this is helpful! As reminder we will be on the Meet Your Delegate #10 tomorrow at 1:00pm EST - feel free to jump on and ask more questions then. ",
                    "links": [
                        "http://Automata.fi",
                        "https://forum.makerdao.com/t/meet-your-delegate-10-doo-wan-nam-and-flipside-crypto/13248"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.632850945350945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#4",
                    "likes": "2",
                    "time": "02/03/2022-19:20:16",
                    "content": "    fig:  Per @twblack88 , here are a few of our coolest things we’ve done in Crypto:    on forum resume FTW. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/butters",
                    "index": "#5",
                    "likes": "1",
                    "time": "03/03/2022-02:53:52",
                    "content": "Firstly, I have to admit that I am new to Maker but I am truly impressed by what this community is doing. Kudos to you all! @fig  Thank you to you and the Flipside crypto team for participating in this and volunteering your time and efforts towards improving Maker. I have one quick question. You have mentioned that Flipside has interests in Terra. Given this, if a proposal were to come to add UST support in MakerDAO, how would you evaluate this? How do you think the Maker community should approach this decision? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.149621212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#6",
                    "likes": "0",
                    "time": "03/03/2022-16:18:08",
                    "content": "Hey! This is a great question - and something I’ve been thinking about on my own. My thought process comes down to this: I would allow UST to be used as collateral. This allows for greater diversity among deposits and further decentralizes the collateral base. By preventing it from being borrowed, it nods users towards using DAI and limits liquidity of UST. I look at the emissions as such; locking up UST in a vault to use DAI instead. UST has its merit as does DAI. I believe in a world where they can both exist - and do so amicably. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.674603174603174
                },
                {
                    "author_link": "https://forum.makerdao.com/u/butters",
                    "index": "#7",
                    "likes": "0",
                    "time": "03/03/2022-16:45:04",
                    "content": "Thank you for the answer. Anything that helps improve the TVL of our ecosystem and increase the DAI market cap in a stable way is of course a positive. In that sense, I completely understand and agree with what you are saying. I don’t completely understand the need for “limiting the liquidity of UST”. Given the overall demand for stable currencies, I definitely agree that multiple such currencies can co-exist and proliferate. What I was more interested in, is, your approach behind coming to this decision. As a delegate, you are going to be responsible for several important decisions whose pros and cons might often not be crystal clear. I wanted to use this as an example to find out how your organization would weigh the positives and negatives of a particular issue of interest. What do you think MakerDAO community risks by supporting this decision? Similarly, what do you think we will lose by not supporting this (or say, deferring this decision to a later time)? And finally, why would you think that the positives outweigh the negatives enough to support their induction right now? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.466966745375837
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#8",
                    "likes": "5",
                    "time": "03/03/2022-17:07:26",
                    "content": "Not sure exactly what’s going on here, but I’d like to say adding UST to our books is equivalent to a future hole in the balance sheet. They’ve managed to extend the Ponzi by adding 500m in funding, but their burn rate is currently 3m / day and that 500m will eventually be depleted. Be wary of any delegate supporting UST. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#9",
                    "likes": "0",
                    "time": "03/03/2022-17:12:43",
                    "content": "Great discourse - and a good call out. “Limiting the liquidity of UST” probably wasn’t the best choice of words. What I mean to convey, is still a strong preference for DAI on the protocol. Maker risks the following by supporting a UST integration:  cannibalizing DAI demand smart contract risk through a wrapped token risk of de-pegging and bridge exploits greater competition with protocols such as Anchor who aim to expand across chain  Maker gains:  diversified collateral base increased TVL (with $10B of UST liquidity) joint marketing and possible LM incentives through TFL onboarding new users from the Terra network (3.64mm total wallets)  UST is exploding, with robust tokeneconomics which positions itself well during a myriad of market environments. The network and stable have a few catalysts - Washington Nationals partnership, $1B worth of Bitcoin backed UST reserve, Mars and Levana launch, etc. We have worked with many of these projects and have seen the vision and technology fueling this growth. Maker should not be left behind and should capitalize on its growth and adoption to benefit its own protocol. For these reasons and more, we believe the upside of supporting UST is much greater than the risk it incurs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0807571052136264
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#10",
                    "likes": "0",
                    "time": "03/03/2022-17:22:50",
                    "content": "Hey @hexonaut - I believe this bit references Anchor specifically.     hexonaut:  They’ve managed to extend the Ponzi by adding 500m in funding, but their burn rate is currently 3m / day and that 500m will eventually be depleted.   This is a very different protocol and independent of the UST product. While I understand your concern, this affects aUST and is currently being mitigated through governance proposals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hasu",
                    "index": "#11",
                    "likes": "5",
                    "time": "03/03/2022-17:28:36",
                    "content": "You cannot look at UST separate from Anchor. UST is backed by LUNA collateral and hence susceptible to bank runs. Anchor represents a substantial part of the UST demand side, subsidized with artificial and unsustainable yield. If these yields were to go down, it would depress demand for UST, which would, in turn, depress demand for LUNA, etc., possibly sending UST into a vicious cycle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 3.4259259259259256
                },
                {
                    "author_link": "https://forum.makerdao.com/u/butters",
                    "index": "#12",
                    "likes": "2",
                    "time": "03/03/2022-17:41:53",
                    "content": "@hexonaut Personally, I am in agreement with what you are saying. But, I don’t think my opinion matters. What I was looking for is how the delegate candidate would look at the pros and cons of the issue at hand in order to give an idea to the community about how the delegate is approaching this issue. I want MakerDAO to be an open place where others can express their opinions and will be evaluated in an objective fashion. @fig I am not exactly sure “cannibalizing DAI demand” is a real threat to DAI with UST. As I already mentioned, I think multiple stable currencies can peacefully co-exist and proliferate. Also, I wouldn’t put the “risk of de-pegging” in the same 3rd sub-point as “bridge exploits”! I think the “risk of depegging” is very real with UST and I am a little concerned that your evaluation is not giving the weightage that it deserves in an objective fashion. Another concern is the fact that you have not brought any of these negative points up in your previous voting process with AAVE. Your explanation there was a short and overwhelmingly positive-only discourse: ARC: Add UST as a borrowable asset - #4 by fig - New Asset - Aave Such one-sidedness would be a very problematic issue as MakerDAO delegate. Finally, I think there is one glaring and important omission in the list of negatives you pointed out. Luna is a growing ecosystem which is primarily growing due to a rising UST market cap which in turn is due to large amounts of growing liquidity (65% of UST market cap last I checked) being deposited in Anchor protocol that is giving 20% deposit interests and negative borrow interests (-3% last I checked) being funneled by regular sales of Luna tokens (or in borrow case: with ANC tokens). So, objectively, what we know is that this UST ecosystem is simply a closed loop right now and is definitely not sustainable in its  current form. This is why even ANC itself is looking at alternatives: Dynamic Anchor Earn Rate - Mechanism - Anchor Protocol Well, I do agree that there is a remote possibility that all this might magically become sustainable. But, right now it is far from it. It is very concerning that you would say “This [Anchor] is a very different protocol and independent of the UST product” as the entire Luna narrative is based on the growth of UST market cap which in turn is on the growth of Anchor deposits currently. My personal decision in this matter would simply be to defer this decision until the UST ecosystem actually demonstrates real-world sustainability. Anyway, I hope this discussion has given some insights to everyone. ",
                    "links": [
                        "https://forum.anchorprotocol.com/t/dynamic-anchor-earn-rate/3042"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.242330984618219
                },
                {
                    "author_link": "https://forum.makerdao.com/u/avi",
                    "index": "#13",
                    "likes": "4",
                    "time": "03/03/2022-17:54:01",
                    "content": "Great dialogue here from everyone! However, feels like we’re getting bogged down into a spitting match over a hypothetical (if not quite unlikely) situation. At the core of the question, I believe is whether our relationship with Terra would impact our objectivity as a Maker delegate - and the answer is a definitive no. I take a bit of exception to any implication that folks should be wary of us. Instead, I’d hope the Maker community would be welcoming of teams approaching all proposals with an open mind and coming to decisions based on rigorously defined facts. Knowing full well the importance of impartial delegate work within DAOs, we would not have raised our hands to contribute if we were not capable of objectively considering the merits of all proposals brought forward and making decisions accordingly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.947222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#14",
                    "likes": "1",
                    "time": "06/03/2022-16:44:49",
                    "content": "    avi:  At the core of the question, I believe is whether our relationship with Terra would impact our objectivity as a Maker delegate - and the answer is a definitive no.   Thank you for your unbiased assessment  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#15",
                    "likes": "5",
                    "time": "25/03/2022-17:44:37",
                    "content": "Hello MakerDAO community. My name is Raphael Spannocchi. I recently joined the Flipside Governance team and @fig and me will be more active here in the next time. I’m from the European Union and deeply interested in organizational development and especially in decentralisation and leading from the edges. MakerDAO is a shining light and pioneering force here, so I couldn’t be more excited to be active here.  Here are our thoughts about the ongoing polls:  General thinking: Real World Asset collateralization is one of the most fascinating topics in Maker discussions. MakerDAO is leading the push for the whole industry. This knowledge can represent a considerable revenue stream going forward. This is something to consider when thinking about the cost/benefit of this core unit.  Ongoing polls week 12  Invest in Short-Term Bonds (MIP13c3-SP12) - yes We talked about this proposal at length in the Flipside Governance Team and we love what MakerDAO is doing. Maker is breaking ground and doing pioneering work for the whole space. Collateralization with short-term bonds seems like an ideal step forward. Proposal whole heartedly supported  Facilitators Offboarding (MDS-001) (MIP41c5-SP5) - yes Waste of funds should be curtailed wherever possible. If this unit doesn’t deliver it should be offboarded. At Flipside we look for cool stuff all the time and the MakerDAO shop never appeared on our screens. We support the proposal to offboard this unit.  GovAlpha Budget 2022-23 (MIP40c3-SP59) - yes The proposed increase in budget is slight and seems sensible. GovAlpha work is stellar. Proposal supported.  Modify Core Unit Budget - Real-World Finance (RWF-001) (MIP40c3-SP61) - yes Real World Asset legal fees need to be able to buy top-notch consulting, otherwise the risk of fumbling a deal is increased and this could reflect badly on MakerDAO as a whole and also on the idea of RWA collateral. We believe that MakerDAO has a unique chance to develop knowledge by pioneering these efforts. This knowledge can and should be sold at a substantial premium later on. It could provide revenue above the amount of DAI that can be collateralized and will further expand Maker’s position as an industry leader. That is why we support this budget increase, even though it is substantial. We think the risk is well worth it and Maker will profit from these investments handsomely in the future.  Modify GovAlpha Core Unit MKR Budget (MIP40c3-SP60) - yes This is a substantial budget increase. But it further aligns incentives of GovAlpha with those of MKR holders, which is why we support it, but want to make sure that spending on government activities and personnel remains tightly controlled. We will carefully watching these expenditures going forward.  Onboard-Amend Keeper Network - Gelato Network (MIP63c4-SP3) - yes We applaud the ongoing diversification of MakerDAO collateral and adding Keeper - Gelato is a great way to do so.  Onboard-Amend Keeper Network - Keep3r Network (MIP63c4-SP2) - yes Like the proposal to diversify collateral to include Gelato we support this proposal with equal enthusiasm.  Rapid Payment for Small Bug Bounties (MIP64, MIP40c3-SP42 Amendment) (MIP4c2-SP17) - yes The importance of bug bounties and harnessing community resources cannot be overstated. Quick payouts will increase the likelihood of bugs being disclosed in an orderly manner and incentivize bounty hunters. We support this proposal.  Recognized Delegate Compensation (MIP61) - abstain It would be totally self-serving to vote yes here, as we look for delegation ourselves. On the other hand protocol governance depends on active participation by delegates. It is unreasonable to expect delegates, who often have pressing time constraints, to participate for free and to do so sufficiently. Given our conflicts of interest we would abstain from a vote and instead want to learn as much as possible from the discussion on the MakerDAO forum. You can reach me here and on Discord @raphbaph#5749 if you want to connect or discuss anything. ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmV3Lem7",
                        "https://vote.makerdao.com/polling/QmSBytmr",
                        "https://vote.makerdao.com/polling/QmXDh7RR",
                        "https://vote.makerdao.com/polling/QmefuvKL",
                        "https://vote.makerdao.com/polling/QmTnVxAL",
                        "https://vote.makerdao.com/polling/QmaEfChz",
                        "https://vote.makerdao.com/polling/QmRdVByP",
                        "https://vote.makerdao.com/polling/QmTvzCjL"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9002976190476195
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#16",
                    "likes": "3",
                    "time": "25/03/2022-18:59:20",
                    "content": "Modified our response to Facilitators Offboarding (MDS-001) (MIP41c5-SP5) - now abstain. The unit will step down and doesn’t need to be offboarded. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#17",
                    "likes": "7",
                    "time": "05/04/2022-17:19:35",
                    "content": " Ongoing votes week 14/22 Launch Maker Wormhole With Optimism and Arbitrum Domains - yes Faster L2-L1 withdrawals are a huge bonus. The debt ceiling of 1M DAI and setting the Oracle quorum to 13 means security requirements are tight. A really good first step, and a clear yes. We will follow these developments with curiosity to see how much impact ETH L2 will have on Maker in the near future. PPG - Open Market Committee Proposal - yes Following the discussion on this proposal gave us a fascinating insight into the inner workings of Maker. We applaud the level of scrutiny and the amount of thought put into this proposal. If it makes MakerDAO more competitive then this is a clear yes. Regarding the cost: It’s better to have a small slice of a really large cake than a large slice of a super small cake. The borrowing market is very competitive and we should make sure MakerDAO remains top of the line. That being said, we think that users would be okay with paying a slight premium for higher security, if the level of comfort is equal. We feel that the biggest impact to acquire more users could be achieved there. We would welcome discussions in that direction and support them as much as we can.  Ongoing Votes Week 15/22 MIP39c2-SP30: Governance Communications Core Unit, COM-001 (Mandate Refresh) - yes This is my personal opinion: GovComms is doing a stellar job of keeping me informed. They always have an open ear for questions and remarks. I wholeheartedly support their mandate refresh. Dissolution of Content Production (MKT-001) Multi-Sig Request - yes We support claiming and returning the multi-sig from the offboarded Content Production Core. We hope all remaining funds are still available once this proposal gets executed. Modify Protocol Engineering Core Unit Budget - (PE-001) - yes PECU has delivered last year and expanding into cross-chain is a wonderful way for MakerDAO to get more points of contact with customers. If anything the increased headcount is not ambitious enough. We’d love to see MakerDAO expand to new frontiers and offer the same level of service on other platforms as it currently does on Ethereum. MIP40c3-SP64: Add Data Insights Core Unit Budget - yes Data insights are of utmost importance for any business and even more so for Web3 native distributed organizations. DIN-001 has demonstrated impeccable responsibility by returning unused budgets and has presented and argued a well-formed plan for its future. We support the budget increase. MIP40c3-SP62: Modify Core Unit Budget, COM-001 - yes Apart from adjusting salaries the main added expense is events. With the shadow of Covid related restrictions lifting, we think that events are an invaluable part of communications and GovComms should participate. We have seen events related budgets in other core units as well, so we hope that Maker CUs coordinate here to make event expenses as cost effective as possible. MIP40c3-SP63: Modify Core Unit Budget, COM-001 - no We feel the additional hire of a PR specialist is not justified under GovComms. We know that the debate about a fully fledged MarketingCU is moving along slowly, but ultimately this would be the right, and the only place for such a person. We think that MakerDAO should invest in marketing. Competition is heating up, and Maker has an excellent product. Without great marketing, even excellent products attract less customers than they could, and we’re more than confident that a well-running marketing CU could pay for itself many times over. This unit would be the ideal home for a PR person. Just because it’s hard to rally community support for such a core unit doesn’t mean it shouldn’t be done. And we’d love to push for more marketing and help as much as possible. Flipside’s community, for example, is fascinated by MakerDAO and has created exciting data insights like this dashboard: DAI Bounties: DAI Volume - Flipside Crypto We’re certain that it would be easy for Maker to rekindle the passions of smaller and larger investors with ease. MIP7c3-SP7: CES Domain Team Onboarding (CES-001) - yes MIP6c3-SP2: Modify the collateral application form - yes After reading the insightful discussion on the forum we support the change in the collateral application form. MIP39c2-SP32: Adding Events Core Unit (EVENTS-001) - yes Events are such a crucial part of getting the message across, it is hard to overstate. The CU contributors have already been involved for eight years, another plus. As ACREInvest said so aptly: Presence in meatspace is key. We would love MakerDAO to increase its presence and visibility. The ROI will be off-the-charts, if this is done well. MIP67: Methodology and Review Process for Structured Finance Transactions - yes A framework for assessing SFTs is a way to structure and document the thinking process. It will help RWF to attract top value lenders because they will know what they’re getting into. It will also help RWF CU to process applications because some parts do not have to be renegotiated. This is an excellent first step. We hope that the review process and methodology will not exclude SMEs or enterprises in developing markets, where we see a lot of potential. MIP66: Pairwyse Licensure - no The upfront cost of 4,000 MKR seems too high and would be better spent elsewhere. Pairwyse states that demand for fixed interest products is very high, but has not substantiated these claims or provided detailed analysis of expected MakerDAO profits. We will not support this proposal. MIP39c2-SP31: Update Data Insights Core Unit Mandate - yes In line with our approval of MIP40c3-SP64 we approve this proposal, and think that the DIN CU is working responsibly to develop reusable building blocks for data insights in other CUs.  Ongoing votes week 17/22 [sETH2] Collateral Onboarding Application - yes We were previously unaware of StakeWise as a liquid ETH2 scaling solution. Given the extremely tight 1:1 peg with ETH and the simple, direct nature of the protocol we support onboarding sETH2 as collateral. sETH2 can be redeemed to ETH 1:1 with an extremely tight peg. In general we would love MakerDAO to be apply to boost staked ETH2 capability as fast as possible. Huntingdon Valley Bank Loan Syndication Collateral Onboarding Application - yes We support the onboarding of HVBank syndicated loans as collateral. What an exciting experiment and a great step forward for MakerDAO and the lending/borrowing DAO space in general. Maker is truly blazing the trail here. Two things we want to remark on: deploying $100m in 12 months is not an easy feat. We hope HV Bank will ensure loan quality. Second: a large percentage of loans seem to be residential real estate. We’re not certain that these will continue to perform as advertised and would recommend monitoring loan health here to be able to offboard collateral when needed. Introduction & Risk Parameters for wstETH-C Vault - yes We support the new risk parameters for Lido wrapped staked ETH, plus the collateral has already been onboarded. [Signal Request] Extend SHCU (SH-001) Budget Until May Governance Cycle - abstain While we want to support the Strategic Happiness CU, we feel that compensation should be paid out in quarters or as a stream. We’re fairly new and don’t know enough about the past, so we will abstain from this vote. We hope a new budget is proposed soon and will support that within reasonable bounds. Core Unit Budget Distributions - April 29, 2022 - Support We didn’t comment on this vote on the vote.makerdao.com website, so we’re posting this here. We support this executive and want to thank the CUs for their great work. Especially excited to see what the Data Insights team will build.  Ongoing votes week 18/22 Parameter Changes Proposal - PPG-OMC-001 - 28 April 2022 - yes While we support experimentation such as lowering stability fees near term, we believe adjusting rates for pools such WBTC are not the solution to being more competitive with Aave and Compound. Instead, it is an improvement in UI/UX which leads to an easier borrowing experience and attracts a range of users. We are willing to adjust these parameters to visualize the change in the demand curve, but caution Maker’s haste adoption of lower rates - it will soon become a race to the bottom as witnessed in traditional industries. We urge Maker to think of alternative ways to maintain competitiveness and incentivize usage of vaults. [Signal Request] Onboard D3M for TrueFi - yes Voting yes, because programmatic supply to uncollateralized loans is where Maker should be going in our opinion. The risks have been deeply understood and addressed in the forum Signal Request and there are a lot of advantages to taking this to the next level and hopefully to implementation. MIP6 Collateral Onboarding Application: Emerging Markets Green Opportunity: Financing for ATD Combustors’ Egyptian Power Plant Efficiency Projects - no While we are excited to see further RWA collateral and ATDC as an emerging markets green tech company is the kind of partner we want to see, the financial aspects of the deal do not seem favorable for MakerDAO and would likely offer below open market lending rates for the ATDC. We concur with @MakerMan that a reasonable yield would be above the 4% range, which is 1.5x the revised and 4x the initially proposed rate of return. As @teej pointed out: The ultimate goal for MakerDAO is to become a programmatic source of credit for RWF and not a commercial bank of sorts. While the latter is useful to understand the market, keeping our eyes on the price means 1:1 deals have to really pay off. MIP6 Collateral Onboarding Application: India Power Green Bonds - no Similar to ATD Combustors this is another beautiful project with subpar conditions for MakerDAO. India’s stance on cryptocurrencies is a wildcard and adds direct or at least indirect regulatory risk to the collateral that at the very least would need to be reflected in a premium on lending rates. We decided to vote no on this application.  Ongoing votes week 20/2022 MIP65: Monetalis Clydesdale: Liquid Bond Strategy & Execution - Yes We strongly support RWA, yet we voted no on India Power Bonds and ATDC. Holding bonds seems like one of the more straightforward ways to access RWA and diversify DAI collateral, especially from USDC. We’re aware of the risk involved here but deem it addressed well enough and are excited about Maker going forward with this. —////—- MIP68: Monetalis Lusitano: UK Green Economy SME Wholesale Lending - Yes Maker’s clean money initiative combined with RWA, what’s not to like? On a more serious note, I’ve personally moved to the UK recently and find little to support the post-Brexit bears. The UK economy seems to be in good shape and Maker becoming an SME lender is exactly what Maker should be doing if it wants to expand its reach outside of crypto-land. —////—- MIP69: L2-to-L1 Fast Withdrawals - Yes If this comment was a Tweet, it’d read: “Maker Teleport!! LFG!! Rocket-Emoji” This is exciting. Maker is trailblazing great tech here and addressing a real pain point by offering fast L2 to L1 withdrawals —////—- MIP4c2-SP19: MIP40 Budget Process Amendment - Yes While this adds a good bit of bureaucracy to budget approvals, it actually makes following headcount and budgeting much easier for delegates. We hope that Maker CUs will cooperate and button down a process to submit budgets efficiently and welcome this increase in transparency. —////—- MIP40c3-SP67: Modify Core Unit Budget - Strategic Happiness (SH-001) - No We’d love to support more swag for Maker and think that getting aburban paid for the tireless efforts that he funded out of his own pocket is overdue. Yet we do not understand why this proposal includes additional headcount and think it lacks some much-needed budgeting love. We were very torn about this vote as a team, and would have loved to vote yes on a percentage of the proposed budget. —////—- Increase the ESM Minimum Threshold - Yes Reducing the likelihood of a potential governance attack that triggers the Emergency Shutdown Module of Maker’s operation seems prudent, especially in the light of recent “hacktivity” in that space. We don’t know if 150,000 MKR is enough of an increase but we appreciate the direction and trust Patrik_J on choosing the threshold wisely. —////—- Change lid Parameter on the Rate Limiter  - Yes We support the reduction of the ‘lid’ parameter of the rate limited Flapper to the ‘bump’ parameter. It further decreases the amount of DAI that can be auctioned off in a day. This will lead to more stability even in the worst of scenarios in our minds. —////—- Executive vote: Foundational L2 Work, Authorize New Flash Mint Module, MKR Vesting  - Support We’re excited to see this executive further Maker Teleport and want to thank the Core Units for their tireless work on behalf of MakerDAO. Truly a joy to behold.  Ongoing votes week 21/2022: Investigate implementation of an Institutional and Long Term Vaults - Antalpha - Yes A good way to boost DAI supply and generate revenue for MakerDAO. Antminer and Antalpha are partners of the highest calibre, and we’re happy to see them choosing DAI to strengthen their balance sheets. A clear win for both sides, and further strengthening Maker as an institutional lender. —////—- Investigate deploying the MakerDAO balance sheet in ETH - Yes MakerDAO as an Ethereum native has tied its fate to the foremost smart contract platform. While deploying a part of the balance sheet in ETH entails volatility risk, it also offers yield and gain opportunities and could further reduce USDC exposure, which we would like to see. —////—- Launch Maker Teleport with 1 basis point fee - Yes Teleport is such an exciting piece of technology, and we’d love to see more revenue generated from this development. Additionally it will expose more people to the Maker brand and will help to further underline MakerDAOs technology leadership. We support this proposal wholeheartedly. —////—- Offboard UNI, UNIV2DAIETH, UNIV2WBTCETH, UNIV2UNIETH, and UNIV2WBTCDAI - Yes We support the offboarding of the collateral. Negative cash flow is a red flag, and the low usage means liquidations will be unproblematic. We want to thank the CMON and Risk CU for laying the case out so clearly, making it easy for delegates to decide with confidence. Parameter Changes Proposal - PPG-OMC-001 - Yes … seems to be appropriate given current market conditions and a change in borrowers’ behavior. We support rate changes that limit risk but do not interfere with the greater UX on Maker. It also gives an opportunity for D3Ms on Aave to contribute increased revenue - hedging the popularity of their protocol.\" MIP10c7-SP2: Modify Data Models for BTC/USD, LINK/USD, MANA/USD, USDT/USD, YFI/USD Data Model - Yes A more robust data model leads to a safer and more secure oracle, limiting the chances of exploitation or manipulation. This change requires a greater amount of capital needed to manipulate these oracles and is a nod to increased security for the protocol. Short Ratification Poll for MIP10c19-SP1 - Update Oracle Expiration Time for All Oracles - Yes We support continued adjustments to limit and reduce costs.  A 62% reduction in cost is no joke and we applaud continued thinking and innovation by CUs to do so.  MakerDAO votes week #22 of 2022: Offboard UNI, UNIV2DAIETH, UNIV2WBTCETH, UNIV2UNIETH, and UNIV2WBTCDAI - Yes We support the offboarding of the collateral. Negative cash flow is a red flag, and the low usage means liquidations will be unproblematic. We want to thank the CMON and Risk CU for laying the case out so clearly, making it easy for delegates to decide with confidence. Parameter Changes Proposal - PPG-OMC-001 - Yes YES seem to be appropriate given current market conditions and a change in borrowers behavior. We support rate changes which limit risk but do not interfere with the greater UX on Maker. It also gives opportunity for D3Ms on Aave to contribute increased revenue - hedging the popularity of their protocol. MIP10c7-SP2: Modify Data Models for BTC/USD, LINK/USD, MANA/USD, USDT/USD, YFI/USD Data Model - Yes A more robust data model leads to a safer and secure oracle, limiting the chances of exploitation or manipulation. This change requires a greater amount of capital needed to manipulate these oracles and is a nod to increased security for the protocol. Short Ratification Poll for MIP10c19-SP1 - Update Oracle Expiration Time for All Oracles - Yes We support continued adjustments to limit and reduce costs. A 62% reduction in cost is no joke and we applaud continued thinking and innovation by CUs to do so.  MakerDAO votes week #24 of 2022: [XSGD] Collateral Onboarding Application (MIP6) - No We see too little benefit in onboarding a Singapore Dollar denominated stablecoin with low decentralised liquidity and do not support the collateral onboarding application of XSGD. Maker should focus its energies and bandwidth on crucial tasks like diversifying USDC collateral into government bonds and developing a Compound D3M. [KREDIKA] MIP6 Application: Pilot Vault for a portfolio of bridging loans secured with UK-based properties  - Abstain We discussed this application at length both internally and with other delegates and decided to Abstain. In addition to the considerable risk, the proposed yield is quite low at 2%. While we applaud Kredika for being forthcoming with answers and displaying ample professionalism, we could not come to a clear conclusion that exploring this collateral would be a good way to spend Maker resources. Ideally, RWA collateral is either much more lucrative than 2% or much safer than UK-based property loans. We believe that buying government bonds is the clear way forward at the current moment. Prioritization Sentiment - Technical Resource Deployment - June 6, 2022 We voted with the following ratios:    Term Lending module     Teleport     Collateral onboarding    We’re excited about the possibilities the fixed interest rate Term Lending Module would provide. Teleport is industry-leading technology and could be a profitable product in and of itself. While onboarding additional collateral would be a good way to diversify from USDC. Prioritization Sentiment - Collateral Class - June 6, 2022 We voted with the following ratios:    Peg Stability     TradFi Instruments     RWA vaults    We’d love to see more TradFi instruments like fixed rate ETFs and non-US government bonds as collateral in MakerDAO, meaning more RWA vaults. Exploring other Peg Stability solutions could mean more sources of income. [rETH] MIP6 Collateral Application - No While onboarding alternative ETH staking solutions as collateral sounds great in theory, we believe that Core Unit capabilities should be focused on where they can have outsized returns on their work. We voted no against the onboarding of rETH as collateral not because we dislike Rocketpool or their product, but because we do not want to spread core unit resources further. Incoming Velodrome Airdrop on Optimism - Yes Voting Yes on this poll, to further incentivize the use of DAI on L2s. Maker should be playing on Optimisim and Velodrome is one of the more exciting new DeFi products there. Since MakerDAO will receive the airdrop it should be put to good use. Deploy a Trial Permissionless Open Market Operation & Resurrect the Burn - No While the current MKR price certainly seems to be attractive for buybacks, we think the requested funds are still better spent elsewhere. Mainly focusing on the Endgame Plan, government bonds for USDC diversification and as a buffer to make sure that Maker can weather the incoming economic uncertainty.  MakerDAO votes week #25 of 2022: MIP40c3-SP70: Modify Growth Core Unit Budget (GRO-001) - Base Growth Budgetary discipline means spending on the right things, and prioritizing the right way. The current bear market presents a rare opportunity to make every DAI spent on marketing count triple. Very few protocols currently have the ability to spend on growth, much less the frame of mind and the personnel to do so effectively. The last bull market has seen $300m incentive funds achieve little, as other protocols outspent and outmaneuvered these initiatives with even bigger and better executed versions. Nadia and her team love Maker and love DAI, and we’re confident that she will achieve what she has set out to do. We vote for the BaseGrowth budget, because we believe in GRO-001 and we believe in Maker. MIP63c4-SP4: Onboard/Amend Keeper Network - Keep3r Network - Abstain We do not have a strong opinion on this subject and feel we want to spent more time and energy on the proposals where Flipside can make a difference and where our specific expertise is best utilized. Flipside Crypto wants to support MakerDAO with data, analytics and governance know-how. We’re abstaining on this vote. MIP40c3-SP69: Modify Core Unit Budget - Strategic Finance (SF-001) - Increased Budget We signed up for the Hawkish part of the Endgame Plan party and we firmly believe that budgetary discipline is of utmost importance, yet we find ourselves voting for two budget increases in one vote cycle. How come? In order to budget correctly the finances of the DAO have to be deeply and correctly understood. This is not the case, at the moment. There is still large ambiguity in how to account for some key items. For example how various DAI flows in the stability buffer should be accounted for. Strategic Finance has proven they have the tenacity to tackle these problems and the ability to get to the bottom of these issues, despite their massive complexity. We’re especially glad to fund the positions of Lead Accountant and Sr. Financial Analyst. In addition to the proposed budget we want to offer Strategic Finances the resources of Flipside analysts, and free on-chain data. We’re delegates and want to go above and beyond our obligations to vote by supporting MakerDAO from our core strength as a company that has access to thousands of capable analysts in our community. MIP74: Permissionless Open Market Operations - Yes Voting yes on MIP74, because we believe it offers a great structure and technology for asset management that doesn’t involve the MultiSig and that can be deployed with speed and low friction. The process is sound and comes at a good time. However we want to point out our objection to the use of 3M to test drive the operation for three months. We’d have been far more comfortable with a smaller sum or a longer timeframe, but unfortunately no scoping options were made available. We urge the RiskCU to adjust the parameters, especially in the light of current budgetary constraints. We voted for GRO-001, because now is the best time to spend on growth. We voted for an increase in the budget for SF, because Maker needs better accounting. We don’t want the DAO to spend 3M to test drive a technology. What helped us to vote yes despite our objections is the fact that MKR is at record lows now and 3M could buy 4K MKR which would later be used to fund the CU vesting schedule. MIP4c2-SP20: MIP16 Amendments - Yes We support the proposed changes in the Executive Vote cycle. MIP55c3-SP4: Adding a Special Purpose Fund - Makershire Hathaway - No We do not support the creation of the Makershire Hathaway SPF. We think that Strategic Finance should focus on accounting and understanding the current finances of the DAO better. The proposed operations could also bring a lot of counterparty risk and are unlikely to achieve substantial yield in the current climate. We believe that the proposed funds can better be used elsewhere. MIP75: Task Forces - No While we think that creating cross-functional collaboration is a great idea and Maker CUs will need to do much more of that in the future, we do not support the creation of task forces. Task forces have less oversight by delegates and further centralize power in the hands of professional insiders. While we do not want to insinuate bad faith or self-serving behavior, we have to build for the possible future. MakerDAO has to remain resistant to adversarial actors, also those on the inside. Task forces set a dangerous precedent because it allows the formation of well-funded groups of insiders with loosely defined mandates and access to substantial funds. We understand the arguments behind this MIP and want to thank hexonaut for his initiative. We think that something similar can be built in some of the MetaDAOs as part of the endgame plan, but believe that MakerDAO should strive to remain as close to a true decentralized, autonomous organisation as possible. MIP75c3-SP1: Onboard Task Force - Growth Task Force - Maker Improvement Proposals - Reject Budget In line with our vote on MIP75 we do not support the creation of a Growth Task Force. We voted for an increased budget to GRO-001 and would love to see other growth efforts bundled there. MIP39c2-SP33: Adding Lending Oversight Core Unit (LOVE-001) - No We do not support adding the LOVE-001 CU. Luca Prosperi is a very valuable contributor to MakerDAO, and we’re grateful to have his expertise available to the RWF CUs. We also understand that having an independent CU is probably the best firewall against groupthink and that another pair of eyes will make RWA safer. Nevertheless we feel that LOVE-001 makes the real world asset process even slower and introduces more friction and more bureaucracy. There’s also the issue that, while Luca is certainly the best possible choice, the proposed structure would centralize a lot of power and responsibility in the hands of one person. We’d love if Luca continues to support RWF and MakerDAO with his affable personality and business acumen, but would hope he does so as part of an existing core unit. MIP41c4-SP35: Facilitator Onboarding (DIN-001) - Yes We support Tadeos onboarding as a facilitator to DIN-001. Our interactions with him have always been a pleasure and he’s already been working with DIN-001 for some time now. Not much more to say to that, really. MIP41c4-SP34: Immunefi Security Core Unit Facilitator Onboarding - IS-001 - Abstain We do not have a strong opinion on this subject and feel we want to spent more time and energy on the proposals where Flipside can make a difference and where our specific expertise is best utilized. Flipside Crypto wants to support MakerDAO with data, analytics and governance know-how. We’re abstaining on this vote.  MakerDAO votes week #27 of 2022: MIP6: Huntingdon Valley Bank Loan Syndication Collateral Onboarding Application - Yes The Huntington Valley Bank RWA deal is the culmination of tremendous effort by Maker CUs and their counterparty. It can also serve as a blueprint and door opener for similar deals, should MakerDAO want to pursue them. The relevant risks have been identified and addressed as much as possible and we’re excited to see this come to life. MIP6 HVB offers a way for MakerDAO to diversify its USDC holdings into productive assets, which is direly needed. Flipside supports this proposal. Parameter Changes Proposal - PPG-OMC-001 - 30 June 2022 - Updates - Yes We support the proposed parameter changes, especially the GUNIV3DAIUSDC1-A stability fee increase to 0.01. Everything is better than no profit at all from USDC holdings, and this is a clear and actionable way forward. We want to point out that Aave D3M netted MakerDAO 1.3M in profits in the last twelve months and hope the DAO feels comfortable enough to raise the DC here again when security concerns have been adequately addressed. [SIGNAL REQUEST] [BEAR] Building Financial Resilience & DAO Targets - Abstain We’d love to see the DAO set clear budgetary targets, if they match strategy and are coupled with a concrete timeline and specific steps to implement them. We feel this proposal has neither, and are abstaining for that reason. We’ll continue to scrutinize individual budget proposals in even more detail going forward.  MakerDAO votes week #28 of 2022: MIP41c4-SP37: Governance Facilitator Onboarding (GOV-001) - Yes We’ve been interacting with Patrick_J for some time now and he’s been an outstanding example of professionalism and an overall joy to work with. GovAlpha is doing a great job of keeping Maker’s intricate governance as respectful, inclusive and up-to-date as possible and Patrick has already been knee deep in the process for some time. Looking forward to this welcome addition to the team. [Security Tokens Refinancing] MIP6 Application for OFH Tokens - Yes We feel strongly that Maker should urgently generate returns on the USDC portion of its balance sheet, especially given its size (currently 3.67bn directly through the PSM). RWAs allow MakerDAO to tap a market of astounding depth and provides collateral that generates profits. While we’re unsure whether complex RWAs can play a large part in Makers future, we want to support what is within grasp and has already been developed to the point of execution. Talking to Robert from CES he mentioned that HVB and SocGen are the two RWA vaults that are within easy reach, and we’re proud to support Maker in this next important step towards onboarding SocGen. As a European myself, I’m happy to see some legislative diversity in RWAs and am firmly convinced that diversifying censorship opportunities is the only way to do real-world deals and arrive at something resembling decentralization in the future.  MakerDAO votes week #29 of 2022: Community Greenlight Poll - bIBTA (Backed Finance Short-Term Bond ETF) - Yes We greenlight the onboarding of Backed Finance’s bIBTA, pending a positive review by CES, RISK and PE CUs. We think Backed has developed an interesting technology with some market potential and are looking forward to a possible alternative to USDC holdings in the PSM. Backed Finance went out of their way to answer our questions during a call, and made a lasting and professional impression on us. One thing we do want to point out, that, although Backed Finance states it has market makers waiting in line for their products, there is no way to currently judge how liquid or deep the secondary markets for bIBTA will be. We are sure that Risk CU will set parameters in such a way that Maker will never hold uncomfortably significant portions of the outstanding circulation of this token.  MakerDAO votes week #31 of 2022: Parameter Changes Proposal - PPG-OMC-001 - Yes We support the proposed parameter changes, especially lowering ETH vault stability fees in line with competitors. We hope this can attract more vault usage. Raising GUNIDAIUSDC stability fees seems like the right thing to do. Maker teleport Deployment on Starknet and Associated Risk Parameters - Yes We’re excited to see DAI make a foray into this L2 network via Maker’s very own bridge. We’re wishing this endeavor the most resounding success and hope it can prove that this deployment is technically sound. Looking forward to a raised debt-ceiling and DAI taking over L2s once security concerns have been addressed. Budget Re-allocation & Core Unit Accountability Framework - No After engaging with SFCU and GovAlpha on Discord and on the forums, we do not see enough clarity to support this proposal. We hope this discussion will continue, as there is definite demand for a tool to help objectively assess budget allocations and CU performance. The current proposal is light in addressing the centralization challenges we see and also light in laying out a clear process that is a distinct improvement over what we currently have. This is not to say that we completely oppose the overall push of the proposal. To the contrary. We think it is necessary and timely. We hope this discussion will continue and we will arrive at something more palatable and with more focus on safeguarding decentralization than the current outline.  MakerDAO votes week #33 of 2022: Starknet bridge deposit limit and Starknet teleport fees - Yes We’re excited to see Teleport come to Starknet and want to thank Starknet Engineering for their efforts here. Layer two blockchain will play an integral role for DAI adoption in the future and this is one more, important step in the right direction. We also think that the 1bps bridging fee can become a significant source of income for MakerDAO once these bridges start to facilitate decent volume. Maker is once again blazing the tech-trail with Teleport. Let’s gooo! Core Unit Offboarding Process Amendments - Yes Thanks to Tim Black and GFX Labs for pulling the different threads together and making this procedure better and more sensible than before. Offboardings are never an easy time, this helps. MIP50 Direct Deposit Module Amendment - Yes A timely and necessary amendment to MIP50. Direct Deposit Modules have a lot of potential. While we are aware of the inherent contagion risks, we believe that Maker has shown its ability to mitigate these, and think D3Ms are a wonderful tool to increase DAI supply. And not just in borrowing and lending protocols, thanks to this amendment. Fully supported. MIP76: Makershire Redux - Yes Encouraging to see feedback from the community to get integrated so well and so quickly. We support this proposal and look forward to what SF CU can achieve with 10m DAI on L2s and in stable pools. Modify Core Unit Budget (EVENTS-001) - No We don’t support offboarding this young CU. It has proven budgetary responsibility, ability to perform its mandates and incredible professionalism even in the face of adversity on the forums. We think EVENTS CU has a long way to go, and look forward to a wide array of events that move the Maker and DAI brand forwards. Hackathons, local meetup groups, conferences? We’re excited about what this group will come up with. Modify Oracles Core Unit Budget - Reduced Budget Proactively engaging MKR holders and proposing a 10% reduction in budget is a great move by ORA-001. Oracles are one of the crown jewels of MakerDAO and we support their efforts. We’re looking forward to what this CU will achieve in the next 12 months and hope Nik and his peers will continue to deepen their research. The only thing we did not fully support in the proposal was the manual repricing of vested MKRs. This skews the incentives, and makes low MKR prices somewhat desirable for the CU. But in lieu of a more uniform approach to vested MKR we can understand why this route was taken. Modify Dai Foundation Core Unit Budget (DAIF-001) - Bear Case We think that the DAI Foundation is doing great work and want to thank it’s members for their ongoing effort on behalf of the DAO. Especially for going after fake phishing and scam sites and currencies that impersonate Maker to the detriment of new crypto users. Nevertheless, we are in the depth of a bear market, and the DAO is - as of now - operating at a massive loss. We’ve selected the Bear Case option as our first choice, followed by Base Case and then Super Bear Case. ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmdS8mCx",
                        "https://vote.makerdao.com/polling/QmWCUEaV",
                        "https://vote.makerdao.com/polling/QmXhSC8x",
                        "https://vote.makerdao.com/polling/QmWphKJY#poll-detail",
                        "https://vote.makerdao.com/polling/Qme3VaY4",
                        "https://vote.makerdao.com/polling/QmWQBUi6",
                        "https://vote.makerdao.com/polling/QmUntLXk#poll-detail",
                        "https://app.flipsidecrypto.com/dashboard/dai-bounties-dai-volume-aZCWsq",
                        "https://vote.makerdao.com/polling/QmVAD1ZD#poll-detail",
                        "https://vote.makerdao.com/polling/QmTGxRjL#poll-detail",
                        "https://vote.makerdao.com/polling/QmSVzGcm",
                        "https://vote.makerdao.com/polling/QmWt5fov",
                        "https://vote.makerdao.com/polling/QmdbNKMR",
                        "https://vote.makerdao.com/polling/QmXEvrBB#poll-detail",
                        "https://vote.makerdao.com/polling/QmV7zcMW#poll-detail",
                        "https://vote.makerdao.com/polling/QmUVKBfr#poll-detail",
                        "https://vote.makerdao.com/polling/QmaE5doB#poll-detail\\'",
                        "https://vote.makerdao.com/polling/QmVdxBE5#poll-detail",
                        "https://vote.makerdao.com/executive/template-executive-vote-core-unit-budget-distributions-april-29-2022#proposal-detail",
                        "http://vote.makerdao.com",
                        "https://vote.makerdao.com/polling/QmTmehbz#poll-detail",
                        "https://vote.makerdao.com/polling/QmaoZpA8#poll-detail",
                        "https://vote.makerdao.com/polling/QmRH6Bf6#poll-detail",
                        "https://vote.makerdao.com/polling/QmUQ7VDA#poll-detail",
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-liquid-bond-strategy-execution/13148",
                        "https://vote.makerdao.com/polling/QmS7UyQT#poll-detail",
                        "https://forum.makerdao.com/t/mip69-l2-to-l1-fast-withdrawals/14041",
                        "https://forum.makerdao.com/t/mip4c2-sp19-mip40-budget-process-amendment/14250",
                        "https://forum.makerdao.com/t/mip40c3-sp67-modify-core-unit-budget-strategic-happiness-sh-001/13805",
                        "https://forum.makerdao.com/t/signal-request-increase-the-esm-minimum-threshold/15006",
                        "https://forum.makerdao.com/t/signal-request-change-lid-parameter-on-the-rate-limiter/14688",
                        "https://vote.makerdao.com/executive/template-executive-vote-foundational-l2-work-authorize-new-flash-mint-module-mkr-vesting-may-18-2022#proposal-detail",
                        "https://forum.makerdao.com/t/signal-request-antalpha-institutional-vault/15030",
                        "https://forum.makerdao.com/t/signal-request-deploy-the-balance-sheet-in-eth/14834",
                        "https://forum.makerdao.com/t/signal-request-launch-maker-teleport-with-1-basis-point-fee/15109",
                        "https://forum.makerdao.com/t/signal-request-offboard-uni-univ2daieth-univ2wbtceth-univ2unieth-and-univ2wbtcdai/15160",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-27-may-2022/15410/2",
                        "https://forum.makerdao.com/t/mip10c7-sp2-modify-data-models-for-btc-usd-link-usd-mana-usd-usdt-usd-yfi-usd-data-model/15235",
                        "https://forum.makerdao.com/t/signal-request-offboard-uni-univ2daieth-univ2wbtceth-univ2unieth-and-univ2wbtcdai/15160",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-27-may-2022/15410/2",
                        "https://forum.makerdao.com/t/mip10c7-sp2-modify-data-models-for-btc-usd-link-usd-mana-usd-usdt-usd-yfi-usd-data-model/15235",
                        "https://forum.makerdao.com/t/xsgd-collateral-onboarding-application-mip6/14975",
                        "https://forum.makerdao.com/t/kredika-mip6-application-pilot-vault-for-a-portfolio-of-bridging-loans-secured-with-uk-based-properties/15051",
                        "https://vote.makerdao.com/polling/QmYqBhDx#vote-breakdown",
                        "https://vote.makerdao.com/polling/QmdZezCr#vote-breakdown",
                        "https://forum.makerdao.com/t/reth-mip6-collateral-application/6881",
                        "https://forum.makerdao.com/t/signal-request-incoming-velodrome-airdrop-on-optimism-velo-venft/15371",
                        "https://forum.makerdao.com/t/signal-request-deploy-a-trial-permissionless-open-market-operation-resurrect-the-burn/15381",
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-30-june-2022/16248",
                        "https://forum.makerdao.com/t/signal-request-bear-building-financial-resilience-dao-targets/16004",
                        "https://forum.makerdao.com/t/request-for-poll-starknet-bridge-deposit-limit-and-starknet-teleport-fees/17187",
                        "https://forum.makerdao.com/t/new-mip4c2-sp15-core-unit-offboarding-process-amendments/15291",
                        "https://forum.makerdao.com/t/mip4c2-sp23-mip50-direct-deposit-module-amendment/16387",
                        "https://forum.makerdao.com/t/mip76-makershire-redux/16400",
                        "https://forum.makerdao.com/t/mip40c3-sp73-modify-core-unit-budget-events-001/15991",
                        "https://forum.makerdao.com/t/mip40c3-sp75-modify-oracles-core-unit-budget-ora-001/16397",
                        "https://forum.makerdao.com/t/mip40c3-sp74-modify-dai-foundation-core-unit-budget-daif-001/16379"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.049592614779567
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#18",
                    "likes": "0",
                    "time": "25/08/2022-09:39:51",
                    "content": " Ratification polls week #32 of 2022: N6M Target Spend Level - 15.5M, 15M, No change We are voting for a DAO-wide spend level of 15.5 million as the first choice, 15 million as the second, and no change as the third choice. We feel that budgetary restraint is necessary and that 15 or 15.5 million is a signal for just that. Since the proposal had no clear measures attached to it, we decided to add No Change as a third option. Simple, one-metric goals are rarely adequate in practice and bring a slew of problems like anchoring, gamifying, and ceasing to become a valuable measure, as Goodheart’s law reminds us. We also want to point out that we lack a cohesive set of accounting practices and encourage Strategic Finance CU to work towards developing those. Collateral Onboarding Project-based Funding Request (PFR) - Yes Thanks to Robert for enabling business continuity out of his existing budget. William Remor has at least indirectly approved the transition of the obligations to pay for legal services, as Doo mentioned. As of now, RWAs are still a cornerstone of MakerDAO’s future growth, and until other plans are agreed upon, we should all be open to discussing what it will take to make sure we service our partners as best we can. BlockTower Credit (Arranger) - Collateral Onboarding - Yes We want to thank Kevin Miao and his team for making it crystal clear that their incentives are tightly aligned with MakerDAO and for showcasing their professionalism and depth of thought on the matter. The NotBoring piece titled “Everything is broken” (referring to the current credit industry) highlighted the once-in-a-century opportunity MakerDAO has with RWAs. We look forward to evaluating Blocktower as an arranger by Risk CU, RWF CU, and CES CU. Cabot Renewable Energy Crypto Mining - Collateral Onboarding - No While the proposed project exhibits a couple of desirable traits, like renewable energy use and mining a decentralized cryptocurrency, we feel this is not the right time for MakerDAO to take on Cabot as RWA collateral. We want to point to the ongoing discussion about the split of RWF and the reduced capacity as well as the overall lack of appetite to take on possibly illiquid assets as RWA. DETOX MEDICAL FACILITIES DIGITAL OFFERING - Collateral Onboarding - No What an interesting proposal. In an ideal world with thriving RWA facilities this might have been interesting. As it is, with RWF operating at reduced capacity, we see no way to onboard this collateral and are voting No on this application. Executive vote: Proposal HVBank (RWA-009) Drawdown - August 24, 2022 We approve the drawdown of another 25m DAI to HVBank and are very satisfied with this deal picking up steam again. Thanks to all parties involved in keeping this going. ",
                    "links": [
                        "https://forum.makerdao.com/t/collateral-onboarding-project-based-funding-request-pfr/17290",
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-application-blocktower-credit-arranger/16900",
                        "https://forum.makerdao.com/t/mip6-cabot-renewable-energy-crypto-mining/15565",
                        "https://forum.makerdao.com/t/sb-ddc-mip6-application-interests-in-detox-medical-facilities-digital-offering-of-solidblock-holdings-llc-in-the-form-of-cryptographic-digital-tokens-ddcs-a-solidblock-offering/16177",
                        "https://vote.makerdao.com/executive/template-executive-vote-hvbank-rwa-009-drawdown-august-24-2022#proposal-detail"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.856116584564861
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#19",
                    "likes": "0",
                    "time": "30/08/2022-15:42:46",
                    "content": " MakerDAO votes week #35 of 2022: Legal Domain Work on Greenlit Collateral (bIBTA) Special Purpose Fund - Yes Since we voted yes on green lighting bIBTA as collateral, we want to see this move forward. bIBTA has the potential to allow Maker tokenized access to US treasuries with the ability to participate in the generated yield, instead of without it as is the case with USDC. We are aware that the Endgame Plan will likely limit the total amount of Maker RWA exposure, and think that this RWA should still be diversified, especially across jurisdictions. Backed Finance as a Swiss company seems like a good bet to take, given that Risk and CES proceed with a positive assessment. Parameter Changes Proposal - 25 August 2022  - Option 2, Option 1 What an exciting experiment! We’re more than just curious how changing ETH-A and WSTETH-A stability fees to just 1.5% will impact vault usage. Will it boost DAI supply? We’re pretty certain it will, but how much? Further reductions of stability fees for WBTC and other collaterals are rounding out this experiment. We also like committing to this until 31 October 2022. Maker needs more decentralized collateral, period. The changes proposed in Option 2 are a great way to test what instruments the DAO has at its disposal to make that happen. ",
                    "links": [
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-25-august-2022/17448"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.039131920710869
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#20",
                    "likes": "1",
                    "time": "08/09/2022-08:55:38",
                    "content": " MakerDAO votes week #36 of 2022: Legal Work on MIP65 Special Purpose Fund - Yes We approve the MIP65 SPF and thank Strategic Finance for keeping the ball in the air on this one. At this moment, business continuity is our number one priority for RWAs until the DAO has decided on its top-level RWA strategy. That being said, we’d love to see all the RWA SPFs that are proposed and approved collected in one place with clear descriptions and the ability to follow how and if these funds are spent. We hope SF CU can provide that at the soonest point possible. @adcv, @Aes: Flipside will provide more detailed feedback on what exactly we feel would be helpful output from SF CU, as requested. Good input from your side, thanks. Criticism should always be both respectful and constructive. Especially in a DAO of this size. MIP4c3-SP4: MIP65 Amendments - Yes Flipside Governance approves the amendments proposed. Thanks to Christian Petersen for his ongoing efforts. MKR Pro-Rata Vesting  - No Amidst the current turmoil of offboarding we feel that a principled discussion about MKR compensation and pro-rata vestings has to take place before we would feel comfortable approving a one-off. Nevertheless we want to point out that Eric, TJ and Christian did exceptional work and hope that an amicable solution and fair remuneration can be reached. HVBank Legal Update - Abstain We believe that this is a good proposal, but didn’t find the necessary legal input to come to a binding conclusion on this one. Voting abstain, but want to thank prose11 and monkey.irish for their explanations. Executive: Support and concentrate MKR We support this executive and are especially excited about the MOMC parameter changes. We will watch the respective vaults closely and hope to see decisive movements there. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip4c3-sp4-mip65-amendments/17326",
                        "https://forum.makerdao.com/t/signal-request-mkr-pro-rata-vesting-community-sentiment-poll/17350",
                        "https://forum.makerdao.com/t/poll-inclusion-request-hvbank-legal-update/17547/20"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.427655677655678
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#21",
                    "likes": "2",
                    "time": "08/09/2022-09:26:45",
                    "content": "    rspa:  That being said, we’d love to see all the RWA SPFs that are proposed and approved collected in one place with clear descriptions and the ability to follow how and if these funds are spent. We hope SF CU can provide that at the soonest point possible.   Np we will put this together ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#22",
                    "likes": "2",
                    "time": "09/09/2022-07:28:56",
                    "content": "Should have edited original response my OCD is triggered apols for the double reply.     Overview of RWA-related SPFs [SF CU] Strategic Finance       Hello,  Attn: @Recognized-Delegates, to regroup and summarize StratFi’s various SPFs for RWA initiatives, please find the table below, which we will update through edits over time:      SPF Amounts Forum Thread Governance Author Purpose Status of work     MIP55c3 SP6 50,000 Forum thread Accepted @adcv Legal Domain Work on Greenlit Collateral (bIBTA) Special Purpose Fund Not drawn yet.  Finalizing quote stage and scoping for Swiss-based lawyers. May have to wait to 25-Sep-2022 to start on account…     Please find at the link ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP55c3SP6",
                        "https://forum.makerdao.com/t/mip55c3-sp6-legal-domain-work-on-greenlit-collateral-bibta-special-purpose-fund/17166"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.932142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#23",
                    "likes": "1",
                    "time": "23/09/2022-17:57:22",
                    "content": "MIP39c3-SP2: Strategic Happiness Core Unit (SH-001) Offboarding - No While the team agrees that offboarding CU SH-001 is a valid budget cut, we have already indicated support for a similar proposal written by Rune, which we believe manages the offboarding process in a superior way. This new and improved proposal is in the pipeline and will be active for voting in the near future. We also look forward to Maker swag at BYEVinity at ETH Devcon Bogota, which is a very important and productive use of this CU. MIP55c3-SP7: Special Purpose Fund for The Ambassador Program - Yes We support the decision to allocate 81,000 DAI to the LatAm Ambassador Program as an experiment to lower the linguistic barrier to entry for Maker DAO. We hope that this leads to more involvement from top talent from around the world. In the future, we would like to explore other options for increasing participation. For instance a bounty system for Maker document translation. While we love seeing MakerDAO approach other regions outside the English speaking world, we see much too little viewers and participation on the current LatAm pages. If this doesn’t improve in the next six months, Flipside will not support this program going forward. MKR Compensation for StarkNet Engineering Core Unit  - Yes Attracting and retaining engineering talent is hard. Attracting talent that is fluent in programming secure applications in Cairo is even harder. While we’re less than thrilled about the way this MKR compensation was proposed post hoc, we want to make sure MakerDAO remains a place that attracts talented engineers and approve this MKR vesting. MIP77: Delegates in the Maker Protocol - Yes Voting Yes on this proposal feels weird, because it could be seen as a naked cash grab. But at the moment Flipside Crypto would not profit from an increase in pay by the proposed new remuneration. We are, however, actively pursuing previously undelegated MKR to delegate to us, which would mean a higher percentage of total MKR active in governance, if successful. This is on top of the already high workload of helping to steer the DAO through its current transformation. The workload is certainly more than one full time employee can shoulder, and Flipside Governance is in the lucky position to have multiple contributors available to deploy to the challenges at hand. We would love to grow this effort, but would need to feel it is economically viable in the long term to justify these additional expenses to our leadership team. We support the decision to align expectations between the Maker Community, MKR holders, Core Units, and Recognized Delegates. This proposal provides an initial framework for the components of a Recognized Delegate role, which we hope to develop and make robust. We applaud Patrick_J for summarizing and clarifying the expectations, and responsibilities of delegates in MakerDAO and overhaul the compensation and measurement structure so that the most important parts of participation are measured appropriately, while total remuneration can grow if delegates can attract previously undelegate MKR. We believe that this will be a net positive for the protocol and the DAO and that it will help governance to professionalize. It will also help offset some of the legal risks, as has become obvious just yesterday. MIP4c2-SP24: Amend Measurement Period For Delegate Participation Metrics - Yes We approve this amendment to the measurement period for delegates, even though it will be superseded by MIP 77-79 should it pass. In the event of the Delegate MIP set not passing, this amendment represents an improvement over the current measurement period, which covers the entire lifetime of delegates. MIP40c3-SP80: Modify GovAlpha Core Unit MKR Budget - Pay 150% We voted for a matching 100% of the DAI salaries with MKR and want to thank GovAlpha for their diligence and humility. Initial research into traditional company equity vesting has found that community managers and researchers usually receive little to no equity compensation, which is why we chose the lowest option. If it were possible, we would allow any number here, but the DAO has a fiscal responsibility to its token holders, so this is the kind of compromise we can get behind.  EDIT: Thanks to feedback from @ultraschuppi, we amend our rationale for this poll. GovAlpha is so much more than just research or community management. We want to make sure that we do not imply that GovAlpha are mere community managers, important as this role might be. What GovAlpha are doing is central to the functioning of the DAO, and without their quiet, neutral, and loving care, the whole would be less than the sum of its parts, not more. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip55c3-sp7-special-purpose-fund-for-the-ambassador-program/17169",
                        "https://forum.makerdao.com/t/mip40c3-sp79-mkr-compensation-for-starknet-engineering-core-unit-sne-001/17042",
                        "https://forum.makerdao.com/t/mip77-delegates-in-the-maker-protocol/16905",
                        "https://forum.makerdao.com/t/mip4c2-sp24-amend-measurement-period-for-delegate-participation-metrics/16904",
                        "https://forum.makerdao.com/t/mip40c3-sp80-modify-govalpha-core-unit-mkr-budget-q3-2022/17164"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6984151785714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#24",
                    "likes": "0",
                    "time": "30/09/2022-15:48:29",
                    "content": " MakerDAO votes week #39 of 2022: [rETH] Collateral Onboarding Risk Evaluation Update  - Yes We approve the parameter updates for rETH and hope the RocketEth users will flock to Maker to open DAI vaults as a result. Just today I read that 11 of the last 20 blocks of a sample from yesterday used MEVBoost with TornadoCash sanctions censoring transactions on the protocol level. This endangers the very future of Etherum and as a result of Maker. RocketEth offers an alternative and is more important than ever. Collateral Auctions: Analysis & Parameter Updates - September 2022  - Yes We support optimizing auction parameters for reduced slippage and want to thank the Risk CU team for their detailed reasoning and explanation behind this update MIP6 Application: RFA - Canadian Federally regulated mortgage originator  - No We do not support the MIP6 application of RFA because we feel that while the proposal was very thoughtful, the current macroeconomic environment will not be kind to residential mortgages. MakerDAO is better served with pursuing highly liquid RWA with the least possible default risk. ",
                    "links": [
                        "https://forum.makerdao.com/t/collateral-auctions-analysis-parameter-updates-september-2022/18063",
                        "https://forum.makerdao.com/t/mip6-application-rfa-canadian-federally-regulated-mortgage-originator/17303"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.540625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#25",
                    "likes": "0",
                    "time": "05/10/2022-18:42:57",
                    "content": " MakerDAO votes week #40 of 2022: Parameter Changes Proposal - PPG-OMC-001 - 29 September 2022 - Yes We support the MOMC recommendation and the ongoing experiment with low stability fees. We hope that decentralized collateral is attracted by these incentives. Multisig to manage the $VELO veNFT  - Yes Flipside volunteered as a signer for the Velodrome multisig and is looking forward to actively aiding MakerDAO in managing it’s Velodrome veNFT. MIP6: Anchorage Lending Crypto Mining Collateral Onboarding Application - No We want to thank Anchorage Lending for their well put-together application but can not support this at the current moment. The DAO is in the process of restructuring its RWA efforts and we feel the applicant would not find the ideal experience, now. We’re also concerned about the ASIC miners as underlying assets for the loans originated. We have seen regulators take a more critical stance towards Proof or Work mining. Justified or not, this ongoing shift in sentiment creates additional risk here. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-create-a-multisig-to-manage-the-velo-venft/17777",
                        "https://forum.makerdao.com/t/mip6-anchorage-lending-crypto-mining-collateral-onboarding-application/17822"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.190476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#26",
                    "likes": "0",
                    "time": "12/10/2022-16:19:29",
                    "content": " MakerDAO votes week #41 of 2022: Proposal to whitelist Oasis.app on rETHUSD Oracle - Yes We approve the Oasis.app Oracle access for rETH/USD. We’re looking forward to Oasis onboarding new users to this collateral like it did for other collaterals in the past. Change PSM-GUSD-A parameter - Yes Pretty exciting to see the Maker having the possibility of earning yield on its actual PSM. We want to thank Gemini for their proposal and are excited to see this come to fruition. Ending DAI Funding for Sourcecred - Yes Not an easy decision to make. Sourcred was instrumental in onboarding community members and a fantastic incentive for new delegates to cut their teeth on creating MIPs. However, recent payouts to obvious farming behavior have demonstrated limitations. Flipside is looking forward to working with GovAlpha and developing the next generation of this system. Modify D3M Guidance for MOMC  - Yes Voting yes on removing the yield from the bar calculation. Aave and Maker cannot be compared on the merit of rates alone. Maker needs to decide whether to service users directly, which would mean a lower dust limit, or make good use of its D3M facility. This seems like a very valuable experiment to run. Modify D3M Guidance - Spread - 0.50% and 0.00% DAI supply rules supreme. DAI is the product people trust and love, and we’re happy to see Aave users adopt it, even with no revenue to Maker. We hope most will borrow DAI against decentralized collateral to offset the DAO’s massive USDC and stablecoin exposure. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-change-psm-gusd-a-parameters/18142",
                        "https://forum.makerdao.com/t/poll-notice-signal-support-for-ending-dai-funding-for-sourcecred/18204",
                        "https://forum.makerdao.com/t/signal-request-modify-d3m-guidance-for-momc/18069",
                        "https://forum.makerdao.com/t/signal-request-modify-d3m-guidance-for-momc/18069"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.986562049062049
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#27",
                    "likes": "0",
                    "time": "24/10/2022-16:38:53",
                    "content": " MakerDAO votes week #43 of 2022: Latest endgame-prelaunch-mip-set topics  - Yes We support the Endgame Plan and are looking forward to ushering in a new paradigm in scaling decentralized organizations. MetaDAOs will unlock productivity and innovation in the Maker ecosystem and make sure Maker remains the number one DeFi protocol. We are here to support the Endgame Plans execution with data, insights, and hands-on implementation wherever possible and want to make sure the DAO enters a new age of productivity and success. The vision is there, we’re here to make it happen. MIP81: Coinbase USDC Institutional Rewards - Yes Flipside Governance supports this proposal and wants to thank Coinbase for getting the ball rolling on PSM yields. We will continuously monitor the ongoing needs of the DAO and recommend specific steps for addressing them going forward. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip81-coinbase-usdc-institutional-rewards/17703"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.262626262626263
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#28",
                    "likes": "0",
                    "time": "24/10/2022-16:40:07",
                    "content": "Due to the differences in timezones between our European delegates and Flipside Crypto’s finance department we missed a round of votes. We still want to give our rationale so the community can see our reasoning and bring transparency to the forums. Offboarding the Strategic Happiness Core Unit (SH-001) - Yes Andrew Burban embodies the excitement, the passion and the soul of MakerDAO. We feel that his services will be needed for as long as Maker exists, and even more so when multiple metaDAOs want to form a tight-knit community. That being said Flipside Governance felt that a Core Unit was not the right way for this relationship to blossom and we support the offboarding proposal. We hope that Strategic Happiness (DAO, Inc, LLC, …) will remain a valuable partner for MakerDAO for a long time to come. Quite frankly: no one out there makes swag like that. Offboarding the Events Core Unit (EVENTS-001) - Yes Offboarding these kick-ass, talented individuals a few months after approving their budget is not the easiest decision, and we want to extend our heartfelt sympathies to the contributors. Given current developments, we concluded that event coordination is best outsourced or a part of Growth CUs mandate, as the DAO works its way back to profitability. Offboarding the Real-world Finance Core Unit (RWF-001) - Abstain While we do feel there is precedent for off-boarding with a golden parachute, we are ultimately uncomfortable with the amounts that have been proposed. Thus we are abstaining. MIP82: Monetalis/Coinbase Appaloosa - Yes Voting Yes on this interesting yield opportunity. MakerDAO as a lender to institutional clients? Sounds about right. Our only concern is that MIP81 and MIP82 together earmark a critical part of MakerDAO’s PSM funds for Coinbase custody or as a client. While Coinbase is among the most respected institutions in crypto, we feel that the DAO should diversify counterparty risk in the long run. MIP55c3-SP9: Legal and Commercial Risk Domain Work on Greenlit Collateral BlockTower Credit (RWA Arranger) SPF - Yes We approve the necessary funds for the domain work on the BlockTower credit greenlight, and want to ask SF CU to update the table containing RWA SPFs with this additional information. BlockTower is a major Maker (MKR) stakeholder right now and we look forward to this ongoing relationship. MIP4c2-SP26: Facilitator Offboarding Process (MIP41c5) adjustments - Yes The current facilitator offboarding process includes a long and painful delay. Painful for the facilitator, who has to remain in limbo until clarity can be reached, and painful for their core unit and the wider DAO. The proposal introduces welcome adjustments and we support it. MIP41c5-SP12: Facilitator Offboarding (RWF-001) - Yes We support the offboarding of Will Remor as Facilitator to RWF-001 CU. See our remarks to the RWF CU offboarding poll for further details. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c3-sp4-offboarding-the-events-core-unit-events-001/17755",
                        "https://forum.makerdao.com/t/mip39c3-sp5-offboarding-the-real-world-finance-core-unit-rwf-001/17753",
                        "https://forum.makerdao.com/t/mip82-monetalis-coinbase-appaloosa/17768",
                        "https://forum.makerdao.com/t/mip55c3-sp9-legal-and-commercial-risk-domain-work-on-greenlit-collateral-blocktower-credit-rwa-arranger-spf/17776",
                        "https://forum.makerdao.com/t/mip4c2-sp26-facilitator-offboarding-process-mip41c5-adjustments/17592",
                        "https://forum.makerdao.com/t/mip41c5-sp12-facilitator-offboarding-rwf-001/17332"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.485367063492063
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#29",
                    "likes": "0",
                    "time": "14/11/2022-13:41:18",
                    "content": " Week 45 of 2022 Parameter Changes Proposal - PPG-OMC-001 - 28 October 2022 – Yes We support increasing the debt ceiling to 160 million for the Compound DM3 as well as the parameter changes for MANA–A; reduce debt ceiling to 10 million & increase stability fee to 7.5%. The latter is a rationale choice in the face of low MANA liquidity and high risk positions. We agree that the former should bring 1.8 million DAI in annualized revenue and are excited to see the Compound V2 D3M activated. [Signal Request] The SHCU Requests a moment of your time – No While we appreciate the SHCU’s contribution to Maker prior to offboarding, we do not believe this is an appropriate use of funds at this time. [Signal Request] Clear Vaults’ Bad Debt in the MakerDAO protocol – Yes Clearing vaults’ bad debt is good risk management to clean up Maker’s balance sheet. We then supported the regular executive and look forward to seeing Maker teleport implemented on StarkNet. We also supported the emergency executive to limit contagion risk from current market conditions. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-the-shcu-requests-a-moment-of-your-time/18466",
                        "https://forum.makerdao.com/t/signal-request-clear-vaults-bad-debt-in-the-makerdao-protocol/18376"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.286309523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#30",
                    "likes": "0",
                    "time": "15/11/2022-14:00:00",
                    "content": " MakerDAO votes week #46 of 2022: [USDC-A, USDP-A, GUSD-A] Liquidation parameters & Auctions activation - Yes We approve the liquidation parameters for USDC-A, USDP-A and GUSD-A vaults as proposed by RISK CU. It’s a testament to the market conditions that this is happening now, but we feel it is a prudent step for any market. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#31",
                    "likes": "1",
                    "time": "23/11/2022-17:30:50",
                    "content": "MakerDAO votes week #47 of 2022: BlockTower Credit (Arranger) - Collateral Onboarding / Collateral Onboarding Applications (MIP6) - Yes Kevin Miao and his team are not only well aligned with MakerDAO through their MKR holdings, they also displayed the highest level of professionalism and diligence during their community calls. We’re happy to support this MIP6 application and look forward to seeing what the four RWA vaults from BlockTower can do for the DAO. [GNO] MIP6 Collateral Onboarding Application - GnosisDAO - Yes Some have pointed out that GNO collateral might not be profitable initially. We’d say that this small cost is well worth it. GnosisDAO has expressed interest in a long-term, mutually beneficial relationship. Their team is of the highest caliber and their security concern is visible in everything they do. We gladly support this application. [renBTC-A] Proposed Offboarding Parameters & Context  - Yes We support the gentle offboarding of this tail-end collateral, especially in light of recent events around REN and FTX. Thanks to RISK CU for their prompt action and sensible guidance. [Request to Poll] Poll to move forward with the commercial risk, legal, technical, and other work necessary to onboard the deal outlined in MIP90 - Yes We approve SF moving forward with the work necessary in the MIP90 deal. See our rationale for onboarding BlockTower. MIP89: Monetalis - Arrow Andalusian - Yes We approve investing 300MM DAI into Blackrock/iShares ETF products to prop up earnings and diversify out of our dependence on Circle. That said, we want to point out that RWA monitoring solutions are not where they need to be and encourage Monetalis to provide cutting-edge reporting to the DAO. MIP88: Monetalis - Redwood Friesian - No We’re not entirely comfortable with a residential mortgage-backed investment in the current market. Monetalis is MakerDAOs prime arranger for RWAs, and we had the pleasure of meeting part of the team in Barcelona. We’re confident that the deal is well-sourced and vetted, but we currently do not support it. MIP40c3-SP86: Modify TechOps Core Unit DAI Budget  - Yes We approve the TechOps CUs budget. However, we encourage tighter budgeting practices moving forward if the CU is to charge both the broader DAO and CUs individually for services. We will monitor the situation closely going forward. MIP40c3-SP85: Modify Sidestream Auction Services Core Unit Budget (SAS-001)  - Reject Budget SAS built a kick-ass product during its incubation period and developed it into a delightful whole. With considerable sadness, we feel that the current market conditions and the necessity to fill the POVE mean we can no longer fund the ongoing development as a core unit. We’re sure the talented engineers in SAS can get tightly scoped SPFs approved and transition to being ecosystem actors as quickly as possible. MIP40c3-SP84: Modify Core Unit Budget (COM-001) - Approve Budget Not only is this Core Unit exemplary in its frugal budgets, they perform its mandate with zest and professionalism. We happily support the GovComms budget and rely on their MIPs at a glance, Forum Recaps, and coordination skills almost every day. MIP40c3-SP83: Modify Immunefi Security Core Unit Budget (IS-001)  - Reject Budget We approve the current budget for the Immunefi CU. We’ll monitor funds’ use closely to ensure that all unused expenditures are returned to the DAO. MIP86: CoinShares Active Treasury Management  - Yes We approve MIP86 and commend CoinShares for their proactive approach to the Maker community. We were happy to hear they already offer a transparent monitoring solution for their products. They would willingly work with PE and RISK to develop a smart contract solution to manage our exposure making automatic parameter updates possible. The deal would ramp up slowly as we get more comfortable with the counterparty. Supported. Modify the Sustainable Ecosystem Scaling Core Unit Budget - Speedy Operations SES has an integral role in the current shift to the Endgame paradigm and has delivered an excellent framework for project-based financing as well as accounting and governance dashboards we often use and reference for our decisions. Even the larger “Speedy Operations” budget represents a substantial reduction year over year, which is why we’re happy to support this option. Modify Emulated Surplus Buffer Upper Limit - No We do not believe this is the right approach to managing stETH exposure and trust the experts in the RiskCU to manage the POVE. We will continue to monitor the risk parameters closely and make recommendations if we see the necessity. Modify Sidestream Auction Services Core Unit Budget (SAS-001) - Reject Budget SAS built a delightful product during its incubation period, which is currently used for liquidating the more exotic collateral types. We feel there is a place for ongoing development as an ecosystem actor that contracts with metaDAOs and core units on a project-to-project basis. That being said, we think it is no longer fitting to support the development of this product as a MakerDAO core unit and are confident that this team will find plenty of customers on their own. OUSD Decentralized Rewards - No Following recommendations from RiskCU and the general market sentiment, we do not feel confident that expanding into OUSD collateral is a sensible direction for MakerDAO. We want to thank the Origin team for their effort and are certain they will find widespread success as soon as markets recover. Modify Development & UX Core Unit Budget (DUX-001) - Current Budget DUX builds products that delight. The amount of design and UX work necessary to further develop the necessary primitives and products for the metaDAO frontends is substantial. It warrants the bigger of the two budget options to ensure the best possible outcome. Immunefi Security Core Unit Facilitator Onboarding - No We commend psychonaut for his tenacity and ongoing commitment to MakerDAO, even in adversity. Ultimately we do not see sufficient grounds for approving a Co-facilitator. We’re voting Reject Budget on the ISCU’s proposal and voting to not renew their mandate. We hope psychonaut will continue to offer his services via SPFs or as an EA. MIP40c3-SP83: Modify Immunefi Security Core Unit Budget (IS-001)  - Reject Along with the proposal for approval of a co-facilitator and the ISCU’s mandate, we’re voting NO on this poll for a budget. Immunefi should transition to becoming a valuable ecosystem actor as soon as possible. We’re looking forward to seeing Joshua Pritkin’s contribution to the transformation of MakerDAO. MIP39c2-SP38: Modify Immunefi Security Core Unit Mandate (IS-001)  - No Along with the proposals for the ISCU Budget and the ISCU co-facilitator, we’re voting No on this poll. We value the contribution of ISCU but think it should transition to becoming an ecosystem actor. ",
                    "links": [
                        "https://forum.makerdao.com/t/gno-mip6-collateral-onboarding-application-gnosisdao/17321",
                        "https://forum.makerdao.com/t/renbtc-a-proposed-offboarding-parameters-context/18864",
                        "https://forum.makerdao.com/t/request-to-poll-poll-to-move-forward-with-the-commercial-risk-legal-technical-and-other-work-necessary-to-onboard-the-deal-outlined-in-mip90/18845",
                        "https://forum.makerdao.com/t/mip89-monetalis-arrow-andalusian/18338",
                        "https://forum.makerdao.com/t/mip88-monetalis-redwood-friesian/18336",
                        "https://forum.makerdao.com/t/mip40c3-sp86-modify-techops-core-unit-dai-budget/18290",
                        "https://forum.makerdao.com/t/mip40c3-sp85-modify-sidestream-auction-services-core-unit-budget-sas-001/18253",
                        "https://forum.makerdao.com/t/mip40c3-sp84-modify-core-unit-budget-com-001/18250",
                        "https://forum.makerdao.com/t/mip40c3-sp83-modify-immunefi-security-core-unit-budget-is-001/18209",
                        "https://forum.makerdao.com/t/mip86-coinshares-active-treasury-management/17900",
                        "https://forum.makerdao.com/t/mip40c3-sp87-modify-the-sustainable-ecosystem-scaling-core-unit-budget-ses-001/18339",
                        "https://forum.makerdao.com/t/mip84c10-sp1-modify-emulated-surplus-buffer-upper-limit/18315",
                        "https://forum.makerdao.com/t/mip40c3-sp85-modify-sidestream-auction-services-core-unit-budget-sas-001/18253",
                        "https://forum.makerdao.com/t/mip87-ousd-decentralized-rewards/18216",
                        "https://forum.makerdao.com/t/mip40c3-sp82-modify-development-ux-core-unit-budget-dux-001/17611",
                        "https://forum.makerdao.com/t/mip41c4-sp38-immunefi-security-core-unit-facilitator-onboarding-is-001/16348",
                        "https://forum.makerdao.com/t/mip40c3-sp83-modify-immunefi-security-core-unit-budget-is-001/18209",
                        "https://forum.makerdao.com/t/mip39c2-sp38-modify-immunefi-security-core-unit-mandate-is-001/18208"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.132977843915343
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#32",
                    "likes": "0",
                    "time": "23/11/2022-17:42:13",
                    "content": "    rspa:  We approve the current budget for the Immunefi CU.   Can you expand on your thinking here? Is it your intention that ISCU should continue to operate using funds from the current operational wallet and pay bug bounties using executive spell instead of the small payment process? Without an approved budget, I’m not sure how to could justify continuing to work given that I would not be authorized to accept compensation?     rspa:  We value the contribution of ISCU but think it should transition to becoming an ecosystem actor.   We hear and respect your sentiment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.95
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#33",
                    "likes": "3",
                    "time": "23/11/2022-17:47:58",
                    "content": "    rspa:  We happily support the GovComms budget and rely on their MIPs at a glance   What product is this? I thought GovAlpha was doing all the MIPs recaps (Weekly MIPs post and proposal summaries), and don’t want to be duplicating work if I’m mistaken. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#34",
                    "likes": "1",
                    "time": "23/11/2022-19:54:56",
                    "content": "Mips Update is indeed a GovAlpha thing. We do Forum at a Glance, Weekly Relay, and the monthly Core Unit Updates (amongst many other things) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#35",
                    "likes": "1",
                    "time": "23/11/2022-20:05:24",
                    "content": "Update: After multiple members pointing this out, and digging into the specifics. We changed our vote to: Rejecting the Budget Request for GovComms in an attempt to encourage a merger, and greater partnership, led by GovAlpha. Flipside feels that GovAlpha would be best suited and equipped to fulfill its mandate. We encourage, David Utro, a pioneer for Governance in Maker, to join the efforts of Gov Alpha - and thank him for his contributions under the previous GovComms mandate. We want to optimise the budget as much as possible. Here’s context from March 2021: MIP39c2-SP8: Governance Communications Core Unit, COM-001 - #2 by juan ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#36",
                    "likes": "1",
                    "time": "23/11/2022-20:17:39",
                    "content": "Our mistake Payton. Should’ve checked. Ton of writing necessary this week and this slipped. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#37",
                    "likes": "0",
                    "time": "02/12/2022-12:43:25",
                    "content": " MakerDAO votes week #48 of 2022: DAI Savings Rate - 1%, 0.75% We vote for a 1% DSR rate as an experiment that needs to be closely monitored. The best case scenario is that it increases DAI demand and supply via the PSM. And that MakerDAO could finance the yield through existing RWA programs, especially MIP81. Risks: Apart from MIP81, most RWAs offer deferred yield, whereas DSR payouts are due immediately. This could introduce a liquidity risk. MakerDAO is also accepting stETH as collateral with 0% SF. We could have stETH deposited for additional yield via the DSR, with no SFs to offset the cost. All in all a big push. We think it’s the right push, but it needs to be constantly monitored to ensure we know what price we’re paying. We updated the vote and added 0,75% as second choice to help the IRV poll selecting a winner. Parameter Changes Proposal - PPG-OMC-001 - 24 November 2022  - Yes We approve the parameter changes and cleanups to reflect the current market situation. Specifically reducing the ETH-B line to 250MM and the WBTC-A line to 500MM. Also excited to increase the wstETH-A and wstETH-B lines to 500MM. Poll to move forward with the commercial risk, legal, and other work necessary to increase the NS-DROP DC to 50M DAI - Yes We approve Strategic Finance undertaking the necessary legal and risk work to increase New Silver’s debt ceiling to 50M DAI, favorable assessment withstanding. ",
                    "links": [
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-24-november-2022/18925",
                        "https://forum.makerdao.com/t/request-to-poll-poll-to-move-forward-with-the-commercial-risk-legal-and-other-work-necessary-to-increase-the-ns-drop-dc-to-50m-dai/18915"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.719728800611153
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#38",
                    "likes": "0",
                    "time": "15/12/2022-16:29:07",
                    "content": " MakerDAO votes week #50 of 2022: Change of Ownership of the Ambassador Program’s Multi-Sig  - Yes We support swapping one of the owners from the Ambassador Multisig to Sebix from Kat. Thanks for stepping in, Sebix. All the best to Kat. Candidates for Dai Foundation Board Member Election Poll  - 0xbocaJ We choose 0xbocaJ as a candidate for the Dai Foundation Board. 0xbocaJ has been active in the community for considerable time and displayed a deep understanding of the DAO and the current transition to the Endgame Plan. We’re glad that he has been nominated. Caveat: We have heard that 0xbocaJ has a role as outside counsel to Redwood of Monetalis Redwood fame. We expect complete transparency and clarity about any conflicts of interest arising out of this function. Request to Poll: SAS Spending Permission  - Yes We’re happy to see the talented SAS developers pivot to provide services to the Endgame Plan transition and approve the requested financing for December 2022 to March 2023. MakerDAO needs development talent, and SAS is qualified. While we voted No on the budget for the continuation of the development of the auction platform, because we couldn’t see enough use to justify the cost, we’re looking forward to seeing the team’s contribution to the ongoing reorganization, which brings copious amounts of development challenges. GovComms Winddown Spending Permission - Yes We approve the requested spending so the GovComms facilitator can gracefully wind down the operation. Maker should take care of its own, even if it’s time to unwind some roles. To David: Thank you for handling this matter with professionalism, and emotional maturity. We were deeply impressed. Ratification Poll for Pioneer DeFi-focused Language Dataset for the Benefit of Risk Modelling & Governance Communication (MIP55c3-SP11)  - No We do not support the requested funding for the language dataset analysis. We also want to express our concern for the level of vitriol in the discussion and would have liked to see a more conciliatory tone aimed at resolution. We do not see this poll as a No to pvl, whom we respect, nor as a blanket Yes to Risk CU, although we find no fault on their part, and think their conduct so far has been exemplary. We’re rather saddened that this experiment has become a platform for political activity. ",
                    "links": [
                        "https://forum.makerdao.com/t/candidates-for-dai-foundation-board-member-election-poll/18812",
                        "https://forum.makerdao.com/t/request-to-poll-sas-spending-permission/19107",
                        "https://forum.makerdao.com/t/govcomms-winddown-spending-permission/19067",
                        "https://vote.makerdao.com/polling/QmYsosW6#vote-breakdown"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.477777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#39",
                    "likes": "0",
                    "time": "20/01/2023-12:59:35",
                    "content": "MIP4c2-SP31: MIP63 Maker Keeper Network Amendment - Yes We approve the Amendments to the Maker Keeper Network and thank hexonaut for the diligence and depth of understanding he displayed in this proposal. MIP55c3-SP14: Defense Fund - Yes A lot of discussion centered around the whether funds should be approved before the whole product is developed or later. We want to think Layer Zero for taking ample time out of his busy schedule to address these questions in detail and in full transparency. We approve this MIP55c3 and are looking forward to the first anon friendly defense fund in the industry at scale. Maker is once again blazing ground. Caveat: The funds need to be tightly monitored and regular reporting needs to be in place. We are looking to SES and LayerZero to provide regular updates to the community here. MIP92: Onboard PSM USDC to Yearn to earn Yield - Yes Yearn is one of the premier names in the DeFi business and one of the principal innovators. While we see that YFI vaults are currently almost empty at 14.2% of the Debt Ceiling we welcome the opportunity to generate yield in a completely decentralized fashion and to deepen the partnership with this stalwart. Fee sharing has been offered by Yearn and is an important reason why we approve. We encourage the Yearn DAO and its community to use MakerDAO YFI vaults more so these two DAOs can align further. MIP13c3-SP13: Declaration of Intent to Develop a Comprehensive On-chain Monitoring Solution for RWA Vaults - Yes Flipside Governance and Feedblack Loops proposed this MIP13c3 and we support it wholeheartedly. Flipside is not set to profit from this proposal in any way, so there are no conflicts of interest on our side. We want to see MakerDAO thrive and it can only reasonably hope to do so if it can monitor collateral it has existential exposure to. We’re deeply grateful for the dialogue on the forums and hope that solutions will help clarify what kinds of RWA collateral MakerDAO can monitor cost effectively. MIP63c4-SP5: Onboard/Amend Keeper Network - Chainlink Automation  - Yes The Chainlink team offers to run a trial period pro-bono and the proposal already shows a deep understanding of the relevant matters. We gladly support this proposal MIP55c3-SP12: Commercial Risk and Legal Domain Work to Support SF-001 Expanded Mandate Related to RWAs - Yes Flipside approves the additional 209,000DAI requested for risk and legal domain work. We want to thank AES and adcv for providing the requested materials to support our decision in a timely manner. MIP14c2-SP2: Subproposal for Protocol DAI Transfer to Fund ISCU from Dec 2022 to May 2023  - Yes Approving 43,560 DAI to ISCU to remunerate psychonaut for orderly wind down and work he has already done in the last 7 weeks. MIP14c2-SP1: Requesting Protocol DAI Transfer to fund TechOps CU for February 2023  - Yes Approving 138,894 DAI for TechOps to fund operations till February. We’re very pleased to see this kick-ass team move forward in their transition to Endgame and becoming professional actors in the ecosystem. MIP39c3-SP7: Core Unit Offboarding (COM-001) - 80% / 100% / Reject Thanks to David Utro for his long standing service as a community member and as a facilitator for GovComms. While the dialogue around the concrete sum for the golden parachute was a little more contentious than we would have hope we feel a decent compromise has been reached. MIP4c2-SP32: Remove MIP14c4: Protocol DAI Transfer Ceiling - Yes Moving forward in this transition period we expect to see many more of these funding requests. We even submitted one ourselves just last week. Approving this to unlock our future. MIP4c4-SP3: Obsolete MIP Removal (MIP23, MIP28) - Yes This proposal seems humdrum until you realise how important it is. MIPs and governance output needs to be put to careful scrutiny in regular intervals and quickly and effectively dispatched if it no longer serves its original purpose or any purpose at all. Rules are cheap, compliance is expensive. MIP4c4-SP2: MIP14 Repeal - No We think MIP14 will be one of the important instruments to fund the transition to Endgame. We need it. Not approved. MIP4c2-SP28: Amend MIP51 to remove MIP51c4: Calendar Exceptions - Yes We want to give Maker governance the ability to react at all times - even during times when the workforce takes a much needed, and well deserved break. We think it is imperative that this break is observed and want to make sure the social contract around this time of respite and family reunification is kept as sacred as possible. Voting Yes on this MIP to increase the potential flexibility of MakerDAO governance, not to remove the only agreed upon break from a protocol that demands a lot from its participants. The pause is as important as the note, as Miles Davis said, allegedly… MIP4c2-SP29: Amend MIP61 to tighten up Recognized Delegate Participation Metrics  - Both / Executive modifier only / Abstain modifier only We appreciate this proposal and its push to tighten up participation metrics for Recognized delegates. Maker delegates are the industry standard and should aim to push this ever higher. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip55c3-sp14-defense-fund/19076",
                        "https://forum.makerdao.com/t/mip92-onboard-psm-usdc-to-yearn-to-earn-yield/18971",
                        "https://forum.makerdao.com/t/mip13c3-sp13-declaration-of-intent-to-develop-a-comprehensive-on-chain-monitoring-solution-for-rwa-vaults/19095",
                        "https://forum.makerdao.com/t/mip63c4-sp5-onboard-amend-keeper-network-chainlink-automation/18722",
                        "https://forum.makerdao.com/t/mip55c3-sp12-commercial-risk-and-legal-domain-work-to-support-sf-001-expanded-mandate-related-to-rwas/18943/9",
                        "https://forum.makerdao.com/t/mip14c2-sp2-subproposal-for-protocol-dai-transfer-to-fund-iscu-from-dec-2022-to-may-2023/19025",
                        "https://forum.makerdao.com/t/mip14c2-sp1-requesting-protocol-dai-transfer-to-fund-techops-cu-for-february-2023/19018",
                        "https://forum.makerdao.com/t/mip39c3-sp7-core-unit-offboarding-com-001/19068",
                        "https://forum.makerdao.com/t/mip4c2-sp32-remove-mip14c4-protocol-dai-transfer-ceiling/19093",
                        "https://forum.makerdao.com/t/mip4c4-sp3-obsolete-mip-removal-mip23-mip28/18834",
                        "https://forum.makerdao.com/t/mip4c4-sp2-mip14-repeal/18533",
                        "https://forum.makerdao.com/t/mip4c2-sp28-amend-mip51-to-remove-mip51c4-calendar-exceptions/18675",
                        "https://forum.makerdao.com/t/mip4c2-sp29-amend-mip61-to-tighten-up-recognized-delegate-participation-metrics/18696"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.885515873015873
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#40",
                    "likes": "0",
                    "time": "20/01/2023-13:02:54",
                    "content": "Due to an issue with internal processes these two votes where not submitted on time. The issue has since been resolved. We want to communicate our rationale nevertheless. Decrease GUSD PSM Fee Out (tout) - Yes Swapping to DAI seems like something that should be possible for any Maker user with minimal friction. Given the current perceived risk around Gemini and GUSD it feels wrong to charge risk averse holders for their way out. Adjust the GUSD PSM Debt Ceiling - No change / Decrease to 0MM While we think that the discussion around the risk of holding substantial amounts of GUSD and especially holding large parts of the entire market capitalization of this stablecoin is very pertinent, we believe lowering the DC is not the right step to take now.  It doesn’t actively reduce the exposure, and at the same time, sends a signal of distress to the wider world and thereby increasing the actual risk. Gemini have been nothing but an exemplar as a partner, and this action is done without giving their team a chance to actively build trust Nothing about GUSD is substantially riskier now than 3 months ago when we approved 500MM. Nothing about GUSD seems materially different than USDP from a risk perspective.  Once more, the existential exposure of MakerDAO to centralized stablecoins is starkly illuminated, and the necessity to decrease it to a more manageable level is becoming as clear as day. We will support proposals that actively go in this direction. ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmZs1EMK#vote-breakdown"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2228260869565215
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#41",
                    "likes": "0",
                    "time": "20/01/2023-14:44:00",
                    "content": "MIP55c3-SP13 : Special Purpose Fund for developing Proof-of-Performance for Viridian Cluster - No We salute Rajiv for his initiative and experimenting with how to get the transition to Endgame funded and started. At the current stage we feel this proposal is not scoped well enough. We would like to see a proposal where the work the DAO will receive is clearly defined and priced, and look forward to supporting this fine group of talent on their way to the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.802721088435375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#42",
                    "likes": "0",
                    "time": "05/02/2023-08:02:00",
                    "content": " Week from 2023-01-31 MIP14c2-SP3: Requesting Protocol DAI Transfer to Fund Endgame Information Portal - Yes We believe information about the Endgame and especially an easy portal where potential contributors can onboard is important, and are excited about using a JokeDAO contest to gather ideas from the wider MakerDAO community about how to approach this best. We don’t see this as a competitor to GovAlphas portal, but as a potential improvement, or as a potential supplement to the great effort by LFW and others. Executive vote: We approve the temporary shutdown of the Maker Teleport, Offboarding GovComms and the transitory funding of TechOps CU. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.151041666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#43",
                    "likes": "1",
                    "time": "08/02/2023-20:12:47",
                    "content": "Update the Multisig Managing the Velodrome NFT - Yes We approve adding CodeKnight and StableLabs as signers for veNFT management, which will become a three of five multisig. Thanks to @MakerMan for establishing what turned out to be a profitable strategy. Parameter Changes Proposal - PPG-OMC-001 - 2 February 2023 - Yes We approve the proposed parameter changes, including the increased stability fees for wstETH. Slowly turning on the D3M again is great, too. Maker deserves a place at the heart of DeFi. Supporting this weeks executive to lower dust floors on select vaults and send payment streams to Keepers. ",
                    "links": [
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-2-february-2023/19637"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#44",
                    "likes": "0",
                    "time": "16/02/2023-11:15:52",
                    "content": "Ratification Poll for Restart a daily $100 Micro-Burn of MKR in Show of Good Faith to MKR Holders (MIP74c1-SP1) - No While we think that burning MKR or some other form of value accrual for MKR token holders is a top priority the proposed micro burn would not achieve the desired effect while binding engineering resources. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.34375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#45",
                    "likes": "3",
                    "time": "20/02/2023-10:09:17",
                    "content": "We want to thank all our delegators for trusting us with their MKR—especially @rune for trusting a newcomer with such a substantial delegation. But we feel equally committed to the more than 22 other delegators who have voted for Flipside Governance by delegating their precious MKR. It is time for us to renew our delegate contract, and we would appreciate your continued support. Here’s a link to our new delegate contract. Maker Governance - Flipside Governance Delegate Information (makerdao.com) We compiled a report of what we have done under your mandate as delegates, which you can download as a PDF here: MakerDAO_Delegate_Renewal___Flipside_Governance.pdf - Google Drive. We will continue to give our best and feel very fortunate to be a part of this vibrant, sometimes chaotic, always opinionated and clearly gifted community. ",
                    "links": [
                        "https://drive.google.com/file/d/12HIK3lyy4vdkBubeHNlgtAMZKI9hgN4-/view?usp=share_link"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.59901515151515
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#46",
                    "likes": "0",
                    "time": "22/02/2023-20:26:57",
                    "content": "Polls 2023-02-22 PECU Seeking Governance Clarification of Intent re: Phoenix Labs - Yes We approve the PECU resources necessary to audit the D3M to Spark Lend. The current transition has some very unique challenges and we support a more lenient approach to principles for this unique period. Thanks to Derek for seeking formal ratification. PECU Seeking Approval to Transfer Engineering Resource to Phoenix Labs  - Yes Hexonaut is the technical force behind Spark Lend. He is trail blazing this transition and we gladly approve the transfer of this outstanding builder. MIP13c3-SP14: Implement a Feature to Refund People who Lost Money Sending Dai to the Dai Contract Address  - No While it is certainly sad if people lose their funds by sending DAI to the DAI contract address we feel that now, more than ever, the engineering resources for this solution are not available. We would love to see this developed at some point in the future, but chose to vote No on this poll to make scheduling easier for PECU. MIP4c2-SP33: Amend MIP62 to Allow for Changing Communication Responsibilities - Yes Excellent housekeeping. We support the proposed solution, to address responsibilities after offboarding GovComms. MIP4c2-SP30: Amend Interim Facilitator Appointment Process  - Yes MakerDAO learned a lot when CES was looking for an interim facilitator and this MIP formalizes and institutionalizes these learnings. Full support. MIP95: $100M of Cogent Bank Loan Participations  - Abstain The Cogent Bank deal is exactly what MakerDAO should support. Salt-of-the-earth bank doing small business loans. Good volume, great underwriting, known Arranger. But the RWA scope is under development and due to be ratified as soon as next month, and at the same time Risk and Legal assessments are not yet budgeted for. We decided to vote Abstain. We’re happy if this moves forward, and want to encourage Max Glass and Cogent to retry when the RWA scopes have been defined, if it doesn’t. At the moment we cannot fully support this MIP. ",
                    "links": [
                        "https://forum.makerdao.com/t/pecu-seeking-approval-to-transfer-engineering-resource-to-phoenix-labs/19841",
                        "https://forum.makerdao.com/t/mip13c3-sp14-implement-a-feature-to-refund-people-who-lost-money-sending-dai-to-the-dai-contract-address/19605",
                        "https://forum.makerdao.com/t/mip4c2-sp33-amend-mip62-to-allow-for-changing-communication-responsibilities/19381",
                        "https://forum.makerdao.com/t/mip4c2-sp30-amend-interim-facilitator-appointment-process/18951",
                        "https://forum.makerdao.com/t/mip95-100m-of-cogent-bank-loan-participations/19338"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.212053571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#47",
                    "likes": "0",
                    "time": "11/03/2023-15:01:13",
                    "content": "Emergency Executive vote 2023-03-11 1500UTC: supported. We still believe turning the D3M off was unwarranted and that the GUSD drama is mostly FUD. But we support the current executive and want to thank the Risk and PE CUs for the swift turnaround here. Crazy times. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#48",
                    "likes": "0",
                    "time": "11/03/2023-15:04:18",
                    "content": "Maker Governance - Decrease the RETH-A Dust Parameter - Yes We supported decreasing the rETH Dust limit. Rocketpool ETH ftw, what more do we need to say. Decentralization for the win! Maker Governance - Short Ratification Poll for Phoenix Labs Initial Funding (MIP55c3-SP15) - Yes We’re pretty excited about Spark. So is all of DeFi. LFB! ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmYBegVf#poll-detail"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.848958333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#49",
                    "likes": "0",
                    "time": "16/03/2023-14:49:30",
                    "content": "Short Ratification Poll for Vault Setting Amendment Subproposal (MIP92c5-SP1) - March 13, 2023 (thread) Voted: No We’d like to see the Yearn vault move forward in bigger steps. But after the relevant scopes have started their tasks. Return Excess MIP65 Funds to Surplus Buffer - March 13, 2023 (thread) Voted: Yes Very good exercise to test the rails here. Fully supported. Increase the MIP65 (RWA007-A) Debt Ceiling - March 13, 2023 (thread) Voted: Yes All the heat aside: Monetalis is awesome. We’re happy to have the opportunity for MakerDAO to earn more. Remove the DC-IAM from MIP65 (RWA00 Voted: No While we support the increase of the DC, we want to keep the 100M IAM in place until the kinks in the reporting and accounting pipeline have been ironed out. We know this has a decent opportunity cost but voted No out of an abundance of caution. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip92c5-sp1-vault-setting-amendment-subproposal/19553",
                        "https://vote.makerdao.com/polling/QmfZ2nxw",
                        "https://forum.makerdao.com/t/request-to-poll-return-excess-mip65-funds-to-surplus-buffer/20115",
                        "https://vote.makerdao.com/polling/QmNTSr9j",
                        "https://forum.makerdao.com/t/request-to-poll-increase-debt-ceiling-for-mip65-by-750m-to-1-250m/20119",
                        "https://vote.makerdao.com/polling/QmRJSSGW"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.3604166666666675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#50",
                    "likes": "0",
                    "time": "17/03/2023-13:13:34",
                    "content": "Comms update: We supported the Emergency Executive of 2023-03-14 to use MOMs for PSM shutdowns. We need a breaker switch in cases like last weekend. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}