{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/understanding-circuit-breakers/1654",
            "title": "Understanding circuit breakers ",
            "index": 1654,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "covid-crash",
                "liquidation-freeze"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/the_ocs",
                    "index": "#1",
                    "likes": "0",
                    "time": "17/03/2020-17:51:09",
                    "content": "Been listening to the call today, and wanted to understand the circuit breakers being talk about. Difficult to sometimes get clarity from just a call so asking here for further clarity. Am I understanding it correctly that the circuit breakers talked about will be on the auctions for buying MKRs with DAIs? And these are likely needed because we have a lot of these auctions coming up as a lot of collateral was liquidated at more or less the same point in time? And it’s unlikely that all the keepers combined have enough DAI liquidity to manage to bid on all of these auctions in parallel? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.62962962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#2",
                    "likes": "0",
                    "time": "17/03/2020-18:30:29",
                    "content": "You need to understand that there are 3 types of auctions in the maker protocol. I would start with reading documentation, but in short: There was talk about debt auctions (flops), to recapitalize dai system starting on thurdsay and then also about collateral auctions (flips) that start when vaults are liquidated. Circuit breakers were mentioned in relation to large amount of (eth) flips, triggered if eth price drops significantly in short time, and large amount of dai liquidity is required by keepers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/the_ocs",
                    "index": "#3",
                    "likes": "0",
                    "time": "17/03/2020-18:34:00",
                    "content": "Right, thanks for clarifying that. So basically, we’re going to then see a large amount of flops on Thursday, all hitting in parallel, with a lot of uncertainty around keeper liquidity… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#4",
                    "likes": "0",
                    "time": "17/03/2020-18:42:54",
                    "content": "flops are not problematic since 5.3m dai is not that much (there is enough liquidity). Ofc, potentially, flips could happen at the same time… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/the_ocs",
                    "index": "#5",
                    "likes": "0",
                    "time": "17/03/2020-18:53:54",
                    "content": "Yeah, maybe, it’s all relative. More than 5% of current supply. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#6",
                    "likes": "2",
                    "time": "17/03/2020-19:17:48",
                    "content": "    jernejml:  flops are not problematic since 5.3m dai is not that much (there is enough liquidity). Ofc, potentially, flips could happen at the same time…   5.3M Dai is actually quite a significant amount. Roughly 50% of the Dai supply is currently locked in the DSR and likely not very liquid. There will be a few participants in the auction so more than one party will have to have 5.3M Dai accessible to them to bid. Let’s assume you have 4 keepers each having around 5M in liquidity, that now generates 20M in demand. In the current market it is unrealistic that users will be able to acquire that much. That’s why the Maker community acted to onboard USDC as collateral giving a very easy way to increase the Dai supply. I recommend reading the the discussion around the onboarding of USDC: Proposal for Collateral Onboarding of USDC for more background. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.608771929824561
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#7",
                    "likes": "0",
                    "time": "17/03/2020-20:00:40",
                    "content": "Yes, correct. I was already assuming USDC as source of liquidity when commenting on the number. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#8",
                    "likes": "0",
                    "time": "18/03/2020-02:25:40",
                    "content": "Good point @spin regarding the idea that multiple auction participants wanting to participate fully having to try to scrape up 5M in DAI individually.   This effectively adds to the DAI liquidity issues just at a time when we need liquidity. I think the question is whether these players are going to flip or keep the MKR purchased as then it isn’t just them obtaining DAI to purchase MKR but also markets that will have MKR dumped on them that may need DAI as well further adding to the liquidity crisis to some extent even if temporary.  Though this likely will spread out into other MKR pairs as an arb event. It will be interesting to see what happens to the PEG after the MKR auction as well as MKR price on exchanges.   Fortunately I am not one of these auction players but as a trader one really would have to look at shorting MKR here as a front run on this auction. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#9",
                    "likes": "1",
                    "time": "18/03/2020-09:07:29",
                    "content": "MKR markets are not liquid enough to quickly offload 5M DAI worth of MKR. If you tried to sell 500 MKR (~1M Dai worth) on Uniswap today (which historically had a pretty good liquidity) you’d see around 8% of price slippage. Keepers will have to hold on to these over some period of time to avoid this these effects. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.345238095238095
                }
            ]
        }
    ]
}