{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/collateral-onboarding-grants/4252",
            "title": "Collateral Onboarding Grants ",
            "index": 4252,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "collateral-onboard"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/amyjung",
                    "index": "#1",
                    "likes": "22",
                    "time": "18/09/2020-19:14:37",
                    "content": "Last week’s conversation in the Governance and Risk meeting provided an exciting moment for the MakerDAO community: rally around the shared goal of successfully onboarding more reliable and diverse collateral. Grants Can the community coordinate to achieve 250 - 500 Million DAI supply from new collateral types by November 30, 2020? Our grants program was designed to reward teams achieving a successful release of project milestones. The Collateral Onboarding Grant will fund community members interested in working on this initiative, as well as provide a special incentive (and largest grant to date) for rewarding collective collaboration: On top of receiving a grant for outlined work, an additional grant incentive of 75,000 DAI (split amongst participating grantees and domain teams working on collateral onboarding) will be released at a 250 Million DAI milestone, with a second additional fund release of 100,000 DAI at the 500 Million DAI milestone. Below outlines a collaborative structure for individuals and domain teams to work together. Opportunities to Work Together Community members can participate in any domain or area appropriate to their skillsets (Smart Contracts, Risk, Oracles, Legal, Project Management, Partnerships, Communications). Domain Facilitators will outline and assign work to be done. A few examples:  Collateral onboarding assessments for domains (Risk, Smart Contracts, Oracles, Legal) Development work for Smart Contracts and Oracles Providing domain team MIP and communications support Collateral prioritization framework development Collateral partner communication and management  Grantees would have three approaches to engage:   Domain Contributors: Individuals who want to contribute generally to a domain. (Hourly rate of 60 Dai)  Independent Project Consultant: A self-directed freelancer/individual who wants to bring a specialized skill set as a service tuned for MakerDAO. (Scoped proposal)  Independent Project Teams: A self-directed team with a specific set of expertise who wants to provide support tuned for MakerDAO. (Scoped proposal)  Other Details:  At the end of the grant, grantees are expected to produce an overview or template of learned processes for each domain to further promote community domain knowledge sharing. Domain Facilitators will be responsible for confirming successful work completion.  Commitment:  Weekly updates / sync to discuss work progress and assignments. Engaging cross-functionally with the Domain Teams on a bi-weekly call basis.  Applying If you feel you, or your team are interested and capable of tackling initiative, please reach out with a relevant work/portfolio/Github to @amy.jung on the MakerDAO Rocketchat. ",
                    "links": [
                        "http://chat.makerdao.com/",
                        "https://forum.makerdao.com/t/improvements-to-the-collateral-onboarding-framework/4250",
                        "https://forum.makerdao.com/t/rwa-last-2-months-review-updates-and-looking-forward/5225",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-113-thursday-october-8-16-00-utc/4505/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-111-thursday-september-24-16-00-utc/4239/3",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-111-thursday-september-24-16-00-utc/4239/2",
                        "https://forum.makerdao.com/t/mejoras-al-framework-de-incorporacion-de-colaterales/4425",
                        "https://forum.makerdao.com/t/solicitud-de-opinion-deberiamos-adoptar-un-enfoque-mas-flexible-y-transparente-sobre-la-incorporacion-de-colateral/4409",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-111-thursday-september-24-16-00-utc/4239/5",
                        "https://forum.makerdao.com/t/signal-request-should-we-take-a-more-flexible-and-transparent-approach-to-onboarding-collateral/4380",
                        "https://forum.makerdao.com/t/week-16-dai-distributions-sourcecred-trial/4371",
                        "https://forum.makerdao.com/t/maker-relay-ep-13-en-espanol/4313",
                        "https://forum.makerdao.com/t/maker-relay-ep-13/4310",
                        "https://forum.makerdao.com/t/discussion-makerdao-contributors-compensation-brainstorm/5625/8",
                        "https://forum.makerdao.com/t/rwa-resena-de-los-ultimos-dos-meses-actualizaciones-y-lo-que-viene/5272",
                        "https://forum.makerdao.com/t/introducing-the-collateral-onboarding-handbook/5134"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.183539944903583
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Labeo",
                    "index": "#2",
                    "likes": "5",
                    "time": "18/09/2020-20:17:52",
                    "content": "If you need legal help (Germany) I may be able to serve  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "22/09/2020-17:37:47",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}