{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/proposed-risk-parameters-for-wbtc-c-vault-type/11707",
            "title": "Proposed Risk Parameters for WBTC-C Vault Type ",
            "index": 11707,
            "category": [
                "Collateral Onboarding",
                "Domain Work"
            ],
            "tags": [
                "wbtc",
                "risk-domain-work",
                "wbtc-c"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#1",
                    "likes": "13",
                    "time": "18/11/2021-12:34:00",
                    "content": "Our exposure towards WBTC has increased rapidly since the start of October, which was summarized in the recent WBTC Signal Request to onboard a new vault type with higher liquidation ratio, similar to the current ETH-C vault type. With the recent increase of WBTC-A debt exposure and addition of WBTC-B vault, the exposure is likely to increase even more. The risk assessment of WBTC collateral was recently described here. While we believe scaling WBTC exposure even further is positive and wanted, we think it is safer to further scale with a more risk averse venue. In addition, this also offers higher product coverage for different users relative to their risk tolerance. Following are the risk parameters for the WBTC-C (higher liquidation ration) vault type proposed by risk. Stability Fee: 1.5% Liquidation Ratio: 175% Debt Ceiling: 1b DC-IAM gap: 100m DC-IAM ttl: 8h Cut: 0.99 Step: 90 seconds Buf: 1.2 Cusp: 0.4 Tail: 90 minutes Chip: 0.1% Tip: 300 DAI Ilk.chop: 13% Tolerance: 0.5 Ilk.hole: 25m DAI Dust: 7.500 DAI Assuming there are no objections, we would like to proceed with these parameters on the on-chain poll next week, November 22th. ",
                    "links": [
                        "https://forum.makerdao.com/t/wbtc-b-collateral-onboarding-risk-assessment/11397",
                        "https://forum.makerdao.com/t/maker-relay-ep-72-en-espanol/11799",
                        "https://forum.makerdao.com/t/maker-relay-ep-72/11773",
                        "https://forum.makerdao.com/t/signal-request-new-vault-type-for-wbtc-with-a-higher-lr/11579/6",
                        "https://forum.makerdao.com/t/under-construction/12274/12",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-november-2021/11914",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-18-25/11827"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.55340909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "5",
                    "time": "18/11/2021-13:10:20",
                    "content": "really happy to see that this has been picked up so quickly without even having the forum poll complected. thanks @Risk-Core-Unit ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.305555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#3",
                    "likes": "1",
                    "time": "18/11/2021-18:48:43",
                    "content": "Why 1.5% instead of 2.5%? You can assume I am clueless; my question is only based on the present 2.5% rates for ETH-A and WBTC, and nothing more. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#4",
                    "likes": "1",
                    "time": "18/11/2021-19:03:53",
                    "content": "This vault is similar to the ETH-C vault which has a 0.5% SF. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#5",
                    "likes": "0",
                    "time": "18/11/2021-21:10:23",
                    "content": "We wanted to keep a similar spread between A and C vault type to that of ETH which is currently 2%. WBTC-A is going to 4% with this weeks executive, but we still felt 1.5% is enough since the vault will be new and can be changed later when debt increases. ",
                    "links": [
                        "https://forum.makerdao.com/t/under-construction/12274/12",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-november-2021/11914"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.136363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#6",
                    "likes": "0",
                    "time": "20/11/2021-10:42:17",
                    "content": "I know I have been advocating multiple tiers of vaults on significant collateral types for some time now.  One example for stablecoins…     [Signal Poll] Use multiple stablecoin (e.g. USDC) vaults with different LR/DC combinations to manage value/price/risk exposure Governance       Currently Maker governance is considering changing the USDC-A parameters.  Currently recently changed USDC-A parameters:  Collateralization Ratio: 103 (lowered just a day ago from 110) soon to 101  Debt Ceiling: 200M (raised from 100M just a day ago from 100M)  Risk Premium: 2%  The goal of this signal request is to modify how Maker is extending Debt Ceilings against Liquidation Ratios on not just USDC but all of the stablecoins.  I use USDC here just to give a flavor of what this proposal is su…     Having multiple vault tiers allows:  Further staggering of CRs and LRs spreading the liquidation risk potentially on price. Rate/risk optimization by users Gives system risk control via DC (which we pretty much are not using to control risk exposure to favor growth generally) Creates an effective system wide average floating rate determined by the collective actions of users.  I expect in the future more of these vaults to come on-line to fill in gaps between the existing vaults (allowing for finer granularity) and possibly to extend the LR spread. It would be interesting to develop some analytics to compare overall effective rate from the vault data to compare to markets to see whether we are getting rate normalization with rest of crypto.via an average rate scoring. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.607954545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "18/02/2022-10:42:20",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}