{
    "poll_list": [
        {
            "title": "Budget Ratification Poll for Modify the Sustainable Ecosystem Scaling Core Unit DAI Budget, SES-001 (MIP40c3-SP87) - November 14, 2022",
            "index": "18339",
            "option": "Approve speedy operations platform option budget",
            "supporting_mkr": "48,866",
            "highest_fraction": -1
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp87-modify-the-sustainable-ecosystem-scaling-core-unit-budget-ses-001/18339",
            "title": "MIP40c3-SP87: Modify the Sustainable Ecosystem Scaling Core Unit Budget - SES-001 ",
            "index": 18339,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "core-unit-budget",
                "ses-001",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#1",
                    "likes": "2",
                    "time": "12/10/2022-23:20:44",
                    "content": " MIP40c3-SP87: Modify the Sustainable Ecosystem Scaling Core Unit Budget - SES-001  Preamble MIP40c3-SP#: 87 Author(s): @juanjuan, @wouter, @retro Contributors: Tags: core-unit, cu-ses-001, budget, dai-budget Status: Accepted Date Proposed: 2022-10-11 Date Ratified: 2022-11-28 Forum URL: https://forum.makerdao.com/t/mip40c3-sp87-modify-the-sustainable-ecosystem-scaling-core-unit-budget-ses-001/18339 Ratification Poll URL: https://vote.makerdao.com/polling/QmegsRNC Extra: Winning option was option 2, Approve Speedy Operations Platform Option.   Sentence Summary MIP40c3-SP87 modifies the DAI budget for the SES-001 Core Unit, continuing and extending operations through 31-Jan-2024.  Paragraph Summary The current budget for SES-001 is expiring 31-Jan-2023. This MIP creates a new budget stream for the Core Unit to continue operations through 31-Jan-2024. Changes & modifications from the current MIP40c3-SP55 budget MIP: 1/ SES-001 budget stream reduced by 45.26% (Speedy Operations Platform) or 53.47% (Standard Operations).  2024 Budget Breakdown. Removed Budget for the Grants Program. Transition Budget for the Incubation Program. Updated Transaction. Updated Smart Contract Implementation.  2/ Addition of new sections to meet MIP4c2-SP19 amendment:  Budget Category Breakdown. Roadmap and Objective. Summarising Value to MKR Holders. Contingency Planning - Scenarios. Return Excess Funds. Unwinding and Defunding. Proposal Parameters.   Specification  Motivation The Sustainable Ecosystem Scaling Core Unit will support MakerDAO through the critical transition from its current operational structure to the Endgame Plan structure with MetaDAOs. To this end, sufficient funds need to be provisioned to guarantee the success of the Maker ecosystem in the long run.  Core Unit ID SES-001  Budget Implementation  Modifications from the Original MIP40: MIP40c3-SP55  Updated budget transparency graphic & link. Minor grammatical and formatting updates.   The budget is split into two separate categories: Permanent Team and Incubation Program.  1478×808 78 KB  SES Auditor Framework Details  Multi-sig Wallets The following multi-sigs are involved:   The Auditor Wallet – A nested, 2-out-of-2 Auditor multi-sig, composed of 1-out-of-2 role based multi-sigs as signers. The Auditor Wallet will have 2 roles defined for its signers: Auditors and Accountants. The Accountant Role Multi-sig will have 2 signers, both SES permanent team contributors. The Auditor Role Multi-sig will also have 2 signers, both GovAlpha team members. Both roles will conduct the monthly auditing process as described in the Monthly Top-up Cycle, increasing transparency of the auditing process for the community. The Maker Protocol (MCD_PAUSE_PROXY, 0xBE8E3e3618f7474F8cB1d074A26afFef007E98FB) will be listed as a beneficiary on the Auditor Wallet. This allows the protocol to withdraw up to 1B DAI from the Auditor Multi-sig wallet, ensuring control over these funds and acting as a back-up. This multi-sig will hold funds up to the Quarterly Budget Cap in DAI and receive the DssVest stream. All funds pass through this wallet before any are sent to the Operational Wallets.   The Operational Wallets – One wallet for each budget category. These are 2-out-of-3 multi-sigs controlled by SES. Signers include the facilitator, the team lead, and one other SES member from the permanent team, responsible for the associated budget category.  The Permanent Team Wallet  The Incubation Program Wallet      Monthly Budget Statement Within the first 15 days of each month, SES will submit a Monthly Budget Statement to the signers of the Auditors Wallet with the following sections:   Previous Month’s Actuals, i.e., the actual expenses (DAI and MKR) of the month that just ended.  Budget Forecast, based on the latest available information, of the budget (in DAI) required to maintain a 3-month runway for the team.  MKR Vesting Overview – this schedule has the expected MKR vesting amounts for the current team configuration, grouped by the pay-out month.  Transaction Amounts  The required DAI amount sent from the Auditor Wallet to the Operational Wallets to replenish the 3-month runway as indicated in the Budget Forecast section. Any excess DAI amount above the 3-month forecast in the Operational Wallets that will be returned to the Auditor Wallet.    The Monthly Expense Reports can be found on the SES Expense Reports page of the expenses dashboard.  Monthly Top-up Cycle   Monthly Budget Statement Submission – Within the first 5 days of the month, SES submits the Monthly Budget Statement to the Auditor Wallet signers. This report is also available for the rest of the community to review.  Transaction Requests Submission – In parallel, SES submits the necessary transaction requests for the Auditor Wallet signers to sign:  DAI Top-up Transaction – One DAI transaction for the Operational Wallets that adds enough funds to the Operational Wallets to replenish the forecast 3-month runway. Only applies if the Operational Wallets balance is below this forecast.    Returning Excess Funds – SES creates and signs any transactions for excess funds that should be returned to the Auditor Wallet:  Excess DAI Transactions – DAI transactions for Operational Wallets that have a balance above the 3-Month Budget Forecast will be returned to the Auditor Wallet.    DssVest Pull - The Auditor Wallet signers will pull available funds from the SES DssVest contract, replenishing the available funds in the Auditor Wallet.  Auditors’ Review – The Auditor Wallet signers review the Monthly Budget Statement. First, Accountant Role signers will review the initial report submitted by SES to ensure data accuracy and report completeness. A consistent audit checklist will be followed. The Auditor Role will then receive the Accountant’s report generated from the checklist, and verify the Accountant’s findings.  A summary of each audit cycle’s report will be made available to the Maker Community at the conclusion of the audit cycle on the SES’s transparency reporting repository on Github.   Transaction Approvals – Upon acceptance of the Monthly Budget Statement audit, an Accountant Role signer, and an Auditor Role signer will sign the requested transactions, sending the DAI top-up amounts to the Operational Wallets.   Auditor Wallet Returns – The Auditor Wallet signers will return any amount of DAI above 2x the Monthly Budget Cap. The Auditor Wallet, using the DssBlow contract described here, will return the excess DAI directly to the surplus buffer. As such, the Auditor Wallet will then hold up to 2x the Monthly Budget Cap at the start of the month, allowing DssVest to stream DAI up to the Quarterly Budget Cap over the course of the month.     Multi-sig Wallet Configurations  SES-001 Auditor Wallet (2:2)   Controlled by the SES Auditors Address: 0x87AcDD9208f73bFc9207e1f6F0fDE906bcA95cc6  Signers  SES Accounting Role Wallet (1:2, 0xA2A855Ac8D2a92e8A5a437690875261535c8320C) GovAlpha Auditor Role Wallet (1:2, 0xDc85cE806d057f4E5425b1e211b78d5af2728Df3)   Beneficiary Role  Maker Protocol (MCD_PAUSE_PROXY, 0xBE8E3e3618f7474F8cB1d074A26afFef007E98FB), with an allowance of 1B DAI withdrawal.     SES-001 Operational Wallets   SES Permanent Team Wallet (2:3)  Address: 0xb5eB779cE300024EDB3dF9b6C007E312584f6F4f  Signers:  0x4714C7EfE5D0213615FC6CBB8717B524eC433e9a 0xFCa6e196c2ad557E64D9397e283C2AFe57344b75 0xA2A855Ac8D2a92e8A5a437690875261535c8320C     Incubation Program Wallet (2:3)  Address: 0x7c09Ff9b59BAAebfd721cbDA3676826aA6d7BaE8  Signers:  0x4714C7EfE5D0213615FC6CBB8717B524eC433e9a 0xFCa6e196c2ad557E64D9397e283C2AFe57344b75 0xA2A855Ac8D2a92e8A5a437690875261535c8320C       Budget Breakdown This budget proposal represents a restructuring of SES-001 to respond to the evolving demands of MakerDAO related to the Core Unit’s approved mandate.  Budget Details Standard Option     Group Monthly Total 3 Months Reduction     Permanent Team 166,600 499,800 -5.90 %   Incubation 60,000 180,000 -76.00 %   Grants 0 0 -100.00%   Grand Total 226,600 679,800 -53.47%    Speedy Operations Platform Option     Group Monthly Total 3 Months Reduction     Permanent Team 206,600 619,800 +16.70%   Incubation 60,000 180,000 -76.00%   Grants 0 0 -100.00%   Grand Total 266,600 799,800 -45.26%    Permanent Team Breakdown     Expense Standard Speedy Operations Platform     Admin Expense Total 1,000    Compensation & Benefits Total 120,000    Gas Expense Total 1,000    Professional Services Total 10,000    Software Development Expense Total 25,000 +40,000   Software Expense Total 1,600    Travel & Entertainment Total 8,000    Total 166,600 206,600    Incubation Program Breakdown     Expense Standard Speedy Operations Platform     Compensation & Benefits Total 52,000    Gas Expense Total 500    Professional Services Total 2,000    Software Expense Total 500    Travel & Entertainment Total 5,000    Total 60,000 60,000    Note that the Incubation Program is winding down and will be replaced by a self-learning and onboarding experience (see further.) Category Descriptions   Compensation: Contributors are paid for their work in DAI, USD or EUR once a month. This encompasses full time and part time Permanent Team contributors.  Software Development: Expenses for software developers and QA engineers developing the MakerDAO operational dashboard and related components.  Software Expense: Expenses related to business & productitivty software for the core unit, as well as hosting-related costs.  Travel Costs: This applies to transportation, lodging, meals, professional venues such as conference rooms, team activities, and conference passes.  Gas Fees: Covers monthly payments to the payment process & direct payments for contributors.  Professional Services: Cost for the Core Unit’s payment processor, AccountAble.  Admin Expenses: Exchange fees and other transaction fees related to payments.  FTE - Forecast     Team members Current FTEs Forecast FTEs     Facilitator 1 1   Team Lead 1 1   Contributors 7.5 8.5   Incubees (Maker Academy + Legal) 6 6   Total 15.5 16.5    Budget Term Budget commences on 01-Feb-2023 and ends on 31-Jan-2024.  Increasing Value to Maker Token holders SES will support MakerDAO, through operational support and software development, to organize the critical transition from its current operational structure to the Endgame Plan structure with MetaDAOs. Once the new structure is established, it plans to further develop and maintain MakerDAO’s Decentralized Operations platform, again including both operational support and software development.  Auditor Framework & Operations. Legal Research. Community Calls. Project-based Budgeting. Support transition to MetaDAOs.  Development of the Decentralized Operations platform. Offering operational support.   Replace the SES Incubation Program with a self-learning and onboarding platform.   Roadmap and Objectives We’ve fulfilled the vast majority of initial roadmap items and discovered new ones along the way.  We are still collecting and prioritizing longer term roadmap items also based on the overall direction of the DAO. Here’s a glimpse of what is on the roadmap right now.  Decentralized Operations Platform Already released in its more limited variant, the Expenses Dashboard, we plan to further evolve this platform until it covers the full range of Decentralized Operations, including decentralized workforce, capital, and work. This is in line with the Endgame Plan’s Unified DAO Operational Toolkit. Future milestone ideas:  Porting and extending the existing functionality to their MetaDAO equivalents: Core Units become Administration + Contributor Teams, etc. Roadmaps with long-term vision and KPIs, as well as short-term, concrete project deliverables. Ability to perform reviews and quality control on these deliverables.  Project-Based Budgeting for teams: extend the current budget reporting with project estimates, actual spends, and timelines. Project-Based Budgeting for governors: prioritize the list of projects and determine which ones make the budget limit cut. Decentralized successor to the SES Incubation and Grants programs, enabled by self-learning, onboarding, and skill development through Maker Academy. People management, evaluation, and comp-related features based on Maker Academy skill trees. Pseudonymous user profiles with reputation-based blockchain identity: separating signal from noise in the community by filtering based on token ownership and expertise. Maker Core administrative mechanics such as DVCs, scope maps, committees/tribunals, etc. Where it saves money, replacing manual governance processes with automated equivalents, for example the Dai Foundation’s intangible asset register, or legal operations functionality.  Note that we’re following an agile development process, which means that all roadmap items and their priorities are subject to change based on evolving insights and rapidly changing circumstances. The provided list gives an idea of which modules to expect and does not entail a commitment to deliver these particular items within the one-year timeline.  Project-Based Budgeting Bootstrap Implement a transition in 3 phases, in the first place for SES itself, towards a Project-Based Budgeting (PBB) model. The initial plan looks like this:   Preparation phase, already covered by the active MIP40, would involve the creation of a software module and the necessary documentation to define KPIs, and estimate and propose projects. The process can be tested initially by SES before it is made available for other contributor teams.  Simulated PBB phase for 3 months, which runs the project-based budgeting process but with a fixed budget cap to allow for initial optimizations needed to make the model work well. MakerDAO voters would determine prioritization of the projects and provide feedback.  Active PBB phase from May 2023 onwards, when the Project Budget Cap will be set by MakerDAO voters on an on-going basis. A Retention Budget Cap will be maintained to cover preliminary research, analysis, and preparation of the project proposals.   2323×889 29.3 KB   We believe that Project-Based Budgeting will critically improve the ability of MakerDAO to effectively prioritize and execute on its roadmap. Project-Based Budgeting is the best way to reduce overall MakerDAO budget during times of falling revenues. It allows MakerDAO to pay only for the highest-impact work, and is a flexible way for contributor teams to scale up and down. Project-Based Budgeting is a much needed preparation to pave the way for the implementation of the Endgame plan. It will allow MetaDAOs to operate transparently and efficiently, and propose valuable work for the Maker Core scopes; with or without RFP process.  Once the 3rd phase goes into effect, it’s likely that a new budget MIP will be submitted to replace the current proposal in order to reflect the new structure. Note that we’re following an agile development process, which means that all roadmap items and their priorities are subject to change based on evolving insights and changing circumstances.  Operational Support for the DAO  Operational support for change management between MakerDAO today and its future Endgame form(s). Continued community calls support. Continued advisory to Core Units, and later the MetaDAO Administration and Contributor Teams. Continued auditing services for Core Unit finances.   Legal Research  Continued development of the Self-Insurance Fund. Legal risk analysis for MetaDAOs and Maker Core. Maintaining external expert relationships for specialized advise Monitoring of regulatory developments wrt. DeFi and DAOs   Incubation Program transition The SES Incubation Program is in the process of winding down and will be replaced by a self-learning and onboarding experience to reduce costs, while continuing to leverage the openness of the DAO. This will be intergrated with the rest of the Decentralized Operations Platform. The current incubees will be moved to a Project-Based funding model. This transition:  Will give the MakerDAO community more direct control over their roadmap and budgets. Create more flexibility for cross-team resource allocation, allowing more resources to be allocated to the highest priority projects.   Contingency Planning In a super bear scenario, the SES Core Unit could temporarily or permanently abandon broader objectives such as:  The rapid development of the Operations Platform. Maker Academy. Offsites + Conferences. Research.  The Core Unit could then use its remaining resources to focus on the most pressing needs of the DAO. It could operate in this state for a considerable amount of time. Retention and team morale may become an issue.  Unwinding and Defunding Within one month of the ratification of the offboarding proposal, the Facilitator will submit a proposal to the community documenting the plan for wind-down of SES-001. This plan will include line items of the necessary tasks to complete unwinding, a projected timeline, as well as a cost estimate for completion of the wind-down proposal. After the completion of the shutdown, any remaining budget will be returned to the DAO with the following exceptions:  Any outstanding payments that are owed to external parties and contributors but have not yet been paid. If SES-001 and/or its contributors are involved in active litigation and need to retain a subset of the budget to resolve legal disputes.  SES-001 contributor MKR vesting will be accelerated to the nearest 6-month vest on completion of the wind-down. This means a contributor vesting 10 MKR annually would vest 5 MKR at completion of the wind-down. The above clause overrides the 12-month cliff.  Return of Excess Funds As defined in the Budget Implementation section above, excess funds above the 3 month forecast will be returned on a monthly basis, meeting the requirements of MIP4c2-SP14.  Proposal Parameters This MIP40c3 subproposal provides the following options, fully described above, for ranked-choice voting:  A: Abstain B: Approve Speedy Dashboard budget C: Approve Standard Operations budget D: Reject budget   Transactions SES’s Auditor & Operational Wallets will hold more than the designed minimum funds in both the Auditor Wallet (2 months) and the Operational Wallet (3 months) to start the budget period. Any amount over the designed minimums will be returned to the DAO via DssBlow. Funds in the Grants Wallet will also be returned to the DAO since the budget and operations of SES Grants will stop.  Smart Contract Implementation This budget implementation uses the DssVest. One of the two following budget streams is approved based on the rank-choice voting outcome of this MIP’s ratification polling.   Speedy Operations Platform Budget Stream A total of 3,199,200.00 DAI will be streamed to 0x87AcDD9208f73bFc9207e1f6F0fDE906bcA95cc6 starting 2023-2-01 and ending 2024-1-31.   Standard Operations Budget Stream A total of 2,719,200.00 DAI will be streamed to 0x87AcDD9208f73bFc9207e1f6F0fDE906bcA95cc6 starting 2023-2-01 and ending 2024-1-31.    Related Documents   MIP39c2-SP10: Adding the Sustainable Ecosystem Scaling Core Unit: MIP40c2-SP17: Sustainable Ecosystem Scaling Core Unit MKR Budget  MIP41c2-SP10: Facilitator On-boarding for the Sustainable Ecosystem Scaling Core Unit  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip4c2-sp19-mip40-budget-process-amendment/14250",
                        "https://forum.makerdao.com/t/mip40c3-sp55-modify-core-unit-budget-sustainable-ecosystem-scaling-ses-001/12097",
                        "https://expenses.makerdao.network/core-unit/SES/finances/reports",
                        "https://github.com/makerdao-ses/transparency-reporting/tree/main/Monthly%20Budget%20Statements",
                        "https://github.com/Lollike/dss-blow",
                        "https://expenses.makerdao.network",
                        "https://forum.makerdao.com/t/expenses-dashboard-monthly-update-september-2022/18210",
                        "https://forum.makerdao.com/t/makerdao-expenses-dashboard-is-live/17591",
                        "https://forum.makerdao.com/t/project-based-budgeting/17121",
                        "https://forum.makerdao.com/t/mip40c3-sp31-modify-core-unit-budget-sustainable-ecosystem-scaling-ses-001/9805",
                        "https://forum.makerdao.com/t/mip4c2-sp19-mip40-budget-process-amendment/14250",
                        "https://forum.makerdao.com/t/mip39c2-sp10-adding-sustainable-ecosystem-scaling-core-unit/7368",
                        "https://forum.makerdao.com/t/mip40c3-sp17-sustainable-ecosystem-scaling-core-unit-mkr-budget-ses-001/8043",
                        "https://forum.makerdao.com/t/mip41c4-sp10-facilitator-onboarding-sustainable-ecosystem-scaling-core-unit/7370",
                        "https://forum.makerdao.com/t/pvl-delegate-platform/16022/42",
                        "https://forum.makerdao.com/t/weekly-mips-update-109/18404",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/9",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/31",
                        "https://forum.makerdao.com/t/calblockchain-delegate-platform/18407/6",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/24",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191/33",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/31",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/29",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/111",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/137",
                        "https://forum.makerdao.com/t/weekly-mips-update-112/18708",
                        "https://forum.makerdao.com/t/intangible-assets-as-public-goods-questions-for-sustainable-ecosystem-scaling-core-unit-ses-001/18627",
                        "https://forum.makerdao.com/t/weekly-mips-update-111/18610",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/42",
                        "https://forum.makerdao.com/t/weekly-mips-update-110/18493"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.464747727905622
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sebix",
                    "index": "#2",
                    "likes": "0",
                    "time": "12/10/2022-23:58:21",
                    "content": "This post summarizes the main points of this subproposal from GovAlpha’s perspective:  This MIP40c3 subproposal modifies the Sustainable Ecosystem Scaling Core Unit (SES-001)'s budget. The proposed budget will run from 01-31-2023 until 01-31-2023. This is a valid MIP40c3 subproposal and it is eligible to enter the November Governance Cycle as per MIP51. The following two options will be submitted on-chain in an Instant Run-off Vote along with the Reject Budget and Abstain options:  Speedy Operations option: 3,199,200.00 DAI will be streamed over 12 months. Standard Operations option: 2,719,200.00 DAI will be streamed over 12 months.   This proposal has been assigned High-Impact based on the methodology listed here.  Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. Updated 2022-11-08 ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP51#governance-cycle-overview",
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.305555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#3",
                    "likes": "3",
                    "time": "17/10/2022-11:05:36",
                    "content": "@Retro @juan can we get some proposed budget amounts added to this ASAP please? I know you’ve both been in Bogota but if people cannot give feedback on the proposed budget amounts then it defeats the purpose of the RFC period. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#4",
                    "likes": "3",
                    "time": "20/10/2022-16:32:27",
                    "content": "@Patrick_J, I’ve just pushed our proposed budget amounts and a few new additions to the MIP. cc: @juan @wouter ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.840909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#5",
                    "likes": "0",
                    "time": "26/10/2022-05:30:40",
                    "content": "    Retro:   and extending the existing functionality to their MetaDAO equivalents: Core Units become Administration + Contributor Teams, etc. Roadmaps with long-term vision and KPIs, as well as short-term, concrete project deliverables. Ability to perform reviews and quality control on these deliverables.  Project-Based Budgeting  for teams: extend the current budget reporting with project estimates, actual spends, and timelines. Project-Based Budgeting for governors: prioritize the list of projects and determine which ones make the budget limit cut. Decentralized successor to the SES Incubation and Grants programs, enabled by self-learning, onboarding, and skill development through Maker Academy. People management, evaluation, and comp-related features based on Maker Academy skill trees. Pseudonymous user profiles with reputation-based blockchain identity: separating signal from noise in the community by filtering based on token ownership and expertise. Maker Core administrative mechanics such as DVCs, scope maps, committees/tribunals, etc. Where it saves money, replacing manual governance processes with automated equivalents, for example the Dai Foundation’s intangible asset register, or leg    Questions:  if CUs are being phase out, why are you still a going concern? and allowed to “govern” metadaos? I assume the addition 60k for speedy is additional expenses to hasten whatever projects as an incentive? please indicate a target/milestone to initiate wind down process. if not its never gonna happen. can you provide the scope of service or deliverables from the incubation and the permanent teams? redundancy on legal research? there is risk for that no?  ",
                    "links": [
                        "https://forum.makerdao.com/t/makerdao-expenses-dashboard-is-live/17591",
                        "https://forum.makerdao.com/t/project-based-budgeting/17121"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.162037037037037
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#6",
                    "likes": "0",
                    "time": "26/10/2022-05:53:37",
                    "content": "Thanks for taking the time in reading the MIP40 and your questions, @fumoffuXx.     fumoffuXx:   if CUs are being phase out, why are you still a going concern? and allowed to “govern” metadaos?    Not sure I get this one. Can I get some paraphrasing or clarification please?     fumoffuXx:   I assume the addition 60k for speedy is additional expenses to hasten whatever projects as an incentive?    It’s not incentives. The rationale is to get more development power behind that project.     fumoffuXx:   please indicate a target/milestone to initiate wind down process. if not its never gonna happen.    There is a requirement to indicate how a Core Unit would proceed to wind down if and when Governance requests it. This was created mainly for Governance to understand which services they would be losing in the case of a wind-down.     fumoffuXx:   can you provide the scope of service or deliverables from the incubation and the permanent teams?    Our mandate can be found in the corresponding MIP39. This is similar for pretty much every mandated Core Unit within Maker.     fumoffuXx:   redundancy on legal research? there is risk for that no?    Are you asking if there’s a risk in doing research? Or if the Legal Research is aimed at mitigating the risk? Not sure where you’re trying to get at. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.194444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#7",
                    "likes": "0",
                    "time": "26/10/2022-06:08:48",
                    "content": "  SUS-001 is a Core unit, there is a transition to METADAOS am i right? there will be a point of time when all CUs will be deprecated and transitioning to METAdaos? how will SUS-001 still be in existence to  “govern” the metadaos?   Gotcha more outsourcing work as headcount will remain the same or more Overtime?   Yes i am asking at what milestone will the wind down process begin and change into a METADAO? need a concrete KPI.   Thanks you.   CORE UNIT for risk assessment is doing legal and regulation impact assessment and risk assessment. there is redundacy and lack or expertise is done by your CU? can you leverage from them?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0500992063492065
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#8",
                    "likes": "0",
                    "time": "26/10/2022-06:22:54",
                    "content": "    fumoffuXx:   SUS-001 is a Core unit, there is a transition to METADAOS am i right? there will be a point of time when all CUs will be deprecated and transitioning to METAdaos? how will SUS-001 still be in existence to “govern” the metadaos?     Yes, there will be a transition. After Core Units are deprecated, SES will not exist in its current form. (We are exploring different paths).      fumoffuXx:   Gotcha more outsourcing work as headcount will remain the same or more Overtime?    The Permanent Team size will not be affected by the outcome of the vote.     fumoffuXx:   Yes i am asking at what milestone will the wind down process begin and change into a METADAO? need a concrete KPI.    The wind-down process will begin at the latest when the Core Units are phased out. I do not have a more specific answer for you right now.     fumoffuXx:   CORE UNIT for risk assessment is doing legal and regulation impact assessment and risk assessment. there is redundacy and lack or expertise is done by your CU? can you leverage from them?    Tagging @Primoz and @SESLegalResearch to comment on any possible redundancy or overlap. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.987811791383219
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SESLegalResearch",
                    "index": "#9",
                    "likes": "1",
                    "time": "26/10/2022-10:44:21",
                    "content": "SES legal research is developing tools and  processes for mitigating, monitoring and managing legal / regulatory risks of the protocol and DAO participants. The scope of the Risk Core Unit is different as it is specifically focused on collateral risk management, you can learn more about their mandate here:  https://mips.makerdao.com/mips/details/MIP39c2SP2#sentence-summary ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#10",
                    "likes": "0",
                    "time": "01/11/2022-14:44:05",
                    "content": "The Dai Foundation Core Unit has a set of questions on the status of the intangible assets being produced with a MakerDAO funded budget. The questions are posted as a separate main document so they are easier to reference later. You can see the questions here    Intangible Assets as Public goods - Questions for Sustainable Ecosystem Scaling Core Unit (SES-001) Dai Foundation       This document is dedicated to hold information from the Sustainable Ecosystem Scaling Core Unit on whether the assets it produces by funding from MakerDAO will be made public goods for the DAO.  It is posted as a main document to ensure it is easier to reference later than if the questions and answers were posted in a response thread for example concerning budget somewhere else.  The latest budget request from the Core Unit can be seen here   @juanjuan -feel free to edit this post or provide you…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.770833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#11",
                    "likes": "2",
                    "time": "08/11/2022-14:59:45",
                    "content": "@MIP-Editors SES is formally submitting this budget for the November Cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#12",
                    "likes": "0",
                    "time": "15/11/2022-20:51:47",
                    "content": "This proposal is currently being voted on. Its Ratification Poll will run from 2022-11-14 to 2022-11-28. Please vote here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "1839"
}