{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/meet-your-delegate-15-governancehouse/15722",
            "title": "Meet Your Delegate #15 - GovernanceHouse ",
            "index": 15722,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "delegation",
                "public-call",
                "pubcall-:-meet-your-delegate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "2",
                    "time": "10/06/2022-11:30:06",
                    "content": " Meet Your Delegate #15  Welcome to the (announcement for the) fifteenth episode of Meet Your Delegate, where MKR holders and the broader community get to know their delegates. For this episode, we will have delegate candidate @Llama presenting their platform and holding an AMA session. @Patrick_J will be hosting.  When 2022-06-15T18:00:00Z Google Calendar link  Where    Zoom Video   Join our Cloud HD Video Meeting Zoom is the leader in modern enterprise video communications, with an easy, reliable cloud platform for video and audio conferencing, chat, and webinars across mobile, desktop, and room systems. Zoom Rooms is the original software-based conference...      Meeting ID: 817 2615 4064 Passcode: 894459 ",
                    "links": [
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=NnUzYnBzbzRqdm4wZHNmZ2cwOTNtNnJ2N2EgbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://us02web.zoom.us/j/81726154064?pwd=QVpaUnk3aW5PeW9FWUN6SUh0REJKdz09",
                        "https://us02web.zoom.us/j/81726154064?pwd=QVpaUnk3aW5PeW9FWUN6SUh0REJKdz09",
                        "https://forum.makerdao.com/t/weekly-relay-june-7-13-2022/15818",
                        "https://forum.makerdao.com/t/relay-semanal-7-13-de-junio-2022/15897",
                        "https://forum.makerdao.com/t/weekly-relay-june-14-20-2022/15950",
                        "https://forum.makerdao.com/t/relay-semanal-14-20-de-junio-del-2022/16062"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.260416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/06/2022-14:49:50",
                    "content": "Let’s go ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kunfu-po",
                    "index": "#4",
                    "likes": "0",
                    "time": "22/06/2022-13:47:49",
                    "content": "  tags: Meet Your Delegate  Meet Your Delegate: Episode 15  Agenda   00:00: Introduction  01:06: Governance House  08:25: Open Questions  34:14: Conclusion   Video Link  General Introduction  Patrick_J 00:00  Welcome to the 15th edition of the Meet Your Delegate calls at MakerDAO. I am Patrick, one of the GovAlpha contributors. I am delighted to welcome the Governance House team, who have come to present their platform. Today, we welcome Joe, Puncar, and Matthew, members of the delegate team.   Delegate Introductions  Governance House  Puncar 01:06  Governance House1920×1089 87.6 KB    I will start with how we got graded, and then we will go into our mission and how we want to operate within Maker.  Governance House was created this year. However, the members have been in Web3 for some time. It all started within meta-governance stuff in Index Coop, where we have been discussing how we can improve meta-governance not just for Index Coop itself but for all the ecosystem. One of the things was to create an independent organization where contributors from various DAOs —which are interested in governance and also have knowledge of other aspects of DeFi— can join and help the ecosystem grow. That is how Governance House started. We want to cover all aspects of DeFi/Web3 and to have the knowledge to be able to make informed decisions on particular proposals and also be able to create our proposals. We believe in knowledge sharing and cooperation rather than competition. We want to know what is going on in the system, what works and what does not so that we can enable innovation.    We have six core values:    1366×459 68.3 KB     About openness, we want to be collaborative; we do not want to hide some information for the sake of having some advantages;  we want to be transparent and share knowledge between the entities and within the ecosystem to grow as an industry. We also believe that making quick decisions is not always the best idea, especially if there are many funds involved; we check what makes sense, what is safe, and how we can proceed the best way for the community and holders. We prioritize security over speed.  Trust and integrity are connected to  transparency: informing the community about our decisions and why we are doing something. Regarding entrepreneurial spirit, we aim to make our proposals. And if we see gaps in Maker, we will think about improving the structure to expand market for DAI.    How do we want to help the Maker ecosystem?    1366×447 99.1 KB   We want to make sure that DAI and all the products within Maker are expanding. We are supporting the market, and at the same time, we are also defending the market itself; we see both sides of this equation: we need to support the expansion, but we also need to protect Maker from any governance attacks or exploits.   Joe 07:30  All of us here are very passionate about space. I want to ensure we can help out in any way we can to keep DeFi running, especially with this crazy market going on and cascading liquidations across decentralized actors. It has never been more important for crypto to have DeFi right now and to have it be really strong and had the whole community comes together. I am happy to be here and work with you guys.   Matthew 07:56  I am looking forward to working with Maker. We have done a bit of work already around some of the integrations with Aave. We are looking forward to getting D3M plugged in when the time is right and doing everything we can to help drive some of those connections and integrations across DeFi.   Open Questions 08:44   David Utrobin: I am curious about Delegates and whether they know MKR holders are coming in as they propose themselves Delegates. Besides Rune and larger MKR holders: does anyone in your group know an MKR holder up front that is going to delegate to you?  Puncar: Index Coop is a large MKR holder. We do not know yet, since some technical issues need to be done to enable the delegation, but they might consider delegating to us. It will be up for the community to vote if the Governance House should be the one using their tokens.    10:00   Kianga Daverington: Could you let us know your backgrounds in the space and what you would be spending time on other than Governance House, or is Governance House kind of a full-time role for all of you across the various protocols?   Joe: I spent much time now with Bankless consulting and as a tokenomics consultant. I am also a DeFi power user in this space since 2016. I work with tokenomics now, building tokenomics models from scratch and some governance work with VOLTand Bankless.   Matthew: I joined Index Coop in 2020, where I led the finance team there; built that out from scratch into a full team. I contribute at Llama, which does more treasury management across several partners. More recently, I have become more actively involved with the Aave ecosystem, so we have Governance House’s proposal on that Forum, looking to set itself up as a Delegate in that system. I think being plumbed into quite a few different communities helps foster that collaboration across these different communities and find those opportunities to help growth.   Puncar: I am within a few communities. I have three areas where I spend most of my time. First is Governance House. Second, it is Bankless consulting. There, I specialize in governance and tokenomics. Third: I am part of Gitcoin, helping with operations and governance, and redesigning their Forum to support the discussion that is currently going on there. I am involved in Index Coop but not as much as I used to be.     13:12   Tim Black: Many people mention meta-governance. It is a nice buzzword, but I think the actual deliverables of what it is are unclear. Maybe you can unpack who the customer is? Do you charge? What is the impact it provides?  Matthew: Meta-governance as a service is a new term we have coined. We want to help solve the voting apathy problem by being active in communities by bringing opportunities to those communities; to be able to bring an idea to the community but also be very active and drive some of the opportunities in those integrations. We know most core-dev teams are very focused on high-priority tasks, so some of these third-party business DeFi integrations sometimes drift a little further down the list. Governance House can identify those opportunities, bring them to the community, and provide the networking, votes, and resources to implement some of these proposals. In terms of implementing these proposals, the way we typically fund them is either through grants or just real payment. That is largely set up to cover the cost of the resources to drive the integrations through actual implementation.    16:00  Kianga: I am still not sure I would fully grasp the concept. Others in the space have used the term meta-governance, and I am thinking about it —from Maker’s perspective— this way: We have tokens, and you may hold tokens on other protocols; then, we have our governance, which we are all here doing all the time, but then —as a DAO—, us participating in the governance of another protocol because we hold the assets is a challenge because we do not have a mechanism in place right now to monitor, form a view and decide as either MKR holders or as Delegates how we would vote tokens on other platforms. I thought of that as the meta-governance. The governance within MakerDAO pertains to governance decisions happening with our strategic partners or governance assets that we may hold in our treasury.  Are you viewing meta-governance as a service either similar to what I have described or different?  Matthew: It encompasses everything you have just said and probably goes a little bit further. For instance, Index Coop has DPI (there is a whole heap of governance tokens inside DPI), so Index Coop is very active in voting in different communities; they vote with their index token on a snapshot In this instance, if Maker was like Index Coop and had many asset holdings that it could use to vote in these communities, what you have is a governance process, and you probably have to figure out what that looks like. There is so much happening in this space. How do you keep up with what is happening in Maker and all the other communities you will vote on? How can you take high context and knowledge around that vote and then share it with the broader community so they can either form their own opinion or vote accordingly? Or do you elect to delegate that to a group that has the context which will provide the updates and facilitate that as a process  The process the actual vote goes through: Enabling people to vote with information; otherwise, people either do not vote or vote yes. Then, the actual execution and implementation of it: At Index Coop, Governance House has presented a proposed letter to the Index Council to actually run the snapshot, provide a recommendation in Discord to the contributors, and then implement that vote. That falls under the banner of meta-governance as a service.    19:40  Kianga: Is that how you see your role here at Maker?  In  your role as a recognized Delegate and with our current structure: would your focus then be on supporting our meta-governance, which we do not have a structure for yet?  Or are you going to be focused on just our status-quo internal voting that we currently have ongoing?  Or is it a combination?  Matthew: It is a combination, and you can probably add an extra flavor to that: if throughout our network we find an opportunity to integrate DAI or even make a token, we will bring that into the Maker community and present that. It has several different flavors, but holistically it spans everything you have touched on.    20:51  David Utrobin: Who is the most knowledgeable person on the team in regards to Maker?  How knowledgeable are they? How long have you been following?  Is there any specialization that you would say your team has that can contribute to better decision-making overall Maker?  Puncar: I am not sure if I can point to one person who is the most knowledgeable. Joe has been doing research and using Maker for some time. Matthew is involved in Index Coop and within Maker, maybe not, particularly in governance. I have been interested in Maker, especially in the strategic governance structure, how you operate and how you expand to RWA. For every particular aspect of Maker, someone will understand, so we can make informed decisions on it. If we do not have that expertise, if there are some specific topics we do not know about, we would probably abstain from voting. We, combined, should have the knowledge to vote on most of the proposals.    23:08  MakerMan: I am thinking about this governance as a professional organization. If I thought about these professional organizations being spread across the entire governance space, you have serious conflicts of interest and a potential lack of specialization. There is private information in Maker, so there will be issues with participating in and being knowledgeable. How do you see these professional organizations evolving? How are they going to deal with issues of conflicts of interests and information flows? I will have to deal with four different people to bring them up to speed on some issues: How am I going to do that when I have to deal with four, five, or ten people in an organization vs. having a single point person who may be knowledgeable and is the person that can delineate and pass out information to the organization?  How is that going to work?  Puncar: I do not believe that a group can be accountable, which is why I took the spot of being the point person and accountable for everything. If someone needs to communicate to Governance House for Maker-related things, it will be through me, and I will ensure that whoever needs to be involved will be involved. There will be no multiple people who need to be informed In regards to conflict of interests and confidentiality, transparency is the key. We want to share knowledge, but to ensure that we can do that within the group or beyond. I understand that some information may be confidential, and we respect that. Whenever Maker says that some information is confidential and cannot go beyond myself or the internal group involved within Maker and Governance House, we will respect that, and we will make sure that it does not go beyond. If there need to be adjustments, we are ready to work on that. We are a newly created organization with a very ambitious vision, and we want to learn as much as possible.    28:10  Patrick: There are some questions in the chat:  How your decision-making process is? -  As a team? -  Is it one person that will be making decisions? - Do you all have an equal say?  What is the structure of the team? Is it an organization? Is it a DAO? Are you employees of Governance House, or are you the owners?  How does that work, and how would that tie into a decision-making process?  Puncar: Currently —and this might evolve— I will be the responsible person. I will be responsible for making the final decisions. Joe, Matthew and David, and maybe a few others will be advising. That will be the structure of decision-making towards Maker at the moment.    29:25  Tim Black: There are occasions at Maker where we need people to vote quickly. If there is a big security issue, we will be contacting Delegates saying, “we need you to vote within the next few hours.”  Would Puncar have the trust of the rest of the team to make those decisions in an emergency, or would that still need a discussion among the team?  Joe: Absolutely. He would be your direct delegate.    30:11  Kianga: If you are a DAO or an incorporated entity, are you owners of the entity? How you are legally structured at the moment?  Puncar: There is no legal entity at the moment. We are still thinking about the best legal structure to use. That is why I will be the point of contact, as a person. If that changes, we will update MakerDAO on that.     Patrick & Tim Black 31:07  If we are thinking long term, this will be a proxy for fiduciary duties. If you are running as an organization, there is some level of internal compliance; we see that from other teams. Do you have a multi-sig that you are using to vote with, or will Puncar be in charge of the wallet?  In any kind of time-sensitive situation, how does that work?  Puncar: This is something we need to discuss internally because, with the fast-decision making, I will be the one deciding, but we had multi-sig. Now I see the paradox in it. Let me take that offline and update you on our decision.     0xIceBear 32:56  What is the timeline we are looking at right now? What is the aim timeline in the future for the integration of the cooperations?  What is the timeline that we can feel comfortable with the setup that we will have in the future?  Puncar: The legal entity timeline has not been decided, because we do not know yet what type of legal entity we will be using or if it will be a DAO, maybe in multiple jurisdictions. I cannot give you any concrete answer. There is no decision made; there is no clear roadmap. That is why I am facing MakerDAO as an individual. Matthew: We must also be working with several other communities, and we want to take on board their feedback and recommendations or input along the way in determining what legal structure we should choose.     Conclusion  Patrick_J 34:14  Thank you, Puncar, Matthew, and Joe, for coming to spend half an hour with us answering many questions. It was a really interesting discussion, and it seemed to stimulate much of conversation, which was good.   Common Abbreviated Terms DAO: Decentralized Autonomous Organinization RWA: Real World Asset DeFi: Decentralized Finance  Credits  Kunfu-po produced this summary.  @Harrizko produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/67PFalZks5I?t=66",
                        "https://youtu.be/67PFalZks5I?t=505",
                        "https://youtu.be/67PFalZks5I?t=2054",
                        "https://www.youtube.com/watch?v=67PFalZks5I",
                        "https://youtu.be/67PFalZks5I",
                        "https://youtu.be/67PFalZks5I?t=66",
                        "https://indexcoop.com/",
                        "https://youtu.be/67PFalZks5I?t=451",
                        "https://youtu.be/67PFalZks5I?t=476",
                        "https://youtu.be/67PFalZks5I?t=524",
                        "https://youtu.be/67PFalZks5I?t=600",
                        "https://banklesshq.com/",
                        "https://voltage.finance/",
                        "https://defillama.com/",
                        "https://gitcoin.co/",
                        "https://youtu.be/67PFalZks5I?t=792",
                        "https://youtu.be/67PFalZks5I?t=960",
                        "https://youtu.be/67PFalZks5I?t=1180",
                        "https://youtu.be/67PFalZks5I?t=1251",
                        "https://youtu.be/67PFalZks5I?t=1388",
                        "https://youtu.be/67PFalZks5I?t=1690",
                        "https://youtu.be/67PFalZks5I?t=1765",
                        "https://youtu.be/67PFalZks5I?t=1811",
                        "https://youtu.be/67PFalZks5I?t=1867",
                        "https://youtu.be/67PFalZks5I?t=1976",
                        "https://youtu.be/67PFalZks5I?t=2054",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-june-2022/16529"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.722421436588103
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "06/07/2022-13:48:15",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}