{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-21-de-septiembre-28-de-septiembre-de-2022/18275",
            "title": "Relay Semanal: 21 de septiembre - 28 de septiembre de 2022 ",
            "index": 18275,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "weekly-relay",
                "ambassadors"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Harrizko",
                    "index": "#1",
                    "likes": "2",
                    "time": "07/10/2022-14:33:50",
                    "content": " Relay Semanal | 21 de septiembre - 28 de septiembre 2022  2587×570 114 KB  Hola a todos. ¡Gracias por consultar el Relay Semanal! Ya sea que poseas MKR o DAI, tengas tu propia Vault o te quieras involucrar más con la Gobernanza, esta es tu parada obligatoria para estar al día con las actualizaciones de MakerDAO. Autores: @alec, @nothsa @Sol_Invictus, y @Artem_Gordon Versión PDF Online en Inglés    EVENTOS RECIENTES   Coinbase MIP81 Q&A y Discusión Posterior  Bajo las condiciones de la MIP81, 33% —es decir, aproximadamente 1.600 millones— de USDC serán transferidos desde el PSM y colocados bajo custodia de Coinbase. Así, y a través del exchange, la DAO tendrá la posibilidad de ganar recompensas en USDC. Se estima que esas recompensas podrán llegar a representar hasta un 1.5% del Porcentaje de Rendimiento Anual (APY, por sus siglas en inglés), redundando para el protocolo en un ingreso anual de unos teóricos 24 millones. Por todo esto, la Directora Financiera de Coinbase, Alesia Haas, participó en un Q&A con GovAlpha, centrado en la discusión de esta propuesta que ha levantado tanto revuelo. A este Q&A se le asignó una duración de media hora, y las preguntas contestadas ya habían sido preseleccionadas. Esta modalidad no es la que se esperaría en la Web3, sino más bien típica de lo que sucede en el mundo tradicional de los negocios. Una gran cantidad de usuarios propusieron preguntas excelentes, pero lamentablemente —a causa de lo limitado del tiempo— muchas de ellas debieron quedar fuera. Una transcripción completa de la reunión, hecha por @Artem_Gordon, puede ser consultada (en inglés) aquí. ¡@TRUEMAKER, sin embargo, ha desmenuzado todo en pedacitos pequeños para que tanta información sea más digerible! (el post completo puede encontrarse aquí).  701×476 44.9 KB   Endgame Plan: Diagrama del Ecosistema y sus Alcances En este posteo, @rune continúa desmenuzando el Endgame y provee información adicional sobre los alcances y la escala del rediseño del ecosistema de MakerDAO. El Plan Endgame propone tres grandes categorías de actores involucrados en el funcionamiento del ecosistema:  Los denominados Scopes se mantienen dentro de los márgenes del “Maker Core”; la base estructural de Maker. Las MetaDAOs funcionan como DAOs semi-independientes Los Actores Ecosistémicos son compañias, individuos o DAOs totalmente independientes que proveen de diferentes servicios a ya sea las MetaDAOs o al Maker Core.   ¿Pero qué es un Scope y qué función cumple?  Los Scopes detallan y estandarizan de qué manera los varios actores del ecosistema se comunican y colaboran entre sí. Básicamente, se aseguran de mantener la “inmutabilidad” estructural que se considera clave para que el Endgame tenga éxito y se asegure la supervivencia a largo término de MakerDAO.  “Los 11 Scopes se dividen en Scopes Primarios y en Scopes de Apoyo, siendo los primeros aquellos que se encargan de las actividades que permiten que Maker se mantenga estable y crezca. Dentro de estos se encuentran las CUs: Protocol Engineering, Decentralized Collateral, RWA Collateral, y Growth”  Estos Scopes son abordados en profundidad por tres grupos de actores:   El Comité Elector Descentralizado (DVC, por sus siglas en inglés) El Consejo de Gobernadores Los Tribunales  Los Scopes Primarios son, entonces, entidades muy grandes con una gran cantidad de recursos a su disposición. En concordancia con la idea de mantener la “separación de poderes”, estos actores se mantendrán separados de los Consejos en los cuales se defina la base estructural de los Scopes. A su vez, estos Consejos se conformarán con representantes de los Gobernadores de cada MetaDAO.  ¿Cómo será el funcionamiento de este mecanismo?  Paso 1: DVC’s, los Delegados y el Consejo se ponen de acuerdo con respecto a la estructura que deberá tomar un Scope. Por ejemplo: se podría discutir y llegar a una decisión acerca de qué proceso se utilizará a la hora de lanzar un Activo Sintético como, por ejemplo, EuroDAI, y de los pasos que se deberán dar cuando esto suceda para que todo salga de la mejor manera posible. Paso 2: Una vez que se haya decidido esta estructura y estos modos de accionar, las Core Units ya tendrán coordenadas claras a la hora de actuar, y sabrán cuándo y cómo iniciar ese hipotético lanzamiento de Activos Sintéticos; sabrán a cual actor del Ecosistema —MetaDAOs o actores independientes— pagarle y asignarle la tarea. Paso 3: El último paso será lograr un voto Ejecutivo para activar el dicho lanzamiento, y luego esperar por las rondas de votación en las cuales participan los holders de MKR y los Delegados.  \"Procesos especificados detalladamente, como el que se ha usado de ejemplo, deberán ser llevados a cabo en cada uno de los 11 Scopes. Tener procesos detallados y especificados meticulosamente evita  el riesgo de que aparezcan areas grises, y permite disfrutar de una plataforma sólida desde la cual ir creciendo en complejidad\".   Pantallazo general del sistema basado en Scopes   1920×1552 346 KB  El post completo puede ser consultado aquí.    Esta Semana en la Gobernanza  Actualización semanal n°106 de las MIPs Encuestas de ratificación, propuestas y discusiones pre-MIP.   Votos Ejecutivos  ¡Noticias frescas!   Update the PROXY_ACTIONS_END_CROPPER Address, Starknet Bridge Deposit Limit Increase, Core Unit MKR Vesting _Posteado el 28 de septiembre del 2022. Expira el 28 de octubre del 2022, 10:36 UTC   Si esta Propuesta Ejecutiva tiene éxito, cambiará al protocolo de Maker en los siguientes aspectos:  Actualización de la dirección PROXY_ACTIONS_END_CROPPER  Según este post de @Derek —el Facilitador de la Core Unit Protocol Engineering— la dirección PROXY_ACTIONS_END_CROPPER será actualizada a 0x38f7C166B5B22906f04D8471E241151BA45d97Af.   Según esta votación de Gobernanza el límite máximo para depositar en el bridge (puente) de Starknet se aumentará de 50 a 1.000 DAIs. Para más detalles, puedes consultar este thread.  Vesting de MKR a Core Units:  Un total de 1161.46 MKR serán transferidos a tres Core Units:  Según lo aprobado en en esta Propuesta de Compensación de MKR, 20 MKR se transferirán a la Core Unit Real World Finance (RWF-001). La cantidad transferida es menor a la inicialmente solicitada debido a la reducción del número de trabajadores full-time en la ya mencionada CU.  966.49 MKR se transferirán a la Core Unit Collateral Engineering Services (CES-001) según lo aprobado en esta Propuesta de Compensación de MKR.  175 MKR se transferirán a la Core Unit Risk según lo aprobado en esta Propuesta de Compensación de MKR.       Aprobadas la Semana Pasada   Core Unit Budget Streams, SPF Funding, HVBank Legal Update, MKR Stream Accounting Cleanup Aprobada el 16 de septiembre del 2022, 14:49 UTC. Ejecutada el 18 de septiembre del 2022, 14:50 UTC.   Si esta Propuesta Ejecutiva tiene éxito, cambiará al protocolo de Maker en los siguientes aspectos:  Un total de 3.004.859 se derivarán a dos Core Units:   667.055 DAIs a la Core Unit Dai Foundation (DAIF-001).  2.337.804 DAIs a Core Unit Oracle (ORA-001)   Según estas encuestas de Gobernanza: 1 y 2, un total de 80.000 DAIs* se transferirán a las wallets multisig de dos Fondos de Propósitos Especiales (SPF por sus siglas en inglés). Redireccionamiento de flujos de MKR:  El flujo de MKR que solía direccionar MKR a la Core Unit Growth antes de que se decidiese su redireccionamiento hacia el Proxy de Pausa de Maker ha adquirido el saldo sobrante de MKR. Se hash de IPFS por el Acuerdo Legal con el Banco de Huntington Valley ha sido actualizado.      Votaciones Activas  ¡A punto de terminar!  Actualizaciones de Parámetros      Nombre Discusión Fecha de inicio Fecha de cierre     Incorporación de rETH Discusión 26/09 16:00 UTC 29/09 16:00 UTC   Subasta de Colateral Discusión 26/09 16:00 UTC 29/09 16:00 UTC     Votaciones Comunitarias      Encuesta de Visto Bueno Desgloce de Votación Fecha de inicio Fecha de cierre     Originador Canadiense de Hipotecas Federalmente Reguladas  2270×545 90.7 KB  19/09 16:00 UTC 3/10 16:00 UTC     Votaciones Terminadas   Rankeo     Nombre Desglose de Votación Fecha de cierre     Modificar el presupuesto de GovAlpha CU  711×353 12.2 KB  26/09 16:00 UTC     Aprobadas     Encuesta de Ratificación Desglose de Votación Fecha de cierre     Enmendar el Período de Medición de Participación de los Delegados  721×251 6.37 KB  26/09 16:00 UTC   Compensación de MKR para la StarkNet Core Unit Starknet Engineering  719×248 6.6 KB  26/09 16:00 UTC   Fondo de Propósito Especial para el Programa Embajador  721×249 6.38 KB  26/09 16:00 UTC     Rechazadas     Encuesta de Ratificación Desglose de Votación Fecha de cierre     Set de MIP de Delegados de MakerDAO  719×250 6.81 KB  26/09 16:00 UTC   Desvinculación de la Core Unit Strategic Happiness  720×251 6.77 KB  26/09 16:00 UTC        Reuniones y Eventos   Grabaciones de las llamadas de la semana pasada  Charlas de Delegados | Foro | Video  Gobernanza y Riesgo #208 | Foro | Video  Coinbase MIP81: CFO <> Preguntas de la Comunidad | Foro | Video    Llamadas de esta semana  Charlas de Delegados | Foro | Unirse el 29 de septiembre, 2022, 1:00 PM Gobernanza y Riesgo #210 | Foro | Unirse - Código de acceso: 748478 el 29 de september, 2022, 2:00 PM Endgame RFC DVC | Foro | Unirse el  30 de spetiembre, 2022, 12:00 PM DVC/Endgame | Foro | Unirse hoy, 4:00 PM   Horas de Oficina de las Core Units    Link para unirse | GovAlpha, Preguntas y Respuestas de la Gobernanza - Lunes a las 17:00 UTC  Link para unirse   | Immunefi Security. Todos miércoles a las 15:00 UTC  Link para unirse | Sustainable Ecosystem Scaling - Martes a las 13:30 UTC  Link para unirse | Protocol Engineering - Martes a las 15:00 UTC  Link para unirse | Strategic Finance (bIBTA SPF) | Martes 30 de agosto a las 17:00 UTC  Link para unirse | 6S Capital - Todos los miércoles a las 14:00 UTC  Link para unirse | Growth - Primer miércoles de cada mes a las 17:00 UTC  Link para unirse | Real World Finance - Cada miércoles a las 18:00 UTC  Link para unirse | Governance Communications - Viernes a las 18:00 UTC    Enlaces Útiles   Todos los Dahsboards Disponibles   Todas las Guías Disponibles   Calendario de Charlas   Foro y Discord de Maker   Tracker de los Dashboards de Gobernanza | Versión en Sheets de Google  Discusiones del Foro - Dashboard de Gobernanza    Índice de MYD (Conoce a tu Delegado)   Portal Educativo y Documentación Técnica   Servidores de Discord de MakerDAO   MakerBurn   Lista de Charlas   Herramientas de Participación   Calendario de Votaciones y Fechas Importantes  Descargo: Esta actualización fue ensamblada por un grupo de miembros que contribuyen a la comunidad de MakerDAO. La misma no debería servir como asesoría financiera ni como incentivo para votar de alguna forma específica. Esta actualización es meramente informativa y se ha realizado sólamente con fines informativos.  Esta es una traducción libre del artículo original en inglés gracias a @Harrizko y @sebix. ",
                    "links": [
                        "https://pdfhost.io/v/fSbbR9Ppp_Weekly_Relay_September_21_28_2022",
                        "https://forum.makerdao.com/t/coinbase-mip81-live-call-with-coinbase-cfo-questions-needed-asap/18007/12",
                        "https://www.linkedin.com/in/alesia-haas-b776531/",
                        "https://www.youtube.com/watch?v=3W7medDj6Z8",
                        "https://forum.makerdao.com/t/coinbase-mip81-cfo-community-questions-monday-september-26/18037/14",
                        "https://forum.makerdao.com/t/coinbase-mip81-cfo-community-questions-monday-september-26/18037/15",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/1/4/141bc99ce99cc9852fc73652d5eaade78b571f57.png",
                        "https://forum.makerdao.com/t/endgame-plan-diagram-of-the-scopes-and-ecosystem/18139",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/c/1/c16a017d694051584757be72277a62ccf5914398.jpeg",
                        "https://forum.makerdao.com/t/endgame-plan-diagram-of-the-scopes-and-ecosystem/18139#example-of-work-cycle-of-the-protocol-engineering-scope-2",
                        "https://forum.makerdao.com/t/weekly-mip-update-106/18103",
                        "https://vote.makerdao.com/executive/template-executive-vote-update-the-proxy-actions-end-cropper-address-starknet-bridge-deposit-limit-increase-core-unit-mkr-vesting-september-28-2022",
                        "https://forum.makerdao.com/t/28th-september-executive-updating-the-proxy-actions-end-cropper-address/18057",
                        "https://vote.makerdao.com/polling/QmbWkTvW#poll-detail",
                        "https://forum.makerdao.com/t/request-for-poll-starknet-bridge-deposit-limit-and-starknet-teleport-fees/17187",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP38",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP1",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP20",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP30",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP2",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP25",
                        "https://vote.makerdao.com/executive/template-executive-vote-core-unit-budget-streams-spf-funding-hvbank-legal-update-mkr-stream-accounting-cleanup-september-14-2022#proposal-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP17",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP75",
                        "https://vote.makerdao.com/polling/QmcCs8SS",
                        "https://vote.makerdao.com/polling/QmdaG8mo#vote-breakdown",
                        "https://etherscan.io/tx/0x2755d689a8939e0d95c15bef1cfa14d048b79bb218362338fc9173657643c382",
                        "https://etherscan.io/address/0xbe8e3e3618f7474f8cb1d074a26affef007e98fb",
                        "https://vote.makerdao.com/polling/QmS7dBuQ#vote-breakdown",
                        "https://forum.makerdao.com/t/reth-collateral-onboarding-risk-evaluation-update/18071",
                        "https://vote.makerdao.com/polling/QmREbu1j",
                        "https://forum.makerdao.com/t/collateral-auctions-analysis-parameter-updates-september-2022/18063",
                        "https://vote.makerdao.com/polling/QmYRjEA9#vote-breakdown",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/3/a/3a08c9094f026d1dc5b61296fcdfdc770a2e08c5.png",
                        "https://vote.makerdao.com/polling/QmUoGryZ",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/9/7/974ea843926b9c1d319cfd760de09b50eb460d2a.png",
                        "https://vote.makerdao.com/polling/QmdmeiQg#vote-breakdown",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/0/b/0b4fded19dffa51b458b824f6df97d4f105734b9.png",
                        "https://vote.makerdao.com/polling/QmWX6BSA#vote-breakdown",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/f/e/fe311c73c36d168a7a5c898b5b770f059b5d90ac.png",
                        "https://vote.makerdao.com/polling/QmcJQCyW#vote-breakdown",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/2/7/2744ff642040586624d5c62de225b426c622b0b4.png",
                        "https://vote.makerdao.com/polling/QmUvMPe2#vote-breakdown",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/5/6/56262410626f13c6740c2abcbf90df53dafe6524.png",
                        "https://vote.makerdao.com/polling/Qmc9Un8i",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/8/6/8695ea87d86557174880adb3b0ff10b3c56647f4.png",
                        "https://forum.makerdao.com/t/delegate-office-hours-12/18012",
                        "https://www.youtube.com/watch?v=Ao4vUuFJnGU",
                        "https://forum.makerdao.com/t/governance-and-risk-209-thursday-september-22-at-17-00-utc/18020",
                        "https://www.youtube.com/watch?v=T56N0u881M8",
                        "https://forum.makerdao.com/t/coinbase-mip81-cfo-community-questions-monday-september-26/18037",
                        "https://www.youtube.com/watch?v=3W7medDj6Z8",
                        "https://forum.makerdao.com/t/delegate-office-hours-13/18111",
                        "https://us02web.zoom.us/j/88286550832?pwd=dWQzQi9tYlNyemJJS2Nrd2NUdTBoZz09#success",
                        "https://forum.makerdao.com/t/governance-and-risk-210-thursday-september-29-at-17-00-utc/18115",
                        "https://forum.makerdao.com/t/endgame-rfc-dvc-calls/17773",
                        "https://us02web.zoom.us/j/87005527061?pwd=bHN0M2ExY1hQU0xFcENsREhEUFJPUT09#success",
                        "https://forum.makerdao.com/t/endgame-call-wednesdays-9pm-cest-link/18123",
                        "https://us02web.zoom.us/j/89326394914#success",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09#success",
                        "https://makerdao.bigbluemeeting.com/adm-eox-jtz-tsi",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09#success",
                        "https://meet.google.com/bjm-qiup-hif",
                        "https://meet.google.com/bjm-qiup-hif",
                        "https://us02web.zoom.us/j/81560369659#success",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com/t/all-available-dashboards/16104",
                        "https://forum.makerdao.com/t/all-available-guides/16159",
                        "https://forum.makerdao.com/t/the-calls-calendar/16095",
                        "https://forum.makerdao.com/",
                        "https://discord.com/invite/YtBXXYuVDB",
                        "https://www.makerdao-governance-dashboard.com/tracker",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://www.makerdao-governance-dashboard.com/tracker/forum-discussions",
                        "https://forum.makerdao.com/t/know-your-mip-index/6768",
                        "https://makerdao.world/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forum.makerdao.com/t/makerdaos-discord-servers/16110",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/office-hours-list/16162",
                        "https://makerdao.world/en/learn/governance/participate/",
                        "https://forum.makerdao.com/t/the-votes-and-important-dates-calendar/16096",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/18"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.161458333333333
                }
            ]
        }
    ]
}