{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/avalanche-stablecoins-analytics-the-importance-of-native-tokens/18053",
            "title": "Avalanche stablecoins analytics - The importance of native tokens ",
            "index": 18053,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "analysis"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#1",
                    "likes": "3",
                    "time": "22/09/2022-13:33:23",
                    "content": "Avalanche Network is experiencing very strong growth of stablecoins. Top 5  USDC: 43,60% ($ 965M) USDT: 29,40% ($ 651M) USDC.e: 15,97% ($ 353M) DAI.e: 7,16 ($ 158M) USDT.e: 3,46% ($ 76.7M)  “.e” tokens (USDC.e, USDT.e and DAI.e) are the tokens coming from the official Avalanche-Ethereum bridge, while USDC and USDT (without the “.e”) are native tokens minted in Avalanche.  image1920×1080 171 KB  Some conclusions:  USDC + USDC.e vastly outperformed USDT + USDT-e in market cap. Native tokens outperformed the same bridged “.e” tokens by far, which is logical, as they have no risk of potential attacks on bridge´s smart contracts. Dai.e is in a comfortable third place, but it is logical to assume that it would have a chance to grow if native DAI were minted in the Avalanche ecosystem.  Source: Avaxholic Analytics Recently, Binance annouced that BUSD is now natively available on Avalanche and Polygon,  so I expect it will have a lot of penetration and usage, and will be hard competition for DAI. Source: Binance ",
                    "links": [
                        "https://www.binance.com/en/blog/markets/busd-is-now-available-on-avalanche-and-polygon-849635478180235964",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/22",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-21-28-de-septiembre-de-2022/18259"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.852125850340136
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#2",
                    "likes": "1",
                    "time": "22/09/2022-13:36:37",
                    "content": "Interesting report. It shows how important it is to have native assets on different chains. I hope we get to have some form of native DAI in relevant chains like Avalanche in the near future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "1",
                    "time": "22/09/2022-15:16:56",
                    "content": "    Marian:   Dai.e is in a comfortable third place, but it is logical to assume that it would have a chance to grow if native DAI were minted in the Avalanche ecosystem.    A few weeks ago relatively DAI reached almost $1B of DAI in that network, perhaps low due to current market conditions. I understand that AVAX is in the DAI strategies in various L2 or Sidechains, it would be interesting to apply the strategy that I mentioned in various discussions or posts in the forum of various sidechains using your collateral token and use that DAI for the development of the same, a la Matic, and possibly a la GNOSIS. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.294642857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#4",
                    "likes": "0",
                    "time": "23/09/2022-13:28:31",
                    "content": "    Saludiego_201:  I understand that AVAX is in the DAI strategies in various L2 or Sidechains   That’s right, this topic reported on the idea of pushing multichain DAI, and deploying in Avalanche by Q2 of 2023 and in various L2 and other networks.    MakerDAO: Long-term Growth Strategy for the Future of DeFi   4. Drive Native Retail Adoption in a Multi-Chain Universe As DAI (should be our North Star ), we need to find retail users again. To give DAI stable end-user demand, Maker needs to go to where the users are, and the users are drifting to Layer 2s and multi-chain. A robust infrastructure is necessary to reach all of these players and Maker is on the way to positioning itself at the center of an ecosystem with Maker MCD, DAI and Maker Teleport at the core.    I think this is crucial, the experience in Avalanche (and I assume it must be replicated in other networks) indicates that when users are offered a native stablecoins, their use grows in detriment of bridged strablecoins. ",
                    "links": [
                        "https://forum.makerdao.com/t/makerdao-long-term-growth-strategy-for-the-future-of-defi/15457/1",
                        "https://forum.makerdao.com/t/a-north-star-dai-as-the-destination/14838"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.964285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#5",
                    "likes": "2",
                    "time": "23/09/2022-14:03:06",
                    "content": "The concept of a native dai on avalanche doesn’t really make sense. It would always have to go through some sort of third party or intermediary, so it would always be a custodial wrapper version of Dai. Centralized stablecoins have a natural advantage here because they are already custodial wrappers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#6",
                    "likes": "0",
                    "time": "23/09/2022-14:47:13",
                    "content": "True, in the case of DAI, the guidance on this topic comes from the side of the official DAI bridge and the Canonical DAI in different networks, backed and supported by Maker. I think when deploy on other networks (as I understand is planned) this will represent a big step forward compared to other DAI wrappers, as it would give much more confidence to users. More info about Canonical DAI ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7857142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Daimon-Law",
                    "index": "#7",
                    "likes": "1",
                    "time": "26/09/2022-02:13:34",
                    "content": "Just to provide a PSA here regarding Avalanche stables: please don’t use the “.e” stables if you can avoid it - these are bridged stables which are no longer necessary as both Circle and Tether have native stables on Avalanche. That’s been the case since March.   twitter.com    Emin Gün Sirer🔺 @el33th4xor  It's a good idea to replace bridged assets (e.g. USDT.e and USDC.e) with native ones (e.g. USDT and USDC) on #Avalanche. twitter.com/bit_gossip/sta…   Squanch🔺 @bit_gossip  .⁦⁦@FTX_Official⁩ just enabled USDC (wen USDT?) deposit and withdrawals for Avalanche C chain.  No idea which exchange going to add native c chain deposit/withdrawals after FTX but I’m pretty sure It will have chance to be gateway for 20B $ liquidity sitting on C chain. https://t.co/xhggg0FmB5    12:43 PM - 1 Mar 2022           400                84            Also, Circle and CEXs like Binance do not support .e stables but do support native Avalanche stables such as USDC/T. The only reasons I can think people still holding .e stables are residual yield farming opportunities and swap fees. ",
                    "links": [
                        "https://twitter.com/el33th4xor/status/1498640158769434631?s=20&t=KoWHRlM-ZMQOhePuKR9qjQ",
                        "https://twitter.com/el33th4xor/status/1498640158769434631?s=20&t=KoWHRlM-ZMQOhePuKR9qjQ",
                        "https://twitter.com/search?q=%23Avalanche",
                        "https://twitter.com/bit_gossip/status/1498594607432671236",
                        "https://twitter.com/bit_gossip/status/1498594607432671236",
                        "https://twitter.com/el33th4xor/status/1498640158769434631?s=20&t=KoWHRlM-ZMQOhePuKR9qjQ"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#8",
                    "likes": "2",
                    "time": "27/09/2022-12:38:55",
                    "content": "    rune:  The concept of a native dai on avalanche doesn’t really make sense. It would always have to go through some sort of third party or intermediary, so it would always be a custodial wrapper version of Dai. Centralized stablecoins have a natural advantage here because they are already custodial wrappers.   Hi Rune, how you see wrapped Dai in terms of Growth? I’m asking cuz I know in Maker we are thinking first on L2s so we can relay on the Ethereum safety. But for example Avalanche, Polygon and even the BNB Smart Chain are the networks that most of the retail users adopt cuz of marketing and other features. Isn’t important for us to have a strong presence there? And if so, a wrapped presence is enough? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0102813852813854
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#9",
                    "likes": "1",
                    "time": "03/10/2022-14:53:15",
                    "content": "    rune:  The concept of a native dai on avalanche doesn’t really make sense. It would always have to go through some sort of third party or intermediary, so it would always be a custodial wrapper version of Dai. Centralized stablecoins have a natural advantage here because they are already custodial wrappers.   Unless Maker decides to have vaults on chains other than Ethereum, like like Qi DAO or even Abracadabra. I’ve always thought having vaults on L2s and L1s like Avalanche would be a great move for Maker. In fact for a long time I had assumed Maker’s multi chain strategy would involve implementing vaults on different chains. To me just implementing a cannonical bridge as Maker’s whole multi-chain strategy is a wasted opportunity. Having vaults on different chains + the bridge would be a huge step forward imo, since it would allow to widen the spectrum of collaterals (ie AVAX and other assets on Avalanche), as well as having the possibility to connect Maker with other DeFi ecosystems and move DAI more securely from one chain to another. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.658333333333333
                }
            ]
        }
    ]
}