{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-increasing-the-sourcecred-payments/7489",
            "title": "[Informal Poll] - Increasing the SourceCred payments ",
            "index": 7489,
            "category": [
                "Discontinued Categories",
                "Misc Discontinued"
            ],
            "tags": [
                "sourcecred"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "8",
                    "time": "14/04/2021-10:53:03",
                    "content": "As core units continue their path to formation / approval / funding, I do believe there is also an in-parallel need to continue the engagement from the community to participate in the forums that (for whatever reason) are not a part of the core units. From the recent SourceCred post the DAO is allocating $5000 per week. Frankly, I am not even sure if it is the DAO or the Foundation that is paying this.    Should we increase the weekly allocation of SourceCred?  Yes No Abstain     0 voters     The outcome of this informal poll will determine if a signal request (or other) is needed. This may very well already fall in a core unit. ",
                    "links": [
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-april-25th-2021/7744",
                        "https://forum.makerdao.com/t/delegate-compensation-informal-poll/10042/10",
                        "https://forum.makerdao.com/t/bancor-wants-to-take-notes-on-our-sourcecred-instance/7716/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-41-en-espanol/7614",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-april-18th-2021/7602",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-137-thursday-april-15-17-00-utc/7384/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-41/7571",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-9-15/7509",
                        "https://forum.makerdao.com/t/delegate-compensation-informal-poll/10042/18"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "14/04/2021-11:17:53",
                    "content": "    mrabino1:  From the recent SourceCred post  the DAO is allocating $5000 per week. Frankly, I am not even sure if it is the DAO or the Foundation that is paying this.   GovAlpha is paying it from April (there is a bit of a buffer though, so we haven’t sent any payments related to it yet.) I would like to see input from the community regarding an increase though. If you could give the poll an abstain option, and make votes visible that would be appreciated (though not required.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#3",
                    "likes": "1",
                    "time": "14/04/2021-11:24:49",
                    "content": "    LongForWisdom:  If you could give the poll an abstain option, and make votes visible that would be appreciated (though not required.)   Updated… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#4",
                    "likes": "7",
                    "time": "14/04/2021-12:02:31",
                    "content": "Voted No. I’m relatively new here but I was surprised at how much DAI I received last month. Personally, I think SourceCred overpays casual community members like me. I like posting here and I’m not gonna turn down free money but I’d probably contribute exactly the same way even if I received 10 DAI a month or 100 DAI a month. Small amounts as a thank you gesture are sometimes better. There is a point where the community growth and participation becomes inorganic and it becomes tempting to post without adding real value, just to earn DAI. It’s only my opinion but I think the current amount is too high but given that the community will grow, this problem should sort itself out in the coming months. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.261332070707071
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#5",
                    "likes": "11",
                    "time": "14/04/2021-12:27:31",
                    "content": "I’ve been a big fan of increasing our SourceCred payments. Full disclosure, I work closely with the SourceCred team through GovAlpha and have helped with some of the recent weight changes so take my enthusiasm for the program with a grain of salt. SourceCred was the thing that took my interest in Maker from a intellectual curiosity to an incentivized reason to come back everyday, and while 5 months later the SourceCred payments don’t matter to me nearly as much as they did at the beginning, it was still a large reason why I was able to take the time to become a paid contributor. Additionally, while the DAI amount is no longer as material to me, every month I still look at my SourceCred payment compared to the previous month. I’m engaging a lot more this month because my last payment was smaller which got me to reflect on how much time I’ve been spending collaborating in meetings rather than publicly on the forum. As far as Governance issues with SourceCred, it’s pretty clear the data has a lot of value. How much we want to pay people to participate is a bit trickier of a question, but objectively we want to pay enough to encourage repeat contributions and not enough to encourage malicious attacks. IMO we could easily double the payments without upsetting the balance, and the move would be a great excuse to team up with Marketing and really promote the DAO. Like it’s pretty revolutionary that all you have to do here to get paid is show up with some reasonable ideas. How many more talented individuals would we attract if they knew their time would be valued from the moment they created an account? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916305916305916
                },
                {
                    "author_link": "https://forum.makerdao.com/u/reuptaken",
                    "index": "#6",
                    "likes": "4",
                    "time": "14/04/2021-12:37:47",
                    "content": "I voted yes, and I think that (I’m not sure if this is technically possible) MKR should be used, not DAI. MKR is the “governance” currency for MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#7",
                    "likes": "3",
                    "time": "14/04/2021-12:43:36",
                    "content": "The price movement of MKR could make this rather difficult, as well as sourcing it @reuptaken. But I agree, there should be a way to use SourceCred to give MKR to the people participating in Governance. One interesting idea is that you can always run “one-time” data sets via the SourceCred algorithm where you apply a special waiting (maybe we boost all posts in the Governance category for instance) and do a distribution from those numbers. Since it would be one time that takes out the currency risk, and it wouldn’t be as hard to find an agreement for the single distribution (minting vs buying) in the community. It’s an “unnecessary” expenditure for sure, but I think getting MKR into the hands of people that care about the protocol is a great way to add to the expected longevity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4411375661375665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#8",
                    "likes": "2",
                    "time": "14/04/2021-12:44:42",
                    "content": "    reuptaken:  MKR should be used, not DAI. MKR is the “governance” currency for MakerDAO.   I plan on using my DAI to just buy MKR. Giving MKR to those who would hold would be a tax issue ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#9",
                    "likes": "7",
                    "time": "14/04/2021-12:44:53",
                    "content": "Just buy MKR with the DAI. No need to overcomplicate things. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/reuptaken",
                    "index": "#10",
                    "likes": "1",
                    "time": "14/04/2021-12:50:08",
                    "content": "I’m not sure if this is difficult. At the end of the week we could allocate MKR worth eg 10K DAI to participants. But I’d rather set some fixed amount of MKR and update it periodically (eg. 4x a year or so). Of course I can buy MKR with DAI, but I think this could be a good idea to encourage people to take part in governance by giving them MKR. Perhaps even MKR-in-chief. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3500000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#11",
                    "likes": "0",
                    "time": "14/04/2021-12:56:49",
                    "content": "Except this is inefficient. Buy MKR on market to give MKR to people who will then have to sell a portion of it for taxes. This gets worse the more expensive MKR gets. Just use DAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/reuptaken",
                    "index": "#12",
                    "likes": "0",
                    "time": "14/04/2021-13:01:28",
                    "content": "Why people have to sell it for taxes (in contrast with DAI?). I’m not sure what jurisdiction you’re talking about, where MKR is taxed while DAI is not? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#13",
                    "likes": "0",
                    "time": "14/04/2021-13:03:37",
                    "content": "Both are taxed, but one can have a different value on tax day than on pay day. Try paying taxes on an asset that fell 30% from when it was given to when you owe taxes on it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/reuptaken",
                    "index": "#14",
                    "likes": "0",
                    "time": "14/04/2021-13:12:00",
                    "content": "OK, I get it that it may be a problem in some jurisdictions. In my country there’s no tax on airdrops. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#15",
                    "likes": "0",
                    "time": "14/04/2021-13:16:04",
                    "content": "Ooof. Yeah, here that just gives you a cost basis of $0. No issue at the time usually — unless it’s already used in markets and has a marketable price. Getting 1 MKR given to you today is basically $2600 in taxable income. Gotta pay the tax man from selling part of it or from your day job. It’s also just a hassle ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#16",
                    "likes": "5",
                    "time": "14/04/2021-13:22:53",
                    "content": "    reuptaken:  In my country there’s no tax on airdrops.   Lucky you! I voted Yessssssss, as we need to recruit and expand the community–but more importantly–RETAIN the community participation. Too often I see talented people stop-by get involved and then disappear. Incentives, incentives, incentives = retention rate  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.694444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/reuptaken",
                    "index": "#17",
                    "likes": "1",
                    "time": "14/04/2021-13:28:39",
                    "content": "    flipflopflapdelegate:  Lucky you!   On the downside every day I see posts about “taxes” like there’s only one country in the world, it’s not even worth mentioning its name, and everybody should know its tax rules. End of rant. This was just an idea, worth considering in my opinion, not to be implemented right away. I think it would be suboptimal if there is be some gap between people who hold MKR and vote and people who also do important job here on forum, so the concept was that giving MKR to them will enable them to vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.418650793650793
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#18",
                    "likes": "4",
                    "time": "14/04/2021-13:36:47",
                    "content": "    flipflopflapdelegate:  RETAIN the community participation   Retain and expand! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#19",
                    "likes": "2",
                    "time": "14/04/2021-15:55:05",
                    "content": "I voted YES because I think it is important to compensate people for their time and valuable contributions. Even though I have been working way more overtime the past 3 months I have made it a point to continue to check in on this protocol and it is partly because of the SourceCred. I have completely stopped following other protocols like Yearn because I simply do not have the time and it will not produce any rewards. So, yes incentives matter and I think we can grow this community a lot more by increasing the rewards and possibly adding Discord. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#20",
                    "likes": "7",
                    "time": "14/04/2021-16:35:42",
                    "content": "I voted yes!     prose11:  SourceCred was the thing that took my interest in Maker from a intellectual curiosity to an incentivized reason to come back everyday,   I have a very similar story. It’s mostly psychological in my opinion. I get sense of “reward” from the Cred payments, well beyond the monetary value. In my case, it has significantly strengthen my feeling of “belonging to the MKR community” in a productive way. I hope others can be attracted by MakerDAO for a similar reason!     reuptaken:  I think that (I’m not sure if this is technically possible) MKR should be used, not DAI   I am not sure. I personally use(d) most of my Cred rewards to pay gas, honestly, or to experiment with other DeFi things. When I have an expensive transaction (like setting up a voting proxy, or voting, or other things), I now think: “well, I pay the tx-fees with the Sourcecred rewards” and I feel better  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.24264705882353
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#21",
                    "likes": "2",
                    "time": "14/04/2021-17:03:28",
                    "content": "Voted yes because I think having expanded SC helps generally. I take mine to do various things but one of them is to buy ETH to cover gas costs on voting.  So I get to pay taxes on income just to drop kick it back to miners to vote.   SC rewards not really enough to buy MKR and then pay fees to stuff it into governance. One thing I would like to see be done is to perhaps make these SC and other DAI payments on a sidechain like xDAI or at least an opt in to payments on X side chain choice.   Not entirely sure what SC costs/month in ETH to distribute and whether that would compare to bridging and distributing but as L1 costs continue to increase something to think about.    This would also allow for a lower barrier to distribution and possibly higher participation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.765625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#22",
                    "likes": "5",
                    "time": "14/04/2021-17:07:21",
                    "content": "Question: Does this approval eventually require an on-chain poll? Given that we on the forum are the ones receiving most of the SourceCred, there is also clearly going to be bias in this off-chain poll. I still don’t quite find this spending justified to be honest because the “control” experiment of how good the community would be without SourceCred doesn’t exist. I also have not seen this level of spending to increase community engagement in any other mainstream crypto project. Admittedly, it’s not easy to figure out what is appropriate here but the conflict of interest here is very hard to ignore.     iammeeoh:  When I have an expensive transaction (like setting up a voting proxy, or voting, or other things), I now think: “well, I pay the tx-fees with the Sourcecred rewards” and I feel better    I would imagine it’s a lot better to explicitly reimburse you for such protocol-related actions because those are clearly for the benefit of the protocol. That should of course be unrelated to SourceCred rewards. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.851388888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#23",
                    "likes": "5",
                    "time": "14/04/2021-17:31:44",
                    "content": "    AstronautThis:  there is also clearly going to be bias in this off-chain poll.   Yes, true. In fact I was almost tempted to not vote. Then I saw some other posts and I decided to join and express my vote.     AstronautThis:  Does this approval eventually require an on-chain poll?   It definitely should, since we are talking about money coming from the Maker protocol fees.     AstronautThis:  I still don’t quite find this spending justified to be honest   Yeah I don’t know either. Just as an example, I link below 3 threads were I recently posted. I didn’t post in order to get a reward. But the reward probably helped me decide between “yes, lets’ invest some time to post” and “meh… let’s wait for somebody else to do that”.  A signal request “A16z petition” that is currently being voted onchain An informal poll, like this one, to see if the community wanted Discord. Just answering to a random user who was asking for help.  I don’t know if these were particularly useful. I personally consider them very marginally useful: nothing really important but still better than nothing/apathy. Notes:  everybody could have done the same, it’s just an investment of some forum-time, No skills needed. No responsibilities taken. I definitely write a lot of 100% useless stuff in the forum too.  I think examples like the above are recurrent among all people in the forum who got some Cred over time. ",
                    "links": [
                        "https://forum.makerdao.com/t/informal-poll-discord-chat/7252",
                        "https://forum.makerdao.com/t/using-the-maker-protocol-borrowing-against-collateral/7320"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.532894736842105
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#24",
                    "likes": "2",
                    "time": "14/04/2021-17:37:59",
                    "content": "    iammeeoh:  But the reward probably helped me decide between “yes, lets’ invest some time to post” and “meh… let’s wait for somebody else to do that”.   And here we’re discussing the even more subtle issue of whether a larger/smaller reward would have changed your behavior. So yeah, this is hard. And I dislike conflicts of interest as big as this! Just wanted to get that off my chest! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#25",
                    "likes": "5",
                    "time": "14/04/2021-17:38:23",
                    "content": "I mean, we could also just ask CUs if there are any tasks they’ll grant a bounty on, if we’re looking for value beyond a minimum level of engagement. Not everyone wants a day job with a CU, but still be willing to get involved in marketing/growth/outreach/minor coding/whatever. Obviously not every CU has one-off tasks to do that for, but would allow for more gradation of involvement for those who want to get their hands dirty but not try to get employed by the DAO. Anyway, just a reminder that SC doesn’t have to be the only way to get involvement ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.026785714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#26",
                    "likes": "3",
                    "time": "14/04/2021-20:37:13",
                    "content": "    AstronautThis:  I still don’t quite find this spending justified to be honest because the “control” experiment of how good the community would be without SourceCred doesn’t exist.   I agree with this.   For example we could also vote to cease SC rewards altogether for the next 1-3 months and see if it changes community engagement at all.    I have limited my own engagement here for a number of reasons.  Upping SC rewards won’t get more, and decreasing them may only get marginally less.   I am here because I have vested interests, both owning MKR, and also having a vault with significant capital, and DAI.    I also am convinced the way Maker goes (if there is some bad event) it will take the whole DeFI ecosystem for what could be a terrible ride.   So I am not just here for my own vested interests but to help support the entire crypto ecosystem. Honestly come to think that while discussion and input (particularly from people with significant experience) have value, over time it looks like implementation has a much higher value than input with experience.   It is very easy to see people like @hexonaut or @Primoz  who take ideas and put them into code are 10x more valuable than anyone else imo. SC rewards probably are not going to get us more implementations, and likely only gets Maker more ideas that it can’t easily implement.   Which is a reason ‘not’ to increase SC rewards, and to take that money to hire more smart contract coders, debuggers, auditors, etc.    20K DAI/month more than sufficient to hire 1 very experienced smart contract writer, or experienced auditor and I honestly think we need that more than 20x voices in forums bantering ideas around. Fortunately or unfortunately governance is a plurality of voices vs. a few so these choices are made as a collective. As to:     AstronautThis:  I would imagine it’s a lot better to explicitly reimburse you for such protocol-related actions because those are clearly for the benefit of the protocol. That should of course be unrelated to SourceCred rewards.   One thing that I think is interesting with respect to increasing SC rewards is an idea that people posting here should also have some minimum MKR stake, and governance participation as a kind of multiplier regarding rewards in general (SC, governance, etc.). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.345691609977324
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#27",
                    "likes": "2",
                    "time": "14/04/2021-21:59:40",
                    "content": "    iammeeoh:  I don’t know if these were particularly useful.   Sir, the “A16Z petition” letter is priceless.     iammeeoh:  everybody could have done the same, it’s just an investment of some forum-time   I disagree here sir. You have to have PASSION in order to eat, sleep, and dream all-things MakerDAO. And you got it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#28",
                    "likes": "2",
                    "time": "15/04/2021-03:38:59",
                    "content": "Nearly everything you say has me nodding in agreement. For those who have voted yes, I know where you are coming from and it is with the right intentions to grow our community and produce ideas for MakerDAO but please consider if doubling source cred payments is indeed the best way to do that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.309523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#29",
                    "likes": "0",
                    "time": "15/04/2021-03:49:08",
                    "content": "Is it true that we are currently underrewarding the type of work that happens in the forums? There is certainly some very important work that happens in the forums (like risk analysis and new MIPS) but I am not sure those are proportionately rewarded by SourceCred. Unilaterally increasing SC rewards will mean we get more of what we already get, which is mostly opinionated discussion. If that is what we want then so be it, but more opinionated discussion on its own does not result in consensus. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.940895562770563
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#30",
                    "likes": "2",
                    "time": "15/04/2021-03:49:11",
                    "content": "    AstronautThis:  For those who have voted yes, I know where you are coming from and it is with the right intentions to grow our community and produce ideas for MakerDAO but please consider if doubling source cred payments is indeed the best way to do that   Honestly your comments and my own thinking make me wonder if this poll should also include reducing or eliminate rewards as I think that is just as valid a test as doubling them.   One thing we already doubled rewards and it is my own impression that there wasn’t too much change.  We do have some new posters here like yourself @AstronautThis with new views and input which is appreciated, but I think a general poll as to why people post here might be in order.  I mean honestly rather than just increase rewards hoping for more participation (what does that mean really in terms of community growth - support - actual change) perhaps a view towards what the real community goals are? Do we want more participation by people who own and vote MKR in governance?  Do we just want more forum posts?  Perhaps we just want more people around who might be able to do work or to be hired?  Or maybe we just want to focus on the tasks at hand that still need to be done? These all seem to be valid topics of discussion.   What I am wondering is if we got a report on whether the last doubling of SC rewards really made a measurable change in ‘participation’ and what that means for the goals of the community? I think I am going to have to switch my vote to abstain because of the questions above. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.496688311688312
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#31",
                    "likes": "0",
                    "time": "15/04/2021-04:44:26",
                    "content": "    MakerMan:  I think a general poll as to why people post here might be in order. I mean honestly rather than just increase rewards hoping for more participation (what does that mean really in terms of community growth - support - actual change) perhaps a view towards what the real community goals are?   I’m happy to be involved in how to frame that discussion. However, if that discussion takes place on the forum or mostly involves people from the forum, then many participants in that discussion (myself included) will have a conflict of interest.     MakerMan:  Do we just want more forum posts?   At the moment, I think SourceCred is set up such that this is rewarded. If we use forum post count as a metric of participation, it will indeed look like a success but I don’t know if that is the right metric to chase. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.270238095238096
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#32",
                    "likes": "1",
                    "time": "15/04/2021-09:58:31",
                    "content": "Voted no despite being on the top10 sourcecred payouts in the last months. Reason: I don’t feel I have been contributing that much to the forum, mostly doing chores like taking care of DCs, signaling and working in the Rates Group / MakerDao Open Market Committee. I always feel a bit dirty when I receive my payouts. Imho we should rather do more with grants or put people on the payroll of CUs (like Risk and Governance is already doing it) than just using an algorithm to pay people. This can (and will be!) easily gamed and having more SourceCred payments is just increasing this risk. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.036458333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#33",
                    "likes": "2",
                    "time": "15/04/2021-10:16:34",
                    "content": "in my eyes, sourcecred can and should be continually “tweaked” to incentivize different behavior and types of posts… e.g. we could consider to compensate Signal Requests from community members that have “cred”. etc… we are just starting the exponential phase of maker… we need the community to grow … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#34",
                    "likes": "6",
                    "time": "15/04/2021-10:50:18",
                    "content": "I’m voting ‘Abstain’. As a word of context, I believe the aim of SourceCred is to incentivize quality governance participation that is ‘unbacked’ by MKR in one’s wallet. It’s supposed to encourage new/potential members of the community to go through oftentimes-tiring process of familiarizing oneself with the forum. The DAO is only as strong as our off-chain & on-chain governance communities, and so with the barrier of entry so steep, a person’s effort to participate should be rewarded. It is my long-term view that SourceCred should serve off-chain governance in a similar way that Staking Rewards serve on-chain governance. Practically-speaking, it should seek to incentivize and reward an expertise-driven culture, where quality input is appreciated. I’ve been running ‘SourceCred Outreach’ for over a month now. Its aim is to identify promising community members and point them towards SourceCred. Now, whether they see the resulting DAI as a small gesture of appreciation (most likely) or it actually improves their financial situation, I believe it might have played a role in encouraging several of our outstanding new contributors, e.g., @Aes, @PaperImperium or @aburban90. From my experience, I believe the community-building aspect of SourceCred is just as important in the long run as any financial payouts. For this reason, I’m not stressed about increasing the payouts as the outcomes are positive regardless of that. One important factor speaking against an increase is the rising incentive to game the system. As much as we’re prepared to handle additional moderation duties, the relatively-lower payouts are a natural defense against manipulations of the system and/or damage to merit-driven discussion culture. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.618326118326118
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#35",
                    "likes": "0",
                    "time": "15/04/2021-12:48:17",
                    "content": "I voted ‘Abstain’ as well. I think sourcecred is a fine program, but maybe it should be limited to a year or so per participant? EDIT: I have changed my mind (and vote) after reading other people’ s comments. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.367063492063492
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#36",
                    "likes": "7",
                    "time": "15/04/2021-13:34:20",
                    "content": "    ultraschuppi:  Reason: I don’t feel I have been contributing that much to the forum, mostly doing chores like taking care of DCs, signaling and working in the Rates Group / MakerDao Open Market Committee. I always feel a bit dirty when I receive my payouts.   I don’t think you should discredit yourself. It’s because of people like you and the other Community Members that I wake up every morning and the first thing I check is this Forum and the Maker Rocket Chat. Every bit of your participating helps shape & build this DAO. So, I believe you deserve every DAI and Conti that you have earned via SourceCred. You should check out other Community Forums that don’t incentivize their communities. Pretty much ghost towns… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.305555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#37",
                    "likes": "8",
                    "time": "15/04/2021-13:56:48",
                    "content": "Huge  here. I might be as bold as to add that you may not be considering how valuable your input is here @ultraschuppi ! Even if you discount the (extremely) valid points Frank brings up, the “chores” you do for governance are part of what keep this efficient machine running. How much unpaid labor do you think you were doing before SourceCred? As much as we rely on MKR holders being incentivized to set good governance, without real people putting in tangible work the rocketship never takes off. For some prospective we currently spend less than 350,000 DAI on SourceCred per year. Without pointing to any Core Units, it’s fair to say that would be a minimal personnel expense (would be right around 3 facilitators in the GovAlpha budget). For that small expense we not only bring in new voices and opinions to the DAO, but also get the chance to say thank you and give back to dedicated community members that would be out here giving their time anyway. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.81158685064935
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#38",
                    "likes": "3",
                    "time": "15/04/2021-14:02:00",
                    "content": "    flipflopflapdelegate:  It’s because of people like you and the other Community Members that I wake up every morning and the first thing I check is this Forum and the Maker Rocket Chat. Every bit of your participating helps shape & build this DAO.   100% THIS! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#39",
                    "likes": "6",
                    "time": "15/04/2021-14:04:10",
                    "content": "    prose11:  For some prospective we currently spend less than 350,000 DAI on SourceCred per year. Without pointing to any Core Units, it’s fair to say that would be a minimal personnel expense (would be right around 3 facilitators in the GovAlpha budget). For that small expense we not only bring in new voices and opinions to the DAO, but also get the chance to say thank you and give back to dedicated community members that would be out here giving their time anyway.   It is what large organizations spend on their office supplies. Bang for the buck, I  personally believe it help bring new ideas. With what is coming in 2022, we will want to attract the next round of community members! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2521645021645025
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#40",
                    "likes": "6",
                    "time": "15/04/2021-15:27:39",
                    "content": "Right now, it feels like there’s a pool to be distributed about the participants. (Am I right on this one?) If the participants grow in a given month, the Dai received by each will diminish. Why are we aligning rewards in this zero-sum game? We want people to tell their friends to come, not the opposite. Should we not try to find a Cred baseline and assign it a certain amount of Dai, and if more people are participating, we give out more Dai (and vice-versa)? Exempli Gratia: in a “quiet” month, we might give out a total of 3k Dai; if the next month we triple the activity, we might give away a total of 9k Dai (we should cap it at some number to avoid Governance Alpha going bankrupt). I’m not sure if it’s possible to tweak the algorithm to do this. Unless my premise was wrong, in which case I’ll see myself out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2270408163265305
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#41",
                    "likes": "0",
                    "time": "15/04/2021-15:32:55",
                    "content": "An excellent point, especially considering we want to be growing to pay more contributors all the time! Practically, it’s super easy to input different distribution numbers in the SourceCred instance. Budgeting might be a concern though, as currently it’s up to the GovAlpha budget to support SourceCred so increases to payouts would necessitate a bigger distribution to the Core Unit. I wonder if there’s a way to automate the size, otherwise maybe a Parameter Proposals Group might be reasonable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.439814814814815
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#42",
                    "likes": "2",
                    "time": "15/04/2021-15:35:07",
                    "content": "    prose11:  increases to payouts would necessitate a bigger distribution to the Core Unit   Well, some people are arguing that they’re receiving too much. I think it’s just about finding the right number (I’m making it sound easy so someone tries, but, shhh, it’s a trap). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.015873015873016
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s_ben",
                    "index": "#43",
                    "likes": "3",
                    "time": "15/04/2021-20:56:38",
                    "content": "Voted Abstain for obvious reasons (I administer Maker’s SC instance). Such an interesting thread! Loving all the intelligent discoruse  Composing a mega comment now that addresses all the things. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.025
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#44",
                    "likes": "1",
                    "time": "16/04/2021-01:47:45",
                    "content": "Give credit where credit is due.  Quality posts are valuable and should be rewarded to the fullest extent the DAO is able.  This community has so many bright minds.  I love reading the forums to see all the dialogue every couple days. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.075
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s_ben",
                    "index": "#45",
                    "likes": "5",
                    "time": "16/04/2021-08:57:53",
                    "content": "Voted Abstain for obvious reasons (I administer Maker’s SC instance). Below is some additional context re: SoruceCred’s relationship with the DAO, as it relates to this change, as well as inline responses to objections and proposed ideas. SourceCred Working Group → GovAlpha CU SourceCred has been receiving a 5k DAI/mo dev grant from the Foundation for prioritized support and development of new features. This grant program was sunsetted at the end of March. So, as @LongForWisdom mentioned, the GovAlpha Core Unit (CU) has taken over paying SourceCred. For transparency, while we have not yet implemented it, SourceCred has proposed (and GovAlpha agreed to) switching from the 5k DAI/month flat amount to SourceCred’s preferred tithing model (used by SourceCred’s other partners), whereby SourceCred receives 5% of the Cred and DAI distributed. In addition, I will be paid 2k DAI/month to continue providing priority support for Maker’s instance, as well as opting myself into payouts, as is standard practice in SourceCred’s other partner communities. At current distribution levels (~20k DAI/mo), Maker would be paying roughly ~2,500 less per month than under the previous arrangement. If distribution was doubled to ~40k DAI, month, SourceCred’s tithe would equal ~2k DAI/mo, and total cost would likely be around 4.5-5k DAI/mo. While there is some potential for conflict of interest here, SourceCred believes the tithe is the best way to align incentives. If Maker decides to increase the payouts, here or on other platforms, its costs will likely increase as well. SourceCred community members contributing in partner communities are paid via SourceCred (and vice versa), and we haven’t seen any issues with that yet. On a personal note, I also requested to be opted into payouts so I would be incentivized to contribute here more. The discourse on here is great, and I’d like to post more on issues related to SourceCred, as well as decentralized governance, etc. Governance of SourceCred parameters Thus far, parameter changes such as increasing the distribution amounts, changing the payout formula, and tweaks to the algorithm have been decided by the SourceCred working group, which is now under the GovAlpha Core Unit (CU). Eventually, the plan is for the governance community to make these decisions.     iammeeoh:      AstronautThis:  Does this approval eventually require an on-chain poll?   It definitely should, since we are talking about money coming from the Maker protocol fees.   Since the budget for SourceCred is currently under the GovAlpha budget, if MKR holders were unhappy with SourceCred, they could defund it. As @prose11 noted, this arrangement limits how quickly we can increase distribution amounts. The Parameter Proposals Group they suggest seems reasonable to me as well. I will leave it to the community and facilitators to determine proper polls, Signal Requests, etc. Gaming     Elihu:  One important factor speaking against an increase is the rising incentive to game the system. As much as we’re prepared to handle additional moderation duties, the relatively-lower payouts are a natural defense against manipulations of the system and/or damage to merit-driven discussion culture.   While this is certainly a concern, I think we could double payouts without too much risk of extra gaming. In part because of mitigation strategies such as trust level-based minting, a feature SourceCred built for Maker, and the 10 DAI minimum to receive on-chain payouts. It is also just very time-consuming for new accounts to begin accruing enough Cred to collude effectively, due to strong moderation on the forum and the high barrier to entry to meaningfully participate in Maker governance . This could be mitigated further if only certain high-context contributions (e.g. governance actions) are paid more. One thing I have seen is an uptick in brand new accounts opting in to SourceCred with no activity or likes. Some of which never post. My guess is they’re fishing for airdrops. However, they never receive on-chain payouts, and those ETH addresses aren’t currently stored anywhere in the instance. Keeping an eye on it. Optimal pay This one is tricky. The Maker community is very diverse. For some the payouts are pocket change, not enough to change behavior. For others, it’s a meaningful, potentially life-changing amount. People also assign different meaning to the payouts. I am a little surprised at people thinking they’re overpaid.     AstronautThis:  I’m relatively new here but I was surprised at how much DAI I received last month. Personally, I think SourceCred overpays casual community members like me. I like posting here and I’m not gonna turn down free money but I’d probably contribute exactly the same way even if I received 10 DAI a month or 100 DAI a month. Small amounts as a thank you gesture are sometimes better. There is a point where the community growth and participation becomes inorganic and it becomes tempting to post without adding real value, just to earn DAI.       ultraschuppi:  Voted no despite being on the top10 sourcecred payouts in the last months. Reason: I don’t feel I have been contributing that much to the forum, mostly doing chores like taking care of DCs, signaling and working in the Rates Group / MakerDao Open Market Committee. I always feel a bit dirty when I receive my payouts. Imho we should rather do more with grants or put people on the payroll of CUs (like Risk and Governance is already doing it) than just using an algorithm to pay people. This can (and will be!) easily gamed and having more SourceCred payments is just increasing this risk.   I have specifically thought @ultraschuppi and @AstronautThis were if anything underpaid   Ultrachuppi because they do governance tasks we want to incentivize generally (MIPS, Signal Requests, etc.). AstronautThis because they’re a newcomer that has been consistently racking up Cred (recruitment is a goal of SourceCred). I think they may be undervaluing their contributions. I do however think a danger of doubling payouts would be to increase the number of people that think they are overpaid. I fear the system loses legitimacy if it is perceived to be way overpaying (which it may well be in some cases). My personal feel is that the amounts are about right for most contributions. However, I think there are contributions and contributors that are underpaid, in which case an increase in payouts could be a useful experiment. SourceCred can be configured to selectively value certain types of contributions higher. Which contributions will depend on what SoruceCred is good at incentivizing (and what it is not), and what the community thinks SourceCred should incentivize more (or less). Headed to sleep here, but returning tomorrow to address ideas around incentives and some valid arguments against an increase. ",
                    "links": [
                        "https://forum.makerdao.com/t/informal-poll-increasing-the-sourcecred-payments/7489/41",
                        "https://forum.makerdao.com/t/mip46-parameter-proposal-groups/6341",
                        "https://github.com/sourcecred/sourcecred/pull/2050"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.583748392308175
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#46",
                    "likes": "4",
                    "time": "16/04/2021-09:21:40",
                    "content": "    s_ben:  Maker would be paying roughly ~2,500 less per month than under the previous arrangement. If distribution was doubled to ~40k DAI, month, SourceCred’s tithe would equal ~2k DAI/mo, and total cost would likely be around 4.5-5k DAI/mo.   I think SourceCred is great, as I commented several times. I express some personal wishes for the future (I know you have been working on some of these, but if the bond between Maker and Sourcecred is increasing, I think it’s ok to ask):  it would be awesome to have more frequent and automatic payouts.  In a world moving to L2/sidechains, it would be nice to be able to receive the payouts in xDAI/arbitrium. In such a space, even daily rewards would make sense. Or even “streaming” of rewards (dreaming). Allow to make “Cred tips”. Often I see amazing posts of others, and I’d like to tip them somehow. I always push the like button, but sometimes I wish I could give more!    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.197916666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#47",
                    "likes": "3",
                    "time": "16/04/2021-13:38:46",
                    "content": "    juan:  We want people to tell their friends to come, not the opposite.   This is exactly what I have been doing with my coworkers to try and get them into crypto/DeFi. SourceCred should be the gateway portal for the future of finance via MakerDAO governance. It is a huge learning curve when you do not even know how the current financial system works. So, I think it is essential to incentivize new users to spend the time to learn the ropes. And after some time getting comfortable with the protocol I am sure they will want to own MKR which is a net positive. SourceCred is not a money-losing scheme, but an investment in the future of this protocol and DeFi more generally. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.957386363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#48",
                    "likes": "3",
                    "time": "16/04/2021-13:50:49",
                    "content": "I couldn’t agree more. I’m arguing that the current model is promoting the exact opposite by being a zero-sum game. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3500000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s_ben",
                    "index": "#49",
                    "likes": "15",
                    "time": "17/04/2021-07:16:26",
                    "content": "Reply continued… Before diving into concerns and ideas, I think it’s useful to ask the question, what goals of the DAO is SourceCred furthering? I’m seeing a number of different perspectives here. Is it a tool to retain and expand the community?     mrabino1:      flipflopflapdelegate:  RETAIN the community participation   Retain and expand!   In my observations of SourceCred in the wild, it does increase engagement. At the end of Maker’s first 3 months trialing SourceCred, engagement metrics were up, as detailed our final report. Below is a chart of Cred over time (a proxy for work) since Maker began using SourceCred in June 2020. While correlation does not equal causation, engagement appears to be on a general uptrend.  image1804×1118 99.4 KB  SourceCred also appears to have been a factor in several community members deepening their committment and taking on more formal roles in the DAO.     prose11:  SourceCred was the thing that took my interest in Maker from a intellectual curiosity to an incentivized reason to come back everyday, and while 5 months later the SourceCred payments don’t matter to me nearly as much as they did at the beginning, it was still a large reason why I was able to take the time to become a paid contributor. Additionally, while the DAI amount is no longer as material to me, every month I still look at my SourceCred payment compared to the previous month. I’m engaging a lot more this month because my last payment was smaller which got me to reflect on how much time I’ve been spending collaborating in meetings rather than publicly on the forum.   I have opted out several community members from payments because they took on paid positions in the Foundation/Core Units, such as @hexonaut, @SebVentures and @juan. Did SourceCred help pull them in? Curious if they have reflections. For some, it provides a sense of belonging.     iammeeoh:  It’s mostly psychological in my opinion. I get sense of “reward” from the Cred payments, well beyond the monetary value. In my case, it has significantly strengthen my feeling of “belonging to the MKR community” in a productive way.   And consistent engagement over time is key to that.     flipflopflapdelegate:  It’s because of people like you and the other Community Members that I wake up every morning and the first thing I check is this Forum and the Maker Rocket Chat. Every bit of your participating helps shape & build this DAO.   Is it a competitive advantage? It seems so.     ejbarraza:  I voted YES because I think it is important to compensate people for their time and valuable contributions. Even though I have been working way more overtime the past 3 months I have made it a point to continue to check in on this protocol and it is partly because of the SourceCred. I have completely stopped following other protocols like Yearn because I simply do not have the time and it will not produce any rewards. So, yes incentives matter and I think we can grow this community a lot more by increasing the rewards and possibly adding Discord.   I have seen similar anecdotal evidence elsewhere. Not just in communities using SourceCred, but also on Reddit subs I frequent, such as r/ethtrader and r/CryptoCurrency, which are distributing ERC-20s based on karma (a reputation system similar to SourceCred in some ways). I regularly see people on these subs report that they spend more time posting there because they can get paid, at the expense of subs that don’t pay. I asked to be opted in, in part because I could feel the opportunity cost, and want to be incentivized to post more. Does it advance specific goals of the DAO? Here, it appears there is room for improvement.     zenithlight:  Is it true that we are currently underrewarding the type of work that happens in the forums? There is certainly some very important work that happens in the forums (like risk analysis and new MIPS) but I am not sure those are proportionately rewarded by SourceCred. Unilaterally increasing SC rewards will mean we get more of what we already get, which is mostly opinionated discussion. If that is what we want then so be it, but more opinionated discussion on its own does not result in consensus.   Even a contributor doing actions we’re looking to incentivize is skeptical.     ultraschuppi:  Voted no despite being on the top10 sourcecred payouts in the last months. Reason: I don’t feel I have been contributing that much to the forum, mostly doing chores like taking care of DCs, signaling and working in the Rates Group / MakerDao Open Market Committee. I always feel a bit dirty when I receive my payouts. Imho we should rather do more with grants or put people on the payroll of CUs (like Risk and Governance is already doing it) than just using an algorithm to pay people. This can (and will be!) easily gamed and having more SourceCred payments is just increasing this risk.   I would argue that community for its own sake is valuable. Indeed, in the rapidly evolving DeFi space, community is increasingly viewed as a competitive moat. Anyone can fork a protocol and offer financial incentives. If all you offer is yield farming, you can always be outbid. It’s very difficult to fork real community. Also, I’ve noticed that this forum has become something of a ‘stage’. It’s well trafficed. Crypto famous occasionally drop in to opine. Reporters are here. I’ve seen Cointelegrah articles in recent months that were clearly just a recap of a post here. That is presumably good for Maker’s brand. Is it just the morally correct thing to do?     FourthStreet:  Give credit where credit is due. Quality posts are valuable and should be rewarded to the fullest extent the DAO is able. This community has so many bright minds. I love reading the forums to see all the dialogue every couple days.   I’ll leave it for the reader to decide (there are good arguments against paying too). However, I do see a general desire among crypto projects to reward its community members, especially when large sums of money are being made. And there aren’t any mechanisms I know of that are as credibly neutral or automated as SourceCred. In summary, I think SourceCred is all of these things and more. It’s expressive enough to capture a lot complexity and nuance, even with its blind spots. Sometimes I wonder if SourceCred is just automating Maker’s internal political economy   image494×566 69.5 KB  However, SourceCred is still relatively young, and has downsides and risks as well. I also think Maker has created a very unique, strong community (could do a whole separate post on that), and don’t want SourceCred to interfere with that, only strengthen and grow it. I would recommend Maker moving “at the speed of trust”, as we’re fond of saying in SourceCred. Below I address some concerns and ideas, in the spirit of that  Concerns     MakerMan:  Upping SC rewards won’t get more, and decreasing them may only get marginally less. I am here because I have vested interests, both owning MKR, and also having a vault with significant capital, and DAI. I also am convinced the way Maker goes (if there is some bad event) it will take the whole DeFI ecosystem for what could be a terrible ride. So I am not just here for my own vested interests but to help support the entire crypto ecosystem.   @MakerMan is one of the few people I know who has contributed in nearly all of SourceCred’s partner communities, and generally offers valuable insights. I suspect they may be right here. At least if we keep the current configuration. I will say that MakerMan is likely representative of many contributors, but not all.     MakerMan:  I mean honestly rather than just increase rewards hoping for more participation (what does that mean really in terms of community growth - support - actual change) perhaps a view towards what the real community goals are?   Ah, but what are the real community goals? The 100B DAO question. It seems Maker is still figuring this out, via projects like Project Compass. SourceCred is going through a similar process right now actually as it decentralizes. It’s difficult work. Which maybe should be rewarded?     MakerMan:  Honestly come to think that while discussion and input (particularly from people with significant experience) have value, over time it looks like implementation has a much higher value than input with experience. It is very easy to see people like @hexonaut or @Primoz who take ideas and put them into code are 10x more valuable than anyone else imo.   It is certainly true that certain contributors, often devs, can have outsized impacts. However, whether a contributor or contribution is 10x, 100x, or -10x, is typically an individual, subjective judgement. Objective metrics are often worse. SourceCred I think does a good job at capturing the complex, intersubjective reality. However, I do think that currently SourceCred has some blind spots that make valuing (and incentivizing) certain high-value contributions difficult. To increase rewards significantly, I think more customization work may be needed (more thoughts on this coming).     AstronautThis:      MakerMan:  Do we just want more forum posts?   At the moment, I think SourceCred is set up such that this is rewarded. If we use forum post count as a metric of participation, it will indeed look like a success but I don’t know if that is the right metric to chase.   Actually, we used to use posts as a metric, but switched to likes due to initial feedback from Maker–we were seeing contributors with a high volume of low-effort posts get too much Cred. Cred is now minted on likes, then flows through the graph. If you’re curious, here’s a discussion on SourceCred’s discourse about that change. We are encouraging more posts I think, but only to the extent people like them. I haven’t yet noticed significant ‘like inflation’ (the attack vector with this strategy), and the scores are still high quality IMO (open to challenges on this).     AstronautThis:  I still don’t quite find this spending justified to be honest because the “control” experiment of how good the community would be without SourceCred doesn’t exist. I also have not seen this level of spending to increase community engagement in any other mainstream crypto project. Admittedly, it’s not easy to figure out what is appropriate here but the conflict of interest here is very hard to ignore.   We’ve actually tracked an increase in engagement, as explained above. However, we can’t be sure this was caused by SourceCred, and not other factors. I will say we’ve seen increased engagement with other communities as well. I think conflicts of interests can be mitigated by MKR holders ability to defund it. OK, crashing again here  Will be back tomorrow to address some of the proposed ideas, and provide context and some recommendations. ",
                    "links": [
                        "https://www.reddit.com/r/ethtrader/",
                        "https://www.reddit.com/r/CryptoCurrency/",
                        "https://forum.makerdao.com/t/project-compass-dao-vision-setting-working-group/7079",
                        "https://discourse.sourcecred.io/t/minting-discourse-cred-on-likes-not-posts/603"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.727359307359308
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#50",
                    "likes": "4",
                    "time": "17/04/2021-11:19:01",
                    "content": "    s_ben:  @hexonaut, @SebVentures and @juanjuan. Did SourceCred help pull them in? Curious if they have reflections.   I think I speak for the three of us when I say that it didn’t. We were involved (in a way or another) before SourceCred was implemented.     s_ben:  Will be back tomorrow to address some of the proposed ideas, and provide context and some recommendations.   Looking forward to it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#51",
                    "likes": "2",
                    "time": "17/04/2021-15:53:38",
                    "content": "    s_ben:  I would argue that community for its own sake is valuable. Indeed, in the rapidly evolving DeFi space, community is increasingly viewed as a competitive moat.   I could have not written this any better! Thank you Seth for creating this “Forum Post Breakdown” – so cool. You know when I think about it–the SourceCred tool provides an attractive and vindicating user reward, that I really think you and your Team are on to something here. Please keep building and creating–you are changing the game for the end-user. Much appreciated–looking forward to new ideas/recommendations. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.569602272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s_ben",
                    "index": "#52",
                    "likes": "2",
                    "time": "17/04/2021-16:54:53",
                    "content": "Great to hear! And big Thank You to Maker and community members like yourself who took a chance on SourceCred before anyone knew about it, and for being such great partners. It’s had major positive impacts for our community and product. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.741477272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#53",
                    "likes": "8",
                    "time": "17/04/2021-17:40:32",
                    "content": "For me personally and I suspect most others, I signed up and started posting to learn as much about MKR as possible. The community has been incredibly welcoming and patient in helping newer members get up to speed on the complexities of MKR. I hadn’t really heard of SourceCred until you messaged me and my initial reaction was that this must be some sort of scam until I saw your name (how many DMs have we all gotten on other platforms about free money in crypto?). I opted in out of curiosity and didn’t check what payments I had received until recently. After receiving my first payment, I experienced similar feelings to @iammeeoh as to a sense of belonging to the MKR community. As a result, I’ve been spending more time on MKR and less time on other protocols’ forums. If other people are similar, I believe SourceCred is a net positive to the community and protocol as a whole - we want to continue to engage and retain new members of the community and this is an inexpensive way to accomplish that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.92868906455863
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#54",
                    "likes": "2",
                    "time": "18/04/2021-01:19:19",
                    "content": "Can’t thank you enough @s_ben for the time and care it took to construct this reply.  You know I am a supporter of sourceCred but you also know I am a big fan of data.   Nice of you to put the arrow in when SourceCred started.   I remember we doubled the SC rewards once (didn’t that happen?!)   Could you put in an arrow to where we did that? I think @AstronautThis had a valid point wondering if we were maybe at a saturation point where more rewards wouldn’t get much more participation.    Personally I am all for experiments as long as we are willing to try SC rewards down at some point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.996913580246913
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s_ben",
                    "index": "#55",
                    "likes": "9",
                    "time": "18/04/2021-07:57:54",
                    "content": "Reply continued… In the last two replies, I offered thoughts on SoruceCred governance, gaming, and optimal payouts, and the goals of SourceCred and concerns raised. Here, I’ll address some of the proposed ideas, offer context around what is currently possible, and my personal opinions (not official SourceCred opinions). Seeing a lot of relevant concerns and good ideas. Before addressing those, a quick primer on the levers SourceCred exposes:  Tweaking algorithm weights Utilizing features of the Discourse plugin (e.g. the feature SourceCred built for Maker that allows extra Cred to be minted on topics with certain categories and tags) Changes to payout amount (e.g. the last increase back in Nov 2020 from 2.5k DAI/week to 5k DAI/week). Changes to payout formula (e.g. when we changed parameters to make the algorithm more responsive and pay newer contributors more) Education: more knowledge around the algorithm, which may mitigate accidental misalignment, and give the community ideas for further customizations (hopefully this will help )  Payout formula ideas: One thing to keep in mind here is that the GovAlpha CU (which is funding SourceCred) has, afaik, a fixed budget through June.     prose11:  Practically, it’s super easy to input different distribution numbers in the SourceCred instance. Budgeting might be a concern though, as currently it’s up to the GovAlpha budget to support SourceCred so increases to payouts would necessitate a bigger distribution to the Core Unit. I wonder if there’s a way to automate the size, otherwise maybe a Parameter Proposals Group might be reasonable.   DAI vs MKR     reuptaken:  I voted yes, and I think that (I’m not sure if this is technically possible) MKR should be used, not DAI. MKR is the “governance” currency for MakerDAO.   Since the beginning, the community has been split over whether to distribute DAI or MKR. When we surveyed the community for our final report, the split was roughly 50/50:   Do you, or would you prefer to receive MKR through SourceCred rather than DAI?  RESPONSE: (16 responses) 3 for MKR, 3 for DAI, 10 for No Preference, of those No Preference votes 3 advocated for 50/50 allocation, and several references made to leaving it up to users  When this has come up subsequently on the forum, the responses have seemed roughly 50/50 too. Arguments against focus on volatility of payouts, tax concerns, and dilution of MKR. Arguments for MKR generally focus on aligning incentives and increasing governance participation. Also worth noting that deciding how to source the MKR and implement that could be difficult.     prose11:  The price movement of MKR could make this rather difficult, as well as sourcing it @reuptaken.   Personally, I think MKR would be better. While I am sympathetic to the volatility argument, especially for contributors with greater financial needs (indeed, working on SourceCred for me is meaningful largely because it pays those contributors), I think it better aligns incentives. If payouts are increased, I think the argument for MKR becomes stronger, because introducing more volatility may deter those posting solely for the money, which could dilute the culture and mission (more on this later). Working for a volatile governance token is a sign of skin-in-the-game. As would putting it in the hat, which could be detected. There are also ways to mitigate the volatility for those than don’t have the ability to shoulder it. Like pegging to a fixed dollar amount at the time of distribution. Volatility can also, when the price is mooning, catapult contributors into a place of financial security, creating loyalty (psychologically, money earned is valued more than free airdrop money). I have seen this effect firsthand when I working for the Decred DAO for DCR, its governance token. For the time being however, I think the support for DAI and high costs associated with a switch to MKR may keep us on DAI for a while.     reuptaken:  I’m not sure if this is difficult. At the end of the week we could allocate MKR worth eg 10K DAI to participants. But I’d rather set some fixed amount of MKR and update it periodically (eg. 4x a year or so).   So this is basically what 1Hive settled on. 1Hive is currently distributing $20k/week of their governance token (among other uses) HNY, up to 30 HNY. They’ve revisited this several times when a proposal is up to fund SourceCred payouts. The 30 HNY cap I presume is to protect against the token mooning and the rewards being too high, which risks increased gaming; this did happen last year actually during an earlier moon when rewards accidentally skyrocketed to ~$60k/week. SourceCred was able to work with 1Hive (a tithing partner) to mitigate the gaming and build features to protect against it. But would not recommend trial by fire. Previously, I wouldn’t have worried about MKR mooning, but dayum   Dynamic payouts     juan:  Why are we aligning rewards in this zero-sum game? We want people to tell their friends to come, not the opposite.       juan:  Right now, it feels like there’s a pool to be distributed about the participants. (Am I right on this one?) If the participants grow in a given month, the Dai received by each will diminish.   Correct. With a fixed amount, as each new contributor opt ins, the DAI distributed to others diminishes. Indeed, we’ve seen a steady number of optins in the last few months, with a recent uptick due to @Elihu’s outreach efforts. We’re up to 83 now. I have not been particularly concerned about this yet, because of two factors: 1) we have opted out several high Cred earning contributors like yourself, freeing up DAI for newcomers, and 2) a relatively small number of newcomers stick around and earn significant Cred; Maker governance is hard  I also just spot check the balances going out whenever I do payouts, and my gut feel is that most new contributors are being rewarded fairly. Though would love to hear other perspectives on that. Personally, I have been surprised that I haven’t felt that zero sum energy yet. And haven’t heard complaints yet, at least not in the SourceCred community. That does not mean it isn’t there. I’m just one perspective, and this is by definition something people might not speak up about.     juan:  Should we not try to find a Cred baseline and assign it a certain amount of Dai, and if more people are participating, we give out more Dai (and vice-versa)?   I think this would be better from an incentive standpoint. I even wrote a post imagining distribution amounts calibrated using the Bitcoin difficulty algorithm, with Cred functioning as hashpower, or Proof-of-Labor (PoL). Pegging 1 Cred to a set dollar amount has also been proposed for payouts in the SourceCred community. One objection to this is that it incentivizes ‘like inflation’, giving the community a way to increase payouts without increasing value delivered.  Another is that it just makes budgeting more difficult, as would be the case with Maker. Time limited payouts     Planet_X:  I voted ‘Abstain’ as well. I think sourcecred is a fine program, but maybe it should be limited to a year or so per participant?   My initial reaction is no, even though some communities do seem to be discovering SourceCred’s primary utility for them is recruitment. However, I think there could be value in giving people an ability to express their preferences, either explicitly with actions or implicitly with inaction. Perhaps people that completely check out and don’t care could have their DAI/MKR balance displayed or used differently. Perhaps those with more financial resources would be happy to put their balance to work earning yield for contributors with less resources. Just spitballing, but I suspect introducing friction and illiquidity could actually be useful here somehow. Reducing payouts     MakerMan:  Honestly your comments and my own thinking make me wonder if this poll should also include reducing or eliminate rewards as I think that is just as valid a test as doubling them. One thing we already doubled rewards and it is my own impression that there wasn’t too much change.   It would be an interesting experiment. Have not seen a community that started flowing rewards using SoruceCred turn it off. Distribution infrastructure ideas:     MakerMan:  One thing I would like to see be done is to perhaps make these SC and other DAI payments on a sidechain like xDAI or at least an opt in to payments on X side chain choice. Not entirely sure what SC costs/month in ETH to distribute and whether that would compare to bridging and distributing but as L1 costs continue to increase something to think about. This would also allow for a lower barrier to distribution and possibly higher participation.   Our gast costs for the last batch distribution were $470 in ETH  We’ve recently started exploring L2 solutions as part of a larger design to distribute DAI directly from the protocol, but this is at a very early stage, and wary to jump into L2 wars before we have a clearer picture of the engineering limitations.     iammeeoh:  it would be awesome to have more frequent and automatic payouts.   This is on the roadmap:) SourceCred doesn’t have an actual roadmap yet, but we’re looking to start work on this in the next month or two. Likely starting on mainnet though, and gas costs could limit frequency.     iammeeoh:  In a world moving to L2/sidechains, it would be nice to be able to receive the payouts in xDAI/arbitrium. In such a space, even daily rewards would make sense. Or even “streaming” of rewards (dreaming).   Obsessed with streaming payments. Sablier was a Maker dev gran recipient, which is pretty cool. I know Superfluid is on xDAI now as well and doing interesting things. The main concern there (aside from smart contract dev bandwidth) is security. Currently, a human (typically me) has a chance to review Cred scores and payouts before sending them out. This provides and opportunity to catch gaming. With real-time streaming payments, and distributing large amounts, a gamer could potentially siphon off a lot of money before being detected. Not only that, it would make gaming into a hella fun game  Which is partially why I want to see it. But Maker is maybe not the best place to try it first. Algorithm tweaks     prose11:  One interesting idea is that you can always run “one-time” data sets via the SourceCred algorithm where you apply a special waiting (maybe we boost all posts in the Governance category for instance) and do a distribution from those numbers.   Creating separate one-time Cred instances could be easier operationally actually. I kind of like this idea. Programming different goals into a single instance can be tricky, as it’s more difficult to evaluate the desired outcomes in the scores. We’re currently investigating using the category and tags minting feature developed for Maker to incentivize governance actions. This will allow us to apply a multiplier on Cred minted on topics with a given category or tag. The has been delayed due to some unexpected quirks in Cred flows in simulations, and a recent upgrade of the core algorithm. Hoping to present the SourceCred working group with some options on this soon.     mrabino1:  in my eyes, sourcecred can and should be continually “tweaked” to incentivize different behavior and types of posts… e.g. we could consider to compensate Signal Requests from community members that have “cred”. etc… we are just starting the exponential phase of maker… we need the community to grow …   This is the way. I wonder though what the optimal (and sustainable) growth curve is for the community. Is the growth prediction @Planet_X made in the post that started it all coming true?  image1256×712 25.7 KB  Does the Maker governance community have the bandwidth right now to onboard new contributors, execute on its larger decentralization plans, Core Units, etc. and create a governance process around changing SourceCred parameters? To be honest, I hesitate to bring all this up, as I know from experience how much work it can be, and I know there’s a lot of other important priorities right now competing for scarce attention      MakerMan:  One thing that I think is interesting with respect to increasing SC rewards is an idea that people posting here should also have some minimum MKR stake, and governance participation as a kind of multiplier regarding rewards in general (SC, governance, etc.).   This could be happening weakly already due to the badges? Do people engage more with those with lots of badges? There is precident for this from different angles. The Friends With Benefits (FWB) community, which was running SourceCred, required I believe 3 FWB tokens to get into their Discord and get Cred and FWB distributions using SourceCred? (cc: @Cooopahtroopa). 1Hive I believe requires that you have 1 HNY to have a certain role on their Discord, which allows your reactions to mint more Cred. MetaGame gates their community (and therefore Cred) according to consistent activity OR holding a certain amount of their token, SEED. These implementations though are either gating comms platforms, or giving people with certain roles more power to influence the Cred graph. I can’t think of a community using SourceCred that has tied governance actions directly to Cred issuance (though it could totally exist). One interesting comparison is a recent proposal on r/CryptoCurrenty  to distribute 20% more MOONs (the ERC-20 they distribute according to karma) to users that keep their MOONs in their Reddit Valut, where tokens have to be to vote on governance changes in the sub (i.e. their hat). Karma is a reputation score similar to SourceCred in some ways. Reddit and Discourse are both forums. Could be good lessons there. As a side note, have been impressed with the ability of these subs to govern their tokens and communities. Makes me bullish on the idea. In summary, I think Maker could double payouts safely. I think any gaming could be addressed. But personally (again, not an official SourceCred position), I’m a bit hesitant though because of a few factors: 1) we could be overpaying for some contributions, which may have unexpected negative effects, such as delegitimizing the scores or creating unrealistic expectations, 2) we may see more contributors contributing just for money, which could affect cohesion during a sensitive transition period for the DAO, 3) we currently don’t yet have a governance process for the community to reach consensus on protocol changes, and 4) the current budget for SourceCred has been approved through July. I think increasing payouts will be more feasible once we gather more feedback, gain the ability to target certain contributions we think are undervalued (e.g. through category and tag weighting), and have more clarity around governance issues and the community’s goals. PHEW, Great thread! ",
                    "links": [
                        "https://forum.makerdao.com/t/informal-poll-increasing-the-sourcecred-payments/7489/49",
                        "https://www.youtube.com/watch?v=Br49AirqJDs&t=9s",
                        "https://forum.makerdao.com/t/increasing-sourcecred-payouts/5217",
                        "https://forum.makerdao.com/t/changes-to-our-implementation-of-sourcecred/6115",
                        "https://forum.makerdao.com/t/mip46-parameter-proposal-groups/6341",
                        "https://forum.makerdao.com/t/sourcecred-trial-final-report/4569",
                        "https://forum.1hive.org/t/pollen-distribution-period-starting-april-12/3415",
                        "https://discourse.sourcecred.io/t/sourcecred-as-store-of-community-value-socv/129",
                        "https://github.com/sourcecred/sourcecred/releases/tag/v0.7.5",
                        "https://discourse.sourcecred.io/t/credrank-scalable-interpretable-flexible-attribution/654",
                        "https://forum.makerdao.com/t/maker-governance-overhead/1129",
                        "https://www.reddit.com/r/CryptoCurrency/comments/kj2ij0/poll_bonus_karma_for_people_that_keep_moons_in/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.763776322976089
                },
                {
                    "author_link": "https://forum.makerdao.com/u/reuptaken",
                    "index": "#56",
                    "likes": "4",
                    "time": "18/04/2021-09:05:35",
                    "content": "The biggest flaw of the SourceCred is that my two sentence top of my head comments get similar rewards to posts like this. It should be remunerated with 100x more DAI (or, preferably, MKR ;-)) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#57",
                    "likes": "1",
                    "time": "18/04/2021-12:11:38",
                    "content": "This definitely can be true, however one interesting thing I’ve noticed about myself is that when I’d doing research or browsing topics on the forum by checking out older posts, it’s the longer posts that I’ll add a like to because they are often more helpful in articulating the situation. Compared to “real time” forum browsing where I tend to be a lot more generous with my likes. I do think the “like” model rewards complimentary posts more than critical ones, but I’ve done some reflection and realized that a lot of what keeps me going is the words of encouragement from the community, and it’s likely that the “care work” of building each other up is way undervalued by the DAO at the moment. But to get back on topic: Since SourceCred is always updating with new likes, it’s my theory (based on my personal bias) that while detailed posts seem to underperform in the short term, their value lasts a lot longer and I suspect that means a lot more impact through the life of the program. For example, the next time we talk about SourceCred this thread will likely be linked and I suspect @s_ben will get a little closer to the amount of likes he “deserves” for all this detailed explanation. That’s one of the coolest things about SourceCred for me, it’s designed to try to capture the shifting value of contributions over time! Though we could just start it off right by giving the posts a little more love  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.026681651681651
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#58",
                    "likes": "7",
                    "time": "18/04/2021-17:16:49",
                    "content": "Thank you @s_ben for the huge amount of data in your posts.     s_ben:  Below is a chart of Cred over time (a proxy for work) since Maker began using SourceCred in June 2020. While correlation does not equal causation, engagement appears to be on a general uptrend.   I think that this piece of data is not really sufficient, if we look at it critically. The crypto bull run is here and we will see more engagement over this period, simply because more people hold MKR, the token value is rising and that will interest people. Our evidence is more anecdotal at best.     s_ben:  I have seen similar anecdotal evidence elsewhere. Not just in communities using SourceCred, but also on Reddit subs I frequent, such as r/ethtrader and r/CryptoCurrency, which are distributing ERC-20s based on karma   To be honest, r/ethtrader became a cesspit of troll posts and spam after their move to monetize karma. The subreddit broke into two communities and the new community r/ethfinance which specifically does not monetize karma is much much better community. Please check both out right now and make your own conclusions on which community is better. The split of that subreddit is a very good counterexample to the things being claimed here and is the closest we will get to an experiment with a good control! Moreover, the same thing happened with r/cryptocurrency. Moons resulted in a significant lowering of the quality of discussion there. SourceCred is still “under the radar” but when word gets out, I guarantee you’ll see the same issue here.     juan:  I think I speak for the three of us when I say that it didn’t. We were involved (in a way or another) before SourceCred was implemented.   I think this cannot be emphasized enough. The altruistic posters here - the ones who post with no expectation of reward except the growth and betterment of the Maker protocol - are always gonna be the ones that carry the community.     MakerMan:  wondering if we were maybe at a saturation point where more rewards wouldn’t get much more participation. Personally I am all for experiments as long as we are willing to try SC rewards down at some point.   I would think that this is far more important to try to check if SourceCred is resulting in higher quality discussion here before doubling it. Finally, I will say that talk is actually cheap. As @MakerMan pointed out, it’s easy to throw out great ideas on the forum. The hard work is implementing that as an MIP, for example. As long as our core protocol is doing well, I doubt we’ll ever have a shortage of ideas, talk and banter on the forum, even if there was no SourceCred rewards at all. If that sounds plausible to you, then we should be asking if this is the right moment to be voting to double rewards. ",
                    "links": [
                        "https://www.reddit.com/r/CryptoCurrency/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375443558966286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#59",
                    "likes": "0",
                    "time": "29/04/2021-03:57:33",
                    "content": "the poll has closed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s_ben",
                    "index": "#60",
                    "likes": "5",
                    "time": "29/04/2021-07:47:19",
                    "content": "    AstronautThis:      s_ben:  I have seen similar anecdotal evidence elsewhere. Not just in communities using SourceCred, but also on Reddit subs I frequent, such as r/ethtrader and r/CryptoCurrency, which are distributing ERC-20s based on karma   To be honest, r/ethtrader became a cesspit of troll posts and spam after their move to monetize karma. The subreddit broke into two communities and the new community r/ethfinance which specifically does not monetize karma is much much better community. Please check both out right now and make your own conclusions on which community is better. The split of that subreddit is a very good counterexample to the things being claimed here and is the closest we will get to an experiment with a good control!   So I just looked at r/ethtrader and r/CryptoCurrency. What I saw was lots of high-quality posts, people talking about how amazing it is to be paid for creating content for a change, posts about people in developing countries getting life-changing payday posting, etc. I also see the occasional posts complaining it’s ruining the sub, but my eyes generally glaze over those. I suspect we’re both experiencing some confirmation bias.     AstronautThis:  I would think that this is far more important to try to check if SourceCred is resulting in higher quality discussion here before doubling it.   Unfortunately, quality is a subjective judgement. Would love to see any attempts at rigorous analysis of quality, sentiment, etc. in these systems.     AstronautThis:  Finally, I will say that talk is actually cheap. As @MakerMan pointed out, it’s easy to throw out great ideas on the forum. The hard work is implementing that as an MIP, for example. As long as our core protocol is doing well, I doubt we’ll ever have a shortage of ideas, talk and banter on the forum, even if there was no SourceCred rewards at all. If that sounds plausible to you,   Truth. Increasing Cred scores for contributions related to implemented ideas is something we’re looking at now. Would be curious to hear any ideas you have around that. For instance, what is your definition of implemented? Only things traceable to passed executives? More general implementations, such as organizational changes, communications, changes to Discourse or rocketchat, changes to SourceCred? ",
                    "links": [
                        "https://www.reddit.com/r/CryptoCurrency/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.310415846779484
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s_ben",
                    "index": "#61",
                    "likes": "3",
                    "time": "29/04/2021-08:09:32",
                    "content": "    prose11:  I do think the “like” model rewards complimentary posts more than critical ones, but I’ve done some reflection and realized that a lot of what keeps me going is the words of encouragement from the community, and it’s likely that the “care work” of building each other up is way undervalued by the DAO at the moment.   I’ve noticed this as well. If I post late at night (e.g. now), I’m likely to get fewer likes. I think there is value to those ‘real-time’ likes though. Keeps the momentum of the conversation going, gives the posters more granular feedback, and strengthens social ties. Is this value over credited? Perhaps…     prose11:  Since SourceCred is always updating with new likes, it’s my theory (based on my personal bias) that while detailed posts seem to underperform in the short term, their value lasts a lot longer and I suspect that means a lot more impact through the life of the program. For example, the next time we talk about SourceCred this thread will likely be linked and I suspect @s_ben will get a little closer to the amount of likes he “deserves” for all this detailed explanation. That’s one of the coolest things about SourceCred for me, it’s designed to try to capture the shifting value of contributions over time! Though we could just start it off right by giving the posts a little more love    So this topic was just referenced for the first time in another thread, flowing everyone here a little more Cred, including myself   I’ve definitely observed, here and in SourceCred (the project) that valuable posts do collect additional likes over time. Though often it’s just a trickle… Better incentivizing retroactive revaluation is something we’ve identified as an issue and are working on. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.818131713965046
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#62",
                    "likes": "3",
                    "time": "29/04/2021-10:21:17",
                    "content": "    s_ben:  So I just looked at r/ethtrader   Just out of interest, have you checked out r/ethfinance? r/ethtrader split into two because of donuts being monetized (there’s a weird sentence if you don’t know what’s going on!) and r/ethfinance is the non-paying sub that was born out of that split. You’re right though that there’s probably some confirmation bias involved on my side and subjectivity in measuring quality but in any case, it’s one point to keep in mind.     s_ben:  Would be curious to hear any ideas you have around that.   I’ll definitely have a think and try to pitch in. Your critera actually do sound nice and it’s indeed the right spirit of things but implementing that is the hard part! Basically, I like that we have threads with memes and the odd lighthearted banter (and it really is great for the community) but it would be great if those who do serious work before a post (e.g. an MIP) get a substantially larger share than the others. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.608402014652015
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s_ben",
                    "index": "#63",
                    "likes": "4",
                    "time": "30/04/2021-00:50:24",
                    "content": "    AstronautThis:  Just out of interest, have you checked out r/ethfinance? r/ethtrader split into two because of donuts being monetized (there’s a weird sentence if you don’t know what’s going on!) and r/ethfinance is the non-paying sub that was born out of that split.   Yeah, know r/ethfinance somewhat. Though wasn’t really part of that community when the split went down. I wrote up a case study on donuts in comparison to SourceCred, which gives a brief (perhaps biased ) history of the sub, donuts and the community reaction to them. r/cslarson (main r/ethtrader mod, who was tinkering with SourceCred in its earliest incarnation) responded in the comments with some interesting discussion around donut tokenomics and governance. Aside from r/ethtrader getting more noobs during the bull run, and donut governance posts, it seems r/ethfinance content is very similar. But admittedly, my focus on reputation systems and governance narrows my lens.     AstronautThis:  I’ll definitely have a think and try to pitch in. Your critera actually do sound nice and it’s indeed the right spirit of things but implementing that is the hard part! Basically, I like that we have threads with memes and the odd lighthearted banter (and it really is great for the community) but it would be great if those who do serious work before a post (e.g. an MIP) get a substantially larger share than the others.   Tbh, glad to see the memes here getting Cred. Also happy it’s not getting out of control like it is on r/ethtrader and r/CryptoCurrency. Half their governance votes have been on ideas to keep meme rewards in check. Looking forward to experimenting with increasing rewards for ‘serious work’. It’s a difficult problem, but the formality of Maker’s governance actually leaves a lot of useful artifacts to work with, so I think we’ll be able to systematize something that moves the needle.  image843×249 64.4 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.723563345091122
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#64",
                    "likes": "2",
                    "time": "10/06/2021-22:31:14",
                    "content": "@s_ben is it possible to put some floor limit on the dai given to participants? am i the only one seeing sh**ty posts to game the algortihm? also it would make transfers cheaper  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s_ben",
                    "index": "#65",
                    "likes": "1",
                    "time": "12/06/2021-01:20:41",
                    "content": "    Deimos:  @s_ben is it possible to put some floor limit on the dai given to participants?   There has always been a 10 DAI minimum to receive on-chain payouts. The SourceCred working group just decided to raise it to 20 DAI actually, thanks to suggestion from @AstronautThis on last week’s payouts post. I’m planning to announce that in the next weekly payouts post.     Deimos:  am i the only one seeing sh**ty posts to game the algortihm?   Have not seen complains about this in a long time. Some context: when SourceCred was originally proposed to Maker a little over a year ago, initial feedback was that spammy posts were getting over rewarded. We made a fairly big change in the algorithm, switching to minting Cred based on likes instead of posts as we were doing previously. That improved the scores a lot. We also implemented a feature for Maker that uses Discourse’s trust levels to determine how much Cred a user’s like creates. So new users mint zero Cred, and long-time, more trusted users mint more. This should generally discentivize spammy posts. However, it is SourceCred’s belief that spammy content, like gaming generally, isn’t something that can ever be eliminated completely, from any rewards system. Only mitigated and discentivized. Additionally, spammy is often in the eye of the beholder. The algorithm is designed to reflect the community’s collective valuation. So some may find a post spammy that others do not. That said, it’s definitely something to look into, especially if there’s intentional gaming. Do you have examples of posts you think are spammy? Feel free to DM me if that is more comfortable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.521439393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#66",
                    "likes": "0",
                    "time": "19/08/2021-20:47:16",
                    "content": "@mrabino1 will you be posting a signal request for this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#67",
                    "likes": "0",
                    "time": "19/11/2021-02:48:14",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}