{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/proposito-2-0-endgame-dinero-limpio-y-energia-nuclear-traduccion/18578",
            "title": "Proposito 2.0 - Endgame, Dinero Limpio y Energia Nuclear [Traducci\\xc3\\xb3n] ",
            "index": 18578,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "translate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#1",
                    "likes": "4",
                    "time": "29/10/2022-21:29:02",
                    "content": " Cartilla sobre la chispa y la meta El Plan Endgame surgió del Caso original de Dinero Limpio, que a su vez se centró en la importancia crítica de la “chispa” en la gobernanza de la DAO. La chispa es el impulso, el interés y el compromiso de un individuo con la DAO, y surge del propósito y la visión de la propia DAO, así como de la chispa de otros individuos en la DAO. Es lo que impulsa a los individuos a actuar de acuerdo con los intereses compartidos de la comunidad, en lugar de su interés personal. La chispa también puede considerarse lo contrario de la corrupción. En términos de Endgame, la chispa es el resultado de una buena meta, mientras que la corrupción es el resultado de una mala meta. Toda DAO se encuentra inmediatamente con el problema de la chispa en cuanto llega el momento de la votación, ya que la apatía de los votantes y el voto adverso/parcial es uno de los mayores retos para que la gobernanza de la DAO funcione. La chispa es, en última instancia, lo que lleva a alguien a dedicar tiempo de su día, y a veces incluso a pagar los gas fees, para votar en un proceso de gobernanza en el que no ve ningún beneficio directo por dedicar su trabajo, sino que sólo comparte el beneficio con todos los poseedores de tokens, incluidos los free riders que no se molestan en votar. Cuando se trata de la fuerza de trabajo descentralizada, la chispa importa aún más. Hay un sinfín de formas en las que los miembros de la fuerza de trabajo pueden optar por extraer en lugar de añadir valor a la DAO, y la extracción máxima de valor es por lo general en su propio interés racional. La chispa en la fuerza de trabajo es lo que evita que este simple incentivo acabe con la DAO debido a la corrupción y el egoísmo.  La chispa proviene de un propósito compartido más allá del enriquecimiento personal Una afirmación clave del Caso del Dinero Limpio, y el Plan Endgame, es que para desarrollar una buena meta que genere chispa, el objetivo de una DAO debe ir más allá de ganar dinero y hacer ricos a los poseedores de tokens. El enriquecimiento personal no es un propósito compartido, sino un propósito individual, por lo que tener eso como el ethos conductor promueve la corrupción en lugar de la chispa. En última instancia, la chispa consiste en que el individuo renuncie a su interés personal en favor del beneficio compartido de todas las partes interesadas en la DAO. Para generar chispa, la DAO debe tener a su vez un propósito que renuncie igualmente al interés directo, local y a corto plazo de la DAO, en favor del interés compartido de un grupo más amplio.  Los retos del Dinero Limpio 1.0 La idea del Caso original de Dinero Limpio era que Maker podía utilizar su enorme potencial de asignación de garantías a activos del mundo real, para garantizar que la inversión alineada con el clima se promoviera hasta el punto de que pudiera tener un impacto en el intento de evitar el inminente desastre climático mundial. Esto significaría ir más allá de la multitud de ESG y el lavado de cara verde que promueve, y mirar a los impactos medibles directos que luego podrían ser incluidos (de alguna manera) en los marcos de riesgo y toma de decisiones para la asignación de la garantía RWA. Todo ello podría verificarse mediante el proceso de gobernanza abierta y la transparencia de la tecnología blockchain. Esto no sólo ayudaría a generar chispa y proporcionar seguridad a la Gobernanza de Maker, sino que también ayudaría con el riesgo regulatorio al proporcionar una razón convincente para que los gobiernos y los reguladores apoyen los proyectos DeFi descentralizados como Maker que interactúan con los Activos del Mundo Real regulados. En la práctica, dos acontecimientos importantes han cambiado estos supuestos:  Extrema complejidad de los RWA En primer lugar, no se comprendió lo complicado y político que resultaba el proceso de incorporación de propuestas de “RWA complejos”, que son del tipo de crédito privado cuya naturaleza a medida y personalizable también podría facilitar el dar a Maker una ventaja en el impacto climático con su asignación de garantías. En la práctica, resultó casi imposible debido a la complejidad de dichos activos y el enfoque se desplazó hacia una incorporación más sencilla y realista de activos fáciles de entender, como los bonos del Estado. Esto no deja de ser un intento de copiar un proceso que ya existe en el mundo real. Sería órdenes de magnitud más complicado intentar construir desde cero un nuevo marco de “garantías limpias” que midiera directamente el impacto climático y lo reflejara en los parámetros de riesgo.  Deterioro normativo En segundo lugar, la ventana de oportunidad que permitiría a Maker influir significativamente en la trayectoria de la regulación de las criptomonedas se cerró con la decepcionante falta de progreso tangible en la última burbuja de las criptomonedas (incluyendo la incapacidad de Maker para cumplir con el dinero limpio). En lugar de ser reconocida como una tecnología prometedora que podría ayudar a resolver los problemas de la humanidad, las criptomonedas fueron tachadas de no servir para nada más que para estafas y burbujas, ejemplificadas por el colapso de Terra, Celsius y 3AC. Esta narrativa ha definido ahora una nueva ola de regulación de las criptomonedas hecha “a su manera”, ya que los reguladores han perdido la fe en la capacidad de los ecosistemas de las criptomonedas para autorregularse. Ambos hechos hacen que la aplicación original propuesta del Dinero Limpio no sea óptima. Sin embargo, al ser el principal mecanismo directo destinado a generar un claro propósito compartido que vaya más allá del enriquecimiento personal, por no hablar de las razones existenciales generales para apoyar la acción climática, un enfoque más sencillo y realista del Dinero Limpio debe integrarse en todos los demás elementos del equilibrio de Endgame.  Objetivo 2.0 El Dinero Limpio 2.0 debe situarse en un contexto adecuado de Endgame. La crisis climática es un momento único de un riesgo existencial grave y sin precedentes para la humanidad, pero sólo durará como mucho unos pocos siglos, tras los cuales se acabará de una forma u otra. Por esa razón, el dinero limpio no puede ser por sí mismo una fuente fiable y permanente de propósito para Maker en el Endgame. En su lugar, introducimos un modelo más flexible y adaptable que puede proporcionar un propósito y bienes públicos para muchas causas de impacto social diferentes, a la vez que impulsa las MetaDAO, meta y la preparación de la gobernanza. La idea se divide en dos partes.  Caridad a nivel de MetaDAO La primera parte es un nuevo mecanismo que se aplica a todas las MetaDAO: el 0,25% del suministro total de tokens de MetaDAO se emite cada año y se deposita en una cuenta especial de caridad controlada por el gobierno de la MetaDAO. Para compensar, las emisiones anuales para el cultivo de rendimientos DA/ETHD/MKR se reducen del 3% anual al 2,75% anual. El proceso de gobernanza de las MetaDAO puede entonces elegir cómo asignar estos fondos benéficos, y apoyar financieramente uno o más propósitos que encajen con, y contribuyan a fortalecer, su meta general y su marca. Se fomenta la experimentación y la creatividad, ya que cada MetaDAO puede probar a buscar diferentes vías para conseguir un alto impacto o crear valor público de formas que hoy pueden pasarse por alto. Mientras que muchas de las funciones empresariales principales de una MetaDAO suelen estar bien dirigidas y gestionadas por los equipos internos de la MetaDAO, la función benéfica puede dejarse en manos de la comunidad en mucha mayor medida, ya que a menudo puede reducirse a que los miembros de la comunidad voten sobre la organización benéfica a la que enviar fondos. Esto es en sí mismo una buena actividad de desarrollo de la comunidad, promoviendo una meta de participación activa en la gobernanza por parte de los poseedores de tokens que se preocupan por el propósito compartido. Si la MetaDAO no utiliza los fondos de caridad, o abusa de ellos (por ejemplo, intentando transferirlos para fines no caritativos, quemándolos, invirtiendo con ellos, etc.), entonces los fondos son confiscados por el Maker Core y utilizados en beneficio de las MetaDAO que sí realizan una caridad adecuada. En algunos casos, la MetaDAO también puede sufrir una sanción por intento de abuso. Esto está regulado por el Ámbito del Ecosistema de forma similar a otras formas de disputas de MetaDAO. El resultado es que las MetaDAO se ven incentivadas a aprender a asignar bien los fondos de caridad, de forma que obtengan un beneficio interno neto positivo, como una meta mejor y más fuerte, así como efectos positivos de marca. Esto sólo es posible si las decisiones de la comunidad están impulsadas principalmente por un auténtico deseo de hacer el bien y tener un impacto positivo en el mundo. Como resultado, debería ser un beneficio neto importante para la humanidad.  Maker Core nivel benéfico En el nivel de Maker Core, también hay un Charity Pool. Este fondo se financia con 2000 MKR de emisiones al año, y es controlado por la Gobernanza Maker. Para reducir la complejidad de que Maker tenga que microgestionar directamente y desplegar los fondos de caridad hacia propuestas abiertas, se distribuyen en cambio a través de un “Concurso de Caridad MetaDAO” anual.  Concurso benéfico MetaDAO Cada año, el Ecosystem Scope evalúa retrospectivamente los programas benéficos de cada MetaDAO, controlando su impacto, creatividad, novedad, eficiencia, etc. A partir de ahí, se elabora una lista de las MetaDAO mejor valoradas, y los titulares de MKR votan para elegir a la ganadora. El ganador recibe la totalidad de los 2.000 MKR anuales y puede utilizarlos para sus iniciativas benéficas del año siguiente. Dado que las MetaDAO más efectivas en el uso de sus fondos benéficos habrán desarrollado formas de generar valor intangible a partir de sus esfuerzos benéficos, esto resulta en un incentivo financiero real para que las MetaDAO compitan entre sí para destacarse como las mejores, creando una “carrera armamentista” dinámica de impacto social. Más allá de todo el increíble impacto social y el bien público que beneficiará a la humanidad, un efecto de segundo orden también creará una experiencia más dinámica y gamificada de cómo los MetaDAO se ven a sí mismos y a los demás. La dinámica de la competición benéfica de las MetaDAO puede crear rivalidades, narrativas, leyendas y mitos entre las MetaDAO, y formará parte del proceso de gobernanza descentralizada que estará mayoritariamente encabezado y dirigido por los poseedores habituales de tokens y por los entusiastas que participen voluntariamente en la gobernanza, en lugar de por profesionales pagados, lo cual es un hábito extremadamente valioso de cultivar.  Propósito de la puesta en marcha 2.0 Antes de que lleguemos al estado Endgame de Propósito 2.0, las MetaDAOs necesitan estar completamente arrancadas y tener procesos de caridad funcionales y sistemas de emisión de tokens que les permitan operar a escala con la votación de tokens. Mientras se espera que esto se ponga en marcha, Maker también tiene el compromiso de hacer frente a la crisis existencial inmediata del cambio climático a través del Dinero Limpio, y la solución a ambos elementos se puede implementar como Dinero Limpio 2.0  Dinero Limpio 2.0: Garantía neutra en carbono + fomento del Renacimiento Nuclear El primer requisito del Dinero Limpio 2.0 es que debe ser sencillo y no entorpecer los procesos de los RWA introduciendo nuevos conceptos o complejidad. El segundo requisito es que debe priorizar los beneficios internos para la meta de la comunidad Maker, en lugar de priorizar la influencia en los desarrollos normativos. Por supuesto, debe seguir considerándose un factor importante para demostrar el valor de Maker para la sociedad, pero no debe ser el objetivo principal. La solución sugerida aquí es un enfoque doble: En primer lugar, una versión simplificada de Garantía Limpia, que se basa simplemente en el enfoque estándar de ESG de utilizar listas de exclusión. Maker Core puede mantener una lista de exclusión de ciertas industrias y prácticas empresariales insostenibles y luego filtrar la validez de cualquier garantía que viole la lista de exclusión de alguna manera. Esta es una práctica común utilizada por los marcos ESG y es relativamente fácil de implementar, y de encontrar buenos puntos de partida. Una extensión del enfoque de la lista de exclusión es el enfoque que el Plan Endgame ya tiene en la maximización de Staked ETH como garantía. Desde ETH 2.0, Staked ETH resulta ser casi neutro en carbono por defecto, lo que hace aún más fácil y sencillo conseguir que toda la cartera de garantías de Dai cumpla con la neutralidad en carbono. Sin embargo, conseguir que Maker sea neutro en carbono no va a ayudar a evitar el inminente colapso de la sociedad, sino que, en el mejor de los casos, lo ralentizará ligeramente. Dinero Limpio trata de dar a la gente una forma de salvar el mundo simplemente cambiando la forma en que guardan sus ahorros, y eso significa financiar cosas que superen y eliminen la industria de los combustibles fósiles. Los fondos de caridad de MetaDAO para los protectores ya proporcionan una solución fuerte que tirará en esta dirección, ya que los protectores serán incentivados para encontrar maneras de convertir la buena meta en valor, naturalmente buscarán maneras de ampliar esta ventaja más allá de su fondo de caridad, y serán capaces de encontrar de manera flexible maneras de tener impactos positivos con su garantía RWA sin necesidad de ninguna intervención de la gobernanza Maker. Pero el propio Maker debe utilizar su escala global y su poderoso potencial económico para dejar su propia huella a corto plazo, ya que la catástrofe climática mundial es una amenaza existencial demasiado grande como para ignorarla para un proyecto que aspira a ser proveedor de estabilidad e infraestructuras fundamentales. Ahora existe una oportunidad muy interesante para marcar una diferencia significativa y, al mismo tiempo, no sobrepasar la gobernanza de Maker: Apoyar la defensa de la energía nuclear como la medida más importante a corto plazo de la transición energética sostenible. La guerra de Ucrania y la desastrosa realidad del cambio climático han abierto por fin la puerta a que el mundo cambie de opinión sobre la energía nuclear, un punto de inflexión para la humanidad llamado Renacimiento Nuclear y la única vía realista que queda para evitar el colapso global. Para saber más sobre esto, y sobre todo para conocer las mentiras e ideas erróneas que existen sobre la energía nuclear en un formato accesible, puedes ver la charla TED a continuación.  La energía nuclear es nuestra mejor esperanza para abandonar los combustibles fósiles | Isabelle Boemeke | TED La energía nuclear es una parte esencial de la economía sostenible, ya que es la única forma de energía limpia que puede suministrar carga base a escala, es decir, puede funcionar y ser fiable en las situaciones en las que las fuentes de energía limpia intermitentes (solar y eólica) están apagadas. Las baterías pueden ayudar en cierta medida a resolver la intermitencia, pero en la práctica no es rentable utilizarlas para la carga base de la red en invierno y, además, las baterías son necesarias para la electrificación a escala mundial de la mayoría de las infraestructuras de transporte del planeta. Hay que buscar todas las vías, incluidas las baterías y la energía nuclear, y ahora mismo la humanidad está descuidando por completo la energía nuclear. La energía nuclear también puede aportar muchos beneficios importantes que van más allá de la electricidad, como la calefacción, la producción limpia de hidrógeno, la catalización de otros procesos químicos, la desalinización escalable (que es de vital importancia para hacer frente a la sequía inducida por el cambio climático) y mucho más. Y es increíblemente segura en comparación con la peligrosísima tecnología de los combustibles fósiles a la que sustituye. La energía nuclear y la seguridad: la sorprendente verdad - Energía para la Humanidad Durante la fase de arranque de Propósito 2.0, Maker puede ir más allá de la promesa de Dinero Limpio utilizando los fondos del Fondo de Caridad para apoyar a grupos de defensa de la energía nuclear que puedan ayudar a difundir estas simples verdades, como Nuklearia Imprenta/Gastos | Nuklearia, que recientemente ayudó a evitar el desastroso cierre de 3 reactores nucleares de producción de energía limpia en Alemania. La energía solar, la energía eólica y las baterías ya se están produciendo a plena capacidad y tienen una economía marginal difícil, lo que significa que Maker no puede utilizar fácilmente sus músculos RWA para tener un impacto importante, a menos que estemos dispuestos a perder dinero o asumir un riesgo excesivo, o que seamos muy inteligentes y tengamos una gobernanza muy flexible (esto es posible para MetaDAOs, e incentivado a través de Propósito 2.0 como se ha explicado anteriormente, pero no es realista para Maker Core). La defensa de la energía nuclear, por otro lado, puede lograr un impacto global masivo con sólo donaciones relativamente pequeñas que se destinan a la educación y la defensa para superar todos los conceptos erróneos y hostiles plantados por la industria de los combustibles fósiles. Una vez que la propia comunidad Maker aprenda a ver a través de las mentiras y los conceptos erróneos sobre la energía nuclear, contribuir a su amplia adopción se convertirá en una fuente clave de meta y propósito internos, ya que simplemente no hay ninguna actividad de mayor impacto social que sea posible hoy en día. Es el punto de partida ideal para el sistema de Propósito 2.0, ya que ofrece a los titulares de MKR un alcance estrecho con una complejidad mínima que ofrece dinero limpio. Con el tiempo, a medida que la crisis climática mejore gracias a un Renacimiento Nuclear global que nos lleve a un camino realista para superar y eliminar todo el uso de combustibles fósiles en todo el mundo, los MetaDAOs estarán listas para comprometer sus propios programas de caridad. Maker puede entonces hacer la transición de su Fondo de Caridad hacia el estado de Finalización del Propósito 2.0 apoyando la Competencia de Caridad MetaDAO como se ha descrito anteriormente.  Esta es una traducción libre del topic Purpose 2.0 - Endgame, Clean Money and Nuclear Energy atom_symbol de @rune Créditos: Traducción @cryptenthusiastic ",
                    "links": [
                        "https://www.energyforhumanity.org/en/briefings/energy/nuclear-power-and-safety-the-facts/",
                        "https://nuklearia.de/impressum/",
                        "https://forum.makerdao.com/t/purpose-2-0-endgame-clean-money-and-nuclear-energy/18421"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.341911764705882
                }
            ]
        }
    ]
}