{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-can-have-a-monopoly-power-over-stablecoins-lending/3142",
            "title": "Maker can have a monopoly power over stablecoins lending! ",
            "index": 3142,
            "category": [
                "Governance"
            ],
            "tags": [
                "idea",
                "stablecoin",
                "pegstab-module"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#1",
                    "likes": "9",
                    "time": "09/07/2020-07:56:28",
                    "content": "Maker has a huge network effect as the only decentralized stablecoin with real and organic liquidity. with (1st) Peg Stabilization Modules + (2nd) my suggestion to improve PSM (which I will explain below): I think we will fix many of the problems that are facing Dai today and also give Maker a monopoly power in the service of lending all types of stablecoins in Defi space. with these 2 improvements we will: 1- have a very powerful tool to prevent DAI from losing the peg higher than 1$ 2- we will be able to scale DAI supply significantly 3- we will be able to have some SF implemented on vaults even when there is a big demand on DAI 4- will significantly lower the risks of using usdc and other centralized stablecoins as collaterals 5- will generate new source of income to Maker holders and give Maker a monopoly power over lending different types of stablecoins if you didn’t already then please read     Peg Stabilization Modules: A Pre-MIP Discussion Proposal Ideas       Introduction The Maker community has been intensively discussing how to address the issues surrounding the DAI peg over the last three months. The recent pressure caused by COMP farmers using Dai as their asset of choice has accelerated the need to address this issue more formally.  As of today, the community is moving forward with the response of increasing the USDC debt ceiling, which is important because it means that Maker Governance is showing a willingness to defend the peg, ultimately hel…      I think PSM is a good fix for some of Dai problems but I think that implementing PSM alone has 2 major problems tens or hundreds of millions of centralized stablecoins (for example usdc) locked in PSM represent 1- a risk to Maker 2- a missed opportunity what are the risks? the most important risks that I can think of: 1- usdc locked in PSM can be blacklisted (for whatever reason) 2- usdc can depeg and lose all or part of its value what is the missed opportunity? having tens or hundreds of millions of usdc locked in PSM means that the DAI minted using these assets  is not generating income to Maker protocol except small spread fees My suggestion to improve PSM I think we should simply lend most of the locked usdc and we should set the lending value for each centralized stable coin to 1$… this means if usdc depeged and lost some or all of its value then usdc holders will take the loss not Maker. for example If I borrowed 10k usdc from PSM and USDC depeged down to zero $ (for whatever reason) then I will still have to pay back 10k dollars back to PSM to free my collateral using another type of assets (may be DAI?) this suggestion will remove most of the risks like blacklisting and depeging of usdc also will generate new stream of income of Maker holders ",
                    "links": [
                        "https://forum.makerdao.com/t/what-so-what-now-what-psm-solution/3154",
                        "https://forum.makerdao.com/t/maker-relay-ep-6/3517"
                    ],
                    "GPT-summary": "The author proposes improvements to the Peg Stabilization Modules (PSM) of Maker, which would fix some of the problems facing Dai and give Maker a monopoly power in the service of lending all types of stablecoins in the DeFi space. The author suggests lending most of the locked USDC and setting the lending value for each centralized stable coin to $1 to remove most of the risks like blacklisting and depegging of USDC and generate a new stream of income for Maker holders. A third party gives constructive criticism and extends to the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 6.090101775329049
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#2",
                    "likes": "6",
                    "time": "09/07/2020-08:43:19",
                    "content": "Yeah, it seems like a good idea to be lending some of the USDC reserves on secondary markets. Makes it a bit more palatable to have that much exposure to USDC. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#4",
                    "likes": "3",
                    "time": "09/07/2020-13:50:43",
                    "content": "This idea seems pretty good at first glance.  I have two sets of questions:   Since the major risk appears to be blacklisting of the USDC that MakerDao holds wouldn’t this mean that borrowers potentially fear the same risk and would refuse to borrow USDC from the PSM without significantly better rates compared to the rest of the market to offset that risk? Extend your thinking out and make the assumption that the USDC was eventually blacklisted.  What are the next steps in that case?   What happens in the event that the PSM is not generating enough USDC loans and yet it is still accumulating a lot of USDC giving MakerDao that exposure you mentioned?   I am for ideas that balance the Peg but also keep MakerDao safe from exposure to USDC falling to $0.00 overnight or being blacklisted. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.886363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#5",
                    "likes": "0",
                    "time": "09/07/2020-14:18:04",
                    "content": "@FourthStreet Yeah, it makes a lot more sense to just lend the USDC on secondary markets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#6",
                    "likes": "1",
                    "time": "09/07/2020-14:20:55",
                    "content": "The peg issue at the root is caused by demand for stable coin Dai in market > demand for collateralized loans in MakerDao system.  How is this being addressed moving forward to actually solve the root? If the balance isn’t there this is always going to be a problem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#7",
                    "likes": "0",
                    "time": "09/07/2020-14:23:59",
                    "content": " Since the major risk appears to be blacklisting of the USDC that MakerDao holds wouldn’t this mean that borrowers potentially fear the same risk and would refuse to borrow USDC from the PSM without significantly better rates compared to the rest of the market to offset that risk? Extend your thinking out and make the assumption that the USDC was eventually blacklisted. What are the next steps in that case?  I don’t think borrowing usdc from PSM will be riskier for borrowers than borrowing it from other platforms like Aave or compound… anyway if borrowers perceived it as a riskier loan then I guess this will be reflected in willing to pay lower fees in comparison to taking loans from Aave or compound, and this is ok since borrowers are not only paying Maker fees but also lowering Maker risks.  What happens in the event that the PSM is not generating enough USDC loans and yet it is still accumulating a lot of USDC giving MakerDao that exposure you mentioned?  since we can offer lower rates to borrowers than Compound or Aave we will have an advantage in attracting borrowers… anyway if we failed to attract borrowers for whatever reason then we will have to manage the risks using ceilings and diversification as we are planning to do with current PSM proposal ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.144230769230768
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#8",
                    "likes": "0",
                    "time": "09/07/2020-14:25:32",
                    "content": " @FourthStreet Yeah, it makes a lot more sense to just lend the USDC on secondary markets.  I don’t think lending usdc on secondary markets will protect us from USDC falling to zero $ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#9",
                    "likes": "0",
                    "time": "09/07/2020-14:27:15",
                    "content": "@Jiecut Is this something that has been discussed?  I imagine the custodial risks and other issues involving doing this securely are prohibiting this behavior.  As the ecosystem develops this may eventually be workable though if it isn’t already.  Makes sense to me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OliverNChalk",
                    "index": "#10",
                    "likes": "0",
                    "time": "09/07/2020-14:31:13",
                    "content": "Why would people borrow 1 super USD (that can’t default) when they could just borrow dai itself, or USDC elsewhere? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#11",
                    "likes": "0",
                    "time": "09/07/2020-14:32:40",
                    "content": "So the idea then would be that this solves the demand imbalance by increasing the Dai supply through creating more loans which balances the other side.  These loans are just in USDC.  If Maker’s rates for USDC become worse than AAVE for example the USDC would instead be loaned potentially through AAVE or some other secondary lender.  Like you said though, if that happens the risk of blacklist is still on MakerDao since the USDC is still “in MakerDao’s control”. If a secondary market is not a good option what else is there in the event that the demand imbalance is persistent and rates are not balancing it still? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#12",
                    "likes": "0",
                    "time": "09/07/2020-14:34:00",
                    "content": "@OliverNChalk I don’t follow sorry, can you explain a bit more in detail what you are asking? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#13",
                    "likes": "0",
                    "time": "09/07/2020-14:34:08",
                    "content": " Why would people borrow 1 super USD (that can’t default) when they could just borrow dai itself, or USDC elsewhere?  we can offer lower fees… with PSM we can offer very low fees unlike Aave and Compound because they will always need to pay liquidity providers ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#14",
                    "likes": "0",
                    "time": "09/07/2020-14:37:43",
                    "content": "Yep. I guess my question is.  There is a limit to this at some point.  What if demand is greater than that limit?  Does this scale infinitely the way that the DSR and interest rates can on the other end of things to keep Dai prices high, can this keep Dai prices low with the same force?  I feel like this helps, but the answer is likely no? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.445833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OliverNChalk",
                    "index": "#15",
                    "likes": "1",
                    "time": "09/07/2020-14:38:02",
                    "content": "If I borrow usd on compound I earn Comp, so my effective interest rate is negative. However, assuming we can offer zero interest rate loans to people on the condition they always return 1 usd (even if USDC collapses), how much demand do we think there is? DAI’s borrow rate is already zero, so there is obviously not enough demand for stablecoin borrowing even when it’s “free” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#16",
                    "likes": "0",
                    "time": "09/07/2020-14:39:37",
                    "content": "I was thinking that if MakerDao lends USDC out at 0% that will go to compound and then lead to the rates getting worse over there which then will fix the issue you speak of. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#17",
                    "likes": "0",
                    "time": "09/07/2020-14:45:22",
                    "content": " If I borrow usd on compound I earn Comp, so my effective interest rate is negative.  compound subsidies are distorting the normal markets in the short term but this will be rebalanced with time ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#18",
                    "likes": "0",
                    "time": "09/07/2020-14:47:07",
                    "content": "The reason why I suggest secondary money markets is because it keeps the USDC quite liquid. The PSM would need to be able to recall the USDC so that it can buy back DAI. On the other hand, if MakerDAO lent out the USDC themselves, the USDC would not be liquid at all. Stick to lending DAI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OliverNChalk",
                    "index": "#19",
                    "likes": "1",
                    "time": "09/07/2020-14:48:04",
                    "content": "You can already borrow dai at zero percent. Not to mention, if you leverage deposit and borrow dai on compound you make 50%+ per annum. The only solution here is to pay DAI minters a negative stability fee (paid for by a negative DSR). However, because this is not possible due to choices made, we are stuck with the only other option of increasing DAI supply without being able to properly incentivize it. The only safe way to do this is to add more collateral types, preferably ones that will pay us a risk premium for the ever growing amount of risk MKR holders are underwriting ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.270833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#20",
                    "likes": "1",
                    "time": "09/07/2020-14:48:35",
                    "content": " Does this scale infinitely the way that the DSR and interest rates can on the other end of things to keep Dai prices high, can this keep Dai prices low with the same force? I feel like this helps, but the answer is likely no?  I agree it has limits (borrowing demand) but I believe it is better than current PSM proposal ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.382142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#21",
                    "likes": "0",
                    "time": "09/07/2020-14:49:16",
                    "content": "Rates rise in that case the same way we handle the situation with Dai loans currently with rising stability fees, just with USDC instead. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#22",
                    "likes": "0",
                    "time": "09/07/2020-14:50:36",
                    "content": "I agree, I would still like to look deeper though in addition to implementing something like this because although this helps, it is not a permanent solution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#23",
                    "likes": "0",
                    "time": "09/07/2020-14:52:46",
                    "content": "If enough Dai and USDC is being lent out the demand even at compound will get exhausted.  Rates get worse over there the more supply of Dai or USDC there is in their supply for lending.  Also, the rates are naturally going to fall because nobody logical is going to hold COMP when it is being given out so cheap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.321428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#24",
                    "likes": "1",
                    "time": "09/07/2020-14:54:43",
                    "content": " The reason why I suggest secondary money markets is because it keeps the USDC quite liquid. The PSM would need to be able to recall the USDC so that it can buy back DAI.  when we need to recall USDC to buy back DAI, the buffer liquidity in PSM will be drained which will push the borrowing rates very high… may be this won’t recall usdc as fast as we want but Makerdao lending usdc by itself can offer protection against usdc going to zero which is a huge advantage ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.7142857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#25",
                    "likes": "1",
                    "time": "09/07/2020-14:56:39",
                    "content": "Even if this were not to get the USDC back as fast as MakerDao prefers, it is fine because the rates would go so high that the profit generated would be well worth the wait.  The interest profit in that case could be used as it comes in to repurchase Dai if it was necessary. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.897222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#26",
                    "likes": "1",
                    "time": "09/07/2020-15:00:18",
                    "content": "Or the USDC Vault liquidations that result in the extreme case that these loans are not getting paid for whatever reason…  That is creating Dai buying pressure in the case that others are not stepping up to act rationally before it gets to that point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#27",
                    "likes": "6",
                    "time": "10/07/2020-07:02:28",
                    "content": "so if you are thinking about it, the DAI minted using PSM is not collateralized by the lent usdc but it is indirectly collateralized by the collaterals used to take the usdc loan (most likely ether)! now if you look at borrowing rate in compound and aave you see that the rates for centralized stable coins are usually between 4 to 10% (some times more)… because in secondary lending markets almost all the borrowing rates are going to liquidity providers… with PSM we have no liquidity providers to compensate we can lend centralized stable coins with very low rate (close to zero)… This will push the borrowing rate in secondary markets (Compound and aave) to be lower which means lower liquidity in these markets due to lower incentives to provide liquidity! this means we are going to suck a lot of the collaterals available in secondary markets and use it directly or indirectly to mint DAI! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.859375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#28",
                    "likes": "0",
                    "time": "10/07/2020-16:52:58",
                    "content": "Yes, This is my thinking as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#29",
                    "likes": "2",
                    "time": "29/01/2021-11:02:27",
                    "content": "since PSM is alive and growing fast I think another reminder to this proposal is warranted ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#30",
                    "likes": "3",
                    "time": "29/01/2021-12:09:05",
                    "content": "IMO this a very valid (and powerful) proposal. Only issue I see is the technical challenge of implementing new Vaults to lend USDC for instance. Then we’ll have as well to figure out things like how to collect the fees. Since fees will be collected (more likely) in USDC, we cannot simply send those to the Surplus Buffer (I’m not sure about having a Surplus buffer in another stable coin). A possible solution would be some Stablecoin buffer that is converted (by anyone) to DAI through Curve through a smart contract call (which then can be sent directly to the Surplus buffer) Added to the vaults, we could also activate Flashloans from the PSM Stablecoins, those generate an important amount of income for Aave for instance, and USDC flashloans are high demand one. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.628803339517625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#31",
                    "likes": "1",
                    "time": "29/01/2021-13:29:55",
                    "content": "Thanks @mmoossttaaffaa. I think you start a very much needed discussion: how do we get rid of the risk on the USDC? Rather than implementing implementing new stuff, which is difficult:     smaugho:  IMO this a very valid (and powerful) proposal. Only issue I see is the technical challenge of implementing new Vaults to lend USDC for instance.   Why don’t we just:  Once we have embarked, 1m USDC (from the PSM) take 1m DAI from the SB (surplus buffer), when available. put 1m DAI + 1m USDC (2m USD of value) on LP on Uniswap (or Curve or whatever).  This way we obtain the following results:  We increase DAI liquidity in markets. We get fees on the LP pair DAI/USDC  Most importantly, we get rid of USDC and we instead get in our hands LP tokens. This means that, central authorities can only blacklist the USDC in the Uniswap contract (which affects everybody) not MakerDAO’s LP tokens!  Note 1: this simple solution does not protect us from USDC going to 0. But it protect us from central authorities attacking MakerDAO by blacklisting its USDC. Which I think is, by far, the greater of the two risks. Note 2: there is a bottleneck here, step (2). We are limited by the amount of money available in the SB. Other alternatives can be considered though, but for the moment I leave it there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.64461334120425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#32",
                    "likes": "2",
                    "time": "29/01/2021-14:00:21",
                    "content": "    iammeeoh:   We increase DAI liquidity in markets. We get fees on the LP pair DAI/USDC  Most importantly, we get rid of USDC and we instead get in our hands LP tokens. This means that, central authorities can only blacklist the USDC in the Uniswap contract (which affects everybody) not MakerDAO’s LP tokens!    You can take as much DAI as you want. I think the best technical solution would be to create a PSM-USDC-DAI-LP vault type which when you add a gem it borrows 2x DAI, add 1 DAI / USDC as an LP, and return the remaining DAI (to repay PSM-USDC). Then we can transfer USDC from PSM-USDC to the PSM-USDC-DAI-LP. Something along those lines. The details will for sure not be easy. You may need < 1% of DAI from the SB to make that works. And to find a way to accrue gains from the Uniswap LP to the system (by increasing the debt of the PSM-USDC-DAI-LP vault. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.685185185185185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#33",
                    "likes": "0",
                    "time": "29/01/2021-14:16:38",
                    "content": "    SebVentures:  You can take as much DAI as you want. I think the best technical solution would be to create a PSM-USDC-DAI-LP vault type which when you add a gem it borrows 2x DAI, add 1 DAI / USDC as an LP, and return the remaining DAI (to repay PSM-USDC). Then we can transfer USDC from PSM-USDC to the PSM-USDC-DAI-LP. Something along those lines. The details will for sure not be easy.   Thanks @SebVentures. I don’t fully understand your suggestions. But if it solves the bottleneck I mentioned, it’s great! Do you guys generally agree that basically replacing USDC with LP tokens will dramatically reduce our risk of blacklisting* ? (*) blacklisting intended as a way of attacking MakerDAO. Of course they can still blacklist the USDC’s in the Uniswap contract, but that is an entirely different scenario. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.816666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#34",
                    "likes": "1",
                    "time": "29/01/2021-14:22:01",
                    "content": "Isn’t it MIPs 32, 35 and 36? They are built. I am not sure I see the difference with it. Regarding LP usdc/dai uniswap can activate fees on the withdrawal I think the amount is exponential on the amount. Only way to go over it is to fork it. That can be done with MIPs 31. MIP 31 simplify the deposit also it can be directly plug to keg by sending money into it. Also fees are parametrable. Edit change MIPs number. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#35",
                    "likes": "1",
                    "time": "29/01/2021-14:49:07",
                    "content": "Regarding flash loan, I wanted to build it into the LP reserve instead seems a better solution. As the PSM is meant to fluctuate where the reserve is more stable. Using MIP31 only for MKR/DAI just add the flashloan piss of code from MIP25. Looks very easy to do. Side note I removed the flashloan inbuilt from uniswap as we don’t want it for MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.954166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#36",
                    "likes": "0",
                    "time": "29/01/2021-14:59:53",
                    "content": "    alexis:  Isn’t it MIPs 32, 35 and 37?   Not 37 (because that’s outside of Maker Protocol) but a bit like MIP32 yes. We might want only Maker to use it in order to better control our exposure between USDC-DAI-LP and cUSDC (MIP32/35) for instance. Not sure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#37",
                    "likes": "1",
                    "time": "29/01/2021-15:21:59",
                    "content": "Sorry I meant MIP36. 32 and 35 are very similar only difference is the farming on 35. 36 lend dai violently, like a push force, without taking care of the exchange, very powerful. But the idea is to push down the price. That is for second lending market. I think there is different use cases for 36. For example is we have some of it and dai is at .99 we can withdraw to push up the peg too. Or if someone from RWA want to pay back 400M in one go we can easily absorbe it with MIP36 without having the dai hitting the PSM. I am not sure if that makes sense, but we can sort of coordinate it by governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.598989898989899
                }
            ]
        }
    ]
}