{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-15-21-de-marzo-de-2022/14181",
            "title": "Relay Semanal: 15 - 21 de marzo de 2022 ",
            "index": 14181,
            "category": [
                "Latin America"
            ],
            "tags": [
                "update",
                "espa\\xc3\\xb1ol",
                "latin-america",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/NCO",
                    "index": "#1",
                    "likes": "7",
                    "time": "23/03/2022-23:54:24",
                    "content": " 1640×357 260 KB  ¡Hola a todos! ¡Gracias por consultar el Relay Semanal! Ya sea que tengas Maker (MKR) o DAI, poseas una Vault o quieras involucrarte más en la Gobernanza de MakerDAO, esta es tu parada rápida para estar al tanto de las actualizaciones del ecosistema de MakerDAO.  La versión pública en PDF en inglés se puede encontrar aquí   Eventos Actuales  Esta Semana en Gobernanza  Comunidad Deep Dai-ve  Anotaciones para el Calendario  Links Útiles  ¿Tienes algún feedback?   Eventos Actuales  stkMKR: Apostando en Maker y Revisión de la Tokenómica (Economía de los Tokens)  Como parte de la continua discusión en la mejora de la economía de los tokens de Maker, @monet-supply, del equipo de la Core Unit de Riesgo, propone apostar las funcionalidades al token MKR a través de stkMKR, un token con un mecanismo de economía inspirado en la combinación de la economía de los tokens de la Gobernanza de Cosmos, stkAAVE y xSUSHI. Este mecanismo intenta preservar los beneficios clave del mecanismo existente de compra y quemado —eficiencia de gas e impuestos— al mismo tiempo que aborda de sus inconvenientes:    stkMKR: Maker Staking and Tokenomics Revision     Falta de incentivos específicos - la economía de los tokens puede incentivar un comportamiento positivo dentro del protocolo, pero la compra y el quemado devuelve el capital a todos los poseedores de MKR por igual y carece de incentivos específicos para aquellos poseedores de tokens que aporten un valor extra.  Narrativa cripto débil - comprar y quemar está en desuso, y una actualización podría despertar un mayor interés en el protocolo de Maker; si bien, en nuestra opinión, la tokenómica no debe centrarse en el impacto de los precios, los cambios en la narrativa positiva beneficia al protocolo al hacer que la emisión de MKR para la contratación, la recaudación de capital y la incentivación del usuario sean más eficientes.  Disuasión limitada contra los ataques a la Gobernanza - Actualmente, los poseedores de MKR pueden votar en una propuesta maliciosa e, inmediatamente, retirar sus fondos e interactuar con los protocolos DeFi, lo que hace que sea casi imposible quemar la participación de un atacante (podrían mezclarse con préstamos o pools de intercambio de AMM y contaminar los fondos en poder de otros usuarios).    En este mecanismo propuesto, un nuevo token no transferible, stkMKR, reemplazará al MKR como el token principal de la Gobernanza para el ecosistema de Maker. Los poseedores de los tokens apostados recibirán una parte de los tokens MKR comprados por medio de las subastas de excedentes, por lo que la cantidad de MKR que repalde al stkMKR incrementará y se acumulará automáticamente con el tiempo. Retirar el token apostado requerirá esperar un período de desvinculación, lo que aumentará la resiliencia del protocolo y la seguridad de la Gobernanza. Las tarifas provendrán del DAI, que los usuarios deben pagar como interés por el préstamo en Maker. Actualmente, estas tarifas se utilizan para recomprar MKR, que luego (generalmente) se quema. Sin embargo, una parte de los MKR comprados, volverá a los poseedores de stkMKR según la nueva propuesta. Aquí puedes encontrar un vistazo general de cómo funciona el sistema:  1134×566 44.5 KB  Los stkMKR apostados se mantienen en contratos de votación y se pueden delegar libremente sin demora ni desvinculación (un período de tiempo que los usuarios tendrían que esperar si desearan retirar su stkMKR y cobrar sus tarifas). Una parte del MKR recibido a través de las subastas de excedentes se reserva para los poseedores de stkMKR en lugar de quemarse. La Gobernanza podría optar, también, por rellenar esta reserva manualmente. Aquellos que apuestan en MKR, podrán votar utilizando stkMKR, y la introducción de tarifas adicionales también podría incentivar una mayor participación en la Gobernanza.  1134×967 53.4 KB  Retirar stkMKR apostados es un proceso bastante sencillo.  1109×565 38.9 KB  Por último, este mecanismo es diseñado para lograr los siguientes puentes:    stkMKR: Maker Staking and Tokenomics Revision     Incentivar la participación en la Gobernanza: Mientras que el mecanismo no logra, directamente, incentivar a la votación o a otras acciones, las recompensas por apuestas pueden ayudar a mejorar la participación y tasas de delegación.  Mejorar la narrativa de acumulación de valor para el token MKR: Figuras APR concretas y la restricción de suministros pueden ayudar a mejorar el sentimiento del mercado.  Incrementar la seguridad de la Gobernanza: El rendimiento de las apuestas hace que los préstamos de tokens sean menos atractivos, mientras que los períodos de desvinculación pueden ayudar a disuadir los ataques a la Gobernanza y hacer que su ejecución sea más costosa. La desvinculación también desincentiva la participación a través de intercambios centralizados u otros servicios de apuestas agrupados, lo que podría comprometer la descentralización de MakerDAO.  Aumentar la resiliencia a las pérdidas crediticias: Los períodos de desvinculación mantienen una parte de los tokens MKR fuera del mercado durante las caídas del mercado y los eventos de recapitalización. Esto evita que los poseedores de MKRs apostados realicen subastas de deuda de manera anticipada.    Será necesario actualizar o introducir varios componentes para implementar completamente el mecanismo tokenómico de stkMKR. Será necesario redactar un contrato divisor para direccionar parte del MKR de las subastas de excedentes para respaldar el token stkMKR. También será necesario realizar varios cambios en el sistema de la Gobernanza de Maker, incluida la migración a la Gobernanza central, la votación, los contratos de delegación, un ajuste en la forma en la que se evalúan las encuestas de la Gobernanza y un mecanismo de recuperación ante desastres. Tanto Cointelegraph como The Defiant publicaron resúmenes acerca de esta propuesta.  Propuesta Anti-Inflacionaria  Mientras que el mecanismo de stkMKR, detallado más arriba, puede admitir enfoques de financiación tanto deflacionarios (a través de la recompra) como inflacionarios (a través de la acuñación de tokens de la Gobernanza), la propuesta de @cryptenthusiastic es estrictamente deflacionaria y hace menos enfoque en incentivar la participación de la Gobernanza. @cryptenthusiastic quiere desvincular el valor del DAI del factor de inflación de la moneda fiduciaria de tal manera que:    Anti-inflationary proposal    Si el dólar disminuye, el DAI se mantendrá estable. Si el Fed (Federal Reserve System, Sistema de Reserva Federal de EEUU) logra que el dólar suba de valor (lo cual es difícil de mantener a largo plazo), el DAI subiría junto con el dólar.    Los potenciales riesgos y desventajas incluyen:    Anti-inflationary proposal    Pérdida transitoria leve en pares de DAI con otras stablecoins. Probablemente ralentizará el proceso de adopción a corto y mediano plazo; los prestatarios estarán un poco menos motivados en abrir una vault debido al aumento de las tasas de interés. Sería menos atractivo, para los usuarios que toman prestado DAI, el comprar y aumentar su posición en diferentes criptomonedas (la solución a esto podría llegar a ser la opción B que se encuentra a continuación).    @cryptenthusiastic cree que, esta desvinculación del DAI del factor de inflación de la moneda fiduciaria, lo convertiría en la stablecoin elegida por los inversores que obtienen ganancias durante los mercados alcistas y lo haría atractivo para instituciones y empresas. Como siempre, con las nuevas propuestas tokenómicas, hay varias discusiones que se están llevando a cabo en el foro tanto por la propuesta de stkMKR como de esta propuesta anti-inflacionaria. Si este es un tema de tu interés, este miércoles habrá una llamada por el stkMKR. Enfoques #8: stkMKR: Staking y Revisión de la Tokenómica     Focus On #8: stkMKR: Staking & Tokenomics Revision   El 8vo. episodio de “Enfoques” será presentado por @monet-supply, de la Core Unit de Riesgo, y un Delegado Reconocido para discutir las revisiones propuestas a Staking MKR y Tokenómica. Al abordar las críticas de Maker de tener una tokenómica débil, stkMKR intenta solucionar los desafíos del proyecto mediante la introducción de incentivos a la participación en la Gobernanza al mismo tiempo que aumenta la seguridad de la Gobernanza y la resistencia a las pérdidas crediticias.   @juan y @retro estarán presentando este evento el miércoles 23 de marzo a las  4 PM UTC. Agéndalo en tu Google Calendar! Llamada en Crowdcast   Esta Semana en la Gobernanza  Propuestas de Mejoras de Maker (MIPs) Actualización Semanal de MIPs #79  1034×590 25.6 KB   ¡Las fechas de Solicitud de Comentarios (RFC - Request for Comments) y Presentación Final (FS - Final Submission) para referencia y las propuestas existentes se pueden ver en este registro de propuestas (en proceso)!  Si tienes alguna consulta acerca del proceso de votación de MakerDAO, esta Guía Práctica de Votación te será útil.  Las nueve propuestas, que fueron presentadas formalmente en el Ciclo de la Gobernanza de marzo, ya se encuentran transcurriendo su segunda semana como Encuestas de Ratificación. Además, tenemos una Petición de Señal para promover enmiendas a la MIP62 en una encuesta con vigencia de tres días, según la MIP4c3. Esta petición de señal estará vigente hasta el 23 de marzo.  Hay 17 propuestas activas/recientes con estado de Solicitud de Comentarios, la mayoría de las cuales son elegibles para ingresar al Ciclo de gobernanza de abril. Algunas, sin embargo, todavía necesitan más ajustes y una mejor definición antes de que puedan presentarse formalmente; otras tendrán que esperar hasta el Ciclo de la Gobernanza de mayo; y otras entrarán en el Ciclo Semanal en su lugar.   Discusiones Pre-MIP:  Propuesta Anti-Inflacionaria DAI respaldado por Subastas Módulo de Acceso Instantáneo (IAM) para Buffer de Excedentes Propuesta de Ideas en el Foro [Pre-MIP] Usando Gyroscope para Cortar el Nudo Cordiano del DAI: la Dependencia del USDC Una solución, del estilo de Activos del Mundo Real, para reemplazar los Módulos de Estabilización de la Paridad   Votaciones Ejecutivas La semana pasada, 18 de marzo de 2022, no hubieron votaciones ejecutivas. Las encuestas se incluirán en la próxima votación ejecutiva el 25 de marzo de 2022.  Encuestas de la Gobernanza Activas     Nombre de la Encuesta Votación Debate     Declaración de Intención - Invertir en Bonos de Corto Plazo (MIP13c3-SP12) Votar Debate   Desvinculación de Facilitadores (MDS-001) (MIP41c5-SP5) Votar Debate   Presupuesto de GovAlpha de 2022-2023 (MIP40c3-SP59) Votar Debate   Modificación del Presupuesto de Core Unit - Finanzas del Mundo Real (RWF-001) (MIP40c3-SP61) Votar Debate   Modificación del Presupuesto de la Core Unit de GovAlpha (MIP40c3-SP60) Votar Debate   Incorporar-Enmendar la Red Keeper - Red Gelato (MIP63c4-SP3) Votar Debate   Incorporar-Enmendar la Red Keeper - Red Keep3r (MIP63c4-SP2) Votar Debate   Pagos Rápidos para las Pequeñas Recompensas por Errores (MIP64, Enmienda de MIP40c3-SP42) (MIP4c2-SP17) Votar Debate    Compensanción de Delegados Reconocidos (MIP61) Votar Debate    Consulta la edición del 14 de marzo del Relay Semanal para obtener más información acerca de las encuestas que han finalizado recientemente.  Encuestas del Visto Bueno de la Comunidad No habrán encuentas del visto bueno de la comunidad para la semana del 15 - 21 de marzo de 2022. Consulta el punto de vista de “De Un Vistazo” sobre los tipos de Vault actuales y sus parámetros en MakerBurn.  Peticiones de Señal Activas Promover “MIP4c3-SP2: Encimiendas a la MIP62” a una encuesta on-chain @Patrick_J publicó una Petición de Señal tratando de medir el apoyo para ver si la MIP4c3-SP2 debe proceder a una encuesta on-chain; la cual contiene algunas enmiendas a las MIPs ya existentes, en respuesta a la salida de la Core Unit de Producción de Contenido. Esta Petición de Señal se encontrará vigente hasta el 23 de marzo de 2022, a las 8:30 PM. Promover la “MIP4c3-SP1: Enmendar la MIP64 para aclarar el monto crítico de recompensa web” a una encuesta on-chain Psychonaut presentó una petición de señal bastante directa. En cuestión: Enmendar la MIP64 para aclarar el monto crítico de recompensa web Consideraciones (ni pros, ni contras):  Aumentar el pago de los bugs web de gravedad crítica de 5 mil - 50 mil a un monto único de 50 mil. Reducir la negociación con respecto al monto de la recompensa por una gravedad crítica. Incrementar el incentivo para los hackers de sombrero blanco para buscar por posibles errores web de gravedad crítica.  Incorporación de D3M para Notional Finance El Delegado Reconocido GFX Lab manifestó su opinión de incorporar un D3M (Modulo de Depósito Directo del DAI) al fondo de préstamos para el vencimiento de 3 meses de Notional Finance, con un techo de deuda inicial de 10 millones de DAI (a menos que la Core Unit de Riesgo recomiende lo contrario).    [Signal Request] Onboard D3M For Notional Finance   Pros:  Aumento de Ingresos. Al momento de escribir este artículo, la tasa de tres meses en Notional está por arriba del 7%, en una base de alrededor de 85 millones de DAI. Por ejemplo, incluso una prueba de 10 millones de DAI DC pondría a un D3M de Notional entre los 10 millones mejor pagados (se estima que al momento de escribir este artículo, 10 millones de DAI solo suprimen las tasas a un 6%).   A continuación, se indican los ingresos anuales estimados de otros grandes grupos, a modo de referencia:   Mayor control sobre el front end de la curva de rendimiento. Estratégicamente, el uso de Maker de los D3M a través de múltiples lugares de préstamos va a ejercer más control sobre el mercado total, amortiguando los efectos de la liquidez fragmentada para el DAI, así como la volatilidad durante los descensos del mercado. Al ser bastante insensible a los costos del gas, el D3M de Maker para Aave ha permitido estabilizar la tasa de DAI incluso de cara a una fuerte volatilidad. La estabilización también puede ser aplicada a la porción más corta de la curva de rendimiento. Diversificación de las contrapartes. Actualmente, Maker se enfrenta al riesgo existencial de varias contrapartes: Circle, Lido, Bitgo, Paxos y, ocasionalmente, Aave. Al crecer la oferta de DAI y aumentar la tasa por la cual el Buffer de Excedentes crece, un programa de D3Ms diversificados avanza a la meta de reducir el exceso de dependencia de las contrapartes individuales. Riesgos crediticios conocidos y riesgos tecnológicos. Los riesgos representados por la exposición a plataformas de préstamos sobrecolateralizados de Notional Finance (que figuran en la lista de Contras) son riesgos en los que Maker tiene una profunda experiencia en evaluar y monitorear a través de las Core Units de Servicios de Ingeniería de Colaterales, Riesgos e Ingeniería de Protocolos. Reducción de la dependencia del colateral de stablecoins. Al momento de escribir este artículo, la oferta del DAI está respaldada en un 68% por colateral estable, cuya gran parte es de 5.300.000.000 USDC y casi 500.000.000 USDP. Los D3M pueden escalar rápidamente y solo son limitados por la deuda de sus mercados desplegados, permitiendo que crezcan a medida que la demanda de DAI crece en la plataforma de préstamos. Esto no solo aumenta la oferta de DAI, sino que también debería reducir la demanda de los PSMs, ya que habría métodos alternativos de obtener DAI.   Contras:  Riesgo de smart contracts (contratos inteligentes). En cualquier interacción de protocolo a protocolo, siempre hay un riesgo en smart contracts. Los pasos para mitigarlo, en caso de Notional Finance, incluyen una auditoría por parte de ABDK, un programa de compensación por detección de fallos en Immunefi de 1.000.000 de dólares, análisis mediante Code4arena, verificación formal a través de Certora y un reporte de diligencia pendiente por parte de Consensys. Riesgo de Multisig. Los mecanismos de la Gobernanza de Notional están todavía en las primeras fases de descentralización. Por el momento, partes clave del protocolo son gobernadas por 3 de 5 multi sigs.  No se ha establecido un calendario final, pero los poderes administrativos de la multisig están destinados a ser eliminados con el tiempo. Algo que posiblemente atenúe el riesgo para Maker es que uno de sus delegados; (GFX Labs) es uno de los firmantes y todos los firmantes están completamente doxados. Tenga en cuenta que otros colaterales subyacentes que ya están en el portfolio de Maker también incluyen gobernanza con multisigs, por lo que no se trata de un riesgo nuevo. Riesgo de Iliquidez. Si la cantidad de DAI en la pool de liquidez cae debido a que los LPs retiran su capital, puede que no haya liquidez suficiente para que Maker retire el 100% de su capital antes del vencimiento. Hay que tener en cuenta que Maker siempre podrá retirar su capital al vencimiento, independientemente de la liquidez en la pool. Este riesgo de iliquidez sólo se refiere a retiradas previas al vencimiento. Para mitigar esto, se puede tener en mente un escalado gradual de máxima exposición. Riesgo de pérdida de capital. Si las liquidaciones no se realizan correctamente, la pérdida de capital es un riesgo. Notional ha construido una infraestructura de liquidación fuerte y, actualmente, utiliza parámetros conservadores. Siendo una plataforma de préstamos sobrecolateralizados, el riesgo de deuda incobrable es, en principio, bajo. Aunque probablemente sea innecesario para Maker, también hay una cobertura disponible para Notional bajo Nexus Mutual. Riesgo de Oráculo. Notional utiliza Oráculos Chainlink para los 4 activos enumerados. Maker ya está expuesto al oráculo Chainlink a través de Aave y (próximamente) a través de Compound.    Incorporación de PAXG Otra Petición de Señal para la incorporación de un nuevo colateral fue propuesta por la Core Unit de Finanzas Estratégicas. Esta vez, para incorporar a PAXG (PAX Gold)    [Signal Request] Onboard PAXG   Pros:  Gold puede ser una pieza importantísima para DeFi. Cuando incorporamos WBTC, aún era pequeño y no estaba probado en DeFi; desde entonces, se ha convertido en un elemento importante, en parte gracias a MakerDAO. Lo mismo puede ocurrir con PAXG. DeFi puede proporcionar rendimiento para el oro y así atraer a gente de TradFi. Esta incorporación puede incrementar nuestra relación con Paxos. El dominio del Dólar Americano está bajo ataque (especialmente después del uso del dólar como arma) y una fuerte inflación viene en camino. Ambas cosas, son buenas para el oro.  Contras:  El oro puede caer en el olvido pronto. Los aumentos de tasas actuales son malas para el oro. PAXG esta centralizada por Paxos. Puede haber falta de demanda y podríamos incurrir en pérdidas y vernos desenfocados (costos de Oráculo).      Comunidad Deep Dai-ve  Tweet de la Semana   twitter.com    emiliano.eth 🇺🇦 🦇 🔊 @emilianobonassi  almost 2 years ago we had the BlackThursday and the community did a strong call to action to support@MakerDAO   look where we are now, we must celebrate how much we did so far 🥰  only up! twitter.com/brendan_opense…   Brendan from OpenSea @brendan_opensea  The #BackstopSyndicate is ready to participate in the @MakerDAO MKR auctions to repay the Multi-Collateral Dai system's debt.   We already have 350k Dai ready to bid if the price falls to 100 Dai / MKR.   Join us! Stand with #DeFi! Protect Dai!  https://t.co/R6wu0OtG0o https://t.co/mj9q30XVsX    10:49 AM - 20 Mar 2022           11                1             Posteos del Foro Un ecosistema DeFi de Activos del Mundo Real: más que solo incorporar un colateral @roollie de Centrifuge nos dio una descripción general del mercado de Activos del Mundo Real en Aave después de ver muchas preguntas de la comunidad de Maker al respecto. En caos de que no estés familiarizado, Aave permite crear mercados en el cual la gente pueda pedir prestado tokens depositando colaterales. Las tasas de intereses incrementan y disminuyen dependiendo de la utilización del mercado. El mercado de Activos del Mundo Real fue lanzado el 28 de diciembre del año pasado y representó el primer mercado diversificado de activos del mundo real en Aave. Inicialmente, el mercado se lanzó con siete pools y permitió a los proveedores de liquidez depositar USDC. Cuatro de las pools son vaults integradas de Maker. Actualmente, tiene un tamaño de mercado de US$19,1 millones, con 10,8 millones de USDC depositados. Con este mercado, cuando una pool desea incrementar su capital, los emisores pueden depositar tokens de pools en el protocolo de Aave y pedir prestado directamente a cualquier inversor del mercado de Activos del Mundo Real.  1134×490 94.2 KB  Esta fuente de financiamiento adicional, brinda estabilidad y longevidad, lo que brinda a los emisores la tranquilidad de saber que “existen fuentes confiables de ingresos en múltiples frentes, similares a las múltiples relaciones bancarias que podría tener una empresa tradicional”. Consulta el último posteo de “Foro de un Vistazo” para encontrar Posteos del Foro adicionales  Artículos   Una propuesta radical para revivir a la comunidad Roils de MakerDAO  “Hexonaut, un ingeniero de protocolos en MakerDAO, unió fuerzas con colegas y presentó una nueva propuesta de la Gobernanza llamada “Estrategia de Crecimiento Agresiva”. Invita a los miembros de Maker a considerar una serie de movimientos radicales para rejuvenecer el popular proyecto DeFi, incluido el aprovechamiento de activos del mundo real para apuntalar su fondo excedente. Los autores estiman que la medida generará entre $20 y $40 millones adicionales en ingresos anuales”.      Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada  Llamada de la Gobernanza y Riesgo Ep. 182:   Video | Foro    Enfoques #06 | Core Unit de Conocimiento de Datos:   Video | Foro    Llamada de Incorporación de Colaterales #39: D3M para Financiamiento Nocional:   Video | Foro      Próximas Llamadas  Enfoques #7: Principios del Préstamo de Activos del Mundo Real (RWA) | Martes, 2 de marzo de 2022, 4:00 PM UTC   Link para Unirse | Foro    Enfoques #8: stkMKR: Apostando y Revisión de la Tokenómica | Miércoles, 23 de marzo de 2022, 4:00 PM UTC   Link para Unirse | Foro      Gobernanza y Riesgo   Link para Unirse | Agenda - Jueves a las 16:00 UTC   Horas de Oficina de las Core Units   Link para Unirse | GovAlpha - Preguntas y Respuestas de la Gobernanza - Lunes 17:00 UTC  Link para Unirse | Seguridad Immunefi - Martes 00:00 UTC  Link para Unirse | Ingeniería del Protocolo - Martes 15:00 UTC  Link para Unirse | Escalado de Ecosistemas Sostenibles - Martes 15:30 UTC  Link para Unirse | Crecimiento - Miércoles 17:00 UTC  Link para Unirse | Finanzas del Mundo Real - Miércoles 17:00 UTC  Link para Unirse | Comunicaciones de Gobernanza - Viernes 18:00 UTC    Links Útiles Foro y Chat de Maker Discusiones y debates en MakerDAO. Calendario de Llamadas Público | Calendario de Votación & Eventos Público Suscripción para todas las llamadas públicas, votaciones y otros recordatorios. Herramientas de Participación Biblioteca de enlaces útiles para los Stakeholders; análisis de Protocolo, análisis de DAI, las métricas de colateral y liquidación, historia de la gobernanza e información sobre las subastas. Portal de Gobernanza Tabla de Votaciones para los votantes de MKR. Portal de MIPs Tabla de MIPs para todos. Portal de Aprendizaje y Portal de Documentación Técnica Aprende más sobre el protocolo de Maker.   ¿Tienes algún Feedback? ¡Valoramos tu opinión! Haz nuestra encuesta para hacernos saber qué se nos está pasando por alto o podemos mejorar. Descargo: Esta actualización fue ensamblada por un grupo de miembros que contribuyen a la comunidad de MakerDAO. La misma no debería servir como asesoría financiera ni como incentivo para votar de alguna forma específica. Esta actualización es meramente informativa y para fines de comunicación solamente.  Créditos @Artem_Gordon @nothsa  Esta es una traducción libre del artículo original en inglés gracias a @NCO y @Sebix ",
                    "links": [
                        "https://forum.makerdao.com/t/stkmkr-maker-staking-and-tokenomics-revision/13890",
                        "https://forum.makerdao.com/t/stkmkr-maker-staking-and-tokenomics-revision/13890/1",
                        "https://forum.makerdao.com/t/stkmkr-maker-staking-and-tokenomics-revision/13890/1",
                        "https://cointelegraph.com/news/makerdao-community-proposal-to-replace-mkr-governance-token",
                        "https://thedefiant.io/makerdao-proposal-dai-shake-up-tokenomics",
                        "https://forum.makerdao.com/t/anti-inflationary-proposal/13928",
                        "https://forum.makerdao.com/t/anti-inflationary-proposal/13928/1",
                        "https://forum.makerdao.com/t/anti-inflationary-proposal/13928/1",
                        "https://forum.makerdao.com/t/focus-on-8-stkmkr-staking-tokenomics-revision/14001",
                        "https://forum.makerdao.com/t/focus-on-8-stkmkr-staking-tokenomics-revision/14001/1",
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=N3Nzam90NTJ0cjdwMGI0bWtuZ3Z0ZG8ycjcgbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://www.crowdcast.io/e/focus-on-8",
                        "https://forum.makerdao.com/t/weekly-mips-update-79-pinata/14106",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://manual.makerdao.com/governance/voting-in-makerdao/practical-guide-voting",
                        "https://forum.makerdao.com/t/signal-request-promote-mip4c3-sp2-mip62-amendments-to-an-on-chain-poll/13972",
                        "https://forum.makerdao.com/t/mip4c3-sp2-mip62-amendments/13779",
                        "https://mips.makerdao.com/mips/details/MIP4#MIP4c3",
                        "https://forum.makerdao.com/t/weekly-mips-update-79-pinata/14106#things-to-come-crystal_ball-4",
                        "https://forum.makerdao.com/t/anti-inflationary-proposal/13928",
                        "https://forum.makerdao.com/t/auction-backed-dai/13011/11",
                        "https://forum.makerdao.com/t/premip-iam-for-surplus-buffer/11584",
                        "https://forum.makerdao.com/c/mips/proposal-ideas/21?order=activity",
                        "https://forum.makerdao.com/t/pre-mip-using-gyroscope-to-cut-through-dai-s-gordian-knot-its-usdc-dependency/8865",
                        "https://forum.makerdao.com/t/an-rwa-style-solution-to-replace-the-psm/8705",
                        "https://forum.makerdao.com/t/no-planned-executive-2022-03-18/13923",
                        "https://www.notion.so/fintechdiaries/Encuesta-de-Ratificaci-n-para-Declaraci-n-de-Intenci-n-Invertir-en-Bonos-de-Corto-Plazo-MIP13c3-S-eaa5d238b3e44afeb9fb6bb720e80b24",
                        "https://vote.makerdao.com/polling/QmR6QMt6?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/mip13c3-sp12-declaration-of-intent-invest-in-short-term-bonds/13084/1",
                        "https://www.notion.so/fintechdiaries/Encuesta-de-Ratificaci-n-para-la-Desvinculaci-n-de-Facilitadores-MDS-001-MIP41c5-SP5-14-de-mar-718fb86245ad4fe78045340a8405c741",
                        "https://vote.makerdao.com/polling/QmV3Lem7?network=mainnet",
                        "https://forum.makerdao.com/t/mip41c5-sp5-facilitator-offboarding/13005",
                        "https://www.notion.so/fintechdiaries/Encuesta-de-Ratificaci-n-para-el-Presupuesto-de-GovAlpha-de-2022-2023-MIP40c3-SP59-14-de-marzo-d-292278308de84781a4f0d9132ef2cca8",
                        "https://vote.makerdao.com/polling/QmSBytmr?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp59-govalpha-budget-2022-23/13144",
                        "https://www.notion.so/fintechdiaries/Encuesta-de-Ratificaci-n-para-la-Modificaci-n-del-Presupuesto-de-Core-Unit-Finanzas-del-Mundo-Real-4f125c111f234304b34407daf64b211a",
                        "https://vote.makerdao.com/polling/QmXDh7RR?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp61-modify-core-unit-budget-real-world-finance-rwf-001/13152",
                        "https://www.notion.so/fintechdiaries/Encuesta-de-Ratificaci-n-para-la-Modificaci-n-del-Presupuesto-de-la-Core-Unit-de-GovAlpha-MIP40c3-S-6c37cf9dd5e642f1a67c01712ffa15ea",
                        "https://vote.makerdao.com/polling/QmefuvKL?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/mip40c3-sp60-modify-govalpha-core-unit-mkr-budget/13145",
                        "https://www.notion.so/fintechdiaries/Encuesta-de-Ratificaci-n-para-Incorporar-Amendar-la-Red-Keeper-Red-Gelato-MIP63c4-SP3-14-de-ma-e15babe099a2455fa958cbff18bc16e3",
                        "https://vote.makerdao.com/polling/QmTnVxAL?network=mainnet",
                        "https://forum.makerdao.com/t/mip63c4-sp2-onboard-amend-keeper-network-keep3r-network/12748/1",
                        "https://www.notion.so/fintechdiaries/Encuesta-de-Ratificaci-n-para-Incorporar-Amendar-la-Red-Keeper-Red-Keep3r-MIP63c4-SP2-14-de-ma-4a8f35a113934652a0e031d08659f730",
                        "https://vote.makerdao.com/polling/QmaEfChz?network=mainnet",
                        "https://forum.makerdao.com/t/mip63c4-sp2-onboard-amend-keeper-network-keep3r-network/12748/1",
                        "https://www.notion.so/fintechdiaries/Encuesta-de-Ratificaci-n-para-los-Pagos-R-pidos-para-las-Peque-as-Recompensas-por-Errores-MIP64-En-e3ce0777b9124086a862532f0fcec677",
                        "https://vote.makerdao.com/polling/QmRdVByP?network=mainnet",
                        "https://forum.makerdao.com/t/mip4c3-sp1-rapid-payment-for-small-bug-bounties-mip64-mip40c3-sp42-amendment/12869",
                        "https://www.notion.so/fintechdiaries/Encuesta-de-Ratificaci-n-para-la-Compensanci-n-de-Delegados-Reconocidos-MIP61-14-de-marzo-de-202-d8df48a3d9e74cd3a687e1f2553215fe",
                        "https://vote.makerdao.com/polling/QmTvzCjL?network=mainnet",
                        "https://forum.makerdao.com/t/mip61-delegate-compensation/10640",
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-marzo/13987",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-promote-mip4c3-sp2-mip62-amendments-to-an-on-chain-poll/13972",
                        "https://forum.makerdao.com/t/signal-request-promote-mip4c3-sp2-mip62-amendments-to-an-on-chain-poll/13972",
                        "https://forum.makerdao.com/t/signal-request-promote-mip4c3-sp1-amend-mip64-to-clarify-critical-web-bounty-amount-to-on-chain-poll/13649",
                        "https://forum.makerdao.com/t/mip4c3-sp1-amend-mip64-to-clarify-critical-web-bounty-amount/13439",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782/1",
                        "https://github.com/notional-finance/contracts-v2/blob/master/audits/ABDK%20-%20Notional%20V2%2C%20Sept%201%202021.pdf",
                        "https://code4rena.com/reports/2021-08-notional/",
                        "https://github.com/notional-finance/contracts-v2/blob/master/audits/Certora%20-%20Formal%20Verfication%20Report%2C%20Nov%201%202021.pdf",
                        "https://etherscan.io/address/0x22341fB5D92D3d801144aA5A925F401A91418A05#readProxyContract",
                        "https://blog.notional.finance/understanding-liquidations/",
                        "https://forum.makerdao.com/t/d3m-risk-assessment/9353",
                        "https://forum.makerdao.com/t/compound-d3m-risk-assessment/12580",
                        "https://forum.makerdao.com/t/signal-request-onboard-paxg/13768",
                        "https://forum.makerdao.com/t/signal-request-onboard-paxg/13768/1",
                        "https://twitter.com/emilianobonassi/status/1505496762022248450",
                        "https://twitter.com/emilianobonassi/status/1505496762022248450",
                        "https://twitter.com/emilianobonassi/status/1505496762022248450",
                        "https://twitter.com/MakerDAO",
                        "https://twitter.com/brendan_opensea/status/1240655909468033027",
                        "https://twitter.com/brendan_opensea/status/1240655909468033027",
                        "https://twitter.com/emilianobonassi/status/1505496762022248450",
                        "https://forum.makerdao.com/t/a-rwa-defi-ecosystem-more-than-just-onboarding-collateral/14079",
                        "https://forum.makerdao.com/tag/forum-at-a-glance",
                        "https://thedefiant.io/makerdao-real-world-assets-proposal/",
                        "https://youtu.be/cMLUkPq7RNo",
                        "https://forum.makerdao.com/t/governance-and-risk-182-thursday-march-17-17-00-utc/13965",
                        "https://youtu.be/Kn_FT2EjdwQ",
                        "https://forum.makerdao.com/t/focus-on-6-data-insights-core-unit/13827",
                        "https://youtu.be/ccvPMQ4gm1A",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-39-d3m-for-notional-finance-signal-request-discussion/13828",
                        "https://www.crowdcast.io/e/focus-on-7",
                        "https://forum.makerdao.com/t/focus-on-7-rwa-lending-principles/14000",
                        "https://www.crowdcast.io/e/focus-on-8",
                        "https://forum.makerdao.com/t/focus-on-8-stkmkr-staking-tokenomics-revision/14001",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com/",
                        "https://chat.makerdao.com/",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forms.gle/Z2QAgywU2Sesm7Vy6",
                        "https://forum.makerdao.com/t/weekly-relay-march-15-21-2022/14119",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-mar-14-mar-25/14263"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.580212466931217
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "2",
                    "time": "24/03/2022-15:54:38",
                    "content": "Excelente trabajo Noe, me gusto la traduccion de los post hiperlinkeados e incluso las imagenes  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "2",
                    "time": "24/03/2022-17:58:18",
                    "content": "Me parece un gran trabajo en general, hace tiempo se necesitaba traducir las imagenes para tener un mejor entendimiento de lo descrito en el post. gran trabajo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#4",
                    "likes": "0",
                    "time": "05/04/2022-18:18:09",
                    "content": "muy buen traducción equipo! Felicitaciones. Son interesantes las propuestas. Me parece en particular lo más interesante, evaluar otros tipos de colaterales para mitigar fluctuaciones en el mercado. Por otro lado la idea de mejorar la seguridad y limitar ataques a la gobernanza a traves de stkMKR, suena interesante, aunque no se qué tan frecuentes son. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-1-7-de-marzo-de-2022/13773",
            "title": "Relay Semanal: 1 - 7 de Marzo de 2022 ",
            "index": 13773,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/NCO",
                    "index": "#1",
                    "likes": "6",
                    "time": "09/03/2022-14:06:18",
                    "content": " 1540×320 138 KB  ¡Hola a todos! ¡Gracias por consultar el Relay Semanal! Ya sea que tengas Maker (MKR) o DAI, poseas una Vault o quieras involucrarte más en la Gobernanza de MakerDAO, esta es tu parada rápida para estar al tanto de las actualizaciones del ecosistema de MakerDAO.  La versión pública en PDF en inglés se puede encontrar aquí   Eventos Actuales  Esta Semana en Gobernanza  Comunidad Deep Dai-ve  Anotaciones para el Calendario  Links Útiles  ¿Tienes algún feedback?   Eventos Actuales  ¿Qué Core Units necesita a continuación la DAO?  La Core Unit de Escalado de Ecosistemas Sostenibles publicó un posteo delineando el Programa de Incubación de Core Units rediseñado. Esta última iteración, destinada a mejorar el rendimiento y la eficacia, comienza en el segundo trimestre. El equipo ha elaborado una lista completa de ideas para ensamblar e incorporar nuevas Core Units:  Core Unit de Soporte de Reportes de Transparencia Core Unit de Control de Calidad de Softwares Core Unit de Soporte de Contabilidad Core Unit de Red Team Core Unit de Servicios de Revisión de MIPs Core Unit de Auditoría de Smart Contracts  Core Unit de Soporte de Gestión Core Unit de Auditoría de la Resiliencia de la DAO Core Unit de MarComms Core Unit de Eventos Core Unit de Desarrollo de la Comunidad Core Unit de Soporte de Makernaut Core Unit de Relaciones de Desarrolladores Core Unit de Adopción del DAI para Usuarios Finales Core Unit de Soporte de Integraciones Core Unit de Defensa y Política Pública Core Unit de Asesoramiento sobre Reglamentaciones de Políticas Core Unit de Autoseguro Core Unit de Coordinación de Red Legal Core Unit de Soporte de Incorporaciones Core Unit de Revisión Legal Core Units de Propósitos Especiales  Si bien aún faltan un par de semanas para el anuncio público completo sobre el Programa de Incubación rediseñado, la publicación ofrece una vista previa de algunos de los temas principales:    What Core Units does the DAO need next?    El cronograma tentativo al que apuntamos, tiene el inicio del programa en la segunda quincena de abril, con graduaciones en noviembre, es decir, en el último ciclo de la Gobernanza de 2022. El programa contará con tres pistas separadas: Divulgación, Resiliencia Legal y Transparencia, y Control de Calidad: tres currículos enfocados para que el candidato a facilitador elija, críticos para el desarrollo y la escala sostenible de MakerDAO. A diferencia del enfoque del año pasado de tener equipos completos de entrenadores, la temporada de este programa se centrará en capacitar a los candidatos a facilitadores. Centrar la atención en los candidatos a facilitadores tiene como objetivo aumentar la cantidad de Core Units incorporadas a la DAO durante el año y, al mismo tiempo, brindar la mejor experiencia de incorporación que empodere a los participantes para liderar con éxito sus equipos.    La lista de las nuevas Core Units potenciales y el rediseño del Programa de Incubación todavía no son finales y se encuentran actualmente bajo una intensa discusión.  Vía Rápida de Activos del Mundo Real En respuesta a las consultas y los comentarios en curso de los miembros de la comunidad y los creadores de Activos del Mundo Real (RWA, Real World Asset), GovAlpha envió una pretición de señal preguntando si MakerDAO debería hacer una “vía rápida” de los actuales procesos de RWA. El incorporar a los Activos del Mundo Real todavía es una tarea tediosa y riesgosa que requiere de diligencia y paciencia para ejecutar de manera eficiente y exitosa. Dado que los Activos del Mundo Real también se utilizan como colateral, estos introducen un riesgo monetario. Este riesgo se analiza y atiende cuidadosamente con la ayuda de varias Core Units, a quienes les molestó la idea de incluso enviar una encuesta pública para respaldar la acción para acelerar los Activos del Mundo Real. En la Llamada de la Gobernanza y Riesgo del 3 de marzo, se discutieron varios problemas que conciernen a esta petición de señal:  Falta de comunicación entre las Core Units Poca paciencia de parte de la comunidad y los creadores de Activos del Mundo Real Poca seriedad con respecto a la mitigación de riesgos   1720×960 188 KB  La gran mayoría de la comunidad votó por NO y cree que la vía rápida de Activos del Mundo Real es una receta para el desastre.  Dentro de los que respondieron, Nadia de la Core Unit de Crecimiento afirma: “¿Cómo podemos acelerar un proceso que es tan nuevo para todos, desde una perspectiva legal y técnica?” William, de la Core Unit de Finanzas del Mundo Real, también responde: “Este enfoque de “vía rápida” es profundamente inquietante. En esta etapa de la evolución de los Activos del Mundo Real, el permitir que los prestatarios realicen transacciones por cuenta propia en forma puramente DeFi, sin ninguna supervisión por parte del prestamista o diligencia debida con una amplia variedad de posibles colaterales y consideraciones del tipo de estructura, no se trata de dar una opción a los delegados y poseedores de tokens MKR. Se trata de diseñar una hoja de ruta para el comportamiento catastrófico del prestatario con muchas implicaciones para el riesgo crediticio en el núcleo del protocolo, es decir, DAI y MKR.” Eumenes, también de Finanzas del Mundo Real, cree que “Parece que los Prestatarios (originadores) quieren diseñar un proceso de revisión de Préstamos menos riguroso para que sea más probable que obtengan un Préstamo de Maker y, posiblemente, en términos más favorables. Esto probablemente aumentaría significativamente los riesgos en la cartera de activos de Activos del Mundo Real.”  Aunque esto ha iniciado una discusión apasionada sobre el tema, también se ha aclarado públicamente que MakerDAO no acelerará los Activos del Mundo Real en el corto plazo.   Esta Semana en la Gobernanza  Propuestas de Mejoras de Maker (MIPs - Maker Improvement Proposals) Actualización Semanal de MIPs #77 ¡La primera semana del Ciclo de la Gobernanza de marzo ha comenzado y la Ventana Formal de Presentación estará abierta por los próximos 2 días (hasta el miércoles)! ¡Las fechas de Solicitud de Comentarios (RFC - Request for Comments) y Presentación Final (FS - Final Submission) para referencia y las propuestas existentes se pueden ver en este registro de propuestas (en proceso)! ¡Cosas que se vienen!  ¡Las Encuestas de Ratificación se activarán el lunes 14 de marzo y se encontrarán vigentes por 14 días, hasta el lunes 28! Las propuestas presentadas formalmente serán revisados en la Llamada de Gobernanza y Riesgo del jueves 10 de marzo; así que ¡asegúrate de no perdértela!       Si estás trabajando en presentar una propuesta , ¡esta guía puede ser de ayuda! Para cualquier consulta, siéntete libre de contactar a @gala, @sebix o @blimpa!   Discusiones Pre-MIP:  DAI respaldado por subastas Módulo de Acceso Instantáneo para el Buffer de Excedentes [Pre-MIP] Usando Gyroscope para cortar con el nudo del Gordian del Dai: Dependencia del USDC Una solución al estilo de Activos del Mundo Real para reemplazar el PSM 1    Ideas de propuestas en el Foro   Votaciones Ejecutivas Distribución del Presupuesto de las Core Units, Compensación de Delegados Reconocidos, Cambio de Parámetros MOMC Esta propuesta ejecutiva ha sido aprobada el 04 de marzo de 2022 a las 22:41 UTC y ejecutada el 6 de marzo de 2022 a las 22:42 UTC. Los siguientes cambios se realizaron en el Protocolo de Maker:  Transferencias Presupuestarias de Core Units Según múltiples propuestas de presupuesto exitosas, un total de 397.184 DAI fueron transferidos a múltiples Core Units:     Core Unit Monto de DAI Propuesta     Servicios de Ingeniería de Colaterales 259.184 Propuesta   Seguridad Immunefi 138.000 Propuesta     Flujos Presupuestarios de Core Units Según múltiples propuestas de presupuesto exitosas, un total de 397.184 DAI fueron transmitidos a múltiples Core Units:     Core Unit Monto de DAI Duración Propuesta     Ingeniería de Colaterales 2.780.562 01-04-2022 hasta el 31-03-2023 Propuesta   Riesgo 2.760.000 01-03-2022 hasta el 28-02-2023 Propuesta   Seguridad Immunefi 207.000 01-03-2022 hasta el 01-12-2022 Propuesta     Compensanción a Delegados Reconocidos - Febrero 2022 Según estas exitosas encuestas de la Gobernanza (1, 2) y la prueba de compensanción de delegados que se encuentra en curso, un total de 57.665 DAI fue distribuido a ocho Delegados Reconocidos como se detalla debajo:     DAI Transferido Delegado     12.000 DAI FlipFlopFlap Delegate LLC   12,000 DAI schuppi   12.000 DAI Feedblack Loops LLC   8.512 DAI MakerMan   6.494 DAI ACREinvest   5.072 DAI monetsupply   927 DAI JustinCase   660 DAI GFX Labs     Cambios de Parámetro MOMC Según esta encuesta de la Gobernanza en la última propuesta del Comité de Mercados Abiertos de MakerDAO, los siguientes cambios de parámetros se realizaron en el Protocolo de Maker:     Parámetro Vault Cambio Anterior Nuevo     Techo de Deuda Máximo WSTETH-A + 100 millones de DAI 200 millones de DAI 300 millones de DAI   Techo de Deuda Máximo DIRECT-AAVEV2-DAI + 80 millones de DAI 220 millones de DAI 300 millones de DAI   Deuda Disponible Objetivo WSTETH-A + 10 millones de DAI 20 millones de DAI 30 millones de DAI   Deuda Disponible Objetivo DIRECT-AAVEV2-DAI + 15 millones de DAI 50 millones de DAI 65 millones de DAI   Tasa de Préstamo Objetivo DIRECT-AAVEV2-DAI -0.65% 3.5% 2.85%     Encuestas de la Gobernanza Activas     Nombre de la Encuesta Debate     Remoción de Parámetros para TUSD-A Debate   Restablecer el Buffer de Excedentes Lerp Debate    Consulta la edición del 28 de febrero del Relay Semanal para obtener más información acerca de las encuestas que han finalizado recientemente.  Encuestas del Visto Bueno de la Comunidad Actualmente, no se encuentra activa ninguna encuesta del visto bueno de la comunidad. Consulta el punto de vista de “De Un Vistazo” sobre los tipos de Vault actuales y sus parámetros en MakerBurn.  Peticiones de Señales Activas Vía Rápida de Activos del Mundo Real La Core Unit de GovAlpha ha posteado una petición de señal apuntando a:  Aclarar las opciones de los emisores de Activos del Mundo Real (RWA, Real World Assets) para incorporarse a Maker. Recopilar feedback sobre una idea de “proceso acelerado” para aliviar la fricción de los emisores de Activos del Mundo Real existentes que ya han trabajado con Maker en el pasado.  Actualmente, hay dos maneras principales en la que los emisores de Activos del Mundo Real pueden proponer su incorporación:  Trabajar con la Core Unit de Finanzas del Mundo Real usando el Ciclo Semanal de la Gobernanza. Proponer una nueva MIP.  El equipo de GovAlpha recomienda la primera opción. Con respecto a un proceso acelerado para los emisores ya existentes, @LongForWisdom señala que los emisores existentes notaron un retraso entre la propuesta de incorporación de un nuevo Activos del Mundo Real y la toma de decisiones concretas sobre esa propuesta. El objetivo del proceso acelerado es minimizar este retraso. Los Pros y Contras incluyen: Pro: Esto demostraría que Maker puede ser flexible y sensible a los problemas que enfrentan los emisores/organizadores de Activos del Mundo Real que desean trabajar con MakerDAO. Pro: Podría permitir que MakerDAO incorpore a Activos del Mundo Real mucho más rápido, lo que lleva a más DAI acuñado y mayores ingresos. Contra: Requiere que la Gobernanza de Maker decida si los colaterales propuestos son seguros y benefician a Maker sin la evaluación de las Core Units. Contra: Puede que Maker se exponga a riesgos adicionales debido a marcos de trabajo legales imperfectos. Contra: Debilita el mandato de la Core Unit de Finanzas del Mundo Real. Contra: Omite el proceso mensual de la Gobernanza. La discusión se encuentra activa. Comparte dos centavos y vota en la encuesta aquí. Promocionar “MIP4c3-SP1: Amendar la MIP64 para aclarar el monto crítico de la recompensa web” en una encuesta on-chain psychonaut presentó una petición de señal bastante directa: La cuestión: Amendar la MIP64 para aclarar el monto crítico de la recompensa web Consideraciones (no son Pros y Contras):  Incrementar el pago por errores web de gravedad crítica de 5.000/50.000 a un monto único de 50.000. Reducir la negociación con respecto al monto de la recompensa por una gravedad crítica. Incrementar el incentivo para los hackers de sombrero blanco para buscar por posibles errores web de gravedad crítica.    Comunidad Deep Dai-ve  Tweet de la Semana     twitter.com    Maker @MakerDAO  It's time to introduce you to the decentralized workforce of Maker ━ The Core Units.  Fully run by the DAO, the Core Units are decentralized groups that execute every necessary task within MakerDAO's goals.  This is how a next-generation decentralized workforce works.  👇  1/   3:00 PM - 1 Mar 2022           280                51             Posteos del Foro Propuesta de Compra de Vault/Préstamo/”Vínculo de Guerra” de Ucrania  @Allan_Pedersen presentó una encuesta informal proponiendo que Maker preste 1-5 millones de DAI a Ucrania para ayudarlos en su esfuerzo de guerra que tienen en curso. Si la comunidad apoya esta idea, Oasis Pro Market y Monetalis se han comprometido a ayudar a ejecutarlo utilizando colaterales del mundo real.    Ukraine Vault/Loan/\"War Bond\" Purchase Proposal   No puedo decirles, exactamente, en este momento cuáles serán los medios específicos de ejecución, pero me esforzaré por llegar a una situación en la que, como colateral del mundo real, tengamos una obligación de préstamo de la Nación de Ucrania (preferiblemente un vínculo reconocido) en poder de una estructura Monetalis-Maker BVI Trust (o similar) y luego establecer una vault específicamente para esta situación, una acuñación inmediata de DAI (y probable cambio a USD) y pago.   Al cierre de la encuesta informal, el 61%, de los 92 usuarios del foro que han votado, apoyan esta idea y el 81%, de los 63 usuarios que votaron por un monto, seleccionaron por 5 millones de DAI. Consulta el último posteo de “Foro de un Vistazo” para encontrar Posteos del Foro adicionales   Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada  Gobernanza y Riesgo #180 | Video  Conoce a tu Delegado #9 ft. Doo Wan Nam y Flipside Crypto | Video    Próximas Llamadas  Conoce a tu Delegadoe #10 ft. Hasu | Link para Unirse   Link del Foro | 2022-03-09T18:00:00Z   Gobernanza y Riesgo   Link para Unirse | Agenda - Jueves a las 16:00 UTC   Horas de Oficina de las Core Units   Link para Unirse | GovAlpha - Preguntas y Respuestas de la Gobernanza - Lunes 17:00 UTC  Link para Unirse | Seguridad Immunefi - Martes 00:00 UTC  Link para Unirse | Ingeniería del Protocolo - Martes 15:00 UTC  Link para Unirse | Escalado de Ecosistemas Sostenibles - Martes 15:30 UTC  Link para Unirse | Crecimiento - Miércoles 17:00 UTC  Link para Unirse | Comunicaciones de Gobernanza - Viernes 18:00 UTC    Links Útiles Foro y Chat de Maker Discusiones y debates en MakerDAO. Calendario de Llamadas Público | Calendario de Votación & Eventos Público Suscripción para todas las llamadas públicas, votaciones y otros recordatorios. Herramientas de Participación Biblioteca de enlaces útiles para los Stakeholders; análisis de Protocolo, análisis de DAI, las métricas de colateral y liquidación, historia de la gobernanza e información sobre las subastas. Portal de Gobernanza Tabla de Votaciones para los votantes de MKR. Portal de MIPs Tabla de MIPs para todos. Portal de Aprendizaje y Portal de Documentación Técnica Aprende más sobre el protocolo de Maker.   ¿Tienes algún Feedback? ¡Valoramos tu opinión! Haz nuestra encuesta para hacernos saber qué se nos está pasando por alto o podemos mejorar. Descargo: Esta actualización fue ensamblada por un grupo de miembros que contribuyen a la comunidad de MakerDAO. La misma no debería servir como asesoría financiera ni como incentivo para votar de alguna forma específica. Esta actualización es meramente informativa y para fines de comunicación solamente.  Créditos @Artem_Gordon @nothsa  Esta es una traducción libre del artículo original en inglés gracias a @NCO y @Sebix ",
                    "links": [
                        "https://forum.makerdao.com/t/what-core-units-does-the-dao-need-next/13594",
                        "https://makerdao-ses.notion.site/Core-Unit-Ideas-Comprehensive-List-2ce21712724f44d58b7e6f77888b0085",
                        "https://makerdao-ses.notion.site/Core-Unit-Ideas-Comprehensive-List-2ce21712724f44d58b7e6f77888b0085",
                        "https://forum.makerdao.com/t/what-core-units-does-the-dao-need-next/13594/1",
                        "https://forum.makerdao.com/t/what-core-units-does-the-dao-need-next/13594",
                        "https://forum.makerdao.com/t/signal-request-real-world-asset-fast-tracking/13563",
                        "https://youtu.be/qjg6cG7h_ak?t=2444",
                        "https://forum.makerdao.com/t/weekly-mips-update-77/13706",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://mips.makerdao.com/mips/md-viewer?mdUrl=https:%2F%2Fraw.githubusercontent.com%2Fmakerdao%2Fmips%2Fmaster%2Fmeta%2Fprimer_for_authors%2Fprimer_for_authors.md",
                        "https://forum.makerdao.com/u/gala",
                        "https://forum.makerdao.com/u/sebix",
                        "https://forum.makerdao.com/u/blimpa",
                        "https://forum.makerdao.com/t/auction-backed-dai/13011/11",
                        "https://forum.makerdao.com/t/premip-iam-for-surplus-buffer/11584",
                        "https://forum.makerdao.com/t/pre-mip-using-gyroscope-to-cut-through-dai-s-gordian-knot-its-usdc-dependency/8865",
                        "https://forum.makerdao.com/t/an-rwa-style-solution-to-replace-the-psm/8705",
                        "https://forum.makerdao.com/c/mips/proposal-ideas/21?order=activity",
                        "https://vote.makerdao.com/executive/template-executive-vote-core-unit-budget-distributions-recognized-delegate-compensation-momc-parameter-changes-march-4-2022?network=mainnet#proposal-detail",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP57",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP58",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP57",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP56",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP58",
                        "https://vote.makerdao.com/polling/QmPCbBu3?network=mainnet",
                        "https://vote.makerdao.com/polling/QmbvuhYH?network=mainnet",
                        "https://vote.makerdao.com/address/0xaf8aa6846539033eaf0c3ca4c9c7373e370e039b",
                        "https://vote.makerdao.com/address/0xb21e535fb349e4ef0520318acfe589e174b0126b",
                        "https://vote.makerdao.com/address/0x845b36e1e4f41a361dd711bda8ea239bf191fe95",
                        "https://vote.makerdao.com/address/0x22d5294a23d49294bf11d9db8beda36e104ad9b3",
                        "https://vote.makerdao.com/address/0x4d3ac33ab1dd7b0f352b8e590fe8b62c4c39ead5",
                        "https://vote.makerdao.com/address/0x45127ec92b58c3a89e89f63553073adcaf2f1f5f",
                        "https://vote.makerdao.com/address/0xcdb792c14391f7115ba77a7cd27f724fc9ea2091",
                        "https://vote.makerdao.com/address/0xf60d7a62c98f65480725255e831de531efe3fe14",
                        "https://vote.makerdao.com/polling/QmPhbQ3B",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-2022-02-24/13434",
                        "https://vote.makerdao.com/polling/QmVkRdjg?network=mainnet",
                        "https://forum.makerdao.com/t/proposed-parameters-for-offboarding-tusd-a/13506",
                        "https://vote.makerdao.com/polling/QmeAHmS2?network=mainnet",
                        "https://forum.makerdao.com/t/signal-request-bring-back-the-mkr-burn-part-ii/13146",
                        "https://forum.makerdao.com/t/relay-semana-22-28-de-febrero-del-2022/13587",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-real-world-asset-fast-tracking/13563",
                        "https://forum.makerdao.com/t/signal-request-real-world-asset-fast-tracking/13563",
                        "https://forum.makerdao.com/t/signal-request-promote-mip4c3-sp1-amend-mip64-to-clarify-critical-web-bounty-amount-to-on-chain-poll/13649",
                        "https://forum.makerdao.com/t/mip4c3-sp1-amend-mip64-to-clarify-critical-web-bounty-amount/13439",
                        "https://twitter.com/MakerDAO/status/1498674457929519105",
                        "https://twitter.com/MakerDAO/status/1498674457929519105",
                        "https://twitter.com/MakerDAO/status/1498674457929519105",
                        "https://twitter.com/MakerDAO/status/1498674457929519105",
                        "https://forum.makerdao.com/t/ukraine-vault-loan-war-bond-purchase-proposal/13529",
                        "https://forum.makerdao.com/t/ukraine-vault-loan-war-bond-purchase-proposal/13529/1",
                        "https://forum.makerdao.com/tag/forum-at-a-glance",
                        "https://www.youtube.com/watch?v=qjg6cG7h_ak",
                        "https://www.youtube.com/watch?v=hNMKg9BNWjU",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/86221714672?pwd%3DR3hpWVF1eCt5TEpqa0dRVkRRMnpRQT09&sa=D&source=calendar&ust=1647127056052738&usg=AOvVaw1sK6fehFYe__Y2yzTIADMZ",
                        "https://forum.makerdao.com/t/meet-your-delegate-9-hasu-no-longer-postponed/12944",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com/",
                        "https://chat.makerdao.com/",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forms.gle/Z2QAgywU2Sesm7Vy6",
                        "https://forum.makerdao.com/t/weekly-relay-march-1-7-2022/13731/1",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-feb-28-mar-11/13887"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7099206349206355
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#2",
                    "likes": "3",
                    "time": "09/03/2022-14:43:52",
                    "content": "Muy buen aporte y muy interesantes las propuestas de nuevas Core Unit por el enfoque que están mostrando. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#3",
                    "likes": "3",
                    "time": "09/03/2022-20:26:28",
                    "content": "Gracias por estos relay semanales @NCO @Sebix , me puse a leerlos desde noviembre para ir al dia con las novedades que fueron sucediendo los últimos meses   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#4",
                    "likes": "3",
                    "time": "09/03/2022-22:50:54",
                    "content": "Interesante selección de propuestas para las CUs! Especialmente aquellas relacionadas a la transparencia financiera. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#5",
                    "likes": "1",
                    "time": "10/03/2022-15:53:55",
                    "content": "Excelente trabajo Noe  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-15-21-de-febrero-del-2022/13404",
            "title": "Relay Semanal: 15 - 21 de febrero del 2022 ",
            "index": 13404,
            "category": [
                "Latin America"
            ],
            "tags": [
                "summary",
                "update",
                "espa\\xc3\\xb1ol",
                "latin-america",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#1",
                    "likes": "5",
                    "time": "23/02/2022-20:28:23",
                    "content": " 1078×208 98.1 KB  ¡Hola a todos! ¡Gracias por consultar el Relay Semanal! Ya sea que tengas MKR o DAI, tengas tu propia Vault o quieras involucrarte más en la Gobernanza, esta es tu parada obligatoria para estar al día con todo lo nuevo que traen las actualizaciones de MakerDAO.  Aquí  podrás encontrar la versión original en inglés en PDF.   Eventos Actuales  Esta Semana en Gobernanza  Comunidad Deep Dai-ve  Anotaciones para el Calendario  Enlaces Útiles  ¿Tienes algún comentario?   Eventos Actuales  Nuevo Candidato a Delegado lanza su Plataforma Doo Wan Nam, un colaborador de MakerDAO de hace mucho tiempo, ha propuesto su candidatura como delegado. La plataforma de Doo está enfocada en conectar las comunidades orientales y occidentales de MakerDAO, fomentando la diversidad de ideas y comunidades, así como la adopción de un enfoque pragmático para la resolución de problemas. Con su experiencia como líder para Corea representando a MakerDAO en el área de desarrollo de negocios y recientemente como miembro del equipo de Crecimiento, Doo está bien equipado para cumplir con las iniciativas. Vamos a estar presentando un encuentro de “Conoce a tu Delegado” por Zoom con Doo el 22 de marzo. Revisa el post del foro para más detalles.  Representando a MakerDAO en ETHDenver ¡Lo hemos pasado muy bien representando a MakerDAO en el evento ETHDenver de este año! En caso de que te lo hayas perdido, mira la charla de Creciendo como un DAO, y las experiencias de aprendizaje que hemos adquirido en este viaje, que dió Nadia Álvarez, Facilitadora de la Core Unit de Crecimiento. Revisa también el discurso de Retro sobre el Estado de la DAO para que estés al día con todo lo que hemos estado llevando a cabo últimamente y cómo creemos que lo estamos haciendo.   Esta Semana en Gobernanza  Propuestas de Mejora de Maker (MIPs) Actualización Semanal de MIPs #75  Estamos entrando en la segunda semana de las Encuestas de Ratificación. Asegúrate de revisar las propuestas que actualmente se encuentran presentadas y votar antes del lunes 28 de febrero. Si tienes alguna duda acerca del proceso de votación en MakerDAO, este manual te podría ayudar. Lo que se viene:  Si quieres que tu propuesta entre en el Ciclo de la Gobernanza de marzo, ¡el último día para realizar modificaciones es el 2 de marzo del 2022! La próxima Ventana de Presentación Formal estará abierta desde el lunes 7 de marzo hasta el miércoles 9 de marzo. ¿Estás planeando en presentar una nueva propuesta? ¡Recuerda postearla en el foro antes del miércoles 9 de marzo para que esta pueda ser elegible para ingresar en el Ciclo de la Gobernanza de abril!   Votaciones Ejecutivas Compensación a Delegados Reconocidos, Aumento del umbral del Apagado de Emergencia, Cambios en los Parámetros MOMC, Correcciones en el flujo del Presupuesto en DAI para las Core Units – 4 de febrero del 2022 Esta propuesta ejecutiva fue aprobada y se llevaron a cabo los siguientes cambios en el Protocolo de Maker:  Pagos de Compensación a los Delegados Reconocidos - Enero 2022 De acuerdo con estas encuestas de la Gobernanza que fueron aprobadas (1, 2) y la prueba de compensación de delegados aún vigente, se distribuyó un total de 54.752 DAI a ocho Delegados Reconocidos:     Monto de DAI Delegado     12.000 FlipFlopFlap Delegate LLC   12.000 schuppi   12.000 Feedblack Loops LLC   8.620 MakerMan   4.807 monetsupply   3.795 ACREinvest   889 JustinCase   641 GFX Labs    Puedes encontrar más detalles acerca del desgloce de la Compensación de Delegados de enero aquí, en el foro de MakerDAO.  Aumento en el Umbral del Módulo de Apagado de Emergencia Aumentar el umbral en 25.000 MKR para activar el Módulo de Apagado de Emergencia, pasando de 75.000 MKR a 100.000 MKR. Para más información, te recomendamos revisar la Petición de Señal inicial en el foro de MakerDAO. Más detalles acerca de los cambios que se llevaron a cabo en el Módulo de Apagado de Emergencia fueron posteados aquí, en el foro de Maker, por la Core Unit de Ingeniera de Protocolos.  Cambios en los Parámetros del MOMC Según esta encuesta de la Gobernanza sobre la última propuesta del Comité de Mercado Abierto de MakerDAO, se realizaron los siguientes cambios en los parámetros del Protocolo deMaker:     Parámetro Vault Cambio Previo Nuevo     Tarifa de Estabilidad ETH-A -0.25% 2.5% 2.25%   Tarifa de Estabilidad ETH-B -2.5% 6.5% 4.0%   Tarifa de Estabilidad WSTETH-A -0.5% 6.5% 4.0%   Tarifa de Estabilidad WBTC-A -0.25% 4.0% 3.75%   Tarifa de Estabilidad WBTC-B -2.0% 7.0% 5.0%   Tarifa de Estabilidad WBTC-C -0.75% 1.5% 0.75%   Tarifa de Estabilidad UNIV2DAIETH-A -1% 2% 1%   Tarifa de Estabilidad UNIV2WBTCETH-A -1% 3% 2%   Tarifa de Estabilidad UNIV2USDCETH-A -1.0% 2.5% 1.5%   Tarifa de Estabilidad GUNIV3DAIUSDC2-A -0.25% 0.5% 0.25%   Tarifa de Estabilidad TUSD-A -1% 1% 0%   Tasa de Préstamo Objetivo DIRECT-AAVEV2-DAI -0.25% 3.75% 3.5%   Techo de Deuda Máximo GUNIV3DAIUSDC1-A -400 millones DAI 500 millones DAI 100 millones DAI   Techo de Deuda Máximo GUNIV3DAIUSDC2-A 250 millones DAI 500 millones DAI 750 millones DAI   Deuda Disponible Objetivo GUNIV3DAIUSDC2-A 40 millones de DAI 10 millones DAI 50 millones DAI     Corrección en el Flujo Presupuestario de las Core Unit El voto ejecutivo anterior contenía errores relacionados al flujo presupuestario de DAI para la Core Unit de Ingeniería StarkNet y la Core Unit de Finanzas Estratégicas. El Equipo de Ingeniería de Protocolos ha posteado los detalles de este error en el foro de MakerDAO, el cual puedes encontrar aquí. Para poder corregir este error, se llevaron a cabo los siguientes cambios:   Serán cancelados los flujos de presupuesto actualmente configurados para las Core Units de Ingeniería StarkNet y Finanzas Estratégicas. Para poder mantener el acceso a los fondos del primer mes durante la actualización del flujo, estamos transfiriendo 42.917 DAI a la Core Unit de Ingeniería StarkNet a a0x6D348f18c88D45243705D4fdEeB6538c6a9191F1. La cantidad de 42.917 DAI transferidos es equivalente a un mes de financiación, de acuerdo con la última propuesta de presupuesto y se llevará a cabo reclamando los fondos del flujo cancelado más una transferencia de la diferencia entre 42.917 DAI y el monto reclamado.  214.583 DAI serán destinados a la Core Unit de Ingeniería StarkNet a 0x6D348f18c88D45243705D4fdEeB6538c6a9191F1, comenzando el 01-03-2022 y finalizando el 31-07-2022 como resultado de su última propuesta de presupuesto. Para poder mantener el acceso a los fondos del primer mes durante la actualización del flujo, estamos transfiriendo 82.417 DAI a la Core Unit de Finanzas Estrategicas a 0xf737C76D2B358619f7ef696cf3F94548fEcec379. La cantidad de 82.417 DAI transferidos es equivalente a un mes de financiación, de acuerdo con la última propuesta de presupuesto y se llevará a cabo reclamando los fondos del flujo cancelado, más una transferencia de la diferencia entre 82.417 DAI y el monto reclamado.  412,085 DAI serán destinados a la Core Unit de Finanzas Estrategicas a 0xf737C76D2B358619f7ef696cf3F94548fEcec379, comenzando el 01-03-2022 y terminando el 31-07-2022 como resultado de su última propuesta de presupuesto.    Encuestas de la Gobernanza Activas     Nombre de la Encuesta Votación Debate     Compensación de Delegado Retroactiva de MakerMan Votar Debate   Encuesta de Ratificación para Incorporar a 0xdeniz como Facilitador de DUX-001 - (MIP41c4-SP32) Votar Debate   Encuesta de Ratificación para Modificar el Presupuesto de la Core Unit de Riesgo, RISK-001 (MIP40c3-SP56) Votar Debate   Encuesta de Ratificación para Modificar el Presupuesto de la Core Unit - Servicios de Ingeniería Colateral, CES-001 (MIP40c3-SP57) Votar Debate   Encuesta de Ratificación de Enmiendas a la MIP55 (MIP4c2-SP16) Votar Debate   Encuesta de Ratificación para Modificar el Presupuesto de la Core Unit - Seguridad Immunefi (IS-001) (MIP40c3-SP58) Votar Debate   Encuesta de Ratificación para la Incorporación/Modificación de la Red Keeper - Tech-Ops (MIP63c4-SP1) Votar Debate   Encuesta de Ratificación para la Incorporación de la Core Unit de Maker Talent (MT-001) Votar Debate   Encuesta de Ratificación para la Asignación de Activos Intangibles (MIP60) Votar Debate    Consulta la edición del 14 de febrero del Relay Semanal para obtener más información acerca de las encuestas que han finalizado recientemente.  Encuestas del Visto Bueno de la Comunidad     Colateral Encuesta MIP9 Aplicación MIP6     PUNK (NTFX CryptoPunk) Termina el 07/03 a las 4PM UTC Solicitud    Consulta el punto de vista de “De Un Vistazo” sobre los tipos de Vault actuales y sus parámetros en MakerBurn.  Peticiones de Señales Activas Implementar la Prueba de Minería de la Gobernanza La señal cierra el 2 de marzo En los últimos meses, ha salido a la luz que hubo un descenso en la participación en la Gobernanza. Desafortunadamente, atraer votantes informados y comprometidos es un grave problema que aún no ha sido resuelto. @GFXlabs cree que es momento de tomar un enfoque práctico, a través de una prueba de minería de la Gobernanza para ayudar a mejorar la participación en las votaciones, para comparar las encuestas tratadas con potenciales pagos vs. encuestas antes y después del tratamiento, así como la diferencia entre tratadas/no tratadas y la participación de la Gobernanza un año antes. La prueba inicial está dirigida a encuestas, con métricas más sencillas para controlar. El diseño de esta prueba incluye un pago de garantía de 0,1 MKR proporcionado a cualquier address que contribuya con ≥ 1 MKR en un voto de no abstención en al menos una encuesta de baja participación. El máximo de 0,1 MKR puede ser enviado a cualquier address de cualquier individuo al día de cierre de esta prueba. Todas las recompensas en MKR se obtendrán de la tesorería de MakerDAO. Un presupuesto de 8 MKR será reservado para esta prueba. Esta prueba entrará en funcionamiento hasta que el presupuesto de MKR se agote o hayan transcurrido 6 semanas, lo que ocurra primero. Este diseño ofrece el potencial de realizar pagos sin que MakerDAO incurra en gastos y también provee una recompensa significativa para los poseedores de menor escala que estén dispuestos a brindar un servicio público a su costa. @GFXlabs se compromete a llevar el manejo de los reportes y la administración de esta prueba. Llevarán un registro y proporcionarán actualizaciones públicas sobre qué addresses (si es que las hay) serán elegidas para el pago de las garantías luego de cada fecha de prueba. @GFXlabs proporcionará un reporte escrito (a través del foro) y un reporte oral (si lo desea) en una llamada de Gobernanza y Riesgo, después de que termine la prueba.  Pros:  Incrementar potencialmente la participación en la Gobernanza, particularmente, entre poseedores de pequeña escala. Ofrece pagos sólo cuando se necesita un aumento marginal de la participación . Permite la experimentación con un mecanismo novedoso sin comprometerse a pagos grandes o continuos. Esta prueba será administrada por GFX Labs para evitar agregarle cargas de las Core Units a la Gobernanza.    Contras:  Podría incurrir en el gasto máximo de 8 MKR y 1000 DAI. Puede que no genere resultados concluyentes. Si se decide extender el plazo o hacerlo permanente, este programa podría requerir una mayor carga de trabajo para administrarlo de manera continua. Requerirá alguna medida de marketing/comunicación para que los poseedores de MKR conozcan este programa de prueba. Si la cantidad del pago de garantías de 0,1 MKR es muy baja como para atraer más votantes a las encuestas, entonces las recompensas serán destinadas a aquellos que ya votan, en vez de a los votantes marginales.   @GFXlabs consulta a la comunidad si MakerDAO debe poner en marcha la Prueba de Minería de la Gobernanza. Fondos para el Programa Piloto de Embajadores Financiar a la prueba piloto del Programa de Embajadores La señal cierra el 25 de febrero El financiamiento del Programa de Embajadores, que provee recursos y materiales educativos a comunidades que no tienen el inglés como primera lengua, se ha visto interrumpido por la remoción de MKT-001 (Producción de Contenidos). @Kat ha tomado la iniciativa de encabezar el Programa sin encontrarse adjunto a una Core Unit y está buscando 25.000 DAI para completar la prueba piloto y proyectos asociados durante los próximos 3 meses. Ella consulta a la comunidad si MakerDAO debería financiar la prueba piloto del Programa de Embajadores. Asignar 20 millones al Protocolo de Liquidación Uniswap V2 MKR/DAI LP La señal cierra el 3 de marzo En respuesta a un debate reciente, @psychonaut cree que el método más simple para mejorar la liquidez de MKR es agregar acciones LP de protocolo de liquidación Dai/MKR a UniV2. Él consulta a la comunidad si Maker debería asignar 20 millones a un protocolo de liquidación LP UniV2 MKR/Dai y presenta su argumento con los pros y contras:  Pros:  Simple No es necesario esperar los rediseños de los tokenomics radicales que han tenido dificultades para encontrar un consenso(e.g., Motor Sagittarius, gbMKR, etc.) Mayormente ortogonal a MKR subastas flap  Ayuda a identificar un precio mínimo y máximo para el MKR tanto para las subastas flap como para las flop  Automáticamente compra a un precio bajo, vende a uno alto y captura el movimiento. Obtiene algún rendimiento sobre el capital inactivo que se encuentra en la reserva de buffer Muy eficiente con respecto al gas (i.e., setéalo y olvídate de él)  Contras:  Interfiere, potencialmente, con la capacidad de recaudar muchos DAI de las ventas de MKR La estrategia comercial es prácticamente opuesta a las subastas flop    Traigan de vuelta la quema de MKR - Parte II La señal cierra el 4 de marzo @ultraschuppi afirma que el reciente voto ejecutivo para deshabilitar temporalmente las Subastas deEexcedentes y la quema de MKR tenía intenciones de volver a la mecánica lerp original. Sin embargo, una encuesta on-chain agregó un Limitador de Tasas al Módulo Flapper. En respuesta, Schuppi pregunta a la comunidad si el protocolo debería regresar a la configuración de quemado parcial anterior, que se aceptó en noviembre, pero con las siguientes condiciones:  El Limitador de Tasas se instaló en la red principal; esto tomará un par de semanas. Se seteó una configuración inicial par el Limitador de Tasas.    Comunidad Deep Dai-ve  Tweet de la Semana     twitter.com    definikola.eth @definikola  Protocol#4 -@MakerDAO  Maker is an OG lending protocol that makes it possible to generate so far the most adopted decentralized stablecoin - $DAI  Anyone trying to get into DeFi, especially lending, should learn about the core principles of Maker and over-collateralization.   3:49 PM - 21 Feb 2022           46                40             Posteos del Foro: Liquidez de Mercado para DAI y MKR El colaborador de la Core Unit de GovAlpha, @LongForWisdom, ha publicado la segunda parte de esta serie para facilitar la discusión acerca de cómo y por qué incrementar la liquidez de mercado del DAI y el MKR. Mientras que en la Primera Parte se debatía la Decisión 1: ¿Cómo puede MakerDAO financiar su estrategia de liquidez?, la Segunda Parte se enfoca en la Decisión 2: ¿Qué busca lograr nuestra estrategia de liquidez? Y ¿Cómo? La Segunda Parte se enfoca principalmente en los objetivos: ¿Qué gana MakerDAO con la aplicación de una estrategia de liquidez de mercado? Y la Tercera Parte se enfocará en los métodos prácticos para lograr estos objetivos. El post destaca tres posibles objetivos que una estrategia de liquidez puede tratar de alcanzar y qué es lo que los hace deseables.  Incrementar la adopción de DAI en L2s, sidechains y otras cadenas L1 Incrementar la adopción de DAI en otras cadenas aumentará la demanda de DAI directa e indirectamente, lo que terminará en “convertirse directamente en ingresos y beneficios” para MakerDAO.  Intento de agregar DAI a las filas de USDC y ETH como token de ruta por defecto para la liquidez on-chain  Asegurar un lugar junto a ETH y USDC como tokens de ruta por defecto aumentará drásticamente la demanda de DAI y fomentará una mayor adopción.  Amortiguar los movimientos de precios de los MKR y aumentar la facilidad de entrada y salida del token Mejorar la liquidez del MKR a través del mercado ayudará a reducir su volatilidad, mejorando la resistencia de MakerDAO. También facilitará a los poseedores de MKR, así como a usuarios que sean potenciales poseedores, entrar y salir de sus posiciones. Para conocer más detalles acerca de estos objetivos, revisa el post completo, sus potenciales riesgos y beneficios, así como un debate acerca de cómo podemos llegar a cumplirlos. Consulta el último posteo de “Foro de un Vistazo” para encontrar Posteos del Foro adicionales  Artículos El Proceso de Descentralización de MakerDAO para disolver la Fundación MakerDAO, el Protocolo DeFi, planea completar su hoja de ruta para descentralizar la Gobernanza con la disolución de su fundación. Nadia Álvarez, Facilitadora de Crecimiento en MakerDAO se unió a “All About ETH” (Todo acerca de ETH) en vivo en ETHDenver 2022, para discutir el viaje de la descentralización y las principales lecciones que se aprendieron. Nadia también habla sobre si el movimiento hacia la DAO-ificación es solo una tendencia o una revolución a largo plazo.   Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada No hubo grabación de llamadas la semana pasada debido al evento ETHDenver.  Próximas Llamadas  Enfoques #5: AMA con el Equipo de Centrifuge | 23-02-2022T17:00:00Z   Foro | Link para Unirse Código: COREUNIT      Gobernanza y Riesgo   Link para Unirse | Agenda - Jueves a las 16:00 UTC   Horas de Oficina de las Core Units   Link para Unirse | GovAlpha - Preguntas y Respuestas de la Gobernanza - Lunes 17:00 UTC  Link para Unirse | Seguridad Immunefi - Martes 00:00 UTC  Link para Unirse | Ingeniería del Protocolo - Martes 15:00 UTC  Link para Unirse | Escalado de Ecosistemas Sostenibles - Martes 15:30 UTC  Link para Unirse | Crecimiento - Miércoles 17:00 UTC  Link para Unirse | Comunicaciones de Gobernanza - Viernes 18:00 UTC    Links Útiles Foro y Chat de Maker Discusiones y debates en MakerDAO. Calendario de Llamadas Público | Calendario de Votación & Eventos Público Suscripción para todas las llamadas públicas, votaciones y otros recordatorios. Herramientas de Participación Biblioteca de enlaces útiles para los Stakeholders; análisis de Protocolo, análisis de DAI, las métricas de colateral y liquidación, historia de la gobernanza e información sobre las subastas. Portal de Gobernanza Tabla de Votaciones para los votantes de MKR. Portal de MIPs Tabla de MIPs para todos. Portal de Aprendizaje y Portal de Documentación Técnica Aprende más sobre el protocolo de Maker.   ¿Tienes algún Feedback? ¡Valoramos tu opinión! Haz nuestra encuesta para hacernos saber qué se nos está pasando por alto o podemos mejorar. Descargo: Esta actualización fue ensamblada por un grupo de miembros que contribuyen a la comunidad de MakerDAO. La misma no debería servir como asesoría financiera ni como incentivo para votar de alguna forma específica. Esta actualización es meramente informativa y para fines de comunicación solamente.  Esta es una traducción libre del artículo original en inglés gracias a @Joserjimz y @NCO ",
                    "links": [
                        "https://pdfhost.io/v/GnXGWu8.F_Weekly_Relay__February_15_21_2022",
                        "https://forum.makerdao.com/t/doo-delegate-platform/13246",
                        "https://forum.makerdao.com/t/meet-your-delegate-10-doo/13248",
                        "https://www.youtube.com/watch?v=B2rSkv1Xk3o",
                        "https://www.youtube.com/watch?v=z9JBTlfXas4",
                        "https://forum.makerdao.com/t/weekly-mips-update-75/13330",
                        "https://manual.makerdao.com/governance/voting-in-makerdao/practical-guide-voting",
                        "https://vote.makerdao.com/executive/template-executive-vote-recognized-delegate-compensation-raise-the-emergency-shutdown-threshold-momc-parameter-changes-core-unit-dai-budget-stream-corrections-february-04-2022?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/polling/QmPCbBu3?network=mainnet",
                        "https://vote.makerdao.com/polling/QmbvuhYH?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/recognized-delegate-compensation-breakdown-january-2022/13001",
                        "https://makerdao.world/en/learn/governance/emergency-shutdown",
                        "https://forum.makerdao.com/t/signal-request-raise-threshold-for-emergency-shutdown-module/12208",
                        "https://forum.makerdao.com/t/moving-the-esm-threshold-increase-to-next-week/12895",
                        "https://vote.makerdao.com/polling/QmWReBMh",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-2022-01-27/12883",
                        "https://vote.makerdao.com/executive/template-executive-vote-core-unit-budget-transfers-and-streams-january-28-2022?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/correction-to-last-weeks-executive/13022",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP19",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP47",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP19",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP47",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP27",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP46",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP27",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP46",
                        "https://vote.makerdao.com/polling/QmR2DX4L?network=mainnet",
                        "https://forum.makerdao.com/t/signal-request-makerman-retroactive-delegate-comp/13051",
                        "https://vote.makerdao.com/polling/QmR3DeK2?network=mainnet",
                        "https://forum.makerdao.com/t/mip41c4-sp32-facilitator-onboarding-to-dux-001-0xdeniz/12559",
                        "https://vote.makerdao.com/polling/Qmb6o8ua?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp56-modify-core-unit-budget-risk-001/12587",
                        "https://vote.makerdao.com/polling/Qmb6o8ua?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp57-modify-core-unit-budget-collateral-engineering-services-ces-001/12578",
                        "https://vote.makerdao.com/polling/QmTRMFXz?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp57-modify-core-unit-budget-collateral-engineering-services-ces-001/12578",
                        "https://vote.makerdao.com/polling/QmaBYzea?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp58-modify-core-unit-budget-immunefi-security-core-unit-budget-is-001/12598",
                        "https://vote.makerdao.com/polling/QmbsvbsA?network=mainnet",
                        "https://forum.makerdao.com/t/mip63c4-sp1-onboard-amend-keeper-network-tech-ops/12739",
                        "https://vote.makerdao.com/polling/QmTKSjCM?network=mainnet",
                        "https://forum.makerdao.com/t/mip39c2-sp28-adding-maker-talent-core-unit-mt-001/12075",
                        "https://vote.makerdao.com/polling/QmWDna6r?network=mainnet",
                        "https://forum.makerdao.com/t/mip60-intangible-asset-assignment/10319",
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-febrero-de-2022/13294",
                        "https://vote.makerdao.com/polling/QmWT8dH6?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/punk-collateral-onboarding-application/12992",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-implement-governance-mining-trial/13271",
                        "https://forum.makerdao.com/t/improving-governance-participation-rate-at-makerdao/11706",
                        "https://forum.makerdao.com/t/signal-request-fund-ambassadors-program-pilot/13199",
                        "https://forum.makerdao.com/t/signal-request-fund-ambassadors-program-pilot/13199",
                        "https://i.pinimg.com/originals/7a/f9/08/7af9082a3a102a39617ebcda86a4d65e.jpg",
                        "https://vote.makerdao.com/polling/QmYk1XN5?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/signal-request-allocate-20m-to-protocol-owned-uniswap-v2-mkr-dai-lp/13150",
                        "https://forum.makerdao.com/t/sagittarius-engine/10852",
                        "https://forum.makerdao.com/t/signal-request-gbmkr-a-proposal-to-benefit-long-term-mkr-holders/12756",
                        "https://manual.makerdao.com/parameter-index/surplus-auction",
                        "https://manual.makerdao.com/parameter-index/debt-auction",
                        "https://forum.makerdao.com/t/signal-request-bring-back-the-mkr-burn-part-ii/13146",
                        "https://vote.makerdao.com/polling/QmUqfZRv?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/rate-limited-flapper/13056",
                        "https://forum.makerdao.com/t/rate-limited-flapper/13056#next-step-setting-lid-3",
                        "https://twitter.com/definikola/status/1495787723814281217",
                        "https://twitter.com/definikola/status/1495787723814281217",
                        "https://twitter.com/definikola/status/1495787723814281217",
                        "https://twitter.com/search?q=%234",
                        "https://twitter.com/MakerDAO",
                        "https://twitter.com/definikola/status/1495787723814281217",
                        "https://forum.makerdao.com/t/framing-the-debate-on-market-liquidity-part-one-funding/13096",
                        "https://forum.makerdao.com/t/framing-the-debate-on-market-liquidity-part-two-strategic-goals/13334",
                        "https://forum.makerdao.com/t/framing-the-debate-on-market-liquidity-part-two-strategic-goals/13334",
                        "https://forum.makerdao.com/tag/forum-at-a-glance",
                        "https://youtu.be/w9HQ-eayMqE",
                        "https://forum.makerdao.com/t/focus-on-5-ama-with-the-centrifuge-team/13230",
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com/",
                        "https://chat.makerdao.com/",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forms.gle/Z2QAgywU2Sesm7Vy6",
                        "https://forum.makerdao.com/t/weekly-relay-february-15-21-2022/13348",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-feb-14-feb-25/13462"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.444791666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "2",
                    "time": "24/02/2022-14:09:30",
                    "content": "Excelente trabajo Jose  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#3",
                    "likes": "1",
                    "time": "25/02/2022-04:23:09",
                    "content": "Gracias @Alefcripto  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "725"
}