{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/decentralized-voter-committee-on-tuesday-5pm-cest-all-mkr-holders-welcome/15166",
            "title": "Decentralized Voter Committee on Tuesday 5pm CEST - all MKR holders welcome ",
            "index": 15166,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "voter-committee",
                "pubcall-:-voter-committee"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "27",
                    "time": "13/05/2022-09:57:25",
                    "content": "Hi everyone, I’m Rune, Co-founder of Maker and former CEO of the Maker Foundation, and nowadays “just” a large holder of MKR tokens. In the last year, other than posting the original Case for Clean Money, I have mostly been out of the loop and passively delegated my MKR to the recognized delegates. As a large MKR holder that has a lot of backchannel access to what’s happening in the core of the DAO, I believe that it is extremely important that other MKR holders also get access to the inner workings. However, I think that unfortunately the organic development of the DAO right now is in a “complexity spiral” where it gets harder and harder for someone who’s not a full time professional deep in the inner workings of the DAO to understand what’s going on and how decisions are made, and this creates a risk to decentralization. In response to this, I have been developing a strategy I call the Endgame Plan, a followup to the Clean Money vision that aims to establish principles that enshrine radical decentralization and transparency as fundamental pillars for how governance works, and that creates a bounded, immutable scope of Maker Governance that it cannot expand beyond in order to prevent organic complexity growth. The very first step of this plan is to establish Decentralized Voter Committees - conference calls that are transparent and recorded - fully available to the broader DAO and public - where MKR holders get together to create a “safe space” for MKR holders to discuss their interests, and coordinate on votes to ensure that the core feedback loop of Maker Governance remains functional (MKR holders make the decisions and are on the hook for the consequences of those decisions). Given recent events, both internally in Maker Governance and in particular the meltdown of Terra which in my opinion makes a long term crypto winter very likely, I believe now is the time to act on this plan and hold a first Decentralized Voter Committee meeting to get MKR holders together, so I plan to do that on Tuesday 5pm CEST Just to make sure this is not misunderstood, the call is essentially just a private call held by me, that I choose to make transparent. However, the context of the call is that I am a large MKR holder with more than 70k MKR available to vote with, and I will use this call to inform my decisions about how to vote with my MKR, as well as express my own views. Primarily this is for other MKR holders, large and small, that are not a part of the established workforce and currently don’t have insight into the inner workings, as well as delegates. I will try to have other MKR whales show up as well, so we can attempt to establish a genuine connection between grassroots community wisdom of the crowd and vote outcomes. It is of course absolutely vital that we bring in the professional opinions of Core Units to inform our decisions as voters, and in particular the Core Units that have more supporting roles, such as Strategic Finance and Sustainable Ecosystem Scaling are a good start to try to get a view of what is going on in the Core Units and how they are organized. This first call will be a bit of a test run, and I expect that there will be a lot of interest because this attempt to switch the balance of power to a new and transparent high level decision making structure is a tectonic shift. So initially it might not be possible to invite all MKR holders to join the call directly. In general I want to make sure we have all kinds of MKR holders represented (large and small, vocal and more quiet etc), however I will be biased towards making sure we have more activity from larger MKR holders because they have more skin in the game and a larger sway on votes. The best place to start would be if MKR holders who are interested in playing a larger role in information gathering and decision making for the DAO - through a structure that is set up explicitly for their benefit where you can directly influence large MKR holders like me - could post in this thread who you are and how much MKR you have, as well as what you believe are the most important issues in the DAO right now (this could be thoughts about initiatives you support or are against, or initiatives you think are missing, as well the most pressing question right now which is how to prioritize) ",
                    "links": [
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-6/15313",
                        "https://forum.makerdao.com/t/relay-semanal-10-16-de-mayo-de-2022/15289",
                        "https://forum.makerdao.com/t/relay-semanal-21-27-de-junio-del-2022/16272",
                        "https://forum.makerdao.com/t/weekly-relay-may-10-16-2022/15238",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-12-18-2022/15280",
                        "https://forum.makerdao.com/t/weekly-relay-june-21-27-2022/16158",
                        "https://forum.makerdao.com/t/govalpha-gov-001-quarterly-review-q1-2022/15589"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.866104163326385
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#2",
                    "likes": "4",
                    "time": "13/05/2022-19:35:06",
                    "content": "Here is the link in advance that will be used for the meeting: https://meet.google.com/pqw-fweh-kvp ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#4",
                    "likes": "3",
                    "time": "17/05/2022-14:54:04",
                    "content": "The call will begin in a few minutes. If the google meet gets filled and more still try to join, then we will switch to using a zoom call and I will post the link in this thread ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#5",
                    "likes": "2",
                    "time": "18/05/2022-09:22:52",
                    "content": "can someone summarise what was discussed, unfortunately I could not attend. But I like it very much and would like to see more of it in the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.324999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#6",
                    "likes": "5",
                    "time": "18/05/2022-09:41:00",
                    "content": "@iammeeoh posted a summary here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "17/08/2022-15:41:58",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}