{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dux-roadmap-spotlight-q3-2022/16372",
            "title": "DUX Roadmap Spotlight: Q3 2022 ",
            "index": 16372,
            "category": [
                "Core Units",
                "Development & UX"
            ],
            "tags": [
                "cu-update",
                "dux-001",
                "roadmap-spotlight"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#1",
                    "likes": "6",
                    "time": "06/07/2022-14:38:04",
                    "content": " Introduction Hi all  As we’ve slowly transitioned into the third quarter of this crazy year I’m happy to share yet another quarterly roadmap update on behalf of the DUX Core Unit. Our process is to revisit our roadmap every three months through a forum post like this, in which we wrap up the past quarter and commit to a focus for the next quarter. We’ll touch upon prior commitments and the progress we’ve made, lessons learned, and ofcourse the roadmap focus for the upcoming three months. Besides these quarterly updates we also provide monthly CU updates. Enjoy the read and please do reply below if you have questions or suggestions!    Instead of reading, also consider watching the recorded walkthrough below in which I’ll talk you through this update.        Looking back: Q2 2022 The past three months our team has been heads-down to work on our prior roadmap commitments and contribute to other relevant initiatives within MakerDAO. In addition we’ve laid the groundwork for future product work through technical research and optimisations. Lastly, we’ve delivered a full-day design thinking workshop as part of the devconnect conference, organized by the Ethereum Foundation in Amsterdam. All in all; a productive quarter we can be proud of!   For those who are not yet familiar with the DUX (Development & UX) Core Unit, please head out to our Notion website.   What we’ve committed to Three months ago we committed to the following () roadmap items, to be delivered in Q2 of this year.  Q2: Commitments960×540 187 KB   What we’ve delivered I’m proud to report that we’ve been effective at delivering on our roadmap commitments. As you can see below, most of the roadmap items have been successfully delivered. Some (eg. gasless voting and delegate migration) are still in progress but most of the heavy lifting has been done. Others (eg. cross-CU spell creation) have been cancelled or deferred in consultation with other relevant Core Units.    Please refer to the recorded voiceover for an elaboration of each item’s status!  Below you’ll find an at-a-glance report of the Q2 roadmap result   Q2: Delivered960×540 186 KB  Here’s a list of the delivered features since April 1st.   All full release notes can be found here on our Notion website   Q2: Delivered, all features960×540 178 KB  Here’s a quick overview of the non-product related work we’ve delivered over the past three months.   Q2: Delivered, non-product960×540 186 KB   What we’ve learned These past three months we’ve been running very smoothly as a team, which enabled us to be more pro-active within MakerDAO and also explore other types of contributions (such as organizing a cross-org workshop). More importantly; we’ve seen the governance landscape at MakerDAO shift. A sharp increase in  governance activity through # of unique votes,  # of delegates (both shadow and recognized) and  in traffic to the Governance Portal. All the aforementioned lead us to the following learnings over the past three months.    We need to make governance metadata fetching & handling more scalable.   Creative facilitation is needed in remote orgs, and extremely powerful cross-org.   Good ideas are there but difficult to validate and coordinate around.      Please refer to the recorded voiceover for an elaboration on each of these!   Looking ahead: Q3 2022  Roadmap focus For this upcoming quarter we’ve decided to keep our roadmap focus very narrow, based on the following assumptions:  Delegate contracts are nearing expiry and the Governance Portal needs to facilitate the migration process Gasless poll voting is (by far) the most relevant and impactful thing to work on Summer vacations will negatively impact our team’s development capacity  Below you’ll find our roadmap focus for Q3 2022   Once again; refer to the recorded voiceover for more details on each of the items.  DUX roadmap spotlight Q3 &#39;22 (4)960×540 136 KB   Wrapping up Some closing words; with the bear market in full swing we’re going through a crucial phase for MakerDAO. The following months will determine our trajectory for the years to come, and as DUX team we’ll do our best to contribute to the consensus-formation process through evolving our governance tooling (in close collaboration with @GovAlpha-Core-Unit). In addition we’re going to explore a collaboration with MakerDAO’s ‘operations’ core units (being SES, GovAlpha, GovComms and DUX) to harmonize the governance processes, information/communication flows, collaboration methods and open-source frontends. Lastly; DUX will commit to being flexible and malleable as the MakerDAO organization evolves. We’re first and foremost a well-oiled web3 product team with R&D capability and deep knowledge of MakerDAO & the Maker Protocol—I’m confident we can make ourselves useful for any future state of the DAO. With that being said; we’re back to work.    Feel free to engage with us in the comments below in case you have any feedback, questions, feature requests or ideas for Maker’s governance tooling or process.   Thank you for reading!  ",
                    "links": [
                        "https://www.youtube.com/watch?v=ciqUrA-ka1w",
                        "http://dux.makerdao.network/",
                        "https://youtu.be/ciqUrA-ka1w",
                        "https://makerdux.notion.site/Release-Notes-57ce7bad1723497e9826815ee53e4b5f",
                        "https://youtu.be/wk91jRpcqGg",
                        "https://youtu.be/ciqUrA-ka1w",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-june-2022/16783",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-junio-del-2022/16923",
                        "https://forum.makerdao.com/t/dao-resilience-improvement-initiative-status-update/16413",
                        "https://forum.makerdao.com/t/mip40c3-sp82-modify-development-ux-core-unit-budget-dux-001/17611"
                    ],
                    "GPT-summary": "The post is an update on the DUX Core Unit's quarterly roadmap, outlining their progress on previous commitments and their focus for the upcoming quarter. The author explains the team's achievements, what they have learned, and their plans for the future. The post invites feedback, questions, and suggestions from readers.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.880024509803921
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "3",
                    "time": "06/07/2022-14:41:54",
                    "content": "Absolute beast of a CU. Great job DUX! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#3",
                    "likes": "0",
                    "time": "07/07/2022-09:35:35",
                    "content": "Note: We provided an update regarding budgetting in the thread linked below     [BEAR] CU Facilitators: Transparent and Proactive Cash Management Strategic Finance       Reporting in on behalf of the DUX Core Unit   Year-to-date monthly spend over 2022  According to our monthly budget statements, there are a few corrections to be made to the on-chain spend overview provided by SF CU:    January & February 2022: The report states incorrect numbers, however the aggregated amount is accurate (being: 182,660 DAI). The actual spend for January is 86,500 DAI (as opposed to 47,000 DAI, and for February the actual spend is 96,160 DAI (as opposed to 135,660…     ",
                    "links": [
                        "https://github.com/makerdao-dux/transparency-reporting/tree/main/Monthy%20Budget%20Statements"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "05/10/2022-09:36:00",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}