{
    "poll_list": [
        {
            "title": "Budget Ratification Poll for Modify Growth Core Unit Budget, GRO-001 (MIP40c3-SP70) - June 13, 2022",
            "index": "15102",
            "option": "NO_RESULT",
            "supporting_mkr": "-1",
            "highest_fraction": -1
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp70-modify-growth-core-unit-budget-gro-001/15102",
            "title": "MIP40c3-SP70: Modify Growth Core Unit Budget (GRO-001) ",
            "index": 15102,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "gro-001",
                "core-unit-budget",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "12",
                    "time": "11/05/2022-15:21:24",
                    "content": " MIP40c3-SP70: Modify Growth Core Unit Budget (GRO-001)  Preamble MIP40c3-SP#: 70 Author(s): @Nadia Contributors: @Growth-Core-Unit  Tags: core-unit, cu-gro-001, budget, dai-budget Status: Accepted (option BearMarket) Date Applied: 2022-05-11 Date Ratified: 2022-06-27 Budget Start Date: 2022-07-01 Budget End Date: 2023-06-30 Forum URL: https://forum.makerdao.com/t/mip40c3-sp70-modify-growth-core-unit-budget-gro-001/15102 Ratification Poll URL: https://vote.makerdao.com/polling/QmdMkg2N   Sentence Summary MIP40c3-SP70 modifies the DAI budget for the Growth Core Unit GRO-001.  Paragraph Summary MIP40c3-SP70 requests a 12-month budget of 5,085,157.11 DAI for the Growth Core Unit starting from July 2022 (Option BaseGrowth). Due to the current market situation, we decided to propose a second option (option BearMarket) with a reduction in the objective FTEs, which will slow down our roadmap for H2-22 to H1-23. Option BearMarket requests a 12-month budget of 4,210,261.40 DAI for the Growth Core Unit starting from July 2022. Personnel reduction from the original plan, although feasible, will have an impact on the roadmap execution of both teams (Growth and Brand) and the number of strategic initiatives we can run with our partners. In case option BearMarket is elected, we will:  Reduce the number of new business opportunities or associations that require a high intensity of work (usually high impact partnerships) Instead of having a specialization approach (per region and vertical), we will continue with a generalist approach. Merge the communications and content team. Instead of having a separate team working on the brand, BDs will continue developing the Maker brand with our partners, with the PR agencies’ support.  Although this is a more conservative approach and gives us time as a DAO to define the next steps towards MetaDAOs or any other path MKR holders decide, it’s essential to understand that this will slow down Growth’s CU roadmap (BDs+Brand). Option BaseGrowth (5,085,157.11 DAI) represents a 55% increase compared to last year’s approved budget. This increase in budget will support our growth in FTE, allowing us to expand our presence in other regions and have all people needed to run the Brand team. Option BearMarket (4,210,261.40 DAI) represents a 28% increase compared to last year’s approved budget. We won’t be growing the team as planned but will be able to execute our plan with some constraints. Option BrandlessGrowth (3,272,550.00 DAI) represents a 0% increase compared to last year’s approved budget. If MKR holders select his option, we won’t be able to continue with the Brand team plan.  Motivation Growth CU is requesting a budget allocation to deliver its mandate over the next 12 months (i.e., from July 2022 to June 2023). This budget will support the Growth team (i.e., initiatives to develop the MakerDAO ecosystem with new and existing partners) and the Brand team (i.e., a new incubated team within Growth CU and a set of tier-one providers to build a solid, reputable, and consistent brand for MakerDAO and engage strongly with the audience). As we explained in the post “The Maker Brand Team”, we want to incubate the Brand team inside the Growth CU to support team building and process implementations, until the team is ready to become an independent CU. Since May 2021, we closed 141 integration with partners around the world, we helped with the onboarding process of stETH, MATIC, PSM-GUSD, PSM-USDP, generating more than 673M DAI and about 3.8M DAI in annual fees, and worked with other CUs on the ideation of an institutional product, that allowed us to maintain one-to-one conversations with companies that generated more than 1.2B DAI and about 29M DAI in annual fees. With both teams, Growth and Brand, we will continue to help the protocol increase the supply and demand of DAI. The expansion of the Growth team will allow us to generate more opportunities inside the multichain ecosystem, bring more partners as collateral, increase the number of whales opening a vault and create more Dai usages. And by having the Brand team, we will be able to build a strong MakerDAO brand and extend its influence in DeFi and beyond. For more details on our focus and objectives for this year, please refer to the GrowthCU Last year in review post.  Core Unit ID Growth (GRO-001)  Option BaseGrowth.  List of Budget Implementations As Growth CU expenses are broken down into fixed and variable costs, we suggest two budget streams:   Fixed monthly expenses of 311,092.16 DAI - constituted of personnel, marketing, and admin expenditures:  A total of  3,733,105.87 DAI will be streamed to 0x7800C137A645c07132886539217ce192b9F0528e starting 2022-7-1 and ending 2023-6-30.    Variable semi-annual expenses of 676,025.62 DAI (totalling 1,352,051.24 DAI) - constituted of partner and travel expenditures:  A total of 676,025.62 DAI will be transferred to 0x7800C137A645c07132886539217ce192b9F0528e on 2022-7-1 (or as soon as the following executive allows). A total of 676,025.62 DAI will be transferred to 0x7800C137A645c07132886539217ce192b9F0528e on 2023-1-1 (or as soon as the following executive allows).     List of Budget Breakdowns The following table shows the proposed budget for July 2022 - June 2023:  1166×1112 209 KB  For details on the actual budget, please refer to the GrowthCU Last Year in Review post.  New Budget Details The current budget considers actuals from July 2021 to April 2022 and forecasts May and June 2022. As the estimates may be incorrect, any funds remaining in the Growth multisig in June 2022 will be returned to the protocol in the first month of our new term (i.e., July 2022). Below you will find further details on the above cost items.  Personnel Expenses (48% of total budget) This item includes personnel fees for the Growth and Brand teams and bonuses for the BDs. The size of the Growth CU team increased from 5.5 FTE in June 2021 to 9.75 FTE in April 2022, and is expected to reach 15.75 FTE by August 2022 (10.25 FTE for Growth and 5.5 FTE for Brand):   Growth team (from 7.25 to 10.25 FTE) - we plan to add three full-time members to the BD team to strengthen our efforts in high potential regions and accelerate our progress across our key initiatives. Besides the base pay, BDs benefit from a bonus pay scheme, a proactive process that forms goals around the account planning process. The budget for the bonus is therefore increased with the expected new hires.   Brand team (from 2.5 to 5.5 FTE): the Brand team will build a team of experienced members in Branding and Product Marketing (cf. The Maker Brand Team post for more details).    Partner Expenses (16% of total budget)  Marketing activations: Budget to execute collaboration with Maker partners, including marketing campaigns, educational content, or grants to help partners build products. This also includes small events with partners during conferences. Loans: In some cases, depending on the relevance of the partnership, we use 0% loans to help our partners bootstrap their Maker integration.   Marketing Expenses (27% of total budget) Growth team:  The Marketing expenses budget line is to cover sponsorships for certain relevant events such as Hack Money and Mainnet, and media outlets such as Bankless.  Brand team:  Hire Tier-1 global agencies specialized in crypto (to reach media outlets in the crypto world) and with mainstream access (for relevant news and RWA success stories). These agencies will help us create and distribute articles, webinars, media appearances, and podcasts. We will be using service providers to create written content, images, and videos that will serve as assets to include in the communications through different channels, including Twitter.   Travel Expenses (4% of total budget)  To cover all expenses for travels to events (when relevant) and the offsite. The cost per FTE is expected at $12.397.   Admin Expenses (5% of total budget)   Fees: This covers gas and OTC fees.  Professional Services: Currently, we are working with two legal firms and one accounting agency. The budget increase is for additional hours to work on legal agreements with partners. This year, we want to establish a process where a legal contract accompanies commitments with any Tier-1 partner. It also increased because of the work with branding agencies that will support the Brand team.  Software Expenses: To cover the usage of GSuite, Notion, Zendesk, Docusign, and Nansen.   Buffer  The buffer will help us support any contingency that may occur during the year. The existing buffer holds $350k, and we are not seeking to extend this balance. It will continue as it is.   Option BearMarket.  List of Budget Implementations As Growth CU expenses are broken down into fixed and variable costs, we suggest 2 budget streams:   Fixed monthly expenses of 242,832.85 DAI - constituted of personnel, marketing, and admin expenditures.  A total of 2,913,994.22 DAI will be streamed to 0x7800C137A645c07132886539217ce192b9F0528e starting 2022-7-1 and ending 2023-6-30.    Variable semi-annual expenses of 648,133.59 DAI (totalling 1,296,267.18 DAI) - constituted of partner and travel expenditures.  A total of 648,133.59 DAI will be transferred to 0x7800C137A645c07132886539217ce192b9F0528e on 2022-7-1 (or as soon as the following executive allows). A total of 648,133.59 DAI will be transferred to 0x7800C137A645c07132886539217ce192b9F0528e on 2023-1-1 (or as soon as the following executive allows).     List of Budget Breakdowns The following table shows the proposed budget for July 2022 - June 2023:  1144×1162 168 KB   New Budget Details The current budget considers actuals from July 2021 to April 2022 and forecasts May and June 2022. As the estimates may be incorrect, any funds remaining in the Growth multisig in June 2022 will be returned to the protocol in the first month of our new term (i.e. July 2022). Below you will find further details on the above cost items.  Personnel Expenses (39% of total budget) This item includes personnel fees for the Growth and Brand teams and bonuses for the BDs. The size of the Growth CU team increased from 5.5 FTE in June 2021 to 9.75 FTE in April 2022, and is expected to reach 11.5 FTE by August 2022 (8 FTE for Growth and 3.5 FTE for Brand):   Growth team (from 7.25 to 7.75 FTE) - we plan to convert a part-time contributor into a full-time one to support BDs in Asia and Latam. Due to this reduction of FTE compared to the option A budget, we won’t be pushing for growth in new markets until we have more certainty about stablecoins regulations and acceptance. Although this is a conservative option, the risk is losing the competitive advantage against others with a more aggressive approach.   Brand team (from 2.5 to 3.5 FTE): We will add one FTE to the brand team with the role of CMO. This is an imperative role for this team’s success and is the minimum viable team to execute the Brand plan. With a considerable reduction in the size of this team, we will have to slow down the execution of the brand roadmap.    Partner Expenses (19% of total budget)  Same as Option BaseGrowth   Marketing Expenses (32% of total budget)  Same as Option BaseGrowth   Travel Expenses (3% of total budget)  Same as Option BaseGrowth updated with the FTE of Option BearMarket   Admin Expenses (7% of total budget)  Same as Option BaseGrowth   Buffer  Same as Option BaseGrowth   Increasing Value to Maker Token Holders The Growth CU seeks to drive value to the protocol through:   Revenue growth by helping with the onboarding of new collaterals and IVs   Increasing DAI stickiness by adding more use cases around DAI and strengthening the Maker partners’ network.   Building a solid brand image consistent with the value the protocol brings to the Defi market and broader.    Roadmap and Objectives For this year, our mandate remains the same, but we established a different strategy to suit Maker’s needs and the current situation of the ecosystem. Our growth plan for this year will be based on the following three key priorities:  Brand recognition: We decided to incubate the Brand Team due to the necessity of having a dedicated team working on the MakerDAO branding and announcements. The brand team will be working on :    Define brand strategy and implementation plan for new strategic partnerships.   Communicate on the protocol’s updates (i.e. products, ecosystem).   Build brand awareness of MakerDao.   Own and develop the protocol’s intangible assets of communication.   Build strategic activations with providers (incl. one-off products).    Increase DAI supply:   Multichain partnerships: Once we start deploying Maker Vaults in various domains, we will work to develop that ecosystem and generate integrations with Maker. At the same time, we will focus on integrating the Maker Teleport in various bridges and aggregators. Partners as collateral: Following the same strategy as last year, we want to propose valuable collateral to the protocol, and the multichain vision will open numerous opportunities for that. Partners opening vaults: We will continue pushing Institutional Vaults to bring closer Institutions to Maker.   Increase DAI demand:   Multichain DAI: Providing easy access to MultichainCanonical-DAI on the most relevant platforms CeFi, DeFi: Creating use cases around the Multichain-Maker and incentivizing the re-establishment of Maker as a critical piece in the Money Legos. Dai users: Stimulate the usage of DAI.   Business Case for Investment After one year as a CU, we have been concentrating our efforts on expanding Maker’s ecosystem to increase the number of Dai in circulation globally. Throughout the period of 05/21-03/22, we closed 141 integrations with partners across various verticals and regions. With the development of new products around Maker (D3M, IVs, Maker Teleport, or even MetaDAOs) and a narrative plus brand to help us distribute the message, we will increase the number of closed integrations helping the protocol to grow on the supply and demand of DAI. To increase DAI supply, we focused on four verticals: DeFi/CeFi: we support the onboarding of new collaterals in the protocol by collaborating with PECU, CES, Oracles, and Risk. And we work with relevant aggregators to build a User Interface for the ilk. Once the product is finalized (i.e., an ilk with a UI and sometimes strategies on the back), we lead the public announcements on different media channels. This year, we helped onboard: stETH, MATIC, PSM-GUSD, and PSM-USDP, generating more than 673M DAI and about 3.8M DAI in annual fees. Currently, we are working on the multichain expansion by talking with other networks to support their implementation of the Maker Vaults. That will increase the SB by increasing the collaterals we can onboard on other domains such as Polygon or Gnosis Chain. Institutional Vaults: Although we are still in the process of releasing the IV product, it has helped us to initiate conversations with companies with large crypto treasuries and introduce them to Maker. They are easily distracted by rewards other protocols offer and are not paying that much attention to Maker’s attractive services (e.g. lowest stability fees). Thanks to IV and the one-to-one conversations we have had with these companies, we helped to generate more than 1.2B DAI and about 29M DAI in annual fees. Currently, we are working with six companies to offer them an Institutional Vault. This process takes time as we have to educate their legal and compliance team about Maker and define the agreement for the vaults (as these vaults will be minting a minimum of 200m DAI). With Jocelyn leading the process, one of these companies recently posted its proposal in the forum. RWA: We have been supporting the RWF team in getting new leads and supporting the onboarding process. Due to complications and unexpected events (e.g. late integration and change of RWF team), we have not yet been able to finalize the onboarding of any RWA collateral. Currently, we are working with other CUs on the D3M implementation for TrueFi and Maple, opening new opportunities to interact with RWA. Also, we are supporting Strategic Finance on the strategy around stablecoins on the PSM. For DAI demand, we focused on DeFi/CeFi: We provide easy access to Dai and Maker in the most relevant platforms and create use cases around DAI. We have posted the Marketing Activations documents at the end of every quarter, highlighting our achievements during the period. We will continue to work with our partners on the marketing activations but thanks to the Brand team’s support we will be able to position the Maker brand and increase its recognition.  Contingency Planning - Scenarios   Superbear: If the DAO seeks to cut expenses in a bear or superbear market, GrowthCU will reduce expenses for non-business-critical activities: e.g., travel, sponsorships, and marketing activations.   Bull: In a bull market, we would increase our Branding efforts by sponsoring more mainstream events and Maker’s appearance in the media.    Unwinding and Defunding If Growth CU is defunded, all current work will be halted to focus on wrapping up existing initiatives, creating documentation of existing processes, transitioning all Maker assets, archiving all information about partners, and the rescission of any active activity contract we may have. Any funds not already allocated (such as personnel fees and active agreements) at offboarding will be returned to the DAO through DSSBlow. We may need to use the buffer to cancel the active contracts and the unwinding of the company. All unvested MKR would be returned to the DAO as of the end date.  Proposal Parameters   Minimum Feedback Period: 1 Month.   Minimum Frozen Period: 1 Week.   Ratification Polls for MIP40c3 subproposals involving a Core Unit Budget Modification will have different requirements to MIP51c2. Instead of binary voting, they must use ranked-choice voting, with the options as follows:  A: Approve Brandless Growth budget -previous budget- (3,272,550.00 DAI) B: Approve BaseGrowth budget (5,085,157.11 DAI) C: Approve BearMarket budget (4,210,261.40 DAI) D: Reject budget E: Abstain    In order for this Ratification Poll to conclude successfully and the contained proposal(s) move to Accepted status, each of the following conditions must be true:  A, B or C vote-weight must exceed D vote-weight when the poll closes. Winning vote-weight must exceed the Minimum Positive Participation value of 10,000 MKR when the poll closes.  Please make sure to rank all of the options during the vote, specifically for approving a budget request. Also, make sure to rank the option to approve the existing budget. ",
                    "links": [
                        "https://forum.makerdao.com/t/growthcu-last-year-in-review-and-high-level-plan-for-next-year/15100",
                        "https://forum.makerdao.com/t/growthcu-last-year-in-review-and-high-level-plan-for-next-year/15100",
                        "https://forum.makerdao.com/t/the-maker-brand-team/14442",
                        "https://forum.makerdao.com/t/signal-request-antalpha-institutional-vault/15030",
                        "https://drive.google.com/drive/folders/1TGZJMkgyudwYALyuEJ0YQd-CFkyX_R39?usp=sharing",
                        "https://forum.makerdao.com/t/weekly-mips-update-89/15464",
                        "https://forum.makerdao.com/t/weekly-mips-update-92/15933",
                        "https://forum.makerdao.com/t/relay-semanal-21-27-de-junio-del-2022/16272",
                        "https://forum.makerdao.com/t/weekly-relay-june-14-20-2022/15950",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/75",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/25",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/4",
                        "https://forum.makerdao.com/t/weekly-mips-update-91/15787",
                        "https://forum.makerdao.com/t/weekly-mips-update-90/15648",
                        "https://forum.makerdao.com/t/weekly-relay-june-7-13-2022/15818",
                        "https://forum.makerdao.com/t/weekly-relay-june-21-27-2022/16158",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-13-de-junio-de-2022/15883",
                        "https://forum.makerdao.com/t/governance-and-risk-196-thursday-june-23-at-17-00-utc/15998/3",
                        "https://forum.makerdao.com/t/relay-semanal-7-13-de-junio-2022/15897",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/79",
                        "https://forum.makerdao.com/t/governance-and-risk-194-thursday-june-09-at-17-00-utc/15664/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-93/16129"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.489469833101909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "2",
                    "time": "11/05/2022-19:25:50",
                    "content": "Would there be two proposals? One without the increase ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#3",
                    "likes": "3",
                    "time": "11/05/2022-20:12:32",
                    "content": "Hey Doo, this proposal includes the incubation of the Brand team, something we know for sure the protocol needs and have been planning for a while, with a good reception from the community: The Maker Brand Team. Because of that, we are just presenting one proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#4",
                    "likes": "4",
                    "time": "11/05/2022-21:19:23",
                    "content": "Disclaimer: Questions as a delegate There are budget increases for both so let’s deal 1 by 1. Growth Overall, the increase is 43%         Nadia:  Growth team (from 7.25 to 10.25 FTE) - we plan to add three full-time members to the BD team to strengthen our efforts in high potential regions and accelerate our progress across our key initiatives.   Can you share more about in details about what would be these 3 members would be focusing on? What would be the region and what key initiate? And does it overlap with any of existing BD members’ roles?  While marketing activation budget remains the same, sponsorship budget is increasing by 200k. Is there detailed sponsorships that the team is thinking of increasing?  Brand Overall, the increase is 201%. USD 1.8 million yearly budget is not light so several questions:  For successful “brand” examples we mentioned such as     The Maker Brand Team   These two options may allow us to create specific one-off actions where awareness is intended to be generated, these campaigns may or may not be developed in conjunction with a partner, the important thing is that they have to be impactful enough to generate buzz. Example: Joint advertising action with a partner in a sporting event. In Argentina, we developed a similar action where we led a television event to raise money for the Red Cross.  This event was a massive success, with more than 1 Millon total viewers putting DAI on par with international brands and generating great demand in the country. The key to the success of this type of action is to detect the opportunity and act quickly.   It’s my understanding that this initiative was not too costly. And if that’s the case, why does the team believe increasing the cost will result in more successful initiates? Isn’t it better to focus on few but successful campaigns?  Details regarding the following part. Especially what’s digital assets for comms? If it’s brand assets and etc? Are they expected to decrease in cost as the protocol can reuse them in the future?    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.807364341085272
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#5",
                    "likes": "2",
                    "time": "11/05/2022-22:08:04",
                    "content": "    Doo_StableLab:  It’s my understanding that this initiative was not too costly. And if that’s the case, why does the team believe increasing the cost will result in more successful initiates? Isn’t it better to focus on a few but successful campaigns?   Doo, thanks for asking. The increase in cost is given to the development of an entire team, suppliers, and processes dedicated exclusively to creating branding activities that were never done in a methodical and scheduled way. Ideally, this also requires trial and error, not all the developed initiatives will be successful, we know that there will be failures and we must learn from them. As I put in the Maker Brand post, the idea is to maximize the number of external providers to cut any expenses immediately (in case we need to) while maintaining a high quality of work.     Doo_StableLab:  Details regarding the following part. Especially what’s digital assets for comms? If it’s brand assets and etc? Are they expected to decrease in cost as the protocol can reuse them in the future?   yes and no Why is it so? It depends on the assets that are created according to the opportunities that appear. For example, the creation of videos for specific campaigns are assets that are created and used only once, but developing Intros or Logo reveals are things that can be reused, and do not need to be done again. Even for Public Relations, the contracting of PR agencies specialized by verticals can give us a better focus on the reach of the produced materials. For example, we were able to close a partnership with Bankless DAO for the development of articles about the DEFI world, but if we want to have an impact on the Real World Asset world, it is very likely that we will have to use other services or pay for research that can later provide support on the things we are doing. To this new connection that we want to develop between DEFI and RWA, this research or educated opinions are unfortunately usually expensive, but they end up giving you an important endorsement in the face of mainstream media. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.934717868338558
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#6",
                    "likes": "2",
                    "time": "11/05/2022-23:03:09",
                    "content": "    Doo_StableLab:  Can you share more about in details about what would be these 3 members would be focusing on? What would be the region and what key initiate? And does it overlap with any of existing BD members’ roles?   The new positions are for one lead of operations, one BD for Latam, and another one to support Jocelyn in Asia. Because of the multichain strategy, each BD will focus on one region and one or two L2s/chains and will be in charge of developing the initiatives described here: GrowthCU - Last Year in Review and High-Level Plan for Next Year     Doo_StableLab:  While marketing activation budget remains the same, sponsorship budget is increasing by 200k. Is there detailed sponsorships that the team is thinking of increasing?   As explained here, We didn’t consider sponsorships in our previous budget because it wasn’t directly part of our mandate. But without a CU in charge of it, we saw the need to sponsor events/media outlets to get speaker slots and use it as a platform to present Maker and be closer to potential partners. With our current budget, we spent $157k, and we had to be conservative because it wasn’t considered (as we expected another CU to take the lead on this). Still, this budget is to sponsor certain relevant events and not everything, and we are working with our PR agency to select the best ones based on Maker’s announcements and strategy ",
                    "links": [
                        "https://bankless.pallet.com/jobs/9da5942c-4014-445a-a3b9-859bc5b4f4ea",
                        "https://bankless.pallet.com/jobs/cbd0e273-963d-4e7a-acea-ac364460a946",
                        "https://forum.makerdao.com/t/growthcu-last-year-in-review-and-high-level-plan-for-next-year/15100",
                        "https://forum.makerdao.com/t/growthcu-last-year-in-review-and-high-level-plan-for-next-year/15100",
                        "https://docs.google.com/spreadsheets/d/1Cb7CGYHWaxsttZWeGlZW-bHH1_rw8C6yECHR51evwG8/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.701171377641966
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#7",
                    "likes": "1",
                    "time": "12/05/2022-14:39:48",
                    "content": "Thanks for the response @MarianoDP @Nadia. To be honest, I think regarding Branding is more of “Agree to disagree” as I personally think small but focused marketing are more effective than large-scale marketing efforts. But then I also saw there’s an appetite for such from the community as well.     Nadia:  The new positions are for one lead of operations , one BD for Latam, and another one to support Jocelyn in Asia. Because of the multichain strategy, each BD will focus on one region and one or two L2s/chains and will be in charge of developing the initiatives described here: GrowthCU - Last Year in Review and High-Level Plan for Next Year   Considering there are several Growth contributors based in Latin America. Would it be difficult to have one member to take BD for Latam task as well? Based on experience, Latin America is lively but its ecosystem doesn’t yet have as many entities or protocols as Europe, US, or Asia. Maybe it’s possible to raise the salary of one to multitask. Also, is Lead of Operations just someone who helps with workflow for Growth? Isn’t that Youssef’s role? And even if it’s not his role, can you explain how Lead of Operations helps the CU? Regarding Asia, I understand but maybe @joce_chang can share some hardships she’s having so the community can better understand the need.     Nadia:  But without a CU in charge of it, we saw the need to sponsor events/media outlets to get speaker slots and use it as a platform to present Maker and be closer to potential partners.   But there’s Events CU and also ongoing proposal for “Growth Task Force”. Isn’t the budget overlapping? MIP75c2-SP1: Onboard Task Force - Growth Task Force - #12 by hexonaut ",
                    "links": [
                        "https://bankless.pallet.com/jobs/9da5942c-4014-445a-a3b9-859bc5b4f4ea",
                        "https://bankless.pallet.com/jobs/cbd0e273-963d-4e7a-acea-ac364460a946",
                        "https://forum.makerdao.com/t/growthcu-last-year-in-review-and-high-level-plan-for-next-year/15100",
                        "https://forum.makerdao.com/t/mip75c2-sp1-onboard-task-force-growth-task-force/15094/12"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.769138755980862
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#8",
                    "likes": "2",
                    "time": "15/05/2022-14:02:41",
                    "content": "    Doo_StableLab:  To be honest, I think regarding Branding is more of “Agree to disagree” as I personally think small but focused marketing are more effective than large-scale marketing efforts. But then I also saw there’s an appetite for such from the community as well.   Doo, perhaps we weren’t clear in our previous comments. Brand is not the same as marketing campaigns, as marketing campaigns are one of the tools to strengthen the brand. The budget we are asking for will help us to:  Having a team and everything attached to it The agencies that help us shape the message create a narrative, strengthen our brand, and distribute news with that embedded narrative throughout the year, telling everyone what Maker is and what we are doing. An example of the power of the agencies may be seen in the last announcement we worked with them (starknet partnership): The Maker Brand Team - Some strategic thoughts - #2 by MarianoDP  Create digital assets: such as logos, articles, videos, infographics… To improve our brand recognition, we need a strong identity accompanied by quality assets and a better website that reflects what we are as DAO.  Branding is all about defining a narrative for Maker, so we can later go out and repeat that message. Currently this is how people see us (taken before the Terra crash), and based on Maker’s strategy, that’s something we may need to re-create.  image1240×1032 91.9 KB      Doo_StableLab:  Considering there are several Growth contributors based in Latin America. Would it be difficult to have one member to take BD for Latam task as well?   Unfortunately, yes, BDs have specific skills that not everybody has. As you have seen, it’s hard to find someone to replace you. The people from our team in Latam have their responsibilities, and if they decide to take the BD position, I will have to find a replacement for them… that would mean another open position. Also, as you say, latam doesn’t have as many protocols as other regions, but it’s growing faster in adoption, right now we are having conversations with banks wanting to include DAI (yes, traditional banks), which means complex deals.     Doo_StableLab:  Also, is Lead of Operations just someone who helps with workflow for Growth? Isn’t that Youssef’s role? And even if it’s not his role, can you explain how Lead of Operations helps the CU?   It is not Youss’ role. The operations lead will help me with legal agreements, payments, finance, metrics and reporting. Currently, I’m working as a facilitator, leading the bd team, working as a BD because I follow some T1 and manage all the team’s operations. Regarding Jocelyn, we are looking for someone to replace you and can join the team full time.     Doo_StableLab:  But there’s Events CU and also ongoing proposal for “Growth Task Force”. Isn’t the budget overlapping?   Not at all. Event’s CU run parties like Daivinity, Growth pays for sponsorships in events and media outlets, as an example, this month we are sponsoring HackMoney and the bankless podcast. The budget in TaskForce is for unique and strategic opportunities. Currently, I’m asking for 356k for sponsorships, which means about nine events per year (with an average of 40k per sponsorship), but sponsorship tiers could be way higher depending on what you want to do. ",
                    "links": [
                        "https://app.hubspot.com/documents/7306566/view/290325884?accessId=00feee"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.360863095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#9",
                    "likes": "1",
                    "time": "15/05/2022-16:13:58",
                    "content": "    Nadia:  List of Budget Breakdowns The following table shows the proposed budget for July 2022 - June 2023:    Fees? Why so much for fees? I feel like there is some fat to trim there…    It was a joke!    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#10",
                    "likes": "5",
                    "time": "31/05/2022-23:04:14",
                    "content": "The proposal was updated to make it compatible with the recently approved MIP40 and also added a bear market option (option B), reducing the number of objective FTE for this year. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#11",
                    "likes": "1",
                    "time": "01/06/2022-21:27:17",
                    "content": "As per the new MIP40 scheme, voting options for budgets are A) Previous budget B) New increased budget C) Reject D) Abstain. This budget, however, includes an additional option with an alternative budget increment, resulting in the following voting scheme: A) Previous Budget (0%. Brandless Growth) B) New increased budget (55%. Basegrowth) C) New increased budget (28%. BearMarket) D) Reject E) Abstain With the Frozen Period upon us and little spacetime to manoeuvre, this addition is to be understood as an exception that falls under the transitional period of grace. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.015388257575758
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#12",
                    "likes": "1",
                    "time": "01/06/2022-21:42:09",
                    "content": "    Nadia:  We won’t be growing the team as planned but will be able to execute our plan with some constraints.   Can you please provide more color (an example) on what those constraints will be?     Nadia:  Option BrandlessGrowth (3,272,550.00 DAI) represents a 0% increase compared to last year’s approved budget. If MKR holders select his option, we won’t be able to continue with the Brand team plan.   If the economic environment turns in Q1 of 2023, can the Growth team return with a budget modification to justify an increase for branding (assuming this is the branding route MKR token owners want to take).? Also, can you expand on how a Brand Team during this tumultuous time (stablecoins like UST failing) can help DAI separate itself from the bad apples in the tree. I ask, because time has passed since the Brand Team was introduced and both the Mkt Conditions and the black-eye on stablecoins have occurred.     Nadia:  Since May 2021, we closed 141 integration with partners around the world, we helped with the onboarding process of stETH, MATIC, PSM-GUSD, PSM-USDP, generating more than 673M DAI and about 3.8M DAI in annual fees, and worked with other CUs on the ideation of an institutional product, that allowed us to maintain one-to-one conversations with companies that generated more than 1.2B DAI and about 29M DAI in annual fees.   Related to market conditions and perhaps a pivot to MakerDAO via the EndGame plan, what are some of the initiatives the Growth CU looks to tackle in the next 6 to 12 months. I imagine one is more IV like Antalpha, and others alike. If such are included, can you provide color on how budget expenses are incur when trying to land these deals? I believe the community needs to understand what work is being and what is the cost to perform the work in order to attain these deals.     Nadia:  Fixed monthly expenses of 311,092.16 DAI - constituted of personnel, marketing, and admin expenditures   Would it be possible to provide the community with an approximate cost of marketing on the Bankless podcast? If possible, TY.     blimpa:  A) Previous Budget B) New increased budget (55%) C) New increased budget (28%) D) Reject E) Abstain   Bro I think you’re missing the BearMarket option on there (BrandlessGrowth) 0% increase versus last yr. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.408926218708827
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#13",
                    "likes": "1",
                    "time": "01/06/2022-21:52:02",
                    "content": "    flipflopflapdelegate:  Bro I think you’re missing the BearMarket option on there (BrandlessGrowth) 0% increase versus last yr.   Edited my post and added the internal budget name to the options for more clarity  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#14",
                    "likes": "0",
                    "time": "01/06/2022-22:01:42",
                    "content": "    Doo_StableLab:  Would there be two proposals? One without the increase   Ironically, I got the voting option I wanted thanks to the new format ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.840909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#15",
                    "likes": "1",
                    "time": "02/06/2022-04:26:39",
                    "content": "Not ironic at all but totally intentional ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#16",
                    "likes": "6",
                    "time": "06/06/2022-21:30:34",
                    "content": "Hey Frank, you can find my comments below and sorry about the long post, but your questions helped me summarize other posts we have written. Thanks to your questions, we realized that it’s time to update all of you about all the Brand team is doing. That’s why this Thursday, @MarianoDP will be presenting the Brand updates during the governance call (attn. @Recognized-Delegates @Davidutro )     flipflopflapdelegate:  Can you please provide more color (an example) on what those constraints will be?   The BearMarket option reduces the objective FTEs (currently, we have 9.75 FTEs, BaseGrowth objective is 15.75 FTE, BearMarket is 11.5 FTE), which will slow down our roadmap for H2-22 to H1-23 as the new FTEs are people that will work for the brand team and will complete the BD team. Personnel reduction from the original plan, although feasible, will have an impact on the roadmap execution of both teams (Growth and Brand) and the number of strategic initiatives we can run with our partners. In case option BearMarket is elected, we will:  Reduce the number of new business opportunities or associations that require a high intensity of work (usually high impact partnerships Instead of having a specialization approach (per region and vertical), we will continue with a generalist approach.  Currently we have 4 BDs working (I’m still doing BD stuff), each one is in charge of developing one region, currently we are activly covering the US, Europe and Asia, but after one year with this setup we discovered that:  We need someone FT helping Jocelyn in Asia. Although Doo is there, he’s not full-time. We don’t have someone in Latam or Africa, we are not being active there. the multichain universe adds complexity, it’s no anymore a CeFi/DeFi thing, you need to have someone focused on the main networks  If I can’t extend the BD team, we won’t be able to cover all simultaneously. In the BearBudget I’m replacing Doo for a FTE, but I won’t be able to cover other regions and BDs time has to be split between their region and a specific chain.  We will have to merge the communications and content team inside the brand team, reducing our response time, and we will need more time in advance to plan any comms we want. Instead of having a separate team working on the brand, BDs will continue developing the Maker brand with our partners, with the PR agencies’ support.  The extra FTE in the BearBudget is to hire a CMO that will help with the Brand strategy. Still, we won’t be extending the team as planned, which means we will have a team of 3.5 in charge of executing the marketing initiatives with our partners, the work with the PR agencies, announcements, twitter, website, and brand. That means we will be able to execute our plan but at a different pace because we lack resources. If the Brandless Budget is approved, we won’t be able to hire the CMO and we won’t continue with the Brand team incubation. We will keep doing what we have been doing until now (like managing the Twitter and interacting with agencies for specific announcements), but we won’t add new responsibilities to our team (website, narrative definition, and the whole plan defined here The Maker Brand Team)     flipflopflapdelegate:  If the economic environment turns in Q1 of 2023, can the Growth team return with a budget modification to justify an increase for branding (assuming this is the branding route MKR token owners want to take).?   I think so, although it’s hard to predict what will happen in 6 months in the crypto universe. The right question here is, do MKR holders don’t want a marketing/brand team for the next six months? Recently MKR holders accepted Strategic Happiness CU for 770k per year because they agree community efforts are essential. Is brand/marketing important enough?     flipflopflapdelegate:  Also, can you expand on how a Brand Team during this tumultuous time (stablecoins like UST failing) can help DAI separate itself from the bad apples in the tree. I ask, because time has passed since the Brand Team was introduced and both the Mkt Conditions and the black-eye on stablecoins have occurred.   The brand team was announced in April, it is two months old, and during this time we have done this Maker Brand: PR Updates. We have been working hard with our communication agencies to generate conversation around DAI. We also have been working with DAO members on media training and how to develop high-impact interviews (to give the correct answer to journalists when they ask why Dai is different and avoid comparing us with others). Currently, we are working on a series of reports and specialized articles that reveal why DAI is a different stablecoin, for this, we teamed up with people from BanklessDAO, which opened the doors for us to be able to sponsor the most listened podcast in the ethereum ecosystem, Bankless. We would love to react faster to all of this… that’s why we need more people on the team.     flipflopflapdelegate:  Related to market conditions and perhaps a pivot to MakerDAO via the EndGame plan, what are some of the initiatives the Growth CU looks to tackle in the next 6 to 12 months. I imagine one is more IV like Antalpha, and others alike. If such are included, can you provide color on how budget expenses are incur when trying to land these deals? I believe the community needs to understand what work is being and what is the cost to perform the work in order to attain these deals.   Answers for that are here: GrowthCU - Last Year in Review and High-Level Plan for Next Year IVs are one part of the plan as one of the initiatives to increase Dai supply, but we have three pillars in Growth: Brand recognition, increase DAI supply and increase DAI demand.  image1184×520 88.3 KB   image1300×548 46.2 KB  Based on our current budget, we know the execution of these initiatives requires: 48% of the total budget for compensations, 16% for partner expenses (mainly marketing activations), 27% for marketing and brand actions, 9% for others (travel and admin).     flipflopflapdelegate:  Would it be possible to provide the community with an approximate cost of marketing on the Bankless podcast? If possible, TY.   To sponsor nine appearances per month on the Bankless podcast (2million DLS/month) we pay 41k DAI per month ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-brand-pr-updates/15582",
                        "https://forum.makerdao.com/t/growthcu-last-year-in-review-and-high-level-plan-for-next-year/15100"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4802314528505
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#17",
                    "likes": "3",
                    "time": "06/06/2022-23:27:24",
                    "content": "I would like to formally submit this MIP40c3-SP70 for the immediate voting cycle. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#18",
                    "likes": "0",
                    "time": "14/06/2022-20:52:25",
                    "content": "This proposal is currently being voted on. Its RP will run from 06/13 to 06/27. Please vote here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#19",
                    "likes": "4",
                    "time": "16/06/2022-09:38:34",
                    "content": "Research suggests good marketing is especially needed at troubled times!    Harvard Business Review – 14 Aug 20    Don’t Cut Your Marketing Budget in a Recession Companies tend to cut marketing in a recession. But firms that maintain their marketing spend while reallocating it to suit the context – be it in product developing, advertising and communication, or pricing – typically fare better than firms that...         Imperial College Business School    Coronavirus: 3 things to know about your marketing budget during the pandemic      ",
                    "links": [
                        "https://hbr.org/2020/08/dont-cut-your-marketing-budget-in-a-recession",
                        "https://www.imperial.ac.uk/business-school/ib-knowledge/marketing/coronavirus-3-things-know-about-your-marketing-budget-during-the-pandemic",
                        "https://www.imperial.ac.uk/business-school/ib-knowledge/marketing/coronavirus-3-things-know-about-your-marketing-budget-during-the-pandemic"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.756944444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#20",
                    "likes": "3",
                    "time": "16/06/2022-09:54:28",
                    "content": "I have to double down on this. Maker has been historically behind in Brand and Marketing activities. We have such a great product that in the early days, the “build it and they will come” worked, but now we gotta compete in a more established and hence competitive market. The Maker brand remains well perceived, we need to nurture it, how much? that is up to our delegates, but we cannot starve it. It takes years to build a brand. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.652777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#22",
                    "likes": "1",
                    "time": "16/06/2022-10:28:16",
                    "content": "During the whole Terra saga and now Tron losing its peg Maker’s position has only strengthened. To give up now, and not make the most of it would be a loss. Market crashes are memorable events (albeit painful), and to stand out now is an opportunity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#23",
                    "likes": "1",
                    "time": "16/06/2022-11:35:49",
                    "content": "I was a little saddened there wasn’t more discussion of focusing on the stablecoin vs the vaults. Leverage is a commodity that are difficult to build moats around. I think the branding proposal kind of abandons dai. I can see their reasoning, but then Maker’s just another lending protocol instead of building a digital currency ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#24",
                    "likes": "2",
                    "time": "16/06/2022-14:01:01",
                    "content": "Hi Ippy, first we need to think on the basics of a market, which is supply&demand, if there is lot of DAI demand but there is no supply then the works towards showcasing DAI will be senseless. Right now almost half of DAI circulating is backed on other stablecoins too, so we NEED to do everything around Vaults, at the end MakerDAO is a Lending Protocol, not an stablecoin, DAI is a consequence of the Protocol itself. Right now Maker needs to focus on developing more tools, on giving retail the power of lending again, on being the best Lending protocol with the best interfaces, the best deals and everything. I prefer we have the market full of DAI with several opportunities first, and this will happen if we focus on Vaults. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9290674603174605
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#25",
                    "likes": "5",
                    "time": "16/06/2022-14:35:36",
                    "content": "    RoFz:  DAI is a consequence of the Protocol itself.   I would respectfully disagree. DAI isn’t a consequence, what would Maker be without DAI? A protocol without a product. Really the question is how do we make DAI more appealing, expansion requires branding efforts. Eg. There are big pharma manufacturers, but without good products those manufacturers are nothing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                }
            ]
        }
    ],
    "group_index": "1074"
}