{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/update-to-the-gelato-keeper-network-top-up-contract/14524",
            "title": "Update to the Gelato Keeper Network Top Up Contract ",
            "index": 14524,
            "category": [
                "Core Units",
                "Protocol Engineering"
            ],
            "tags": [
                "bug",
                "impact-:-medium",
                "mip63",
                "highlight-announcement",
                "gelato",
                "pe-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "8",
                    "time": "08/04/2022-14:31:50",
                    "content": "A bug was found in the Gelato top up contract which transfers DAI from dss-vest into the Gelato treasury buffer. No funds are at risk and none have been lost. We’ve used a work-around to pull an initial 6k to get the ball rolling on, but the contract as-is will not be able to pull any more funds while respecting the max 20k limit. The fix is relatively simple and has already been deployed to 0x478c7Ce3e1df09130f8D65a23AD80e05b352af62. We have also included a change which adds smart contract enforcement of no more than 20k (previously it was just crypto-economic security along with the fact this would be super obvious). After talking with GovAlpha, we feel this is within PE’s mandate to update the vest to point to the new contract in the next executive (April 15th). Would like to re-iterate that this entire system is external to the Maker core system, and as such it allows us to move much faster than heavily reviewed/audited code. The downside is that sometimes you run into small bugs along the way. The nature of having everything under EOA admin control is that we have minimal risk of losing funds and even when things go wrong we can have people intervene as the amounts involved are relatively small. On a positive note, we are now fully up and running with Tech-Ops, Keep3r Network and Gelato redundantly supporting non-critical keeper functionality. @MakerBurn is working on a dashboard so the DAO will be able to audit that keepers are performing their job properly. ",
                    "links": [
                        "https://forum.makerdao.com/t/monthly-governance-review-april-2022/14986",
                        "https://forum.makerdao.com/t/relay-semanal-12-18-de-abril-de-2022/14724",
                        "https://forum.makerdao.com/t/weekly-relay-april-12-18-2022/14691",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-7-13-2022/14624"
                    ],
                    "GPT-summary": "The author of the post explains that a bug was found in the Gelato top-up contract, which has been fixed. They also mention that the system is external to the Maker core system, allowing for faster development but also increasing the risk of small bugs. The author also provides an update on the status of the Tech-Ops, Keep3r Network, and Gelato systems supporting non-critical keeper functionality. Finally, they mention that a dashboard is being developed to allow the DAO to audit keeper performance.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.412420912420912
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makerburn",
                    "index": "#2",
                    "likes": "4",
                    "time": "08/04/2022-15:37:42",
                    "content": "    hexonaut:  On a positive note, we are now fully up and running with Tech-Ops, Keep3r Network and Gelato redundantly supporting non-critical keeper functionality. @MakerBurn is working on a dashboard so the DAO will be able to audit that keepers are performing their job properly.   Not actively working on it quite yet, but yes, I’m looking into it  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.304924242424242
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "07/07/2022-15:37:55",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}