{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-22-28-de-marzo-de-2022/14333",
            "title": "Relay Semanal: 22 \\xe2\\x80\\x93 28 de marzo de 2022 ",
            "index": 14333,
            "category": [
                "Latin America"
            ],
            "tags": [
                "summary",
                "update",
                "espa\\xc3\\xb1ol",
                "latin-america",
                "relay-semanal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#1",
                    "likes": "8",
                    "time": "30/03/2022-21:23:14",
                    "content": " 1730×382 255 KB  ¡Hola a todos! ¡Gracias por consultar el Relay Semanal! Ya sea que tengas MKR o DAI, tengas tu propia Vault o quieras involucrarte más en la Gobernanza, esta es tu parada obligatoria para estar al día con todo lo nuevo que traen las actualizaciones de MakerDAO. Aquí podrás encontrar la versión original en inglés en PDF. Denle amor a nuestra cuenta en Medium   Eventos Actuales  Esta Semana en Gobernanza  Comunidad Deep Dai-ve  Anotaciones para el Calendario  Enlaces Útiles  ¿Tienes algún comentario?   Eventos Actuales  El Debate acerca de los Tokenomics continúa  Mejorar los Tokenomics del MKR para proveer el mejor valor a los poseedores del token y lograr otros objetivos para las partes interesadas en el ecosistema de Maker han sido temas candentes en la comunidad desde que se posteó al respecto. En el último Relay Semanal hablamos del stkMKR, una propuesta para llevar la funcionalidad del staking al MKR a través del nuevo token stkMKR, con el objetivo de incrementar la participación de la Gobernanza, mejorar la narrativa de acumulación de valor para el token MKR, aumentar la seguridad de la Gobernanza e incrementar la resiliencia a las pérdidas de crédito. En el mismo post, también hablamos de la propuesta de @cryptenthusiastic para un modelo de tokenomics que desvincula el valor del DAI del factor inflacionario de la moneda fiat, ayudando a que el DAI sea la stablecoin de elección para los inversores que aprovechan los beneficios de los mercados alcistas y también haciéndolo más atractivo a instituciones y empresas. La semana pasada, los miembros del equipo A16z, incluyendo a Luca Pro, fueron coautores de una propuesta de cuatro partes, titulada “Sugerencias para el Debate de la Comunidad: Innovando el Modelo de Tokens de MakerDAO”. Vamos a sumergirnos en esto y veamos cómo esta última propuesta se compara y contrasta con la discusión que hemos visto hasta ahora. Visión General de la Propuesta de Tokenomics para MakerDAO de A16z En la visión general del post inicial, el equipo exploró el modelo de tokenomics existente de MKR e introdujo su enfoque de tres vertientes para innovarlo. Bajo el modelo existente, las ganancias de Maker van directamente a llenar el Buffer de Excedentes del Sistema. Cuando el Buffer tiene un excedente, los tokens MKR son comprados de nuevo sin permiso y quemados para subir el precio del token MKR. Como lo señalaron varios miembros de Maker, el modelo de compra y quema quizás no sea el más óptimo para alcanzar los objetivos de la comunidad a largo plazo. Con la intención de “maximizar la creación de valor, también crear una nueva utilidad para el token MKR, agregar una capa yield-bearing de resiliencia financiera e incrementar la durabilidad y la eficiencia de los procesos de gobernanza”, el equipo ha publicado tres propuestas para debatir, cada una en su propio post.  Los siguientes posts fueron publicados como un hilo de tres partes, con una visión general, que resume las tres propuestas: Propuesta Número Uno de A16z para Tokenomics de MakerDAO: Agregar una Funcionalidad Útil al Token MKR Esta propuesta se divide en tres subpropuestas, enfocadas en incrementar la utilidad del token MKR. Subpropuesta 1:  Requerir MKR como colateral on-chain adicional para vaults basadas en RWA o para estructuras de vaults que impliquen mecanismos de liquidación off-chain menos transparentes, idealmente como un capital de primera pérdida. Este MKR también puede combinarse con otros activos externos tipo ETH, como un paquete de colateral on-chain. Este requisito se sumaría a la estructura normal de colaterales RWA. Este cambio podría ayudar a mejorar la alineación del prestatario y servir como un margen de seguridad adicional. Subpropuesta 2: Crear un Buffer de Excedentes Secundario que funcione como una capa de protección adicional al consumidor (alineado con la propuesta del Fondo de Auto Seguro) que ofrezca una distribución de rendimientos a aquellos que voluntariamente hacen stake de sus MKR. Como muchas otras grandes pools de seguros DeFi, estos tokens se utilizarían para ayudar como respaldo ante un posible evento de déficit, en este caso, uno más allá del Buffer de Excedente del Sistema. Subpropuesta 3: Incentivar a los participantes de las subastas a apostar por MKR en las subastas de colaterales, alineando mejor los intereses de los participantes de subastas con los intereses generales del sistema. La idea principal es ofrecer un descuento, aplicado como una rebaja, al colateral subastado por participantes que apuesten sus MKR en la subasta. Propuesta Número Dos de A16z para Tokenomics de MakerDAO:  Alineando los Incentivos de la Gobernanza Este post, enfocado en alinear los incentivos de la Gobernanza en todo el ecosistema de Maker, también está dividido en tres subpropuestas. Subpropuesta 1: Alineación de Incentivos: Una idea para abordar la alineación de incentivos entre la fuerza de trabajo de MakerDAO, delegados de MKR y poseedores de MKR es compensar tanto a votantes regulares como a delegados oficiales con una bonificación de adquisición de derechos denominada en tokens MKR basándose en el rendimiento a largo plazo de MakerDAO y la actividad acumulada de cada colaborador. Subpropuesta 2: Participación: Hay varios pros y contras a tener en cuenta en relación con la aplicación de un modelo “veToken” inspirado en Curve para MakerDAO. Podría haber algunos beneficios si se recompensa a participantes de largo plazo con más poder de voto; sin embargo, @NikKunkel y @monet-supply plantearon excelentes argumentos en contra de la implementación de la propuesta tal y como está escrita. Subpropuesta 3: Información y Experticia:  Un ítem que podría ser de especial ayuda a la comunidad es un nuevo panel de Gobernanza que muestre claramente el flujo lineal de las propuestas, proporcione enlaces con detalles a los debates (el foro es como un laberinto incluso para usuarios con experiencia, imagina cómo será para los nuevos) y organizar los temas de forma que sean fáciles de entender para cualquier usuario nuevo. Propuesta Número Tres de A16z para Tokenomics de MakerDAO: Incrementar la Resiliencia Financiera y Fomentar el Crecimiento La serie concluye con la tercera y última propuesta: Incrementar el Buffer de Excedentes del Sistema para comenzar a alinearlo con pérdidas calculadas de vaults especificas, relacionadas a crédito y riesgo de liquidación en cuento al pool primario de seguros para MakerDAO. Para resumir este razonamiento, \"@krzkaczor elegantemente señaló por qué MakerDAO debería enfocarse en un crecimiento agresivo con ganancias retenidas: es difícil que el capital entre y debería ser utilizado de forma más eficiente para lograr ganancias a largo plazo. Dada la naturaleza start-up de MakerDAO y su increíble potencial, el capital podría ser reinvertido en formas de mejorar la rentabilidad y estabilidad de Maker a medida que crece”. Por ahora, el equipo sugiere que MakerDAO podría mantener el Buffer de Excedentes a $250M mientras que la comunidad decide qué rutas de asignación de capital usar y finalicen las métricas que determinen su tamaño.   Esta Semana en la Gobernanza  MIPs Actualización Semanal de MIPs #80  Las Encuestas de Ratificación de Marzo acaban de cerrar.  Las fechas de RFC and FS para referencia y las propuestas existentes se pueden ver en este rastreador de propuestas (WIP). Si tienes alguna pregunta acerca del proceso de votación en MakerDAO, la Guía Práctica de Votación te puede ayudar.   Nueve Encuestas de Ratificación de Marzo que entraron en el Ciclo Mensual se cerraron hoy a las 16:00 UTC y todas fueron aprobadas. Hay dos Encuestas de Ratificación de ciclo semanal vigentes que se desarrollarán durante tres días.  MIP55c3-SP3: SPF para el Evento de ETHAmsterdam MIP4c3-SP2: Enmienda de la MIP62   Hay 20 propuestas recientes/activas con status RFC, la mayoría candidatas a entrar en el Ciclo de Gobernanza de Abril. Debates Pre-MIP  Propuesta Anti-inflacionaria DAI Respaldado por Subasta IAM para Buffer de Excedentes Ideas propuestas en el Foro [Pre-MIP] Usar el Giroscopio para cortar el nudo Gordiano del DAI: su dependencia de USDC Un solución estilo RWA para reemplazar al PSM   Votación Ejecutiva Autorizando el ESM en DssFlash y Añadir Soporte para la Implementación de TUSD Esta propuesta ejecutiva se aprobó el 26 de marzo y los siguientes cambios ocurrieron dentro del Protocolo Maker:  Autorizar el ESM en DssFlash para Remover los Permisos de la Gobernanza Basado en este post de la Core Unit de Ingeniería de Protocolos, el Módulo de Apagado de Emergencia fue autorizado en el Módulo de Acuñación Rápida. Este cambio está destinado a cubrir una vulnerabilidad descubierta entre la interacción del Módulo de Apagado de Emergencia y el Módulo de Acuñación Rápida. Específicamente, este cambio impide que una acción maliciosa de la Gobernanza pueda reactivar el módulo DssFlash después de que el contrato FlashKiller lo deshabilite.  Añadiendo Soporte para la Nueva Implementación de TUSD Basado en este post de la Core Unit de Ingeniería de Protocolos, se añadió soporte para la nueva dirección de implementación de TUSD. Esta adición pretende reanudar las operaciones de colaterales para TUSD-A, que automáticamente se detuvieron después del cambio del 24 de febrero del equipo de TUSD que señaló una nueva dirección de implementación. Para más información, considera leer este hilo acerca de la última vez que se cambiaron los contratos TUSD.  Encuesta de Gobernanza Activa     Nombre de la Encuesta Debate     Investigar la Implementación de un D3M Notional Finance Debate   Encuesta de Ratificación Corta para Enmiendas a la MIP62 (MIP4c3-SP2) Debate   Parámetros Iniciales para un Puente DAI Simple de StarkNet Debate   Encuesta de Ratificación Corta para la SPF del Evento de ETHAmsterdam (MIP55c3-SP3) Debate    Échale un vistazo al Relay Semanal del 21 de marzo para más información sobre las encuestas finalizadas recientemente.  Encuestas del Visto Bueno de la Comunidad No hubo encuestas del visto bueno de la comunidad para la semana del 14 – 15 de marzo de 2022. Échales un vistazo a los tipos de Vault actuales y a sus parámetros en MakerBurn.  Peticiones de Señales Activas [Señales Activas] Onboard de PAXG Sebastien de la Core Unit de Finanzas Estratégicas vuelve a tratar el tema e intenta presionar para que PAXG sea incorporado. Todas las evaluaciones de riesgos han sido presentadas durante el 2020:  Evaluación de la Comunidad sobre el Dominio del Contrato Inteligente del Token ERC20 [PAXG] Evaluación del Oráculo para la Incorporación de [PAXG] como Colateral (MIP10c3-SP16) Evaluación de Riesgo de [PAXG] como Colateral  Adicionalmente, PAXG fue aprobado previamente para ser incorporado a través de una encuesta de Gobernanza. Hoy, tanto la capitalización de mercado como la liquidez de PAXG han aumentado significativamente y la encuesta Uni V2, aunque pequeña, está manejando 2M de volumen por hora y 50M diarios. Los parámetros propuestos para PAXG son: un Techo de Deuda de 5M, un Ratio de Liquidación de 125% (que podría fijarse en 130%) y una Tarifa de Estabilidad de 4%, que también podría modificarse dependiendo de la situación actual. Sebastien señaló los pros y contras de incorporar PAXG y concluyó la petición de señal preguntándole a la comunidad si quieren incorporar a PAXG como un tipo de colateral en el MCD de Maker. La votación estará vigente hasta el 5 de abril de 2022. Aquí los últimos resultados de la votación actual:  1677×995 137 KB    Comunidad Deep Dai-ve  Tweet de la Semana   twitter.com    Dan Wu @itsdanwu  Token holders when you ask them to responsibly delegate voting power they’ll never use: https://t.co/DZKBzaOoY6   1:20 PM - 28 Mar 2022           23                2             Opiniones de Foro Hacia tomar riesgos de los activos – Una Guia  Esta semana estamos destacando el post de @SebVentures que explora formas de invertir la hoja de saldo de MakerDAO en activos productivos. En el Marco de Gestión de Activos y Pasivos (ALM por sus siglas en inglés) para MakerDAO, el riesgo de activos es definido como el “riesgo de fluctuación de los activos a largo plazo” más un valor de riesgo adicional (VaR), pensado como la “cantidad mínima de capital requerido para mantener con seguridad dicho activo y estar en sintonía con el apetito de riesgo de MakerDAO ” Si quieres saber más acerca de VaR, consulta Midiendo el Riesgo del Mercado de Kevin Dowd y Gestión de Riesgos en la Banca de Joël Bessis. (Nota: ten cuidado, es importante tener en cuenta que, como lo indica el autor, el paradigma VaR sigue siendo objeto de intensos debates en el mundo de las finanzas). Después de proveer una definición formal de VaR, nos encontramos nuestro primer caso de estudio: ETH. La Tasa Interna de Retorno (IRR por sus siglas en inglés) de ETH, aunque volátil, es impresionante en general.  966×583 18.7 KB  Como lo señala @SebVentures, sabemos que gran parte de la acción del precio en el futuro estará ligada al mecanismo de quema y a la tasa de inflación. Si bien se espera que eventualmente se dirija a cifras bajas de un solo dígito, una métrica de 50% o 100% de rendimiento de activos (RoA) es prudente para los próximos años. El modelo VaR/RoE que pueden ver, es para un RoA de 50%, 100% y 200%.  Juzgando por nuestro modelo, @SebVentures concluye que ETH parece ser una opción de inversión que vale la pena explorar a pesar de su alta volatilidad. Sin embargo, esta estrategia necesitara un Buffer de Excedente mas grande y no ayudara a que los activos ociosos de la empresa sean más productivos. Échale un vistazo al post completo para conocer más casos de estudio y conclusiones respecto al tema, los bonos corporativos a corto plazo, los bonos de tesorería a corto plazo y los bonos mixtos a corto plazo.   Articulos   Hacer que MakerDAO sea Importante de Nuevo  \"Hoy, Andreessen Horowitz, la firma de venture capital con máxima participación en crypto, incluyendo Maker, propuso añadir “funcionalidad al token MKR” para convertirlo tanto en una inversión como en un protocolo más atractivos. Si estás [email protected], vale la pena revisar los detalles de cada uno (siendo honesto, es demasiado para mí), pero, en resumen, ambas son propuestas para expandir la gama de activos con los que interactúa Maker y la forma en que maneja los colaterales y las tarifas. En el pasado, Maker se ha reinventado. En noviembre de 2019, el protocolo lanzó el DAI de múltiple colateral, permitiendo a los usuarios colateralizar activos adicionales, incluyendo Basic Attention Token (BAT). Unos meses después vino una funcionalidad similar para wrapped bitcoin (wBTC). Recientemente, el proyecto se ha ido expandiendo hacia el mundo de las finanzas tradicionales, permitiendo a los usuarios usar bienes raíces para financiar los préstamos. En septiembre, el gigante bancario francés Société Générale (SG) solicitó un prestamos de $20 millones en DAI.”      Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada  Gobernanza y Riesgo | Ep. 183   Video | Foro    Focus On #08 | stkMKR: Revisión de Staking & Tokenomics   Video | Foro    Focus On #07 | Principios de Prestamos RWF   Video | Foro      Próximas Llamadas  Issue Discussion Call #5 | Proceso de Modificación de Presupuestos – 30 de marzo a las 5 PM UTC   Únete | Foro      Gobernanza y Riesgo   Únete | Agenda – jueves a las 17:00 UTC   Horarios de Oficina de las Core Units   Únete | Gobernanza GovAlpha Q&As - Lunes 17:00 UTC  Únete | Seguridad Immunefi - Martes 00:00 UTC  Únete | Ingeniería de Protocolos - Martes 15:00 UTC  Únete | Escalado de Ecosistemas Sostenibles - Martes 15:30 UTC  Únete | Crecimiento - Miércoles 17:00 UTC  Únete | Activos del Mundo Real – Miércoles 17:00 UTC  Únete | Comunicaciones de Gobernanza - Viernes 18:00 UTC    Enlaces Útiles Foro y Chat de Maker Discusiones y debates en MakerDAO. Calendario de Llamadas | Calendario de Votaciones y Eventos Suscríbete a todas las llamadas públicas, votaciones y otros recordatorios. Herramientas de Participación Biblioteca de enlaces útiles para los Stakeholders; análisis de Protocolo, análisis de DAI, las métricas de colateral y liquidación, historia de la gobernanza e información sobre las subastas. Portal de Gobernanza Tabla de Votaciones para los votantes de MKR. Portal de MIPs Tabla de MIPs para todos. Portal de Aprendizaje y Portal de Documentación Técnica Aprende más sobre el Protocolo Maker.   ¿Tienes algún Comentario? ¡Valoramos tu opinión! Llena nuestra encuesta para hacernos saber qué se nos está pasando por alto o que podemos mejorar. Descargo: Esta actualización fue ensamblada por un grupo de miembros que contribuyen a la comunidad de MakerDAO. La misma no debería servir como asesoría financiera ni como incentivo para votar de alguna forma específica. Esta actualización es meramente informativa y para fines de comunicación solamente.  Créditos @Artem_Gordon @nothsa Esta es una traducción libre del artículo original en inglés gracias a @joserjimz y @Sebix. ",
                    "links": [
                        "https://pdfhost.io/v/ug82SkJYu_Weekly_Relay__March_22_28_2022",
                        "https://medium.com/@MkrGovComms/makerdao-current-events-governance-signals-and-calendar-28a3b7030575",
                        "https://forum.makerdao.com/t/a16z-makerdao-tokenomics-proposal-overview/14134",
                        "https://forum.makerdao.com/t/weekly-relay-march-15-21-2022/14119",
                        "https://forum.makerdao.com/t/stkmkr-maker-staking-and-tokenomics-revision/13890",
                        "https://forum.makerdao.com/t/anti-inflationary-proposal/13928",
                        "https://forum.makerdao.com/t/a16z-makerdao-tokenomics-proposal-overview/14134",
                        "https://forum.makerdao.com/t/against-the-burn/13412",
                        "https://forum.makerdao.com/t/a16z-makerdao-tokenomics-proposal-overview/14134",
                        "https://forum.makerdao.com/t/a16z-makerdao-tokenomics-proposal-one-adding-utility-functionality-to-the-mkr-token/14135",
                        "https://forum.makerdao.com/t/self-insurance-fund/10563",
                        "https://forum.makerdao.com/t/a16z-makerdao-tokenomics-proposal-two-aligning-governance-incentives/14137",
                        "https://forum.makerdao.com/t/signal-request-gbmkr-a-proposal-to-benefit-long-term-mkr-holders/12756/16",
                        "https://forum.makerdao.com/t/a16z-makerdao-tokenomics-proposal-three-increasing-financial-resiliency-and-fostering-growth/14138",
                        "https://forum.makerdao.com/t/against-the-burn/13412",
                        "https://forum.makerdao.com/t/weekly-mips-update-80/14274",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://manual.makerdao.com/governance/voting-in-makerdao/practical-guide-voting",
                        "https://forum.makerdao.com/t/weekly-mips-update-79-pinata/14106#things-to-come-crystal_ball-4",
                        "https://forum.makerdao.com/t/anti-inflationary-proposal/13928",
                        "https://forum.makerdao.com/t/auction-backed-dai/13011/11",
                        "https://forum.makerdao.com/t/premip-iam-for-surplus-buffer/11584",
                        "https://forum.makerdao.com/c/mips/proposal-ideas/21?order=activity",
                        "https://forum.makerdao.com/t/pre-mip-using-gyroscope-to-cut-through-dai-s-gordian-knot-its-usdc-dependency/8865",
                        "https://forum.makerdao.com/t/an-rwa-style-solution-to-replace-the-psm/8705",
                        "https://vote.makerdao.com/executive/template-executive-vote-authorizing-the-esm-on-dssflash-and-adding-support-for-tusd-implementation-march-25-2022#proposal-detail",
                        "https://forum.makerdao.com/t/proposed-security-fix-to-be-added-in-the-march-25th-2022-executive-spell/14197",
                        "https://mips.makerdao.com/mips/details/MIP38#protocol-engineering-pe-001-",
                        "https://makerdao.world/en/learn/governance/emergency-shutdown",
                        "https://manual.makerdao.com/module-index/module-flash-mint-module",
                        "https://forum.makerdao.com/t/flash-loan-debt-manipulation-during-emergency-shutdown-vulnerability-postmortem/14036",
                        "https://github.com/makerdao/flash-killer",
                        "https://forum.makerdao.com/t/2022-03-25-adding-support-for-the-new-tusd-implementation-address/14189",
                        "https://mips.makerdao.com/mips/details/MIP38#protocol-engineering-pe-001-",
                        "https://etherscan.io/tx/0x125823f2914e4f14e06b9b1b30fe9dd9512b36354cc1f6c063118c4fe03d8287",
                        "https://forum.makerdao.com/t/tusd-disabled-due-to-unannounced-token-asupgrade/2747",
                        "https://vote.makerdao.com/polling/QmcBwWAx#poll-detail",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782",
                        "https://vote.makerdao.com/polling/QmXZPYAu#poll-detail",
                        "https://forum.makerdao.com/t/mip4c3-sp2-mip62-amendments/13779",
                        "https://vote.makerdao.com/polling/QmUnhQZy",
                        "https://forum.makerdao.com/t/mip4c3-sp2-mip62-amendments/13779",
                        "https://vote.makerdao.com/polling/Qmb9brx3",
                        "https://forum.makerdao.com/t/starknet-simple-bridge-limit-poll-risk-assessment-mitigation/14158",
                        "https://forum.makerdao.com/t/weekly-relay-march-15-21-2022/14119",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-onboard-paxg/13768",
                        "https://forum.makerdao.com/t/paxg-erc20-token-smart-contract-domain-community-assessment/3443",
                        "https://forum.makerdao.com/t/paxg-collateral-onboarding-oracle-assessment-mip10c3-sp16/5376",
                        "https://forum.makerdao.com/t/paxg-collateral-onboarding-risk-evaluation/4833",
                        "https://vote.makerdao.com/polling/QmYwY5gP",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/d/d/ddca4c1e8ba872699720ce365deffc80043ffdea.jpeg",
                        "https://twitter.com/itsdanwu/status/1508433956177330179",
                        "https://twitter.com/itsdanwu/status/1508433956177330179",
                        "https://twitter.com/itsdanwu/status/1508433956177330179",
                        "https://t.co/DZKBzaOoY6",
                        "https://twitter.com/itsdanwu/status/1508433956177330179",
                        "https://forum.makerdao.com/t/towards-taking-asset-risks-a-primer/14265",
                        "https://forum.makerdao.com/t/alm-framework-for-makerdao/12994",
                        "https://www.wiley.com/en-dk/Measuring+Market+Risk,+2nd+Edition-p-9780470013038",
                        "https://www.wiley.com/en-us/Risk+Management+in+Banking%2C+4th+Edition-p-9781118660218",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/8/7/87912b3186d822bfa10f23b43da5d103358b4334.png",
                        "https://www.nasdaq.com/articles/making-makerdao-matter-again",
                        "https://youtu.be/7rxxNBmcIFk",
                        "https://forum.makerdao.com/t/governance-and-risk-183-thursday-march-24-17-00-utc/14150",
                        "https://youtu.be/uGvBI_L9jaI",
                        "https://forum.makerdao.com/t/focus-on-8-stkmkr-staking-tokenomics-revision/14001",
                        "https://youtu.be/0PHMxH9zsR4",
                        "https://forum.makerdao.com/t/focus-on-7-rwa-lending-principles/14000",
                        "https://us02web.zoom.us/j/83222037524",
                        "https://forum.makerdao.com/t/issue-discussion-call-5-budget-modification-process/14226",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com",
                        "https://chat.makerdao.com",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/weekly-relay-march-22-28-2022/14300",
                        "https://forum.makerdao.com/t/relay-semanal-28-de-marzo-4-de-abril-de-2022/14495"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4558823529411775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#2",
                    "likes": "4",
                    "time": "31/03/2022-12:36:15",
                    "content": "Gracias por el aporte, José, muy valioso. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "4",
                    "time": "31/03/2022-12:40:04",
                    "content": "Me encanto tu trabajo, felicidades jose, eres un crack ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#4",
                    "likes": "4",
                    "time": "31/03/2022-16:52:22",
                    "content": "Excelente trabajo jose  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Muzza",
                    "index": "#5",
                    "likes": "4",
                    "time": "31/03/2022-20:20:40",
                    "content": "Excelente aporte Jose  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#6",
                    "likes": "4",
                    "time": "31/03/2022-22:17:25",
                    "content": "Excelente como siempre gente, se agradece! @Joserjimz @Sebix ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#7",
                    "likes": "3",
                    "time": "05/04/2022-18:46:36",
                    "content": "Excelente José, gracias! Muy interesante el debate alrededor de los tokenomics y buscarle usos a MKR para incentivar la gobernanza. Personalmente me preocupa un poco la compensación a través de un modelo veToken. El problema de iliquidez por el lockeo de los tokens que puede traer a nuevos usuarios es claramente una cuestión que puede desincentivar la adopción de MKR a los usuarios menos centralizados. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#8",
                    "likes": "3",
                    "time": "06/04/2022-15:52:33",
                    "content": "Si, es un tema a tener en cuenta. En mi opinión sería bastante buena una revisión a los tokenomics. También darle una mayor utilidad a los tokens creo que pudiera beneficiar al protocolo, tendremos que esperar a ver qué impacto tienen estos cambios (si son aprobados  obviamente) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#9",
                    "likes": "2",
                    "time": "06/04/2022-16:48:03",
                    "content": "Estoy de acuerdo en que revisar los tokenomics sería una buena idea! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-28-de-marzo-4-de-abril-de-2022/14495",
            "title": "Relay Semanal: 28 de marzo - 4 de abril de 2022 ",
            "index": 14495,
            "category": [
                "Latin America"
            ],
            "tags": [
                "update",
                "espa\\xc3\\xb1ol",
                "latin-america",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/NCO",
                    "index": "#1",
                    "likes": "4",
                    "time": "07/04/2022-01:37:10",
                    "content": " 1727×390 306 KB  ¡Hola a todos! ¡Gracias por consultar el Relay Semanal! Ya sea que tengas Maker (MKR) o DAI, poseas una Vault o quieras involucrarte más en la Gobernanza de MakerDAO, esta es tu parada rápida para estar al tanto de las actualizaciones del ecosistema de MakerDAO.  La versión pública en PDF en inglés se puede encontrar aquí. Dale amor a nuestra cuenta en Medium     Eventos Actuales  Actualizaciones del Foro: Explorador del Foro y Estimaciones de Impacto Dado que la mayoría de las discusiones públicas sobre MakerDAO y su Gobernanza se centran en nuestros foros, la gestión de estos y su facilidad de uso son cada vez más importantes, especialmente, a medida que la cantidad de participantes y contribuyentes del ecosistema crece. Dos iniciativas tienen como objetivo facilitar la navegación y búsqueda en el foro, y ayudar a los asistentes del foro a decidir qué elementos de la Gobernanza merecen la pena dedicar más tiempo en su investigación.  Presentando el Explorador del Foro  El Explorador del Foro es un complemento de Discourse que fue agregado al foro por GovAlpha para facilitar la búsqueda en los foros utilizando filtros accesibles y consultas personalizadas.  Características Principales  Los administradores del foro pueden crear consultas personalizadas completas con títulos y descripciones. Esto nos permite mostrar contenido clave del foro de forma más eficaz que las herramientas predeterminadas. Los usuarios pueden aplicar filtros de etiquetas y categorías utilizando la barra lateral de la izquierda, lo que permite una exploración y descubrimiento más naturales del contenido relevante. Los usuarios pueden buscar/filtrar cuadros para publicaciones, etiquetas y categorías dentro de esta interfaz para facilitar aún más la navegación hacia el contenido relevante.  Aquí en GovComms, hacemos un uso intensivo del Explorador del Foro cada vez que realizamos una de estas publicaciones.  Presentación de Estimaciones de Impacto  La semana pasada, GovAlpha anunció que están investigando aplicar estimaciones de impacto para activar MIPs y Peticiones de Señal. En una estimación de impacto, un miembro del equipo de GovAlpha asigna un valor (“Posible Bajo Impacto”, “Posible Mediano Impacto” y “Posible Alto Impacto”) a cada uno de los elementos nuevos de la Gobernanza que es posteado en el foro. Estas estimaciones tienen como objetivo dar a los usuarios del foro una idea de cuán importantes e impactantes pueden ser los nuevos elementos de la Gobernanza y ayudar a los lectores a decidir cuánto tiempo deben dedicar a la interacción con cada uno de ellos.   Más Detalles acerca de los Valores de Estimaciones de Impacto  Posible Alto Impacto  Cualquier cosa que agregue un riesgo concretamente identificable al Protocolo de Maker. Cualquier cosa que la DAO esté realizando por primera vez. Cualquier cosa que quite una cantidad no trivial de dinero del buffer de excedentes. Incorporación y remoción de Core Units. Cualquier cosa que realice cambios permanentes en los procesos o estructuras de la Gobernanza dentro de MakerDAO.  Posible Mediano Impacto  Elementos que agregan riesgo o agotan al buffer de excedentes que pueden conducir a decisiones posteriores. Cualquier cosa que quite una cantidad trivial de dinero del buffer de excedentes.  Posible Bajo Impacto  Cambios menores en la redacción y/o correcciones a las MIPs existentes.    En los posteos del foro, busca por las etiquetas de impacto sobre Solicitud de Comentarios (RFC - Request for Comments), MIPs y Peticiones de Señales. Estos también serán incluidos en la hoja de cálculo de seguimiento de la Gobernanza.   Esta Semana en la Gobernanza  Propuestas de Mejora de Maker (MIPs) Actualización Semanal de MIPs #81 por @blimpa  952×714 28 KB  Dos Encuestas de Ratificación cortas (encuestas de tres días para propuestas que entran en el Ciclo Semanal) estuvieron vigentes desde el 28 de marzo al 31 de marzo. Ambas propuestas fueron aprobadas - las enmiendas a la MIP62 han sido fusionadas. El desembolso del SPF (Special Purpose Funds, Fondos de Propósito Especial) irá a una votación ejecutiva tan pronto como se hayan resuelto los detalles de la multisig (multi firma).  Según la MIP4c3 y MIP4c3-SP3: Enmendar la MIP64 para Permitir una Mayor Flexibilidad en el Alcance es una subpropuesta de ciclo semanal que requiere que se apruebe una petición de señal con al menos un 51% antes de promocionarse on-chain. Esta petición de señal ya se encuentra activa y estará vigente durante una semana. ¡Ve a votar!   La Ventana de Presentación Formal de abril ya se encuentra abierta y se cerrará al final del día miércoles 6. Esto es relevante para las propuestas que ingresen en el Ciclo Mensual de la Gobernanza, hayan completado su Período de Feedback, cumplieron con su Período de Congelamiento y son elegibles para ingresar al ciclo de abril.    Las fechas de Solicitud de Comentarios (RFC - Request for Comments) y Presentación Final (FS - Final Submission) para referencia y las propuestas existentes se pueden ver en este registro de propuestas (en proceso)  Si tienes alguna consulta acerca del proceso de votación de MakerDAO, esta Guía Práctica de Votación te será útil.    Votaciones Ejecutivas Distribución de Presupuesto de Core Units y Configuración de Flujos de Vesting, Configuración del Flujo de Presupuesto de la Red Keeper de Gelato Esta propuesta ejecutiva ha sido aprobada y los siguientes cambios ocurrieron en el Protocolo de Maker:  Transferencias de Presupuesto de Core Units Según múltiples propuestas presupuestarias exitosas, 2.433.452,30 DAIs fueron transferidos a múltiples Core Units. Más Información:     Core Unit Monto Propuesta de Presupuesto     GovAlpha 30.000 DAI Propuesta   Seguridad Immunefi 348.452,30 DAI Propuesta   Finanzas del Mundo Real 2.055.000 DAI Propuesta      Flujos de Presupuesto de Core Units Según múltiples propuestas presupuestarias exitosas, 7.945.149,90 DAIs fueron transmitidos a múltiples Core Units. Más Información: | Core Unit | Monto | Propuesta de Presupuesto | | GovAlpha | 1.079.793 DAI | Propuesta | | Seguridad Immunefi | 700.356,90 DAI | Propuesta | | Finanzas del Mundo Real | 6.165.000 DAI | Propuesta | Se revocará el flujo presupuestario de DAI existente para la Core Unit de Finanzas del Mundo Real.   Flujo de Vesting de MKR de Core Units Según esta propuesta presupuestaria de MKR exitosa, un total de 167,64 MKR fueron conferidos a miembros de la Core Unit de GovAlpha (GOV-001), como se detalla debajo. Más Información:     Persona/Core Unit Monto Comienzo Fin     LongForWisdom 73,70 MKR 08-02-2022 08-02-2023   prose11 52,74 MKR 08-02-2022 08-02-2023   GovAlpha Multisig 41,20 MKR 08-02-2022 08-02-2023      Compensanción Retroactiva de MKR para LongForWisdom Según la propuesta presupuestaria de MKR exitosa de la Core Unit de GovAlpha GOV-001), un total de 60 MKR fueron transferidos al Facilitador LongForWisdom a 0xC818Ae5f27B76b4902468C6B02Fd7a089F12c07b.  Flujo de Presupuesto de la Red Keeper de Gelato Según la MIP ratificada, MIP63c4-SP3: Incorporación de Red Keeper - Red Gelato, más aclarada en esta publicación del foro, un total de 183.000 DAI fueron transmitidos a la Red Keeper de Gelato. Más Información: 183.000 DAI fueron transmitidos a la Red Keeper de Gelato a 0x926c21602fec84d6d0fa6450b40edba595b5c6e4 comenzando el 01-04-2022 y finalizando el 30-09-2022 a una tasa de 1.000 DAI/día.   Encuestas de la Gobernanza Activas     Nombre de la Encuesta Debate     Lanzar el Wormhole (agujero de gusano) de Maker con Dominios Optimism y Arbitrum Debate   PPG - Propuesta del Comité de Mercado Abierto Debate    Consulta la edición del 28 de marzo del Relay Semanal para obtener más información acerca de las encuestas que han finalizado recientemente.  Encuestas del Visto Bueno de la Comunidad No hubieron encuentas del visto bueno de la comunidad para la semana del 29 de marzo - 4 de abril de 2022. Consulta el punto de vista de “De Un Vistazo” sobre los tipos de Vault actuales y sus parámetros en MakerBurn.  Peticiones de Señal Activas [Petición de Señal] Incorporar PAXG Sebastien de la Core Unit de Finanzas Estratégicas vuelve a tratar el tema e intenta presionar para que PAXG sea incorporado. Más Información: Todas las evaluaciones de riesgos han sido presentadas durante el 2020:  [PAXG] Evaluación de la Comunidad sobre el Dominio del Smart Contract (Contrato Inteligente) del Token ERC20 [PAXG] Evaluación del Oráculo para la Incorporación de Colateral (MIP10c3-SP16) [PAXG] Evaluación de Riesgo de Incorporación de Colateral  Adicionalmente, PAXG fue aprobado previamente para ser incorporado a través de una encuesta de la Gobernanza. Hoy, tanto la capitalización de mercado como la liquidez de PAXG han aumentado significativamente y la encuesta Uni V2, aunque pequeña, está manejando 2M de volumen por hora y 50M diarios. Los parámetros propuestos para PAXG son: un Techo de Deuda de 5M, un Ratio de Liquidación de 125% (que podría fijarse en 130%) y una Tarifa de Estabilidad de 4%, que también podría modificarse dependiendo de la situación actual. Sebastien señaló los pros y contras de incorporar PAXG y concluyó la petición de señal preguntándole a la comunidad si quieren incorporar a PAXG como un tipo de colateral en el MCD de Maker. La votación estará vigente hasta el 5 de abril de 2022  Aquí se encuentran los resultados actuales de la votación:  1677×995 137 KB   Avanzar “MIP4c3SP3: Enmendar la MIP64 para Permitir una Mayor Flexibilidad en el Alcance” a una encuesta on-chain @psychonaut presentó una solicitud de señal para empujar a la MIP4c3-SP3 a una encuesta on-chain. La votación estará vigente hasta el 12 de abril de 2022 Aquí se encuentran los resultados actuales de la votación:  1745×590 72.3 KB     Comunidad Deep Dai-ve  Tweet de la Semana   twitter.com    korpi @korpi87  There are examples of overcollateralized stablecoins that are below the peg for some longer period but it's not because of their low liquidity but low utility in DeFi. DAI as the first DeFi stablecoin has been used in many projects and this risk is extremely low.  DAI won't die.   10:57 PM - 2 Apr 2022           34                1             Posteos del Foro La Plataforma del Delegado “Penn Blockchain” Penn Blockchain, una organización de blockchain dirigida por estudiantes en la Universidad de Pensilvania, ha publicado oficialmente su plataforma de delegados en el foro. Penn Blockchain espera utilizar su amplia experiencia en criptogobernanza para ayudar a Maker a tomar las mejores decisiones para su protocolo. Los miembros están involucrados en iniciativas de la Gobernanza para varios protocolos populares para los cuales ellos tienen delegaciones, incluidos Aave, Compound, Uniswap y DyDx. El autor de la propuesta, @juanbug, está trabajando internamente con nosotros para investigar estrategias on-chain para aumentar la tesorería y la liquidez del DAI. Valores Principales  Transmitir Maker, no solo para Penn, sino también para la comunidad universitaria en general. Ayudar a Maker a través de su Layer-2 e integraciones de red cruzadas. Aconcejar y apoyar a Maker con iniciativas de gestión de tesorería. Educar y enseñar a los estudiantes sobre el proyecto Maker, expandir sus conexiones con equipos universitarios y brindar oportunidades para futuras colaboraciones.  [Discusión] Replanteando el Presupuesto para las Core Units La presupuestación de las Core Unit ha sido un tema candente en las últimas semanas en los foros. La última incorporación a la discusión proviene del Delegado Reconocido Justin Case, quien analiza el tema en partes y explora en cuáles de estas partes podría ser más valioso enfocarse. @JustinCase comienza identificando los diferentes elementos que cualquier proceso presupuestario debe equilibrar:  Facilidad de comparar diferentes presupuestos entre sí. Gastos generales de la Gobernanza derivados de la evaluación de un número creciente de presupuestos. La capacidad de realizar cambios significativos en un presupuesto contra la necesidad de evitar la microgestión y respetar la autonomía de la Core Unit. La necesidad de supervisión contra la demanda de trabajo en la presentación de informes y evaluaciones. El riesgo de proporcionar a las Core Units demasiados fondos que no se utilizan ni se devuelven contra mantener operaciones eficientes y la necesidad de solicitudes frecuentes de presupuesto adicional. Sobre o infra utilización de una Core Unit dada por su presupuesto, especialmente para Core Units que sirven principalmente a otras Core Units.  A continuación, Case se centra en dos áreas en las que la mejora puede fomentar una mayor disciplina presupuestaria y ayudar a garantizar que los recursos se gasten en iniciativas más valiosas. Financiación Indirecta Financiar indirectamente a una Core Unit, lo que significa que no recibirán un presupuesto directo sino que se financiarán según sea necesario, lo que ayudará a garantizar que solo se financien los servicios de la comunidad. Competencia Luego, Case describe una idea interesante para introducir la competencia natural para ejercer presión sobre una reducción en las propuestas presupuestarias. Al agregar redundancia a la organización de las Core Units, es decir, al establecer Core Units paralelas en el mismo campo y, al mismo tiempo, garantizar que ninguna de ellas pueda monopolizar todo el trabajo, las Core Units competirán para brindar los mejores servicios a la DAO al menor costo. Como toda propuesta, esta viene con sus ventajas y desventanjas. Pros  Mayor concentración en los objetivos ya que ahora se encuentran al nivel del Protocolo. Costo de control elevado ya que las Core Units deberán ser atractivas para ganar ofertas para el trabajo. Mejor redundancia porque otras Core Units pueden crecer y reemplazar a otras si estas dejan de funcionar. Centrarse menos en la micro gestión de Core Units y en propuestas presupuestarias detalladas. Incremento en la autonomía de las Core Units.  Contras  Incremento de los gastos generales de la Gobernanza en el diseño de objetivos. Con Core Units individuales de tamaño reducido, es posible que, de forma independiente, no sean capaces de hacer que el protocolo avance. Menos seguridad para las Core Units puede llevar a su desvinculación del protocolo.  La discusión sobre este tema ya está candente. Comparte tu opinión aquí.   Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada  Llamada de la Gobernanza y Riesgo | Ep. 184   Video | Resumen | Foro    Llamada de Discusión de Problemas # 5 | Proceso de Modificación de Presupuesto   Video | Resumen | Foro      Próximas Llamadas  Gobernanza y Riesgo   Link para Unirse | Agenda - Jueves a las 16:00 UTC   Horas de Oficina de las Core Units   Link para Unirse | GovAlpha - Preguntas y Respuestas de la Gobernanza - Lunes 17:00 UTC  Link para Unirse | Seguridad Immunefi - Martes 00:00 UTC  Link para Unirse | Ingeniería del Protocolo - Martes 15:00 UTC  Link para Unirse | Escalado de Ecosistemas Sostenibles - Martes 15:30 UTC  Link para Unirse | Crecimiento - Miércoles 17:00 UTC  Link para Unirse | Finanzas del Mundo Real - Miércoles 17:00 UTC  Link para Unirse | Comunicaciones de Gobernanza - Viernes 18:00 UTC    Links Útiles Foro y Chat de Maker Discusiones y debates en MakerDAO. Calendario de Llamadas Público | Calendario de Votación & Eventos Público Suscripción para todas las llamadas públicas, votaciones y otros recordatorios. Herramientas de Participación Biblioteca de enlaces útiles para los Stakeholders; análisis de Protocolo, análisis de DAI, las métricas de colateral y liquidación, historia de la gobernanza e información sobre las subastas. Portal de Gobernanza Tabla de Votaciones para los votantes de MKR. Portal de MIPs Tabla de MIPs para todos. Portal de Aprendizaje y Portal de Documentación Técnica Aprende más sobre el protocolo de Maker.   ¿Tienes algún Feedback? ¡Valoramos tu opinión! Haz nuestra encuesta para hacernos saber qué se nos está pasando por alto o podemos mejorar. Descargo: Esta actualización fue ensamblada por un grupo de miembros que contribuyen a la comunidad de MakerDAO. La misma no debería servir como asesoría financiera ni como incentivo para votar de alguna forma específica. Esta actualización es meramente informativa y para fines de comunicación solamente.  Créditos @Artem_Gordon @nothsa  Esta es una traducción libre del artículo original en inglés gracias a @NCO y @Sebix ",
                    "links": [
                        "https://medium.com/@MkrGovComms",
                        "https://forum.makerdao.com/t/introducing-forum-explorer/14384",
                        "https://forum.makerdao.com/explorer",
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://forum.makerdao.com/t/weekly-mips-update-81/14443",
                        "https://github.com/makerdao/mips/pull/487/files",
                        "https://forum.makerdao.com/t/mip55c3-sp3-ethamsterdam-event-spf/13781/72",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://manual.makerdao.com/governance/voting-in-makerdao/practical-guide-voting",
                        "https://vote.makerdao.com/executive/template-executive-vote-core-unit-budget-distributions-and-vesting-streams-setup-gelato-keeper-network-budget-stream-setup-april-1-2022#proposal-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP3",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP24",
                        "https://mips.makerdao.com/mips/details/MIP4c2SP17",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP61",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP3",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP24",
                        "https://mips.makerdao.com/mips/details/MIP4c2SP17",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP61",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP60",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP3",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP60",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP3",
                        "https://etherscan.io/address/0xC818Ae5f27B76b4902468C6B02Fd7a089F12c07b",
                        "https://mips.makerdao.com/mips/details/MIP63c4SP3",
                        "https://forum.makerdao.com/t/mip63c4-sp3-gelato-network-clarification/14340",
                        "https://etherscan.io/address/0x926c21602fec84d6d0fa6450b40edba595b5c6e4",
                        "https://vote.makerdao.com/polling/Qmbzzbna#poll-detail",
                        "https://forum.makerdao.com/t/request-to-poll-for-maker-wormhole-deployment-and-associated-risk-parameters/14209",
                        "https://vote.makerdao.com/polling/QmdS8mCx#poll-detail",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-31-march-2022/14347",
                        "https://forum.makerdao.com/t/relay-semanal-22-28-de-marzo-de-2022/14333",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-onboard-paxg/13768",
                        "https://forum.makerdao.com/t/paxg-erc20-token-smart-contract-domain-community-assessment/3443",
                        "https://forum.makerdao.com/t/paxg-collateral-onboarding-oracle-assessment-mip10c3-sp16/5376",
                        "https://forum.makerdao.com/t/paxg-collateral-onboarding-risk-evaluation/4833",
                        "https://vote.makerdao.com/polling/QmYwY5gP",
                        "https://forum.makerdao.com/t/advance-mip4c3sp3-amend-mip64-to-allow-more-flexibility-in-scope-to-on-chain-poll/14435",
                        "https://forum.makerdao.com/t/mip4c3sp3-amend-mip64-to-allow-more-flexibility-in-scope/14200",
                        "https://twitter.com/korpi87/status/1510390940166500352?s=20&t=6eMtn9893taRERUuRgpb_A",
                        "https://twitter.com/korpi87/status/1510390940166500352?s=20&t=6eMtn9893taRERUuRgpb_A",
                        "https://twitter.com/korpi87/status/1510390940166500352?s=20&t=6eMtn9893taRERUuRgpb_A",
                        "https://twitter.com/korpi87/status/1510390940166500352?s=20&t=6eMtn9893taRERUuRgpb_A",
                        "https://forum.makerdao.com/t/penn-blockchain-delegate-platform/14419",
                        "http://pennblockchain.com/",
                        "https://forum.makerdao.com/t/discussion-rethinking-budgeting-for-cus/14410",
                        "https://forum.makerdao.com/t/discussion-rethinking-budgeting-for-cus/14410",
                        "https://youtu.be/P9DBZ5sXwcI",
                        "https://medium.com/@MkrGovComms/makerdao-governance-mips-forums-and-steth-market-share-strategy-9a5983e3b95c",
                        "https://forum.makerdao.com/t/governance-and-risk-184-thursday-march-31-17-00-utc/14314",
                        "https://youtu.be/1UE98EVrk2I",
                        "https://medium.com/@MkrGovComms/makerdao-budget-modification-process-discussion-b259784c5468",
                        "https://forum.makerdao.com/t/issue-discussion-call-5-budget-modification-process/14226",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com/",
                        "https://chat.makerdao.com/",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forms.gle/Z2QAgywU2Sesm7Vy6",
                        "https://forum.makerdao.com/t/weekly-relay-march-28-april-4-2022/14450"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.339285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "1",
                    "time": "07/04/2022-21:28:46",
                    "content": "Excelente trabajo Noe   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#3",
                    "likes": "2",
                    "time": "08/04/2022-01:32:17",
                    "content": "Gran trabajo . \"     NCO:  Luego, Case describe una idea interesante para introducir la competencia natural para ejercer presión sobre una reducción en las propuestas presupuestarias. Al agregar redundancia a la organización de las Core Units, es decir, al establecer Core Units paralelas en el mismo campo y, al mismo tiempo, garantizar que ninguna de ellas pueda monopolizar todo el trabajo, las Core Units competirán para brindar los mejores servicios a la DAO al menor costo.   Respecto a esto, está bueno plantear la posibilidad, pero se me ocurre que la idea de que compitan CUs por presupuesto, puede impactar su efectividad y la calidad de trabajo al no disponer de los mismos recursos. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                }
            ]
        }
    ],
    "group_index": "888"
}