{
    "poll_list": [
        {
            "title": "Ratification Poll for Governance Communications Core Unit, COM-001 - July 12, 2021",
            "index": "7009",
            "option": "Yes",
            "supporting_mkr": "34,450",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip39c2-sp8-governance-communications-core-unit-com-001/7009",
            "title": "MIP39c2-SP8: Governance Communications Core Unit, COM-001 ",
            "index": 7009,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "communications",
                "core-unit",
                "com-001",
                "proposal-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "10",
                    "time": "12/03/2021-22:54:46",
                    "content": " MIP39c2-SP8: Governance Communications Core Unit, COM-001  Preamble MIP39c2-SP#: 8 Author(s): David Utrobin Contributors: Many Status: Formal Submission Date Applied: 2021-03-12 Date Ratified: <yyyy-mm-dd>   Sentence Summary MIP39c2-SP8 adds Core Unit COM-001: Governance Communications.  Specification Note: the information presented in this section, and more, is available as permanent documentation in our public drive as part of our transparency reporting. It will be kept up-to-date even after the publication and approval of this MIP.  Paragraph Summary The Governance Communications Core Unit performs a complementary set of resources and services that focus on MakerDAO’s informational accessibility and communication practices as a public organization. Vision A healthy communication and information infrastructure:  Makes consistent, comprehensive, and accurate information accessible. Has well-managed public communication venues. Engages with stakeholders to improve its output. Provides dedicated support and multiple points of access to members of the media. Advocates for, facilitates, and promotes beneficial organizational communication practices. Maps the organization and its surrounding stakeholder ecosystem. Results in a more effective and less opaque organization that attracts more stakeholders.   Motivation Now that MakerDAO has completed the launch of Multi-Collateral Dai, followed by very strong growth, it is time to focus on improving MakerDAO as a public organization, not just as a technology. MakerDAO is a multi-headed rapidly-growing organization with many categories of focus and numerous stakeholder groups. As a result, our stakeholders face many difficulties; keeping up with the growing volume and complexity of information, spending too much time searching, filtering noise, understanding Maker lingo, not knowing who is a point of contact for what, inability to make it to all the meetings, and more. These are only some of the barriers to increasing the quality of their experience working with us. As we grow, the difficulties will too unless we begin to proactively address them. Our motivation is to improve MakerDAO’s performance as a public organization by removing information and communication barriers for stakeholders. A dedicated communications team is fundamental for strengthening MakerDAO’s dependability day-to-day and in crisis situations. Such a team would help MakerDAO operate more effectively as a public organization, become more transparent and reliable, increase trustworthiness among stakeholders, and ultimtely attract more business interest.  Core Unit Name Name: Governance Communications ID: COM-001  Core Unit Facilitator David Utrobin  Mandate Perform a complementary set of resources and services that focus on MakerDAO’s informational accessibility and communication practices as a public organization. Below is the envisioned scope; not all of it will be covered immediately, and we may alter it in the future as a result of feedback and new developments.  1120×434 20.2 KB   Resources Governance News & Reports COM-001 leads this, and collaborates with other Core Units.  Weekly Maker Relay Monthly Governance Report Annual Governance Report  Public Call Summaries Leads a team of part-time contributors to produce summaries for all public calls.  Seven Call Types and Growing  Governance and Risk Know Your MIP Core Unit Launch Pod Sessions Core Unit Tools Core Unit Rituals Office Hours Speaker Series   Three types of summary  Snippets Semi-Transcibed Editiorial    MakerDAO Public Calendar Maintains and improves the calendar, and acts as a point of access for other CUs to add events.  GovAlpha also has access to this Calendar, for redundancy and collaboration. Access point ensures the new calls are tracked by the summaries team.  Organization & Stakeholder Mapping Creates and maintains a public Organization Chart of MakerDAO and non-public stakeholder registries for the DAO.  Org Chart captures all CUs, their Facilitators, and other Key people. Stakeholder Map, captures the surrounding landscape of stakeholder groups. Stakeholder Registries:  MKR Voters Freelance Contributors Delegates Media Key people at other DAOs Backup Registries for other CUs (Partners, Integrators, etc)   Use Cases for Registries and Backup Registries  Rollodexes for DAO-use will enable better connectivity. Groups stakeholders for easier outreach.     Services Stakeholder Engagement with Informational Focus Engages stakeholders for information-related feedback and advises MakerDAO on how to improve.  Cross-DAO research, outreach, and coordination around mutually important issues. MKR Holder outreach about information disclosure quality. Works with Core Units to improve their Reporting standards.  Issue Discussion Public Call Series Leads a public call series that discusses governance decisions and other issues, inviting the stakeholders that would be affected most.  Used to discuss issues at all levels. Weighs pros and cons of varying proposals in the presence of a well-balanced group of stakeholders. Uses the stakeholder registries to inform relevant stakeholders about upcoming discussion calls.  Press & Media Relations Support Gives members of the media known points of access for engaging with us.  Sets up an individual as a dedicated point of contact. Maintains and manages access to the Media Inquiries section of the forum. Works with other Core Units to resolve inquiries  Emergency Communications Support Ensures that crisis moments have the support of a dedicated communications team so that key actors can focus on decision making and executing solutions rather than managing public comms.  Co-Authors Emergency Response Process MIP, still in conception. Maintains a set of emergency response templates in collaboration with other CUs. Posts and maintains a view-only Update Thread and a public Discussion Thread. Works with Protocol Engineering, Oracles, Risk, and others to publish live updates. Point of contact for Press Inquiries. Provides backup access to Stakeholder Registries for emergency outreach.  Communication Platform Stewardship Leads a small team of community moderators, establishes guidelines and best practices for moderating, suggests improvements for user experience.  Facilitates moderation duties on our most used communication platforms  Forum.makerdao.com Rocketchat Reddit   Collaborates with the Governance Core Unit to improve venues.   Roadmap  Month 1-3: Setup and Cover the Bases  Execute on our active projects as usual. Set up administrative operations. Activate unlaunched projects (Issue Discussion Call, Org Mapping, etc) Hire and onboard for all required roles. Set up project owners. Set up project tracking. Set up Transparency Reporting & Self-Auditing. Assess budget, submit proposal for changes if needed.   Month 3+: Execute and Report  Execute on our mandate. Improve on our projects. Improve on our documentation and tracking. Refine our goals and vision per project. Update the roadmap for the next quarter and communicate explicitly about our progress, blockers, and needs.   Team Structure The Governance Communications Core Unit will function as a self-managing entity with a hierarchical management structure. Contributors and Project Managers answer to the Facilitator, who then answers to MKR holders and the wider community. The three main roles in this Core Unit are Facilitator, Project Manager, and Contributor. The contributor role is not a full-time role. If a contributor is interested in a full-time role, they become a project manager.     Title Commitment Name     Facilitator Full-time David Utrobin   Project Manager (Content & People) Full-time Artem Gordon   Project Manager (Engagement Lead) Full-time Hiring   Contributor Part-time x8     Team Credentials Members on this team bring expertise in communications, english writing skills, and project management. Members should also bring a comprehensive understanding of the Maker Protocol, its governance process, and its stakeholders.  Working Philosophy Aggregate and Simplify. Stakeholders need to be kept informed. This team works on a variety of projects and is fully remote. This means that as a team we embrace the concept of agile workflows, pair and group working sessions, mutual accountability, and getting things done. As part of our day-to-day, we:  Consider how each of our projects can be improved and iterated on. Maintain an open culture for discussion, collaboration, and learning. Are unafraid to voice concerns or give constructive feedback. Embrace a shared decision-making methodology to avoid getting stuck as a team. Maintain active relationships with mandated actors and the greater stakeholder community. Aim to constantly raise the bar for quality and coverage. Keep a tight coupling with the Governance Core Unit and the community to ensure communication needs are being met.  ",
                    "links": [
                        "http://Forum.makerdao.com",
                        "https://forum.makerdao.com/t/mip40c2-sp8-modify-core-unit-budget-com-001/7010/2",
                        "https://forum.makerdao.com/t/mips-update-36/8125",
                        "https://forum.makerdao.com/t/weekly-mips-update-35/7962",
                        "https://forum.makerdao.com/t/weekly-mips-update-34/7668",
                        "https://forum.makerdao.com/t/weekly-mips-update-33/7573",
                        "https://forum.makerdao.com/t/weekly-mips-update-32/7464",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-135-thursday-april-1-17-00-utc/7206/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-31/7232",
                        "https://forum.makerdao.com/t/business-strategy-and-evaluation-framework-for-business-like-core-units/7218",
                        "https://forum.makerdao.com/t/core-unit-mandate-overlap/7210",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-12-18-2021/7089",
                        "https://forum.makerdao.com/t/mip40c3-sp8-modify-core-unit-budget-com-001/7010/7",
                        "https://forum.makerdao.com/t/maker-relay-ep-36-en-espanol/7053",
                        "https://forum.makerdao.com/t/maker-relay-ep-36/7039",
                        "https://forum.makerdao.com/t/weekly-mips-update-30/7083",
                        "https://forum.makerdao.com/t/maker-relay-ep-54-en-espanol/9476",
                        "https://forum.makerdao.com/t/maker-relay-ep-54/9437",
                        "https://forum.makerdao.com/t/maker-relay-ep-53-en-espanol/9330",
                        "https://forum.makerdao.com/t/maker-relay-ep-53/9305",
                        "https://forum.makerdao.com/t/ama-governance-communications-with-david-utrobin/9280",
                        "https://forum.makerdao.com/t/maker-governance-review-june-2021/9211",
                        "https://forum.makerdao.com/t/weekly-mips-update-42/9010",
                        "https://forum.makerdao.com/t/weekly-mips-update-41/8892",
                        "https://forum.makerdao.com/t/maker-relay-ep-49-en-espanol/8795",
                        "https://forum.makerdao.com/t/maker-relay-ep-49/8763",
                        "https://forum.makerdao.com/t/weekly-mips-update-40/8759",
                        "https://forum.makerdao.com/t/maker-governance-review-may-2021/8613",
                        "https://forum.makerdao.com/t/weekly-mips-update-39/8606",
                        "https://forum.makerdao.com/t/maker-relay-ep-47-en-espanol/8547",
                        "https://forum.makerdao.com/t/maker-relay-ep-47/8491",
                        "https://forum.makerdao.com/t/weekly-mips-update-38/8486",
                        "https://forum.makerdao.com/t/discussion-press-releases-at-makerdao/8323",
                        "https://forum.makerdao.com/t/weekly-mips-update-37/8309"
                    ],
                    "GPT-summary": "The post is a formal submission of a proposal for the creation of a Governance Communications Core Unit in MakerDAO. The proposal explains the need for a dedicated communications team to improve MakerDAO's performance as a public organization by removing information and communication barriers for stakeholders. The post also outlines the scope, resources, services, and team structure of the proposed Core Unit. The post does not advertise the proposal, but rather explains it in detail and invites feedback and criticism from third parties.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Privacy, Security and risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.773479076479076
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#2",
                    "likes": "8",
                    "time": "13/03/2021-11:50:34",
                    "content": "Great to see such a proposal come forth. I was looking forward to it. As you have spent so much time with Maker, you’re a great candidate to join almost any Core Unit and provide value. Your general knowledge and extroversion make you great at that (anyone who hasn’t watched a Community Call hosted by David is missing out). Despite this, you might be projecting your diversified skills and extending yourself too thin with this proposal. I believe that this might be setting you up for failure, as you’re taking on three different “hats”, which are all hard to master on their own.  [email protected]1982×1154 249 KB  Hat #1: Governance I am having a hard time visualizing the line between Governance and Governance Communications. I know that this is expected (it is Governance Communications, after all), but I would feel much more comfortable if some of the tasks came from the Governance Core Unit. MIPs Update I would expect the MIP Editor(s) to perform this task. They have probably spent the whole week cleaning and making our MIPs better and more transparent and helped all the contributors; I have a hard time conceiving a better person to fulfill this task. GOV-001 already includes a budget (for you) to do this. Governance at a Glance @prose11 and @Elihu have been doing a great job at keeping us up with the forum summaries. Most likely, any folk working in Governance Alpha is the proper person to perform this task. You do mention taking things from Governance in your subproposal. Isn’t it better to contribute to that Core Unit for some time before? Hat #2: Communications I am not sure if we need the three written versions of the Governance Call. Maybe. As you mentioned, this hat could also be extended to help other Core Units, for example, by producing content for Growth. @seth’s proposal incorporates this quite well (focused on audio/video). If this is the case, I would like to see what you’re planning on covering (instead of waiting for the Core Units to reach out). Hat #3: Emergency Process Expert I love that you are contemplating this. I cannot stress enough how valuable it is to think about crises and worst-case scenarios and prepare to mitigate potential risks (I worked for Deloitte Enterprise Risk Services a lifetime ago). That was my primary motivation for modifying MIP24, after all. However, I would personally not feel entirely comfortable leaving a Governance Communications Core Unit leading this initiative. Preparing a contingency plan is no easy endeavour (the difficulty compounds in the DeFi space), and we will most likely need a specialized person/team to lead and manage this. Governance Alpha’s mandate already includes this initiative. Budget Double-Budgeting @LongForWisdom’s proposal covers some of the tasks mentioned (in the Governance hat and Emergency Process hat). Is Governance Alpha going to pay for it? Or are they going to reduce their budget once that (if) this goes live? Looking at the diagram, one might think that MKR holders are paying 6,8k Dai a week for three versions of the Governance Calls notes. Opportunity Cost 27,050 Dai per month can get you:  An excellent Governance Facilitator, A risk expert with some DeFi experience (and this would be a one-off expense, the maintenance would be cheaper), and Two great copywriters who write top-notch blog posts or articles.  It probably leaves you with some change. My Advice Pick a hat and focus on it until you become the expert. I believe that the Community will appreciate it (and you) more than the current path of this Core Unit. I am looking forward to hearing your thoughts about this and having you in the Core Unit Launching Pod Sessions to speak about it with the Community. ",
                    "links": [
                        "https://docs.google.com/document/d/1kvzVBP1cJfKLi4FneMQ2zPmGxAaSFqoSqHboYPb9qjw/edit",
                        "https://forum.makerdao.com/t/mip4c2-sp11-mip24-amendments/6100",
                        "https://forum.makerdao.com/t/mip39c2-sp3-governance-core-unit-gov-001/6348",
                        "https://forum.makerdao.com/t/mip40c2-sp3-core-unit-budget-gov-001/6349",
                        "https://forum.makerdao.com/t/mip40c3-sp8-modify-core-unit-budget-com-001/7010/7",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/35"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.133670033670033
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "3",
                    "time": "15/03/2021-17:03:41",
                    "content": "Thank you for that detailed feedback Juan. I certainly don’t want to set us up for failure, and more importantly, I don’t want to offer something that doesn’t make sense or isn’t a good value proposition for MakerDAO stakeholders. I appreciate the candid and straightforward thoughts.     juan:  I am having a hard time visualizing the line between Governance and Governance Communications.   The best way to think about it is that the GovComms Core Unit provides a major leg of support to the Governance Core Unit(and others)by working with them to execute and focus on the communications-related work, which is a huge set of work in its own right. By doing so, Governance Facilitators and MIP Editors have more time and energy to dedicate to their own mandated responsibilities, while our team can focus on assembling, packaging, and improving our best informational resources.     juan:  I would expect the MIP Editor(s) to perform this task. They have probably spent the whole week cleaning and making our MIPs better and more transparent and helped all the contributors;   Our proposal to take on the MIPs Update and Governance at a Glance is an experiment in the division of labor. We were aiming to show that these two weekly updates can be put together by a supporting team resulting in more focused bandwidth for the GovAlpha team, that leads to a more effective MakerDAO. Our idea was that MIP-Editors in GovAlpha, for example, would still participate in the Weekly MIPs Update. The difference would be that instead of being responsible for producing and improving on the entire thing every week, our team can handle that and the MIP Editor can play the roles of Sign-off/Final Editor/Point of Contact/Special Author. Your feedback certainly makes sense here. Why shouldn’t the MIP editor do the MIPs update? And in that case I may heed your advice, perhaps it’s not the wisest thing to keep on our mandate. Governance at a Glance, on the other hand, is a weekly forum recap that Governance Facilitators would benefit to handoff to our team. In personally putting together MIP Updates, I know that the majority of the information is fairly straightforward to find. The update follows a predictable template and our thinking was to take that over so MIP Editors can contribute more substantially. Though I realize now that assembling that update is a huge exercise in awareness for MIP Editors, so keeping that responsibility would probably make more sense than giving it to us. I am curious on @charlesstlouis’s view for the MIP Update.     juan:  Hat #2: Communications I am not sure if we need the three written versions of the Governance Call. Maybe. As you mentioned, this hat could also be extended to help other Core Units, for example, by producing content for Growth.   You’re right, if that was all we’re doing, that would be a waste of resources. Our goal is to extend Snippets to all public calls, and to extend high-fidelity meeting minutes on any major public Intra-DAO meetings. This extends beyond the Thursday Governance and Risk calls. We polled the community back in October, and although not everyone uses them, high-fidelity meeting minutes are indeed important for MakerDAO. Written records are important for the greater goal of keeping the governance process auditable and transparent, while also providing utility to stakeholders who don’t have time to attend calls live. Producing content for Growth; This doesn’t fit with our mandate and would split our focus if we were to include it. Producing content for growth is important, however, we see it as the responsibility of a Marketing Core Unit, while producing content for stakeholder awareness is what we are setting out to do. We do commit to working alongside the Content Production Core Unit and others to share our platforms and feature important pieces that may be more growth-related than coverage-related. However, our main focus is on the informational essentials. As per our mandate, we will work with all Core Units to make sure their work is covered.     juan:  Hat #3: Emergency Process Expert … However, I would personally not feel entirely comfortable leaving a Governance Communications Core Unit leading this initiative. Preparing a contingency plan is no easy endeavor (the difficulty compounds in the DeFi space), and we will most likely need a specialized person/team to lead and manage this. Governance Alpha’s mandate already includes this initiative.   Our proposal could have used more context for this piece. We agree, the entire responsibility shouldn’t and doesn’t lie with GovComms. After all, the Governance Facilitators and other mandated folks are key actors in any emergency situation.    MIP39c2-SP3: Governance Core Unit - GOV-001    GovAlpha is responsible for operating emergency voting processes to protect the Maker Protocol in the event of an emergency. GovAlpha must look for opportunities to streamline governance processes without sacrificing governance integrity.    Our approach is to set ourselves up as support to the GovAlpha team and other Core Units, streamlining the work behind the communications-side of emergencies, leaving those involved in governance the ability to spend more time on decision-making, discussion, and operating the voting process itself. We would be streamlining a major set of work without sacrificing any governance integrity. Given that we would be running the publications that stakeholders rely upon and are connected to all the Core Units, this puts us in a prime position to be that support. I would be in favor of housing this responsibility more explicitly inside of GovAlpha, if @longforwisdom and others think this is the ways to go. I think the advantage of our proposed model is more redundancy, accountability, and decentralization without sacrificing the essential role of the Governance Facilitators and other actors. The contingency plan itself is not handled by our team, but is formed through the group cooperation of Core Units relevant to the Emergency. We just help with the setup, coordination, and information flow.     juan:  Double-Budgeting @LongForWisdom’s proposal  covers some of the tasks mentioned (in the Governance hat and Emergency Process hat). Is Governance Alpha going to pay for it? Or are they going to reduce their budget once that (if) this goes live?   The emergency process stuff is still a shared responsibility, we just split off a set of the work. Perhaps as a result the budget would shrink, though the budgets aren’t really project/deliverable based but rather role/salary based. So it’s hard to pin point the offset. We wouldn’t be double-budgeting for any set of work. I don’t intend to take money from GovAlpha for things that are covered in the GovComms budget. But of course, there will be things we collaborate on, and I expect that will come out of both our budgets to the extent that we devote people and their time.     juan:  Looking at the diagram, one might think that MKR holders are paying 6,8k Dai a week for three versions of the Governance Calls notes.   The diagram is a loosely accurate representation of our starting point, but the vision laid out in our proposal offers significantly more than three versions of Governance Call notes.     juan:  Opportunity Cost 27,050 Dai per month can get you:  An excellent Governance Facilitator , A risk expert with some DeFi experience (and this would be a one-off expense, the maintenance would be cheaper), and Two great copywriters who write top-notch blog posts or articles.  It probably leaves you with some change.   In our proposal it gets you:  An excellent Core Unit Facilitator A full time project manager 4-5 part-time contributors who are native to the community. An important function that stakeholders benefit greatly from.  Our goal is to shape this function over the coming years to be as financially efficient as possible. Two full-time people and a number of part-time contributors is a good starting point for the mandate we are proposing. I think as we move through time, we can fine-tune this core unit but regardless I have no doubt in my mind the value of our proposed work.     juan:  My Advice Pick a hat and focus on it until you become the expert. I believe that the Community will appreciate it (and you) more than the current path of this Core Unit. I am looking forward to hearing your thoughts about this and having you in the Core Unit Launching Pod Sessions to speak about it with the Community.   Personally, my goal is to provide as much positive impact on MakerDAO as possible and if this idea really is on the wrong path it’s my duty to correct it. I am curious what others like @longforwisdom, @prose11, @elihu, and @charlesstlouis think. Although I may still be young and proving myself, I feel confident that I am the right person to step into this role. I have experience with managing startup operations, project management, and communications. The hat I am choosing to focus on for this next season of building is communications, and that hat overlaps with a lot of things at Maker including Governance and Emergencies. I will note your feedback and make some changes to the proposal soon @juan. The main one being the removal of the MIPs Update from our responsibilities. Still thinking through your words, thank you for the feedback. ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/c25f7cdec200dc7c95c308f53499344e2f12a885/MIP0/mip0.md#mip0c10-mip-editor-role",
                        "https://forum.makerdao.com/t/mip39c2-sp3-governance-core-unit-gov-001/6348",
                        "https://forum.makerdao.com/t/discussion-are-high-fidelity-summaries-of-governance-calls-useful-would-you-vote-to-fund-them/4927",
                        "https://forum.makerdao.com/t/mip39c2-sp5-content-production-core-unit-mkt-001/6823",
                        "https://forum.makerdao.com/t/mip39c2-sp3-governance-core-unit-gov-001/6348/1",
                        "https://forum.makerdao.com/t/mip39c2-sp3-governance-core-unit-gov-001/6348",
                        "https://forum.makerdao.com/t/mip40c2-sp3-core-unit-budget-gov-001/6349"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.267542353479854
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "0",
                    "time": "15/03/2021-18:32:15",
                    "content": "Is the @MakerDAO Twitter account under this Core Unit proposal? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#5",
                    "likes": "0",
                    "time": "15/03/2021-18:36:06",
                    "content": "No, it’s not. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#6",
                    "likes": "8",
                    "time": "16/03/2021-12:55:28",
                    "content": "Thank you for this proposal, @Davidutro. I strongly believe a Gov-Comms unit is going to make the DAO better. While the current iteration is a good start, I think the definition of the scope of aims and goals of this Unit puts unwanted limits in place. First of all, as @juan points out, this proposal struggles with outlining enough value to the governance communities. Interacting with @Davidutro in the Gov Domain Team, I strongly believe in his ability to make Governance more accessible to both on-chain and off-chain stakeholders, and so I’m more concerned with the presentation of the mandate and responsibilities, rather than with his Core Unit’s competence or compensation. The current list of responsibilities can be summed up in these points:  Maintain public calendar Forum/Reddit/Rocketchat moderation Emergency Response Service Governance Call Summaries Governance Call Snippets Maker Relay MIPs Update Governance at a Glance Monthly Governance Review  For a team of 2 full-time employees and 4-5 part-time contributors, this list seems largely trivial. Out of those, only the Emergency Response Service strikes me as a wide-reaching and strategic effort on its own. I’m worried the current version of the Core Unit’s mandate lacks long-term goals or vision, and is limited to maintaining existing projects, rather than looking into new ones. As a potential solution, I’d suggest adjusting the guiding principle to “Aggregate, simplify, and engage”. From my perspective as part of Gov Alpha, there’s another major struggle along with aggregating and simplifying governance information, and that’s making sure that information fuels on-chain and off-chain governance participation growth. Our DAO is only as strong as the representatives within the system, and I’d love to see more emphasis put on this in the Gov-Comms’ proposal. A communications strategy seeking to engage more people in off-chain governance would be a long-term and vision-driven aim to add vigour to the proposal. Identifying the needs and wants of a potential off-chain voter, and addressing them, would require amending existing projects or adding new ones, ensuring Gov-Comms provide constant value (by maintaining existing tools) to the DAO, but don’t fear tackling larger governance challenges, for which they’re uniquely skilled. My last point is that in all of human history, there has never been a large-scale decentralized governance system. Having understood the absolute innovation of the DAO, shouldn’t we venture outside of the Maker ecosystem and get people excited about joining it? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.145687083187084
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#7",
                    "likes": "4",
                    "time": "16/03/2021-13:15:15",
                    "content": "@Davidutro, I do not want to come over as overly difficult or pedantic, but I have a strong feeling we are starting to see a bit of an overlap in roles and tasks here. Let me first and foremost state that this is in no way a critical take on what you guys are doing, but there is starting to be possibly a bit much redundancy in some Core Units. I know we are supposed to have some redundancy as we are a DAO but still. There is GOV-001 running the weekly governance calls. Record and upload. There is GRO-001 doing business development. And you have been running a ton of Community Calls with new teams (120+ on Youtube, I have watched a bunch of them). Well if that is not biz dev I don’t know. Do you really need a Core Unit for what you are planning to do? Emergency communication is a worthy initiative, but when it really turns ugly the only ones that can do or say anything would be Smart Contracts, Oracles and subsequently GOV-001. Snippets. Providing access and simplification of information is a worthy cause but to me it sounds like this falls under an entry level at GRO-001 or something. When peoples taxes are done in India, I am fairly certain that typing down bullets should not be the task of someone on a NY salary. Same with chat, forum and reddit moderation. Sorry but I feel your talents are wasted on this. MIPs update. Since the MIPs portal is up I have been using that. It is not perfect, but in combination with the forum I can find things easily. And since we are voting every week (or more) I do not use the monthly gov updates, it is already a bit old when uploaded. You people have multiple good options. If meetings with new teams is your thing then there is practically unlimited scope in business development, just get in with those people. If you like being on the screen try stepping it up to more conferences or even TV - I think you would look good. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.48856072243169
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#8",
                    "likes": "5",
                    "time": "16/03/2021-22:28:51",
                    "content": "Elihu, this is great feedback. Thank you.     Elihu:  I’m worried the current version of the Core Unit’s mandate lacks long-term goals or vision, and is limited to maintaining existing projects, rather than looking into new ones. As a potential solution, I’d suggest adjusting the guiding principle to “Aggregate, simplify, and engage”.   I understand how this proposal comes off as limited to the existing projects. The revision will be more explicit about the longer-term vision and our willingness to look into new projects. The vision of GovComms goes beyond this starting set of work.     Elihu:  From my perspective as part of Gov Alpha, there’s another major struggle along with aggregating and simplifying governance information, and that’s making sure that information fuels on-chain and off-chain governance participation growth. Our DAO is only as strong as the representatives within the system, and I’d love to see more emphasis put on this in the Gov-Comms’ proposal.   Participation growth is attractive as an objective, but should be qualified. It’s seen as:   More unique and consistent on-chain voters.   More unique individuals participate in off-chain discussion and votes.   Increasing the quality of individuals participating in public discussions and votes.   At the moment, we see a small number of unique MKR voters turn up on each vote, around 30 on a good day. There are 76,000+ ETH addresses that hold MKR according to Etherscan. The top 1000 have at least 16 MKR. Given where Maker is heading, achieving 500 unique voters doesn’t seem like the right goal, but instead getting 1000 MKR holders to delegate their MKR to a dozen or more unique delegates seems more in line with the probable future. Setting aside on-chain participation, Off-chain participation is also enormously important and can use growth both in quality and the number of people that participate. I fully agree this would be a valuable thing to focus on. The “how” is what I’m struggling to think through right this moment. What can GovComms do proactively to improve off-chain participation? As an example, GovAlpha contributes to this goal by facilitating our forum’s SourceCred integration, creating a financial incentive to participate. I wonder what options are on the table for us—going to stew on this.     Elihu:  A communications strategy seeking to engage more people in off-chain governance would be a long-term and vision-driven aim to add vigour to the proposal.   Our team’s mandate can do more to support engagement and not just information accessibility. Our proposal covers engagement with Core Units for information flow, but it doesn’t cover engaging with potential voters or delegates. We’ll think about how to build that into our mandate.     Elihu:  Identifying the needs and wants of a potential off-chain voter, and addressing them, would require amending existing projects or adding new ones, ensuring Gov-Comms provide constant value (by maintaining existing tools) to the DAO, but don’t fear tackling larger governance challenges, for which they’re uniquely skilled.   This sounds a lot like some of the work @Haiku has done. Maybe including an annual user-research project on forum participants might make sense coming out of our Core Unit.     Elihu:  Having understood the absolute innovation of the DAO, shouldn’t we venture outside of the Maker ecosystem and get people excited about joining it?   Hell yes. MakerDAO is exciting, and I think many people will find that they can make a positive impact here in a totally new way of working. I don’t know that GovComms needs to be the team that needs to “venture outside”, since I know some Core Unit mandates have versions of that as their focus. It can’t be understated–thank you for the rich feedback Elihu. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.302012003148367
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#9",
                    "likes": "5",
                    "time": "17/03/2021-14:11:35",
                    "content": "    Planet_X:  Do you really need a Core Unit for what you are planning to do?   I think it’s a matter of how MakerDAO ends up grouping and dividing types of work. I don’t think that what we are proposing fits into Business Development. If anything, I think the best next-option would be to place some of these responsibilities under GOV-001. Still, there’s an enormous set of related-work that can use a focused and dedicated team.     Planet_X:  Sorry but I feel your talents are wasted on this.   I appreciate the honesty. I think stepping into a facilitator role to manage a communications-based Core Unit fits with my background and talents. I’m also a lot more passionate about setting up a healthy communications infrastructure at Maker than going out and trying to work with GRO on spreading adoption through all those awesome verticals. I just see the communications piece as under-served and I think my talents would be useful here. I think the proposal needs a solid revision. The feedback everyone left was super helpful.  More in the mandate about long-term goals and vision. More Engagement beyond Core Units MIP Update should stay with the MIP Editor role. A lot of the short term details and focus needs to be moved to the budget (similar to GOV-001), while this mandate needs to be more descriptive about longer-term goals and vision. Consider how we can add off-chain participation growth as part of our mandate.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.273148148148149
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#10",
                    "likes": "6",
                    "time": "26/05/2021-17:56:17",
                    "content": "An updated version of the Govcomms MIP39c2 proposal is up! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#11",
                    "likes": "2",
                    "time": "26/05/2021-22:01:38",
                    "content": "Wow. Just wanted to say I really appreciate the work that’s been put in here. The time this has spent in RFC has clearly been well used and I think it’s much easier to grasp the functions of the Core unit here.     Davidutro:  Public Call Summaries Leads a team of part-time contributors to produce summaries for all public calls.   One thing I’m curious about is what role if any these summaries will play in incubation for DAO members? I know I as well as many now highly involved members of the started off by taking notes as a way of learning the ecosystem and finding where they might fit in. Do you plan to keep this team in house or is there a goal of allowing the resource to be a jumping off point for new members?  Really appreciate the line between resources and services. to me this distinction helps to showcase the value the Core unit has regardless of the circumstances in the DAO. Thanks for all the reflection and time well spent here @Davidutro ! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.623787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#12",
                    "likes": "1",
                    "time": "26/05/2021-23:06:33",
                    "content": "Wasn’t the initial issue that there was a lot of overlap between GovAlpha and Govcomms? As a member of GovAlpha could you tell me what was changed so that this is no longer the case? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#13",
                    "likes": "0",
                    "time": "26/05/2021-23:08:18",
                    "content": "    prose11:  One thing I’m curious about is what role if any these summaries will play in incubation for DAO members?.. …Do you plan to keep this team in house or is there a goal of allowing the resource to be a jumping off point for new members?   The summary team would be managed by a permanent member of the COM-001 CU and consists of part-time contributors. This is intentional, for the exact reasons you mention–They are individuals who are interested in getting their foot in the door. I think assembling summaries is a great task because it naturally leads people to learn more about how MakerDAO operates. It also puts the contributor in an environment where they can demonstrate their professional competence or lack of. I invite any and all CUs looking to give new hires some homework; send them our way for a call or two! And likewise, our doors are open to any lurkers wanting to get more involved. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.230371900826446
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#14",
                    "likes": "0",
                    "time": "26/05/2021-23:22:12",
                    "content": "    Aaron_Bartsch:  Wasn’t the initial issue that there was a lot of overlap between GovAlpha and Govcomms? As a member of GovAlpha could you tell me what was changed so that this is no longer the case?   There will be a natural working relationship between these core units, so I encourage people to view any perceived overlap as collaboration and support towards common tasks. I believe the one piece of blatant overlap was the 4th point in the GOV-001 mandate:    MIP39c2-SP3: Governance Core Unit - GOV-001   4. Communication and Moderation Moderation and communication fulfill a supporting role in relation to the other items of the mandate. It is difficult to facilitate effective governance if high-quality communication platforms and norms do not exist. Additionally, GovAlpha should be accessible to the MakerDAO community and the MakerDAO mandated actors and attempt to bridge these two groups of stakeholders in cases of disagreement.  GovAlpha is responsible for scheduling, running, and moderating a weekly governance and risk meeting. GovAlpha is responsible for ensuring the health and integrity of the communication channels that are used for communication within MakerDAO. These tasks include moderation duties, establishing processes and social norms, and defending the channels from trolling and Sybil attacks. GovAlpha should aim to foster a culture of openness, receptiveness, and reasoned discussion within the community. GovAlpha must be accessible to Maker Governance on all commonly used communication channels within MakerDAO. GovAlpha is responsible for raising governance issues to other Core Units and ensuring appropriate follow-up for Governance.    Our mandate takes nothing away from GovAlpha, and actually offers a huge amount of support for that particular piece of their mandate. Creating redundancy and supporting eachother in a healthy way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.545454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#15",
                    "likes": "0",
                    "time": "26/05/2021-23:24:05",
                    "content": "So if I have this correct, GovAlpha is more of the moderation crew for the space and GovComms is the content/educational producers? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#16",
                    "likes": "2",
                    "time": "26/05/2021-23:29:21",
                    "content": "GovAlpha is concerned with facilitating and mediating the governance process itself while GovComms is more focused on the functional communications of the DAO and its stakeholders as a whole. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#17",
                    "likes": "2",
                    "time": "27/05/2021-09:13:20",
                    "content": "This is much clearer, Dave. Thanks for all the work. The only thing that I’m wondering is why you need such a big team. You can probably get all the agendas/summaries/calendar entries done in less than 30 hours. Let’s say Artem does that, and some misc work that should appear or might change with time. Then you have:  moderating (shared with GovAlpha) maintaining Org. Charts and registries supporting Press Relations (not sure what this entails; usually this is left to people with A LOT of experience with press) Other type of support and initiatives  I’m assuming you will be doing most of that, at least in the beginning. What will the other 2 Project Managers be doing? What will the contributors be doing? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.976190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#18",
                    "likes": "1",
                    "time": "27/05/2021-09:16:55",
                    "content": "    Davidutro:  Legal Structure This section will be updated before the freeze deadline ahead of a July Formal Submission  Operating Entity based in x. Working with a third-party company to enlist HR services to ensure good options for worker compensation and benefits. US & non-US team members.    PS, I would remove this. The DAO and MKR holders might not care how you set up things. Just make sure you’re not breaking any laws in whatever jurisdiction you are. : ) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#19",
                    "likes": "3",
                    "time": "27/05/2021-13:01:23",
                    "content": "    juan:  The only thing that I’m wondering is why you need such a big team.   First, thanks for the feedback. The way you put it makes it sound like the scope is smaller than it actually is, where in reality the scope is deceptively large. The biggest mistake we made in the past is giving people too many projects to work on simultaneously, made worse if those projects are not somehow related. The goal we had for putting together roles is to have a good balance of work, with a complementary set of projects for each person. And so, given the scope, ideally we want three areas of focus:  Content People Engagement  And so that is how I built out the roles in the ideal roles schema, three project managers and a facilitator. However, after thinking about this feedback, I think there is room to consolidate for our launch. I will adjust the proposal and start with 3 full-time roles rather than the four I had intended. Let’s see how that works and we will reassess after a couple months of operating.  Ideal  image1330×756 30 KB   New Plan at Launch  image1333×748 28.3 KB  The plan, now, is to launch with myself, Artem, and one more person who is a project manager focused on Engagement. Then after month 1 & 2 we will assess if the people-mapping person is needed or if we can contract someone to work with us on that parts of the mandate. But yea, we definitely want to avoid overhiring by finding the right balance of roles so I appreciate the feedback! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.263760049474335
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#20",
                    "likes": "6",
                    "time": "07/07/2021-01:28:46",
                    "content": "We are Formally Submitting all of COM-001’s proposals to the July governance cycle. Thank you to the numerous individuals who helped sharpen the vision for this team. Your input and feedback were vital, and I appreciate each of you. @twblack88 @seth @JerryAG @Planet_X @juan @Elihu @LongForWisdom @flipflopflapdelegate @Anna and others! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3125
                }
            ]
        }
    ],
    "group_index": "3359"
}