{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/meet-your-delegate-1-wednesday-july-28-6-00-pm-utc/9424",
            "title": "Meet Your Delegate #1 - Wednesday, July 28 6:00 PM UTC ",
            "index": 9424,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "delegation",
                "public-call",
                "pubcall-:-meet-your-delegate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "13",
                    "time": "19/07/2021-13:13:37",
                    "content": " 1280×720 62.1 KB   Meet Your Delegate #1  Welcome the [announcement for the] very first episode of Meet Your Delegate, where MKR holders and the broader community get to know their delegates. For the series premiere we will have delegate candidates @flipflopflapdelegate, @PaperImperium, and @twblack88 * presenting their platforms and holding an AMA session. @LongForWisdom will be doing the hosting  * Depending on time constraints, Tim might be presenting his platform in episode #2.  When 2021-07-28T18:00:00Z Mark it on your Google Calendar!  Where Zoom Join Link  Meeting ID: 867 8830 7759 Passcode: VOTE   One tap mobile +13017158592,86788307759#,*384072# US (Washington DC) +13126266799,86788307759#,*384072# US (Chicago)   Dial by your location +1 301 715 8592 US (Washington DC) +1 312 626 6799 US (Chicago) +1 346 248 7799 US (Houston) +1 646 558 8656 US (New York) +1 669 900 9128 US (San Jose) +1 253 215 8782 US (Tacoma) Meeting ID: 867 8830 7759 Passcode: 384072 Find your local number: Zoom International Dial-in Numbers - Zoom  ",
                    "links": [
                        "https://us02web.zoom.us/j/86788307759?pwd=TUpuQVREcW85ZmFndXl5ZENRVDVSQT09",
                        "https://us02web.zoom.us/u/kcWqYHbl5",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/44",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-151-thursday-july-22-17-00-utc/9423/4",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2021-07-22/9485",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-150-thursday-july-15-17-00-utc/9331/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-54-en-espanol/9476",
                        "https://forum.makerdao.com/t/maker-relay-ep-54/9437",
                        "https://forum.makerdao.com/t/delegation-and-makerdao/9429",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-151-thursday-july-22-17-00-utc/9423/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-56/9649",
                        "https://forum.makerdao.com/t/maker-relay-ep-55/9531",
                        "https://forum.makerdao.com/t/maker-relay-ep-55-en-espanol/9715"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3426136363636365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#3",
                    "likes": "3",
                    "time": "28/07/2021-20:49:57",
                    "content": " Meet your Delegate - Episode #01  July 28th, 2021  Agenda   00:00: Intro with LongForWisdom  1:38: Introducing Chris Cameron and Discussion  26:17: Introducing Frank Cruz and Discussion  57:25: Outro   Video https://youtu.be/SVUm1Bz0U9A  Introduction  LongForWisdom  Agenda and Preamble 00:00  Welcome to the first Meet your Delegate meeting! My name is LongForWisdom. I am one of MakerDAO’s Governance Facilitators. I am joined by a group of Maker people and our first delegates! This is a chance for delegates to introduce themselves, give a summary of their platform, things they care about and answer the community’s questions.   Chris Cameron - PaperImperium  Presentation 1:38  PaperImperiumPic1436×808 53.7 KB   Discussion 11:08  Payton Rose: Concerning your last point on “separation of powers,” I know you currently have a CU on RFC. How would you manage that as a Recognised Delegate  12:30  Someone: How will you let the people delegating MKR to know what your next vote or opinion will be like apart from your posts on the forum? What do you think about alternatives to DAI that back the Euro or other currencies?  14:35  Seth Goldfarb: There has been some discussion with the launch of the delegation about the potential for political parties to develop at some point. Do you have any opinions at this point about how you would handle that development? Would you support the development of political parties in MakerDAO, or would you prefer to stay independent?  15:57  Juan Guillén: Do you foresee the need for you to start recruiting contributors to help you overview the DAO and the different CUs and make sure that people are being held accountable for what they say they are doing or what they are actually doing? Or do you see it more as a hands-off task where everyone should self-report, and that is the end of the mandate?  17:25  Tim Black: As a delegate, your intention would be to campaign for those things but not do them directly yourself, right?  17:45  Seth Goldfarb: What are your thoughts on pay for delegates?  18:33  LongForWisdom: What do you feel the biggest challenge is? You talked about the three things we need to focus on. Are they the biggest challenges that you see? Are there any other challenges you think we will face in the future that will be bigger or more impactful?  19:55  Tim Black: You are bringing an idea about the surplus buffer and how that corresponds to our spending. Could you unpack about that more? I feel that was a seed for a really good idea.  22:00  LongForWisdom: Where do you learn (?) about DAI on other blockchains and the other protocols as a whole on other blockchains?  22:53  Tim Black: Do you think there is some low-hanging fruit on the governance processes that could be adapted or changed or another team that should maybe be presented?  24:12  Andrew Bourbon (from chat): How would you prioritize collateral risk versus keeping the peg / Dai Supply? For example, to reduce reliance on USDC.   Frank Cruz - ElProgreso  Presentation 26:17  FrankCruzPic1435×807 45.5 KB   Intro1437×807 138 KB   ActivityForum1435×807 134 KB   Commitment1435×809 139 KB   Commitment21439×808 132 KB   KeyTakeaways1437×806 158 KB   Discussion 36:25  Rafael Ventura: What do you think about having Maker on other Layers, on other sidechains?  39:04  Seth Goldfarb: What do you think about the development of political parties in MakerDAO, and what are your thoughts on pay for delegates?  42:10  Juan Guillén (from chat): Have you ever voted against a proposal? Is there anything that you have not supported from the Maker community? Do you have an example?  43:37  Payton Rose: Do you have a plan for how you intend to communicate your votes and to tell the holders where you will be putting their MKR?  44:47  Mika Honkasalo: Do you have an example of a vote, a situation, or a community discussion where you had a strong opinion that was even slightly different from the majority? Maybe PaperImperium can answer this as well.  48:24  Wouter Kampmann: Will you be reaching out proactively to large MKR holders to align your position with their vision?  51:04  Someone: Would you be open to getting contacted for input on new UIs for the Governance portal? We are working on the delegates. Would you be interested in participating in conversations?  52:03  LongForWisdom: When do you think MKR should be minted and why?  56:18  LongForWisdom: Does any of the delegates want to share their handles, channels, Twitter, etc.?   Closing Comments  LongForWisdom  Outro 57:25  Thank you both for coming, and thanks to the audience for their questions! Hopefully, we will have another one of these either next week or the week after with the next set of delegates. Looking forward to that and hoping to see it go live on Monday!   Credits   @gala produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/SVUm1Bz0U9A?t=98",
                        "https://youtu.be/SVUm1Bz0U9A?t=1577",
                        "https://youtu.be/SVUm1Bz0U9A?t=3445",
                        "https://youtu.be/SVUm1Bz0U9A",
                        "https://youtu.be/SVUm1Bz0U9A",
                        "https://youtu.be/SVUm1Bz0U9A?t=98",
                        "https://youtu.be/SVUm1Bz0U9A?t=6680",
                        "https://youtu.be/SVUm1Bz0U9A?t=750",
                        "https://youtu.be/SVUm1Bz0U9A?t=875",
                        "https://youtu.be/SVUm1Bz0U9A?t=957",
                        "https://youtu.be/SVUm1Bz0U9A?t=1045",
                        "https://youtu.be/SVUm1Bz0U9A?t=1065",
                        "https://youtu.be/SVUm1Bz0U9A?t=1113",
                        "https://youtu.be/SVUm1Bz0U9A?t=1195",
                        "https://youtu.be/SVUm1Bz0U9A?t=1320",
                        "https://youtu.be/SVUm1Bz0U9A?t=1373",
                        "https://youtu.be/SVUm1Bz0U9A?t=1452",
                        "https://youtu.be/SVUm1Bz0U9A?t=1577",
                        "https://youtu.be/SVUm1Bz0U9A?t=2185",
                        "https://youtu.be/SVUm1Bz0U9A?t=2344",
                        "https://youtu.be/SVUm1Bz0U9A?t=2530",
                        "https://youtu.be/SVUm1Bz0U9A?t=2617",
                        "https://youtu.be/SVUm1Bz0U9A?t=2687",
                        "https://youtu.be/SVUm1Bz0U9A?t=2904",
                        "https://youtu.be/SVUm1Bz0U9A?t=3064",
                        "https://youtu.be/SVUm1Bz0U9A?t=3123",
                        "https://youtu.be/SVUm1Bz0U9A?t=3378",
                        "https://youtu.be/SVUm1Bz0U9A?t=3445",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2021-08-05/9713"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.651103425559947
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#4",
                    "likes": "2",
                    "time": "29/07/2021-19:17:12",
                    "content": "This call is now available on the Youtube Channel for review:      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#5",
                    "likes": "2",
                    "time": "04/08/2021-19:46:55",
                    "content": " Meet Your Delegate: Episode #01   Agenda   00:00: Introduction  01:22: Chris Cameron  26:17: Frank Cruz  57:25: Conclusion   Video https://www.youtube.com/watch?v=SVUm1Bz0U9A  General Introduction  LongForWisdom 00:08  Hello everyone, and welcome to the first MakerDAO Meet Your Delegate meeting. My name is LongForWisdom; I am one of the governance facilitators at MakerDAO. I am joined here by a group of Maker people and our first Delegates, which is very exciting. Today, we are going to have a couple of Delegates depending on available time. We are going to start with Chris Cameron. These meetings are to provide a chance for the Delegates to introduce themselves, provide a brief summary of their platform and then answer any questions from folks that have joined us. We will record these meetings and put them up on YouTube for future generations.   Delegate Introductions  Chris Cameron 01:22  My name is Chris Cameron, Field Technologies, Inc. I am known on the Forum as @PaperImperium, and I am here to present myself as a Delegate. Just to begin, I want to talk about the three main areas of challenge that I see for Maker that need to be addressed. First off, we need to integrate better with the real world. This falls under several different areas. The one that is at the foremost of everyone’s mind today is probably regulation. This can be divided into three main areas with the EU, which is looking fairly hostile at the moment, but perhaps we can change their minds. The US, which I have already started trying to get some low-level engagement going with the US and other North American entities. Then, of course, the Asia Pacific is the other major developed market that looks like they could potentially begin to exert more regulatory control. Other parts of the world do not seem so aggressive at the moment with regulations, so we will deal with them as they come. This is something that we need to develop; strong messaging. We need to develop a plan to interact with the bodies regulating financial markets in these countries. That includes, and is not limited to the Fed, Bank of Canada, the ECB; we have already started to reach at some low levels with at least with researchers for some information sharing with the Bank of Canada and the Bank of International Settlements who most people are probably more familiar with the Basel regulatory guidelines that they provide to banking systems around the world. The next thing that we need to do to integrate into the real world needs better access to financial markets, this is something that is being actively worked on by lots of people at the DAO right now, and I am confident that we will be able to have lots of tools in our toolbox to access things like fixed income, financing to banks, or even the ability for us to be able to borrow or engage in hedging activities. We can get more into that offline or later if anybody has any questions, and then, of course, socially, we are not integrated anywhere. There is not a constituency anywhere in the world that will mourn or demise other than Crypto Twitter should happen to us, and I suspect not even all of them would shed a tear for us. That’s something we need to work on. Maker has done a great job pivoting to more sustainable business practices, but we do need to refocus at some point on how Maker can achieve its original social mission, and that is going to take some thought and execution to land that one correctly because that is probably the one where the furthest behind on and it is being ignored right now. I do not talk much about it, but we do need to come back to it at some point and build a constituency of people who want to use us and want to see us succeed. The next issue is we need to work on scale and competition. We, thankfully, at the moment, seem to be flying under the radar of regulators. Those who have been following research, recent publishing out of research institutions both academic and government, and the policy discussions that have been going on, luckily Maker and DAI do not seem to be included in those discussions, which is good at the moment. We do not seem to fit what lawmakers and academics consider a stablecoin because we are not redeemable for FIAT. We have a very different business model. It means that when you look at papers published recently, they include stablecoins of a much smaller market cap and much smaller reach than us. The good news is that means we are not in the regulatory crosshairs just yet. The bad news is that we need to make sure that they are aware of us and that we do not get swept up with different business models that might be more financially fragile. The next thing is, of course, scaling DAI. We need organic demand. Differentiation is other than price; we have got to work on this. I know Growth has been going full throttle, and they have been doing great work to get DAI in front of more people, but in the end, our product is not the vaults; our product is DAI. We need to figure out more ways to generate it than just the PSM and vaults, right? Because for vaults, it is a lending product, a financing product, and at the end of the day, that is a commodity, and so we can only compete on price at the end of the day. So, we do not have control over that, and we will never have control over that. I know people like to think that we can lower the rates on the vaults to increase supply, but that is also going to increase demand. When it comes to capital inflows and outflows to DAI, we need to develop alternative ways to generate it. Speaking of capital flows, we need to have prudent management of these right now. Everyone is aware that the elephant in the room has more than 3.1 billion dollars in USDC sitting in the PSM. I do not think any of us want that there. We would be foolish to and probably unable to unwind that, but we can control the composition of these. We are running a currency here, correct? Furthermore, it has a fixed exchange rate. If we are going to defend the peg successfully, we have limited control over how much will pile up inside the PSM or be drained from it as capital flows in and out of DAI compared to other US dollar-denominated or dollar equivalent assets. Right now, DAI is in demand; it’s a great problem to have, right? I think any country that has a fixed exchange rate would love to have the problem of too much in the way of foreign reserves piled up and try to find a way to reduce the credit risk associated with the undiversified way in which we hold it. We are working on that, especially if we can gain access to the fixed income markets either directly or indirectly. We can try to get direct exposure to FIAT or FIAT equivalents rather than having the intermediary of USDC. Our second problem is scaling and competitive differentiation and manage prudent management of risk the reserves that we hold. The third is that as Maker grows, we are beginning to attract more talent. We are still short of manpower and personal power, but we need to start focusing on more internal responsibility and best practices. Key amongst these is just the principle of separation of duties and powers. We need to ensure that risk assessments are separated from internal advocates, just as a bank does not have a loan officer. The underwriter is not the same person. We need to do that as well. We need to separate the stability buffer from our operating cash so that it is clear. How much of which one is earmarked for expenses, and how much is the buffer. As it is now, if we are in this situation where if we are losing money, then we are increasing risk by draining the stability buffer from our operating cash, so that is clear. How much of which one is remarked for expenses, and how much is the buffer. As it is now, if we are in this situation where if we are losing money, then we are increasing risk by draining the stability buffer, so we need to correct that, that’s more of an accounting issue, but we must get that one right. We also need to have monitoring separate from cash and control decisions, so we probably need to spin out financial reporting into its Core Unit or team to separate it from any operations. We do not want anyone who has operational discretion or decision-making capacity to be in charge of actual cash flows or accounting that cash when possible. That is just a standard best practice. So that is the third area we need to work on; internal reforms. We need to integrate better with the real world markets; we need to scale and differentiate ourselves from competitors. We also need to make sure that as we internally grow, we do so responsibly and make the organization less fragile, and I will take questions now.   Questions  Payton Rose: I am happy to be the first victim. Thanks for putting together this presentation. As to your last point about the separation of powers, I know you have a core unit currently in RFC, so I wondered how you would manage that as a recognized Delegate.  That is a wonderful question, so I am on record as saying that people should not be their bosses, so in the case of the Maker Portfolio Core Unit, if it gets up and running and Delegation becomes an active thing that takes off, then I would probably - I already have some eyes on people that I would try to hand that unit off to be the facilitator for it. It is a small unit, it is just to sign some paperwork and do some low-level monitoring, but yes, It would not be appropriate for me to fill both roles in the long run. I can not say it would happen immediately because it is a new Core Unit that needs to get up and running, but I would not foresee holding both positions in the long run.   Someone: I have a question, hello Chris and, well it is a couple of questions. One will be how are you going to let know the people that are delegating Maker on you, what is going to be your next vote or opinion apart from reading you in the firms and, the other question I have is what do you think about alternatives to DAI backing the euro or other currencies?  Great question; I guess the first one is the easiest. I am generally going to make myself as available as possible. Maker is taking more and more of my time, so it is my main priority at the moment. Anyone that Delegates or just wants to hear my thoughts, I will have a weekly summary available for everybody, and of course, my email, my Signal, and my Telegram will be open for anybody that wants to have more private conversations, so whatever people are willing to communicate with me, I will be happy to listen to and respond. Second question was alternative DAIs like Euro-DAI? I think this is something we will need to move into, and, at the moment, I think it is just a matter of bandwidth. I am not sure that it needs to be our top priority, but we need to be moving on, especially with major currencies like perhaps, yen sterling, euros. These major international currencies are things that we can get a first or second mover advantage on the US stable coin market. It is much more crowded. I would say it needs to be on the to-do list, I agree. I do not know that it needs to be our absolute top priority, but I am always open to changing my mind as more information is given to me. Does anyone else have anything curious about it?   Seth Goldfarb: I have got a question, something I would like to hear about from each of the candidates; there have been some discussions with the launch of the Delegation about the potential for political parties to develop at some point. I understand it is pretty early to do much speculation around that, but do you have any opinions about how you would handle that development? Would you support the development of political parties in MakerDAO, or would you perhaps like, as a matter of principle, to prefer to stay independent? Any thoughts?  I do not think political parties bring a positive - I do not generally feel that they are a positive development for political systems. in this particular case, we are dealing with a lot of technical decisions, and I do not think that ideological commitments have a lot of place in running Maker. That said, there are certainly some issues that I could see sympathizing or voting with parties. If people chose to form a party, I would certainly work with them, but I have no intention of starting or joining one.   Juan Guillen: Adding a little bit on that, Chris, do you foresee the need for you to start maybe recruiting contributors to help you overview the DAO and the different core units and make sure that people are being held accountable for what they say they are doing or do you see it more as this is a hands-off task and everyone should self-report, and that’s the end of the mandate?  That is a great question; I think that comes back to - I feel strongly that we need more separation of reporting and decision-making monitoring and decision. Just as I should not be my boss, people should not be their policemen. That works for now. You know we do not have a deep bench to pull from, but I would love to see functions related to accounting, internal controls, just monitoring in general of internal metrics. See, that spun out into its core unit. I do not have opinions about what exactly that would look like or how big it would need to be, but I think that should be on the road map and at least in the next 12 months. I think that is a certainty that we need. Independent internal watchdogs GovAlpha right now have to be neutral about things - we need someone who can make recommendations and raise alarm bells.   Tim Black: And as a Delegate, you would intend to campaign for those things but not do them directly yourself, correct?  That is correct; I do not see myself directly involved in any core unit if telling - if Delegation - I get any significant amounts of Maker Delegated to me. I am active on the Delegate scene; I am not going to be inside a Core Unit.   Seth Goldfarb: Got a follow-up question, also something I would like to hear all the candidates share their opinions on, but what are your thoughts on pay rates for Delegates?  I think it probably needs to happen; it should be less than Core Unit facilitators, I think. But it is not a small amount of time to stay on top of things, so I would say it needs to be enough to pay for people to pay attention but and so that people otherwise this is going to be a rich man’s game, right? We do not want that, but I do not think it should be on the same scale as more Core Unit facilitator salaries are.   LongForWisdom: What do you feel is sort of the biggest challenge? I guess you kind of talked about the three things we need to focus on but are they the sort of biggest challenges that you see ever for Maker? Are there any other challenges? Do you think that we will face something in the future that is sort of bigger or almost more impactful?  At some point, if Maker is successful, we will get to the point where we will be so systemically involved in the world economy that there will be people that do not like that. I am not exactly sure yet what we should do about that. Still, part of my plan is to begin holding government debt securities so that Maker cannot be targeted too aggressively without creating a credit event for large regulators. Beyond that, I do not have a thoughtful response, but I think that if all goes well, then in five years, that is going to be the discussion we are having is how do we deal with central banks that may have to begin viewing us as at least a junior peer.   Tim Black: I think you are already sort of bringing up an idea about the surplus buffer and how that corresponds to our spending, right? So I would love for you to maybe unpack that a little bit more because I feel like that was the seat of a really good idea, and maybe it would be nice to have that out in the world.  I cannot take credit for being the first to voice it - I think Will from Real World Finance voiced it as a desire to see this out in the forums, and it is something that I have been thinking about - I was glad. I have now seen multiple people mention it. The whole point of the surplus buffer is to be a buffer, right? We have to make sure that DAI is secure and then backed up by Maker holders, right? And it is hard to plan for these things. Number one, it is hard to plan a budget if we are co-mingling all of our funds. Secondly, especially as we come under more intense scrutiny from the outside looking to regulate us. The more we are already complying with best practices of segregating money that is supposed to be a buffer from our spending cash, the more we are already behaving well, the less likely they are to come after us, in my opinion. Perhaps that will not be true, but it is also just a best practice, right? If we decide that we need a certain amount of DAI as a buffer, we need that. It needs to be off the one side, and then the money we operate out of needs to come out of the other, right? Because it is a bigger decision to deficit spend out of your piggy bank than it is out of your insurance rainy day fund, right? How would that be implemented? I have not thought through any details about it completely, and I am happy to hear other people’s opinions about the timetable and exact mechanisms for doing that.   LongForWisdom: Where do you land about DAI on other blockchains and like the other protocol as a whole on other blockchains. Do you think that is something we should be prioritizing or backbone?  In principle, I think DAI should be everywhere, including at some point in the far distant future a way to figure out a way to get into the physical world as well as far as in each blockchain and each spot. I will defer to people who know more about each place than I do, so I defer to Risk. Protocol Engineering and Oracles are for any particular ecosystem to actively push DAO into or generate DAI.   Tim Black: I am just pulling from this great list of questions that I believe GovAlpha assembled, the last one I could think of that you spoke to in the first place elegantly on the Forum was on governance process, mostly through a debate on recent fees change - I think you had this since the beginnings of some great ideas there as well. Do you feel like there is some low-hanging fruit on governance processes that could be maybe adapted or changed or another team that should be maybe presented?  I want to give a more thoughtful response than I can give right here. Yes, there are changes that I would like to see. This is getting deep into the weeds, so anyone interested should probably reach out to me individually.   Tim Black: I was more looking for - did you think there were any easy wins for the governance process that we might be missing or something like that? So that makes sense that you want to be thoughtful - so thanks, all good. LongForWisdom: How would you prioritize risk versus keeping the peg DAI supply like an example to reduce reliance on USDC?  Our number one goal is to ensure that the fixed exchange rate of one DAI for one dollar is maintained - without that, we do not have a product. Our product is DAI; anybody can provide financing, but DAI has to maintain its face value and not significant for any period of time trade above or below. The longer we do that, the cheaper it is to defend the peg, and you will see today that we have had significant inflows into the PSM now. The thing to remember is that our collaterals and value that is to organic demand, and there is a limit to how far we can push that people have to want that service - which is why it is important to come up with alternative methods of getting DAI into existence preferably ones that generate fees. It depends on what kind of collateral we are talking about because there are many different things, but the peg is always number one. We do not have a business without the peg. LongForWisdom: Perfect, thank you to you, Chris, for coming on doing this and putting yourself forward.   Thank you, everybody, for having me, and feel free to reach out offline if you want to talk more details.   Frank Cruz 26:17  Intro1437×807 138 KB   I represent “FlipFlopFlap Delegate LLC.” I am inspired by flip, flop, and flap, my favorite surplus auctions. It is probably everybody’s favorite, but we will not go there. I was born in El Progreso, Honduras, which is why I am known by @ElProgreso on the Forum and ElPro on the RocketChat. My name is Frank Cruz. I have 14 years of experience working in TradeFi. As an advisor, I was down in Wall Street, not happy, pushing stocks, bonds, a few commodities, mutual funds, the boring stuff. After 14 years, I called the quits, and I took a two-year sabbatical. In 2011, a friend of mine’s told me about bitcoin, but I shrugged it off because I did not get it; plus, he told me I had to open an account in Japan, and that was not going to happen. After my sabbatical, I started working with a friend. We opened a document management software company based in Houston, Texas. He wanted me and another friend to open an office in New York City, so we did that. We made some sales; it was fun. The cloud came into the picture, which helped a lot. Around the 2017 bull run, my brother, whom I had told a long time ago about bitcoin, called me and told me: “hey! have you seen this thing about bitcoin and Ethereum?”. I looked at the chart a little bit; it was pointing at the sky, I knew it was too high. I waited, and in late 2018, I heard a podcast with Rune Christensen on unchain. It took two episodes for the host to record it with Rune because it was so complicated to understand, and I just became so excited. I googled MakerDAO, and I joined the party in January 2019. I like to keep the Community buzzing if I can. Sometimes I, unfortunately, have to chit post, but I like to keep things alive. During the Crypto winter, one of my favorite things to do was to keep myself inspired. I decided to get away from the 9 to 5 and get into cryptocurrencies full-time. I like to listen to many inspirational talks by the great founders of the past and present. I like to take quotes and break them down. Mike Maples Jr from Floodgate is one of my favorites. He just has some magical words sometimes.   ActivityForum1435×807 134 KB   Concerning my activity in the Forum, I have tried different things. In DeFi summer of 2020, I was already thinking about running Dai on different chains because it was getting painful when they released Yearn Finance and gas prices were going through the roof, and Compound had started the party. I was thinking of different chains. I had followed other chains like Mirror, Solana, Polka Dot, Cosmos. I went to Cosmos’ release party in 2019. I had no idea what it was, but I was there. I did not buy the token, so I missed out. I have always followed all these chains because I always liked to see the next big thing. I already had a feeling that USDT was a little bit odd, and I was not the only one, so I had some Signal Requests that failed, like “Delist USDT.” I also thought about using USDC to stabilize the peg, so I put a MIP6 application still in the works a year later. I believe it is finally coming to fruition, but I asked if we could do USDC as collateral. Those are the ways my brain is always thinking. I do this 24/7.   Commitment1435×809 139 KB   I am running as a FlipFlopFlap Delegate. It is an LLC based in Delaware. To be in MakerDAO governance, you have to be fully focused. You have to keep up with everything that is posted, all the discussions, attend the meetings, and this is my commitment for the off-chain. On-chain, I promise you that I will vote no matter what whether it is on holiday, weekends, or flying through the world. I will be there to cast a vote on behalf of you. We will hold the Maker family together.   Commitment21439×808 132 KB   Off-chain is not just about going to the G&R meeting. It is also about attending small meetings that some folks might not be attending right now. Some of the Content Core Unit meetings are awesome. The SES on Friday is one of my favorites. PE has their meetings on Tuesdays, which I like to attend. It can get very technical, but you learn a lot. This is what it takes to be a Delegate, in my opinion. Also, talking to the Risk people and catching up on their thinking, and being close to them. Not only just being on the Forum, Rocket Chat, Reddit. It is about listening to podcasts of other protocols to keep up with what is going on in DeFi. That is my commitment to you. Because this is what I do, whether you decide to Delegate to me or you do not, I will continue doing it, voting and pushing to be the best Delegate that I can be.   KeyTakeaways1437×806 158 KB   These are my last takeaways to consider because I do not have the right answers about whether the Delegation will work or not. I like to look at it this way: Maker governance right now is slow. Recently the CUs were trying to get paid, and they had to wait forever to get an executive vote to pass. It broke my heart not because I knew they were going homeless. It was just taking too long, and it was a little bit embarrassing. When you Delegate to someone like myself, like PaperImperium, or other future Delegates like Tim Black, I think we are going to make things go faster. I do believe that Maker governance should be faster. I also believe that we will fall behind if we take forever to get through one executive to the next or one greenlight poll to the next. We will fall behind, and you will see other stablecoins like UST, FEI, etc. They have really smart people working there. They are looking to make an impact, hungry, and working on that right now. I would like to have the Community thinking about living in the future. I am always looking for the next big thing, for the next possible integration. Even though I do not know how to code, I always think about ideas or ways to improve things. As Mike Maples likes to say: “A great decision made too late is the same thing as a bad decision.” I want to be at the forefront of whatever happens to DeFi and RWA, for which I am a huge proponent. It is not a secret that I will be pushing for RWAs. I do not answer what type of trust or SPV structure should be the right one. I believe we should try all of them. As Mike Maples likes to say, “you have to think in bets.” If you make a bet, you have to think of what your future outcome is. Is it a large upside or a small upside, or is it going to be a huge upside? Always remember, “greatness is a decision.”   Questions  Rafael Ventura: What do you think about having Maker on other Layers, on other sidechains?  While back, I went on my own, and I reached out to Anatoly of Solana. They were taken from Ethereum into a blockchain on L1 that is not even compatible. We had a couple of ideas Solana was willing to fund. Something that could get Dai into Solana, right? I checked out a lot of the nearby forums to see what they were doing. They were building the rainbow bridge, which was great. As far as L2s like Optimism, Arbitrum, and Starkware, I am excited about that. I am already testing them out. I believe that it is going to be huge. Suppose we can get something like Rainbow Wallet to allow users, to directly go from their bank accounts to Optimism and have some Dai. Someone like UniSwap might be able to use their Dai and slip it between USD and Dai and take minimal risk. That would be great for the early beginners. I have a vision where I want everyday people to have access to interest in their accounts. I believe that the banks with inflation will continue to lose their ability to make money on their money. DeFi is needed for the average Joe and Jane. I hope that wallets like Linen prosper even though they are not controlling their asset.   Seth Goldfarb: What do you think about the development of political parties in MakerDAO, and what are your thoughts on pay for Delegates?  That is something I was going to put into my slides because I am worried that we will get political parties or maybe Delegates bonding together and taking the DAO in a certain direction. I think it will be hard for outsiders to come in a say, “Hey, I want to do a Content CU as well.” I am guilty too. I trust you, Seth, more than I would trust the next Joe that comes in. Only because I know you are passionate about this, you are a Maker Community member. I am worried about Delegates possibly colluding and possibly not allowing a new company or a new team to come in and establish a CU. I have corrected myself and understood that we could not let this happen. For us to grow, I hope that someone like SES can incubate many brand new people that I have never met, that we can trust, that SES can put them through the wringer. Once they have shown that they are committed to the MakerDAO Community ways, they will bring in a great service or product, and the Community will trust them. There will not be a need for us to establish political parties. That is something I worry about and that I plan on speaking out if I see that. You have my word on that. As for compensation, in my opinion, politicians should not get paid much. They should get paid whatever their needs are. Should we get compensated? Maybe we should get some kind of stipend for the time we spend here. I plan to do some Youtube videos to explain why I voted in a certain way or campaign way because I have a Flipflopflap Delegate Youtube channel. If we get paid 50 Dai a week, so be it. It is not going to make a difference to me. Seth Goldfarb: Thank you! We will certainly be happy to help you and any candidates interested in getting help to put out specific kinds of content.   Juan Guillén: It is observable that you are a very positive guy. Have you ever voted against a proposal? Is there anything that you have not supported from the Maker community? Do you have an example?  I have voted against a few of them. If I had to think back, I voted against a token that I felt was either centralized or felt some risks to the DAO. I never voted against an executive. That is the truth. Any executive who got to that point through our rigorous governance process did not deserve to get voted down. I could be wrong about that. I voted against some Greenlight Polls. Unfortunately, a third-party marketing company recently came up with it, which was a no for me. If I have to say no, I will say no. I am not always going to be a “yes, yes, yes.”   Payton Rose: Do you have a plan for how you intend to communicate your votes? You mentioned your Youtube channel. Is that something we can expect to see weekly, or how do you plan to tell the holders where you will be putting their MKR?  I am going to do it weekly, and I will also post on the Forum. I am a visual person, so I am excited about doing it on Youtube. I am also thinking of bringing someone like Tim or Paper on. We could debate on the Youtube channel or hopefully align with what the Maker community wants. That is why I need help from people like Jerry Goldfarb because I might need some beats to introduce the FlipFlopFlap Delegate show.   Mika Honkasalo: Do you have an example of a vote, a situation, or a community discussion where you had a strong opinion that was even slightly different from the majority? Something that might show your philosophy in the future of MakerDAO. Maybe PaperImperium can answer this as well.  Maybe Chris can talk after me. When Marcomms unit, a marketing unit, first came in and proposed, they had a five million Moonshot fund. I got excited about it, and thinking back; I was probably wrong after speaking to a couple of community members who probably voted no as well because the first proposal failed. I got excited about it because I felt that people would get excited if we could get the Dai emblem out there in front of millions of people. I am a New Yorker, I ride the NYC subway, and I cannot tell you how many times I see this new Fintech bank’s advertising. Every ride that I take, they are on there, making moves, building, raising money, having got a product, their advertisement is funny, and it catches the eye. I got excited there. The surplus buffer was looking great. I felt that Moonshot could work. Maybe it should not have been five million; maybe it could have been a million Dai if we could have got Dai into a four million one car. For me, it would have been more like American sports, but a four million one car would have been a great way to get the Dai name out there recognized. Thinking back, I was wrong about that. There are times when I vote for something, campaign for something; I will be wrong. PaperImperium: My great fear is that I will be viewed as an obstructionist. If you would like a more detailed answer… I know I voice unpopular opinions. That has been privately expressed to me a bit. I will not take your time to go into the details. Looking back, it was probably not the right proposal structure. If I could do that repeatedly, I would probably have reached out to the Marcomms team because I initially reached out to them to see how I could help get their campaign going and hopefully get some MKR voters. That is what I plan to do in the future. If we have some campaigns that you can tell are 50 - 50, I will reach out to my Maker community and ask about their feelings.   Wouter Kampmann: Will you be reaching out proactively to large MKR holders to align your position with their vision?  Currently, I might reach out to them on Twitter to get them to vote if you are saying in the near future! If they allow me to and welcome me to hear them out, I would love to. I want to be able to talk from the smallest MKR holder to the largest. Every voice to me is important. I will be reaching out to your team. I think you have got some brilliant people there, including yourself and Juan. As far as the large Maker holders, huge brilliant people there that I admire too. If they can give me what they believe is the best path for a decentralized stablecoin that will take us to the next future, then absolutely. I would love to talk to them; I would love them to reach out to me and say this is how we think. I will not have all the right answers, but I will tell them how I think about it. Some of the large token holders and CUs are going to be pretty busy, so I do not expect them to be available every single week or day. I am going to be taking notes. I will continue following what they do. I follow not only their Twitter account but also if they are on a podcast, I am there, I am listening to them, I am trying to gauge what they are thinking, what they believe will be the next big step in this cryptocurrency world, in this decentralized finance world. So if I cannot reach them, I know in what direction they want to take the entire ecosystem.   Someone: Would you be open to getting contacted for input on new UIs for the Governance portal? We are working on the Delegates. Would you be interested in participating in conversations?  Absolutely, you can reach to me privately. I was using it today. LongForWisdom was asking to set up the contract and everything. It looks great. You have done a terrific job. Anything you need help with, let me know. I am here to help out.   LongForWisdom: When do you think MKR should be minted and why?  When Maker token holders and Delegates misbehave and do not govern the protocol correctly, we make an error like we onboard a real state company looking to do a skyscraper in Idaho. The skyscraper does not get any tenants. It is not worth anything, and it goes bankrupt, we set up the wrong structure, and we have to eat the 32 million Dai alone. If we have to mint MKR, then yes, there is a reason for that. I have also heard things like we are exposed to the USDC. Because they are good folks, I think they have the same vision as us. I think they want to be successful; they want Dai to be successful. I have seen Jeremy Allaire talked so positively about Dai. He is so amazed by what the Maker community has done to take it this far. I believe that everyone has good intentions. When you go to one of the Ethereum conferences, you meet everyone, and everybody is pretty amazing. Sometimes we buck heads on Twitter or the Maker forum, but we all have the same mission at the end of the day. I heard things like: What if Circle is going to freeze our PSM-USDC? What do we do? If we are in a situation like that and have to mint some Dai, so be it. That is part of the business; that is the risk that we took. As Mike Maples likes to say, “Risk is real, but fear is a choice.” The Community has taken such an amazing risk by stabilizing the peg, which is, as Chris said, the most important thing. It has been beautiful. I do not even look at it anymore; I barely pay attention to it. Back in the days, it was stressful watching the peg go to 101, 101.5, 102, and now it is just a thing of beauty. If we do not govern correctly, MKR should be minted. A million MKR, or 900,000 MKR or 1.2 million MKR, will not change the token price. Most of the world does not even know there is only like 900 and change, 500,000 and change. They are not going to start buying it tomorrow morning just because there is a 10,000 MKR loss. This is my opinion from being around markets. I think when there is a lot of excitement about MakerDAO, and a lot of profits are coming in, and Dai starts to become a household name, that is when you are going to see people realizing they want to own Maker in their portfolio, and that is when they will go buy it. I am not worried about if we have to mint a couple of thousand Dai. At the same time, I do not want to, so do not get me wrong. It would be bad press for us; it will not be good. I went through Black Thursday as you guys did, and it was not fun. I do not have a problem with it, and again, I think that the time to mint is when we do the wrong thing.   LongForWisdom: Does any of the Delegates want to share their handles, channels, Twitter, etc.?  I go by ElPro on Rocket Chat. You can find me on Twitter at Cruzer DeFi. You can find me on the Forum @flipflopflapdelegate, and you can email me at [email protected].     Conclusion  LongForWisdom 57:25  Thank you both for coming, and thanks to the audience for their questions! Hopefully, we will have another one of these either next week or the week after with the next set of Delegates. Looking forward to that and hoping to see it go live on Monday!   Common Abbreviated Terms DAO: Decentralized Autonomous Organinization RWA: Real World Asset DeFi: Decentralized Finance  Credits  Andrea Suarez produced this summary. Artem Gordon produced this summary. David Utrobin produced this summary. Gala Guillén produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/SVUm1Bz0U9A?t=82",
                        "https://youtu.be/SVUm1Bz0U9A?t=1577",
                        "https://youtu.be/SVUm1Bz0U9A?t=3445",
                        "https://www.youtube.com/watch?v=SVUm1Bz0U9A",
                        "https://youtu.be/SVUm1Bz0U9A?t=8",
                        "https://www.youtube.com/watch?v=SVUm1Bz0U9A",
                        "https://youtu.be/SVUm1Bz0U9A?t=82",
                        "https://forum.makerdao.com/t/paperimperium-delegate-platform/8992",
                        "https://forum.makerdao.com/u/PaperImperium",
                        "https://youtu.be/SVUm1Bz0U9A?t=1577",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc/9106/5",
                        "https://forum.makerdao.com/u/ElProgreso",
                        "https://youtu.be/SVUm1Bz0U9A?t=3445"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.848632255266701
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "18/08/2021-19:46:56",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}