{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/notice-about-hand-over-of-management-of-the-makerdao-github-organization-to-the-techops-core-unit/19868",
            "title": "Notice about hand over of management of the MakerDAO Github organization to the TechOps Core Unit ",
            "index": 19868,
            "category": [
                "Core Units",
                "Dai Foundation"
            ],
            "tags": [
                "developers",
                "daif-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#1",
                    "likes": "2",
                    "time": "20/02/2023-10:55:51",
                    "content": "As stated in the DAIF CU Update - Q1 2022 the mandate of Dai Foundation is not to provide software development operational services, but rather to ensure IP ownership. Since then we have performed cleanup and classification activities for the current content in the Github organization as well as introduced tools and processes to facilitate handing copyright over to Dai Foundation for new protocol software and related software/content. We are now at a place where Dai Foundation have handed over the management of the MakerDAO Github organization to the TechOps Core Unit hoping to reduce bureaucracy and to move Dai Foundation a step further away from day to day operational tasks. While Dai Foundation retains the right to “claw back” control of the MakerDAO Github organization, it is now the Techops Core Unit that is responsible for the operation of the Makerdao Github organization. It is at the discretion of the TechOps Core Unit to manage the MakerDAO Github organization as it sees fit without interference from Dai Foundation. As part of this the TechOps Core Unit agrees to the following:  There is unhindered read access for all to the software that is used to operate the Maker Protocol in the MakerDAO Github organization All public repositories hold a LICENSE All repository content managers are advised about the COPYRIGHT information from Dai Foundation Contributor License Agreement (CLA) Assistant is integrated with repositories, where content manager of the repository agrees to this Dai Foundation Assets Registry document contains information about all new repositories that should be classified with one of the following two classes:  1 - Software 2 - Content   Dai Foundation is notified when new Class 2 - Content repositories are created in a way that is convenient and agreed between Dai Foundation and Techops The About section for new repositories contains the following   For Class 1: SW Repo; Content Manager: <Core Unit Name or Individual>   For Class 2: Content Repo; Content Manager: <Core Unit Name or Individual> If it doesn’t, TechOps Core Unit shall facilitate the owners to provide that information. *) for definition of Class 1 and Class 2 see Classification and cleanup of the makerdao github     The TechOps Core Unit will cover the operational cost for the MakerDAO Github organization through its budget or by charging the users also at the discretion of the TechOps Core Unit. NOTE: In case users are charged and they find the TechOps Core Unit charge unreasonable, or the service provided no longer is adequate, they can report this to Dai Foundation at [email protected] or by direct message to the DAIF CU Facilitator. Dai Foundation will then collect information and assess whether the charge seems reasonable. We wish TechOps Core Unit good luck with managing the Github organization and hope this will be a win for all. cc @Core-Facilitators ",
                    "links": [
                        "https://forum.makerdao.com/t/classification-and-cleanup-of-the-makerdao-github-request-for-comments/15306/1"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.908214801071944
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dumitru",
                    "index": "#2",
                    "likes": "0",
                    "time": "20/02/2023-13:22:01",
                    "content": "Acknowledging and confirming everything stated in the message above. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "0",
                    "time": "20/02/2023-14:50:14",
                    "content": "    sorenpeter:  While Dai Foundation retains the right to “claw back” control of the MakerDAO Github organization, it is now the Techops Core Unit that is responsible for the operation of the Makerdao Github organization.   Do you retain ownership of the organization and the technical ability to retake control? Or would this claw-back process involve legal action if TechOps was not compliant? Not that I expect this to really come up in the near future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.603174603174603
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dumitru",
                    "index": "#4",
                    "likes": "1",
                    "time": "20/02/2023-16:43:30",
                    "content": "@LongForWisdom  Ownership is retained with the Dai Foundation. All permissions that TechOps has, can at any time (if needed) be revoked by the owner without prior notice. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#5",
                    "likes": "1",
                    "time": "20/02/2023-20:25:21",
                    "content": "While there also exist a legal agreement between Dai Foundation and the Techops Core Unit, I confirm what @dumitru writes:     dumitru:  @LongForWisdom Ownership is retained with the Dai Foundation. All permissions that TechOps has, can at any time (if needed) be revoked by the owner without prior notice.   I can add that as long as Techops adheres to our agreement Dai Foundation agrees not to interfere in any of Techops operations with this user under normal circumstances, and only use it from time to time to validate that its access rights remain in place. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#6",
                    "likes": "1",
                    "time": "21/02/2023-12:44:51",
                    "content": "    sorenpeter:  and only use it from time to time to validate that its access rights remain in place.   This implies that TechOps (or some other entity) has the ability to revoke those access rights. Is that correct, or is the check more just out of an abundance of caution? Like, do both TechOps and Dai Foundation both have an ‘account owner’ that can revoke the other? Is it a tiered setup where TechOps can do everything but remove Dai Foundation? Do TechOps control the only ‘account owner’ and Dai Foundation asserts ownership rights through the mentioned legal agreement? For this stuff, I feel it’s useful to be very explicit as it can help identify potential future issues. Essentially I’m trying to understand what the DAO’s fallback is, if we need one. Is it that:  We don’t need a fallback, because TechOps cannot revoke the Dai Foundations permissions over the github org. The Github company (microsoft now?) is the fallback, and they would reassign ownership at the request of the Dai Foundation. The Legal agreement opens TechOps up to liability if they misuse this, and fallback happens through a lawsuit or somesuch. Something else?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.479166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#7",
                    "likes": "1",
                    "time": "21/02/2023-14:45:06",
                    "content": "Point taken. I agree my prior answer should have been more detailed. AFAIK Github does not have sufficient granularity in its authorization system to configure a user that cannot have its privileges removed by another user unless there only is one user with the owner role. This would be a risk in itself due to the single point of failure and would require this user to be actively managing the github organisation so it is not an option in this situation. For Techops to properly manage the Github organisation Techops will also require users with owner privilege, and will thus have the ability to remove privileges from the daifoundationadmin user. We thus rely on the same fallback as what I believe anybody using a service provider to manage their github organisation does which is a legal agreement. In an adversarial situation the fallback will be using the legal agreement to have the ownership rights reinstated to Dai Foundation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.272321428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "0",
                    "time": "21/02/2023-14:59:02",
                    "content": "Perfect, that’s much more clear. Appreciate it @sorenpeter. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dumitru",
                    "index": "#9",
                    "likes": "1",
                    "time": "21/02/2023-16:01:20",
                    "content": "@LongForWisdom GitHub indeed doesn’t support multiple permission levels that would allow to administer account and not be able to revoke each other permissions. But for these cases:  TechOps and Dai Foundation signed an agreement listing responsibilities and risks. In case of violation, that agreement could be used as a way of taking legal actions against TechOps. In case permissions are intentionally or unintentionally revoked from Dai Foundation user, it is possible to reinstate them by contacting GitHub support and providing proper documentation of the ownership of trademarks, brand, name, etc. that I beleive Dai Foundation has.  I think these two things could be considered enough protection from any potential harmful actions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.359375
                }
            ]
        }
    ]
}