{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/should-block-analitica-have-a-2-76m-year-2400-mkr-risk-management-monopoly-and-be-its-gatekeeper/19123",
            "title": "Should Block Analitica have a $2.76M/year + 2400 MKR risk management monopoly and be its gatekeeper? ",
            "index": 19123,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "risk-model",
                "risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#1",
                    "likes": "1",
                    "time": "11/12/2022-09:24:00",
                    "content": "MKR holders, MakerDAO and Maker users are losing at least millions $ of value per year and risk losing even more due to the curbed risk estimate accuracy. Reason: key risk model inputs are rough round CONST guesses with no data or research validation behind. The status quo has been cemented by the fact that risk management has been invariably run by the private contractor Block Analitica with no competition or even outside methodology audit. Block Analitica’s unchallenged monopoly has gatekeeping incentives worth $2.76mln/year. Risk management is Maker’s crucial component. Stability Fees, Debt Ceiling, System Surplus Buffer levels, collateral and arranger onboarding and Maker’s overall solvency are dependent on its accuracy and quality. Maker’s risk management has invariably been run by Risk CU, but de facto by a private company Block Analitica (BA). BA’s risk model optimises around the assumed necessity to withstand two price drops per year at exactly 45% for WBTC, 50% for ETH, and 60% for all other volatile assets. These assumed figures have no connection with the changing DeFi environment, no data or research validation behind. They are just rough round CONST guesses. Not risk estimates, but plugs in the absence of ones. Importantly, on the other hand, past performance is not indicative of future results. If MakerDAO is building the most robust lending platform possible, we can’t base risk modelling on the assumption that even the worst-case past scenarios won’t be surpassed in the future, as is assumed in the BA’s framework. That’s just not justified by the history. Paradoxically, Maker is currently significantly limiting itself without gaining any guaranteed stability.  Recently I initiated an effort aimed at gradually replacing these CONST guesses with variables, whose values are learned from data on DeFi community activity and onchain txns. I start with a tool for probing DeFi community sentiment – a crucial risk factor for highly speculative and volatile crypto assets. This will increase risk estimate accuracy => bring risk modelling and protocol parameters closer to the reality. This will fix key shortcoming in the BA’s framework. To illustrate: if ETH-A Jump Severity goes only 50% => 45% and Jump Frequency 2 => 1:   Risk Premium at current Debt Exposure: 0.3% => 0.1%;   Maximum Debt Ceiling (Risk Premium = 10%): $500M => $740M;   Capital at Risk: $632,500 => $210,833.    And here comes the governance bottleneck. Admittedly, my proposal is rather technical. So, the first (natural?) reaction of the community members was to seek BA’s judgement on the proposal’s merits. There is a clear conflict of interest worth $2.76M/year here. Block Analitica serves both as MakerDAO’s unchallenged risk management contractor and the goto judge/reviewer on risk-related proposals questioning their approaches or presenting alternatives. BA’s reaction to the proposal was skeptical and curt: they did not comment on the shortcomings of their own approach and their impact on the protocol, DAO and users, but rather misrepresented the impact of the proposal on Maker’s risk exposure and expressed skepticism about its scientific validity. I was also informed that they have different priorities. I addressed BA’s questions on the proposal’s scientific validity and its urgency for MakerDAO both from the high level POV and zooming in. However, nobody has ever reviewed or audited scientific validity of BA’s own framework. Block Analitica has never faced competition in terms of funds allocation. Moreover, BA’s framework has never been scrutinised with the same questioning:    MIP55c3-SP11: Pioneer DeFi-focused Language Dataset for the Benefit of Risk Modelling & Governance Communication   If you find some empirical research where that’s been validated in a meaningful way, please do share.   On top of that, I approached delegate @Doo_StableLab (disclosing with his consent), who seemed particularly skeptical. I offered to have a call, where I could address doubts, clear up ambiguities, explain details. He declined arguing that he would let the governance decide with voting. This reasoning is surprising to say the least. It’s him, the delegate, who is the governance. MakerDAO pays him $12k/month, not a small amount by any account, to look into the essence of any proposal and come to an unbiased and measured conclusion. To refuse to have a 30 min call => get to the bottom is hardly in the MakerDAO’s or MKR holders’ interests. Block Analitica’s (Risk CU) most recent budget saw a 26% increase over 6 months and reached $2.76M/year ($230k/month). On top of 2400 MKR over 3 years. And this is in the bear market times, when other CUs are being deprecated or squeezed. Note, Risk CU focuses only on market risks. E.g. operational risks remain uncovered. For this kind of money MakerDAO could get a lot of risk management, far better than now. Competing proposals scrutinising and disrupting the incumbents are in the best interests of MakerDAO, MKR holders, and protocol users. @rune @Porter_Smith @humancapitol @brettlyons @cnoyes @paraficapital @alexhevans @Recognized-Delegates ",
                    "links": [
                        "https://forum.makerdao.com/t/mip55c3-sp11-pioneer-defi-focused-language-dataset-for-the-benefit-of-risk-modelling-governance-communication/18802/25",
                        "https://forum.makerdao.com/t/mip55c3-sp11-pioneer-defi-focused-language-dataset-for-the-benefit-of-risk-modelling-governance-communication/18802",
                        "https://forum.makerdao.com/t/mip55c3-sp11-pioneer-defi-focused-language-dataset-for-the-benefit-of-risk-modelling-governance-communication/18802/24",
                        "https://forum.makerdao.com/t/mip55c3-sp11-pioneer-defi-focused-language-dataset-for-the-benefit-of-risk-modelling-governance-communication/18802/25",
                        "https://maker.blockanalitica.com/simulations/risk-model/",
                        "https://forum.makerdao.com/t/mip55c3-sp11-pioneer-defi-focused-language-dataset-for-the-benefit-of-risk-modelling-governance-communication/18802/5",
                        "https://forum.makerdao.com/t/mip55c3-sp11-pioneer-defi-focused-language-dataset-for-the-benefit-of-risk-modelling-governance-communication/18802/6",
                        "https://forum.makerdao.com/t/mip55c3-sp11-pioneer-defi-focused-language-dataset-for-the-benefit-of-risk-modelling-governance-communication/18802/9",
                        "https://forum.makerdao.com/t/mip55c3-sp11-pioneer-defi-focused-language-dataset-for-the-benefit-of-risk-modelling-governance-communication/18802/20",
                        "https://forum.makerdao.com/t/mip55c3-sp11-pioneer-defi-focused-language-dataset-for-the-benefit-of-risk-modelling-governance-communication/18802/24",
                        "https://forum.makerdao.com/t/mip55c3-sp11-pioneer-defi-focused-language-dataset-for-the-benefit-of-risk-modelling-governance-communication/18802/6",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP56",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP25",
                        "https://forum.makerdao.com/t/mip55c3-sp11-pioneer-defi-focused-language-dataset-for-the-benefit-of-risk-modelling-governance-communication/18802",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/36",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/144"
                    ],
                    "GPT-summary": "The author of the post is proposing a gradual replacement of rough round CONST guesses with variables, whose values are learned from data on DeFi community activity and onchain txns. The proposal is aimed at increasing risk estimate accuracy and bringing risk modelling and protocol parameters closer to reality. The post also highlights the conflict of interest worth $2.76M/year, as Block Analitica serves both as MakerDAO’s unchallenged risk management contractor and the goto judge/reviewer on risk-related proposals questioning their approaches or presenting alternatives. The post also mentions the skepticism of the delegate and the need for competing proposals scrutinizing and disrupting the incumbents.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.347371794871795
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#2",
                    "likes": "28",
                    "time": "11/12/2022-11:25:26",
                    "content": "@pvl you have been attacking our methodology for weeks despite our team responding to you multiple times. Clearly you want your proposal to succeed and you started this thread to question our company’s risk management capabilities. On capabilities and methodology I started Block Analitica more than 2 years ago when Maker was transitioning from Foundation to Core Unit model. Initially it was only me and @rema and I am proud to say I was able to scale the team to 10 highly skilled individuals. Not many know about us in DeFi, since we don’t brand ourselves as heavily, but we managed to build the most sophisticated risk model applicable to MakerDAO and the most advanced risk dashboard. Also note makerburn.com is working under our CU. I am not going to go into details of your criticism because you are essentially focusing on a part of the model that is only one of tens of inputs, of which some are based on heuristics and high conservatism which is the key principle of MakerDAO’s success and kept us safe throughout all this turbulence! MakerDAO is conservative with parameters for a reason: it keeps DAI holders safe and stabilizes DAI demand, which is the key ingredient to build borrowing capital at Maker. Also if you focused on our model more in detail you’d see one of the main inputs at estimating losses and risk premiums is really about estimating and simulating how many users protect their vaults before getting liquidated, so called vault protection score. Because at the end all it matters is who gets liquidated and in what amounts. This is unique to Maker because of 1h OSM delay. We recently made improvements by using Vault liquidation ML Model and we started an ambitious project that will enable us to assign a Credit Score to each individual borrower by collecting his wider DeFi interactions (his wallet defi activity, liquidations, external capital held, tenure of debt, repayments…). In short, our goal is to have full granularity on each borrower’s behavior in DeFi, assign a risk score and aggregate it into risk metrics for each vault type at Maker. I can’t see a better attempt at measuring risk in DeFi. On gatekeeping By your interpretation every Core Unit at MakerDAO is a gatekeeper for its own field. We have MIPs that allow any team to spin up competing Core Unit. Also if you really wanted to contribute you could step in touch with us directly and start cooperating on improvements that you saw. Instead you decided for your own budget financing (which is fine), but now you decided to attack us. As much as I can see you are a skilled individual and I built most of our team by picking talented community members. On costs Our DAI annual budget is 6th largest at Maker and I do believe we are one the main 3 CUs if you consider protocol financial safety of highest importance. Our annual aggregate 700 MKR compensation is actually one of the lowest compared to other CUs (measured per contributor) and talented DeFi Risk people are hard to find. Can’t stop telling everyone how proud I am to have this current team in place because it can take years to find people familiar with Maker risk. Regarding wider industry cost competitiveness I suggest you look at proposals at Aave and Compound. Gauntlet, which is perceived as the main industry risk management service provider, charges similar amounts at each of both protocols. Yet, we offer much more: we cover all collateral evaluations, cover all the parameters, have made best risk dashboards and we even open sourced our risk models and our dashboards! When we proposed two important parameter changes to Aave and Compound recently due to ETHPoW fork (example here and here), we proposed MakerDAO to be paid instead of us. Final note To be honest I feel pretty bad I need to defend my CU after years of hard work. As said, nobody knows about us because we don’t show up on podcasts and are loud on twitter. It is because we focus on risk monitoring and building 24/7. And I must say this year was quite stressful, for me personally at least. While all the CeFi lenders are blowing up because of bad risk management practices and some DeFi lending markets are being exploited due to aggressively tweaked parameters, MakerDAO has come out of this crisis without a scratch (knock on wood). To my knowledge the only bad debt accrual from liquidation event I remember in our mandate was in May 2021, about 13k DAI. ",
                    "links": [
                        "https://maker.blockanalitica.com/",
                        "https://makerburn.com/#/",
                        "https://forum.makerdao.com/t/maker-vault-protection-score/10532",
                        "https://medium.com/block-analitica/maker-vault-liquidation-ml-model-5a3d71c38987",
                        "https://docs.google.com/spreadsheets/d/1b5cq1ho4mrv0Md4rBhrnfhdHi9ZoWIC2fv-VIrtLg7I/edit#gid=0",
                        "https://governance.aave.com/t/arc-aave-ethpow-fork-risk-mitigation-plan/9438",
                        "https://www.comp.xyz/t/proposal-adjust-eth-interest-rate-model/3493/",
                        "https://docs.google.com/presentation/d/18UoOagb4KNWtCXc6160p0unJNtmwthnX834nOkqHiCM/edit#slide=id.p5",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/36",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/34"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.971361502347418
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#3",
                    "likes": "2",
                    "time": "12/12/2022-11:08:20",
                    "content": "    Primoz:  To be honest I feel pretty bad I need to defend my CU after years of hard work.   @Primoz I can understand where your feelings are coming from, but I couldn’t agree less with the premise that Risk CU methodology or a budget worth $2.76M/year should be greenlit without being defended. In fact, I find it particularly disturbing and against the interests of MKR holders, Maker users and the overall DeFi community, given Maker’s role and impact, that not one question was asked about your methodology, e.g. during the last $2.76M budget approval. Feels like it was greenlit as a status quo blackbox. While some delegates are being paid $12k/month to look expertly into the proposal and evaluate its merits.      Primoz:  Also if you really wanted to contribute you could step in touch with us directly and start cooperating on improvements that you saw. Instead you decided for your own budget financing (which is fine), but now you decided to attack us. As much as I can see you are a skilled individual and I built most of our team by picking talented community members.   I’ve been talking to @josolnik, responsible for data analysis, since September. Strange that you would claim the opposite. I saw big flaws in your risk assessment methodology and offered cooperation in all good faith. Jan informed me that you had different priorities. Not sure: you’re either unaware of all Risk CU communications, or just misrepresenting facts.  There is a bit of contradiction in your reasoning. You’re downplaying the impact of Jump Severity and Jump Frequency inputs in your model:     Primoz:  you are essentially focusing on a part of the model that is only one of tens of inputs   (are they equally weighted?) But you’re also saying:     Primoz:  MakerDAO is conservative with parameters for a reason: it keeps DAI holders safe and stabilises DAI demand, which is the key ingredient to build borrowing capital at Maker.   To keep Maker constantly prepared to withstand two price drops per year at exactly 45% for WBTC, 50% for ETH, and 60% for all other volatile assets is your central “conservative” decision. So, it’s either one of tens factors => not that important (hardly). Or it’s what keeps DAI holders safe, in your view. It can’t be both. I think I’m focusing on pretty important factors in your model. They answer the question: what kind of challenge we’re getting Maker prepared for? In fact, I’m surprised you’re now downplaying the impact of these factors, when you’re giving them in your own publication as 1st and 2nd factors used to estimate potential market shock:  Screenshot 2022-11-26 at 15.44.111428×320 32.5 KB   Screenshot 2022-11-26 at 15.44.411428×470 41.4 KB   Now, the question of healthy conservatism. There is a difference between healthy cautious life decisions based on the informed understanding of the environment and locking yourself up in the sterile bunker in the woods. In the second case you’ll probably dodge  the bulk of life problems along with all life opportunities. Although you’re probably still not safe from major challenges like a major war. At the moment Maker works under the assumed necessity to be constantly prepared to withstand two price drops per year at exactly 45% for WBTC, 50% for ETH, and 60% for all other volatile assets. The questions you and Jan have been dodging all along: where did you get these figures from? Why not 43.32%, 51.876%, 58.1231%? Why not 70% – that would keep DAI holders even safer. Why are they always the same regardless of market climate, good or bad? Why is Maker constantly getting prepared for these exact market shocks? Each percentage point here costs MKR holders, MakerDAO and Maker users millions $ of missed value. I can answer these questions for you. You took one biggest historic price shock for each collateral type. Rounded it up, because obviously no price movement could be = 50%. Hard-wired these rounded CONSTs into the Model. Hope they represent life behind the bunker walls. They’re not connected to the live DeFi environment. Current Risk Model locks Maker up in the sterile bunker. You tighten parameter nuts with no data or research validation. As I said above, these are not conservative risk assessments, but plugs in the absence of ones. On the other hand, you just got lucky that collateral price movements didn’t exceed rounded historic extremums. There’s absolutely no guarantee that future problems won’t exceed the past ones. History is proof to that.  BTW, where can I find Risk Model methodology description with a full list of tens of inputs? Is it outsourced?  Not to confuse things. You evaluate, what kind of shock you should be getting prepared for. Then you evaluate how prepared you’re. Both are important.     Primoz:  We recently made improvements by using Vault liquidation ML Model  and we started an ambitious project that will enable us to assign a Credit Score to each individual borrower by collecting his wider DeFi interactions (his wallet defi activity, liquidations, external capital held, tenure of debt, repayments…). In short, our goal is to have full granularity on each borrower’s behavior in DeFi, assign a risk score and aggregate it into risk metrics for each vault type at Maker. I can’t see a better attempt at measuring risk in DeFi.   Unfortunately, I couldn’t find Vault liquidation ML Model in your repo. Is it outsourced? I, myself, am working on vault-level ML modelling and would be particularly interested to learn how you captured non-Euclidean invariances of vault-level DeFi activity. It’s not trivial and crucial in this case.      Primoz:  By your interpretation every Core Unit at MakerDAO is a gatekeeper for its own field. We have MIPs that allow any team to spin up competing Core Unit.   In theory. Happy to explain the mechanism one more time: you’re Maker’s sole contractor on all things market risk. At the same time you’re a goto judge/reviewer on all things market risk. When a proposal challenging/questioning your methodology pops up, community members refer to you for judgement, including some delegates, who are paid to be independent and qualified judges on proposal merits. There is a clear conflict of interest.      Primoz:  Gauntlet, which is perceived as the main industry risk management service provider, charges similar amounts at each of both protocols.   Gauntlet, btw, is asking to be disrupted. They’re running their modelling on the assumption of 100% market rationality (GBM for asset price trajectory == Efficient Market Hypothesis) and agent rationality in their simulations. And they’re certainly not delivering value worth their price tag. Funny that you’re giving Gauntlet as a benchmark. ",
                    "links": [
                        "https://medium.com/block-analitica/maker-capital-at-risk-model-methodology-2423b0c5913c",
                        "https://medium.com/block-analitica/maker-vault-liquidation-ml-model-5a3d71c38987",
                        "https://gauntlet.network/reports/aave"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625432342571518
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#4",
                    "likes": "7",
                    "time": "12/12/2022-12:38:20",
                    "content": "I am not sure where this hostility is coming from. As you can see from many Maker community members liking @Primoz 's comments, many are satisfied with the current work so far. Sure, there might be rooms for improvements which is the case for all contributors and participants including delegates but the governance voted to give them a mandate to assess such risk and different tools. You are free to compete with Risk CU. You already have set up a special funding for it but can also submit CU onboarding application. Maker had plenty of CUs onboarded and also offboarded as you are aware. So I find it odd that you are framing the discussion as the community is not enthusiastic about your idea because of conflict of interest. There’s a likelihood that the community might not be supportive because they simply do not find it significant. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9604341736694675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#5",
                    "likes": "0",
                    "time": "12/12/2022-15:45:22",
                    "content": "    Doo_StableLab:  the governance voted to give them a mandate    Group 2 (2)928×956 94.1 KB  A $2.76M, ↑ 26%, budget was greenlit by 2 people, no methodology/technical question asked. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party questioning proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#6",
                    "likes": "2",
                    "time": "12/12/2022-17:19:33",
                    "content": "I assume you circled it because you believe that’s an issue? You joined as a delegate knowing that it’s your role to reflect MKR voters. And for Maker governance, whether that MKR came from delegate or ones borrowing MKR from AAVE, the Maker governance and community respects the result of the onchain voting. One can challenge them of course but have to go through documented process such as creating separate proposals. But using the same logic of yours, if large MKR voters and delegates actually voted for your proposal, would that nullify the result then? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.267857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#7",
                    "likes": "11",
                    "time": "12/12/2022-18:21:57",
                    "content": "Thanks for showing up, @pvl. I believe it will be hard to reach any consensus on this thread because several (intertwined) topics are at play. We might want to tackle them independently.  Governance  Does the Core Unit framework + Delegation Framework allow for fair competition, or are incumbents at an advantage? Who is checking or auditing the work done by Core Units? Should delegates do this? Should external teams do this? Should Core Units not need to defend their annual budget? Would some audit deter talent from joining the DAO (as they don’t want to be scrutinized in the open)? Should the people making the decisions for the protocol be the same as those providing the protocol’s services?   The Risk Framework  Is the current risk framework appropriate for Maker and the current conditions? Should the risk methodology be public and open source?   Block Analitica  Is Block Analitica doing a proper job assessing the risk? Is their price aligned with the market (could Maker get a (significantly) better deal keeping the same quality?   Here comes Endgame! The first two sections are addressed in the Endgame Plan. Through Scopes and Frameworks, Maker is supposed to create “open recipes” that deal with these concerns you point out, separating the experts (which are the “buyers” in a way) and the providers (Ecosystem Actors, Sub/mini/MetaDAOs). Regarding the last section, I can only say that Primoz (and the whole BA) has always behaved professionally and responsively to Maker’s needs and urgencies. Not being an expert in Risk makes me unqualified to address your other points, so I’ll leave that to the bigger brains out there. Thanks again, and please don’t let our Governance deter you from contributing. We’re trying to make it better. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Governance",
                        "Risk Framework",
                        "Block Analitica",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.546666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#8",
                    "likes": "1",
                    "time": "13/12/2022-10:35:09",
                    "content": "    juan:  Does the Core Unit framework + Delegation Framework allow for fair competition, or are incumbents at an advantage?       juan:  Should the people making the decisions for the protocol be the same as those providing the protocol’s services?   If anybody had doubts that Block Analitica is a monopoly gatekeeper assisted by some top delegates. Delegate @Doo_StableLab’s (13,097 MKR) reasoning for rejecting the proposal identifying and fixing flaws in BA’s methodology.  Screenshot 2022-12-14 at 01.25.361558×446 49.2 KB  TL;DR Block Analitica has no interest => try somewhere else I’m also disclosing (with his consent) that @Doo_StableLab was the top delegate, who was not interested in my offer to address doubts, clear up ambiguities, explain details, answer questions on the SPF in the call. By outsourcing his judgement to Block Analitica @Doo_StableLab clearly violated Recognised Delegate Code of Conduct, which he pledged to comply with:  Due Care and Attention Delegates should make a professional and unbiased review of each proposal prior to the submission of their vote.   Professional Knowledge Delegates should maintain a working knowledge of developments at Maker and in the wider cryptocurrency space.  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip55c3-sp11-pioneer-defi-focused-language-dataset-for-the-benefit-of-risk-modelling-governance-communication/18802",
                        "https://forum.makerdao.com/t/recognised-delegate-code-of-conduct/9384",
                        "https://vote.makerdao.com/address/0x8804d391472126da56b9a560aef6c6d5aaa7607b#delegate-credentials"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.840909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#9",
                    "likes": "1",
                    "time": "13/12/2022-10:50:42",
                    "content": "I’m looking forward to the Endgame disrupting current cozy status quo! Certainly not departing anywhere from Maker, as some would like me to. I would add to your good question list:  Where does MakerDAO find enough qualified people to fill up all regulatory, oversight and execution positions in all respective technical, financial and organisational fields? How does MakerDAO incentivise and retain qualified talent? With these questions in mind, I would particularly revisit and probably revise the proposed Endgame Tokenomics such that it helped to sustainably solve this conundrum.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.254761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#10",
                    "likes": "0",
                    "time": "13/12/2022-19:58:46",
                    "content": "I’ll just leave this proposal judgement reasoning here. Flip Flop Flap Delegate (16,620 MKR)  Screenshot 2022-12-13 at 22.53.191646×1974 250 KB   Screenshot 2022-12-13 at 22.42.171076×396 50 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving feedback on proposal",
                        "3rd party expressing skepticism on proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#11",
                    "likes": "1",
                    "time": "13/12/2022-21:17:43",
                    "content": "@pvl It’s unfortunate that you’re unsatisfied with the reasoning as to why Flip Flop Flap Delegate LLC has voted No to your MIP55 application based on our belief that your unpreparedness and inability to prepare properly in order to succeed as a MakerDAO community member. We believe that nobody can’t just will their way to victory without having a plan that plays to their strength. Having the will to prepare to succeed means having clear goals. It also means getting real about identifying obstacles that stand in your way. Flip Flop Flap Delegate LLC believes that to date, you have failed to showcase your willingness to prepare. We could be wrong, but we are willing to take the other side of the trade based on our life experience. We urge you to push forward and build-upon your MIP proposal as an ecosystem actor via the Endgame Plan (EIP) and as stated above, please identify any future obstacles and problems that may arise in order to be prepared to succeed. Regardless or our opinion, there are many MKR token owners and Recognized Delegates who are welcome to disagree and support any initiative that is related to you. Best of luck and all the best. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#12",
                    "likes": "0",
                    "time": "13/12/2022-21:26:25",
                    "content": "Actually, I’m fully satisfied. Q.E.D. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#13",
                    "likes": "0",
                    "time": "13/12/2022-22:20:50",
                    "content": "Penn Blockchain Delegate (7,489 MKR)  Screenshot 2022-12-14 at 01.20.091584×360 78.5 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#14",
                    "likes": "1",
                    "time": "14/12/2022-03:31:00",
                    "content": "Frontier Research Delegate (360.49 MKR)  Screenshot 2022-12-14 at 06.25.201646×714 131 KB  Post referenced as pretty compelling:  Screenshot 2022-12-14 at 12.15.081618×1202 282 KB  ",
                    "links": [
                        "https://forum.makerdao.com/t/should-block-analitica-have-a-2-76m-year-2400-mkr-risk-management-monopoly-and-be-its-gatekeeper/19123/2"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party expressing interest in proposal",
                        "3rd party referencing another post as compelling"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#15",
                    "likes": "0",
                    "time": "14/12/2022-16:49:57",
                    "content": "Onestone Delegate (8.11 MKR)  Screenshot 2022-12-14 at 19.46.491474×246 49 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#16",
                    "likes": "7",
                    "time": "14/12/2022-17:11:14",
                    "content": " Screen Shot 2022-12-14 at 9.10.51 AM1834×972 170 KB  saved you a click.         ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#17",
                    "likes": "1",
                    "time": "14/12/2022-17:27:57",
                    "content": "Never intended to put it here. Thanks for your personal unbiased and professional review. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#18",
                    "likes": "4",
                    "time": "14/12/2022-18:16:22",
                    "content": "Might chime in here and ask if we refocus a bit. I think there’s a lot of valuable discourse in this thread, but I think we can probably ease off the screenshots. If we’re using them to to make a broader point great, but at this point it’s spamming the thread to add them without comment. Want to encourage the conflict gets explored here, rather than its causalities. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#19",
                    "likes": "0",
                    "time": "14/12/2022-18:19:20",
                    "content": "Sorry about that. Duly noted. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                }
            ]
        }
    ]
}