{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/sen-warren-asks-sec-chair-gensler-about-risks-posed-by-cryptocurrency-exchanges/16686",
            "title": "Sen. Warren Asks SEC Chair Gensler About Risks Posed by Cryptocurrency Exchanges ",
            "index": 16686,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "legal",
                "regulation",
                "defi"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#1",
                    "likes": "2",
                    "time": "18/07/2022-23:44:04",
                    "content": "The recent exchange bankruptcies are only adding fuel to the fire. It is generally best to be proactive as opposed to reactive. Here is no different and everyone should keep that in mind.  Warren is asking the SEC to take action now. As per the below cited article, Senator Warren told Yahoo Finance. “Congress needs to act, but the SEC has a responsibility to use its authorities to put guardrails in place and crack down on crypto actors that break the rules” “I’ve been ringing the alarm bell on crypto and the need for stronger rules to protect consumers and financial stability,” Warren stated. “Too many crypto firms have been able to scam customers and leave ordinary investors holding the bag while insiders make off with their money.” Of additional significance, the article states that “more enforcement action is expected, according to one crypto industry lobbyist, who also says a significant amount of the crypto industry is afraid to proactively engage with the SEC over fears of enforcement actions.” See Congress, Wall Street await more SEC action amid crypto meltdown Here is the direct link to the Senator’s press release : Warren Asks SEC Chair Gensler About Risks Posed by Cryptocurrency Exchanges | U.S. Senator Elizabeth Warren of Massachusetts ",
                    "links": [
                        "https://www.warren.senate.gov/oversight/letters/warren-asks-sec-chair-gensler-about-risks-posed-by-cryptocurrency-exchanges"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.471618357487923
                }
            ]
        }
    ]
}