{
    "poll_list": [
        {
            "title": "Should we initiate the shutdown of the SCD system through an executive vote on April 24th, 2020?",
            "index": "1673",
            "option": "Yes",
            "supporting_mkr": "30,218",
            "highest_fraction": 0.62
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-thread-scd-shutdown/1673",
            "title": "Signal Thread: SCD Shutdown ",
            "index": 1673,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "emergency-shutdown",
                "scd-shutdown",
                "covid-crash"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#1",
                    "likes": "9",
                    "time": "18/03/2020-03:04:41",
                    "content": "With the extreme market changes we have seen in the past week, we have decided now would be a good time to once again engage in discussion about shutting down Single Collateral Dai. During today’s call, @Primoz presented information on the state of SCD here Governance and Risk Meeting: Ep. 78 - YouTube. In summary of his findings it became apparent that peg instability and liquidity issues were beginning to hinder the efficiency of the protocol. Liquidations were no longer taking place in an ideal fashion due to cost inefficiencies. This poses a great risk to PETH holders and the overall stability of the protocol. With this new information in mind, it seems prudent to begin advanced discussions on this topic. Several months ago I began collecting signals on the direction community members would like to take in shutting down SCD. A summary of the first polls can be found here:     Summary/Discussion of Parameters for SCD Shutdown Governance       The results are in!  After weeks of discussion and voting, I have closed the final signal polls for SCD Shutdown. To recap, with the community currently trying to maintain 2 separate Dai credit systems, I thought it imperative to begin the process of collecting opinion on when we should shut down the legacy system. Especially since there seemed to be a lack of consensus on the issue. This led me to begin with a signal on “When should we trigger SCD Global Shutdown”.    With this first signal I a…     While the latest conversation about introducing a tax to incentivize/penalize CDP users can be found here:     Signal Request/Discussion: Should we implement a tax during SCD Shutdown to recuperate unpaid Stability Fees? Signal Archive       Based on ongoing discussions on implementing the shutdown of our legacy Dai Credit System (SCD), the latest is in regards to how we may extract the remaining stability fees from CDP holdouts. If you are unfamiliar with this topic of discussion I encourage you to read/watch the following resources:                [Governance and Risk Meeting: Ep. 70]      With these resources you should start to see the picture that is emerging on the decisions that need to be made in regards to SCD Shutdown.  Wi…     Since both of these threads are now a little out of date I think it best if we reset some of the conversations given the new market conditions we live in. My goal in this thread will be to foster purposeful and meaningful discussion, and signalling, that moves us towards the end goal of SCD Shutdown. I encourage all community members to bring their ideas to the table in regards to how they would like to see this process play out and what they think are mitigating factors. Once some discussion has commenced we can begin to collect signalling on next steps. Some questions to begin discussion:  When should we enact ES? What parameters should we follow to trigger ES? Should we implement a tax on CDPs to recoup SCD fees? (see Signal Request/Discussion: Should we implement a tax during SCD Shutdown to recuperate unpaid Stability Fees?) Should we forgive SCD Fees? How do we find someone to clear out the migration contract before ES?  March 18th Edit Now that some discussion has taken place, I would like to begin with a few basic polls. When should we initiate SCD Shutdown?     Less than 1 week from today Less than 1 month from today More than 1 month from today     0 voters     Pros and Cons of initiating shutdown sooner rather than later Pros  Shutdown while price/liquidity are stable Less governance/risk overhead in the coming days/weeks/months CDPs may migrate to MCD and provide more Dai liquidity  Cons  Not enough time to communicate to CDP users No more MKR fees burned Opens up more ETH onto the market, could cause downward pressure on ETH price Could be bad optically. CDPs that paid fees and migrated to MCD could feel short changed. CDPs that weren’t prepared to settle right now could be effected financially.  If you have more pros/cons let me know and I’ll add them to the list. Should we forgive stability fees or try and extract fees in another way?     Forgive Extract     0 voters     Thoughts on forgiving stability fees versus extracting fees Technically we could calculate how much each remaining CDP owes in ETH and vote to manually extract that amount from each CDP. This however could look bad optically and would be time consuming for the Foundation. On the other hand, if we were looking to close later than the next few weeks we could signal to the community that a tax was being placed on remaining CDPs who did not choose to migrate and hopefully incentivize them to migrate willingly. All of the options to extract fees in order to incentivize CDP users to make a certain decision are much more time consuming than just forgiving the fees. Unless there is a more elegant solution that has not been brought forth yet. Forgiving stability fees is the fastest and easiest option. Optics are mixed because remaining CDPs would be happy but I would assume most ecosystem users are using MCD now and may feel slighted at having to pay fees unlike remaining CDP users. The obvious negative to this option is losing out on additional fees in the form of MKR burn which would have helped offset our Black Thursday losses. Additional Thought @Cyrus has brought up the point that before we initiate ES, we may need to find a willing party to absorb the migration contract. The reason this is necessary is because the migration contract is technically unbacked Dai and if there is Dai remaining in the contract at ES, it gets liquidated and at 4M Dai currently, there would be a lot of slippage. So in order to safely cancel out this contract, a helpful whale would need to mint Dai, migrate their Dai to Sai for the amount in the migration contract and then become settled in SCD. March 26th Edit Thank you to everyone for their input so far. Please go check out @Derek’s post about processes and next steps for SCD shutdown over here:     Sequential Process for SCD Shutdown Governance       Hi all, this post explains the sequential process for shutting down Single Collateral Dai. The process involves two executive spells; one to protect MCD and the other to shutdown SCD. I will outline what these steps are and why they are important. As of April the 19th you will notice that the section in (B) Executive Spell 2, now includes updated steps, a timeline and request Governance Vote support.  A) Executive Spell 1 - Set the SAI Debt Ceiling to 0 in MCD   This action will protect MCD by p…     Now that the previous polls have concluded, we can move on to the final forum poll stage. With “Less than 1 month from today” winning by 64%, we can now narrow our options down to a week in April. With the winner of the following poll chosen to go on chain for MKR holders to ultimately decide. Therefore: When should we initiate SCD Shutdown?     Friday, April 10th, 2020 Friday, April 17th, 2020 Friday, April 24th, 2020 Later Other     0 voters     My plan is to leave this open until Sunday evening/Monday morning so as to move on chain for Monday’s governance polls. If we haven’t received enough votes by then I will keep it open longer. Please remember this is just a signal and non-binding. As we know, things move fast in this space and changes may be necessary. I look forward to seeing the results. A note on fee forgiveness and clarity Since the voting was close on the forgive/extract poll, I just wanted to quickly discuss these implications. When inevitably put on-chain, the governance poll may be struck down for a myriad of reasons (shutdown too soon, would rather extract fees, etc.). Therefore it may be necessary to revisit the results of these polls and put together a different package to entice MKR voters. MKR holders ultimately have the final say and that is to be respected, regardless of outcome. It may even be necessary to redo the extract/forgive poll on-chain for full clarity as well as any other factors that may be uncertain. Ultimately, I hope that these forum polls have helped guide us in the right direction to passing what the majority of community members voted for. ",
                    "links": [
                        "https://forum.makerdao.com/t/summary-discussion-of-parameters-for-scd-shutdown/1130",
                        "https://forum.makerdao.com/t/signal-request-discussion-should-we-implement-a-tax-during-scd-shutdown-to-recuperate-unpaid-stability-fees/1166",
                        "https://www.youtube.com/watch?v=KsFYnwywJVY",
                        "https://forum.makerdao.com/t/signal-request-discussion-should-we-implement-a-tax-during-scd-shutdown-to-recuperate-unpaid-stability-fees/1166",
                        "https://forum.makerdao.com/t/sequential-process-for-scd-shutdown/1823",
                        "https://forum.makerdao.com/t/summary-discussion-of-parameters-for-scd-shutdown/1130/5",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-wednesday-march-18-9am-pst-4-00-pm-utc/1678",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-friday-life-comes-at-you-fast-edition-march-20-9am-pst-4-00-pm-utc/1725/3",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-march-26-9am-pst-4-00-pm-utc/1820/2",
                        "https://forum.makerdao.com/t/mkr-holder-dai-gest-week-13-2020/1835",
                        "https://forum.makerdao.com/t/governance-initiative-defi-consortium-on-emergency-shutdown-criterion/1829",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-wednesday-march-18-9am-pst-4-00-pm-utc/1678/5",
                        "https://forum.makerdao.com/t/covid-crash-situation-room/1711",
                        "https://forum.makerdao.com/t/signal-request-discussion-should-we-implement-a-tax-during-scd-shutdown-to-recuperate-unpaid-stability-fees/1166/54",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-april-9-9am-pst-4-00-pm-utc/1938/3",
                        "https://forum.makerdao.com/t/single-collateral-dai-shutdown-details-and-context/1978"
                    ],
                    "GPT-summary": "The author of the post is explaining the proposal to shut down Single Collateral Dai due to peg instability and liquidity issues. The author is seeking feedback and constructive criticism from the community on when and how to initiate the shutdown, including questions about implementing a tax on CDPs to recoup SCD fees and forgiving stability fees. The author also wants to collaborate with the community to find a willing party to absorb the migration contract before ES.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.413284632034632
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#2",
                    "likes": "2",
                    "time": "18/03/2020-05:48:20",
                    "content": "@Aaron_Bartsch can you speak a bit about this in the Wednesday call tomorrow? Would be cool to have a recap. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#3",
                    "likes": "2",
                    "time": "18/03/2020-14:13:25",
                    "content": "Sure thing, I’ll do a summary/timeline of how we got to where we are today in regards to SCD Shutdown decisions. If it can be a little past 12 that would be great. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.078125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "5",
                    "time": "18/03/2020-16:19:51",
                    "content": "Bit of a summary of chat discussion on this today. Some facts.  SCD debt outstanding is about 15M CDP 3088 is > 8M of this. I will add a link but it is looking like SCD auctions are not completing with DAI PEG around 1.03 SCD doesn’t have a GSM so if governance needs to change anything on the SCD we can do it quickly. LFW comments that perhaps we should shut down the SCD now before we experience another collateral price drop. Pros:  Doing it now we should have a decent SAI PEG so people can move. Gets MKR off the hook for any liabilities. liquidations in auctions - none are below 100% Also this ETH freed might find its way into MCD to provide more DAI Likelihood of more DAI coming into system Can formally close down the SAI-DAI bridge. Better to ES this now than to wait for a market collateral price drop.  Cons.  ETH will be freed to come on market to sell. SAI will basically be an option on ETH - SAI holders may end up selling causing a ETH/USD price event.  Issues.  Do we apply a fee.   Honestly at this point since it goes to PETH this seems moot.  Maker gets nothing out of shutting down SCD. PR - do we telegraph this or just shut it down.   Personally I think at least a PR post giving holders a warning that Maker is seriously considering shutting down SCD for the sake of giving everyone a chance to finally clear out of this system and for Maker to focus efforts on MCD management in these difficult times. Any development or ‘post ES’ UI work may need to be done.  We don’t want people upset they can’t get at their collateral or convert SAI to ETH in the system. If we don’t shutdown this system we just heap more issues on to MKR holders.  Based on the discussion general consensus of the small number of people participating is that it might be prudent to finally put a time frame on SCD shutdown.   Given state of the markets probably better to have this happen quicker.   So time for discussion is now. Total Maker could be on hook for given auctions/liquidation process is stuck is 15M-collateral value which will be heaped on SAI holders in the case of collateral price drop.   Right now it would be more likely for SAI to hold a $1PEG for people to clear this. Remember everyone has been warned multiple times the SCD/SAI system could shutdown at any time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5311791383219955
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#5",
                    "likes": "0",
                    "time": "18/03/2020-18:00:47",
                    "content": "Yea I am seeing CDPs under 150% CR. Ill add others if I see them.  I am trying to verify that mkrtools is correct, but Im blockchain dyslexic. (IGNORE, MKR.TOOLS IS NOT ACCURATE) https://mkr.tools/cdp/14372 https://mkr.tools/cdp/14509 https://mkr.tools/cdp/138445 UNDER/near100% https://mkr.tools/cdp/100685 https://mkr.tools/cdp/153517 Few others were a couple percentage points from 150%. Collateral I am seeing that should be bite: ~800 peth almost approx 400 is in CDPs just under 100% ",
                    "links": [
                        "https://mkr.tools/cdp/14509",
                        "https://mkr.tools/cdp/138445",
                        "https://mkr.tools/cdp/100685",
                        "https://mkr.tools/cdp/153517"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#6",
                    "likes": "2",
                    "time": "18/03/2020-18:40:18",
                    "content": "So it sounds like we need some more information from the devs at some point with regards to how the shutdown of SCD works, and how it will affect MCD through the migration contract. It was touched on during today’s call, but there were multiple calls that we should take some more time to figure out the impacts. Naturally the Foundation devs are busy. They have indicated that they will have more free time after the FLOP auctions have completed, so we shouldn’t expect anything from them before that point. Given that timescale, I think it is worth starting some general polls before then (which I will leave to Aaron to setup as he thinks is appropriate.) On a personal note, I think I would like to see SCD shutdown sooner rather than later. Given the potential for SCD users (both CDPs and Sai Holders) to come out badly in the event of extreme market volatility I think we should try to shutdown SCD as soon as it is feasible to do so. From a PR standpoint, perhaps we should communicate that this is being actively discussed? That will give users of SCD more time to consider their positions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.69212962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#7",
                    "likes": "1",
                    "time": "18/03/2020-19:11:48",
                    "content": "A reddit post might be in order. Explaining the situation is hard tho  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.541666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#8",
                    "likes": "0",
                    "time": "18/03/2020-19:54:09",
                    "content": "I think it’s time to shutdown SAI ASAP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/banteg",
                    "index": "#9",
                    "likes": "0",
                    "time": "18/03/2020-20:22:02",
                    "content": "It would sad to see all those 7700 MKR fees go unclaimed, they could’ve helped to lessen the dilution. As far as I understand, it’s just a design flaw and there is no way to force them on shutdown. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#10",
                    "likes": "0",
                    "time": "18/03/2020-20:38:59",
                    "content": "    banteg:  It would sad to see all those 7700 MKR fees go unclaimed, they could’ve helped to lessen the dilution.   Yes I’d like to recoup the fees very much. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#11",
                    "likes": "1",
                    "time": "18/03/2020-23:17:55",
                    "content": "I’m inclined to take the L on this one, but we should set future expectations that any system economic flaws are going to be proactively addressed, and those trying to free ride on the system can expect to get burned We do not want to project weakness, as this is going to lead to economic attacks a la George Soros and the European exchange rate mechanism ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#12",
                    "likes": "1",
                    "time": "18/03/2020-23:31:26",
                    "content": "    Mitote:  Yea I am seeing CDPs under 150% CR. Ill add others if I see them. I am trying to verify that mkrtools is correct, but Im blockchain dyslexic. https://mkr.tools/cdp/14372  https://mkr.tools/cdp/14509  https://mkr.tools/cdp/138445 UNDER/near100% https://mkr.tools/cdp/100685  https://mkr.tools/cdp/153517    All that CDPs are shown as liquidated in https://makerscan.com and with 0 debts. https://makerscan.io/cups/14372/ https://makerscan.io/cups/14509/ https://makerscan.io/cups/138445/ https://makerscan.io/cups/100685/ https://makerscan.io/cups/153517/ Is there any problem with mkr.tools? How reliable are debt numbers? ",
                    "links": [
                        "https://mkr.tools/cdp/14509",
                        "https://mkr.tools/cdp/138445",
                        "https://mkr.tools/cdp/100685",
                        "https://mkr.tools/cdp/153517",
                        "https://makerscan.com",
                        "https://makerscan.io/cups/14372/",
                        "https://makerscan.io/cups/14509/",
                        "https://makerscan.io/cups/138445/",
                        "https://makerscan.io/cups/100685/",
                        "https://makerscan.io/cups/153517/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#13",
                    "likes": "1",
                    "time": "19/03/2020-00:36:08",
                    "content": "Oh sweet hope ur links are right. I don’t know any issues but it hasent been updated in awhile. Urs seem right. Once I get back from work I’ll check it out. Edited my post above, I would love to hear from a risk team person about best site for CDP data in scd. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.729591836734694
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#14",
                    "likes": "0",
                    "time": "19/03/2020-03:34:54",
                    "content": "Personally I don’t want to vote right now because the specifics of how we close the migration contract seem very important for safe SCD shutdown. From what I understood in the meeting today closing the migration contract has to come first. Currently there is 4mil DAI from SAI. Another important point that I dont understand/cant find info about. https://youtu.be/AIW7lFg6gBI?t=5271 so in cage there is a function that allows CDP holders to mint SAI once the feed price for PETH is locked? Can we get more details on this? I dont understand the issue exactly. But “No debt ceiling check” sounded ominous… Also AFAIK there are not interfaces ready for ES either. I put an very rough notice on reddit linking to this thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.261688311688312
                },
                {
                    "author_link": "https://forum.makerdao.com/u/curiosoacerca",
                    "index": "#15",
                    "likes": "2",
                    "time": "20/03/2020-13:27:42",
                    "content": "I am really unhappy with all this running around like headless chickens by the makerdao team. Clean up your own house without making users having to check their phones every day for your rushed in decisions and calls. Check makerdao’s market cap… 5M SAI is what you “go after”?! Let CDP each owner manage when they want to migrate. Last time I checked it was rushing into decisions and not thinking things thru that created all this mess. Unless this forced migration comes without the stability fee I am absolutely totally against it! Why should we continue to pay for makerdao’s screw ups?! Again check the market cap. 2 bad decisions don’t make for 1 good. Calling this DeFi is now a joke. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.023148148148148
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#16",
                    "likes": "1",
                    "time": "20/03/2020-13:44:56",
                    "content": "    curiosoacerca:  running around like headless chickens   Welcome to crypto. and then welcome to probably the most complex project in crypto   this is an experiment on top of another experiment (ethereum). If you want complete stability go to bond market… oh wait. Many active people here (including myself) aren’t employed on “the makerdao team”, so we communicate however we do without fear of being fired. “The Makerdao team” has been very professional imo. Anyways It basically requires mania to try to fully understand the protocol on a continuous basis (especially with SCD and MCD both being live and constantly changing). But staying on topic on this thread would probably be more useful to everyone. My bad. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.044343434343435
                },
                {
                    "author_link": "https://forum.makerdao.com/u/curiosoacerca",
                    "index": "#17",
                    "likes": "1",
                    "time": "20/03/2020-13:52:20",
                    "content": "It’s easy to be cool when everyone else is paying the bill except you… That’s how I see how “the team” is dealing with the mess. And IMHO… Ppl that got rekt above the 13% penalty should go after them legally. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.808333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/curiosoacerca",
                    "index": "#18",
                    "likes": "0",
                    "time": "20/03/2020-13:55:17",
                    "content": "Staying focused: Unless this forced migration comes without the stability fee I am absolutely totally against it! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lix",
                    "index": "#19",
                    "likes": "3",
                    "time": "20/03/2020-13:55:52",
                    "content": " outt22560×1440 98.1 KB  made a better plot showing how it is very difficult to vote on the tax per second parameter unless we know how many new PETH from non-borrowers will join the pool before settlement. https://github.com/lixwhi/tax_collecting I say that within 1 month we own our mistake, forgive fees, and shutdown.     monet-supply:  I’m inclined to take the L on this one, but we should set future expectations that any system economic flaws are going to be proactively addressed, and those trying to free ride on the system can expect to get burned   100% ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.936868686868687
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#20",
                    "likes": "5",
                    "time": "20/03/2020-14:01:50",
                    "content": "Recapping comments from the previous Governance call regarding how to absorb the migration contract; It is expected that Maker Governance will vote in an executive spell (time=tbd) to cage the system - meaning that it will no longer be possible to mint Sai. This caging activity will also shut down the facility to migrate Sai to Dai, however it will still allow Dai from MCD to be transferred to SCD. We refer to this as a ‘one-way bridge’. This bridge, coupled with the fact that we have just added USDC to the MCD protocol, puts us in a unique position to allow USDC collateral holders to mint DAI, and exchange this Dai for Sai, thereby draining the Sai migration contract by burning Sai for ETH and returning it back to MCD as Dai used to pay down the original USDC position. The what (and how) in bullets  Prevent swapping Sai to Dai (by caging the SAI join adapter) Continue to allow swapping Dai to Sai (by allowing exit on the adapter to continue working) Call global settlement (call cage on the top.sol contract) Mint Dai through USDC Swap Dai for Sai Burn Sai for ETH Return ETH to MCD Exchange for Dai and pay off USDC  The tax/SF dynamic remains an outstanding question that still needs to be discussed based on the outstanding CDPs, as well as the warning duration as a result of the above polls. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.4508547008547
                },
                {
                    "author_link": "https://forum.makerdao.com/u/curiosoacerca",
                    "index": "#21",
                    "likes": "0",
                    "time": "20/03/2020-14:04:56",
                    "content": "You can do everything you want. Don’t bully your users. We did not left banks to be screwed by developers. Again… Makerdao is a billion dollar project…I see everyone paying the bill but makerdao. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#22",
                    "likes": "0",
                    "time": "20/03/2020-15:26:44",
                    "content": "Agree. I dont think the foundation adequately communicated the highly experimental nature of this project. That needs to change. Legal liability certainly doesn’t seem out of the question. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.059523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#23",
                    "likes": "0",
                    "time": "20/03/2020-15:36:18",
                    "content": "    Derek:  Return ETH to MCD   Thanks for the work Derek and CO.  Stressful days for all. Do you mean open a CDP with eth to mint the DAI that pays off the USDC? Or just trading eth for dai? If the latter does this antagonize liquidity concerns for DAI? In general is this a process that the foundation would want to take to ensure SAI leaves the migration contract right? I don’t see the profit opportunity exactly, it very well could be there, but I am unsure if that’s suppose to the driving force. I am fairly uncomfortable/annoyed with how USDC is now being considered to deal with all these problems we created/let happen. We have no models or analysis of that collateral type. It was added as an emergency measure because DAI wasn’t available enough for keepers to function (+other factors). Clearly all of this is being made up as we go along, (maybe impossible to avoid in reality, but users need to be made aware of that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.38626700680272
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#24",
                    "likes": "1",
                    "time": "20/03/2020-15:59:05",
                    "content": "Thanks @mitote I chose USDC in my example because at the moment that is probably the easiest way to generate DAI liquidity (in addition to all the auction demand at the moment). It could just as easily be BAT or ETH (albeit again there is limited supply). I agree with you regarding USDC risks if the system is leaning too far in that direction - in that domain, I take heed from Cyrus/Vishesh/Primoz etc. Re: Would the foundation do this or another economically incentivised actor? At this point I think we’re just proposing a mechanism - it would need some review/discussion with participants. All that said, though, I think there is a strong drive from the community to resolve this (it’s an important milestone) as well as the liquidations victims list. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.282312925170068
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#25",
                    "likes": "0",
                    "time": "20/03/2020-16:22:53",
                    "content": "I guess the big question that still needs answering is, how do we get someone/who do we get, to mint and migrate? Do we need to add a monetary incentive for a third party to agree? Also, looks like forgiving fees and shutting down in less than a month are highly in favour. Next steps would be to have an on-chain poll as well as needing to probably lower the debt ceiling further. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.8841269841269845
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#26",
                    "likes": "1",
                    "time": "21/03/2020-00:22:18",
                    "content": "Would someone explain what is the reason to shutdown the SCD? I see some disadvantages for shutting down the SCD:   There are SAI holders, who prefer SAI to DAI because they consider the MCD as “unsecure”. This is the most conservative part of the stablecoin holders. What will they do if they suddenly become ETH for their SAIs? It is not that stable asset they want and they will sell the ETH for DAI (or other stablecoin if they do not trust DAI any more). It will cause a huge dump on eth market causing losses for these SAI holders.   There should be some amount of SAI used as collateral in DeFi. Had someone thought about possible domino effect in DeFi?   I see negative effects of the decision, but what is the reason to do the SCD shutdown now? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.512152777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#27",
                    "likes": "4",
                    "time": "21/03/2020-21:04:25",
                    "content": "The reason IMO is simple: a new version is available and the old one is becoming obsolete. It costs time/money to maintain and govern 2 systems. Do you want to maintain and govern SAI? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.086363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#28",
                    "likes": "0",
                    "time": "22/03/2020-18:48:11",
                    "content": "    bit:  The reason IMO is simple: a new version is available and the old one is becoming obsolete. It costs time/money to maintain and govern 2 systems. Do you want to maintain and govern SAI?   @LongForWisdom, would you and the MakerDAO team agree with the way of thinking? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.086363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#29",
                    "likes": "1",
                    "time": "22/03/2020-22:50:52",
                    "content": "I don’t speak for the DAO. But I largely agree with bit. I don’t want to spend the time and energy worrying about SCD when there are so many more useful things we could be focusing on. There are also a bunch of really good reasons why you (and anyone else) should stop using it and switch to MCD. It is less secure than MCD, it is less user-friendly than MCD, and in my estimation, with SCD you stand a larger chance of losing your money in a second flash-crash even considering the auction issues we had with MCD. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.140476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#30",
                    "likes": "0",
                    "time": "23/03/2020-03:00:57",
                    "content": "    LongForWisdom:  There are also a bunch of really good reasons why you (and anyone else) should stop using it and switch to MCD.   @LongForWisdom, thank you for your answer! Assuming you are right, is there are better migration path than just SCD ES? I assume no one will claim if ES would be executed in case of real emergency saving people’s money, but if the reason is the “cost optimization” or “possible emergency case”, I fear, you will damage the trust massively. The DAI promise is a “decentralized stablecoin”, SCD ES breaks both promises at the same time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.550595238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#31",
                    "likes": "1",
                    "time": "23/03/2020-09:08:10",
                    "content": "    ethernian:  I assume no one will claim if ES would be executed in case of real emergency saving people’s money   The problem with this is that if we wait until there is an emergency then there is a good chance we can’t save people’s money. At the very least we can’t save as much. The best way to save everyone’s money is to shut it down before a potential market crash happens. Realistically, people are going to shout at us one way or another. If there is an emergency and we shutdown, then people lose money and shout at us. If we shut down prematurely saving people’s money then they shout at us because it’s not ‘decentralized.’     ethernian:  Assuming you are right, is there are better migration path than just SCD ES?   There is! https://migrate.makerdao.com/ We’ve been pushing migration since the launch of MCD. People have had ample time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.154801587301587
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Long_Field",
                    "index": "#32",
                    "likes": "0",
                    "time": "23/03/2020-10:51:29",
                    "content": "Hi, Could you please make sure https://oasis.app/ works under Tor browser and others before closing down SAI or https://cdp.makerdao.com/ Thx! ",
                    "links": [
                        "https://cdp.makerdao.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.763888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#33",
                    "likes": "0",
                    "time": "23/03/2020-12:04:10",
                    "content": "    Long_Field:  Could you please make sure https://oasis.app/  works under Tor browser and others   Why do you think you need Tor? If you use a VPN then your identity is protected. Isn’t the point of Tor to hide the identity of the owner of the website? Everybody already knows that MakerDAO runs Oasis. Please explain. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/curiosoacerca",
                    "index": "#34",
                    "likes": "0",
                    "time": "23/03/2020-12:53:41",
                    "content": "Migration is not only about time, it is also mainly about money. I will keep repeating this until you hear it: don’t bully users and if you want to force users at least Weaver the stability fee. Also… Just purely out of curiosity… Can anyone tell me if the CDP owners that got rekt 0 for their liquidations where all owners of vaults or were there also single collateral cdps? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0095238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#35",
                    "likes": "1",
                    "time": "23/03/2020-13:25:20",
                    "content": "    curiosoacerca:  it is also mainly about money   Could you clarify this?     curiosoacerca:  if you want to force users at least Weaver the stability fee.   Not 100% sure we can even do this with regards to migration. If we shutdown, forgiving fees is the default state of affairs unless we explicitly decide otherwise.     curiosoacerca:  Can anyone tell me if the CDP owners that got rekt 0 for their liquidations where all owners of vaults or were there also single collateral cdps   SCD does not use auctions for liquidations. While this may sound great given recent happenings, the actual mechanism used is not very robust. In SCD liquidations happen at a fixed 3% below market price, what this means in practice is that liquidations in SCD only happen when Sai is available for less than $1.03. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.664835164835164
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#36",
                    "likes": "3",
                    "time": "23/03/2020-13:52:30",
                    "content": "Since last Primoz Sai analysis, sai amount went down additional 700k. Inactive and largest CDP 3088’s share of total debt is already at 55.29% (and rising). Share of his fees is similar. While community previously voted for a threshold of 10mil sai as one of the criteria for shutdown, i don’t think this is realistically ever achievable: it only leaves 1.7mil sai for all other CDPs. I really think we should announce on official blog/reddit etc.  we are planning to shutdown in the near future. Or at least that it is high probability for such event. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.8895299145299145
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#37",
                    "likes": "0",
                    "time": "23/03/2020-15:34:29",
                    "content": "The code is available right? If people want to stick with SCD is it not possible to deploy a forked version without MCD? I thought that was a pattern blockchain/decentralized systems used, like the idea that anyone can redeploy their own version of whatever protocol is operating. No one will stop someone trying to keep SCD alive but independent from MCD, Mkr holders have signaled that they want to get rid of it, so why doesn’t another group take that cost up if they want SCD to still operate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.154761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#38",
                    "likes": "0",
                    "time": "23/03/2020-23:02:05",
                    "content": "    LongForWisdom:  The best way to save everyone’s money is to shut it down before a potential market crash happens.   Is there any quantitative model with numbers, how the SCD system may behave if the price drops f.e. below $69? I suppose there are some numbers on volumes and prices from last crashes and should be possible to make the estimation for the next crash, right? This estimation may be right or wrong (hopefully we will not become an opportunity see the reality check), but it will let SAI-holders to make a well thought decision. If the model predict a crash, well you have warned SAI holders and it is their decision to take a risk. It could make sense to create a gitcoin grant or contest for the predicting model like this. I would put some money into the bounty fund, I know few people who would probably support the grant. MakerDAO Fund could support the contest as well. We don’t need a lot of money to make it happen. What do you think? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.357936507936508
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#39",
                    "likes": "0",
                    "time": "23/03/2020-23:11:22",
                    "content": "I don’t believe there is a quantitative model. It’s one of those situations where I’m not sure it is necessary though. Under $69 Eth, 12.5mil of 15mil Sai CDPs are liquidated. There is no possible way that that set of liquidations happens. Sai will go over $1.03 based on the massive demand and the liquidations will stop. You are welcome to work on something like that if you feel it would be useful. But I worry that no matter what model you produce, it isn’t going to be seen by many Sai CDP Holders. It’s difficult to just produce something like that, announce it and say: ‘You are now informed, not our problem.’ Realistically it will always be our problem while it’s up and running. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.53125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#40",
                    "likes": "0",
                    "time": "24/03/2020-00:15:42",
                    "content": "    LongForWisdom:  Under $69 Eth, 12.5mil of 15mil Sai CDPs are liquidated. There is no possible way that that set of liquidations happens. Sai will go over $1.03 based on the massive demand and the liquidations will stop.   But there is still possible for keepers to create a SAI CDP for ETH to create a short term SAI liquidity, right? The free market is not ONLY the way to get SAI liquidty. It assumes, keepers have some ETH liquidity, but the assumption is not that wrong.  They buy ETH collateral, so they should have some price/time assumptions on it. I suppose, the real problem is not that SAI goes $1.03. The real problem, that on falling market keepers become better ETH prices on MCD (more than 3% off) so they move from SCD to MCD auctions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.660714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#41",
                    "likes": "0",
                    "time": "24/03/2020-02:48:54",
                    "content": "Is is true that if we do SCD emergency shutdown that the existing CDP holders never have to pay off their stability fees in MKR?  I thought that the Dai necessary to buy MKR to pay off the SF would be deducted at the time of the SCD.  If this is true, I think we should keep a high SF and make the CDP holders pay off their debts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.075
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#43",
                    "likes": "1",
                    "time": "24/03/2020-09:17:00",
                    "content": "The social contract is: either the peg or ES (or upgrade to DAI). Please be fair. Trust is everything. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#44",
                    "likes": "0",
                    "time": "24/03/2020-13:55:16",
                    "content": "I keep wondering whether the SAI in the migration contract could be used as a kind of dilution mechanism.  Indirect tax on SCD CDP owners.   But I don’t understand the status of the SAI, DAI in the bridge. I am still waiting for the step-by-step SCD shutdown report from devs or Maker Foundation as my understanding is there are issues with closing the bridge as well as other details that only pop up after shutdown so in effect we have to prepare the cake before baking it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.791666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#45",
                    "likes": "1",
                    "time": "24/03/2020-14:54:18",
                    "content": "What sites are people here using to view scd data? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#46",
                    "likes": "0",
                    "time": "24/03/2020-19:17:04",
                    "content": "That is my understanding but I am not a definitive expert on the SCD system. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#47",
                    "likes": "0",
                    "time": "24/03/2020-19:19:02",
                    "content": "mkr.tools and saistats.com ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#48",
                    "likes": "0",
                    "time": "24/03/2020-19:35:59",
                    "content": "Mhm just a heads a up I dont think mkr.tools is exactly up to date. It doesn’t shown that some CDPs have been bitten look at https://makerscan.io/cups/14509/ vs https://mkr.tools/cdp/14509 ",
                    "links": [
                        "https://mkr.tools/cdp/14509"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#49",
                    "likes": "1",
                    "time": "24/03/2020-20:15:10",
                    "content": "What I am saying is keep SCD going.  If the peg breaks, they can adjust the stability fee.  If there is a black swan event, PETH holders and SCD CDP holders take the losses- that’s the way the system is designed and PETH holders have benefited all along from the liquidation penalties.  But MKR holders benefit from SCD CDP holders paying their stability fees so that they can get access to their collateral.  The benefits of these ongoing MKR burns far outweigh the costs of keeping the SCD system running ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#50",
                    "likes": "0",
                    "time": "24/03/2020-22:35:04",
                    "content": "Well that sucks.   We need an up to date data tool for those CDPs and that system.  mkr.tools was really nice. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/scottrepreneur",
                    "index": "#51",
                    "likes": "2",
                    "time": "26/03/2020-19:29:00",
                    "content": "I don’t think the governance requirements and cognitive load of managing two systems is being considered with enough weight. If MCD is going to continue to expand collateral types, etc. then wrapping the old system should be a priority. I get that there are community members that would like to continue using their old CDP, but it’s generally not considering these costs of managing two systems in emergency scenarios. Unless we’re very heavy handed about reducing the debt ceiling, we should be looking at alternatives for removing that from governance plate. It’s unlikely the outstanding fees are enough to justify and if they are we can figure out a tax solution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.946875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#52",
                    "likes": "1",
                    "time": "27/03/2020-14:45:28",
                    "content": "Seriously.   Look at the state of the world curio.   Literally the entire world running around like chickens with heads cut off.   So please put your observations of Maker in the context of what is going on globally.  To expect the community here to be massively better at this time is like expecting Trump to turn into a real leader.  Not realistic. If you see something better - please share with us because as far as I can see there isn’t and just because Maker airs its dirty laundry for all to see should be considered a positive vs. a negative. Lets try to be civil and constructive because these are difficult times for everyone. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.879419191919192
                },
                {
                    "author_link": "https://forum.makerdao.com/u/scottrepreneur",
                    "index": "#53",
                    "likes": "0",
                    "time": "27/03/2020-16:40:29",
                    "content": "Sharing @Derek 's thread here     Sequential Process for SCD Shutdown Governance       Hi all, this post explains the sequential process for shutting down Single Collateral Dai. The process involves two executive spells; one to protect MCD and the other to shutdown SCD. I will outline what these steps are and why they are important.  A) Executive Spell 1 - Set the SAI Debt Ceiling to 0 in MCD   This action will protect MCD by preventing SAI from being swapped for DAI. This is necessary to prevent exposing MCD to SAI liquidity and/or peg fluctuations. We will continue to allow DAI …      ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.123346560846561
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#54",
                    "likes": "1",
                    "time": "28/03/2020-21:37:46",
                    "content": "Bumping for visibility. Please vote in the latest poll at the bottom of the OP. This is an important poll to decide a date for SCD shutdown. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.916666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#55",
                    "likes": "0",
                    "time": "29/03/2020-01:51:30",
                    "content": "What about lowering the SCD debt ceiling first, does anyone disagree with @MakerMan? Hes only been saying it since 'nam. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#56",
                    "likes": "0",
                    "time": "29/03/2020-03:40:53",
                    "content": "I’d double check with @cyrus but I think we’ll have a poll for reduction this week? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#57",
                    "likes": "0",
                    "time": "30/03/2020-02:42:04",
                    "content": "Keep in mind that there are over $1m in unpaid stability fees from SCD. If we shut it down, they may never be paid.   These fees directly benefit MKR holders.  Also - because of the way SCD was designed, even if there was a black swan event, MKR would not be minted to cover the deficit- so it is basically risk free income for MKR holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.377777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#58",
                    "likes": "0",
                    "time": "30/03/2020-08:08:38",
                    "content": "There’s already been some significant discussion of the owed fees in SCD under the tag. Particularly this thread. If anyone is looking for more insight into that issue, I’d suggest reading over that at some point. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-discussion-should-we-implement-a-tax-during-scd-shutdown-to-recuperate-unpaid-stability-fees/1166"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.736111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#59",
                    "likes": "3",
                    "time": "30/03/2020-16:54:27",
                    "content": "Forum polling has now concluded with Shutdown on Friday, April 24th, 2020 winning with 58% of the vote. Thank you to everyone who participated in discussion and voting. Polling now moves on chain here: https://vote.makerdao.com/polling-proposal/qmb8d1use4uzsgpjf3tbmnqfnvq1bf1mcifzlabnp58cjw I look forward to seeing the results of the on-chain poll and the evolution of this process in the coming weeks. Thanks again! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#60",
                    "likes": "1",
                    "time": "01/04/2020-01:42:41",
                    "content": "Do you remember the DAO fork? It is the time to remember the details. Developers and miners made a decision about whales money. Devs have also tried to argue to “highly experemental nature of ethereum”. It didn’t work out. Some of whales were pissed off and have supported shitstorm in media. It has created volatility, exchanges have listed both token to profit from the trading volume. Miners and devs got incentivized to support both forks. And voila! The fork has ended up in a coin split. The situation now is not very different. SAI holders and CDP owners will not like to see their money managed by devs without explicit consent given or even against it. The poll here and the voting there is BY FAR not the sufficient communication with SAI/CDP holders. They will lose the trust and will get fear. There will be enough actors who will profit from making a big thing of it. MakerDAO should not only take its own rational reasons in account, but also irrational fears of the DeFi users and efforts of those who will try to increase the volatility. Remember the DAO fork story and don’t repeat that mistakes. Otherwise MakerDAO will face a shit storm and then will get forked or cloned. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/musatheredguard",
                    "index": "#61",
                    "likes": "1",
                    "time": "01/04/2020-04:49:38",
                    "content": "What other communication is necessary in your opinion? The MKR community has been communicating for quite some time that SCD shutdown was on the table. Even the SAI page on etherscan has a prominent banner about SAI ES ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#62",
                    "likes": "1",
                    "time": "01/04/2020-06:42:38",
                    "content": "I think post on blog.makerdao.com would make sense. For me it’s the most “official” channel of communication. There could be a post with detailed explanation about increasing possibility of SCD shutdown and the process itself.  I did not notice any (i could miss it though) I hope, at least after polling concludes, there will be some post about it:  what was decided when (if ES confirmed) mechanics of shutdown etc.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#63",
                    "likes": "1",
                    "time": "01/04/2020-09:35:25",
                    "content": "    musatheredguard:  What other communication is necessary in your opinion?   Not easy, I agree. My experience, that SAI holder bought considerable amount of SAI in believe to avoid volatility just would not pay much attention to MakerDAO forum or etherscan SAI page any more. More posts on Mainstream Crypto Media (MCM) needed. If MakerDAO will not do it proactively, you will see that web pages filled by shitstorm. The news is damn important and will be covered in MCM anyway. Either by MakerDAO or by SAI whales. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.976851851851852
                },
                {
                    "author_link": "https://forum.makerdao.com/u/curiosoacerca",
                    "index": "#64",
                    "likes": "0",
                    "time": "01/04/2020-11:48:49",
                    "content": "this is going to be a hell of a shitshow… an expensive one ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#65",
                    "likes": "0",
                    "time": "02/04/2020-20:26:28",
                    "content": "Two comments:   If you bought SAI to avoid - volatility - There are better stablecoins with less volatility provided you are willing to deal with centralization.   My point here is that the idea that SAI or DAI price will be stable at all times IS COMPLETELY incorrect.   IF for any reason either system undergos a shutdown (emergency or not) the SAI or DAI (depending on the system shutdown) PEG BY DEFINITION will no longer hold.   As to communication.  I think you could actually garner a good amount of consensus on a question of whether Maker as a community (not just Maker Foundation btw) needs better media PR management including official communications.   The problem - only the foundation has a real structure that can carry out communications for itself and what it feels is important in the Maker space.  The DAO as it currently exists technically DOES NOT.   WIth regards to media ‘shitstorm’ - honestly there are multiple ‘shitstorms’ at the moment so you would have to let us know which one you are talking about. Regarding SCD and SAI system.   Literally that system is being wound down.   I will say the following if you want to follow the Maker community then follow the conference calls, participate here in forums or ask questions in rocketchat.    There are people there like myself who will happily answer questions if they can BUT NOONE can speak for governance. When will the SCD be shutdown formally?   We don’t know for sure.  Polling suggests people want to do it by end of April? What will this mean for CDP holders?   Pay back your loans or migrate.makerdao.com to migrate your loand to the MCD.   As time progresses it will get harder and harder to obtain SAI to close out your loans.   Expect the SAI price to increase and SAI liquidity to dry up. What does this mean for SAI holders?   Right now price of SAI is above PEG - last I heard 1.08 USD.  If you hold your SAI into the shutdown your SAI will redeem at maker for ETH collateral at the OSM price when shutdown occurs.  This means that technically the value of SAI will be reflected in the value of the underlying collateral.  Put simply expect SAI to trade with the vaule of ETH in USD relative to the OSM value.  IF ETHUSD price is above the OSM settlement value SAI will be worth more than $1 ETH,  if ETH USD trading below the OSM settlement value then it will be worth less than $1.   The net effect of this is that the SAI value will trade as ETH trades.  IT WILL NO LONGER BE PEGGED TO $1 - in fact it has already lost the PEG and is trading > $1.   Were I a SAI holder that simply wanted to maintain value I would exchange SAI for DAI or some other stablecoin. Will there be any fees during shutdown.   This has not been formally decided. If you want to see the steps for SCD shutdown you can look here.     Sequential Process for SCD Shutdown Governance       Hi all, this post explains the sequential process for shutting down Single Collateral Dai. The process involves two executive spells; one to protect MCD and the other to shutdown SCD. I will outline what these steps are and why they are important.  A) Executive Spell 1 - Set the SAI Debt Ceiling to 0 in MCD   This action will protect MCD by preventing SAI from being swapped for DAI. This is necessary to prevent exposing MCD to SAI liquidity and/or peg fluctuations. We will continue to allow DAI …     ",
                    "links": [
                        "https://forum.makerdao.com/t/sequential-process-for-scd-shutdown/1823"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.520247113997114
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#66",
                    "likes": "0",
                    "time": "02/04/2020-22:19:06",
                    "content": "    MakerMan:  My point here is that the idea that SAI or DAI price will be stable at all times IS COMPLETELY incorrect. IF for any reason either system undergos a shutdown (emergency or not) the SAI or DAI (depending on the system shutdown) PEG BY DEFINITION will no longer hold.     The promise is not the DAI or SAI stability at any time. The promise, it returns to $1 peg after some reasonable time. For long term SAI/DAI holder “reasonable time” may be days.   ES is not just “system shutdown”, ES is “Emergency Shutdown”. The emergency is not given now. Thus the shutdown needs broad discussion and really good justification and public risk analysis. Both are missing currently, IMHO.   If MakerDAO makes the broader public think, it shutdowns the SAI not because of emergency but just for own profit, it will destroy the trust.  The worse, the more money people will lose because of forced SAI->ETH conversion. ES without emergency breaks both promises of stability and decentralization at the same time. The MakerDAO fork (clone) with fixed governance will come as the answer. Remember the chain of incentives lead to TheDAO coin split, and you will see similarities. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.34765625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#67",
                    "likes": "0",
                    "time": "02/04/2020-22:22:28",
                    "content": "    MakerMan:  Right now price of SAI is above PEG - last I heard 1.08 USD   just had a look at uniswap: 1.01 USD ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.476190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#68",
                    "likes": "0",
                    "time": "02/04/2020-22:26:06",
                    "content": "    MakerMan:  Expect the SAI price to increase and SAI liquidity to dry up.   Will DAI face similar liquidity and peg problems in the future? If not, what is the difference? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.888888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#69",
                    "likes": "0",
                    "time": "02/04/2020-22:38:22",
                    "content": "That statement was in the context of shutting down the SCD because by the nature of the proces at least in the SCD all SAI minted is tied to CDP borrowers.   Practically all SAI minted will not be returnable to pay down debt so there will be a liquidity shortage for this and many other reasons. Will DAI face similar liquidity issues.  It already is with the DAI price floating at 1.02 USD currently.  Is the reason the same given minting can still happen in both systems.  Right now any answer is speculative because the data for the ‘reason’ the PEG is high is limited and that the MCD/DAI system is still ‘open’ to grow so to speak. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.062806637806638
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#70",
                    "likes": "1",
                    "time": "02/04/2020-23:43:44",
                    "content": "    ethernian:   The promise is not the DAI or SAI stability at any time. The promise, it returns to $1 peg after some reasonable time. For long term SAI/DAI holder “reasonable time” may be days.    The promise.   I have been wondering where all the Maker ‘promises’ are in documents because I am kind of wanting to see them to understand what has been promised to the greater community by Maker (whether this is Foundation or DAO governance).  Stable coins often have ‘redemption’ points where the redemption value is guaranteed to be $1 by some centralized entity.  There is no such guarantee within the Maker system.   Hence while the ‘goal’ of the community is to have the PEG return to $1 after ‘some’ time it is NOT guaranteed.     ethernian:   ES is not just “system shutdown”, ES is “Emergency Shutdown”. The emergency is not given now. Thus the shutdown needs broad discussion and really good justification and public risk analysis. Both are missing currently, IMHO.    I have argued the whole ‘emergency’ part of the shutdown mechanics is relevant only to circumstance.  For all intensive purposes the ES machinery IS the only shutdown machinery the circumstances determine if it was an Emergency, a malicious act, or Governance shutdown.  In either case the SAME machinery and effectively the same result occurs.  Now in the case of governance a spell could be cast to trigger the ES and have other things happen either before or after this trigger so in some sense the actual shutdown mechanics are different from Malicious Actor, or in response to an Emergency. As to shutdown being a broad discussion.   Maker already has work going on which will lead to a discussion of ‘conditions’ for when to use the ES as well as what happens from a risk scenario analysis during an ES.   Yes these and a whole bunch or other things are missing generally. On that we agree.     ethernian:  If MakerDAO makes the broader public think, it shutdowns the SAI not because of emergency but just for own profit, it will destroy the trust.  The worse, the more money people will lose because of forced SAI->ETH conversion.   The whole first sentence is simply speculative.  Maker community has been pretty clear since release of MCD that the SCD would be shutdown.   I have been one of the few voices suggesting to keep it open but to simply reduce the DC and increase the SF to urge people out of it - while providing sufficient SAI liquidity or mechanics for people to close.  Literally if Maker waits for more people to close we make more DAI doing that than closing it now.   As to forced SAI-ETH conversion - NOONE is forcing SAI holders to keep their SAI.   I know for a fact there are a lot of people holding SAI just so they can get a ETH conversion option.   If anyone is holding SAI now that isn’t paying down a CDP and the fact that SAI price is significantly > 1 is gambling, speculating, or uninformed.  To believe the system will just be kept open indefinitely AND for Maker to keep its promises for all eternity is just wishing and believing vs. scientifically observing the facts.     ethernian:  ES without emergency breaks both promises of stability and decentralization at the same time. The MakerDAO fork (clone) with fixed governance will come as the answer. Remember the chain of incentives lead to TheDAO coin split, and you will see similarities.   Anyone who ever thought Maker governance was ‘decentralized’ only had to look at the holders of MKR and governance voting.   While the GOAL is decentralization - governance is centralized to MKR whales.   At ANY time anyone can fork Maker SCD or MCD but unless they actually change how governance works they will still have the same system.  I don’t see that ETC actually did anything better than ETH.  Literally the fork was strictly political and based on financial interests plain and simple.   Right now while anyone can fork the protocol and I don’t see how such an event will help current SAI/DAI holders.   Who exactly are the folks that are magically going to come together to then provide the financial backstop to the new protocol?   What guarantees are they going to give and how would anyone know whether they could trust these new players any more than Maker. With the above in mind I agree with you on a number of counts.  MakerDAO needs to communicate better. a) About promises regarding any financial backstop with MKR governance/financial tokens, and promises period as well as the responsibilies of DAI holders, vault owners, governance, MKR holder, etc. b) About conditions for shutdown.  Given what i have seen what we really want is to minimize the cases where any shutdown is considered.  This is one of my personal goals with this protocol - but I am but a single small actor and I don’t think this surface will ever close to 0 area. Improve the protocol to stabilize and secure it against bad actors with significant financial resources and time. Alter the protocol so that its functions are more robust and rather than drive the market reflect the market. Make this system sustainable - that fees pay for system operations, build a reasonable surplus for emergencies, provide for creation of backing capital pools to insure against risk events and create additoinal liquidity creation and removal mechanisms.  It is my hope that more people rather than harping about how the system has failed them, or how it should change, or whatever negative machinations they want to posit - roll up their sleeves and find a way to cooperatively help to change this system for the positive. My general goal - for Maker to be the first decentralied bank for the entire world - and we need all hands on deck not just complaining about failures - but helping to document them - change them - together. Is it a truism that a completely transparent organization will both have the best and worst results because, being completely transparent means every failure is open to public scrutiny and opinion far and wide, while sucesses undergo unceremonious and unthankful acceptance. These are tough times for the entire world, Maker is not excluded it is my hope we find constructive positive ways to move forward rather than descend into negative destructive ones. BTW:  I have earned not .01DAI for any of my contributions to Maker over the past 6 months.  I am not paid to be here.  So far I choose to be because I don’t see anyone even trying anything better.   The same is true to me of ETC vs. ETH.  I choose ETH over ETC simply because I see more real work going on within the Ethereum Community vs. the ETC one.   Are there issues with all of these protocols.  ABSOLUTELY.   But I see this as a work in progress inspired by a number of actors over a long time culimnating with S. Nakimoto releasing Bitcoin solving a pretty hard problem applying PoW to ‘trust’ regarding a public ledger (that individual did not create this in a vacuum - the entirety of Bitcoin).  I believe if that if we apply work to this system as well as time to derive ‘experience’ we - you - I - and everyone else in these systems might actually change the world yet again - hopefully in ways that make it better for all of us in the long run. I think we stray off the OT from the OP but I think it these concepts are important to discuss generally. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.394586622527799
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#71",
                    "likes": "0",
                    "time": "03/04/2020-00:18:26",
                    "content": "Thank you for your time and your great answer!     MakerMan:  At ANY time anyone can fork Maker SCD or MCD but unless they actually change how governance works they will still have the same system.   MetaCoin proposes governance rights for all “MKR”,“CDP” and “DAI” holders. That would avoid unilateral ES by MKR holder only. ==== I would not dive deeper into the dispute, because most arguments are indeed subjective and speculative. At the end, the only thing that counts is the public opinion about the ES, not the discussion here. Most important arguments pro and contra are already on the table. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#72",
                    "likes": "0",
                    "time": "03/04/2020-00:23:18",
                    "content": "I think discussion is important.  What I also think is interesting that comes from this is an idea of maybe another group could take over SCD, dupe the MKR and let that community move on.   Honestly think it is an interesting idea really.   What I can say is the community and group now working with Maker generally would rather move on.  This isn’t a money issue but more a practical one. Put simply a lot of people work on Maker and the protocol is not self sustainable ‘yet’ we have a lot of things we want to do and really want to focus on a single system. I think I pointed out the whole ES name to the thing was wrong.  It should be the shutdown system - get rid of the whole emergency aspect unless the shutdown was activated in response to an emergency. My questions for you are as follows:  If you don’t think the SCD should shutdown - what would you like to see be done with the SCD? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.068681318681319
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#73",
                    "likes": "0",
                    "time": "03/04/2020-00:50:47",
                    "content": "    MakerMan:  If you don’t think the SCD should shutdown - what would you like to see be done with the SCD   I would prefer to see both systems running because people use it. I suppose there are two problems with SCD, preventing liquidations from working properly while market is crashing.  MCD offers better conditions to the keepers than SCD at the crash time (at the costs of CDP holders). SAI long-term holders HODL too much SAI liquidity comparing to the collateral locked.  Both problems are not really SAI specific:  The MCD can face the same problem if there will be another “MakerDAO” - if it will offer better conditions for keepers, nobody will buy liquidated ETH. If too much DAI get hard-locked in various HODL-reserves, there will be similar liquidity problems like the SCD has now.  I think, SAI ES hides real problems without solving it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#74",
                    "likes": "0",
                    "time": "03/04/2020-01:02:35",
                    "content": "    ethernian:  I would prefer to see both systems running because people use it.   This statement doesn’t seem consistent with points you made below.     ethernian:  I suppose there are two problems with SCD, preventing liquidations from working properly while market is crashing.  MCD offers better conditions to the keepers than SCD at the crash time (at the costs of CDP holders). SAI long-term holders HODL too much SAI liquidity comparing to the collateral locked.    Could you elaborate a bit on the above as I don’t understand why you think MCD offers better conditions than SCD during a crash.  If you mean better liquidation prices then I can see how Vault holders would do better to CDP holders but it is not immediately obvious to me from above.     ethernian:  Both problems are not really SAI specific:  The MCD can face the same problem if there will be another “MakerDAO” - if it will offer better conditions for keepers, nobody will buy liquidated ETH. If too much DAI get hard-locked in various HODL-reserves, there will be similar liquidity problems like the SCD has now.    This is where basically my first comment is targeted.  If you see same problems in both systems why would you think having both of them around helps?   I just see that it spreads the same problem jam on different toast.     ethernian:  I think, SAI ES hides real problems without solving it.   I think here is where the real rub is.   Are you talking about problems above or some other problems?  If something other than what you describe above could you elaborate? I really want to understand what is rubbing you the wrong way here.  I mean if this rub is in both systems and is related to the possibility of shutdown ( emergency or not) what exactly do you suggest/propose as an alternative that doesn’t involve a system shutdown? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.537162162162162
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#75",
                    "likes": "0",
                    "time": "03/04/2020-11:18:18",
                    "content": "    MakerMan:  Could you elaborate a bit on the above as I don’t understand why you think MCD offers better conditions than SCD during a crash.   correct me if I am wrong, SCD offers collateral at the fix 3% discount and MCD uses auctions. During the crash flip auctions should give more than 3% discount because of price expectations. So the rational keeper will move to MCD. I have not validated the theory yet.     MakerMan:      ethernian:  I think, SAI ES hides real problems without solving it.   what exactly do you suggest/propose as an alternative that doesn’t involve a system shutdown?   I am not the MakerDAO dev. I am a user, I don’t know. But anyway the ES should the solution of last resort. I am missing attempts to heal SCD with conventional governance tools. They didn’t work? Why? Any fix possible? No? Why? The should be public analysis what is wrong with SCD and visible attempts to heal it. I see only attempts to kill it. It makes me think. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.252232142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#76",
                    "likes": "0",
                    "time": "03/04/2020-11:33:12",
                    "content": "    MakerMan:  Are you talking about problems above or some other problems?   IMHO, the root cause is very simple. In order to maintain the collaterization rate, the system needs to reduce the total DAI/SAI supply on falling markets because the total collateral value is going down. But there is nothing that could make SAI/DAI HODLers sell their coins on falling markets because it is exact why they have bought it. Any Maker-like system will face similar problems if the total amount of DAIs HODLed is too big for the total collateral locked. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.986111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#77",
                    "likes": "0",
                    "time": "03/04/2020-13:58:52",
                    "content": "I think your being a little unfair with this whole things, well maybe not unfair, but unrealistic. For instance when a blockchain upgrades their codebase, some miners might want to stay with the old one for a variety of valid reasons. Generally the majority go with the upgrade, hoping for more growth/revenue. MKR holders could be thought of as miners here since they hold the formal authority over the system. Instead of switching resources between both “chains” (MCD/SCD) they would rather focus resources on the one with the greatest potential for growth (growth=profit +power for MKR holders). Thats really it, I dont see any other intentions. Also anyone that thinks the Maker protocol is a public good needs to examine what formally authority controls the value locked into the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.602678571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ethernian",
                    "index": "#78",
                    "likes": "0",
                    "time": "03/04/2020-17:50:04",
                    "content": "    Mitote:  I think your being a little unfair (…) unrealistic. MKR holders (…) they would rather focus resources on the one with the greatest potential for growth (growth=profit +power for MKR holders).   May I sum up? “We’ll take your money for own profit and power but you can be proud of the great system we will build of it.” – that could be speech of a banker or politician. I don’t think I am unrealistic. The governance including both MKR+CDP+DAI holder is already proposed. The fork project is doable. The only thing missing is the market opportunity, and it will come if MKR whales will ignore other users of the system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.494791666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#79",
                    "likes": "1",
                    "time": "23/04/2020-12:05:13",
                    "content": "I feel that this thread has run it’s course at this point. Further signals are present in other threads and the conversation continues elsewhere. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#80",
                    "likes": "0",
                    "time": "30/04/2020-12:11:30",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1459"
}