{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/double-the-speed-of-the-governance-cycle/11276",
            "title": "Double the speed of the governance cycle? ",
            "index": 11276,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "1",
                    "time": "28/10/2021-23:09:53",
                    "content": "The monthly governance cycle made sense when it was like pulling teeth to get people to vote. With the potential professionalization Recognized Delegates, is it time to start thinking about a shorter, more agile and responsive governance cycle? A two week cycle? Your thoughts? ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-should-we-trial-delegate-compensation-as-described-in-mip61-over-3-months/10978",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-28th-november-4th/11441"
                    ],
                    "GPT-summary": "The author of the post is proposing a shorter, more agile and responsive governance cycle and is asking for feedback on the idea. A 3rd party could give constructive criticism on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "1",
                    "time": "28/10/2021-23:26:12",
                    "content": "God no.   People have lives and certain elements of the cycle already are too short (polls lasting only 2-3 days for example).   Also to vote people have to be informed. Tell me what exactly does governance get by doubling the governance cycle?  I am already somewhat daunted by the sheer weight of forum discussions, proposals, cc’s you name it just trying to keep up as compared to 1 year ago now.  Imagine what the forums and governance is going to look like 1 year from now?. Other thoughts… How will this factor into executives via the GSM delay that we were considering extending to 4 days. I have heard if the system has issues governance already has mechanisms to ‘fast track’ issues. What is precisely the problem we would be trying to solve here and my signature question. What measurement metric(s) will the community apply to determine if we ‘improved’ anything making such a change?   Such measures should include subjective measures of the people involved on whether such a change is better or worse.    Perhaps we should 1/2 the speed of the governance cycle vs. 2x it. If there was anything I would want it would be a governance importance weighting function to show me how important things are to consider/deal with or move because I can see governance getting so packed that no-one will be able to follow everything here at some point.    We have how many CUs now?   This was one thing I wondered about do we have a graph of number of on-chain polls over time?   Same with executives?   Really we should look at this data before even making a suggestion of how to change the governance timelines. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.677579365079365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "0",
                    "time": "28/10/2021-23:45:55",
                    "content": "    MakerMan:  People have lives   Sure, but Recognized Delegate could potentially coordinate to distribute the workload. For example, if we had delegates A, B, and C who were tasked with looking at proposals 1, 2, and 3 then A & B could team up on 1, B & C could team up on 2, and A & C could team up on 3. I’m just thinking about ways to reduce the bottlenecks. We have a unique governance system here. Let’s see how far we can push it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.21875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "2",
                    "time": "28/10/2021-23:52:17",
                    "content": "I would argue against. We have a fast governance cycle (weekly) and a slow governance cycle (monthly). The combination lets us do things quickly or robustly depending on the urgency and importance of each item. It also has the non-trivial advantage of aligning to the calendar everyone uses. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.388888888888888
                }
            ]
        }
    ]
}