{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - OST-1 (UPRETS Oosten Fund I LP) - October 19, 2020",
            "index": "4438",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "5,701",
            "highest_fraction": 0.53
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ost-mip6-collateral-onboarding-application-by-uprets-real-estate-backed-digital-security/4438",
            "title": "[OST] MIP6: Collateral Onboarding Application by UPRETS Real-Estate Backed Digital Security ",
            "index": 4438,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "real-assets"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/UPRETS_Real_Estate",
                    "index": "#1",
                    "likes": "3",
                    "time": "28/09/2020-01:44:56",
                    "content": "Hello everyone, This is our proposal to include OST as a collateral asset.  Who is the interested party for this collateral application? The asset originator, New Dawn US, is represented by Ryan([email protected], Managing Partner at New Dawn) and Jake([email protected], Managing Partner at New Dawn).  UPRETS is providing the digital security issuance technology and framework for bringing real estate assets to MCD. The main contact for the application is Ran Wei ([email protected]) of UPRETS as well as Wesley Ma([email protected]).  Provide a brief high-level overview of the project, with a focus on the applying collateral token. OST is asset-based digital securities based on advanced digitalization technology designed for global real estate investors and blockchain enthusiasts. With offices in New York, Dubai and Beijing, entwined with its extensive range of strategic partnerships, the international digitalization platform UPRETS aids in developing the non-fungible tokens to create a legally compliant real estate financial product available for investors with revolutionary spirits. Secondary trading on MERJ Exchange further facilitates KYC/AML, market assurance and trading liquidity. For more information, go to Global Real Estate Digitalization and Trading Platform | Uprets.io.  OST-11008×560 704 KB    The Omnilayer & self-owned patented consortium chain Xbolt secures the OST digital securities structure and its compatibility to mainstream public chain and secondary exchanges and enables support payment with FIAT and BUSD. The ownership is issued to investors in a robust, secure and trusted digital securities form to accumulate steady dividends at a steep discount, which there will always be a demand for global real estate investors.  OST-1 process1005×550 72 KB    Provide a brief history of the project. OST is the phase I legally compliant digital securities of the Oosten project, corresponding to the limited partnership interest of UPRETS Oosten Fund I LP, a real estate fund company located in Delaware, USA that holds the apartment No.730. UPRETS Oosten Fund I LP was completed through private equity investment on March 13, 2020, in compliance with the U.S. SEC’s Reg D and S standards, and simultaneously issued 100 million corresponding OST digital securities through the digitalization technology platform, UPRETS, and was listed on the MERJ Exchange on June 5, 2020, and opened the first transaction on June 25, 2020.  fund structure1004×556 45.5 KB    Link to the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. Website：uprets.io   Link any available audits of the project. Both procedural and smart contract focused audits. Audited by EY.   Link to any active communities relating to your project. LinkedIn: https://www.linkedin.com/company/uprets2019 Facebook: fb.me/uprets2019 Twitter: https://twitter.com/uprets_io Medium: UPRETS – Medium   How is the applying collateral type currently used? Our collateral which is the OST Digital Securities represents the limited partnership interest in UPRETS Oosten Fund I LP that is being traded on MERJ Exchange and used for enjoying the steady dividend return of the rental revenue and value appreciation of the underlying asset. We have taken the real estate property digitalized with our UPRETS integrated digitalization resolution that activates its liquidity and ensures its security and manageability. The value of each token is firmly backed-up by the assets, and determined by the current price on the MERJ Exchange.   Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? UPRETS Oosten Fund I LP, which was registered and in legal compliance with the U.S. SEC’s Reg D and S standards, which are securely developed based on the Xbolt consortium chain that regulatorily issued on the Omnilayer, bear the legal responsibility for the collateral. Involved third-party law firms, which include Baker&McKenzie, O’Melveny&Myer and Dahui, will ensure the documentation and any related legal circumtances’ rights and liabilities.  legal docs1011×524 105 KB    Where does exchange for the asset occur? OST was listed on the MERJ Exchange on June 5, 2020, with an initial market value of US$1 million and an initial price of US$0.01 per OST. Investors who have obtained digital securities through first-level fundraising have successively transferred their OST to MERJ, and conducted the first transaction on June 25, 2020.   MERJ Exchange is the only registered exchange in the Seychelles. As a regulated market, MERJ Exchange is regulated by the Seychelles Financial Services Authority and the Central Bank of Seychelles that follows the same exchange standards as other mainstream exchanges, for instance, LSE, NYSE, Nasdaq, CBOE and CME. MERJ is a member of the National Numbering Agency (a joint organization that includes central banks, mainstream exchanges and monitoring agencies) and is the only token exchange among them. MERJ is also an affiliate member of the World Federation. As of July 16, 2020, MERJ has listed 43 securities. Since its listing, OST has achieved eight transactions and the bilateral transaction volume has reached 298,924 tokens.   (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review.  SEC register1175×547 55.8 KB    (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable.   OST is a private offering by UPRETS Oosten Fund I LP, a Delaware limited partnership (the “Partnership”), of securities limited partnership interests (“LP Interests”) in the Partnership made in reliance on Regulation S (“Regulation S”) under the United States Securities Act of 1933, as amended (the “Securities Act”), solely to non-U.S. persons (as defined in Regulation S) who are outside of the United States (the “Regulation S Offering”). The limited partnership interests are expected to initially be issued in book entry form. At the election of the holder, the Partnership expects to tokenize the LP Interests in the form of uncertificated digital securities prior to the expiration of a distribution compliance period (in tokenized form, a “Token”, and LP Interests in book entry or Token form, a “Security”). The Partnership is a newly organized Delaware limited partnership with no operating history and no material assets. The general partner of the Partnership is New Dawn US LLC, a newly formed Delaware limited liability company (the “General Partner”). Concurrently with the Regulation S Offering, the Partnership may undertake a private offering of Securities in reliance on Regulation D under the Securities Act (“Regulation D”) solely to U.S. persons (as defined in Regulation S) who are accredited investors (as defined in Regulation D) and who are in the United States. Concurrently with the closing of the Regulation S Offering, UPRETS Oosten Property I LLC (“Oosten LLC”), a Delaware limited liability company and wholly-owned subsidiary of the Partnership, will purchase a one bedroom condominium unit (the “Property”) in a condominium development in the Williamsburg neighborhood of Brooklyn, New York, USA. OST Digital Securities have not been and will not be registered under the Securities Act of 1933, as amended, or any other law or regulation governing the offering, sale or exchange of securities in the United States or any other jurisdiction. The securities offered in the Regulation S offering may not be offered or sold in the United States or to or for the account of U.S. persons (as defined in regulation S under the Securities Act) except pursuant to an exemption from the registration requirements of the Securities Act. This Regulation S offering is being made solely to persons who are not located in the United States and who are not U.S. persons (as defined in regulation S under the Securities Act) in reliance on Regulation S under the Securities Act. The issuer has not been, and will not be, registered under the investment company act of 1940, as amended. No offers or sales of OST digital securities will be made in the People’s Republic of China or to PRC nationals or in any other jurisdiction where is its unlawful to sale or own the securities.   (Optional) List any possible oracle data sources for the proposed Collateral type.   (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type. There will be two options depending on the volume: a)\tLow to mid volume: The liquidation will be in addition to the above directed towards preferred global real estate investors and blockchain tech enthusiasts. b)\tMid to high volume: The liquidation will be through MERJ Exchange：https://merj.exchange/. c）   DeFi: Use OST as the collateral and get liquidity in the FAN system: http://fan.finance   ",
                    "links": [
                        "http://uprets.io",
                        "https://www.linkedin.com/company/uprets2019",
                        "http://fb.me/uprets2019",
                        "https://twitter.com/uprets_io",
                        "https://medium.com/uprets",
                        "https://merj.exchange/",
                        "http://fan.finance",
                        "https://forum.makerdao.com/t/maker-relay-ep-18-en-espanol/4882",
                        "https://forum.makerdao.com/t/maker-relay-ep-17-pt-br-portugues/4810",
                        "https://forum.makerdao.com/t/maker-relay-ep-17-en-espanol/4804",
                        "https://forum.makerdao.com/t/maker-relay-ep-17/4798",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/72",
                        "https://forum.makerdao.com/t/rwa-last-2-months-review-updates-and-looking-forward/5225",
                        "https://forum.makerdao.com/t/rwa-resena-de-los-ultimos-dos-meses-actualizaciones-y-lo-que-viene/5272",
                        "https://forum.makerdao.com/t/solarx-mip6-application-uprets-solarx-industrial-real-estate-backed-loans/6718",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-115-thursday-october-22-16-00-utc/4757/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-18-pt-br-portugues/4891",
                        "https://forum.makerdao.com/t/maker-relay-ep-18/4881"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Board composition",
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.322826004404952
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "2",
                    "time": "28/09/2020-07:24:12",
                    "content": "Hi @UPRETS_Real_Estate  and welcome to the community! As far as I can tell this is not a New Silver or a DROP collateral application so maybe we will start with a small correction to the collateral application header. The header should read: [OST-1] MIP6: Collateral Onboarding Application Sorry for the nitpicking but this is just so we are able to tell all the applications apart. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.022727272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/UPRETS_Real_Estate",
                    "index": "#3",
                    "likes": "0",
                    "time": "29/09/2020-01:29:13",
                    "content": "    Planet_X:  [OST-1] MIP6: Collateral Onboarding Application   Sure，will change the tile. What about [OST-1] MIP6: Collateral Onboarding Application by UPRETS Real-Estate Backed Digital Security ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "3",
                    "time": "29/09/2020-08:25:12",
                    "content": "Welcome @UPRETS_Real_Estate, Just a couple of questions if I may  Is you token on Ethereum? If yes, what is the address? If not (Omni is not supported I think) is there plan to use Ethereum in the future? How do you see your asset under management grow? With only one asset and 1M under management, it’s not easy to integrate with Maker from a risk perspective.  Anyway, the project looks promising. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.783333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "0",
                    "time": "05/10/2020-20:40:08",
                    "content": "    SebVentures:  Is you token on Ethereum? If yes, what is the address?   I’d also like to see an answer to this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/UPRETS_Real_Estate",
                    "index": "#6",
                    "likes": "0",
                    "time": "09/10/2020-01:21:36",
                    "content": "Yeah, on Ethereum ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/UPRETS_Real_Estate",
                    "index": "#7",
                    "likes": "0",
                    "time": "09/10/2020-02:12:01",
                    "content": "Thanks for your questions,  Our OST-1 digital securities that are tradable on MERJ(secondary market) are issued on Ethereum, the address is 0x6cF9Cc747026945654b596a6a14a675347C2FD70, you may check it our on Etherscan: https://etherscan.io/address/0x6cF9Cc747026945654b596a6a14a675347C2FD70   屏幕快照 2020-10-09 上午9.51.071192×554 85.9 KB  As a global digital securities issuance platform, our mission is to onboard more and more real assets around the globe on blockchain. The 1 M USD worth of OST-1 is our first project while there are over 100 million USD worth of real assets in the pipeline(expected to tokenize 100 M+ in 3 years). You may check out our pipeline projects here: uprets.io.  Backed up by listed real estate conglomerate: NYSE:XIN, we are now providing service to its commercial and residential properties such as Oosten II,Tenth Ave, etc. Meanwhile, we are also exploring tokenizing other financial assets such as debts, LP interests of fund, CMBS, ABS, etc for our clients, investors and strategic partners such as E-house, Resolute.fund and NEO ecosystem. ",
                    "links": [
                        "http://uprets.io"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.701388888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lucasmanuel",
                    "index": "#8",
                    "likes": "0",
                    "time": "14/10/2020-13:43:01",
                    "content": "Hi @UPRETS_Real_Estate, Can your team please verify the contracts on Etherscan at https://etherscan.io/address/0x6cF9Cc747026945654b596a6a14a675347C2FD70? The smart contracts team needs access to the verified contracts to do our evalutations. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1607142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/UPRETS_Real_Estate",
                    "index": "#9",
                    "likes": "0",
                    "time": "19/10/2020-01:56:04",
                    "content": "Yes, this contract address is right. https://etherscan.io/address/0x6cF9Cc747026945654b596a6a14a675347C2FD70 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/UPRETS_Real_Estate",
                    "index": "#10",
                    "likes": "0",
                    "time": "19/10/2020-02:47:15",
                    "content": "    lucasmanuel:  The smart contracts team needs access to the verified contracts to do our evalutations.   Could you give me an email address? will send the OST-1 contract to you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lucasmanuel",
                    "index": "#11",
                    "likes": "1",
                    "time": "19/10/2020-22:12:17",
                    "content": "Hi there, can you verify on Etherscan using this link? https://etherscan.io/verifyContract?a=0x6cF9Cc747026945654b596a6a14a675347C2FD70. Please let me know if you need any help! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#12",
                    "likes": "1",
                    "time": "20/10/2020-02:19:31",
                    "content": "Well this is quite interesting and signals that we are on the cusp of some massive innovation in regards to raising liquidity for real estate and real world assets in general. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/UPRETS_Real_Estate",
                    "index": "#13",
                    "likes": "0",
                    "time": "20/10/2020-06:10:12",
                    "content": "Thanks for your interests! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lix",
                    "index": "#14",
                    "likes": "4",
                    "time": "20/10/2020-14:06:42",
                    "content": "  Need a green check mark for your “private offering” token on etherscan or you will get a NO from me. Full stop.   I’d like to see a green check mark on this contract that you referenced as a source of liquidity (fan.finance): https://etherscan.io/address/0x7ce47533c12bfd83087bab7b4695c4b58ea97ea1#code Why does fan.finance only have 223 USDT in the contract? Do I have the correct contract? Perhaps I am mistaken.   You mentioned https://merj.exchange/exchange/market/listings/ It shows the OST-1 of having a market cap of 1.1M. When you say “mid to high” volume, can you provide some numbers on trading activity? How much liquidity is available at 2% market depth? Etherscan shows only 3 addresses hold OST-1.   ",
                    "links": [
                        "https://merj.exchange/exchange/market/listings/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3549999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/UPRETS_Real_Estate",
                    "index": "#15",
                    "likes": "1",
                    "time": "22/10/2020-02:32:53",
                    "content": "Thanks for your questions, which are really insightful. 1) For the “Private Placement” part, you may check out the OST-1 on omni explorer: https://omniexplorer.info/asset/761 1-Omni ost-11068×551 65.1 KB 3-Omni ost-11069×543 83.2 KB Since OST-1 are not utility tokens, but rather digital securities representing the LP interests of the real estate fund UPRETS OOSTEN FUND I LP (Delaware), there were 2 steps to distribute the digital securities to the investors. First step, we finished the “Private Placement” of OST-1.The Private offering consists of an offer of LP Interests to Non.US person(a LP from Hongkong), pursuant to Regulation S under the Securities Act of 1933. We have issued the registered asset OST-1 on omnilayer and also signed a set of legal documents such as Private Placement Memorandom and LPA with the LP to make sure that OST-1 is representing the ownership of LP interests, both legally and technically.    Next step, we liquidize the OST-1 tokens owned by the Hongkong LP by listing them on MERJ exchange. MERJ Exchange Limited, formerly Trop-X (Seychelles) Limited, was incorporated in the Republic of Seychelles in 2011. The exchange went live in 2012. MERJ Exchange Limited is the operator of MERJ Exchange, the only licensed securities exchange in the Republic of Seychelles. MERJ has established and administers rules for the listing, trading, clearing and settlement of securities and other financial instruments. 2)Since MERJ exchange only support the digital securities with ERC20 protocol, we then issued OST-1 with ERC20 standard. Our tech team is verifying the contract on Etherscan, will get back to you soon. 3)You may check out the trading volumn on here.https://www.uprets.io/#/events/merj. We agree that the trading column on security exchange is relatively lower than Utility tokens which are traded on major crypto exchanges. This is a common problem for real world assets and security tokens. However, since OST-1 represents real estate asset, the price of real estate is not as fluctuated as cryptos(BTC,ETH). As the collateral provider, we will provide other liquidization solutions aside from onchain auctions, such as buyback the OST-1 tokens. To onboard real-world assets as collateral in the MakerDAO system, the liquidation and settlement is always a big issue. We wish to explore with the MakerDAO community. ",
                    "links": [
                        "http://Non.US",
                        "https://www.uprets.io/#/events/merj"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.247858044733045
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#16",
                    "likes": "3",
                    "time": "22/10/2020-10:12:57",
                    "content": "    UPRETS_Real_Estate:  We agree that the trading column on security exchange is relatively lower than Utility tokens which are traded on major crypto exchanges. This is a common problem for real world assets and security tokens. However, since OST-1 represents real estate asset, the price of real estate is not as fluctuated as cryptos(BTC,ETH). As the collateral provider, we will provide other liquidization solutions aside from onchain auctions, such as buyback the OST-1 tokens. To onboard real-world assets as collateral in the MakerDAO system, the liquidation and settlement is always a big issue. We wish to explore with the MakerDAO community.   If you plan to have OST-1 on Maker while the token is still illiquid (something like daily transaction volume < expected vault debt ceiling), the onboarding will indeed be more custom that other assets. We are already working on real estate onboarding with New Silver and 6S Capital. For real world assets, the current expected way of doing things is to create a SPV where investors (including the asset originator) are providing equity and Maker is providing debt (leverage). The asset part will be OST-1 tokens. We use a look-through method to assess the collateral ratio. The SPV can be a smart contract in your case. It’s more or less doing a REIT in this case. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp4-declaration-of-intent-commercial-points-off-chain-asset-backed-lender-to-onboard-real-world-assets-as-collateral-for-a-dai-loan/3914"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3563054009482585
                },
                {
                    "author_link": "https://forum.makerdao.com/u/UPRETS_Real_Estate",
                    "index": "#17",
                    "likes": "0",
                    "time": "05/11/2020-06:42:41",
                    "content": "We are looking forward to collaborating with New Silver and 6S Capital. Could you introduce their team to us? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#18",
                    "likes": "0",
                    "time": "05/11/2020-09:32:19",
                    "content": "Hi, had sent you a private message 2 weeks ago, you might have missed it. Just send me your email address (or anything) and I will reach you so we can discuss the matter and move things forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#19",
                    "likes": "0",
                    "time": "02/05/2022-04:46:46",
                    "content": "Dear @UPRETS_Real_Estate , The process for MIP6 applications for off-chain collateral, so called real-wold assets, has been under significant review by the teams involved in collateral onboarding (RWF, CES, Growth and incubating LTS and LOVE). See more for collateral onboarding process. The goal of this process update is to provide MKR tokenholders and respective delegates a comprehensive view of MIP6-RWA applications from a credit, legal and technology perspective so tokenholders can make a more informed decision before moving applications through the execution of the onboarding process after greenlight. As part of this review, MIP67 and the underlying Methodology for structured finance transactions were written to provide applicants with a more comprehensive set of guidelines and requirements so MIP6 applications are fit for purpose and closer to a state where they could be executed, if prioritised by tokenholders during polls. MIP67 is now part of the MIP6 process. It is designed to fill the gaps in the MIP6 application for RWAs. Our domain team is aligned to the approved MIP67 process and Methodology. We are asking MIP6-RWA applicants to express whether they will retrofit their MIP6 applications in line with MIP67/Methodology guidelines. We ask applicants to express their intention by Mon 9 May at 12pm UTC. The collateral application template is located here: MIPs Portal. Status of MIP6 applications that do not express their interest by 9 May will be considered “withdrawn” from a MIP6 collateral onboarding point of view by the aforementioned Core Units and reflected in the CSI. We understand that once applicants express their intentions, there will be a period for drafting and updating documentation of the newly proposed MIP6 applications. Our teams will be available to provide guidance to applicants during this time. Kind regards, William. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip67-methodology-and-review-process-for-structured-finance-transactions/13737",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://vote.makerdao.com/polling/QmWt5fov#vote-breakdown",
                        "https://mips.makerdao.com/mips/details/MIP6#component-summary",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.713068181818182
                }
            ]
        }
    ],
    "group_index": "2775"
}