{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/article-makerdao-members-shoot-down-proposal-for-more-centralization/16311",
            "title": "Article: MakerDAO members shoot down proposal for more centralization ",
            "index": 16311,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "vote-participation",
                "governance",
                "decentralized"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#1",
                    "likes": "2",
                    "time": "04/07/2022-12:11:35",
                    "content": "Well the press picked up on last week’s carnage. As per the article, “The rejection of these proposals combined with the historic voter turnout indicates that MakerDAO members may strongly prefer a properly decentralized model of governance, setting a strong precedent for other decentralized finance (DeFi) protocols.” In my opinion (not legal advice) we have to keep in mind that in order to grow, as regulations are further promulgated all over the world, there will be a time when defi DAOs will have to adapt. This article does not really touch upon that point but going forward, there will need to be a balance between decentralization and compliance. I think we need to be prepared to give a little in order to fully scale and tap into Makers full potential. You can think of it as a necessary evil but if we do not evolve, we will not flourish. As to the article, it is wonderful to see so many people voting. That warms my heart. Whether you are in favor of the MIPs or not, the fact that people are exercising their ability to be heard is fantastic. I love that the press picked up on that because it is so important. Lets keep going!    Cointelegraph    MakerDAO members shoot down proposal for more centralization The members of MakerDAO have voted to reject three proposals that would have seen the DAO’s governance structure become more centralized and hierarchical.      ",
                    "links": [
                        "https://cointelegraph.com/news/makerdao-members-shoot-down-proposal-for-more-centralization"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.783775252525253
                }
            ]
        }
    ]
}