{
    "poll_list": [
        {
            "title": "Select a Target Level of rNPI Profitability to Guide Budget Cuts - July 4, 2022",
            "index": "16004",
            "option": "Break-even (Plus-minus 5%)",
            "supporting_mkr": "51,514",
            "highest_fraction": -1
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-bear-building-financial-resilience-dao-targets/16004",
            "title": "[SIGNAL REQUEST] [BEAR] Building Financial Resilience & DAO Targets ",
            "index": 16004,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted",
                "impact-:-medium",
                "bear-prep"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#1",
                    "likes": "7",
                    "time": "23/06/2022-17:35:49",
                    "content": " Sentence Summary Should MKR holders guide targets for bear-market expense cuts via an on-chain vote?  Background Following our presentation on the latest G&R call, we dove deeper on our cash runway discussion from last week and put together various scenarios to calculate Maker’s runway in the event of sustained unprofitability. After months of resilience, and despite still technically booking significant profits on the back of unfortunate liquidations, it is looking more and more likely that Maker will start running cash unprofitable months when measured purely on a recurring revenue basis, at our current burn rates. Hopefully the below pages will help the community narrow down closer to what that position really is and represents.  Slide1800×554 36.8 KB   Slide2800×554 97.7 KB   Slide3800×554 99.2 KB   Slide4800×554 101 KB   Slide5800×554 75.8 KB  On three scenarios of varying degrees of bearishness, we are calculating what the effective number of operating years would be available with three different levels of spending  Spending assumptions  On-chain actual cash movements CU reported expenses Maximum approved spend from budget process   On-chain actual cash movements These are real cash movements from the DAO to CU multisigs. However, often they capture various weeks or even months of working capital so they are subject to phasing considerations. In our monthly reports we rely on this figure for the sake of conservatism.  CU reported expenses Every month, most CUs report actual expenses by type. This is closer to an accrual view of expenses and creates a delta to on-chain transactions. However, it also depends on self-reporting from CUs.  Maximum approved spend from budgets This is the theoretical maximum that the DAO has authorized the CUs to spend. Our current run-rate is well under this figure, but is worth keeping in mind for conservatism when it comes to calculating runways.  Interest income from short-term bonds On top of this, interest income from our initiatives to invest in short-term bonds through Baillie Gifford and BlackRock will significantly extend our runway.  Signal Request Poll If this Signal Request is approved, the on-chain poll will feature ranked-choice options between several options. This Signal Request will run for one week rather than two given the urgency triggered by market conditions.     Signal Request Options Pro Con     A. Yes (MKR holders should take a view) Provides maximum level of discretion to MKR holders around use of cash and strategies to survive the bear-market MKR holders may not be updated with operational minutiae and might not be equipped to make the most informed decision   B. No (MKR holders should not take a view) Proactive engagement within the DAO is the best tool to select the target level of profitability to target MKR holders would be cut out from a crucial decision regarding the use of DAO funds    SR Start/End Date: 2022-06-23T17:00:00Z→2022-06-30T17:00:00Z The on-chain poll would be framed as follows: What target level of Recurring Net Protocol Income profitability (defined as rNPI / Recurring Revenues averaged over a preceding 3 calendar month period, excluding MKR vesting and liquidation income) should the DAO set in order to drive budget cuts?  Positive (> 5%) Break-even (±5%) Negative (minimum 3 years of runway at any time) No change      On-Chain Options Pro Con     Positive (>5%) Would continue accumulating dai in the surplus buffer and increase the short-term book value per MKR token May force the DAO to make cuts in CUs with significant business continuity impact and reduce the ability of CUs to maximize the opportunity at the end of the bear   Break-even (±5%) Would allow a small amount of flexibility to account for market fluctuations May occasionally have a negative impact on the surplus buffer in extended periods of narrow unprofitability   Negative (minimum 3 years of runway at any time) Allows a flexible framework for maintaining investment while still imposing a hard cutoff to control spending Increases the possibility of extended drawdowns on the surplus buffer        Should MKR Holders select a target level of rNPI profitability to guide budget cuts?  Yes No Abstain     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/29",
                        "https://forum.makerdao.com/t/this-week-in-governance/16382/2",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-04-de-julio-del-2022/16381",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/82",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/6",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/3",
                        "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151",
                        "https://forum.makerdao.com/t/governance-and-risk-197-thursday-june-30-at-21-00-utc/16216/2",
                        "https://forum.makerdao.com/t/cu-budget-reduction-initiatives-wiki-summary/16448",
                        "https://forum.makerdao.com/t/relay-semanal-28-de-junio-05-de-julio-del-2022/16473",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/17",
                        "https://forum.makerdao.com/t/off-chain-proposal-bounties-round-up-2/17032",
                        "https://forum.makerdao.com/t/reporting-for-strategic-finance-core-unit-may-june-and-july-2022/17037"
                    ],
                    "GPT-summary": "The author of the proposal is asking for feedback on whether MKR holders should guide targets for bear-market expense cuts via an on-chain vote. The proposal presents various scenarios to calculate Maker's runway in the event of sustained unprofitability and suggests options for the on-chain poll. The author is seeking feedback and constructive criticism on the proposed options and framework.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Change to proposal pipeline",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.424993987493988
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "3",
                    "time": "23/06/2022-21:51:57",
                    "content": "Opting for No here–usually when an organization makes across-the-board-cuts there is a percentage set and then the decision makers are asked to develop proposals for achieving those cuts. In this case it would be the Facilitators within their Core Units. This will provide facilitators flexibility to make the cuts where they will do the least damage to their ongoing operations. And if their budget has spam/pork the facilitators can cut that first. Similar to what you are proposing here, the DAO/MKR token owners can decide the level of reduction each Core Unit should incur. It can be ask to cut budgets at levels of 10%, 20%, and 30% via an on-chain poll (TOL). This process will allow facilitators to evaluate the degree of the cut that can be sustained. And if CU cannot accept such percentage of cuts, they can make a push for earning higher revenues, similar to what the MetaDAOs (EndGame) will be able to accomplish in the near future. All-in-all the way to pull yourself out of a hole, is to create opportunities and sell your way out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.444444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#3",
                    "likes": "1",
                    "time": "24/06/2022-05:14:23",
                    "content": "    flipflopflapdelegate:  Opting for No here–usually when an organization makes across-the-board-cuts there is a percentage set and then the decision makers are asked to develop proposals for achieving those cuts   We need to optimize for the desired outcome by mkr voters and do it properly in one cut or set of cuts. Dragging this on by targeting % reductions across the board and finding we need to go again for another round if things change is far worse. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#4",
                    "likes": "4",
                    "time": "24/06/2022-13:32:02",
                    "content": "This is a summary of the governance impacts of this proposal from GovAlpha’s perspective. It aims to provide clarity around this Signal Request:   This is a valid SR. It will run for one week rather than two given the demonstrated community desire for budget exploration, and its mild immediate impact if this signal request passes.   This SR aims to determine if the community agrees to put up a ranked-choice poll to explore budget cuts. The options would be:  Positive (> 5%) Break-even (±5%) Negative (minimum 3 years of runway at any time) No change    If approved by > 50% of non-abstain votes, this proposal will be eligible for an on-chain poll on 2022-07-04, which will run for three days. This will be a ranked-choice vote with the above mentioned four options.   We have assigned this a medium-impact tag because no actual changes will be triggered if this SR is passed.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.26060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#5",
                    "likes": "2",
                    "time": "24/06/2022-13:56:40",
                    "content": "adcv - this is good analysis there is a KEY question here:  how does Maker evaluate the productivity/potential of various functions/CUs and allocate capital among them in an efficient manner? This basic question applies in all market conditions - even in Bull Markets, Maker must decide how to best allocate more capital to the most productive functions. Maker desperately needs a framework to evaluate productivity (and associated strategic value) of its various units and initiatives… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#6",
                    "likes": "5",
                    "time": "24/06/2022-15:26:50",
                    "content": "I appreciate you putting analysis and SR together for the DAO. I know it takes a lot of work. A couple of questions:   The SR assumes we are making “budget cuts.” Is there a possibility this is not the case?   The SR is using rNPI over the past three months as a basis for “budget cuts.” Is this the best number to use when considering these adjustments could have a significant impact on the ability/longevity for CUs to operate?   When you look at “start running cash unprofitable months,” it appears there is a bias that is this not acceptable. Some times with budgets, there are “vanity” metrics to make something look good and I wonder if this is one of those areas? Do we care if we have a negative month(s) as long as our runway is solid?   We do have ongoing liquidation revenue. Is there a way to normalize this and add it to our expected income?   Can’t we expect some income from short-term bonds? It seems like the model isn’t accurate if we don’t include this in the base case. The comments suggest “will significantly extend our runway.” This is material for DAO revenues.   In the Signal Request Poll, it’s a little confusing in the wording. So I am clear, this is an offchain poll that if it is YES, will move to an onchain poll based upon the framing listed. If the poll is NO, you are suggesting “Proactive engagement.” I’m not exactly sure what that means and don’t see why MKR holders would be “cut.” As a suggestion, I would remove the Pro/Con section as it’s an opinion and reads biased to me. For example, I don’t agree that a Pro is this “provides maximum level of discretion.” It’s quite debatable. Btw, I’m not asking to have that debate here…just pointing out the difference in an opinion and factual based data.   Overall, the information in this SR seems to make assumptions based upon a super conservative look at our finances then attempts to apply a formula, based upon a point in time look at the DAO finances, in order to make “budget cuts.” I hope the DAO can find a way not to use a sledge hammer to drive in a finishing nail with our budgeting exercise. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.307598039215686
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#7",
                    "likes": "0",
                    "time": "24/06/2022-16:50:07",
                    "content": "    monkey.irish:  The SR assumes we are making “budget cuts.” Is there a possibility this is not the case?   You could expand the negative option a little here by asking how long we would be willing to stay negative at higher monthly losses than a 3 year runway would call for.  You could also specify a surplus buffer level that you do not want to drop under and limit cuts based on expected timelines for new revenue.     monkey.irish:  When you look at “start running cash unprofitable months,” it appears there is a bias that is this not acceptable. Some times with budgets, there are “vanity” metrics to make something look good and I wonder if this is one of those areas? Do we care if we have a negative month(s) as long as our runway is solid?   Just an opinion, but I think there is reason to bias toward profitability.  For MKR, the SB affects more than just runway.  It also affects risk.  Every month there is a loss heightens our risks and lowers the amount of capital we can put at risk in the future.  (I guess people who want to do a capital raise can jump in here and say we can always borrow more…)  To be fair, having less collateral also lowers our risk but that’s not what we’re aiming for right?     monkey.irish:  We do have ongoing liquidation revenue. Is there a way to normalize this and add it to our expected income?   We’ve gone from 3.4B DAI generated from non-stablecoins to under 1.3B in less than 2 months.  I don’t think there’s much more liquidation revenue to be had so you can pretty much count that out.     monkey.irish:  Can’t we expect some income from short-term bonds? It seems like the model isn’t accurate if we don’t include this in the base case. The comments suggest “will significantly extend our runway.” This is material for DAO revenues.   If Monetalis efforts work out and tens of millions of new recurring revenue are within grasp, it should certainly be considered.  I don’t think anyone would mind running negative for a few months if we would be positive thereafter.  But I expect there are low-value items that could be cut without too much long term impact and it’s not a bad thing to spend some time to focus on capital efficiency in the current environment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3642676767676765
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#8",
                    "likes": "1",
                    "time": "24/06/2022-18:34:05",
                    "content": "Voted No. I thought of both cases but then   Believe that Strategic Finance Core Unit as well as other CUs can help to reduce budgets with their own guidance   In case if such is not sufficient or not satisfactory, MKR holders always have an option to submit proposals to cut or remove CUs,   But correct me if my reasoning is not sound. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.34375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#9",
                    "likes": "1",
                    "time": "24/06/2022-18:52:46",
                    "content": "    monkey.irish:  The SR assumes we are making “budget cuts.” Is there a possibility this is not the case?   Ultimately that is up to MKR holders and Delegates but given the extremely high discrepancy between approved budgets and actual spend, my sense is that budgets in aggregate should be reduced. If Core Units with large unspent budgets were unable to invest such funds during a bull market, pragmatically it seems unlikely that they will in a bear market. With that said, the DAO may decide to reallocate capital and some Core Unit budgets could be increased.     monkey.irish:  When you look at “start running cash unprofitable months,” it appears there is a bias that is this not acceptable. Some times with budgets, there are “vanity” metrics to make something look good and I wonder if this is one of those areas? Do we care if we have a negative month(s) as long as our runway is solid?   The largest MKR holder has expressed his desire that the Maker protocol should be running profitably, today. There are certainly other large holders with opposing views and it will be up to the DAO collectively to make this decision.     monkey.irish:  We do have ongoing liquidation revenue. Is there a way to normalize this and add it to our expected income?   As @Traster_Tray alluded to, liquidation income is not something we feel the protocol can rely on especially with how far liquidatable collateral has fallen.     monkey.irish:  Can’t we expect some income from short-term bonds? It seems like the model isn’t accurate if we don’t include this in the base case. The comments suggest “will significantly extend our runway.” This is material for DAO revenues.   Assumptions for short-term bond income are included in the model, in the second to last slide titled, “Cash Burn after adjusting for BlackRock and Baillie Gifford”     monkey.irish:  Overall, the information in this SR seems to make assumptions based upon a super conservative look at our finances then attempts to apply a formula, based upon a point in time look at the DAO finances, in order to make “budget cuts.” I hope the DAO can find a way not to use a sledge hammer to drive in a finishing nail with our budgeting exercise.   This is a mischaracterization in my view - the cash flow analysis simply presents the existing run-rates and downside potential under continued collateral asset price pressure. As my colleague @SebVentures likes to say, “all models are wrong, but some are useful.” Such model was provided to illustrate to the community, directionally, what would happen to the Maker protocol’s cash runway. It is by no means a forecast and does not intend to be. Every MKR holder and delegate can make their own assumptions and express their views on chain if they support operating the protocol based on such metrics. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.038259441707718
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#10",
                    "likes": "2",
                    "time": "25/06/2022-15:37:15",
                    "content": "Are there any strategies or ideas that would help increase the revenue line from trading activities (i.e. stable coin trading) without diminishing demand for DAI? @adcv The volume there seems really high, so even a few bps, tiny fees or bid/ask spread would potentially create a somewhat reliable income specially in a bear market when investors will look to park investments in safe coins. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.680952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#11",
                    "likes": "3",
                    "time": "25/06/2022-17:14:22",
                    "content": "    TRUEMAKER:  Are there any strategies or ideas that would help increase the revenue line from trading activities (i.e. stable coin trading) without diminishing demand for DAI?   Uni v3 fees on USDC-DAI is around 2M/year, I was pushing the idea of investing directly the balance sheet in USDC-DAI LP but this would take quite some dev time for actually not much. That being said, I expect trading activities to be important in the future, that’s why I put a trading business line in the reporting 18 months ago. Notice as well that if there have been less political action around bond investing, we wouldn’t be at a deficit currently. MakerDAO issue is self-inflicted (PS: pushing a bit, reality would be more nuanced, but you get the idea). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.462962962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#12",
                    "likes": "0",
                    "time": "28/06/2022-16:17:51",
                    "content": "    monkey.irish:   The SR assumes we are making “budget cuts.” Is there a possibility this is not the case? The SR is using rNPI over the past three months as a basis for “budget cuts.” Is this the best number to use when considering these adjustments could have a significant impact on the ability/longevity for CUs to operate? When you look at “start running cash unprofitable months,” it appears there is a bias that is this not acceptable. Some times with budgets, there are “vanity” metrics to make something look good and I wonder if this is one of those areas? Do we care if we have a negative month(s) as long as our runway is solid?    All good questions as well as your other points, Robert. I voted yes. It does feel there’s an implied premise to questions that have not been formally asked and fully discussed in the community. Even though the larger questions about the future MakerDAO strategy and vision are in an intense consensus (re-consensus?) building phase, SF work cannot wait. That said, we should be careful not to frame the conversation and resulting poll vote from the outset based on views shared by single large/powerful voices in the forums, etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.74234693877551
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#13",
                    "likes": "3",
                    "time": "28/06/2022-16:32:47",
                    "content": "I realize this is a challenging process for the DAO and I want to be supportive as possible. As a general statement, these exercises start with a set of assumption and data is provided to support those assumptions. Data is inherently biased so it’s important to ensure what we say is accurate and represents the shared understanding of the community. I believe there is a way to optimize our budgets and I plan to be part of that. I’d rather see a proposal from the community on next steps. This SR ends the conversation with “in order to drive budget cuts.” I think that is a tactic in a much larger picture. And yes, there will probably be reductions in the budget so I am well aware of that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#14",
                    "likes": "1",
                    "time": "28/06/2022-18:03:35",
                    "content": "SF serves at the will of MKR holders and the largest one has been expressing, repeatedly, a desire for budget cuts and a return to profitability. This is in opposition to my personal view, which I’ve also expressed publicly and privately - I believe value will be maximized by running the protocol at a modest loss in the near term to lay the foundation necessary to grow revenues more sustainably longer term, but it is the MKR holders’ decision to make. Nevertheless, if MKR holders want budget cuts and profitability, SF will help facilitate such goals given our mandate and request from the largest MKR holder to do so. SF has no agenda and I would recommend you speak with the largest MKR holder directly if you are opposed to budget cuts. We also encourage the community to present proposals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#15",
                    "likes": "2",
                    "time": "28/06/2022-18:04:42",
                    "content": "    Doo_StableLab:   Believe that Strategic Finance Core Unit as well as other CUs can help to reduce budgets with their own guidance In case if such is not sufficient or not satisfactory, MKR holders always have an option to submit proposals to cut or remove CUs,    Understand your reasoning, fair enough. If this SR fails we will organize along the lines of what you describe. The intent of this SR is to provide a cold process-driven parameter to drive the decision making rather than letting it be discretionary, or have to rely on 1 to 0 options of offboardings - which may anyway take place. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.053571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#16",
                    "likes": "0",
                    "time": "29/06/2022-02:40:28",
                    "content": "    Aes:  largest one has been expressing, repeatedly, a desire for budget cuts and a return to profitability   Using this important point to direct my comments to the community. From the calls I’ve attended, even that MKR holder would like wider participation. In the last round of voting, I saw 200k+ MKR voted on proposals. There is an opportunity for the community to respond and partner with SF on DAO growth and costs. “Adjusting budgets and achieving profitability” is a challenging task and there are many ways to go about it especially with growth organizations. Is a “cold process-driven parameter” what the DAO needs to guide this exercise? Given how some of the End Game affiliations are forming, it seems like this is a hot topic and I think there are a few community members that know about startup finance. No need to wait for party formation, voter committees, etc. Get involved today. Perfect is the enemy of good. It’s also acceptable to delegate projects like this to core units. Without community input, feedback, and participation, that’s the default case. If you have other ideas, please get involved. @Recognized-Delegates #whales #vcs ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.971153846153846
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#17",
                    "likes": "0",
                    "time": "29/06/2022-06:14:00",
                    "content": "Thanks Robert. As the SR above describes and as I described to Doo, if MKR holders fail the poll or reject the SR on-chain then we will revert to:  Proactive engagement within the DAO is the best tool to select the target level of profitability to target  Understanding that  MKR holders would be cut out from a crucial decision regarding the use of DAO funds  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#18",
                    "likes": "0",
                    "time": "29/06/2022-14:51:15",
                    "content": "    adcv:  MKR holders would be cut out from a crucial decision regarding the use of DAO funds   This is a possibility if the community doesn’t engage. The community could still put up their own SR and propose a course of direction. This could be done as a complimentary or competing plan to this SR. At this point, I’ll leave it to the community. Thanks for listening/replying to my concerns. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#19",
                    "likes": "1",
                    "time": "03/07/2022-20:55:45",
                    "content": "I voted yes, and I believe we should target break even minimum for Maker Core (and I believe there are still critical core expenses missing, such as higher delegate compensation and oracle node security expenses). But in the case that we go ahead with MetaDAOs I believe we can make an exception in the short term (1-2 years) and instead burn through a portion of the surplus buffer in order to transition parts of the workforce that cannot be sustained by the core to the MetaDAOs as internal MetaDAO core units, so that all the incredible talent doesn’t go to waste and on the contrary we can use it to create much more value and growth for the protocol and ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.694444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#20",
                    "likes": "0",
                    "time": "04/07/2022-05:55:44",
                    "content": "    rune:  But in the case that we go ahead with MetaDAOs I believe we can make an exception in the short term (1-2 years) and instead burn through a portion of the surplus buffer in order to transition parts of the workforce that cannot be sustained by the core to the MetaDAOs as internal MetaDAO core units   Trying to clarify: this investment period sounds like a second step to today just avoiding drawdown on the surplus buffer. So we start with minimizing (ideally to 0) the drawdown on the surplus buffer. Note that as phrased, this works off rNPI so if achieved, any liquidation income will increase the surplus buffer. We handle investment periods separately. Please correct if misunderstood. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#21",
                    "likes": "2",
                    "time": "05/07/2022-13:10:30",
                    "content": "This poll is live on the voting portal, with voting ending on Thursday. Please express your opinion if you have one! https://vote.makerdao.com/polling/Qmasg6zr#poll-detail ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.852272727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#22",
                    "likes": "0",
                    "time": "04/08/2022-23:11:24",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1299"
}