{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mcd-weighted-index-analysis-risk-algorithm/2124",
            "title": "MCD weighted index analysis / risk algorithm ",
            "index": 2124,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/almccann",
                    "index": "#1",
                    "likes": "2",
                    "time": "22/04/2020-01:18:56",
                    "content": "Rather than having a loose decision around parameters based on intuition I think a decision algorithm should be worked on. This should be done in the abstract (not specifically relating to one asset) with agreement on some key inputs. Ultimately if useful could create a matrix or weighted score to rank assets and effectively give some guidance to shape decisions. Financial inputs change over time so they would be revisited periodically. MCD collateral is effectively a weighted index of assets so to effectively increase ”returns” (ie stability) of the index we need to reduce volatility of the index and reduce correlation. Price incentives would then ideally manipulate the inflows of low volatility assets and low correlation (diversified) assets. The main input should be realised/historical volatility of the asset. Thinking here is low volatility collateral assets should be incentivised over high volatility collateral assets to reduce liquidations. Diversification is important to dampen the volatility of the index itself. So correlation is an important input. Based on liquidity of DAI issues market cap is relevant. Tangential to this thinking would be a dashboard or real-time measure of the volatility of the MCD index and the weighted components. Personal anecdote I don’t feel at all comfortable using Maker because I don’t want to borrow against assets with high volatility - I would however find it very useful to collateralise a low volatility asset and do something useful over a long time with the borrowed DAI. If any of this is already in use please point me to resources. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.010363247863247
                }
            ]
        }
    ]
}