{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/sg-forge-socgen-risk-assessment/15638",
            "title": "SG Forge (SocGen) Risk Assessment ",
            "index": 15638,
            "category": [
                "Resources",
                "Research"
            ],
            "tags": [
                "rwa-008",
                "ofh",
                "socgen",
                "risk-assessment"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#1",
                    "likes": "18",
                    "time": "06/06/2022-18:55:23",
                    "content": "SocGen Forge Risk Assessment Legal Disclaimer: This communication is provided for information purposes only. This communication has been prepared based upon information, including market prices, data and other information, from sources believed to be reliable, but such information has not independently been verified and this communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only, and should not be relied upon as legal, business, investment, financial or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only , and do not constitute any recommendation for any action or an offer to provide investment, financial or other advisory services. This content is not directed at nor intended for use by the MakerDAO community (“MakerDAO”), and may not under any circumstances be relied upon when making a decision to purchase any other digital asset referenced herein. The digital assets referenced herein currently face an uncertain regulatory landscape in not only the United States but also in many foreign jurisdictions, including but not limited to the UK, European Union, Singapore, Korea, Japan and China. The legal and regulatory risks inherent in referenced digital assets are not the subject of this content. For guidance regarding the possibility of said risks, one should consult with his or her own appropriate legal and/or regulatory counsel. Charts and graphs provided within are for informational purposes solely and should not be relied upon when making any decision. The content speaks only as of the date indicated. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in these materials are subject to change without notice and may differ or be contrary to opinions expressed by others. This risk assessment combines the assessment of the Real World Finance Core Unit and the incubating Legal and Transactional Services Core Unit. Key Transaction Terms  image975×702 24.8 KB  Sections Key Transaction Terms Executive Summary Key Risks Transaction Parties Societe Generale Group Societe Generale - Forge DIIS Group Exchange Agent (final selection subject to SG Forge processes) Societe Generale SFH and Covered Bonds SFH Tokenized Covered Bond - OFH Tokens Proposed Transaction Conclusion Executive Summary Societe Generale Group (SocGen), a leading European financial services group, and Societe Generale - Forge (SG Forge), a SocGen subsidiary dedicated to digital assets and blockchain-based projects, propose the following experimental transaction: MakerDAO provide a 30 million DAI revolving debt facility (DAI Loan) to SG Forge, enabling SocGen to refinance €40 million of digital covered bonds (OFH Tokens) on its balance sheet. Specifically, MakerDao will make the DAI Loan to SG Forge which will be backed by a pledge of the OFH Tokens; after converting the DAI Loan into USD, SG Forge will make a USD Loan to SocGen, refinancing the OFH Tokens. Covered Bond A covered bond is a debt security issued by a bank or similar institution, providing on-balance sheet funding of its assets. Covered bonds provide recourse to both the issuer’s corporate credit and a ‘‘cover pool’’ of high quality assets that are insulated from the issuer’s insolvency. Thus, the OFH Tokens, issued by SocGen in May 2020, are Euro denominated, covered bonds that are backed by (1) a general corporate obligation of SocGen which is currently rated A/A1/A by FitchRatings, Moody’s and Standard & Poor’s respectively, and (2) a pool of high quality French home loans that are rated Aaa/AAA by Moody’s & Fitch. See “SocGen SFH” below for a general legal description of the covered bonds. RECOMMENDATION The Real World Finance Core Unit and the incubating Legal and Transactional Services Core Unit recommend that the Maker token holders vote to on-board the OFH Token on the basis of MIP21 and on the terms and conditions described above. Key Risks The proposed DAI Loan is a solid investment grade transaction directly backed by two strong investment grade entities. First, it is a direct corporate obligation of SG Forge, a subsidiary of SocGen which is rated A/A1/A by FitchRatings, Moody’s and Standard & Poor’s respectively. The average historical default rate for A rated corporations by Standard & Poor’s is approximately .05% annually, see Table 4 for details. Second, in the very unlikely event that SocGen is in financial distress or insolvency and SG Forge cannot make timely payments on the DAI Loan, the DAI Loan is also collateralized by the OFH Tokens, an overcollateralized pool of high quality French home loans that are rated Aaa/AAA by Moody’s & Fitch. In such a scenario, DIIS Group would need to enforce the OFH Token pledge at SG Forge on behalf of Maker. Once DIIS Group obtained the OFH Tokens, it could either sell them, likely at a discount or hold them to maturity as they only pay principal and interest on their maturity date, May 14, 2025. The various specific risks in this proposed transaction are detailed below.   Counterparty:  the DAI Loan is a direct obligation of SG Forge, a subsidiary of SocGen.  If SocGen or SG Forge experiences financial distress or insolvency, it may impact SG Forge’s ability to make timely payments on the DAI Loan.  If SocGen and SG Forge are solvent, however, SG Forge will be able to make timely payments on the DAI Loan, eliminating the risks listed below. The isolated risk of SG Forge only financial distress or insolvency is mitigated by SocGen’s ownership of SG Forge and associated reputation risk.   Collateral Performance:  if the credit performance of the pool of high quality French home loans backing the OFH Tokens (rated Aaa/AAA by Moody’s & Fitch) significantly underperforms, it may negatively impact the OFH Tokens payment of principal and interest, potentially reducing the available cash flow to repay the DAI Loan.  This possible scenario assumes SG Forge’s non-performance under the DAI Loan Agreement.   Liquidity:  the OFH Tokens are illiquid and there is not an readily available market to dispose of the OFH Tokens in the event of a liquidation ratio breach or SG Forge’s non-performance under the DAI Loan Agreement or the Pledge Agreement. As a result of that illiquidity, MakerDAO may have to retain possession of the OFH Tokens until repayment of the underlying covered bonds in May 2025. This possible scenario assumes SG Forge’s non-performance under the DAI Loan Agreement.   Off-Chain Enforcement:  similar to other real world finance applications utilizing the MIP21 structure, MakerDAO will depend on off chain oversight and enforcement mechanisms in the event that the OFH Tokens are undercollateralized or SG Forge’s non-performance under the DAI Loan Agreement or the Pledge Agreement. The OFH Tokens are not compatible with Maker vaults so SG Forge cannot deposit the OFH Tokens into a Maker vault.  This possible scenario assumes SG Forge’s non-performance under the DAI Loan Agreement.   Restraint on Self-Help Remedy under Pledge:  DIIS Group’s self-help remedy under the Pledge Agreement (full control over the OFH Token) may be practically restrained by the fact that SG Forge acts as the registrar for the OFH Tokens and is unable to transfer the alphanumeric code (i.e., “keys”) for the OFH Token to DIIS Group under the Pledge Agreement. In the worst case scenario of SG Forge non-performance under the Pledge Agreement, DIIS Group would have to pursue access to the OFH Tokens in a French court. According to legal advice from French counsel engaged by North Lakes Legal on behalf of Maker for this transaction, it is rare for creditors to use the self-help remedy outside of the French insolvency process as debtors will typically file a “safeguard proceeding” as a preemptive measure. While DIIS Group will ultimately obtain access to the OFH Tokens, the process will likely be subject to the French insolvency process. This possible scenario assumes SG Forge’s non-performance under the DAI Loan Agreement. See “OFH Token Risks” below for a more complete description.   Currency Exposure:  in the event that SG Forge cannot make timely payment on the OFH Tokens, repayment of the DAI in full will be subject to Euro/US dollar currency exposure as the collateral represented by the OFH Tokens is denominated in Euro. There is a risk that any Euro collected by DIIS Group will be insufficient to purchase sufficient DAI.  This possible scenario assumes SG Forge’s non-performance under the DAI Loan Agreement.   See “Historical Collateral and Exchange Rate Movements” below for more details on historical exchange rate movements.   Transaction Parties  image975×509 34.3 KB  Delegated Committee discussion Real World Finance: Decision-Making and Delegated Committee Proposal - #18 by ElProgreso Other Related Key Parties  image975×253 14.3 KB  Societe Generale Group SocGen is a leading European financial services group with over 138,000 employees across sixty-two countries, supporting approximately 30 million clients and businesses world wide. SocGen, which is headquartered in Paris, France, has three primary business lines: French Retail Banking, International Retail Banking Insurance & Financial Services, and Global Banking & Investor Solutions. For the year ended 2021 SocGen generated €25.8B and €6.3B of revenue and net income, respectively and had €560.4B in assets. SocGen’s long-term unsecured senior preferred debt is currently rated A/A1/A by FitchRatings, Moody’s and Standard & Poor’s respectively. Societe Generale - Forge Societe Generale - Forge (SG Forge) is a regulated subsidiary of SocGen dedicated to digital assets and blockchain based projects, providing issuers and investors with end-to-end services to issue and manage digital-native financial products registered on the blockchain (Security Tokens). SG Forge also builds open, simple, secure and institutional-grade frameworks and models for Security Token operations, underpinned by banking class security and full regulatory compliance. SG Forge offerings are based on the open course framework, CAST, which is a new market standard set of components designed for the issuance, custody and trades of Security Tokens. SG Forge’s CAST framework has been utilized in a number of innovative Security Tokens issuances, including the following.  The first worldwide security tokens issuance of a native security on the Ethereum public blockchain in 2019 (SG SFH €100,000,000 issuance of OFH Tokens) The first security token issuance which was settled in Central Bank Digital Currencies (CBDCs) in partnership with Banque de France in 2020 (SG SFH €40,000,000 issuance of OFH Tokens). The issuance of bond tokens by the European Investment Bank on the Ethereum public blockchain settled in CBDCs issued by Banque de France in 2021 (EIB €100,000,000 issuance of bond tokens) The first worldwide issuance of a structured product in the form of native Security Tokens on Tezos public blockchain in 2021 (Societe Generale €5,000,000 issuance of Notes tokens)  SocGen SFH SG SFH is a subsidiary of SocGen and its main financing vehicle for prime French home loans originated through SocGen’s banking network. Soc SFH generates low cost funding for SocGenby issuing covered bonds collateralized by a pool of French home loans. SG SFH is a licensed French credit institution and supervised by the French Banking Regulator. The SG SFH covered bonds are all backed by the same collateral pool of French home loans and are currently rated Aaa/AAA by Moody’s and Fitch. As of 12/31/2021 SG SFH had sixty four covered bond issuances, totaling €41.4B, which are supported by the €48.5B asset pool, including the covered bond refinanced by this transaction. The SG SFH covered bond collateral is summarized below in Table #1 while the covered bond structure is illustrated below in Diagram #1. The SocGen SFH covered bonds are described in detail here and here. The SG SFH covered bonds have a variety of structural protections including the following.  SG SFH business activities restricted by law to refinancing high quality assets Direct recourse to both SocGen and the covered bond pool Directly supervised by the French Bank Regulator (ACPR) and European Central Bank (ECB) The home loans in the pool are fully guaranteed by Crédit Logement, a financial institution supervised by the French Banking Regulator, which is rated Aa3/AA by Moody’s and DBRS Covered bonds have strong legal protections in SocGen insolvency including bankruptcy remoteness, segregation of pool cover assets and absolute seniority of payments over all creditors Dynamic, conservative ALM monitoring and hedging Interest Reserve, Collection Loss Reserve and Average Life Mismatch Test Required to maintain at least 105% collateralization ratio as required by Articles L.513-12 amd R.513-8 of the French Monetary and Financial Code   image975×1060 33.3 KB  Diagram #1  1600×937 162 KB  SG SFH Tokenized Covered Bond Issuance (OFH) On 14 May 2020, SG SFH issued its first €40 million of covered bonds (OFH Tokens) as security tokens directly registered on a public blockchain which were also rated Aaa/AAA by Moody’s and Fitch.  The €40M OFH Tokens were purchased by Societe Generale which simultaneously paid the issuer in a digital form of euros issued by Banque de France through a blockchain platform.  This transaction was performed end-to-end using blockchain infrastructures, in accordance with best market practices. It demonstrates the feasibility of financial securities being digitally settled and delivered in Central Bank Digital Currency (CBDC) for interbank settlements. SocGen is proposing this transaction to refinance the OFH Tokens that are currently on its balance sheet.   The OFH Tokens are not admitted to a trading venue and thus can only be traded over the counter.  Information on the Tokens is detailed below. SG SFH Tokenized Covered Bond - €40M (OFH Tokens)  image975×519 15.5 KB  DIIS Group DIIS Group (Maker Representative) is a financial services firm located in Paris, France, that provides flexible and independant post transactional solutions to issuers and investors for debt issuance under French law. Debt services include bondholders’ representative, covenant monitoring, make whole calculation agent, security agent, centralizing agent for written decision or bondholders’ general meeting. Exchange Agent SG Forge will contract with the Exchange Agent for the conversion of DAI to Fiat and also for the conversion of Fiat to DAI as needed in the proposed transaction. SG Forge will confirm the identity of the Exchange Agent prior to the initial borrowing. Transaction SocGen, a leading European financial services group, and SG Forge, a SocGen subsidiary dedicated to digital assets and blockchain-based projects, propose the following experimental transaction: MakerDAO provide a 30 million DAI revolving debt facility (DAI Loan) to SG Forge, enabling SocGen to refinance €40 million of digital covered bonds (OFH Tokens) on its balance sheet. Specifically, MakerDao will make the DAI Loan to SG Forge which will be backed by a pledge of the OFH Tokens; after converting the DAI Loan into USD, SG Forge will make a USD Loan to SocGen, refinancing the OFH Tokens. Note that Maker/Maker Representative is only a counterparty for the transaction detailed in Step #2 below, but we have included the other closely related transactions for context. Transaction Structure  1354×545 65.6 KB  Initial transaction   SocGen transfers ownership of the OFH Tokens to SG Forge by way of security.   SG Forge pledges the OFH Tokens to DIIS Group as collateral for borrowing DAI   SG Forge may borrow up to 30 million DAI from Maker through the Maker Representative.   The initial borrowing at closing is targeted to be [20] million DAI, and additional borrowings may be drawn (together, the DAI Loan).   DIIS Group will function as the Maker Representative and Security Agent: both executing the DAI Loan and taking/managing and enforcing the OFH Token pledge on behalf of Maker   SG Forge enters into an agreement with the Exchange Agent to swap DAI for USD. The USD funds will be used for the USD Loan.   SG Forge lends the USD Loan to SocGen.   Repayment transaction SG Forge will repay the outstanding DAI Loan with accrued interest (in DAI) by reversing step 2.  1256×732 118 KB  Transaction Documents & Governing Law  Loan of Consumption (DAI Loan) between MakerDAO (represented by DIIS Group) and SG Forge Instruction to DIIS Group, as Maker Representative and Security Agent, as approved by Maker token holders. By approving the Instruction, the Maker token holders authorize DIIS Group to execute the DAI Loan and the Pledge Agreement on behalf of Maker DAO, as well as enforce rights and discretions under both the DAI Loan and the Pledge Agreement. Pledge Agreement between SG Forge and DIIS Group as Security Agent pursuant to which SG Forge has pledged the OFH Tokens to Security Agent on behalf of MakerDAO as security for the performance of the DAI Loan  The documents will be governed by French Law. Collateral Valuation The Market Value of the collateral will be calculated daily by the formula below. Market Value = [100,000 * (Number of OFH Tokens) * (CP * FX)]/DAI Loan  DAI Loan = DAI borrowed plus accrued stability fee CP = (market price of Comparable Bond at mid-market price - .015) FX = EUR/USD exchange rate Comparable Bond = SG SFH €750 MM 0.5% 02-Jun-2025 (ISIN FR0013259413) Number of OFH Tokens = 400  The OFH Tokens are illiquid digital bonds so their pricing will be based on that of a comparable, liquid SG SFH bond (Comparable Bond) noted above.  The Covered Bond has a .5% annual coupon while the Tokens pays no interest and both bonds mature in approximately three years, so the Comparable Bond price is thus stripped of three years of interest (1.5%) to create a better, conservative pricing proxy.  The Token (& Comparable Bond) are Euro denominated so their pricing will be converted into USD as well.  Note that each Token is denominated in €100,000 units. The historical data for the Comparable Bond prices and the Euro/USD exchange rates from 2019 to March 2022 are detailed in Graph One below.  The Comparable Bond prices (€) are in blue while the exchange rates (€/$) are in orange.   Bond price data supplied by SocGen and exchange rate data provided by Wall Street Journal (WSJ.com). The USD based Comparable Bond historical pricing (adjusted for exchange rate) is detailed in Graph Two below. Graph One  1471×1132 80.4 KB  Graph Two  786×567 65.7 KB  Collateral Testing & Reporting The Maker Representative will compare the market value of the OFH Tokens daily using the collateral valuation formula (See “collateral valuation”) and compare the results with the following triggers.  Daily Reporting Amount: an amount equal to 120% of the DAI Loan Margin Threshold Amount/Collateral Test: an amount equal to 115% of the DAI Loan Liquidation Trigger Amount: an amount equal to 107% of the DAI Loan  Daily Reporting Event: if the Market Value is greater than or equal to the Daily Reporting Amount (120%), the Maker Representative will report the daily calculations on a weekly basis while if the Market Value is less than the Daily Reporting Threshold, the Maker Representative will report the daily valuations daily. In both cases, the Maker Representative will publish the results as a new topic on the MakerDAO Forum. Collateral Event Notice: if the Market Value is less than the Margin Threshold Amount (115%) on any day, the Maker Representative will notify the Delegated Committee via email at [email protected]. Cure and Liquidation Events Cure Period: after a Collateral Event Notice, SG Forge has five business days to cure the Collateral Event by either (1) pledging sufficient additional OFH Tokens under the Pledge to cure the Collateral Test or (2) redeliver an amount of DAI so that the collateral test is satisfied. Liquidation Event Notice: If, however, the Market Value falls below the Liquidation Trigger Amount (107%) or SG Forge fails to cure the Margin Threshold Amount within five business days of a Collateral Event Notice, a Liquidation Event shall occur and the Maker Representative will notify the Delegated Committee via email at [email protected]. This notice will trigger a Liquidation Event. Liquidation Event: the delivery of a Liquidation Event Notice shall trigger an early termination of the DAI Loan and it will become immediately due and payable. Automatic Termination Events Automatic Termination Events: the following events constitute an automatic termination event under the DAI Loan Agreement and require that SG Forge repay the DAI Loan:  Any material misrepresentation or warranty made by either SG Forge or DIIS Group; Either SG Forge or DIIS Group fails to comply with any of its material obligations under the DAI Loan; Agreement after a cure period of five (5)business days; Insolvency of either SG Forge or DIIS Group; The Pledge Agreement or the Instruction are terminated for any reason It becomes unlawful at any time for SG Forge or DIIS Group to comply or perform any material obligation under the DAI Loan Agreement; and An Emergency Shutdown of MakerDAO as triggered by a MKR Vote.  Sequence of potential events post the occurrence of an Automatic Termination Event:   If SG Forge pays off DAI Loan within five (5) business days, then the investment is finished.   If SG Forge does not pay off DAI Loan within five (5) business days, DIIS Group requests the OFH Tokens from SG Forge and SG Forge transfers the OFH Tokens to DIIS Group. If SG Forge does not transfer the OFH Tokens, then MakerDAO (through DIIS Group) will have breach of contract claims against SG Forge which may be remedied in a French court. See below summary “OFH Token Risks”.   If SG Forge transfers the OFH Tokens to DIIS Group, the DAI Loan remains backed by an illiquid digital covered bond (the OFH Token). The Delegated Committee will need to provide instructions for DIIS’ next actions, recognizing that    The OFH Token will not generate cash to repay the DAI Loan until its scheduled repayment date, May 14, 2025 Until the DAI Loan is repaid, it will continue to bear the risk of the SFH covered bond collateral which is backed by French home loans, including the credit performance of the underlying French home loans The DAI Loan is exposed to the USD/Euro currency risk   The Delegated Committee will have several options in a distressed situation.   Have DIIS Group sell the OFH Token, likely at a loss Have DIIS Group hold the OFH Token until it matures and use the proceeds from repayment to repay the DAI Loan Have DIIS Group hold the OFH Token until it matures but also hedge the USD/Euro basis until it matures    Maker want want to hedge USD/Euro during the French insolvency process   Once DIIS Group obtains the OFH Tokens from a French insolvency process, then go to step (4)   Historical Collateral and Exchange Rate Movements If SocGen is in financial distress and SG Forge is unable to make timely payments on the DAI Loan, the OFH Tokens backing the DAI Loan are denominated in (€) and thus the DAI Loan would bear exchange rate risk.  The price and exchange rate volatilities from January, 2019 to March, 2022 are summarized below in Table One for the Comparable Bond Price in (€), EUR/USD exchange rate and the Comparable Bond Price in ($).  Over the historical period the maximum adverse exchange rate movements against a DAI denominated loan over one day, one week, one month and three month periods would be 2.73%, 5.43%, 6.69% and 6%, respectively. Table One  image975×296 11.2 KB  Maker/Delegated Committee Decisioning Delegated Committee: persons nominated by MakerDAO tokenholders to interact with DIIS Group on behalf of MakerDAO in respect to matters relating to the transaction. DIIS Group, as Maker Representative and security agent for MakerDAO, may require, from time to time, guidance on particular courses of action or have a point of communication for the overall management of the DAI Loan Agreement, the Instruction and the Pledge Agreement. To facilitate communication with DIIS Group as required from time to time and management of the DAI Loan Agreement and the Pledge Agreement, Maker token holders, in approval of the proposed transaction, will authorize certain individuals to act as a “Delegated Committee” under the Instruction. The RWF Core Unit and the incubating LTS are endeavoring to identify potential delegates. The RWF Core Unit and the incubating LTS will update this Risk Assessment with the proposed Delegated Committee in advance of a Governance Vote. The Delegated Committee shall ensure that it makes available on forum.makerdao.com all communications received from, or sent to, DIIS Group. Each person serving as a delegate will have a term of one year from the 1st anniversary of the Instruction. The Maker token holders may extend or terminate their respective terms (individually or collectively) at the one year anniversary. Maker token holders may, from time to time and at any time, in their sole discretion add, remove and/or replace the persons appointed to the Delegated Committee via a Governance Poll. The Maker token holders instruct the members of the Delegated Committee to act on a consensus basis and, if the Delegated Committee is unable to reach a consensus, the Delegated Committee shall request guidance from the Maker token holders via a posting at forum.makerdao.com. The Delegate Committee shall not take any of the following actions without the approval of Maker token holders pursuant to a vote in accordance with the MakerDAO protocol:   Increase or decrease the debt ceiling   Reduce the stability fee   Extend the maturity date   Exercise the Lender Early Redemption Option (as described below)   Any other matters determined by the Maker token holders from time to time via a Governance Poll and notified to the Delegated Committee via a posting on forum.makerdao.com   The Maker token holders may expand or contract the authorities of the Delegated Committee from time to time. All decisions of the Maker token holders shall be pursuant to a Governance Poll in accordance with the rules of the MakerDAO protocol. The Delegated Committee may, from time to time, consult with one or more of the applicable subject matter experts within the Maker DAO community on matters relating to the transaction (including any applicable core units or successors to the same). On a monthly basis, the Delegated Committee shall report to the Maker community, via the Forum, of any developments from time to time in respect of the transaction. The form and substance of such reports to be determined by the Delegated Committee with the support of the Real World Finance Core Unit and the Maker token holders. Prepayment, Redemption Options Borrower Early Repayment Option: SG Forge may prepay the DAI Loan without penalty at any time prior to the Maturity Date with a five days prior notice to the Maker Representative (i.e. DIIS Group). This option allows both partial and full prepayment. Lender Early Redemption Option: the Lender (Maker DAO) may request the redemption of the DAI Loan without penalty at any time prior to the Maturity Date with a thirty days prior notice to SG Forge. OFH Token Risks As noted in [RWA008] OFH/MIP21 Token CES Domain Team Assessment [RWA008] OFH/MIP21 Token CES Domain Team Assessment, SG Forge will register in the OFH Token balance that RWAUrn is the holder of the OFH Token. SG Forge will covenant in the DAI Loan Agreement to maintain this registration. There is a risk that SG Forge could unwind the registration. Such action would trigger an event of default under the DAI Loan Agreement and trigger repayment. The risk is further mitigated by the fact that such unwind would be publicly visible. The reputational risk for SG Forge in undertaking such an unauthorized unwind of the registration may be considered reasonably high. Neither DIIS Group (as Security Agent or Maker Representative) nor MakerDAO will have the possession of the encrypted alphanumeric code that permits the unlocking and transferability of the OFH Tokens. As a result, DIIS Group (as Security Agent) will not have the absolute ability to directly possess and transfer the OFH Tokens upon enforcement of the Pledge Agreement. DIIS Group will be dependent upon SG Forge to permit direct possession and transfer of the OFH Token. Typically in a French law governed pledge agreement, the pledgee (DIIS Group) would have the absolute ability to directly possess and transfer the underlying asset (i.e., self-help). In respect of this particular risk, the French law-qualified lawyers at Latham & Watkins assisting North Lakes Legal on this transaction note that: ”Successful enforcement actions outside of bankruptcy are fairly rare in practice under French law. This is because of the ability for French companies to open ‘safeguard proceedings’, i.e. judicial proceedings opened to solvent debtors to restructure their indebtedness and which have the same coercive effects as traditional insolvency proceedings on the company’s creditors collectively. In particular, the opening of safeguard proceedings triggers an automatic stay (i.e. an automatic suspension of all legal actions against the debtor, such as actions seeking the payment of prepetition claims as well as a suspension of enforcement measures). In practice, French debtors facing an event of default, absent a proper waiver from their relevant creditors, often use safeguard proceedings defensively and preemptively.” In the context of a “safeguard proceeding” or other insolvency proceeding under French law, · enforcement of the Pledge will be stayed as from the date of the Court judgment opening such proceedings and for a period of time (the so-called “observation period”) which may vary depending on the outcome of the safeguard or insolvency process. However, as a secured party, DIIS Group (and indirectly MakerDAO) will have the following protections:   MakerDAO may see its claims repaid (notwithstanding the automatic stay), with the prior authorization of the supervising judge (juge-commissaire).   No forced sale of the underlying OFH tokens can be implemented during the observation period or as part of the court order taken to implement a restructuring solution at the end of the insolvency process (i.e. in case of an asset sale plan (plan de cession) judicially ordered) without the creditor’s consent or the repayment of such creditors’ claim.   In case of judicial liquidation (without business continuation or in case of failure of such business continuation):   as part of the liquidation operations run by the liquidator, two main options would be open:  (i) the liquidator could repay the claim (the DAI loan) to withdraw the pledged OFH tokens and be able to sell them on the market, or (ii) the liquidator could sell the OFH tokens and in that case, the Security Agent would benefit from a first-ranking priority over any proceeds out of such sale and therefore will not be competing with claims on such proceeds from other creditors and    after three months without the liquidator having initiated the liquidation proceedings, DIIS would recover its right to enforce the OFH Pledge.   RECOMMENDATION The Real World Finance Core Unit and the incubating Legal and Transactional Services Core Unit recommend that the Maker token holders vote to on-board the OFH Token on the basis of MIP21 and on the terms and conditions described  in this document. The proposed transaction permits SG Forge to generate up to $30,000,000 DAI backed by highly-rated and regulated French covered bonds in the form of OFH Tokens. The proposed transaction opens new avenues for DAI generation backed by highly rated and regulated real world assets with tokenization overlay. Further, the real world risks associated with the transaction are largely mitigated as described in the document. Finally, as a successful experiment, the proposed transaction may provide avenues for similar and more scalable transactions with SG Forge. ",
                    "links": [
                        "https://forum.makerdao.com/t/real-world-finance-decision-making-and-delegated-committee-proposal/15276/18",
                        "https://www.societegenerale.com/fr",
                        "https://www.sgforge.com/",
                        "https://www.cast-framework.com/white-paper/",
                        "https://www.societegenerale.com/sites/default/files/documents/2021-10/SG_Covered_Bonds_Investors_Presentation_2021.pdf",
                        "https://www.fitchratings.com/entity/societe-generale-sfh-mortgage-cover-pool-ofh-90486077#esg",
                        "https://www.societegenerale.com/sites/default/files/documents/2021-06/Societe-Generale-SFH-EMTN-Base-Prospectus-dated-9-June-2021.pdf",
                        "https://www.societegenerale.com/sites/default/files/documents/2022-05/Q1-2022-Presentation-to-Debt-Investors-16-05-22.pdf",
                        "https://www.diisgroup.com/",
                        "http://WSJ.com",
                        "http://forum.makerdao.com",
                        "http://forum.makerdao.com",
                        "http://forum.makerdao.com",
                        "https://forum.makerdao.com/t/rwa008-ofh-mip21-token-ces-domain-team-assessment/15239",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/7",
                        "https://forum.makerdao.com/t/mip39c2-sp34-creating-rwf0x-from-a-split-of-rwf-001/16967",
                        "https://forum.makerdao.com/t/maker-brand-team-monthly-update-may-2022/15980",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-julio-01-de-agosto-del-2022/17049"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.232215804453373
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "1",
                    "time": "06/06/2022-20:08:13",
                    "content": "Quite excited to see this move forward hopefully. What’s the latest timeline on this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "0",
                    "time": "06/06/2022-20:54:27",
                    "content": "    Eumenes:   CP = (market price of Comparable Bond at mid-market price - .015) FX = EUR/USD exchange rate    Is it possible here that MakerDAO takes a loss on arbitrage if the market price of the Comparable Bond (CP) trades 10% to 15%++ below Par, and the U.S. Dollar flips the EURO in the next 3-years? What are the possible scenarios that can go against MakerDAO with the sudden change in FX/Covered Bond price (OFH Tokens)?     Eumenes:  Prepayment, Redemption Options Borrower Early Repayment Option: SG Forge may prepay the DAI Loan without penalty at any time prior to the Maturity Date with a five days prior notice to the Maker Representative (i.e. DIIS Group). This option allows both partial and full prepayment.   Can you please expand on why partial payment is allowed (an example of a scenario would be great). Also, this is similar to pledging a Call Option, correct?     Eumenes:  Neither DIIS Group (as Security Agent or Maker Representative) nor MakerDAO will have the possession of the encrypted alphanumeric code that permits the unlocking and transferability of the OFH Tokens. As a result, DIIS Group (as Security Agent) will not have the absolute ability to directly possess and transfer the OFH Tokens upon enforcement of the Pledge Agreement. DIIS Group will be dependent upon SG Forge to permit direct possession and transfer of the OFH Token. Typically in a French law governed pledge agreement, the pledgee (DIIS Group) would have the absolute ability to directly possess and transfer the underlying asset (i.e., self-help).   With regards to possessing and transferring the OFH Tokens, DIIS Group will not be able under the pledge agreement to possess the alphanumeric code because this transaction is considered private and therefore proceedings need to first occur in consideration of perhaps restructuring the deal, or discussions pertaining to bankruptcy proceedings? Am I understanding this correctly? All in all this is one heck of a Risk Assessment, great work Team! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.597826086956522
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#4",
                    "likes": "0",
                    "time": "06/06/2022-22:04:12",
                    "content": "great question. SocGen is finalizing their broker/dealer selection and tying up some lose ends.  We think it should execute in the next month. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#5",
                    "likes": "1",
                    "time": "06/06/2022-22:12:17",
                    "content": "QUESTION #1 Is it possible here that MakerDAO takes a loss on arbitrage if the market price of the Comparable Bond (CP) trades 10% to 15%++ below Par, and the U.S. Dollar flips the EURO in the next 3-years? What are the possible scenarios that can go against MakerDAO with the sudden change in FX/Covered Bond price (OFH Tokens)? ANSWER #1 SG Forge has borrowed in DAI/USD and is thus required to repay in DAI so they are taking the currency risk and hedging or not how they see fit.  SocGen is a sophisticated A rated bank.  The covered bond pool (OFH Tokens) is only relevant if SG Forge defaults on its loan obligation. QUESTION #2  Can you please expand on why partial payment is allowed (an example of a scenario would be great). Also, this is similar to pledging a Call Option, correct? ANSWER #2.  This is an experimental 1st facility at a relatively small size.  SG Forge asked for this option and we agreed, as they want to test their financial plumbing.  It would be a different discussion at size. QUESTION #3 With regards to possessing and transferring the OFH Tokens, DIIS Group will not be able under the pledge agreement to possess the alphanumeric code because this transaction is considered private and therefore proceedings need to first occur in consideration of perhaps restructuring the deal, or discussions pertaining to bankruptcy proceedings? Am I understanding this correctly? ANSWER #3  Here is my basic understanding but I will defer to CP for a more nuance legal view.   SocGen didnt want to give DIIS access to the electronic key for the OFH Token pledge.  So if SG Forge defaults on its repayment obligation, DIIS can request that SG Forge give it the electronic keys.  If SG Forge doesnt, then DIIS will need to pursue their legal remedies to get access to the electronic keys. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.760869565217392
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#6",
                    "likes": "2",
                    "time": "06/06/2022-23:33:02",
                    "content": "    Eumenes:  SocGen didnt want to give DIIS access to the electronic key for the OFH Token pledge. So if SG Forge defaults on its repayment obligation, DIIS can request that SG Forge give it the electronic keys. If SG Forge doesnt, then DIIS will need to pursue their legal remedies to get access to the electronic keys.   This is correct. In the pledge of a non-digital assets (e.g., share certificate), the pledgor would customarily sign and deliver an undated share transfer certificate (or the like). If the lender has the right to exercise on the pledge, the lender simply fills in the date and notifies the company or share registry that the lender is now the owner of the shares. This is the right of “self-help”. SGF did not want to hand-over the keys to the tokens. So while DIIS Group has a pledge over the tokens, DIIS Group will not have a “self-help” remedy. Notwithstanding, DIIS Group (acting on behalf of Maker) will have the right to force such transfer via a court proceeding. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.660714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#7",
                    "likes": "2",
                    "time": "07/06/2022-16:31:15",
                    "content": "Hi folks, We will discuss this transaction at tomorrow’s RWF Office Hours at 2pm ET     Introducing: RWF-001 Weekly Office Hours! Real World Finance       The Real World Finance Team will hold a weekly Office Hours for anyone to drop in and ask real-world financing related questions.  These sessions will be run as an informal format with the primary goal of helping participants in the MakerDAO Community to better understand structured finance and other activities facilitated by the team. Sessions will not be recorded.  This meeting takes place weekly Wednesdays at 18:00 UTC.  RWF Office hours call details  Join Zoom Meeting  https://us02web.zoom.u…   ",
                    "links": [
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/82937610820?pwd%3DemtwbnFrWG9rcUJGRmZrcHc2c0h5Zz09&sa=D&source=calendar&ust=1649651165539178&usg=AOvVaw11H2VOq9C9rQ_Ku6I57Fi5"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.979166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jeremy_Kim",
                    "index": "#8",
                    "likes": "0",
                    "time": "07/06/2022-17:05:24",
                    "content": "Is this covered bond issuance cross-collateralized by the collateral from SocGen’s other covered bond issuances? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#9",
                    "likes": "5",
                    "time": "07/06/2022-17:31:10",
                    "content": "@Eumenes is 5bps a PoC discount price? Currently SOFR is 80bps which sounds a reasonable floor for such a transaction (as SocGen will earn at least that on the proceeds). 5bps over 1 year is 15k DAI while 80bps would give 240k DAI. The latter would allow us to be about break-even on this operation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#10",
                    "likes": "0",
                    "time": "09/06/2022-10:44:40",
                    "content": "On this, @Eumenes, do we have a chart comparing yield of the covered bonds of this tenure vs overnight rate? Not sure that the overnight rate constitutes a floor but it’s my intuition and don’t have data backing it - hence I could be entirely wrong here. Thanks a lot, Luca ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#11",
                    "likes": "1",
                    "time": "09/06/2022-13:22:26",
                    "content": "I think a key question here is what is the relevant reference rate. Though the underlying covered bond (OFH Token) matures in May 2025, Maker can call this loan at any time (with 30 days notice).  As such should we view this as a floating rate deal?  ISG Forge is also borrowing in DAI which is pegged to the USD so the reference rate should be USD rate based. Given these nuances I suggest using a USD SOFR rate in the 30-90 day range. https://www.cmegroup.com/market-data/cme-group-benchmark-administration/term-sofr.html Again this relatively small facility is more a proof in concept than a large commercial facility.  When Maker does the next, bigger facility with SocGen, these issues will be better addressed.  Its also likely that SocGen would want a larger facility’s term to match the term of the underlying collateral (OFH Tokens) and would thus want a fixed term facility that cannot be called at will by Maker, unless there is an Event of Default. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.563186813186814
                },
                {
                    "author_link": "https://forum.makerdao.com/u/humancapitol",
                    "index": "#12",
                    "likes": "1",
                    "time": "11/06/2022-20:32:59",
                    "content": "I might be misunderstanding your use of “floating rate deal” but I believe this is a fixed rate deal (underlying bonds have a fixed 0.5% coupon). Maker’s right to call the deal should not matter in the fixed/floating rate distinction Because the underlying collateral is European (and likely trading off of Euribor or their SOFR equivalent, if adopted), I think it would be a challenge to peg this deal to a USD SOFR rate. US rates are significantly higher than broader Eurozone rates today, with the ECB only just now moving forward with rate hikes (European Central Bank will hike rates for first time in 11 years | CNN Business). If the underlying bonds pay 50bps in EUR, and this is pegged to SOFR, I’m not exactly sure why SG Forge would move forward with this. Whether or not Maker wants to do this at <SOFR is another question (and perhaps more relevant) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.655612244897959
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#13",
                    "likes": "2",
                    "time": "12/06/2022-07:31:18",
                    "content": "The interest rate of the collateral doesn’t matter (the covered bond here has 0%), the only thing that matter is the quality (i.e. possibility to be sold quickly at the price). The risk-free rate for US $ is SOFR, we shouldn’t lend below that (assuming this is an open repo without a term). We can’t refuse some MIP6 by being below market then not even noticing that we are happy to go below market here (even if we are here). As said, this deal is a PoC for things to come in later years, so the rate isn’t that important but it is important to have a sound methodology and not state that we are happy to lend $ at the € rate. Currently, we have plenty of space on our balance sheet so there is no competition, but I can only hope such times will come. ",
                    "links": [
                        "https://forum.makerdao.com/t/build-your-makerdao-alm-model/18730/8"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.358974358974359
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#14",
                    "likes": "9",
                    "time": "12/06/2022-22:29:13",
                    "content": "Title: SG Force (SocGen) Additional Risk Assessment - LOVE CU (in Incubation) Authors: @luca_pro, @August  SG Forge (SocGen) Additional Risk Assessment - LOVE CU (in Incubation) Disclaimer This communication is provided for information purposes only, and may not under any circumstances be relied upon when making a decision. This additional risk assessment is issued by the incubating Lending Oversight Core Unit (“LOVE”) the ratification of which is subject to vote by the MakerDAO Community. The assessment is intended to be reviewed in conjunction with the other documents referenced herein. Please refer to the SG Forge (SocGen) Risk Assessment posted by the Real-World Finance Core Unit (RWF) and the incubating Legal and Transactional Services Core Unit (LTS) for a more comprehensive analysis of this transaction.  Content Outline  Executive Summary Transaction Details Key Risks and Mitigating Factors Process Overview Conclusion & LOVE Recommendation   Executive Summary Societe Generale Group (“SocGen”), a French multinational financial services institution with €1.5 trillion total assets as of December 31, 2021, and Societe Generale - Forge (“SG Forge”) have requested a 30 million DAI revolving debt facility from MakerDAO (“Maker”). The DAI would be used to refinance €40 million of digitally-represented covered bonds (“OFH Tokens”) currently carried on SocGen’s balance sheet. Under the terms of the transaction, Maker would issue the DAI to SG Forge in exchange for a pledge backed by the OFH Tokens. SG Forge would convert the DAI to USD, which would be loaned to SocGen. SocGen would use the USD to refinance the OFH Tokens. Finally, SocGen would transfer USD to SG Forge, which would be converted to DAI and sent to Maker to repay the initial DAI facility. Maker’s real world activities would be executed through DIIS Group, a legal entity controlled by MKR holders and a Maker Delegated Committee.  Transaction Details The following table is replicated from the RWF / LTS risk assessment referenced above.  975×702 24.8 KB   Key Risks and Mitigating Factors Counterparty Risk: Although SocGen is a well-established global financial institution, the transaction exposes Maker to a highly centralized organization and any of its failures. Examples of these potential risks within SocGen may include poor governance decisions, bad actors as management, ongoing and future litigation, and security breaches. Genesis Trading, the exchange agent contracted for DAI/USD conversions, and its ability to execute transactions, present additional third party risks to Maker. Mitigating Factors: Counterparty risks are mitigated by the heavily regulated nature of traditional financial services. SocGen is monitored by the European Central Bank and, as a Global Systemically Important Bank (GSIB), is subject to stricter regulation including higher capital requirements and more stringent stress tests than most other banks. SocGen was the 18th largest bank by assets in the world as of year-end 2021 with long term issuer ratings of A-/Baa2/BBB from Fitch, Moody’s, and S&P, respectively. SocGen is a pillar of European and global finance with a reputation akin to a US money center bank such as JP Morgan. SocGen’s presence and status may also help mitigate exchange agent risk, as the bank would likely seek to work with equally reputable parties. Centralization: The agreement with SocGen would expose Maker to multiple centralized entities and processes. SocGen, itself a highly centralized institution, has been the primary decision-maker in structuring this  transaction and is expected to retain more influence than Maker for the deal’s duration. Additionally, DIIS Group is a centralized entity and, while contracted to act as Maker’s real world (off chain) representative, was selected by SocGen which may incent it to act in SocGen’s interest at times. Further, while most Sacred Rights decisions would be decided by MKR vote, all other general decisions would be made by a Maker Delegated Committee. The Delegated Committee, consisting of representatives selected by MKR holder vote, would provide day-to-day oversight to DIIS Group and make key business decisions, including treatment of OFH Tokens received in the event of an automatic termination. Although the Delegated Committe members would be elected to serve the Maker Community, this puts a large portion of the decision making in the hands of a small group of individuals. We would advise the community to dedicate the right amount of attention to the definition and ongoing operations of the Maker Delegated Committee in this transaction as well as in its future implementation. Mitigating Factors: DIIS Group would be mandated to serve strictly as Maker’s representative and at the guidance of the Maker Delegated Committee. Under this structure, DIIS should only be the executor of Maker’s decisions. Centralization, or control, risks of the Maker Delegated Committee are mitigated by the committee’s structure. Each member of the committee is selected by MKR holders for a one-year term, but may be removed at any time by a Maker Governance poll. Additionally, new members may be added to the committee at any time through a governance poll. The Delegated Committee would be required to report all communications with DIIS on forum.makerdao.com for absolute transparency. A full discussion on the use of similar delegated committees in RWA transactions will be had in a separate forum post. Credit (Solvency) Risk of the Borrrower: As noted above, SocGen’s operations heavily impact this transaction’s success. SocGen, similar to other traditional banks, finances the vast majority of its business with debt - of various nature and seniority, on which it must make payments or risk insolvency. Mitigating Factors: SocGen reported net banking income (yield on interest bearing assets - cost of interest-bearing liabilities) of €7.3 billion and a 56.4% cost-to-income ratio in the first quarter of 2022, showing a positive ability to service its obligations and cover costs. Further, regulators require SocGen to maintain certain capital ratio minimums to remain in good standing. At the end of the first quarter of 2022, SocGen reported robust capital ratios with a CET1 Ratio of 12.9%, approximately 370 basis points above the regulatory requirement. Regulatory Risk: The SocGen agreement exposes Maker to traditional bank regulatory bodies which may add more scrutiny than a solely on-chain contract. This adds an additional risk to the transaction as digital asset regulation remains unclear in most jurisdictions and is subject to change. The materiality of this risk for Maker, its Core Units, and individual contributors remains untested. Mitigating Factors: SocGen remains in good standing with its regulators and has exhibited a clear interest in experimenting with digital assets and blockchain technology more broadly. This transaction could help align Maker and SocGen to assist one another navigating any future regulatory changes. SocGen’s real world influence and extensive experience with regulation could be very beneficial to Maker going forward. Collateral Risk of OFH Tokens: Per the MIP6, “the OFH Tokens are characterized as covered bonds under French Law backed by home loans” which were issued as tokens on the Ethereum chain. The OFH Tokens (covered bonds) are therefore dependent on the quality of the underlying borrower and of the lien on home loans. Systemic housing market disruptions or outsized loan failures could pressure the standing of these assets. Maker would be exposed to these risks as long as the OFH Tokens are held as collateral. Mitigating Factors: The OFH Tokens are rated aaa by Moody’s and AAA by Fitch with robust underlying loan metrics. The home loans comprising the OFH Tokens are 79% owner-occupied, with an average balance of €129,039, weighted average CLTV of 69%, and ~4.0 year weighted average remaining life. Given the historical performance of the covered bond asset class even in stressed conditions, we believe the risk of the underlying collateral to be aligned with the requirements outlined in MIP67. Liquidity Risk: Maker would become the owner of the OFH Tokens in the event of a default by SocGen / SG Forge. The OFH Tokens are subject to market volatility and potential illiquidity, despite their strong credit ratings. It is possible that Maker could receive the OFH Tokens through default and not be able to sell the collateral assets at a high enough price to replenish the DAI issued, creating a loss for the protocol. Maker could also find no market for the OFH Tokens and need to retain control of the assets until buyers emerge. Mitigating Factors: The strong credit ratings of SocGen, SG Forge and the OFH Tokens indicate there being a very low risk of default by any entity or asset, reducing collateral liquidity concerns. Additionally, the global covered bond market remains highly liquid; Thomson Reuters states that “global demand for covered bonds is substantial,” citing the ECB Fact Book’s estimation of a $3.35 trillion covered bond market at year-end 2020. Maker could expect to find strong demand for these assets in the unlikely instance of default. Currency Exposure: The loans underlying the OFH Tokens are denominated in euros with payments made in that currency. In the event SG Forge cannot repay Maker, Maker would own the OFH Tokens, thus receiving payments on the underlying loans in Euros. Maker may not be able to fully replenish its DAI with the remittances, if the value of the Euro were less than that of the USD (the basis of DAI’s peg). Mitigating Factors: As noted above in “Liquidity Risk,” a default scenario is highly unlikely. However, should one occur, Maker would likely find a highly liquid market for the OFH Tokens, negating the need to collect home loan interest payments. Structural Risk: This transaction is an entirely new innovation. As such, it has not been tested and unforeseen structural inadequacies may emerge. Mitigating Factors: SocGen is very experienced in traditional finance transaction structures and, as it is subject to intense regulation, can be expected to thoroughly test all aspects of the deal prior to implementation. Likewise, the Maker Community and its core units have used their extensive DeFi experience to review and test all known weaknesses in this arrangement.  Process Overview Since the beginning of the collateral onboarding process multiple CUs have engaged with the counterparty to iron out the required details across a series of dimensions: legal, commercial, technological, and strategic. In doing so, all parties involved have performed their duties at the highest standards of quality and professionalism. The fact that, following their initial approach, SocGen, as a highly regulated and respected globally system institution, has decided to proceed towards the last steps of the transaction is a testament of the standards of quality proven by the Maker community and its Mandated Actors. As a (prospective) oversight and facilitating unit, LOVE has nothing to point out; the business practices followed throughout the transaction will set the standards for all real-world initiatives to come. We hope that this transaction will open the way for more to come, and that those future transactions will benefit from the ground work completed in this benchmark deal. Ultimately, although potential conflicts of interests within the community should not constitute a deal blocker per se if disclosed appropriately, no member of the diligencing team has outlined any conflict that might diminish the reliability of their assessment.  Conclusion & LOVE Recommendation This transaction is highly strategic. This transaction represents a unique opportunity for Maker to directly engage with a top-notch traditional financial institution in the SocGen Group. This could help Maker build its presence and reputation not only in DeFi, but also in the “real world”. Further, SocGen has presented this as an “experiment” with the implied possibility of similar future transactions. Executing this initial engagement well could lead to additional, larger contracts with higher revenue potential in the future. Additionally, this transaction presents a completely new range of benefits to Maker as it builds its presence and expands into the traditional financial services realm with an established entity. Its risks have been heavily mitigated and remain low. The transaction is not without risks, as outlined above. However, SocGen’s strength (in earnings, capital, reputation, highly regulated nature), combined with the quality of the collateral assets, help mitigate many of these specific risk factors. The centralisation aspect of the transaction, however, both at the counterparty level (i.e. the custodial nature of the collateral and collateral-related activity) and at Maker’s (with the creation of a Maker Delegated Committee) should and will be monitored by LOVE (subject to ratification) and other members of the community. Deal vs. market pricing should be addressed holistically. The proposed pricing appears slightly below market rates, as it has been addressed in previous comments on this thread. It should be recognised, however, that the counterparty is incurring significant additional costs in order to proceed with the deal. Those costs include, as indicated by the counterparty, structuring, crypto-specific hedging, and legal advisory fees. It is not responsibility of LOVE to indicate whether a proposed pricing is acceptable or not by the community, but all those elements should be taken into consideration. The process followed has been of the highest quality. The process followed by all teams has been of the highest quality, and the risk assessment provided by RWF is extremely comprehensive and balanced. No conflict of interest has been outlined by the community members. LOVE, based on its thorough review of this transaction and extensive experience working with traditional banks, recommends proceeding with the SocGen agreement as presented herein. Please note that the LOVE Core Unit is in incubation with its ratification subject to vote by the MakerDAO community. ",
                    "links": [
                        "https://forum.makerdao.com/t/real-world-finance-decision-making-and-delegated-committee-proposal/15276",
                        "https://forum.makerdao.com/t/security-tokens-refinancing-mip6-application-for-ofh-tokens/10605",
                        "https://forum.makerdao.com/t/mip67-methodology-and-review-process-for-structured-finance-transactions/13737",
                        "https://uk.practicallaw.thomsonreuters.com/w-017-3227?transitionType=Default&contextData=(sc.Default)&firstPage=true#co_anchor_a953372",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-julio-01-de-agosto-del-2022/17049",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/7"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.473484007357064
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#15",
                    "likes": "5",
                    "time": "07/07/2022-02:53:57",
                    "content": "As an addendum to the SG Forge (“SG Forge”) - RWA Collateral Onboarding Risk Assessment and to complete the process described in the section “Maker/Delegated Committee Decisioning”, the following persons are proposed to serve on the Delegated Committee for the SG Forge transaction:     Name Maker Forum Handle Primary Employer     Jeremy Kim @Jeremy_Kim End Labs   Kevin Miao @humancapitol BlockTower   Joshua Pritikin @psychonaut Maker   Frank Cruz @flipflopflapdelegate Maker Delegate   Justin Shee @justin1066 CitizenG    The Delegated Committee quorum requirements are three of five delegates. Once there is a quorum, the Delegated Committee makes decisions on the basis of unanimity. If the Delegated Committee is unable to reach unanimity, the Delegated Committee shall request guidance from the Maker token holders via a posting at forum.makerdao.com. The Instruction to included in the Governance Poll and Executive Spell for the SG Forge transaction can be found here - Instruction @Real-World-Finance @Jeremy_Kim @humancapitol @flipflopflapdelegate @psychonaut @justin1066 ",
                    "links": [
                        "https://app.ardrive.io/#/drives/88f77a3c-4a78-4874-8a95-450a4b790997?name=SG+Forge",
                        "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2023-01-19/19463",
                        "https://forum.makerdao.com/t/nov-16-2022-executive-contents/18747"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#16",
                    "likes": "0",
                    "time": "10/07/2022-22:11:32",
                    "content": "    Eumenes:  The Delegate Committee shall not take any of the following actions without the approval of Maker token holders pursuant to a vote in accordance with the MakerDAO protocol:  Increase or decrease the debt ceiling Reduce the stability fee Extend the maturity date Exercise the Lender Early Redemption Option (as described below) Any other matters determined by the Maker token holders from time to time via a Governance Poll and notified to the Delegated Committee via a posting on forum.makerdao.com          christiancdpetersen:  The Delegated Committee quorum requirements are three of five delegates. Once there is a quorum, the Delegated Committee makes decisions on the basis of unanimity.   How will the Delegated Committee technically work and what control do they actually have over the vault? Is this some kind of multisig situation? Does the above mean that the Delegated Committee can do these things but won’t do these things without a MKR vote first? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.284722222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#17",
                    "likes": "3",
                    "time": "11/07/2022-09:12:42",
                    "content": "From a technical POV I can assure you that the only way to change any onchain vault risk parameters, such as debt ceiling, stability fee, trigger liquidation etc. is through an executive spell by Maker Governance. Thus the committee has no direct control over protocol parameters. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#18",
                    "likes": "7",
                    "time": "11/07/2022-22:18:44",
                    "content": "@ChrisBlec - Thank you for your thoughtful questions. @lollike addressed some of the key considerations from a Maker vault perspective (so I will not repeat his answers). I would add, however, that none of the Delegated Committee members have access to any of the smart contracts associated with the vault. SocGen operates the functionality of the vault. In respect of the Delegated Committee, I had envisioned that the Risk Assessment plus Governance Poll plus Executive Vote would serve (by loose analogy) to organizational documents of a company. The purpose of stating these restrictions was to explicitly convey that the Delegated Committee did not have powers to undertake any of these matters. In corporate terms, such an action would be ultra vires. But since there is no real world legal entity involved, I thought that the Governance Poll and Executive Vote might serve as a proxy. In respect of collusion among the Delegated Committee members, I sought to minimize the risk by requiring unanimity in decisions and having the Delegated Committee members be from the Maker community. I will acknowledge that these measures do not eliminate the risk entirely. As a further mitigation, the Delegated Committee is to serve at the behest of the Maker token holders. As I have noted, the Maker token holders can always vote for the Delegated Committee be zero. At that point, DIIS Group will, by default, have to engage with the Maker community directly. Finally, clause 13 of the Instruction requires a Maker governance vote to amend any term of the Instruction - this includes a description of the DAI Loan Agreement (Schedule I) and the Pledge Agreement (Schedule II). So, to answer your question, while the Delegated Committee may engage with DIIS Group as the subject matters above, any of these issues will require a Maker governance vote to effectuate. I had not previously considered a multi-sig or other technological device to evidence Delegated Committee action. I have never used a multi-sig before so it is my lack of imagination on this point. I hope that this is responsive to your question. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.196571657509158
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#19",
                    "likes": "2",
                    "time": "11/07/2022-23:13:04",
                    "content": "    christiancdpetersen:  Finally, clause 13 of the Instruction requires a Maker governance vote to amend any term of the Instruction - this includes a description of the DAI Loan Agreement (Schedule I) and the Pledge Agreement (Schedule II).   @ChrisBlec For full transparency, I am adding here the immutable link to the Instruction Letter which is subject to Poll voting in question. This link is also in the poll. Instruction Letter on IPFS ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.305555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DIISGroup",
                    "index": "#20",
                    "likes": "6",
                    "time": "12/07/2022-09:23:12",
                    "content": "DIIS Group vote to the governance poll for the OFH token refinancing : 0xbfda75aae4ab2a43fb9cf79ac827528d3d1def172f1f225d4f8a37aa27a87ff1 By this vote we accept and we are happy to represent the Maker community for this refinancing Best regards, DIIS Group ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DIISGroup",
                    "index": "#21",
                    "likes": "5",
                    "time": "01/08/2022-08:21:12",
                    "content": "By this vote : 0x32bcd18038d388185b51b5c85f90a2bfc0db65c741fd08e009013f64c9408a24, DIIS Group confirms representing the MakerDAO community for the OFH token transaction with SG Forge. Thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#22",
                    "likes": "0",
                    "time": "30/10/2022-08:21:52",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}