{
    "poll_list": [
        {
            "title": "Adjust the MANA-A Debt Ceiling - November 2, 2020",
            "index": "4931",
            "option": "Yes",
            "supporting_mkr": "27,705",
            "highest_fraction": 0.97
        },
        {
            "title": "Adjust the ETH-B Debt Ceiling - November 2, 2020",
            "index": "4931",
            "option": "Yes",
            "supporting_mkr": "51,112",
            "highest_fraction": 0.96
        },
        {
            "title": "Adjust the ETH-A Debt Ceiling - November 2, 2020",
            "index": "4931",
            "option": "Yes",
            "supporting_mkr": "51,017",
            "highest_fraction": 0.96
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-debt-ceiling-adjustments-29th-oct-2020/4931",
            "title": "[Signal Request] Debt Ceiling Adjustments, 29th Oct 2020 ",
            "index": 4931,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "debt-ceiling",
                "sig-status-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "0",
                    "time": "29/10/2020-20:08:15",
                    "content": "Hey all, There were three Signals this week about changing Debt Ceilings for   WBTC-A (40m increase / 160m DC vote winning)  LINK-A (5m increase / 10m DC vote winning  USDT-A (7.5m decrease / 2.5m DC vote winning)  I think all of them make sense and I support including them in Monday’s on-chain poll. I would also like to propose additional Debt Ceiling adjustments for other Vault types to be included into Monday’s on-chain poll: ETH-A ETH-A has more than 200m unutilized DC, mostly due to the last increase related to yETH vaults. It seems yETH developers are still testing the new implementation, which might take some time. It is also questionable what kind of demand yETH vaults can attract this time when farming yields are much lower than in the past. I think leaving around 100m buffer should be fine. ETH-B It seems the initial 6% rate for ETH-B was too high to attract demand or migration from current ETH-A vaults, probably because liquidity mining yields have fallen in the past weeks. By proposing 4% SF we might see more traction. Still, ETH-B has OSM risks and since even 4% SF is questionable to attract huge demand, we might want to always have maximum utilization of DC. This is why 10m debt ceiling reduction is proposed. But again, we don’t know how much additional demand lower SF can attract and maybe we should be more optimistic here and leave DC where it is? MANA-A MANA liquidity became very shallow in the past few weeks and there is virtually no liquidity on DEX. Majority of volume happens on Huobi where wash trading might be performed. Daily traded volume reaches only $700.000 on average (7d rolling) if we include only relevant pairs and exchanges (as said Huobi is already questionable although included in volume metrics). Our new models for risk parameters that we are testing are showing that MANA should have only around 200.000 DAI DC at current liquidity levels. The limit is mostly defined by the ratio between DC and average daily CEX volume where we set 25% as a threshold. Please vote on the poll below regarding Debt Ceiling changes for ETH-A, ETH-B and MANA-A. Lower ETH-A Debt Ceiling from current 540m DAI to:     440m DAI 490m DAI No change Abstain     0 voters     Lower ETH-B Debt Ceiling from current 20m DAI to:     10m DAI 5m DAI No change Abstain     0 voters     Lower MANA-A Debt Ceiling from current 1m DAI to:     500.000 DAI 250.000 DAI No change Abstain     0 voters     Poll is open until this Sunday, November 1st 8pm UTC. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-increase-the-link-a-debt-ceiling/4863",
                        "https://forum.makerdao.com/t/signal-request-delist-usdt-as-a-collateral-asset/4853",
                        "https://forum.makerdao.com/t/rates-changes-proposal-26-oct-2020/4877",
                        "https://docs.google.com/spreadsheets/d/1zTR5XdljfmSN6Gq9-XpNQVZvlJteTXyYFxDNcMMr0hk/edit?usp=sharing",
                        "https://forum.makerdao.com/t/maker-relay-ep-19-en-espanol/4981",
                        "https://forum.makerdao.com/t/maker-relay-ep-19/4975"
                    ],
                    "GPT-summary": "The author of the post is proposing debt ceiling adjustments for various Vault types and is explaining the reasoning behind each proposal. The post also includes a poll for readers to vote on the proposed changes. A 3rd party could give constructive criticism, ask questions, or audit and review the proposal.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.22861169837914
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#2",
                    "likes": "3",
                    "time": "29/10/2020-22:24:25",
                    "content": "Well, we are currently getting 500k in usage for the MANA vault. Feels weird to have an even lower DC. Should we be considering a higher collateralization ratio? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#3",
                    "likes": "1",
                    "time": "30/10/2020-12:27:41",
                    "content": "That is also doable, but I maybe less preferred from UX perspective. We could mitigate some of the risks in similar fashion if LR is for instance increased to 200% or higher, but then Maker could potentially liquidate almost 1/3 of debt if users aren’t well informed so they have enough time to react prior to increase. We haven’t done something like this in the past, not really sure how well it would play out. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.739583333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#4",
                    "likes": "1",
                    "time": "30/10/2020-18:32:52",
                    "content": "    Primoz:  We haven’t done something like this in the past,   I have seen this happen when I had a broker account. It’s pretty unpleasant for vault holders. Is there any way that we could provide some advanced warning? If the increase was announced early and vault holders were given time to reduce debt then it could be a more acceptable. Is it possible in the current system to increase the collateralization ratio (CR) without triggering liquidations, but only refusing to issue more debt? I’m thinking of splitting the CR into a hard CR that triggers liquidations and a soft CR that merely shows up in the UI and guides vault holders to come into compliance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.060897435897436
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#5",
                    "likes": "1",
                    "time": "01/11/2020-22:44:15",
                    "content": "Polls closed, proposed Debt Ceiling changes for tomorrow’s on-chain poll are: ETH-A 540m -> 490m ETH-B 20m -> 10m WTBC-A 120m -> 160m LINK-A 5m -> 10m USDT-A 10m -> 2.5m MANA-A 1m -> 250k MANA-A poll was inconclusive, but as I described in the post, the liquidity situation doesn’t look very good and is only getting worse, so I rather see limiting DC below the current debt exposure (440.000 DAI). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.41
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#6",
                    "likes": "0",
                    "time": "02/11/2020-02:06:09",
                    "content": "Well, we should investigate adding a MANA-B vault. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "1",
                    "time": "11/11/2020-13:27:50",
                    "content": "The poll and executive for these changes both passed, and they are going live later today (2020-11-11) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "0",
                    "time": "18/11/2020-13:27:51",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2885"
}