{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/urgent-adjustments-to-tip-psm-usdc-a-dc/8274",
            "title": "[Urgent] Adjustments to `tip` & PSM-USDC-A DC ",
            "index": 8274,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "auctions",
                "sig-status-accepted",
                "liq-20",
                "psm-usdc-a"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "12",
                    "time": "23/05/2021-21:24:18",
                    "content": "Hey all, We have been noticing smaller vaults don’t get “kicked” soon enough as the variable 0.1% chip incentive is too small to compensate for gas costs when triggering a liquidation. We have been aware of these potential issues but have been advised by the @Protocol-Engineering team to evaluate this parameter at a later stage as it can have many attack vectors. Based on data of today’s liquidations, gas costs for kicking an auction measured around $100. Last week, these costs were higher and reached up to $300. Tip is a flat fee incentive for keepers when triggering or resetting an auction. In general, tip should be lower than the penalty fee applied to the smallest debt size defined by dust of 5.000 DAI currently (650 DAI). This protects the system to remain solvent. We believe 300 DAI tip value should be large enough to incentivize keepers to kick vaults. It may not be enough in a scenario where gas price goes over 500 gwei, but in such a scenario it is also questionable whether these smaller vaults will get settled at good prices. It is advised to still stay on consevative side since “incentive farming” at each auction reset is still a threat. Note also that the current chip incentive of 0.1% comes in addition to the tip incentive. Second parameter adjustment is based on the recent PSM-USDC-A exposure increase. Since the first price crash 4 days ago, DAI supply decreased by about 800m, while PSM exposure increased from 800m to 1.4bn currently. It is possible that another 30% decrease in prices leads to the current 2bn PSM becoming close to fully utilized. If it gets fully utilized, another 300m DAI demand not met with increased supply would increase the DAI price towards $1.03 (based on 1inch slippage estimations). Now, normally we would advise to increase PSM-USDC-A to 3bn but we have to note here that the full 2bn utilization might already lead to USDC backing 50%+ of DAI. Increasing PSM-USDC-A DC further has other consequences and the community should have a quick vote here. Do you agree with the tip value of 300 DAI?     Yes No Abstain     0 voters     What should be the new PSM-USDC-A Debt Ceiling?     2bn (no change) 2.5bn (+500m) 3bn (+1bn) 3.5bn (+1.5bn) Abstain     0 voters     The outcome of this signal may be included in an urgent executive depending on further developments in the market. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1fUoN05tQwVx3sXPp3MfqPXaHWlGOUHE8ZbLY7PRP-Es/edit#gid=0",
                        "https://community-development.makerdao.com/en/learn/governance/param-flat-kick-incentive/",
                        "https://community-development.makerdao.com/en/learn/governance/module-psm/",
                        "https://forum.makerdao.com/t/core-units-external-vendors-relationships/16598/7",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-143-thursday-may-27-17-00-utc/8228/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-46/8312",
                        "https://forum.makerdao.com/t/maker-relay-ep-46-en-espanol/8358",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-may-30th-2021/8495"
                    ],
                    "GPT-summary": "The author of the post is explaining two parameter adjustments to the tip and PSM-USDC-A DC. They are seeking feedback from the community on whether they agree with the proposed tip value of 300 DAI and what the new PSM-USDC-A Debt Ceiling should be. The post also includes data on liquidations and DAI supply, as well as potential consequences of increasing the PSM-USDC-A DC.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.226283240568955
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "4",
                    "time": "23/05/2021-21:32:54",
                    "content": "As a reminder, here are the resources on the urgent/emergency governance processes: Emergency / Urgent Governance Process and MIP24c4. Relevant to this signal:   @Risk-Core-Unit triggered this, so there is no strict quorum requirement or outcome. This will be used as input to determine what (if any) urgent governance actions (executives) the mandated actors propose in the coming week. We may add one or both of these changes to either the monthly executive vote, or to this weeks executive.  ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP24#mip24c4-urgent-response-procedure"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving information on governance processes",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#4",
                    "likes": "4",
                    "time": "24/05/2021-10:41:17",
                    "content": "I voted for 2B (No change), not because of the risk linked to usdc but because it is the easy solution to avoid the real problem. We need to boost the supply. We should think about it, because every time we increase the PSM it is a steep backward. The PSM went from 200M to 500M to 1B to 2B and 3B. 3B is 75% of our supply soon we will just give up on having any profit. I would have prefer, linked to this adjustments, to see some rate decrease to regain market shares. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#5",
                    "likes": "6",
                    "time": "24/05/2021-11:52:05",
                    "content": "FYI still evaluating proposed 300 DAI tip parameter. Normally it shouldn’t be a problem for vaults with debt value equal or higher than dust amount, but today I realized there are many abandoned vaults who have debt value of 20 DAI and could have been used for tip incentive farming as no one would settle such auction. So one could keep resetting an auction every 138min and earn net 300 DAI - gas costs each cycle. And there are 550 eth-a vaults below 100 DAI debt. Luckily these smaller vaults are mostly highly collateralized because they were opened long ago when Coinbase Earn programme was introduced in July 2019. So I don’t see high probability of them becoming undercollateralized and liquidated any time soon, but who knows. I think I’d still prefer an alternative solution to find few keepers who would kick smaller vaults and get compensated by the DAO for any gas related costs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.584444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#6",
                    "likes": "1",
                    "time": "24/05/2021-11:58:45",
                    "content": "I would prefer a sort of keeper option too, we can also retro pay them directly from a CU address, based on they expense + 10% or x% by sending the eth back to the address. That will avoid all problem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#7",
                    "likes": "10",
                    "time": "24/05/2021-14:51:42",
                    "content": "We have logic to prevent farming incentives by redoing very small auctions:   github.com   makerdao/dss/blob/master/src/clip.sol#L301      top = rmul(feedPrice, buf);     require(top > 0, \"Clipper/zero-top-price\");     sales[id].top = top;       // incentive to redo auction     uint256 _tip  = tip;     uint256 _chip = chip;     uint256 coin;     if (_tip > 0 || _chip > 0) {         uint256 _chost = chost;         if (tab >= _chost && mul(lot, feedPrice) >= _chost) {             coin = add(_tip, wmul(tab, _chip));             vat.suck(vow, kpr, coin);         }     }       emit Redo(id, top, tab, lot, usr, kpr, coin); }   // Buy up to `amt` of collateral from the auction indexed by `id`. //        Basically if either the tab or value of collateral (based on latest OSM price) is less than chop * dust, we don’t give any incentive for a redo. ",
                    "links": [
                        "https://github.com/makerdao/dss/blob/master/src/clip.sol#L301",
                        "https://forum.makerdao.com/t/protocol-engineering-month-in-review-may-2021/8471"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.256944444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#8",
                    "likes": "4",
                    "time": "24/05/2021-17:28:16",
                    "content": "@Kurt_Barry thats great, didn’t know we had this kind of protection. The dust has settled  We may still loose some money on barks of smaller vaults, but at least we can control it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Positive feedback on proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.023076923076923
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#9",
                    "likes": "6",
                    "time": "24/05/2021-18:55:52",
                    "content": "To clarify, I am not trying to express an opinion on the optimal course of action–just want to make sure the potential consequences are well-understood. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "12",
                    "time": "26/05/2021-14:36:23",
                    "content": "After discussing in yesterdays mandated actors call, both of the following will be included in this weeks executive vote as urgent governance inclusions:  PSM-USDC-A Debt Ceiling 2B DAI → 3B DAI. Flat Kick Incentive (tip) 0 DAI → 300 DAI.  Reasoning is as follows: PSM Debt Ceiling  Governance has more or less already made the decision to prioritise holding the dollar peg tightly, even if it results in onboarding additional USDC, this is in line with previous decisions. We already hold USDC in existential risk amounts, adding more doesn’t make it more of an existential risk. Given this urgent signal poll, community seems broadly in favour of an increase. Efforts to reduce reliance on USDC should be done in parallel to this, rather than instead of this. If we onboard large amounts of USDC and still break the dollar peg, we took on a cost without the corresponding benefit.  Flat Kick Incentive  Community strongly in favour in the above poll. Protocol Engineering are confident this specific change doesn’t represent a threat to the protocol. It is synergistic with current efforts to get keepers to kick auctions swiftly (easier to convince keepers if the cost is balanced or mitigated with the tip).  ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-47-en-espanol/8547",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-143-thursday-may-27-17-00-utc/8228/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-47/8491",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/33",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-143-thursday-may-27-17-00-utc/8228/6",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-21-27/8379"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.631827731092437
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#12",
                    "likes": "0",
                    "time": "29/05/2021-18:33:02",
                    "content": "USDC PSM is being used 100M per day, are we sure that 1B headroom is enough? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#13",
                    "likes": "0",
                    "time": "29/05/2021-19:33:08",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#14",
                    "likes": "2",
                    "time": "29/05/2021-22:14:12",
                    "content": "It is possible it won’t be enough, but it really depends on ETH price going forward and what the overall sentiment will be. Stablecoin demand is only picking up, not just from borrowers unwinding their positions. There are many indicators of risk off environment in crypto (perpetual funding rates going negative after long time). Short term, lower rates that could be proposed next week and tout of 0% should help a bit. I personally think peg shouldn’t escalate even if PSM DC gets utilized fully for a short period of time, but only if community/MKR holders give a clear signal it will do “whatever it takes” despite the growing USDC allocation at Maker. Arbitrageurs and speculators should do their work then, but of course it is not guaranteed, nothing to rely on and can still lead to some DAI price volatility. So yes, community may need to start thinking whether there is a hard cap on PSM USDC debt ceiling at all? Going much higher from here doesn’t make much difference risk wise because we are already too exposed to be able to hedge against for some time already, so I guess it is only about PR? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4520833333333325
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#15",
                    "likes": "0",
                    "time": "29/05/2021-23:21:10",
                    "content": "I don’t think sentiment is suddenly going to turn around. Crypto is an almost entirely momentum-based space and that means we are at the mercy of ETH’s 20 day MA, which we are way below at the moment. We should be prepared that we have much further to go in terms of borrowing demand contraction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#17",
                    "likes": "4",
                    "time": "01/06/2021-11:13:10",
                    "content": "Executive containing these changes here has successfully passed, and the changes will become active at 2021-06-02 14:00 UTC. Thanks to all who voted. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.361111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#18",
                    "likes": "0",
                    "time": "01/07/2021-21:14:09",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}