{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/migration-portal-redemption-after-scd-shutdown-may-12th-2020/2253",
            "title": "Migration Portal: Redemption after SCD Shutdown (May 12th 2020) ",
            "index": 2253,
            "category": [
                "Governance"
            ],
            "tags": [
                "scd-shutdown"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "6",
                    "time": "29/04/2020-11:15:20",
                    "content": "On May the 12th Single Collateral Dai will be shutdown. In anticipation of this shutdown the protocol allows users to redeem underlying ETH collateral for any Sai or CDPs that they own. This capability will be available by using the Migration Portal. A quick recap of the redemption process:  On May the 12th at 16:00 UTC the spell to shutdown SCD will be cast . This timing was voted on the 24th of April and determined that the grace period will end on the 12th. Upon shutdown, Sai holders are able to instantly redeem a proportional amount of ETH collateral from the Migration Portal. The Sai holder will be entitled to one unit of Sai per $1 of ETH. The value of ETH will be determined at the time of shutdown and will be based on the ETHUSD price oracle. Once the above spell is cast, a bite keeper run by the foundation will bite all the CDPs to remove debt from the system. The removal of debt from the system is necessary for CDP owners to claim the most amount of ETH for every unit of PETH that they hold. As a result there is a 6 hour cool down period for this process to complete itself. Once the cool down period has completed, CDP owners will then be able to redeem their collateral in the Migration Portal.  Note:  Please only visit migrate.makerdao.com for these redemption tasks as there may be scam sites trying to steal user funds. Please ask on our Forum or chat if in doubt. There is no expiry or cutoff date for you to redeem your collateral. After shutdown, Sai will be exposed to the price of ETH and will track it from that point onwards. As mentioned above, this is because the ETH price will be determined at shutdown by the ETHUSD price oracle. Any numbers shown below are indicative values and do not represent actual PETH:ETH rates.   Migration Portal Walk-through: Redeeming Sai  Redeem Sai1169×390 70.6 KB    Migration Overview Page will detect if the user is a SAI holder and will prompt them to continue to redeem a proportional amount of ETH.  Redeem Sai for Collateral will prompt the user to select the amount of Sai they wish to redeem. The user is also able to view supporting information such as the exchange rate determined at the time of shutdown, the balance in their account and the value in ETH.  Confirm Transaction will require the user to confirm their transaction in the interface and MetaMask or other wallet in use.  Redemption Complete illustrates the transaction information with a link to Etherscan for further detail.   Migration Portal Walk-Through: Redeeming a CDP  Redeem CDP1168×321 91.2 KB    Migration Overview Page will detect if you own a CDP. Owners will be required to wait 6 hours for the cool down period for system debt to be cleared before continuing.  Redeem Sai CDPs for Collateral will prompt the user to select their CDP(s) for redemption. They will also be able to view the PETH:ETH ratio confirming that the bite keeper has removed debt from the system.  Confirm Transaction(s) will require the user to confirm their transaction in the interface and MetaMask or other wallet in use.  Redemption Complete illustrates the transaction information with a link to Etherscan for further detail. In the event that the user has approved multiple CDPs, each respective transaction will also be shown.  For more information about SCD shutdown please visit our blog for more information. ",
                    "links": [
                        "http://migrate.makerdao.com",
                        "https://blog.makerdao.com/a-guide-to-single-collateral-dai-sai-shutdown/",
                        "https://forum.makerdao.com/t/can-i-still-migrate-sai/3496/3",
                        "https://forum.makerdao.com/t/looking-for-help-with-an-old-cdp-from-last-year/3674/14",
                        "https://forum.makerdao.com/t/sai-to-eth-conversion-fail-with-no-error/5262/11",
                        "https://forum.makerdao.com/t/super-old-sai-loan/13673/2",
                        "https://forum.makerdao.com/t/sequential-process-for-scd-shutdown/1823/33",
                        "https://forum.makerdao.com/t/signal-request-grace-period-between-when-scd-shutdown-spell-is-scheduled-and-actual-shutdown/1992/22",
                        "https://forum.makerdao.com/t/sai-to-eth-conversion-fail-with-no-error/5262/3"
                    ],
                    "GPT-summary": "The post explains the process of redeeming underlying ETH collateral for any Sai or CDPs that users own, in anticipation of the shutdown of Single Collateral Dai on May 12th. The post provides a step-by-step guide to the redemption process and warns users to only visit the official Migration Portal to avoid scam sites. The post also mentions a 6-hour cool down period for the removal of debt from the system, which is necessary for CDP owners to claim the most amount of ETH for every unit of PETH that they hold. The post invites users to visit the MakerDAO blog for more information about the SCD shutdown.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.979086229086229
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek98",
                    "index": "#2",
                    "likes": "0",
                    "time": "30/04/2020-16:03:49",
                    "content": "A nice guide Thanks anyway! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/saitodaiplease",
                    "index": "#3",
                    "likes": "0",
                    "time": "02/08/2020-07:34:22",
                    "content": "Can I still do this? Will that migrate.makerdao.com website still work? Edit: USER_SCOPED_TEMP_DATA_orca-image--932042759720×1395 62.8 KB Seems to, but the network fee is very unusual. Can anyone explain if this website is still functional, and why the network fees are so unusually high? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.05
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#4",
                    "likes": "1",
                    "time": "03/08/2020-12:33:58",
                    "content": "Hi Saitodaiplease (I see Doo answered your question in a parallel thread) and for others, yes, the migrate.makerdao.com site continues to be maintained by Maker and is functional. Depending on your situation it may however make sense to wait for gas prices to come down. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving advice on using the Migration Portal",
                        "3rd party giving advice on waiting for gas prices to come down"
                    ],
                    "Sentiment": 4.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vger",
                    "index": "#5",
                    "likes": "0",
                    "time": "29/10/2020-06:41:27",
                    "content": "Hi, I had a position open a while ago and when I try to migrate, I get this error. Could you kindly share your feedback onScreen Shot 2020-10-29 at 10.11.34 AM3614×1904 237 KB  how to resolve this?         ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Topic1: 3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#6",
                    "likes": "1",
                    "time": "30/10/2020-12:11:41",
                    "content": "Hi @vger I’ve tested the portal and it is functioning. If you’d like to send me a direct message with a transaction I can take a look and try to resolve for you. Initially, make sure you are correcting with the wallet connected to your CDP/Vault and that you have enough ETH for the transaction in your account. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tardymardy",
                    "index": "#7",
                    "likes": "0",
                    "time": "05/01/2021-09:48:15",
                    "content": "Hi Derek, I’m having the same problem as vger above. I’m trying to migrate (Withdraw ETH from Sai CDPs) but the page always comes up as “Redemption Failed”. I’m using my ledger nano. Could you help? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#8",
                    "likes": "1",
                    "time": "05/01/2021-11:35:05",
                    "content": "Hi @tardymardy , A few things come to mind;  Make sure that the latest Ledger software is installed Make sure that contract data is enabled on the Ledger (to enabling contract data on your Ledger, go to \"Ethereum”, go to \"Settings”, go to “Contract Data” and select \"Yes”). Make sure that there is enough ETH on the ledger to facilitate the transaction  If for some reason you are unable to approve the transaction on the Ledger, you can also connect to the migrate.makerdao.com page with your Nano via MetaMask when selecting ‘connect hardware wallet’ in MetaMask. Good luck and let me know how you get on! ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.359375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tardymardy",
                    "index": "#9",
                    "likes": "0",
                    "time": "06/01/2021-17:04:55",
                    "content": "Thanks Derek! Your last suggestion with MetaMask worked! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/xiaolizi",
                    "index": "#10",
                    "likes": "0",
                    "time": "08/01/2021-12:15:38",
                    "content": "hi Derek @Derek  Can I still do this? Will that migrate.makerdao.com  website still work?image1857×1234 232 KB  i can‘t find the exchange link 。I need your help.         ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#11",
                    "likes": "0",
                    "time": "08/01/2021-13:22:17",
                    "content": "Yes, you can still do this. The above screenshot you have included is for redeeming the original MKR token. If you have the old token, you can redeem it through migrate.makerdao.com or if that fails to see your MKR token, you can walk through the google doc instructions on the above screenshot. Note, this screenshot you have included is only for the old MKR token, not for SAI (which is the topic of this thread). ",
                    "links": [
                        "https://docs.google.com/document/d/1Rh6GH3TkKrbEmzeEw6R3TrG2hmkmmqva5dTKzxftL8k/edit"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.359375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/xiaolizi",
                    "index": "#12",
                    "likes": "0",
                    "time": "09/01/2021-10:01:24",
                    "content": "@Derek Hi  Derek，Next step after  screenshot ，i can‘t find  exchange link，What should i do when i see this interface?Thinks Derek! I want  to find this interfiace.image1390×966 171 KB ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#13",
                    "likes": "1",
                    "time": "10/01/2021-13:16:46",
                    "content": "Hi @xiaolizi if that ^ page does not work/approve for you, please go to migrate.makerdao.com , alternatively, use the instructions in the google doc above to redeem tokens. If you still have problems… are your tokens in MetaMask or a Hardware Wallet? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AmethystWizard",
                    "index": "#14",
                    "likes": "0",
                    "time": "07/02/2021-03:34:47",
                    "content": "I could really use some help, I have an account with a large (for me) amount of SAI and I’m completely utterly confused and lost. I have my SAI in a wallet, can I just sell it? How do I turn it into DAI? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.023809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#15",
                    "likes": "0",
                    "time": "07/02/2021-03:52:38",
                    "content": "You should redeem the SAI for ETH using migrate.makerdao.com and sell the resulting ETH for DAI. There is a uniswap pool for SAI but you probably don’t want to use it directly because it has only $12,000 of liquidity. Lucky for you each SAI is worth more than 1 DAI due to ETH price increase. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.923611111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AmethystWizard",
                    "index": "#16",
                    "likes": "0",
                    "time": "07/02/2021-03:55:57",
                    "content": "Oh ok thank you! I will give it a try and let you know what happens - ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/uwkb",
                    "index": "#17",
                    "likes": "0",
                    "time": "28/03/2021-18:47:20",
                    "content": "I have 5.99 SAI, is it because of gas prices that nothing happens when I try to use the https://migrate.makerdao.com/ page? I’ve tried a couple of times over the past couple of months, using metamask linked account ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving feedback on proposal"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Dave_Lee",
                    "index": "#18",
                    "likes": "0",
                    "time": "27/07/2021-08:16:49",
                    "content": "Hi @Derek - facing the same issue as Tardymardy above. I keep getting the “redemption failed” message. I am using a Trezor. Any suggestions how to get this working? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#19",
                    "likes": "0",
                    "time": "27/07/2021-08:32:31",
                    "content": "Hi Dave, if you’ve done all of the above (updated firmware/ETH balance etc), then it may be easier to move the SAI to a metamask wallet and connect directly (to avoid any browser/Trezor issues that you may be having) ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Dave_Lee",
                    "index": "#20",
                    "likes": "0",
                    "time": "27/07/2021-12:22:09",
                    "content": "Thank Derek, will give that a try. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luckybusinessman",
                    "index": "#21",
                    "likes": "0",
                    "time": "18/06/2022-16:20:17",
                    "content": "Hi, @Derek . I have some SAI. Can I do something about it? migrate.makerdao.com doesn’t work for my metamask. Infinite loading after click “Unlock Sai to continue” screenshoot And the same thing when I am try to send these tokens to another address screenshoot ",
                    "links": [
                        "http://joxi.ru/Vrw1X1wuobNMD2",
                        "http://joxi.ru/8230603CzMV1YA"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#22",
                    "likes": "0",
                    "time": "19/06/2022-00:05:58",
                    "content": "Hello, hmm, it loads for me…I’m wondering if you have an older version of metamask perhaps? An alternative could be to do a swap on a dex like Uniswap - I think there is still liquidity there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.833333333333334
                }
            ]
        }
    ]
}