{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/chaos-labs-community-update-call-july-08-at-14-30-utc/16406",
            "title": "Chaos Labs - Community Update & Call - July 08 at 14:30 UTC ",
            "index": 16406,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "chaos-labs"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/benhoneill",
                    "index": "#1",
                    "likes": "22",
                    "time": "07/07/2022-10:29:14",
                    "content": " Introducing Chaos Labs Update Video Recording Deck Chaos Labs, a cloud security and testing platform for smart contract applications, joined the SES incubation program in November 2021. Since joining, Chaos Labs has been building an agent- and scenario-based simulation platform that enables robust testing of protocol performance under volatile market conditions, adversarial agents and heavy network traffic. Specifically, we’ve built a cloud environment that allows Maker engineers to test liquidations and auction mechanisms under different on-chain conditions. You can read our previous update to the community here.   Chaos Labs Motivation and Work to Date There have been previous attempts to create a production-grade testing platform for the Maker protocol, but the undertaking has been outside of the scope of the existing core units with complexity beyond their capacity for commitment. With protocols securing tens of billions in value across the ecosystem, testing and simulation tooling have never been more critical. Chaos Labs focuses on developer tooling and cloud infrastructure, allowing protocol developers to move fast on stable infrastructure. Our aim is to abstract away the complications of development and scale to provide a simple to use, custom tool for MakerDAO developers with a future-proof, cutting-edge development experience. The platform is currently live for protocols on the Ethereum, Polygon & Avalanche networks with expected expansion to all major Layer-2 protocols. While a part of the SES Program, we have been focused on a few major priorities:  Deeply understand the Maker protocol to understand the specific complexities within both the codebase and community processes to build sophisticated, useful simulations Build up the infrastructure to support Maker Core Units at scale, reliably (platform flexibility, simulation scale, user flows, dashboards, etc.) Design simulation outputs to more clearly translate what is happening under the hood to the community  The mission of the Chaos Labs Core Unit is to provide a future-proof blockchain testing platform and services to enable MakerDAO to continue building products with best-in-class and easy to display security as the protocol enters a new era of technological and economic complexity. Although high-quality simulation environments are critical for developers, it isn’t our only focus. We will also be targeting verifiability as a high priority item moving forward. It should be easy for the Maker community to verify the results of simulations before participating in governance.  Why is economic security important? MakerDAO already has a number of technical Core Units with one specifically focused on the areas of Oracles, Smart Contracts, Risk, and others — why does it need another to focus on “economic security”? Since the rise of “DeFi summer”, we’ve seen nefarious actors managing to manipulate core protocols in increasingly creative manners, no longer are they just looking for flaws in the code, but they are manipulating the market around the target protocol to gain entrance and exploit it.  image1920×833 50.2 KB  What Chaos Labs is building will provide each of these other specialty Core Units a new dimension by which they can use their expertise to test and secure the protocol, such as:  Adding multi-block, on-chain simulations to the Risk Core Unit’s dashboard Test new auction/liquidation mechanisms and process flows for new assets Run new assets through black swan event simulations prior to onboarding Oracle manipulation testing Additional layer of testing for all new protocol updates to understand long-duration impact, even if indirect Run each governance proposal (spell) through a set of sanity simulations to ensure the core functionality of Maker persists   Challenges Unique to Maker In working with the SES Incubation Program, the team has pushed us regularly on the concept of “why should Chaos Labs not just be a vendor to MakerDAO?” The reason is simple: Maker is not a simple fork of another protocol with 200 lines of code, but a massively complex system with its own structure, terminology, and ethos. A vendor will always be playing catch up to new changes and will entirely rely on stakeholders for broader context whereas a Core Unit will be deeply ingrained in the protocol, able to not just support, but also partner with other Core Units, developers, and community members to better test new assets, protocol changes, and economic mechanisms via robust simulations with well-understood edge-cases. In contrast to other DeFi protocols that deploy completely new versions and deprecate older ones (think AAVE v1, v2, or Uniswap, etc), Maker has elected to continuously expand the existing offering and smart contract capabilities. This has led to it becoming one of the larger (and more unique) DeFi codebases that does not have a lot of conceptual ties to other, similar protocols. This large surface area needs to be covered end-to-end with automated run-time verification built by experts on each of the smart contract calls (bark, flip, dog, kick, etc.) and Maker-specific terminology. To demonstrate the value and capabilities of the Chaos Lab Core Unit we decided to focus on the following themes:  Oracle configuration - specialized for the Maker Oracle Security Model Auction & liquidation simulations Collateral onboarding Third party contagion testing (i.e. liquidation cascades)   Auctions & liquidations are one of the most critical flows for Maker. In times of high market, volatility auctions are a line of defense that protects the protocol from insolvency. To this end, we partnered with the independent MakerDAO core unit, Sidestream.  How we’ve been working with Sidestream  Sidestream works on auction services for Maker which relies on the liquidation process to ensure  DAI maintains its peg. The team needs to simulate and work with a variety of liquidation scenarios that may not have happened yet or that are very hard to recreate. Imagine the following scenarios:  Massive Collateralized Debt Positions going underwater Understanding Keeper incentives as a function of on-chain conditions. Is it economically beneficial to liquidate a vault? Adding new assets and understanding their relative risk and liquidation mechanisms (i.e. how much debt can be liquidated with minimal slippage)  This challenge is perfectly suited for the Chaos Platform. Using the Chaos Platform we easily built a set of simulations that could support a wide variety of liquidations scenarios within the Maker protocol. Each simulation instance triggers an on-demand Ethereum fork allowing the simulation to run based on the latest on-chain data related to account balances, pool depth, and mainnet code deployed on downstream protocols. Any team using our platform could spawn multiple customized scenarios and replay them when needed: based on new code they want to test or on a recurring, scheduled basis to understand changing market dynamics. Ultimately, the Chaos Platform now supports a series Maker liquidations simulations such as:  Dropping prices of OSM oracles by n% of the original price per given collateral type  This can be dropped immediately and over a certain number of blocks, or Via a generic capability to control over the price drop (drop by X every Y block starting from Z initial value) so it can be easily configured to Black Thursday scenario where the price dropped by 1.2% every 100 blocks over 3710 blocks total   Configuring keepers to watch for given vault IDs or ilk type as they try to trigger liquidations for eligible vaults Triggering the full liquidation flow for: specific vault IDs and top eligible vaults per collateral type New asset additions and the auction/liquidation impact Surplus auctions & selling DAI  Flips and Flaps have been integrated into the simulation engine Flops is on the near-term roadmap to be included    Before Chaos, there was no mechanism by which these teams could accurately understand what impact their proposed changes would have on the broader MakerDAO protocol using onchain, real data. The Sidestream team recently got access to the hosted Chaos simulation environment and has been utilizing simulations run via API and CI in their development environment. These tools allow for a significantly greater testing surface area at each stage of development to iteration on options for mechanism design and parameter setting to bring forth the best potential option for integration. Below is an early iteration output for the Flap surplus auction that we will walk through in our update call on Friday. This simulation is manipulating Maker’s System Stabilizer Module (Flapper, Vow, Vat) to test the auction process of selling excess DAI for MKR - Surplus Auctions. The Fill Observer is tracking the amount of DAI being auctioned. The kick Event Counter Observer is counting Flapper kick events per block, each Kick event represents a new surplus auction starting  image1920×1006 34.6 KB   image1920×1445 92 KB   image2746×498 70.8 KB  Collateral Onboarding and MakerDAO Most recently we’ve been focused on helping the Sidestream team in understanding risk vectors and concerns around assets that the community wants to support. After the approval of rETH, they are working to prepare for its full integration into the protocol. To properly simulate a new asset, we would need to have coordination across multiple Core Units to integrate the full functionality of the asset’s integration into the protocol and understand it’s potential negative impact, such as:  join - Token Adapter contract. specific for each collateral type. Median contract - responsible for taking the pricing information provided by the Relayers, and verifying that the information is signed by the authorized list of Feeds pip (OSM) - the contract which holds the current price of a given ilk  clip - Auction manager contract clac - Auction price discovery curve. decided by the Auction Price Function gov proposal parameter  In partnership with Sidestream, we aim to build lasting infrastructure that will allow them to not only solve the problems at hand today, but provide tooling for future situations, as well. Instead of optimizing for just rETH, we want to optimize for a system that allows the user to test the risk spectrum for any asset listed in the future, even providing simulation outputs during the voting process instead of just after the community has approved a potential asset without full consideration of the risks involved. With each new functionality within the MakerDAO protocol we are getting a step closer to full protocol simulation functionality robust enough to truly streamline testing for all Core Units and the community at large.  Call for Feedback As the team prepares for Core Unit ratification this fall, we will onboard additional Core Unit teams to begin tying the simulations together holistically so that outputs are more informative for each team and better understand the nuances of their needs from the platform. As stated above, this will allow us to expand Maker-specific simulation capabilities to include a wider breadth of black swan scenarios and analytical tools. By the end of the year, we anticipate the platform being ready for all major CUs related to Maker development to be testing on the same platform allowing for all teams to see the impacts of each other’s proposals and changes. The team is aware that now is not an easy time to onboard new core units, but is steadfast in its desire to get started. This is why we want to start the conversation early and look for as much community feedback as possible prior to the MIP being finalized.  What’s Next On the MakerDAO SES side - Chaos Labs is nearing graduation of the SES Incubation Program and will be releasing its MIP set for Core Unit consideration in the coming weeks for community review. Over the coming weeks, alongside the Core Unit proposal process, we will continue work with the Sidestream team while engaging other Core Units & protocol developers to understand expanded simulation scope and feature needs. We invite the community to join @Omer_Goldberg and I this Friday (July 8) at14:30 UTC to hear more during the SES Update call as we kick off our application to join the MakerDAO community on a more permanent basis. We will also be scheduling an hour-long platform walkthrough detailing multiple Maker-specific simulations / features and Q&A for early August to better engage with the community and educate stakeholders on the value this Core Unit can provide. ",
                    "links": [
                        "https://docs.google.com/presentation/d/1IM1GcTEVJiFIl7l8p-viHkCVpGQ2dR4goEo60Fi_Hxc/edit#slide=id.p",
                        "https://forum.makerdao.com/t/chaos-labs-update/14605",
                        "https://www.sidestream.tech/maker-dao",
                        "https://auctions.makerdao.com/flap",
                        "https://forum.makerdao.com/u/Omer_Goldberg",
                        "https://www.crowdcast.io/c/ses-biweekly-status-update-7",
                        "https://forum.makerdao.com/t/mip55c3-sp10-pionero-de-un-conjunto-de-datos-defi-nativos-para-modelar-la-dinamica-y-los-riesgos-impulsados-por-los-sentimientos-traduccion/17949",
                        "https://forum.makerdao.com/t/mip55c3-sp10-pioneer-a-defi-native-dataset-for-modelling-sentiment-driven-dynamics-and-risks-spf/17942"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.724741315594974
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#3",
                    "likes": "5",
                    "time": "07/07/2022-13:58:27",
                    "content": "    benhoneill:  Call for Feedback As the team prepares for Core Unit ratification this fall, we will onboard additional Core Unit teams to begin tying the simulations together holistically so that outputs are more informative for each team and better understand the nuances of their needs from the platform. As stated above, this will allow us to expand Maker-specific simulation capabilities to include a wider breadth of black swan scenarios and analytical tools. By the end of the year, we anticipate the platform being ready for all major CUs related to Maker development to be testing on the same platform allowing for all teams to see the impacts of each other’s proposals and changes. The team is aware that now is not an easy time to onboard new core units, but is steadfast in its desire to get started. This is why we want to start the conversation early and look for as much community feedback as possible prior to the MIP being finalized.   @Recognized-Delegates @Core-Facilitators Add to your Calendar   crowdcast    SES Biweekly Status Update | Chaos Labs Update Register now for SES Biweekly Status Update | Chaos Labs Update on crowdcast, scheduled to go live on July 8, 2022, 04:30 PM GMT+2.      ",
                    "links": [
                        "https://www.crowdcast.io/c/ses-biweekly-status-update-7",
                        "https://www.crowdcast.io/c/ses-biweekly-status-update-7"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.72969276094276
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#4",
                    "likes": "4",
                    "time": "08/07/2022-02:14:42",
                    "content": "I don’t think we need a core unit for this. It sounds like a service that can be hired if needed by existing core units like PE or SES. Not everything needs its own core unit ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benhoneill",
                    "index": "#5",
                    "likes": "7",
                    "time": "08/07/2022-02:45:33",
                    "content": "Hi @Ippy - this is one of the primary topics we’ll be discussing in the community call tomorrow. Would love to walk you through how we’re thinking about the vendor / core unit relationship and why it makes sense for Chaos! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jackchong.eth",
                    "index": "#6",
                    "likes": "6",
                    "time": "10/07/2022-14:11:25",
                    "content": "Is the call recorded? Would love to watch playback. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benhoneill",
                    "index": "#7",
                    "likes": "4",
                    "time": "11/07/2022-20:25:55",
                    "content": "Hi Jack - recording was just uploaded and you can find it here! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#8",
                    "likes": "0",
                    "time": "14/07/2022-12:25:24",
                    "content": "10 posts were split to a new topic: Core Units & External Vendors Relationships ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#9",
                    "likes": "0",
                    "time": "11/07/2022-23:01:37",
                    "content": "@benhoneill If market conditions do not support onboarding currently, how much runway do you (ChaosLabs) have to hold out waiting for conditions to improve? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#10",
                    "likes": "4",
                    "time": "12/07/2022-01:04:48",
                    "content": "   Core Units & External Vendors Relationships   this upcoming CU will apply with a cost of $ 2.5 million annually   I will file a proposal to offboard this CU if it costs more than 1 million dai, inclusive of token vesting. The exception would be if it has some way to generate revenue. But the DAO has not needed it in the past, so I cannot in good conscience support bringing it on while also suggesting other units be removed. Even under 1 million, I would want to hear from PE and Risk and others why they want to advocate for this proposed unit. ",
                    "links": [
                        "https://forum.makerdao.com/t/core-units-external-vendors-relationships/16598/7"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#11",
                    "likes": "5",
                    "time": "12/07/2022-10:29:46",
                    "content": "I fully agree budget concerns and pending Core Units cuts is a difficult environment to discuss the value of adding a team, and a new layer of testing infrastructure. But I’m curious to hear the community’s thoughts on Chaos Labs’ work and value proposition…  What does the community think about creating a Unified Testing Infrastructure? What additional agent-based-simulation test would the community put the most value on?  Moving the conversation to be more based around “this is what/how Chaos Labs can create value for MakerDAO” will help the team align the budget to the demands of the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.536363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#12",
                    "likes": "1",
                    "time": "12/07/2022-11:05:49",
                    "content": "My comment on the work is I believe there’s quite a lot of overlap with the Risk CU which also conducts analysis and research to examine different parameters and sensitivity. Even assuming the budget is not an issue, I believe the current Risk CU can and do handle such already ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#17",
                    "likes": "1",
                    "time": "12/07/2022-17:56:28",
                    "content": "Do think maybe it’s worthwhile to turn this into separate thread, but I think it’s also SES just doing its mandate which includes incubating potential CUs. And it’s SES’s role to convince the community to embrace such incubated CUs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#21",
                    "likes": "3",
                    "time": "12/07/2022-21:55:52",
                    "content": "Thank you for your response. I must say it’s a tough sell because once again, not sure whether it’s much more superior to Risk CU. But let’s assume that your service works as intended, the issue is also what the protocol do with such information might be quite limited. The Maker protocol is already suffering from more and more Vaults (CDP) closing down, and a lot of such risk has been mitigated for better or worse as many large vault owners were forced to close (For example, Celsius with their vaults). Now there might be very specific situations that the Maker protocol might need assistance and once again, as a vendor sending in competitive bid might be reasonable. However, having as a CU where the protocol needs to pay from Salary to Healthcare to Travel and etc do not make sense.    Core Units & External Vendors Relationships    complicated price drop scenarios cross-protocol contagion and impact on liquidations multi-agent modeling on how CDPs will react prior to liquidation specific “random” simulations and attack vectors such as [Urgent] Adjustments to tip & PSM-USDC-A DC     ",
                    "links": [
                        "https://forum.makerdao.com/t/urgent-adjustments-to-tip-psm-usdc-a-dc/8274",
                        "https://forum.makerdao.com/t/core-units-external-vendors-relationships/16598/9"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.227915804002761
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#22",
                    "likes": "2",
                    "time": "13/07/2022-00:05:32",
                    "content": "    Doo_StableLab:  And it’s SES’s role to convince the community to embrace such incubated CUs.   Nope.  We said it in the past already: we strive for incubated Core Units to be independent and true to their vision. This means that the Core Units will depend less (ideally not at all) on SES and they will contribute to Maker the way they want. The downside of this approach is that SES might not fully agree with the Core Unit after they are done with the Incubation Program (this can include (but it’s not limited to) vision, strategy, budgets, execution, etc.). It’s up to the MKR holders and delegates to evaluate proposals. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.656462585034014
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#23",
                    "likes": "1",
                    "time": "13/07/2022-00:23:10",
                    "content": "    juan:  It’s up to the MKR holders and delegates to evaluate proposals.   If that is true then why is SES arguing that the Maker holders misunderstood when they voted? Not to mention SES writing in depth challenging current budget adjustments sentiment and also idea for vendor? I mean that’s fine but I think it’s fair to say SES is at least defending incubated CU.     wouter:  I don’t believe the alternative has been seriously considered though. I think that a more advanced scenario may also win if it was put up for a vote.      Core Units & External Vendors Relationships   This poses tremendous challenges on an operational level. If we will insist to run break-even even during the worst bear markets, it’s always going to hurt us badly. And it will clearly lead to sub-optimal performance.   ",
                    "links": [
                        "https://forum.makerdao.com/t/core-units-external-vendors-relationships/16598/8"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.454427083333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#24",
                    "likes": "4",
                    "time": "13/07/2022-00:34:22",
                    "content": "I didn’t say we didn’t have an opinion. Even other members from SES might have different opinions about this. Same as other Core Units giving their input (this is great). But it’s up to you (and the other delegates) to judge it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.354166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#25",
                    "likes": "0",
                    "time": "13/07/2022-00:39:56",
                    "content": "Ok, fair enough. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#29",
                    "likes": "0",
                    "time": "13/07/2022-10:23:39",
                    "content": "   Core Units & External Vendors Relationships   we should be asking what innovative initiatives can deliver and replace the lost revenue, as oppose to attempting to slow down the development of MakerDAO via much needed tooling.   I think we both agree that some toolings are crucial to growth and revenue while some are not. And it’s my stance that this tooling is of later category ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.174603174603175
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Omer_Goldberg",
                    "index": "#30",
                    "likes": "4",
                    "time": "13/07/2022-13:04:29",
                    "content": "Hi all - wanted to jump in quickly and provide additional context. Apologies in advance for any lack of clarity on our end. The Chaos Labs’ mandate and focus are not solely on risk and vaults. We’ve used vaults and oracle configuration/manipulation as a focus area for our POCs executed with Sidestream as this was flagged as a high impact/priority area in our research documented here as the first stage of our SES engagement. While we can deliver a lot of value in these areas, a successful integration impact will span the entirety of the protocol. A unified/common simulation and testing infrastructure and platform will allow for:  Faster iterations / improved workflow – teams will be able to focus on protocol innovation instead of pouring resources into configurations, setups, and cloud environments Increased experimentation – a better developer experience, coupled with stable, reliable, and reusable infrastructure will decrease the barrier to experimentation. Ultimately, the ability to produce high-fidelity experiments will drive protocol innovation and delivery times and should produce a clear path to increase revenues Stable infrastructure and standardized methodology and testing before pushing code - With the ever-increasing complexity and growth of the Maker codebase, this is necessary. Building such an infrastructure for ~9 independent core units requires a concentrated effort, focus and devotion of resources. Easier cross CU collaborations - new testing infrastructure and tooling should serve as a common denominator between units and allow for effective collaboration. My anticipation and experience across tech orgs of varying sizes have shown me that unified tooling/metrics and testing practices are imperative for creating cohesion between independent working groups.  To drive this home – Chaos Labs is not replacing the Risk Team or focusing on parameter optimization. Our vision is to build a platform and tooling to empower teams to stress test and optimize protocols by easily orchestrating any blockchain environment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0185383244206765
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#31",
                    "likes": "2",
                    "time": "13/07/2022-13:27:33",
                    "content": "Great that the team has done some work with Maker side but then once again, my challenge is why the Chaos Labs wants to be CU because all of these simulation and testing infrastructure can come if CUs specifically ask for them and the Maker governance approves it. In addition, I don’t think I can support the team has been willingly help ecosystems that are hostile to Maker protocol even after joining Maker SES. The Maker community should really rethink about funding a CU everything from travel to healthcare to software expense so they can help build Terra ecosystem with affordable grant rather than the whole cost that they are demanding from the Maker protocol.  image1209×539 56.8 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.65
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#32",
                    "likes": "0",
                    "time": "13/07/2022-13:28:58",
                    "content": "@Omer_Goldberg Serious question, why can’t Maker have a relationship the team had with Terra and just maintain flexible grant / vendor? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benhoneill",
                    "index": "#33",
                    "likes": "3",
                    "time": "13/07/2022-13:31:57",
                    "content": "Hey @Doo_StableLab - to clarify what that image is from and the work done, it was a grant from Chainlink to build infrastructure to manipulate Chainlink oracles on the Terra blockchain.  Add Chainlink oracle CLI utility on Terra—Once the LocalTerra integration is complete, developers will be able to start working with Chainlink oracles within the local development environment. This CLI utility on Terra (similar to the existing CLI utility on Ethereum) will give developers control of Chainlink Data Feeds within LocalTerra, enabling seamless integration and end-to-end testing for dApps using Chainlink on Terra.  The full post can be found here and you’ll see that we’ve done the same work on Uniswap (as part of UGP) and Maker (via SES) as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#34",
                    "likes": "2",
                    "time": "13/07/2022-13:34:55",
                    "content": "Yes, which the team accepted to build for the Terra blockchain, which the team could have decided not to proceed for conflict of interest or optics but decided to accept it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#36",
                    "likes": "5",
                    "time": "14/07/2022-08:36:19",
                    "content": "    Doo_StableLab:  In addition, I don’t think I can support the team has been willingly help ecosystems that are hostile to Maker protocol even after joining Maker SES.   In the “real-world” there is a general believe that ALL DeFi is unsecured or undercollateralized lending and credit risks/counterparty risks is not being assessed with vigilance. MakerDAO needs to set itself apart from this general view. Education is the passport to the future folks. And I believe having teams like Chaos Labs performing diligent agent-based simulations is a step in the right direction. While I understand @Doo_StableLab concerns over budgeting, we must remember that the “real world” needs to be educated on the difference between MakerDAO and some of those other Platforms Doo is bringing up here. There’s a huge gap between MakerDAO and others. Let’s keep this ship sailing in the right direction while letting the Real World know that Maker is 1,000 sea levels above the rest. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.725649350649351
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#37",
                    "likes": "0",
                    "time": "14/07/2022-16:09:26",
                    "content": "A post was merged into an existing topic: Core Units & External Vendors Relationships ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/benhoneill",
                    "index": "#38",
                    "likes": "1",
                    "time": "14/07/2022-14:06:09",
                    "content": "   Core Units & External Vendors Relationships   And the Maker protocol doesn’t even have ownership or ways to ensure CL focuses on Maker despite paying for all of their various expenses.   @Doo_StableLab - double clicking into this concern as I agree it is a valid one for Chaos Labs, CL-001, and the community to align on (and branches to the broader CU/Vendor conversation). The software subscription expense is for everything happening within Chaos Labs company and team, the base-level infrastructure for simulation tooling, cloud scale, usability, etc. The CL-001 team (facilitator, engineers, etc.) would be entirely dedicated to building for MakerDAO and the other Core Units. The expectations from those resources would be no different than other CUs with sprint updates, roadmaps, community calls, and active engagements. All of the “various expenses” (as we intend at least) would only be for these Maker-dedicated resources, not for anyone working with other clients, as well (i.e. Omer and myself, the cloud platform team, ops, etc.). I hope this provides some clarity on that specific point and the division of labor / fund, but would love to hear more thoughts on your expectations for transparency, focus, and accountability to make sure there is alignment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.216145833333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#39",
                    "likes": "2",
                    "time": "16/07/2022-12:34:59",
                    "content": "@benhoneill Thank you for your response. To go into details:  image976×498 75.5 KB      benhoneill:  The software subscription expense is for everything happening within Chaos Labs company and team, the base-level infrastructure for simulation tooling, cloud scale, usability, etc.   So is it correct that the team wants the Maker protocol to pay for “everything happening within Chaos Labs” which the team serve more than Maker? I find it hard to believe that there’s no overlap between this resource and resources devoted for other projects the team is helping.     benhoneill:  All of the “various expenses” (as we intend at least)   It’s not a matter of intend. If the resource the Maker protocol dedicated to the team is used for other purposes, it is fraud. So please don’t make a leeway of your team by hinting the team might eventually divert the resources for other initiatives.     benhoneill:  The expectations from those resources would be no different than other CUs with sprint updates, roadmaps, community calls, and active engagements.   Once again, it’s not the same because CL team’s expectation from those resources is already different from other CUs. Other CUs don’t just “intend” to use the resource the Maker protocol to support Maker, it is expected and required. But let’s say it’s a misunderstanding and the team indeed wants to focus on Maker, my concern is still with the budget as based on Makerburn (last month annualized), current fee income is only 15 million while Dai expense is 55 million. We need to focus on core operation or else, it’s not about whether we onboard or not onboard this CU, we might be forced to cut or offboard CUs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.767857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#40",
                    "likes": "2",
                    "time": "16/07/2022-14:47:17",
                    "content": "Can CL describe its business relationships and the structures with these other customers? How many customers have you had and at what size (Terra, chainlink, etc.?) How much investment has it received to date? What are your revenues? Doo’s point is simple, Maker has already provided what looks to be significant seed funding during incubation. This proposal would probably make us your largest customer. Maker receives no equity or token upside and your product will not generate revenue to offset its cost. Maker has already derisked your company through SES incubation to your benefit. The risk reward is not necessarily balanced on this proposal. Perhaps you can increase the reward or decrease the risk (cost). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.791666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#41",
                    "likes": "2",
                    "time": "16/07/2022-18:55:51",
                    "content": "Thank you for the demo. Could you please share a link to the code repo for the Maker keeper agents and auction scenario that was developed for the Sidestream example demonstration? I looked at your github and SAS as well but could not find it. I would like to take a look at the example to understand what a developer needs to create to allow the community to run simulations for a specific scenario easily from a UI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.888888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Omer_Goldberg",
                    "index": "#42",
                    "likes": "5",
                    "time": "18/07/2022-19:56:56",
                    "content": "I understand that budget and cost are top priorities for delegates and the community at the moment. I want to reiterate - Chaos Labs is eager to find the right structure by which to continue to work with and prove our value to the protocol at large. The above budget and structure were discussed during our SES incubation. However, this is not the final state. We are hoping to get feedback and ideation from the community. @Doo_StableLab  I think it is important to clear up one point where it seems as though we have the largest misunderstanding. The budget and headcount for CL-001 is entirely dedicated to working on MakerDAO. This team is embedded not in Chaos Labs, but within MakerDAO as a Core Unit with one focus: building and adapting the Chaos Labs platform for other Core Units and the tools for the community to understand said platform. Any work done by Chaos Labs for other customers would be entirely separate and unrelated to the funding from MakerDAO. The engineers, research, and data scientists employed by CL-001 would all be embedded into MakerDAO, not Chaos Labs, thus their scope of work and roadmap would be determined and presented to the community, not by management at Chaos Labs. Their KPIs are set by the budget and direction they receive as a part of onboarding.  From a traditional B2B software point of view the structure is analogous to a Solutions Architect / Partner Engineer. Scope and requirements for Maker will require custom software development. This engineering will happen with the CLCU in collaboration with the core Chaos engineering team. This, in addition to the licensing fee, is encompassed in the Chaos Labs expense. This structure is an adaptation of commonplace software + service models that traditionally exist in B2B software relationships. As stated, we’re happy to hear what adjustments the community would like to see as the B2B model is tweaked for B2DAO to ensure that incentives are aligned.  The subscription fee is the money that would be paid from this MakerDAO-focused Core Unit to Chaos Labs the company which would cover things like:  Access to the underlying simulation engine Cloud-scale and general use infrastructure (i.e. the ability to run N simulations simultaneously)  Cloud compute and storage costs Internal expertise around the platform and simulation creation Platform support, bug fixes, and other issues  This is the same subscription-type structure that you would expect from any other vendor to MakerDAO and what other customers expect from Chaos Labs: platform access, scale, and support. That subscription line-item is where the overlap starts and ends. That is the fee for all of the other work being built into the Chaos Labs platform that comes at a significantly greater cost than just the value of past or future engagements with MakerDAO. We believe this engagement structure makes sense (vs. being built from scratch internally, which we understand has been attempted in the past) because of the scale and complexity of the underlying system. A six-figure subscription gets you access to millions of dollars of investment and development that will continue to be built upon over the coming months to years. The additional headcount costs ensure that:  MakerDAO gets the most value out of the platform There is a team in place to continue to look at vendors and protect against vendor lock-in  These should be looked at separately as only one is truly tied to Chaos Labs the company. Are there any precautionary (or transparency) steps we can take to prove this to generate more buy-in around the fact that spending by MakerDAO will only be used to generate utility for MakerDAO? Diving into the “vendor lock in” and transportability (similar to @vamsi’s request), the guts of the Chaos Labs platform, agents, scenarios, etc., are built to be auditable and open-source to anyone with access. We’ve collaborated closely with the SES over the past 9 months to research the best possible solution for Maker Testing/Simulation infrastructure and provide a service. We met on a weekly cadence and intensely discussed the optimal design and platform that would suit Maker’s needs. Building a common testing infrastructure was an effort that was previously attempted (@wouter can elaborate here) unsuccessfully within Maker years ago.  Feedback from the SES team and CUs significantly informed and drove our roadmap and prioritization. We’ve dedicated significant resources and cycles across research, design, and engineering to execute and reach the proposed solution. As part of this collaboration with SES we have built Maker-specific components into our simulation platform, such as agents and scenarios. We will be open-sourcing a repo (similar to repos for Chainlink, dYdX, and Uniswap found here) containing these modules following the technical demo we are scheduling for early August. We have demonstrated some of these on the previous Community Call, and look forward to walking the community through them in-depth and allowing them to analyze them for themselves. After the demo, we will publish additional technical blog posts detailing the impact of the tooling, ease of integration, and scope of work for Maker. These tools can be migrated off the Chaos Labs platform if another one comes along or if the Core Unit decides to build one themselves, but the efficiencies of in-depth scalable simulations and testing environments will scale parabolically with use + investment, and is an area where Chaos Labs is uniquely positioned to help MakerDAO succeed. We’re a private company and therefore do not find it appropriate to provide internal metrics requested from @MadShills, but can share the below:  Investment spent on development to date is in the range of single-digit millions We have sufficient investor backing to continue building the Core Chaos Labs platform through the next couple of years without cash concerns The funding received from Maker is smaller in comparison to our initial investments and other customer contracts, but we leaned into the SES Program by dedicating a small team to fully engage in the program to become immersed in MakerDAO the way that some of the OG’s intended, to build a product purpose built for MakerDAO The Chaos Labs team is comprised of ~20 highly skilled team members from top-flight companies such as Facebook, Amazon, Apple, Messari, Instagram, Google, Microsoft and more Due to a variety of contracts and non-disclosure agreements, we cannot share the intimate details of all of our engagements  If there is a standard process of third-party information disclosure with regards to MakerDAO onboarding, please let us know and we’d be happy to review it. We want to be appropriately aligned with the community in growing this relationship both from the point of view of larger contracts as well as MakerDAO success.  Regardless of relationship structure, we believe Chaos labs presents a compelling opportunity to support MakerDAO’s OG status in DeFi, and we’re committed to finding a pathway to realize this vision for both of our organizations. Lastly, I understand the desire/concern in onboarding new partners in a time of such uncertainty. I think we’re aligned here. The worst outcome for Chaos Labs would be a public CU onboarding with a large budget and an unhappy community that churns quickly. I can definitely appreciate the desire to add partners to the protocol who are not only expenses but become revenue generators, as well. In this regard, we’ve started researching ways in which our tooling could not only be a used to mitigate to the risk and testing environment for robustness but an avenue by which the community could more actively turn on revenues. Two avenues we’ve started research in this regard would be:  Makershire - the original creation of Chaos Labs was for Yield Optimization Strategies and simulating risk. Could this CU help any team monetizing treasury do so more efficiently? PSM fees - we understand this has been a hot-button topic as of late, but what is the current methodology to understand the risk/reward of these changes? Could CL-001 help build simulation models to understand different market conditions and their impact on deposits/revenue to help turn on additional revenue streams? Auction Price Curve optimization - Another avenue is to improve the auction process in Maker and minimize sub optimal debt sell off by optimizing the price curve parameters per asset. By tuning the optimal parameters Maker can minimize reserve usage when auctions close at disproportional discounts  These are three ideas, but the crux of it is that the community would have dedicated resources using this powerful tool to prioritize whatever is most needed by the protocol on either side of the spectrum.  CL-001 is looking for Community guidance to shape the priorities of simulations for the highest impact as MakerDAO prepares to tackle a period of restricted budgets, in dynamic marketing conditions. Like all startups, we operate in constant conditions of risk, uncertainty, and even adversity. Our most limited resource at this stage is not money, but time and focus. We consciously made a decision to focus on MakerDAO because we believe that Maker is a cornerstone of DeFi and has a community to which we are excited to contribute. We’ve posted this proposal well in advance to better introduce ourselves the to community, solicit feedback, and be able to iterate on an optimal engagement structure while taking into consideration current market conditions. I would love to spend more of this thread to understand what the community and delegates would expect from a Core Unit such as CL-001 and the Chaos Labs platform more broadly so that we can use those goals to better understand the best path forward. As I’ve stated previously, we truly desire to be a long-term partner and not optimize for the immediate few months. We want to build alongside MakerDAO, proving the impact a platform like this can have, and become a resource that drastically helps it scale in a mutually beneficial manner. We’d love to work together to understand what that looks like. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6339589149168585
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#43",
                    "likes": "4",
                    "time": "18/07/2022-20:42:36",
                    "content": "    Omer_Goldberg:  We’d love to work together to understand what that looks like.   Prior to meeting the delegates, CU, etc., you may want to consider composing and presenting your best understanding of Maker’s needs in a written proposal. Since you have 9 months of paid incubation and weekly meetings you will have the best understanding. Relying on the community to guide you in this instance is likely to lead to failure. This proposal is to spin up a new core unit to exclusively contract with ChaosLabs and build on their platform. Someone without sufficient understanding could suggest it looks like a hammer trying to find a nail? Since you have a few ideas above, why not create well-defined scopes of work and contract with these CU directly? This would solve the governance interface problem and get you immediately rolling. It would also immediately show other CU are willing to direct their spend and manage the projects and accountability (clear traction). The DAO has a management problem at the moment. Creating another CU with ambiguous R&D objectives and significant 7 figure spend seems unlikely to happen. It you have a solid understanding of MakerDAOs needs, it seems the best case is to break them up and contract with the respective business units one at a time. Once that momentum is going, transitioning it into a Core Unit or MetaDAO team would be a much easier business case with a demonstrable track record? I may have simply missed something and if so, please just clarify. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.861832611832611
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#44",
                    "likes": "0",
                    "time": "16/10/2022-20:42:46",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}