{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/actualizacion-mensual-de-gastos-del-panel-de-control-octubre-2022-traduccion/18680",
            "title": "Actualizaci\\xc3\\xb3n mensual de Gastos del Panel de Control : Octubre 2022 [Traducci\\xc3\\xb3n] ",
            "index": 18680,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "translate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#1",
                    "likes": "2",
                    "time": "04/11/2022-03:48:54",
                    "content": "Gracias por leer la actualización mensual de la API de rendimiento del ecosistema de MakerDAO y el panel de control de la Core Unit SES!. Siguiendo nuestro primer lanzamiento suave, estas actualizaciones mensuales le proporcionarán el progreso de nuestro trabajo continuo, incluyendo nuevas características, correcciones de errores y otra información relevante por cada nueva iteración. Estaremos encantados de responder a sus preguntas aquí, en nuestro servidor SES de Discord o en el canal SES CU en MakerDAO Discord.   API de Rendimiento del Ecosistema y el panel de control de liberación #3 (Noviembre 3º)  Tl;dr  Junto con nuestro equipo fuera del sitio y la participación en Devcon Bogotá, el equipo preparó una nueva versión de la API del Ecosistema y el Tablero de Control, así como la Herramienta de Presupuesto de la Core Unit.  Visita nuestro panel de control en https://expenses.makerdao.network/  Se puede acceder a la API GraphQL mediante el explorador de la API  Descargue la última herramienta presupuestaria aquí   El mes pasado lanzamos la segunda iteración del panel de control, con:  una función de seguimiento de los cambios para distinguir rápidamente las últimas actualizaciones del presupuesto de la CU; funcionalidad para proporcionar comentarios adicionales a las partidas presupuestarias; Enlaces GitHub de la Core Unit para acceder rápidamente al trabajo técnico de la CU; mejoras en la navegación y en la experiencia del usuario, clasificación y filtrado para la vista móvil, y una actualización sobre la incorporación de las restantes CUs.  Este mes, nos complace anunciar las siguientes mejoras:  Feed de la actividad a nivel de DAO; mejora del control de la privacidad y de la política de cookies; mejora de la funcionalidad de los comentarios en los informes de gastos; actualización que refleje el estado de la Core Unit fuera de servicio; preparación para la autentificación del usuario.    SES en Bogotá: asistencia al equipo fuera de la sede y a la Devcon VI El equipo de SES se reunió en Bogotá para otra reunión estratégica, en la que debatimos y planificamos los temas y retos más importantes que nos hemos propuesto abordar en los próximos meses. Hemos cubierto los planes de Endgame y MetaDAO, el lienzo del modelo de negocio para las Operaciones Descentralizadas, la retrospectiva y la planificación de las futuras iteraciones del producto Dashboard, y mucho más. Con la presencia de otras Unidades Centrales, hemos conseguido colaborar en algunos de estos planes más grandes y sincronizarnos IRL en otros asuntos del DAO. Nuestro equipo no podía faltar al evento comunitario más importante, Devcon. Además de grandes conversaciones, nuestros expertos en escalado sostenible de DAOs han contribuido como ponentes. Ponte al día con las charlas de la SES Devcon:   @Lenkla y su Gremio de Operaciones de Personal organizaron un taller Construyendo los constructores. Aquí es donde muchas de las ideas obtenidas de la investigación de X-Ray podrían ser aplicadas por las organizaciones en el ecosistema más amplio, construyendo los próximos constructores de la web3.  @wouter dio una charla La historia y el futuro de las operaciones descentralizadas en MakerDAO, donde expuso nuestra historia, la evolución de las operaciones descentralizadas y la gobernanza. Compartió sus ideas sobre algunos de los retos más importantes de Maker y las soluciones a las que contribuye SES:  Alineación de las partes interesadas y bloqueo político → Comités electorales descentralizados Transparencia rota y ruptura de la confianza → Plataforma de operaciones descentralizada Fallo de coordinación entre las Core Units → Presupuestos basados en proyectos Adquisición de talentos, incorporación y compensación → Maker Academy como reemplazo de nuestro programa de incubación.     Historia y futuro de las operaciones descentralizadas en MakerDAO   @juan moderó el Escalado sostenible de los ecosistemas panel para explorar diferentes formas de impulsar el crecimiento de la comunidad dentro de una organización descentralizada.  @layerzero se unió al evento DAOist para hablar de Descentralización de las operaciones jurídicas.    Lanzamiento de la versión 0.3 del panel de control La versión 0.3 del panel de control ya está disponible en https://expenses.makerdao.network/ .  Feed de la actividad a nivel de la DAO Un feed de actividad global con todo lo que está ocurriendo en la plataforma, con la posibilidad de filtrar por las Core Units de interés. Anteriormente introdujimos feeds de actividad para Core Units individuales. Sobre la base de esta funcionalidad para los auditores y otras partes interesadas de MakerDAO, ahora ofrecemos una visión general agregada de todo el DAO de los cambios que se produjeron con toda la actividad de la Core Unit en un solo lugar. El feed de actividad global te permite:  Vea toda la actividad del panel de control que ocurrió en la DAO; Vea qué ha cambiado desde su última visita; Filtre por Core Unit para ver sólo la información que le interesa.   Feed de la actividad a nivel de DAO1920×1080 83.9 KB  En versiones posteriores se añadirán muchos más tipos de actividades que reflejarán futuras funcionalidades. Piensa en esto como la manguera de MakerDAO, similar a Twitter, donde los usuarios podrán suscribirse a los tipos de actividades que les interesen.  Control de privacidad mejorado Página de configuración y política de cookies Permitir que el usuario elija si las cookies se pueden utilizar para recordar la conmutación del modo oscuro, los indicadores de la última visita y el seguimiento del uso de las funciones básicas. Publicación de la política de cookies que establece estos fines.  Mejora de los comentarios en los informes de gastos Obtenga un contexto adicional para los gastos mensuales de la Core Unit. Después de haber introducido los comentarios de las partidas presupuestarias específicas de los desgloses mensuales de las carteras, hemos querido ofrecer a los administradores de las Core Units una herramienta más general para explicar mejor sus informes de gastos. La función de comentarios generales para el informe mensual de gastos permite a los administradores de la Core Unit proporcionar el contexto necesario para sus gastos. Esto se ampliará en versiones posteriores con la funcionalidad de auditoría y revisión.  comentarios mejorados1920×1080 79.8 KB   Core Units Desincorporadas Entender qué Core Units han sido recientemente desincorporadas. Con los cambios recientemente votados para desincorporar varias Core Units de MakerDAO, hemos especificado aún más estos cambios en el panel de control introduciendo el estado “obsoleto” para dichas Core Units. Esta pequeña pero poderosa mejora ayuda a las partes interesadas de MakerDAO a entender mejor el estado actual de la DAO.  core units desincorporadas1920×1080 78.8 KB   Bajo la capucha Preparación para la autentificación del usuario. También estamos trabajando en la posibilidad de que los usuarios se autentiquen en el panel de control. La autenticación es un requisito fundamental para las futuras funciones de colaboración. Ten en cuenta que esta funcionalidad aún no está disponible en la plataforma en vivo.  autenticación de usuarios a simple vista1920×1080 62.1 KB  La primera iteracion en la que estamos trabanjando, es tambien un prerrequisito para la futura autenticacion de web3.   Que es lo que sigue Para la próxima versión, estamos colocando las piezas finales para mejorar la corrección, integridad y disponibilidad de los datos:  Finalización de la autenticación de usuarios para los administradores y auditores de las Core Units. Funcionalidad de auditor para revisar, comentar, y aprobar los informes de gastos mensuales. Finalice el resto de la desincorporación de la Core Unit. Simplificar el uso de la API para los analistas de datos, y mejorar la documentación de la base de código abierto.   ¿Tienes algún comentario o petición de características para la API y el panel de control del ecosistema MakerDAO o ideas para mejorar los informes en general? Por favor, hazlo en los comentarios de abajo o únete a nuestro servidor Discord. Su equipo del panel de control SES @Haiku @teep @liberuum @wouter @Dracaena27 and @Lenkla  Esta es una traducción libre del topic Expenses Dashboard monthly update: October 2022 de @Lenkla Créditos: Traducción @cryptenthusiastic ",
                    "links": [
                        "https://expenses.makerdao.network/",
                        "https://studio.apollographql.com/public/Performance-Dashboard-Prd",
                        "https://github.com/liberuum/budget-tool/releases",
                        "https://forum.makerdao.com/t/expenses-dashboard-monthly-update-september-2022/18210",
                        "https://devcon.org/",
                        "https://youtu.be/SNwFb-WZOrE",
                        "https://youtu.be/6UF6ASf1_X0",
                        "https://www.youtube.com/watch?v=6UF6ASf1_X0",
                        "https://youtu.be/3o8eVMP-bfs",
                        "https://www.youtube.com/watch?v=-ylqFzsYC8Y",
                        "https://expenses.makerdao.network/",
                        "https://discord.gg/Gr3sDQZv6Y",
                        "https://forum.makerdao.com/t/expenses-dashboard-monthly-update-october-2022/18674"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.395833333333333
                }
            ]
        }
    ]
}