{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/doesnt-a-debt-auction-devalue-mkr-tokens/13221",
            "title": "Doesn't a debt auction devalue MKR tokens? ",
            "index": 13221,
            "category": [
                "Miscellaneous",
                "Developers"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/sherl0ck",
                    "index": "#1",
                    "likes": "0",
                    "time": "14/02/2022-09:19:56",
                    "content": "If there is not enough Dai in the Maker Buffer to cover a protocol debt, the Maker protocol triggers a Debt Auction. During a Debt Auction, MKR is minted by the system (increasing the amount of MKR in circulation), and then sold to bidders for DAI. Doesn’t this action devalue MKR as its total supply increases? If yes, then what is the economic incentive behind buying a token which is being devalued by design? Is it like the existence of Surplus action, where DAI is sold for MKR, keeps the system functional? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#2",
                    "likes": "1",
                    "time": "14/02/2022-09:25:25",
                    "content": "Perhaps you should stick to one forum thread instead of 3  The basic incentive mechanic behind MKR, is that if MKR holders govern the protocol well, it will lead to a healthy amount of stability fees accruing, and the surplus buffer filling up, which will then cause buy back and burn auctions of MKR (flap auctions). This mechanic removes MKR from the circulating supply, which should increase the value of MKR over time. If MKR holders govern the protocol poorly, in such a way it leads to unbacked Dai and debt in the protocol, the surplus buffer will over time be emptied, which will cause flop auctions, where new MKR is minted by the system and sold off in the market to recapitalize the debt in the system. This mechanism dillutes the MKR supply, and causes the price of MKR to go down. ",
                    "links": [
                        "https://docs.makerdao.com/smart-contract-modules/system-stabilizer-module/flop-detailed-documentation"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.057720057720058
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sherl0ck",
                    "index": "#3",
                    "likes": "0",
                    "time": "14/02/2022-17:25:38",
                    "content": "    lollike:  Perhaps you should stick to one forum thread instead of 3    I agree my questions are related, but not exactly the same. That’s why I asked those in different threads to stick to one question per thread format. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "14/02/2022-17:29:39",
                    "content": "    lollike:  Perhaps you should stick to one forum thread instead of 3   @sherl0ck I’ll confirm that in general, it’s better to include multiple questions in one thread, unless they are wildly different in scope and area. Feel free to swing by the official chat as well if you’d like. Happy to respond to DM’s if you have further questions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sherl0ck",
                    "index": "#5",
                    "likes": "1",
                    "time": "14/02/2022-17:31:44",
                    "content": "    LongForWisdom:  I’ll confirm that in general, it’s better to include multiple questions in one thread, unless they are wildly different in scope and area.   Thanks, will do that from now on. Previously, I participated in forums that prefer one question per thread format, and I was indeed advised to split the questions into multiple threads. But I do understand every community is different  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.364583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "16/05/2022-23:31:57",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}