{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - FEI (Fei USD) - May 16, 2022",
            "index": "14895",
            "option": "No (Defer)",
            "supporting_mkr": "99,187",
            "highest_fraction": 0.85
        },
        {
            "title": "Community Greenlight Poll - GAMMA UNI-V3-WBTC-RENBTC (Gamma Uniswap v3 wBTC-renBTC) - September 5, 2022",
            "index": "15635",
            "option": "No (Defer)",
            "supporting_mkr": "90,266",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/eurs-mip6-collateral-onboarding-application-stasis/16136",
            "title": "[EURS] MIP6 Collateral Onboarding Application - STASIS ",
            "index": 16136,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "eurs",
                "stasis",
                "cryptoeuro"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/StasisMarketing",
                    "index": "#1",
                    "likes": "0",
                    "time": "28/06/2022-08:15:03",
                    "content": "(topic deleted by author) ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Board composition",
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/fei-mip6-collateral-onboarding-application/14895",
            "title": "[FEI] MIP6 Collateral Onboarding Application ",
            "index": 14895,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "fei",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "5",
                    "time": "01/05/2022-13:40:46",
                    "content": "Summary of the proposal While filled as a MIP6, this proposal can be seen (and converted) to a D3M (or even a PSM). It is suggested to have a good overcollateralization, meaning that the only use case for this vault will be Tribe Protocol to put FEI as collateral to mint DAI. The Tribe DAO will use this loan to finance its balance sheet and provide a better peg for its users. Moreover, with the stablecoin war starting and CeFi stablecoins winning the DeFi space, it makes sense to partner with other stablecoin issuers to push DeFi stablecoins ahead. FEI is already pegged to DAI with 10bps fees. This vault will allow Fei to decrease conversion fees. Tribe DAO is also managing Fuse so this will be complementary to the Fuse D3M discussion . Initial suggested parameters are 150M Debt Ceiling, 150% Collateralization Ratio, 2% Stability Fees, with or without liquidations. As Fei Protocol target usage will be 100M, it will bring 2M additional revenues per year (increasing our revenues by 2.5%). Background Information  Who is the interested party for this collateral application?  The Fei community as voted on this snapshot.  Provide a brief high-level overview of the project, with a focus on the applying collateral token.  Fei is a decentralized, scalable, and DeFi-native stablecoin protocol.  How long has the project been live in production?  Fei smart contract started by used on March 3rd, 2021.  Provide a brief history of the project.  Fei Protocol was launched in March 2021 and was a huge success as a lot of stacked ETH was converted to TRIBE token (the governance token). It started with 2B outstanding FEI (the stablecoin). For the first months, the peg was hard to keep until a new system was put in place. The peg is now stable since May 2021 and is getting better over time. On October 2021, TribeDAO announced a partnership with Ondo Finance  to provide Liquidity-as-a-service. Fei v2 was launched in December 15th and introduce a tight peg with DAI, TRIBE backstop to FEI holders (similar to MKR backstop) and improved decentralized governance. In December 2022, Fei Protocol and Rari Capital were merged to form the actual TribeDAO which is both managing the FEI stablecoin and the Fuse lending market (for which a D3M is explored by Risk ). This month, Volt was launched as a inflation-liked stablecoin based on Fei. Another new product is Tribe Turbo  where DAOs can borrow against their governance tokens and use the proceed in specified pools. revenues are split between the borrower and TribeDAO. First customers are Balancer and Olympus. There was a recent analysis by Messari.  Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.   Website Dune Analytics Dashboard On-chain governance portal Github Docs  Asset Information  What type of asset is it? (e.g. store of value, currency, commodity, capital asset, governance token etc.)  Stablecoin  How is the asset used and does it give any rights to holders? (e.g. financial claims, dividends, governance rights)  The Fei token is a stablecoin backed by a mix of assets which currently correspond to 240% collateralization ratio. Most of the backing is ETH (and derivatives), but there is also around $140M of stablecoins.  A DAI PSM allows to convert FEI for DAI with 10bps fees (expected to be reduced). If the DAI reserve is depleted, a LUSD PSM can be activated, then a ETH PSM. Since FEI v2, TRIBE is used as a backstop to keep the system solvent (similar to MKR for MakerDAO).  What is the market cap for the asset?  The market cap is around $550M divided in two parts: user FEI and protocol FEI. User FEI, around $250M is FEI circulating in the hands of users. Protocol FEI, around $300M correspond to FEI owned by the protocol and stacked to different DeFi protocols.  Where does exchange for the asset occur? 9.a Provide exchange data on market liquidity, volume and order book depth.  Fei has many on-chain liquidity pools for liquidty:  $150M Curve 3pool metapool  $106M Curve d3pool  $63M TVL on Uniswap v3  $70M FEI/ETH on Balancer   Onchain DEX volume range from 5 to 30M daily.  Additionally, as mentionned before, Fei has a DAI PSM and can active LUSD and FEI PSM if needed.  Is the asset settled on chain (trustless) or off chain (trusted)?  Settled on-chain  If offchain (trusted) settlement: describe what are the involved entities, process and estimated time.  n/a  List any possible oracle data sources for the proposed collateral type.   Fei/USD Chainlink datafeed. Balancer Fei/ETH pool pricefeed  Fei/ETH Chainlink pricefeed    List any parties interested in taking part in liquidations for the proposed collateral type.  n/a Business Questions  What is/are the expected use case(s) of the Dai generated by the vault?  The use cases for MakerDAO are:  Generate a yield and decrease USDC exposure. The FEI vault will be akin to a super-senior DAI loan to Fei Protocol (D3M-like). Being overcollateralized in FEI, MakerDAO would enjoy more protection than FEI holders. Taking the role of a decentral bank by providing temporary liquidity to stablecoin issuers when needed. This was already discussed on MakerDAO forum in the Intra DeFi stablecoin issuers money-market . Long term such arrangement will make DeFi stablecoins safer.  The use cases for Fei Protocol are:  Engage in a more expansionary monetary policy by issuing more FEI through Tribe Turbo  Use funding for investments Defend the peg of FEI if needed   What is the amount of Dai expected to be generated against the collateral and what is the timeline? Is there a commitment on a minimum amount of Dai to be generated?   100M for investments 50M additional when needed to temporary balance the supply/demand of the token   What are the strategic benefits for MakerDAO in onboarding the collateral?  Legal Questions  What are the legal risks associated with the tokens?  Same as those related to DAI, if any.  (Optional) Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. Is issuance of the asset decentralized (trustless) or centralized (trusted)? 20.a If centralized/trusted: by which legal entity, type of entity and jurisdiction?  The governance of FEI is done by the TRIBE tokenholders. This is fully decentralized like Maker. Technical Questions  Link any available audits of the project. Both procedural and smart contract focused audits.  Audits  where made on some parts of the system by Consensys and OpenZeppelin. The protocol also use Immunify for bug bounties. Code4rena regularly is also used regularly  Has the token (and/or supporting protocol) been formally verified?  No  Does the asset follow a token standard? (E.g. ERC20, ERC721, ERC1400)  ERC20  Is the asset, or asset balances, controlled by a central actor, or group of actors (e.g. through a multisig, or DAO)?  FEI issuance is controlled by Tribe DAO.  Does the token have whitelist or blacklist functions? If so, what is the process for utilization and what stakeholders are involved?  No whitelist or blacklist.  Can the token implementation be upgraded/changed? If so, what is the process and what stakeholders are involved?  The contract is not upgradable  Does the token contain rebasing logic?  No ",
                    "links": [
                        "https://snapshot.org/#/fei.eth/proposal/0x072409a28763bffed312033f5d32604e00d6286e6d27e5e64eb5f691c1835e18",
                        "https://medium.com/fei-protocol/introducing-fei-protocol-2db79bd7a82b",
                        "https://medium.com/fei-protocol/if-you-are-part-of-a-dao-or-protocol-that-wants-to-create-liquidity-for-your-token-without-f49a01f02863",
                        "https://medium.com/fei-protocol/fei-v2-is-coming-e0bae727a9dc",
                        "https://forum.makerdao.com/t/product-discussion-maker-owned-fuse-pools-and-maker-fuse-d3m/13955",
                        "https://medium.com/volt-protocol/presenting-volt-f0ea2a38eb2e",
                        "https://medium.com/fei-protocol/tribe-turbo-launch-95caa2ce2e77",
                        "https://messari.io/article/state-of-fei-q1-2022",
                        "https://fei.money/",
                        "https://dune.com/llama/Fei-Protocol",
                        "https://www.tally.xyz/governance/eip155:1:0x0BEF27FEB58e857046d630B2c03dFb7bae567494",
                        "https://github.com/fei-protocol/fei-protocol-core",
                        "https://docs.fei.money/",
                        "https://tribe.fei.money/t/fip-56-fei-v2-deployment-proposal/3768#tribe-backstop-tribereservestabilizer-3",
                        "https://curve.fi/factory/11",
                        "https://curve.fi/factory/57",
                        "https://info.uniswap.org/#/tokens/0x956f47f50a910163d8bf957cf5846d573e7f87ca",
                        "https://app.balancer.fi/#/pool/0x90291319f1d4ea3ad4db0dd8fe9e12baf749e84500020000000000000000013c",
                        "https://data.chain.link/ethereum/mainnet/stablecoins/fei-usd",
                        "https://etherscan.io/address/0x90291319F1D4eA3ad4dB0Dd8fe9E12BAF749E845",
                        "https://data.chain.link/ethereum/mainnet/stablecoins/fei-eth",
                        "https://forum.makerdao.com/t/intra-defi-stablecoin-issuers-money-market/13432",
                        "https://twitter.com/joey__santoro/status/1516796303086260224",
                        "https://docs.fei.money/audit",
                        "https://immunefi.com/bounty/tribedao/",
                        "https://code4rena.com/reports/2021-11-fei/",
                        "https://code4rena.com/reports/2022-02-tribe-turbo/",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-43-fei-rari-pools-use-cases/15009",
                        "https://forum.makerdao.com/t/intra-defi-stablecoin-issuers-money-market/13432/9",
                        "https://forum.makerdao.com/t/discussion-capital-raise/15448/15",
                        "https://forum.makerdao.com/t/how-to-boost-dais-liquidity-g-uni-usdp-dai-fei-dai/17327/3",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-16-de-mayo-del-2022/15241",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/44",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-43-fei-rari-pools-use-cases/15009/2",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/20",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/65",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/78",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/66"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.684491978609626
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "2",
                    "time": "01/05/2022-14:06:42",
                    "content": "    SebVentures:  Initial suggested parameters are 150M Debt Ceiling, 150% Collateralization Ratio, 2% Stability Fees, with or without liquidations. As Fei Protocol target usage will be 100M, it will bring 2M additional revenues per year (increasing our revenues by 2.5%).   Just curious, why would one lock in Fei to mint Dai when there’s stability fee and 150% Collateralization ratio? USDT as collateral has the same ratio and the protocol had to offboard it as it was hardly used.  EhbKzPcXgAMzr3q1118×350 32.3 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.510416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "0",
                    "time": "01/05/2022-14:11:06",
                    "content": "TribeDAO can mint FEI. Used as a collateral that doesn’t circulate, it’s costless for them. PS: TribeDAO would be the only rational user. There is no reason for anyone else to use it. As explained in the MIP6, it’s an implementation of Intra DeFi stablecoin issuers money-market ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#4",
                    "likes": "1",
                    "time": "01/05/2022-20:22:22",
                    "content": "It’s always nice to see proposals that has an estimate on revenues included. There is a flipside to that coin however and that is a new collateral is going to incur oracles cost. If it is possible I would like a rough estimate by relevant parties of:  Running oracle costs Time and effort of implementing this collateral given the current pipeline and backlog.  I fear we’ve reached the point where we need to prioritize engineering bandwidth to proposals and projects that provides the highest expected return for a given time commitment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6688311688311686
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#5",
                    "likes": "0",
                    "time": "01/05/2022-22:46:19",
                    "content": "    JustinCase:  incur oracles cost   Maybe this is because I wasn’t here since the beginning, but why do we only use on chain oracles instead of at least some off chain? How much money could have been saved just last night? The oracles team was manually poking stuff. How is a person (off chain) deciding to call a poke different from just automating that manual poking all the time? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#6",
                    "likes": "1",
                    "time": "02/05/2022-07:05:50",
                    "content": "For oracles, those can be 0 if liquidation are not activated. The more I think of it, the less I think it really matters. For one, FEI can be minted at will. Moreover, if a stablecoin is down to 67c, the road to 0 is quite short. Which doesn’t mean we shouldn’t stand ready to liquidate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.189484126984127
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#7",
                    "likes": "0",
                    "time": "02/05/2022-15:31:17",
                    "content": "I don’t understand why this is still happening, I mean it’s not the first time they are hacked but again. (I don’t want to create FUD just commenting on the event).    coindesk.com – 30 Apr 22    DeFi Lender Rari Capital/Fei Loses $80M in Hack Fei Protocol, which late last year merged with Rari, announced a $10 million bounty should the funds be returned.      ",
                    "links": [
                        "https://www.coindesk.com/business/2022/04/30/defi-lender-rari-capitalfei-loses-80m-in-hack/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.3374999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OneTrueKirk",
                    "index": "#9",
                    "likes": "1",
                    "time": "04/05/2022-19:33:06",
                    "content": "I would also note that there is another category of rational user – other entities using TribeDAO as an intermediary to take a DAI loan. For example, Volt Protocol could put up an overcollateralized VOLT position to draw a FEI line of credit, and in turn put up this as collateral to borrow DAI, which it then directs into a yield venue. Having multiple layers to the intra-stablecoin issuers money market is natural and will help to provide a layer of risk isolation for MakerDAO. Looking at the cost of capital expressed in liquidity incentives on Curve, there is significant spread here that would make for a win:win for both MakerDAO and liquidity seekers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OneTrueKirk",
                    "index": "#10",
                    "likes": "2",
                    "time": "04/05/2022-19:33:46",
                    "content": "Reposting because I accidentally did before as top level instead of reply. Not seeking to diminish the significance of this incident, but to provide some context: The bug was in code that pre dates the merger between Fei Protocol and Rari Capital. No code is shared between the FEI stablecoin system and Fuse pools. We can expect FEI PCV deployments on Fuse to be paused for the near future as the DAO conducts additional security reviews and makes a plan for the future of the Fuse platform. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#11",
                    "likes": "1",
                    "time": "05/05/2022-13:00:02",
                    "content": "Thanks for the clarification, in the media they paint it differently.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#12",
                    "likes": "3",
                    "time": "24/05/2022-04:21:06",
                    "content": "I will reply here to @MakerMan points. Must say I appreciate the fact that he voted early and provided explanation. I also see @doo even more faster vote & statement. While I don’t agree that FEI is similar to UST, I think viewing FEI as risky and going under 67 cents/coin is a perception one can have.    MakerMan delegate platform   I really have issues with anything connected to Olympus,   Well it’s not. There is a OHM buy under vote, but that doesn’t impact anything for us really. It’s only 10M. And I agree it’s a bad choice per se but could be understood in context.    MakerMan delegate platform   I want to focus on proposals that have revenue generation potentials > 1M/yr       SebVentures:  As Fei Protocol target usage will be 100M, it will bring 2M additional revenues per year (increasing our revenues by 2.5%).      MakerMan delegate platform   can CUs please focus on the best and biggest projects here   I will cite @Khan from this post:    Intra DeFi stablecoin issuers money-market   Market structure innovation like this is incredibly necessary and I believe will play a large role in shaping the future.   The proposal is really simple to implement (a vanilla vault) but is part of a way bigger project. I see it as a key piece of DeFi stablecoin competitiveness. While we are currently on the lender side, I can see Maker on the borrowing side in the future. I mean, it’s simple, all on-chain, with a thick junior piece to protect us (40%), a D3M-like investment and making progress on a core resilience piece for DeFi. PS: adding answers to @flipflopflapdelegate elements:    Flip Flop Flap Delegate LLC Platform   we don’t believe that a PSM should be consider for a Stablecoin that is still searching for scalable network effects, while our Core Units are left identifying the metrics, utilization, risks (like Chainlink Oracles) and business opportunities for the benefit of MakerDAO. Also, a D3M would incur more work for our Core Units   It’s neither a PSM nor a D3M. It’s a regular vault.    Flip Flop Flap Delegate LLC Platform   which means that MKR token owners will feel most of the Pain if there’s a loss (TRIBE token owners should also foot the bill for any losses)   TribeDAO lost around 80M in the Fuse hack. Only TRIBE holder have felt the pain. FEI is still $1. We would have 1.5 FEI per DAI lent. We are super senior. ",
                    "links": [
                        "https://forum.makerdao.com/t/doo-delegate-platform/13246/43",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/74",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/74",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/74",
                        "https://forum.makerdao.com/t/intra-defi-stablecoin-issuers-money-market/13432",
                        "https://forum.makerdao.com/t/intra-defi-stablecoin-issuers-money-market/13432/10",
                        "https://forum.makerdao.com/t/intra-defi-stablecoin-issuers-money-market/13432",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/110",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/110",
                        "https://dune.com/llama/Fei-Protocol",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/110"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.423983134920634
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "0",
                    "time": "24/05/2022-19:15:11",
                    "content": "    SebVentures:  t’s neither a PSM nor a D3M. It’s a regular vault.   Corrected–as a PSM acts like a special vault – either one should be avoided as FEI Protocol searches for networked product fit. Let’s see what others think. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.261904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#14",
                    "likes": "1",
                    "time": "24/05/2022-19:18:06",
                    "content": "Sure, a PSM is a 100% CR vault. Here it’s a 150% CR vault. I was against a PSM for the exact reasons you mention. One can see 150% as not enough for sure or even nothing can be high enough in which case we should do nothing with Fei for sure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.364285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#15",
                    "likes": "1",
                    "time": "24/05/2022-19:34:49",
                    "content": "One thing I did not want to point out on the 3F Delegate platform is the current inability to arbitrage FEI/DAI–as you can see here:  image1094×384 59.7 KB   image1102×388 62.7 KB  I’m basing it on the recommended metrics by CES  image1226×446 86.8 KB  Some of the requirements above  check and others do not. But let me now if you see it differently. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#16",
                    "likes": "3",
                    "time": "24/05/2022-20:02:14",
                    "content": "Thanks @SebVentures & @flipflopflapdelegate for hashing it out. im looking at dune queries to get a better idea. Figured it would set more context, am I missing any other data sources?    dune.com    Dune Blockchain ecosystem analytics by and for the community. Explore and share data from Ethereum, xDai, Polygon, Optimism, BSC and Solana for free.      ",
                    "links": [
                        "https://dune.com/storm/Fei-Overview"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/storm",
                    "index": "#17",
                    "likes": "3",
                    "time": "24/05/2022-20:27:16",
                    "content": "hi. storm from fei labs here. here is some additional context on the state of FEI wrt to liquidity there is about $169M of liquidity in FEI-related stableswap pools. $66.71M of this is FEI ┌─────────────────┐ │ Fei Stableswaps │ └─────────────────┘ (block = 14837692)                          Pool  │  Total TVL  │  FEI TVL  │  FEI Imbalance   ──────────────────────────────┼─────────────┼───────────┼─────────────────               Curve FEI-3CRV  │    $64.34M  │   32.47M  │        300.87K                       Curve D3  │    $49.72M  │   11.65M  │         -4.92M                      Saddle D4  │    $31.41M  │    6.39M  │         -1.46M     Uniswap V3: FEI-USDC 0.01%  │    $15.79M  │   11.74M  │          3.84M     Uniswap V3: FEI-USDC 0.05%  │     $1.33M  │    1.01M  │        349.37K      Uniswap V3: FEI-DAI 0.05%  │     $7.18M  │    3.44M  │       -150.99K                                 │             │           │                                         TOTAL  │   $169.77M  │   66.71M  │         -2.04M    FEI itself is also backed by protocol controlled assets. it currently has a 171% collateralization ratio these assets directly support the peg using contracts similar to DAI’s psms. so the amount of liquidity for swapping between FEI and DAI is actually much larger than what is available on dexes. these contracts can currently facilitate redemptions of nearly 400M of FEI into either DAI itself or high-liquidity assets that can be swapped into DAI ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#18",
                    "likes": "5",
                    "time": "24/05/2022-20:31:24",
                    "content": "The best Dune dashboard is the one in the MIP6 application. Assuming instant liquidity is obviously not reasonable. I probably failed to explain that. Fei Protocol suffered an outflow of 100M FEI from April 26th to May 12. There was probably quite an insane slippage at well at the time for such an amount. Yet the price didn’t moved much. Why? As explained in the MIP6, because they have PSMs that they can activate where they sell parts of their balance sheet to keep the peg. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.714285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bpm6867",
                    "index": "#19",
                    "likes": "5",
                    "time": "24/05/2022-21:38:04",
                    "content": "Hey Maker fam - Brianna here from the Fei Labs founding team. I wanted to make a few clarifications to some statements on this thread. Maker will not setup a FEI PSM at this stage. Fei Protocol already has a DAI based PSM, and would like to use loaned DAI for peg maintenance and other protocol operations, while bringing 2M in additional revenues per year to Maker (increasing revenues by 2.5% at 100M target per @SebVentures ’s original post). This would help reinforce MakerDAO’s narrative as the enabler of other decentralized stablecoins, where FEI is pegged to DAI instead of USDC or other centralized stablecoins. The PSM and D3M discussions are not being explored at this time, and were just ideas of potential future collaboration ideas. Anyway, it’s been a great experience thus far, learning more about how Maker operates through this process and getting to know more of the awesome Maker community. If this vault loan doesn’t work out, I am sure there will be other opportunities for our communities to collaborate in the future. Cheers, Brianna ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.025
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OneTrueKirk",
                    "index": "#20",
                    "likes": "1",
                    "time": "25/05/2022-02:11:39",
                    "content": "I also think it is worth noting that MakerDAO already has FEI exposure through Aave – Fei Protocol is perfectly capable of minting enough FEI to borrow all unborrowed DAI there. The disadvantage is that the deposited FEI is also borrowable, and pressure will be put on FEI peg if borrow cost is lower than other stablecoins on Aave. That’s one reason why this proposal is a win-win – Fei Protocol would gain access to liquidity at a lower cost than open market incentives, Maker would get more income as Fei scales up its borrow, without taking on more risk than the existing integration with Aave. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.982142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#21",
                    "likes": "6",
                    "time": "25/05/2022-02:39:37",
                    "content": "The 150% CR makes this vault fairly safe from Maker’s end. Main risks I see are counterparty. Minimal onboarding overhead and some additional revenues. Seems like this should be investigated. That being said it’s right on the edge of not being worth our time. Slightly higher SF may be in order, but I think it’s a solid greenlight at the very least. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6327380952380945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#22",
                    "likes": "1",
                    "time": "25/05/2022-12:35:35",
                    "content": "    bpm6867:  Fei Protocol already has a DAI based PSM, and would like to use loaned DAI for peg maintenance and other protocol operations   Thank you, Brianna. Can you share more about your planned use of DAI for other protocol operations? Would you be using DAI to pay contributors ,for example? I am supportive of this application as it seems to bolster organic DAI growth as discussed in a recent post on a MakerDAO “North Star” which I highly favor. Any comments you have on how our collaborations might address points raised the original post and discussion here would be welcome! A North Star - DAI as the Destination ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#23",
                    "likes": "1",
                    "time": "25/05/2022-12:38:10",
                    "content": "Would Tribe be willing to subsidize the oracle costs or commit to using a certain amount of debt from this? Because there likely aren’t any other users for this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.424107142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#24",
                    "likes": "0",
                    "time": "25/05/2022-13:59:29",
                    "content": "To reply on @Hasu twitter comments:  I want to reduce complexity in MakerDAO incl the number of collateral types. for why, see my musings on how much complexity a decentralized protocol can support  This proposal is functionally equivalent with a D3M, we finance part of Fei Protocol balance sheet (in a senior position) and let TribeDAO decide on the allocation. It could be better than using a D3M directly in Fuse as it would then be managed by TribeDAO and with the equity of TribeDAO as additional protection. One can regard Tribe as being yet too small or whatever. Tribe will also provide a Fei Saving Rate, that we could use in the future (using a D3M). Higher yield (3% expected) but more risk as we would not have an extra buffer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/joey",
                    "index": "#25",
                    "likes": "0",
                    "time": "25/05/2022-18:27:17",
                    "content": "The intended use case is basically exclusively for the Tribe DAO given the capital inefficiency of 150% CR and the Tribe DAO has approved using it for 100m target utilization in the short term. I’d imagine oracle subsidies are on the table and would be curious to hear if there is precedent for that and associated costs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#26",
                    "likes": "0",
                    "time": "25/05/2022-22:29:32",
                    "content": "The only way I see the feasibility of FEI importation is perhaps through GUNI FEI-DAI, FEI-USDC, FEI-PAX. Oh if it is a PSM that has inbound and outbound rates. So we can counteract possible problems that may arise. I know it is a bit difficult as it is a decentralized currency that fluctuates perhaps with a little more strength than DAI. I see FEI as that son of DAI that has everything to be up to the circumstances, I would like Maker to be the one to give him a hand on that road. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/superTricycle",
                    "index": "#27",
                    "likes": "0",
                    "time": "28/05/2022-04:15:11",
                    "content": "If we’re bringing up unprecedented ways to cut costs, we should consider using the listed Chainlink price feeds:     SebVentures:   List any possible oracle data sources for the proposed collateral type.   Fei/USD Chainlink datafeed . Balancer Fei/ETH pool pricefeed   Fei/ETH Chainlink pricefeed     Although @Hasu voted no for FEI, he did sound open to using Chainlink. There were some other Maker folk in that thread open to the idea as well. The greenlight poll is on the edge of passing with oracle/dev costs being one of the largest points of contention. This could be a good opportunity to explore a new solution for this consistent pain point. ",
                    "links": [
                        "https://etherscan.io/address/0x90291319F1D4eA3ad4dB0Dd8fe9E12BAF749E845",
                        "https://data.chain.link/ethereum/mainnet/stablecoins/fei-eth",
                        "https://twitter.com/hasufl/status/1529741384143540224"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0896464646464645
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#28",
                    "likes": "3",
                    "time": "28/05/2022-14:19:55",
                    "content": "sorry for being late to the party… so, if this is about generating DAI for the FEI protcol, why isn’t FEI just opening a vault with its ETH treasury (with a high CR - ETH-C could be an option) and mint DAI from collateral in a vanilla fashion? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.933333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#29",
                    "likes": "0",
                    "time": "29/05/2022-16:11:22",
                    "content": "    ultraschuppi:  so, if this is about generating DAI for the FEI protcol, why isn’t FEI just opening a vault with its ETH treasury (with a high CR - ETH-C could be an option) and mint DAI from collateral in a vanilla fashion?   Exactly, they can use ETH on Aave or Maker. It’s way more risky from a Smart contract point of view tho. Currently they would favor Aave due to the rates (and they already have quite some ETH there as collateral). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.832738095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#30",
                    "likes": "2",
                    "time": "30/05/2022-04:33:54",
                    "content": "This poll do be at the bottom of Davy Jones’ locker. Ask fer one o’ then mmm fancy institutional vaults for Eth next time, mateys!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#31",
                    "likes": "5",
                    "time": "30/05/2022-15:43:58",
                    "content": "I see sentiment has turned decidedly against this proposal. ACREinvest continues to support but does appreciate and acknowledge recent discussion by the Tims @ultraschuppi Schuppi Delegate Platform - #66 by ultraschuppi and @twblack88 Feedblack Loops LLC Delegate Platform (FBL) - #79 by twblack88. We view a Greenlight as the opportunity to refine and improve on some of the details as presented here, but would very much like to have the FEI team elaborate on my question about the MakerDAO community discussion about organic DAI growth. As this vote looks to fail in about 15 minutes, hopefully our communities can remain actively engaged in conversation to find other possibilities for greater cooperation and mutual support. ",
                    "links": [
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/79"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.358333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#32",
                    "likes": "1",
                    "time": "31/05/2022-07:58:39",
                    "content": "The vote ended up with the proposal being rejected. Thanks you for all that participated. I personally think it is more elegant to say no directly as it is done here that doing that at the end as we sometime do. The sentiment changed at the end which sadly didn’t allowed a scientific discussion. This MIP6 was not game changing for MakerDAO (impact medium), therefore it is not a big issue.  image911×218 7.11 KB  ",
                    "links": [
                        "https://forum.makerdao.com/t/how-to-boost-dais-liquidity-g-uni-usdp-dai-fei-dai/17327/3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.53125
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/uni-v3-wbtc-renbtc-mip6-collateral-onboarding-application/15635",
            "title": "[UNI-V3-WBTC-RENBTC] MIP6 Collateral Onboarding Application ",
            "index": 15635,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-onboard",
                "mips",
                "uniswap-v3",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/BP333",
                    "index": "#1",
                    "likes": "3",
                    "time": "06/06/2022-18:00:33",
                    "content": "Hi everyone! This is a proposal to include the Uniswap v3 pair wBTC-renBTC as a collateral asset for MCD.  The main rationale is that wBTC and renBTC are already onboarded as collateral types, so collateralizing a tight range on Uniswap v3 position for wBTC-renBTC would be more advantageous in that one could earn yield on their collateral through Uniswap trading fees.  Additionally, if the position were to go out of range, one would be 100% in wBTC or renBTC, either of which is currently allowed as collateral. 1. Who is the interested party for this collateral application? Gamma Strategies, which is an active liquidity manager on Uniswap v3, is the interested party. The aim of this application is to be able to mint DAI against the Uniswap v3 LP pair for wBTC-renBTC. This would allow those who are already supplying wBTC and renBTC as collateral to now supply the Uni v3 wBTC-renBTC LP token to earn yield on their collateral, while borrowing or multiplying their exposure to BTC. 2. Provide a brief high-level overview of the project, with a focus on the applying collateral token. Gamma Strategies is an active liquidity manager on Uniswap v3 and creates an ERC-20 wrapper around its managed positions by interacting directly with the Uniswap v3 core contracts. Each pair managed by Gamma consists of two overlapping Uniswap v3 positions, which we call a base position and a limit position. Essentially, the base position will be a +/- two tick range around a price of renBTC / wBTC = 1, specifically at a price range between 0.9980021 - 1.0020019. The base position will mandate a certain ratio of wBTC and renBTC be provided. The excess assets (whether in renBTC or wBTC) will be placed in a limit position 1 tick above or below the current price tick to the either the lower or upper range of the base position. If the limit position is solely wBTC, the range will be from one tick above current price to 1.0020019. If the limit position is solely renBTC, the range will be from 0.9980021 to one tick below the current price tick. The benefits of having an overlapping limit position is that it allows for cost savings in that no swaps are performed in order to place assets in the exact ratio in the base position. Therefore, the costs of swap fees and price impact is saved. Additionally, when the limit position is in range, both the base and limit positions will be earning fees, with the limit position earning at a higher fee multiple due to being in a tighter range. The risks associated with a Uniswap v3 position is that when the price of renBTC / wBTC is outside of the range of provided liquidity, the position will be entirely in renBTC or entirely in wBTC. However, given that wBTC and renBTC are both allowed as collateral in MakerDAO already, this is a risk that should be palatable. Fees earned from the wBTC/renBTC Uniswap v3 position will be automatically reinvested back into the position on a regular basis once enough fees have been accumulated. No upfront fees will be charged, and Gamma will charge a service fee of 10% of only the fees returned from the position. The remaining 90% of the fees will be compounded back into the position. Gas fees for automatically re-investing positions will be taken from the 10% fee. The Gamma wBTC/renBTC LP token is ERC-20. Users deposit the base assets, wBTC & renBTC in the ratio of the assets in position and get minted ERC-20 LP tokens in return. This allows our LP tokens to be composable with Maker DAO and other DeFi platforms for collateralization. 3. Provide a brief history of the project Gamma Strategies has been managing liquidity positions since the launch of Uniswap v3 back in March 2021. Since then it has been funding the research and implementation of active liquidity management strategies specifically for Uniswap v3. We have a team of data scientists and developers utilizing data science and financial modeling to build infrastructure and active LP strategies for Gamma users. Gamma users consist of retail LPs and DAOS/institutions. Many top DeFi projects have integrated Gamma for LP management such as Ribbon Finance, KeeperDAO, Olympus Pro, Liquity, Friends With Benefits, and H2Odata. Different use cases have emerged that involve Gamma’s managed positions. H2Odata utilizes our ERC-20 LP tokens to incentivize liquidity on Uniswap v3. Ribbon Finance utilizes our managed position to allow vault position holders to enter and exit positions without a waiting period. Additionally, Olympus Pro utilizes our LP tokens for bonding purposes. 4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses.  Docs: https://docs.gamma.xyz/  Github: https://github.com/GammaStrategies  wBTC-renBTC contract: https://etherscan.io/address/0x3cca05926af387f1ab4cd45ce8975d31f0469927  All other contracts: Contracts / Wallets - Gamma   5. Link any available audits of the project. Both procedural and smart contract focused audits Three independent audits were performed by ConsenSys Diligence, Arbitrary Execution, and Certik in order of most recent to oldest.    docs.gamma.xyz    Audits Gamma has and is continuing to conduct a variety of audits on its protocol to protect users from theft and protocol failure.      6. Link to any active communities relating to your project  Twitter: https://twitter.com/GammaStrategies  Medium: https://medium.com/gamma-strategies  Discord: https://discord.gg/EPsZ4BE5Kz  Telegram: https://t.me/gammastrategies  Reddit: https://www.reddit.com/r/gamma   7. How is the applying collateral type currently used? Gamma LP tokens are ERC-20 and are minted to users who deposit the base assets (wBTC & renBTC) of the LP pair into the position manager contract called the Hypervisor. The Gamma wBTC/renBTC LP token is concentrated +/- 2 ticks from a renBTC / wBTC price of 1. (0.9980021 - 1.0020019). In ticks, this would be a lower tick of -20 to upper tick of +20.  This is for the 0.05% fee tier pool, which has a tick spacing of 10. Upon a 5% threshold amount of fees collected from the position or new deposits into the position, the position will automatically rebalance in the same lower and upper ticks. Given that the renBTC / wBTC price remains consistently at 1:1, there is no need to change the lower and upper ticks. 8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? The underlying assets of the collateralized LP tokens will be held in Uniswap v3, and Gamma will have no admin rights to the collateral. The collateral will contractually only be able to be deposited in a price range of 0.9980021 - 1.0020019 in the base position which is +/- 2 ticks above and below the price of 1. And the limit position will always be in a price range of one tick above or below the current price tick to either the lower or upper range depending on whether the limit position consists of wBTC or renBTC. If the limit position is solely wBTC, the range will be from one tick above current price to 1.0020019. If the limit position is solely renBTC, the range will be from 0.9980021 to one tick below the current price tick. All admin rights will be renounced by Gamma, and the contract will be immutable. 9. Where does exchange for the asset occur? The Gamma wBTC/renBTC LP token can be redeemed for the underlying assets at any time. 10. (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. NA 11. (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable NA 12. (Optional) List any possible oracle data sources for the proposed Collateral type The same oracle that is used for wBTC and renBTC can be used, with the weights according to percentages in the Gamma position. These weights can change based on price movements 13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type NA ",
                    "links": [
                        "https://twitter.com/Rook/status/1509613788097613825?s=20&t=iV3OfF9TH3187ox5QC8KUA",
                        "https://twitter.com/OlympusDAO/status/1493593899255963654?s=20&t=iV3OfF9TH3187ox5QC8KUA",
                        "https://twitter.com/GammaStrategies/status/1514591510020653059?s=20&t=iV3OfF9TH3187ox5QC8KUA",
                        "https://twitter.com/llamacommunity_/status/1527351020409409558?s=20&t=iV3OfF9TH3187ox5QC8KUA",
                        "https://twitter.com/H2O_data/status/1531278531115855872?s=20&t=iV3OfF9TH3187ox5QC8KUA",
                        "https://docs.gamma.xyz/",
                        "https://github.com/GammaStrategies",
                        "https://etherscan.io/address/0x3cca05926af387f1ab4cd45ce8975d31f0469927",
                        "https://docs.gamma.xyz/gamma/learn/scans",
                        "https://consensys.net/diligence/audits/2022/02/gamma/",
                        "https://github.com/GammaStrategies/hypervisor/blob/master/AE_Gamma_audit_09_03_22.pdf",
                        "https://github.com/GammaStrategies/hypervisor/blob/master/REP-Hypervisor-2021-07-07.pdf",
                        "https://docs.gamma.xyz/gamma/learn/audits",
                        "https://docs.gamma.xyz/gamma/learn/audits",
                        "https://twitter.com/GammaStrategies",
                        "https://medium.com/gamma-strategies",
                        "https://discord.gg/EPsZ4BE5Kz",
                        "https://t.me/gammastrategies",
                        "https://www.reddit.com/r/gamma",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/20",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191/26",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/118",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/12",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/13",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/45",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/3",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/98",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-05-de-septiembre-del-2022/17725",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/15",
                        "https://forum.makerdao.com/t/poll-update-collateral-name-clarification-gamma-uni-v3-wbtc-renbtc/17700"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.847898629148629
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "4",
                    "time": "06/06/2022-18:36:50",
                    "content": "    BP333:  Gamma Strategies is an active liquidity manager on Uniswap v3 and creates an ERC-20 wrapper around its managed positions by interacting directly with the Uniswap v3 core contracts.   These points seem to me to be very good for an optimal integration, as well as the liquidity concentration strategy. I think it is very healthy for the protocol to continue betting on Bitcoin and cryptocurrencies in general that are not standard currencies. Do you expect that it will not only be in these assets or do you plan to apply more to the Maker collateral ecosystem in the future? ETH-WSETH maybe? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1537037037037035
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BP333",
                    "index": "#3",
                    "likes": "3",
                    "time": "06/06/2022-18:49:33",
                    "content": "Thank you for your comments.  We do plan to continue to add more to the Maker collateral ecosystem in the future especially with regards to assets that have already been approved by the Maker ecosystem.  The yield aspect seems to be pretty attractive as it functions almost as a self-paying loan. ETH-WSTETH is definitely possible, but does involve a bit more active management as WSTETH incrementally gains upon ETH as more staking rewards are compounded into WSTETH.  However, the in the scenario that the position goes out of range, you would be 100% in ETH.  But definitely we are looking to apply more to the Maker collateral ecosystem in the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.215277777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#4",
                    "likes": "3",
                    "time": "07/06/2022-00:14:16",
                    "content": "Thanks for posting your application and the conversations in Discord. As a first step, it is important to look at Quick Start Guide - Collateral Onboarding. As part of that, your application needs to reflect the application template for your application, mips/MIP6c2-Collateral-Application-Template.md at master · makerdao/mips · GitHub. Please update this forum post at your earliest convenience. Second, it’s best if you do a self assessment to ensure your application clearly meets the collateral guidelines, MIP6 Recommended Guideline Metrics for Onchain Collateral Onboarding. There needs to be a clear case for not only meeting the requirements but to understand the growth in Dai generation. Also note, this would be considered an experimental collateral onboarding project since this doesn’t look like a normal ERC-20 onboarding. As such, there would need to be an opportunity to generate a large amount of Dai in order for the collateral stakeholders to commit resources. Let us know if you have any questions. ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP6/MIP6c2-Collateral-Application-Template.md",
                        "https://forum.makerdao.com/t/mip6-recommended-guideline-metrics-for-onchain-collateral-onboarding/14503"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.095238095238096
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BP333",
                    "index": "#5",
                    "likes": "3",
                    "time": "07/06/2022-03:16:27",
                    "content": "Thanks for the feedback.  I’ll go ahead and edit the proposal according to the application template as well as complete the self assessment! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zmtong",
                    "index": "#6",
                    "likes": "0",
                    "time": "19/07/2022-13:15:19",
                    "content": "Please advise if you still intend to update this application? We are tracking it on our Collateral Status Index (CSI). If an application has no change of status for a period of time, we may remove it from the index. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BP333",
                    "index": "#7",
                    "likes": "1",
                    "time": "19/07/2022-13:29:29",
                    "content": "Hey, thanks for reaching out. We 100% are still working on this proposal. The written part is in draft form; however, we are in the midst of unit testing our contract that we will be using for this proposal. We wanted to present both the contract simultaneously with the updated proposal. We should have that out relatively soon, and we appreciate your patience here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BP333",
                    "index": "#8",
                    "likes": "0",
                    "time": "12/08/2022-04:42:46",
                    "content": "Hi all, Please see our revised MIP6 Collateral Onboarding Application. This is a proposal to include the Uniswap v3 pair WBTC-renBTC as a collateral asset for MCD.  This same methodology and contract could also be used for any other 1:1 pegged asset pairing such as BUSD-DAI. Background Information 1. Who is the interested party for this collateral application? Gamma Strategies, which is an active liquidity manager on Uniswap v3, is the interested party. The aim of this application is to be able to mint DAI against the Uniswap v3 LP pair for WBTC-renBTC. This would allow those who are already supplying WBTC and renBTC as collateral to now supply the Uni v3 wBTC-renBTC LP token to earn yield on their collateral, while borrowing or multiplying their exposure to BTC. 2. Provide a brief high-level overview of the project, with a focus on the applying collateral token. Gamma Strategies is an active liquidity manager on Uniswap v3 and creates an ERC-20 wrapper around its managed positions by interacting directly with the Uniswap v3 core contracts. Each pair managed by Gamma consists of two overlapping Uniswap v3 positions, which we call a base position and a limit position. Essentially, the base position will be a +/- fixed range around a price of renBTC / WBTC = 1, specifically at a price range between 0.9980021 - 1.0020019. The base position will mandate a certain ratio of WBTC and renBTC be provided. The excess assets (whether in renBTC or wBTC) will be placed in a limit position 1 tick above or below the current price tick to the either the lower or upper range of the base position. If the limit position is solely WBTC, the range will be from one tick above current price to 1.0020019. If the limit position is solely renBTC, the range will be from 0.9980021 to one tick below the current price tick. The benefits of having an overlapping limit position is that it allows for cost savings in that no swaps are performed in order to place assets in the exact ratio in the base position. Therefore, the costs of swap fees and price impact is saved. Additionally, when the limit position is in range, both the base and limit positions will be earning fees, with the limit position earning at a higher fee multiple due to being in a tighter range. The risks associated with a Uniswap v3 position is that when the price of renBTC / WBTC is outside of the range of provided liquidity, the position will be entirely in renBTC or entirely in WBTC. However, given that WBTC and renBTC are both allowed as collateral in MakerDAO already, this is a risk that should be palatable. Fees earned from the WBTC/renBTC Uniswap v3 position will be automatically reinvested back into the position on a regular basis once enough fees have been accumulated. No upfront fees will be charged, and Gamma will charge a service fee of 10% of only the fees returned from the position. The remaining 90% of the fees will be compounded back into the position. Gas fees for automatically re-investing positions will be taken from the 10% fee. The Gamma WBTC/renBTC LP token is ERC-20. Users deposit the base assets, WBTC & renBTC in the ratio of the assets in position and get minted ERC-20 LP tokens in return. This allows our LP tokens to be composable with Maker DAO and other DeFi platforms for collateralization. 3. How long has the project been live in production? We launched in March 2021 on Mainnet. It’s been approximately a year and 5 months since we’ve been live in production. 4. Provide a brief history of the project Gamma Strategies has been managing liquidity positions since the launch of Uniswap v3 back in March 2021. Since then it has been funding the research and implementation of active liquidity management strategies specifically for Uniswap v3. We have a team of data scientists and developers utilizing data science and financial modeling to build infrastructure and active LP strategies for Gamma users. Gamma users consist of retail LPs and DAOS/institutions. Many top DeFi projects have integrated Gamma for LP management such as Friends With Benefits, H2Odata, Ribbon Finance, Liquity, Olympus Pro, and KeeperDAO. Different use cases have emerged that involve Gamma’s managed positions. H2Odata utilizes our ERC-20 LP tokens to incentivize liquidity on Uniswap v3. Ribbon Finance utilizes our managed position to allow vault position holders to enter and exit positions without a waiting period. Additionally, Olympus Pro utilizes our LP tokens for bonding purposes. 5. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  Docs: https://docs.gamma.xyz/  Github: https://github.com/GammaStrategies  wBTC-renBTC Hypervisor.sol contract: https://etherscan.io/address/0x3cca05926af387f1ab4cd45ce8975d31f0469927  Uniproxy contract: https://etherscan.io/address/0x83de646a7125ac04950fea7e322481d4be66c71d#code  All other contracts: Contracts / Wallets - Gamma   The Hypervisor.sol contract is the Uniswap v3 position manager contract. It interacts directly with the Uniswap v3 core contracts. Users deposit wBTC & renBTC into this contract via a proxy contract (Uniproxy.sol), and the Hypervisor.sol contract deploys those assets to Uniswap v3 in the specified price range and mints the depositor ERC-20 LP tokens. The Uniproxy.sol contract mandates deposits of wBTC & renBTC equivalent to the ratio of assets in the Hypervisor.sol contract. Asset Information 6. What type of asset is it? (e.g. store of value, currency, commodity, capital asset, governance token etc.) This is an LP token, which represents user-deposited assets and the trading fees accrued from providing those assets on Uniswap v3. The LP tokens are redeemable for the underlying assets + share of trading fees when redeemed. 7. How is the asset used and does it give any rights to holders? (e.g. financial claims, dividends, governance rights) The asset is used as a receipt token given for providing liquidity on Uniswap v3. It gives the holders financial rights to his or her portion of the underlying assets and fees returned from providing liquidity. Gamma LP tokens are ERC-20 and are minted to users who deposit the base assets (WBTC & renBTC) of the LP pair into the position manager contract called the Hypervisor. The Gamma WBTC/renBTC LP token will be concentrated +/- 20 ticks from a renBTC / WBTC price of 1. (0.9980021 - 1.0020019). In ticks, this would be a lower tick of -20 to upper tick of +20. Upon a 5% threshold amount of fees collected from the position, the position will automatically rebalance in the same lower and upper ticks. Given the rapid redemption available for both assets back into BTC, the price should not diverge much from parity. 8. What is the market cap for the asset? The market cap for the WBTC-renBTC LP token would be a function of the marketcaps of WBTC and renBTC. As of August 11, 2022, the market cap of WBTC is 5.9B and the market cap of renBTC is $77.4M according to CoinGecko. 9. Where does exchange for the asset occur? 9.a Provide exchange data on market liquidity, volume and order book depth. The Gamma WBTC/renBTC LP token can be redeemed for the underlying assets at any time. 9.a is not applicable to the Gamma wBTC/renBTC LP token. 10. Is the asset settled on chain (trustless) or off chain (trusted)? The LP token is settled on chain (trustless) 11. If offchain (trusted) settlement: describe what are the involved entities, process and estimated time. N/A 12. List any possible oracle data sources for the proposed Collateral type The same oracle that is used for wBTC and renBTC can be used, with the weights according to percentages in the Gamma position. These weights can change based on price movements 13. List any parties interested in taking part in liquidations for the proposed Collateral type NA Business Questions 14. What is/are the expected use case(s) of the Dai generated by the vault? It would be very similar to the use case(s) of the WBTC and renBTC collaterals with the exception that the borrower can earn yield on his or her WBTC and renBTC through providing liquidity on Uniswap v3. In addition to borrowing, the user may multiply his or her exposure to BTC and the yield generated by providing liquidity. 15. What is the amount of Dai expected to be generated against the collateral and what is the timeline? Is there a commitment on a minimum amount of Dai to be generated? Given the appeal of WBTC and renBTC as collateral types and the ability to generate yield on these assets, we expect there to be strong interest in using the WBTC-renBTC LP token as collateral. Based on historical data, the Dai generated by WBTC accounts for 6.6% of all Dai generated by collateral on Maker. There has been a lot of organic debt demand for WBTC-A, WBTC-B, and WBTC-C, and we believe the Uni v3 WBTC-renBTC LP can generate anywhere between 30M - 100M+ in DAI. There is no commitment from the Gamma side to generate a minimum amount of Dai, but we are committed to marketing this to all of our users, investors, and stakeholders. We believe there is a compelling case to have yield generating collateral as seen with the GUNIV3DAI-USDC pairs, which account for 13.7% of all Dai generated on Maker. 16. What are the strategic benefits for MakerDAO in onboarding the collateral? Onboarding the WBTC-renBTC LP pair will likely attract a lot of volume to the Uniswap v3 pool, which will more strongly reinforce the peg between WBTC and renBTC and likely make the collateral types involving WBTC and renBTC more easily liquidatable onchain. It will additionally allow MakerDAO borrowers and multipliers to achieve higher yields on their collateral. There is currently around 10M in liquidity between WBTC-renBTC on Uniswap v3 currently, which is generating between 1M - 5M USD volume per day. We believe that onboarding more WBTC-renBTC collateral would generate well over 100M in liquidity in the Uniswap v3 pair and absorb up to 20M - 50M in volume per day to this pool. The Curve WBTC-renBTC pool is generating around 8M in volume per day on 52M of liquidity. Currently on Paraswap, a 100 renBTC trade for WBTC will be routed 88% through Curve and 10% through the Uniswap v3 pool due to the sheer amount of liquidity in Curve pool. With the additional liquidity in the Uniswap v3 pool due to Maker’s onboarding of collateral, we can see a flywheel effect of higher yields being generated due to increased volumes as more volume is routed to the Uniswap v3 pool due to the increased liquidity.  image1180×290 22.6 KB  Legal Questions 17. What are the legal risks associated with the tokens? The Uniswap v3 LP token for WBTC-renBTC is not expected to introduce any new or novel legal risks. The underlying tokens for the LP token will be deployed to the Uniswap v3 pools, and the LP tokens merely serve as receipt tokens for the deployed assets. 8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? The underlying assets of the collateralized LP tokens will be held in Uniswap v3, and Gamma will have no admin rights to the collateral. The collateral will contractually only be able to be deposited in a price range of 0.9980021 - 1.0020019 in the base position which is +/- 2 ticks above and below the price of 1. And the limit position will always be in a price range of one tick above or below the current price tick to either the lower or upper range depending on whether the limit position consists of wBTC or renBTC. If the limit position is solely wBTC, the range will be from one tick above current price to 1.0020019. If the limit position is solely renBTC, the range will be from 0.9980021 to one tick below the current price tick. All admin rights will be renounced by Gamma, and the contract will be immutable. 19. (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. NA 20. (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. NA 21. Is issuance of the asset decentralized (trustless) or centralized (trusted)? 21.a. If centralized/trusted: by which legal entity, type of entity and jurisdiction? The issuance of the asset is decentralized (trustless) and permissionless, as anyone can deposit the base assets into the position and receive WBTC-renBTC LP tokens. Technical Questions 22. Link any available audits of the project. Both procedural and smart contract focused audits Three independent audits were performed by ConsenSys Diligence, Arbitrary Execution, and Certik in order of most recent to oldest.    docs.gamma.xyz    Audits Gamma has and is continuing to conduct a variety of audits on its protocol to protect users from theft and protocol failure.      23. Has the token (and/or supporting protocol) been formally verified? Yes, the token contracts and all of the smart contracts have been formally verified on Etherscan. 24. Does the asset follow a token standard? (E.g. ERC20, ERC721, ERC1400) ERC-20 25. Is the asset, or asset balances, controlled by a central actor, or group of actors (e.g. through a multisig, or DAO)? The collateral will contractually only be able to be deposited in a price range of 0.9980021 - 1.0020019. 26. Does the token have whitelist or blacklist functions? If so, what is the process for utilization and what stakeholders are involved? No, there are no whitelist or blacklist functions in the token. 27. Can the token implementation be upgraded/changed? If so, what is the process and what stakeholders are involved? Upon deployment of the contract, all admin rights will be renounced, and the contract will be immutable. 28. Does the token contain rebasing logic? No ",
                    "links": [
                        "https://twitter.com/H2O_data/status/1531278531115855872?s=20&t=iV3OfF9TH3187ox5QC8KUA",
                        "https://twitter.com/ribbonfinance/status/1517044507782483968?s=20&t=iV3OfF9TH3187ox5QC8KUA",
                        "https://twitter.com/GammaStrategies/status/1514591510020653059?s=20&t=iV3OfF9TH3187ox5QC8KUA",
                        "https://twitter.com/OlympusDAO/status/1493593899255963654?s=20&t=iV3OfF9TH3187ox5QC8KUA",
                        "https://twitter.com/Rook/status/1509613788097613825?s=20&t=iV3OfF9TH3187ox5QC8KUA",
                        "https://docs.gamma.xyz/",
                        "https://github.com/GammaStrategies",
                        "https://etherscan.io/address/0x3cca05926af387f1ab4cd45ce8975d31f0469927",
                        "https://etherscan.io/address/0x83de646a7125ac04950fea7e322481d4be66c71d#code",
                        "https://docs.gamma.xyz/gamma/learn/scans",
                        "https://etherscan.io/address/0x3cca05926af387f1ab4cd45ce8975d31f0469927",
                        "https://etherscan.io/address/0x83de646a7125ac04950fea7e322481d4be66c71d#code",
                        "https://consensys.net/diligence/audits/2022/02/gamma/",
                        "https://github.com/GammaStrategies/hypervisor/blob/master/AE_Gamma_audit_09_03_22.pdf",
                        "https://github.com/GammaStrategies/hypervisor/blob/master/REP-Hypervisor-2021-07-07.pdf",
                        "https://docs.gamma.xyz/gamma/learn/audits",
                        "https://docs.gamma.xyz/gamma/learn/audits",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/15",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-48-gamma-strategies-uni-v3-wbtc-renbtc-mip6-ama/17489/3",
                        "https://forum.makerdao.com/t/relay-semanal-23-29-de-agosto-del-2022/17600",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/12",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-48-gamma-strategies-uni-v3-wbtc-renbtc-mip6-ama/17489",
                        "https://forum.makerdao.com/t/guniv3-busd-dai-mip6-collateral-onboarding-application-form/17185/4"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.05160107068504
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#9",
                    "likes": "2",
                    "time": "12/08/2022-16:58:26",
                    "content": "Would you describe the impact of this on your collateral application and MakerDAO given the current market situation? I think it’s important to get an informed opinion here to understand how Maker moves forward with your application.    CNBC – 10 Aug 22    Crypto criminals laundered $540 million by using a service called RenBridge,... Regulators have their hands full as more crypto tools like RenBridge are being used by criminals to launder money.      Thanks! ",
                    "links": [
                        "https://www.cnbc.com/2022/08/10/crypto-criminals-laundered-540-million-using-renbridge-elliptic-says.html"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BP333",
                    "index": "#10",
                    "likes": "0",
                    "time": "12/08/2022-17:56:24",
                    "content": "A few points with regards to this.  Ren, first of all is not a mixer, and all transactions are traceable.  You can exactly see where the burned renBTC is going and to what BTC address.  Granted, that doesn’t always mean anything for regulators who oftentimes don’t know the differences between traceable and non-traceable, but I would think that there would be enough stakeholders in Ren to be proactive in addressing this big differentiator between a mixer like Tornado Cash and a bridge like Ren where you can trace the assets.  In that respect, I think the article misses the mark by conflating Ren with Tornado Cash. This statement for example is quite false.  image879×189 23.1 KB  The BTC is held in custody by RenVM’s decentralized network of Darknodes, but that doesn’t obfuscate crypto cash because it’s the destination address that actually matters.  image1400×787 139 KB  Here’s a random burn transactions from renBTC on Mainnet to real BTC.  You can see for yourself on Etherscan exactly where the burned renBTC is going and to what BTC address:  image1170×811 77 KB  One thing to note is that for now, AWS, Google, and Digital Ocean are the hosting service providers they’re using for running Darknodes.  I would say that is the main disadvantage here.  They do have a plan in place for fully decentralizing the darknode hosting service though. Therefore, in my opinion, I think renBTC presents less centralization risk than does WBTC, given that WBTC is a custodial solution where all the BTC is held in centralized cold wallets and WBTC can be frozen at any time. However, I think having the renBTC-WBTC in a Uniswap v3 position provides an extra layer of security than naked renBTC and WBTC as the Gamma Uni v3 LP tokens is trustless and permissionless, and would not be able to be frozen.  So in order to freeze the assets, the centralized agencies would have to freeze the entire renBTC-WBTC Uni v3 position itself. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8519736842105265
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#11",
                    "likes": "4",
                    "time": "29/08/2022-11:53:52",
                    "content": "Hey Gamma team, Maker currently has WBTC and RenBTC vaults, but this does not mean our risk tolerance towards this two assets is equal, our current exposure towards WBTC is magnitudes larger than to RenBTC, but also our potential exposure is much lower towards RenBTC, as the debt ceiling is only 10M. Since the underlying asset allocation can end up entirely in one asset only, we would be basically increasing exposure towards RenBTC uncontrollably; we must assume that potentially whole collateral will become RenBTC which automatically lowers the utility of this LP asset for Maker. I also don’t think an average holder of tokenized bitcoin is indifferent to the asset type; this is visible in the fact that demand for WBTC is much larger than RenBTC as supply of first is much larger than second. A few comments on submitted application;  You state the market cap of the asset in terms of the underlying assets, while the asset in question is the LP token, which is currently at $9M. The claimed $6B is completely misleading, as it assumes all tokens in existence would be supplied to the pool, which is completely unrealistic, as also the PoS native coins do not have more than 80% participation, even in blockchains where there is no risk associated with staking. The stated trading volume is overestimated; I didn’t calculate exact trading volume, but just by looking on the trading volume chart, it seems that neither Univ3 nor the Curve have volume of $1-5M and $8M daily average respectively. Additionally the CEX volume for RenBTC is almost non-existent and is not developing over time; this is negative because this means there is almost no demand outside of the DeFi & farming/yield world. Also I don’t understand why listing of this asset would shift TVL and volume towards Univ3 pool or increase the TVL from new users, and if so, the volume created by supplying assets is not organic volume, it will not exist once the positions are in new equilibrium. So basically the yield would be high for a few days as new users are providing liquidity and would then contract to normal volume, which is naturally low. How is this pool helping with liquidations exactly? This statement is largely based on assumption that TVL will increase, but currently there is no evidence to support that, everything is pointing to low demand. Also if we do assume it will increase due to Maker listing this collateral, it is almost 100% correlated with other tokenized bitcoin assets and as such is not a reliable source of liquidity for liquidations as it will likely decrease with the price and as LP liquidations occur. In the case of bitcoin price drawdown, the LP, WBTC and RenBTC vaults would need to be liquidated; WBTC is not really a problem because liquidity is vast. The problem is RenBTC, which we would be more exposed to due to this collateral, so this really doesn’t help at all. In such a case it is likely that the pool will end up 100% RenBTC. While I am not an expert on Ren network, saying that there is no centralization risk with RenBTC is maybe true, but the statement neglects the fact that there are other risks associated with RenBTC which are not with WBTC. So maybe we are less exposed to centralization risk, but we are more exposed to Ren network specific risks.  The demand for RenBTC has always been low, especially relative to WBTC and is not showing any signs of improving, on-chain and off-chain. Why do you think the demand will suddenly increase to hundred million? Is your estimated dai minted at 30-100M based on something, because it seems unreasonable that a pool with TVL of 9M will grow 4x or even 11x just because it can be used as collateral, given that the underlying assets can already be used as collateral and the demand for RenBTC is low. The 11x is quite a stretch, as it assumes almost all RenBTC tokens in existence will be supplied and used as collateral. The Univ3 collateral vaults with fiat stablecoins are different from this proposed collateral. They are constructed by reputable fiat stablecoins which have no market risk in theory and very slim based on existing data, meaning Maker can offer low collateralization requirements and high leverage which translates into good APY for vault owners and unique features for Maker. With a volatile-volatile Univ3 underlying asset, the liquidation ratio would be equal to the liquidation ratio of the riskiest asset, RenBTC at 165%. The USDC-DAI Univ3 vaults also create utility for Maker, such as lowering USDC PSM reserves and having higher USDC-DAI liquidity, which is not the case with RenBTC-WTBC pool. Lastly, Gamma Strategies is a new counterparty protocol, meaning that it would likely require much more additional resources from different teams in order to list this collateral compared to a collateral type which exists already, such as G-UNI. ",
                    "links": [
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/12",
                        "https://forum.makerdao.com/t/core-unit-de-riesgo-mes-en-revision-agosto-2022-traduccion/17699"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.334075918450919
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BP333",
                    "index": "#13",
                    "likes": "4",
                    "time": "29/08/2022-16:06:42",
                    "content": "Hey @rema thanks for your feedback. Please see below where I addressed your points:     rema:  You state the market cap of the asset in terms of the underlying assets, while the asset in question is the LP token, which is currently at $9M. The claimed $6B is completely misleading, as it assumes all tokens in existence would be supplied to the pool, which is completely unrealistic, as also the PoS native coins do not have more than 80% participation, even in blockchains where there is no risk associated with staking.   Although the asset in question is the LP token, the LP token functions mainly as an ERC-20 wrapper around the underlying assets. The reason I stated the individual market caps for each token is that the LP token is redeemable at any given time for the underlying assets. But I think what you’re getting at is how much liquidity is there for renBTC and WBTC in case of a liquidation, correct? There’s around $450M+ liquidity for WBTC on Uniswap v3:  image1539×689 72.6 KB  There’s around $741.6M in liquidity for WBTC on Curve:  image1186×524 56.6 KB  With regards to renBTC, the two largest liquidity pools would be the renBTC-WBTC-sBTC pool on Curve and the renBTC-wBTC pool on Curve. You can see the relative stats for both pools below. In case of a renBTC liquidation, you’ll have positive slippage in both pools.   Another important consideration is that you can burn renBTC at any time for real BTC.  It takes approximately 30 Ethereum blocks or approximately 5 to 10 minutes, from the time your transaction first gets mined.     rema:  The stated trading volume is overestimated; I didn’t calculate exact trading volume, but just by looking on the trading volume chart, it seems that neither Univ3 nor the Curve have volume of $1-5M and $8M daily average respectively.   I was attempting to be conservative in my initial estimates.  Happy to be proven wrong here.  The Uniswap subgraph is notoriously inaccurate, so my estimates could be off. The stated trade volume for the Uni v3 pool was based off the Uniswap subgraph data at the time of posting.  I don’t think it’s far off to say that you get approximately $1-5M in daily trade volume thru the WBTC-renBTC 0.05% pool on Uniswap.  image1548×641 58.7 KB  I think both the average and median daily volumes would fall between the $1-5M daily trade range. This was based off an eyeball approximation by looking at this chart, but I don’t think it’s materially off from that. In May, the daily volumes exceeded $20M / day on quite a few occasions. Here’s the chart for the daily renBTC trading volume on Curve:  Dune I’m not exactly sure what the average is, but I would say that solely renBTC volumes range between $380K on a low day to over $20M on a high day.  I would say the average falls between $4-6M per day. I wasn’t able to find purely WBTC volumes on Curve per day, but it would very likely be much higher than the renBTC given that it’s part of the tricrypto pool, ren, badger/wbtc, sbtc, and hbtc pools. So collectively, the WBTC + renBTC trade volume data on Curve is likely around $8M conservatively speaking, but likely much higher.  Again, please let me know if you have another source for where you’re getting your numbers.  Sometimes, these aren’t accurate.     rema:  Additionally the CEX volume for RenBTC is almost non-existent and is not developing over time; this is negative because this means there is almost no demand outside of the DeFi & farming/yield world. Also I don’t understand why listing of this asset would shift TVL and volume towards Univ3 pool or increase the TVL from new users, and if so, the volume created by supplying assets is not organic volume, it will not exist once the positions are in new equilibrium. So basically the yield would be high for a few days as new users are providing liquidity and would then contract to normal volume, which is naturally low.   I would agree with you on the CEX volumes.  However, the DEX volumes on Curve and Uniswap are really where renBTC is trading. The reason that I stated that volumes would increase as a result of listing this pair on Maker DAO is that it would attract more TVL to the Uniswap v3 pair.  The more TVL that is in the Uniswap v3 pair, the more organic and natural volume will be driven to this pool because more liquidity leads to lesser price impact, which organically drives more volume to the pool via DEX aggregators like 1inch and Matcha.  Right now, the majority renBTC <> wBTC trading volume takes place on Curve.  With increased liquidity in the Uniswap pair, you’ll attract more volumes to that pair.  It’s not just the volumes from new users supplying liquidity, but additional volumes being supplied by DEX aggregators which will direct volumes based on where price impact is lower.  image1851×929 143 KB  Case in point, take a look at the trade route for a 100 WBTC trade for renBTC on 1inch.  You’ll see that Curve takes up 92% of that trade volume market share.  With more liquidity in the Uniswap v3 pool via MakerDAO, that’s a lot of room for natural organic  growth in volumes via lower price impact.  More liquidity in the Uniswap v3 pool will increase Uni v3’s market share of that WBTC <> renBTC trade.     rema:  How is this pool helping with liquidations exactly? This statement is largely based on assumption that TVL will increase, but currently there is no evidence to support that, everything is pointing to low demand. Also if we do assume it will increase due to Maker listing this collateral, it is almost 100% correlated with other tokenized bitcoin assets and as such is not a reliable source of liquidity for liquidations as it will likely decrease with the price and as LP liquidations occur. In the case of bitcoin price drawdown, the LP, WBTC and RenBTC vaults would need to be liquidated; WBTC is not really a problem because liquidity is vast. The problem is RenBTC, which we would be more exposed to due to this collateral, so this really doesn’t help at all. In such a case it is likely that the pool will end up 100% RenBTC.   With regards to liquidating the LP, as mentioned earlier, it’s more about liquidating the underlying WBTC and renBTC because the LP is redeemable at any given time for the underlying.  So with renBTC, there’s around $90M of liquidity on Curve where you can quickly liquidate renBTC for WBTC at positive slippage.  But in the worst case scenario where renBTC depegs, you’ll have negative slippage in the Curve pools.  In that case, you can redeem renBTC for the underlying BTC on the renBridge at any time.  As mentioned before, it takes around 5-10 minutes or 30 Ethereum block confirmations for that to take place.  Historically speaking though, renBTC has maintained a fairly tight peg to WBTC.  One can argue that it does have less centralization risks that WBTC as well. There was another comment earlier about an article that was released saying that the renBridge is being used as mixer similar to Tornado Cash; however, that article has been proven false.  The renBridge is 100% traceable from the sender to the receiver by looking at each transaction.     rema:  While I am not an expert on Ren network, saying that there is no centralization risk with RenBTC is maybe true, but the statement neglects the fact that there are other risks associated with RenBTC which are not with WBTC. So maybe we are less exposed to centralization risk, but we are more exposed to Ren network specific risks.   Yeah we are exposed to Ren network risks, which in most recent history would be the article released on August 11th, claiming that renBridge was used to obfuscate transactions.  Although it is not a mixer nor does it hide transactions, the negative publicity could be a cause for concern.   Fwiw, there was another article debunking the claims of being able to use Ren to obfuscate transactions here: https://cryptoslate.com/alameda-owned-renvm-confirms-its-impossible-to-launder-any-assets-through-ren-bridge-debunking-claims-of-540m-in-money-laundered/ From a smart contract standpoint, Ren has never been exploited since it’s launch in May 2020.  It’s operated without a major bug or hack for years, so it has maintained its reputation over the years as a relatively safe bridge with over 12 billion in volume to date.  In terms of track record, it has a reputation for better or worse for slow development due to placing a higher priority on security. From a centralization standpoint, it’s not completely decentralized either, but less so than WBTC.  The core Ren team still operates the darknodes that control those keys.  According to the team, they have plans to decentralize by the end of the year, so there is still the risk that the team controlling those darknodes could have malicious intent.  The countervailing point would be that the real identities of the team are known.  They’re currently being supervised by Alameda as well.     rema:  The demand for RenBTC has always been low, especially relative to WBTC and is not showing any signs of improving, on-chain and off-chain. Why do you think the demand will suddenly increase to hundred million? Is your estimated dai minted at 30-100M based on something, because it seems unreasonable that a pool with TVL of 9M will grow 4x or even 11x just because it can be used as collateral, given that the underlying assets can already be used as collateral and the demand for RenBTC is low. The 11x is quite a stretch, as it assumes almost all RenBTC tokens in existence will be supplied and used as collateral.   I’m currently basing the demand for renBTC based off the current demand which is generating around $1-5M in volume per day on Uniswap and much more on Curve.  Average volumes on Curve for renBTC can be anywhere from $300k to $20M+ with an average of around $8m/day. Leveraged exposure to the WBTC-renBTC pool is also highly desired based on my discussions with hedge funds and institutional players in this space.  One of the more popular strategies would be to have a delta-neutral strategy with leveraged exposure to this pair while subsequently shorting the same amount of BTC exposure on a futures exchange.  In fact many of the suppliers to the leveraged USDC-DAI Uni v3 pair currently on Maker are institutional players looking for leveraged yield.  The renBTC-WBTC pair has currently higher APRs and more room to grow that APR by taking trade volume market share away from Curve with more TVL in the Uniswap pair as mentioned previously. There’s currently around 26 renBTC currently in the Uniswap v3 pool.  There’s around 1,296 renBTC currently trading in the Curve pools.  So I think there’s definitely a lot more than 11x room to grow in terms of the renBTC liquidity in the Uniswap pool.     rema:  The Univ3 collateral vaults with fiat stablecoins are different from this proposed collateral. They are constructed by reputable fiat stablecoins which have no market risk in theory and very slim based on existing data, meaning Maker can offer low collateralization requirements and high leverage which translates into good APY for vault owners and unique features for Maker. With a volatile-volatile Univ3 underlying asset, the liquidation ratio would be equal to the liquidation ratio of the riskiest asset, RenBTC at 165%. The USDC-DAI Univ3 vaults also create utility for Maker, such as lowering USDC PSM reserves and having higher USDC-DAI liquidity, which is not the case with RenBTC-WTBC pool.   Yeah I would agree with this; however, I would say that the two most reputable tokenized BTC tokens would be WBTC and renBTC.  In general, there is more demand within the pools for renBTC over WBTC as there’s generally positive slippage when trading from renBTC to WBTC and negative slippage when trading from WBTC to renBTC. The lower collateralization ratios on the stablecoin pairs is correct, but the counterpoint is that with WBTC-renBTC, you have higher APRs.  On WBTC-renBTC you have APRs between 1.8% - 9%, while the APRs on the DAI-USDC 0.01% pair is around 0.2% - 0.6%.  So while the collateralization ratio would be higher at 165%, you wouldn’t need to have as much multiplied exposure to the WBTC-renBTC pair as with the DAI-USDC pair to have the same leveraged APRs overall.     rema:  Lastly, Gamma Strategies is a new counterparty protocol, meaning that it would likely require much more additional resources from different teams in order to list this collateral compared to a collateral type which exists already, such as G-UNI.   Correct, we are a new counterparty protocol.  However we have been audited multiple times with the latest audits completed by ConsenSys Diligence and Arbitrary Execution.  Our contracts are different from G-UNI’s in that we don’t swap on rebalances, but instead place limit orders to save on swap fees and price impact which have a positive effect on yields.  Also, I think it would lower the counterparty risk overall to have multiple Uniswap v3 managers here so long as we all pass Maker’s due diligence process. Thanks again for taking the time to respond @rema!  We really appreciate your input! ",
                    "links": [
                        "https://cryptoslate.com/alameda-owned-renvm-confirms-its-impossible-to-launder-any-assets-through-ren-bridge-debunking-claims-of-540m-in-money-laundered/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.509391835016835
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/eurs-mip6-collateral-onboarding-application-stasis-euro-stablecoin/16137",
            "title": "[EURS] MIP6 Collateral Onboarding Application - STASIS Euro stablecoin ",
            "index": 16137,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "stasis",
                "cryptoeuro",
                "impact-:-medium",
                "stablecoin",
                "euro",
                "eurs"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/StasisMarketing",
                    "index": "#1",
                    "likes": "4",
                    "time": "28/06/2022-09:00:02",
                    "content": "Hello everyone! Greetings to the MakerDAO community! Following the request to re-apply, the STASIS team would like to propose a new onboarding application for EURS as a collateral asset. Below is our application following the latest MIP6 template. Likes, comments and questions are highly appreciated! 1. Who is the interested party for this collateral application? STASIS (STSS Limited Malta), the issuer of STASIS EURO (EURS) token. 2. Provide a brief high-level overview of the project, with a focus on the applying collateral token. STASIS is a European financial technology company that provides a bridge from Web 2.0 to Web 3.0 financial services. STASIS is the issuer of EURS, the largest euro fiat-backed stablecoin. Audited by a top-5 global audit firm, it has accumulated the trust and accountability of the global community over 4 years of presence on the scene. The blockchain infrastructure is currently live on Ethereum, Algorand and Polygon with several other blockchains in development. The STASIS mobile (iOS/Android) allows customers to pay, earn and run digital asset treasuries globally. The company develops services and account management instruments such as:  Fiat to crypto link (IBAN to blockchain address); Payments; Stablecoin acquiring and virtual cards; Services for businesses (payouts/ crypto processing, partner schemes); DeFi yield management; Multichain solution.  Among numerous competitive advantages is the market leadership. While other major stablecoins operate on the USD market, EURS solo caters to the needs of the European Union, the third-largest economy in the world, allowing people to settle, transmit and stake digital value. STASIS also enables an efficient bridge from DeFi to TradeFi. EURS successfully competes in the DeFi corner with the biggest euro-denominated staking pools. The STASIS’ 5 years of experience in KYC/AML practices and the established business setup allows customers to allocate and to exit DeFi in minutes. The further growth potential is significant. By building the software infrastructure around EURS, STASIS enables a $17 trillion European market and half a billion customers with access to non-custodial digital assets. STASIS and EURS are also supported by institutional players — the leading custodians such as PrimeTrust, KingdomTrust, and BitGo, as well as those tracked by Chainalysis, Coinfirm, and Elliptic. The world-leading accounting firm BDO provides annual audits and on-demand verifications. Currently, STASIS issues and distributes EURS via its liquidity providers, which consist of a number of licensed payment institutions, a broker, and several regulated crypto-fiat exchanges. Not only cash is used to buy EURS, but also crypto assets and securities thanks to our partners who process such transactions, converting financial assets into fiat euros. STASIS can undoubtedly be called a true pioneer of stablecoin initiatives in Europe. We took part in helping decision-makers to climb the learning curve by assisting in the creation of the crypto-regulation frameworks: our team consulted several government agencies in/ outside Europe; our team issued a book on crypto regulation in 2018 and an updated 2nd version in 2019, respectively. STASIS was a part of the expert INATBA task force and assisted in drafting the European framework for crypto-assets in 2020. We sent an insightful report to the ECB in 2020 to help design the CBDC product. We are the only Web 3.0 company that is audited by BDO, a top5 global accounting firm, to provide transparency and accountability to the community. STASIS Celebrates 4th Year Milestone|690x361 3. How long has the project been live in production? The STASIS company was launched in 2017 and EURS stablecoin — in June 2018, respectively. 4. Provide a brief history of the project. First, there has to be that discovery, that idea — a new asset class that could potentially be big regardless of the speculative nature of it or applicable technology likewise. Our team analyzed global legal frameworks around crypto and what different countries were after. Next, our team came up and published a book — issued the second version in 2019. The STASIS team chose Malta as a starting point and helped the local government climb the learning curve in DLT. Looking back, we started this whole European crypto-legalization movement which is now spreading to France, Germany, Spain, Italy, and some other countries. June 22nd, 2018, marks the first EURS emission. In 2022, EURS proudly stands as the largest euro-backed digital asset, combining the benefits of the world’s second most traded currency with the transparency, immutability, and efficiency of distributed ledger technology. 5. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. EURS token whitepaper:    whitepaper.io    STASIS EURO whitepaper - whitepaper.io View the STASIS EURO whitepaper and other documents here on whitepaper.io. We are building the largest online library of cryptocurrency documents.      EURS token smart contract code: GitHub - STASISNET/STASIS-EURS-token-smart-contract: Etherscan link EURS token Ethereum mainnet: https://etherscan.io/token/0xdb25f211ab05b1c97d595516f45794528a807ad8 EURS token Polygon mainnet: STASIS EURS Token (EURS) Token Tracker | PolygonScan EURS token Arbitrum mainnet: STASIS EURS Token (EURS) Token Tracker | Arbiscan EURS token Algorand mainnet: Algorand Asset Information 6. What type of asset is it? (e.g. store of value, currency, commodity, capital asset, governance token etc.) Stasis EURS is an Ethereum-based EIP-20 compliant token backed by the fiat currency euro. There is no governance token. 7. How is the asset used and does it give any rights to holders? (e.g. financial claims, dividends, governance rights)? EURS is used to enter the crypto market, pay, trade, and a counter volatility instrument, and it enjoys the biggest euro-denominated pools in DeFi. 8.What is the market cap for the asset? $130,592,888 at the time of writing, according to Coinmarketcap data. 9. Where does exchange for the asset occur? The EURS market is highly supported across both DeFi and CeFi sectors. There is also a gateway available through a Swiss licensed broker for fixed commissions. EURS does millions in dollar equivalent in daily volume on and off chain, with a particularly strong on chain profile. STASIS EURO has a growing market capitalization on the mainnet Ethereum, Algorand and Polygon which has increased 3x in the last year. Due to transparency and use cases, EURS is currently more liquid on DEXes than on CEXes (For example, Curve, Uniswap, etc). The top cryptocurrency exchanges for trading in STASIS EURO are currently HitBTC, Bitfinex, Hotbit. An updated list of exchanges is provided on our product’s website: https://eurs.stasis.net/community: 9.a Provide exchange data on market liquidity & volume EURS 24h Volume on 28/06/2022: $25,401,916.89. 10. Is the asset settled on chain (trustless) or off chain (trusted)? Assets are settled on chain — meaning transactions are performed via the blockchain infrastructure. 11. If offchain (trusted) settlement: describe what are the involved entities, process and estimated time. N/A 12. List any possible oracle data sources for the proposed collateral type.    data.chain.link    EURS Reserves | Chainlink Monitor the EURS Reserves Data Feed for accurate, up-to-date market data powered by Chainlink’s decentralized oracle network on Ethereum Mainnet.         data.chain.link    EUR / USD | Chainlink Monitor the EUR / USD Data Feed for accurate, up-to-date market data powered by Chainlink’s decentralized oracle network on Ethereum Mainnet.      13. List any parties interested in taking part in liquidations for the proposed collateral type. Numerium3, Woorton, AlgoZ, Nortide. Business Questions 14. What is/are the expected use case(s) of the Dai generated by the vault? The main use cases are the following:  On/off ramp asset; Exposure for higher yields in DeFi pools; Use of transparent fiat-backed asset to reduce volatility in portfolio as collateral.  15. What is the amount of Dai expected to be generated against the collateral and what is the timeline? Is there a commitment on a minimum amount of Dai to be generated? We expect that the forthcoming amount after EURS is listed as multi-collateral, we expect market makers to lock up to 70% of our supply (EURS-Curve pool is a perfect example of such an event). STASIS secured long-time support from liquidity providers such as aforementioned Numerious 3, Woorton, Algoz, Nortide that are ready to further support EURS during the favorable market conditions and interest rates & arbitrage opportunities. 16. What are the strategic benefits for MakerDAO in onboarding the collateral? EURS will be beneficial to MKR holders in many ways since it is a legally antifragile stablecoin issued in Europe. Having legal opinions from Malta, Germany, the UK, and the USA stating that EURS is not a security and not an e-money instrument, EURS does not increase external risks for the DCS and any user of the token. The token can be utilized in many ways. EURS is a fungible stablecoin that may be accessed in the Eurozone and beyond. EURS may also serve as a digital borrowing instrument. Finally, the token may be used in cross-border corporate settlement and by designated individuals for intercontinental remittance. EURS brings stability to the DAI peg due to its inherent nature of being pegged to fiat EUR, making the DCS robust and sustainable. Regarding EURS CDP, the token brings a higher level of transparency, stability, and accountability to the project as EURS is 100% collateralized and its fiat reserves can be monitored on our website. The token can be exchanged for fiat through our pool of 11 fiat settlement partners, the full list of which is available on EURS website. In 2018 DAI was integrated into STASIS Wallet and can be exchanged for EURS therein. STASIS has incorporated a “Sellback” option into the wallet that will allow a customer to seamlessly exchange EURS tokens to fiat EUR directly to his IBAN account. Hence, DAI holders will have an opportunity to move into fiat as well. No limit on the sellback amount after KYC. Legal Questions 17. What are the legal risks associated with the tokens? MiCA regulation will require certain capital commitments and audits by stablecoins issuers in the EU. 18. (Optional) Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? Yes. EURS issuer is registered in Malta. 19. (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. Yes. Multiple: Issued by Malta, UK, Switzerland, Germany, USA. 20. (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. Back in 2017, STASIS was part of government task forces in several EU countries. In 2020 the team was a member of the EU Commission-powered association INATBA and participated as an expert in the development of the EU framework for markets for crypto-assets which became the basis for MiCA regulation. STASIS was a member of the Maltese government taskforce to assist with drafting the Virtual Financial Asset Act. The Maltese government officials and regulators asked us to contribute to the legal framework and we consulted them. Now, according to the VFAA, EURS is identified as a virtual financial asset and the company is exempted from the appointment of any VFA agent. 21. Is issuance of the asset decentralized (trustless) or centralized (trusted)? The issuance of the asset is centralized. 21.a. If centralized/trusted: by which legal entity, type of entity and jurisdiction? EURS is issued by STSS (Malta) Limited (Legal form - LLC) registered in Malta. Technical Questions 22. Link any available audits of the project. Both procedural and smart contract focused audits. EURS token audits: STASIS EURO - CertiK Security Leaderboard Transparency and reserve verification: Transparency and reserve verification 23. Has the token (and/or supporting protocol) been formally verified? Yes: STASIS EURO - CertiK Security Leaderboard. 24. Does the asset follow a token standard? (E.g. ERC20, ERC721, ERC1400) Yes, EURS follows the ERC20 standard. 25. Is the asset, or asset balances, controlled by a central actor, or group of actors (e.g. through a multisig, or DAO)? EURS minting is controlled by the multisig Ethereum. 26. Does the token have whitelist or blacklist functions? If so, what is the process for utilization and what stakeholders are involved? Yes, the token smart-contract has blacklist functions. It is controlled by the multisig account. 27. Can the token implementation be upgraded/changed? If so, what is the process and what stakeholders are involved? Yes, the token implementation can be upgraded if needed (through the delegating mechanism). The process of token smart-contract upgrade is controlled by the multisig account. 28. Does the token contain rebasing logic? No, the EURS token does not contain any rebasing logic since it is fully backed by the fiat euro. 29. Provide (a) proposed legal structure for transaction, including: type of legal entities, (offshore/onshore, form (trust, corporate, other)) and jurisdiction(s) of legal entities, and (b) likely funds flow (DAI => Fiat => DAI). SCB AG, Switzerland, a VQF SRO FINMA-registered EURS broker. It will facilitate all the fiat interactions and flows with EURS in the Maker ecosystem on behalf of the issuer. SCB AG can face any clients after proper KYC/AML who would like to use EURS on/off ramps and who have access to the SEPA/ SWIFT network. 30. Provide details on the organizational structure of the interested party, beneficial ownership, governance/control, key personnel, capital/funding resources and past financial performance. STSS (Malta) Ltd is the EURS issuer, 100 percent of the shares in which are owned by STSS Limited, a company registered in the Isle of Man. All of the shares in STSS Limited are owned by Stasis Foundation. 31. Provide detailed summary of the proposed economic terms of the transaction, including, without limitation: commitment term, principal amount, interest rate, frequency of principal and interest payments, disbursement schedule, equity amount, funding ratios (equity/debt pro rata, equity first, etc.), collateral security, coverage ratios, currency (if not DAI) and other material terms. The quality of the proposed economic terms will be a consideration for the prioritization process. First deposit commission:  0–1.000 EUR: zero commission applies only to the first deposit; 100 EUR for all further deposits will be applied; ETH: 1.000–1.000.000 EUR: ETH — 0.1% minimum 100 EUR; other blockchains — 0.1% minimum 10 EUR; (Anything above the amount of 10.000 will be subject to 0.1%. Anything below 10.000 will be 100 EUR minimum for ETH network; 10 EUR minimum for ALGO and POLYGON networks); 1.000.000 EUR and above: 0.25% on all blockchains.  Regular buy/sell transactions:  ETH: 0.1%, minimum 100 EUR; anything above 1.000.000 EUR/month — 0.25%; ALGO: 0.1%, minimum 10 EUR; anything above 1.000.000 EUR/month — 0.25%; POLYGON: 0.1%, minimum 10 EUR; anything above 1.000.000 EUR/month — 0.25%.  32. Identify in reasonable detail the risks associated with this collateral application and the underlying asset(s) and proposed mitigants (if any). The risk summary should address, without limitation and to the extent relevant: market risks, commercial risks (e.g., diversification, credit, etc.), interest rate risks, legal and regulatory risks, general industry risks, competition, etc.   Major part of the EURS supply is issued on Ethereum. As such, any malfunction or unexpected functioning of the Ethereum protocol may impact the ability to transfer or securely hold EURS.   Cyberattacks and security breaches of the systems, or those impacting our customers or third parties, could adversely impact our brand and reputation and our business, operating results and financial condition.   The regulatory landscape as it relates to stablecoins, including EURS, continues to evolve. The MiCA regulation is proposed to come into place in 2025-2026. Such an evolution may create additional regulatory burden and expense and could materially impact the use and adoption of EURS.   The successful launch and adoption of central bank digital currencies by the ECB could potentially impact the demand for EURS.   EURS is backed by a fiat euro. That’s why EURS could be vulnerable to the macroeconomic risks of a traditional euro such as high volatility against other traditional currencies, negative interest rate, EU country risk, etc.   33. Outline the applicant’s underwriting guidelines/policies, origination strategy (marketing, sales, channels), servicing strategy (charge-offs, collections), and historical asset performance. STASIS’ main principle that defines the whole go-to-market strategy is based on transparency, trust and natural pace of network development. Our team has never paid for CEX/DEX listings, but achieved current milestones due to extensive work over the years. Our network effect helps to boost awareness on news/features/partnerships/integrations. STASIS never used aggressive budgets to promote EURS, but we have strong connections in space to secure publications in reputable media and spread the word via  social media/Twitter channels. We are building a critical piece of Web 3.0 infrastructure that merges financial services with emerging self-custodial economies: allows counterparties to legitimately integrate euro-as-a-service layers, onboard clients, and transfer funds between decentralized finance and the traditional financial system. We partner with licensed banks and financial institutions to provide payment and custody services, utilize a FINMA-registered crypto broker, and follow KYC/AML policies adopted in the EU dealing with euro-linked transactions. Historical asset performance: The all-time-high regarding the USD was recorded on April 26,2021, $1.40, and the all-time-low was recorded on March 13,2020 at $0.9808. 34. Outline the applicant’s risk monitoring and operations guidelines/policies (e.g., charge-offs, collection, recovery provisions, data collection and technology, etc). Each client passes KYC/AML procedures to use the SCB services. The cash reserves are held with licensed financial institutions. These institutions publish daily cash reserves, while the BDO verifies the reserves on a quarterly and annual basis. Chainlink provides online proof-of-reserves feeds that can be accessed on a on-demand basis. The smart contract has been audited by Certik twice. 35. Describe the regulatory regime applicable to the underlying asset (if any) and the applicant’s legal and compliance program relating thereto. The risk-based compliance framework is operated by an officially FINMA-recognized EURS broker, Switzerland. Compliance & AML Policy are based on FINMA instructions on AML/CTF, sanctions violations, and newly developed EU KYC guidance. 36. Identify any 3rd party persons likely to be relied upon by the applicant to implement the transaction (legal, accounting, servicers, trustees, etc.).   SCB AG, Switzerland, a VQF SRO FINMA-registered EURS broker;   SCB banks;   JayBee, KYC/ AML service provider;   Sumsub.   Thank you for your consideration, STASIS Team. ",
                    "links": [
                        "https://stasis.net/",
                        "https://eurs.stasis.net/",
                        "https://medium.com/stasis-blog/announcing-bdo-malta-as-stasis-auditor-4d3adf003a21",
                        "https://www.gov.mt/en/Government/DOI/Press%20Releases/Pages/2017/November/30/pr172750en.aspx",
                        "https://eurs.stasis.net/transparency/",
                        "https://whitepaper.io/document/748/stasis-euro-whitepaper",
                        "https://whitepaper.io/document/748/stasis-euro-whitepaper",
                        "https://github.com/STASISNET/STASIS-EURS-token-smart-contract",
                        "https://etherscan.io/token/0xdb25f211ab05b1c97d595516f45794528a807ad8",
                        "https://polygonscan.com/token/0xE111178A87A3BFf0c8d18DECBa5798827539Ae99",
                        "https://arbiscan.io/token/0xd22a58f79e9481d1a88e00c343885a588b34b68b",
                        "https://algoexplorer.io/asset/227855942",
                        "https://coinmarketcap.com/currencies/stasis-euro/",
                        "https://curve.fi/",
                        "https://uniswap.org/",
                        "https://coinmarketcap.com/exchanges/hitbtc/",
                        "https://coinmarketcap.com/exchanges/bitfinex/",
                        "https://coinmarketcap.com/exchanges/hotbit/",
                        "https://eurs.stasis.net/community/",
                        "https://data.chain.link/ethereum/mainnet/reserves/eurs-reserves",
                        "https://data.chain.link/ethereum/mainnet/reserves/eurs-reserves",
                        "https://data.chain.link/ethereum/mainnet/fiat/eur-usd",
                        "https://data.chain.link/ethereum/mainnet/fiat/eur-usd",
                        "https://eurs.stasis.net/",
                        "https://eurs.stasis.net/wallet/",
                        "https://sellback.scb.io/accounts/",
                        "https://www.gov.mt/en/Government/DOI/Press%20Releases/Pages/2017/November/30/pr172750en.aspx",
                        "https://www.certik.com/projects/stasis",
                        "https://stasis.net/transparency/",
                        "https://www.certik.com/projects/stasis",
                        "https://coinmarketcap.com/currencies/stasis-euro/",
                        "https://www.certik.com/projects/stasis"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.437485915910574
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/06/2022-09:09:58",
                    "content": "for the context: Circle (USDC) has just launched a EUR stable    circle.com    Euro Coin (EUROC) I A Euro-Backed Stablecoin Euro Coin (EUROC) is a euro-backed stablecoin that’s issued under the same full-reserve model as USD Coin (USDC). Euro Coin is always redeemable 1:1 for euros. Learn more.      that’s quite a competition and IMO Maker should not have more than one EUR stable collateral, if any ",
                    "links": [
                        "https://www.circle.com/en/euro-coin"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/StasisMarketing",
                    "index": "#3",
                    "likes": "4",
                    "time": "28/06/2022-09:16:28",
                    "content": "Yes, we follow the news. However, Circle-issued product is different. We’ll post a special article to clarify this point soon! Actually, we had a chat with Circle so the move was anticipated. Dear user, C ircle product has exposure to US and USD risks while EURS is a euro token issued in Euzone. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.744047619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#7",
                    "likes": "2",
                    "time": "28/06/2022-11:47:32",
                    "content": "Thank you for posting. Just a caution that we are seeing some new accounts promoting your application and the community values honesty and genuine participation. If it’s the team that’s promoting them via new accounts, please refrain from doing so.  image894×591 39.8 KB   image924×476 19.7 KB  Also, although EURS has been growing, its size is too small for it to generate significant fee for the Maker protocol. Even if we assume let’s say at extreme take 1/4th of total marketcap, that’s 32.6 million Dai minted assuming there’s no stricter collaterization ratio. Assuming 3% fee, that’s still less than a million. Realistically, it will be even smaller and considering oracle cost, it’s likely to be net negative for the protocol unfortunately. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.886946386946387
                },
                {
                    "author_link": "https://forum.makerdao.com/u/StasisMarketing",
                    "index": "#9",
                    "likes": "1",
                    "time": "28/06/2022-14:14:54",
                    "content": "Thanks for your concern! As far as we know, expressing support is not against the rules. We have encouraged the EURS community to do so, yes, but it’s not a paid shilling. Naturally, some members of the EURS community have not been previously registered on Maker forum. We expect more comments to arrive during the week and hope that users will still be able to express their opinion freely. As for the second part: is this just your personal opinion? EURS volume has been growing by leaps and bounds since early 2021. Yes, this is still not comparable to volumes of the industry-leading USD-backed products, but we certainly need multiple evaluations to prove your point is correct. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.832341269841271
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#10",
                    "likes": "0",
                    "time": "28/06/2022-19:40:20",
                    "content": "I write this post in my capacity as a community member, not an official ISCU communication. Instead of EURS as collateral for DAI, I encourage a proposal to form a CU to build out a EuroDAI system. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#11",
                    "likes": "0",
                    "time": "28/06/2022-19:49:52",
                    "content": "    StasisMarketing:  is this just your personal opinion?   Yes, it’s my personal opinion. Any in Maker community can support or question the proposal but ultimately, it’s decided by MKR holders ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#12",
                    "likes": "0",
                    "time": "29/06/2022-03:05:17",
                    "content": "@StasisMarketing A request has been made several times for your assessment of the guidelines. I have included the key points below. At this time, I do not see EURS meeting this requirement. If there is information you have not included or I have overlooked, please let us know. Otherwise, the collateral application will be marked as “Will No Do” and no further action will be taken. In the future, if your data supports the guidelines, please feel free to update this application. Thanks!  30M Dai minimum target debt ceiling Clear business case Min. $250M market cap of circulating supply Min. $40M of onchain liquidity (132% of debt ceiling)  Traded on at least 5 exchanges with  Daily exchange volume of the collateral asset >$2M. Order book depth of over $200k in the +2% and -2% tiers   Technical metrics to gauge complexity and upfront implementation cost      MIP6 Recommended Guideline Metrics for Onchain Collateral Onboarding Collateral Onboarding   Preface This body of work is a collaboration between the CES (@collateral-core-unit), Risk (@Risk-Core-Unit), Growth (@Growth-Core-Unit), PE (@Protocol-Engineering), and Oracle (@Oracles-Core-Unit) Core Units. I would like to thank the involved stakeholders for their valuable input. A special thanks to @rema and the Risk Core Unit for providing a comprehensive methodology to derive relevant financial metrics in accordance with their risk model, which was used extensively in this document.   Int…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.472689075630253
                }
            ]
        }
    ],
    "group_index": "1017"
}