{
    "poll_list": [
        {
            "title": "Local Liquidation Limit Adjustments for ETH-A, ETH-B, ETH-C, WBTC-A and WSTETH-A - November 15, 2021",
            "index": "11531",
            "option": "Yes",
            "supporting_mkr": "82,706",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/auction-throughput-parameters-adjustments-nov-9-2021/11531",
            "title": "Auction Throughput Parameters Adjustments - Nov 9 2021 ",
            "index": 11531,
            "category": [
                "Governance"
            ],
            "tags": [
                "liq-20"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "15",
                    "time": "09/11/2021-09:22:16",
                    "content": "Hey all, Because of the massive amount of minting in recent weeks seen from ETH and WBTC vaults, our auction throughput parameters defined by hole and ìlk.hole` became very limiting in what amount of debt Maker can liquidate in a specific time period. One auction cycle takes about 20min for ETH-B and 30min for ETH-A, ETH-C and WBTC-A vault. The current ilk.hole values are:  ETH-A: 40m ETH-B: 25m ETH-C: 30m WBTC-A: 25m WSTETH-A: 3m  The ilk.holes value determining auction throughput were set in the past so that 1) they aren’t too high causing cascading liquidations and 2) they aren’t too low so that when a larger amount of debt gets liquidated it takes too long (too many auction cycles) to settle it. Because the amount of debt from these collateral types increased significantly over the last few weeks, auction settlement time became longer when liquidating certain percent of debt. We made a table that shows how much time it takes to liquidate 20% of each vault type debt exposure. For instance, when potentially liquidating 20% of ETH-A debt (580m DAI) it would on average take 6 hours and 50 minutes to settle it. Therefore we are proposing higher ilk.hole values for these 4 vault types, which are still in line with the slippage models so that we don’t run into a cascading liquidation scenario (less than 3% on-chain slippage). Newly proposed ilk.hole parameters: - ETH-A: 65m - ETH-B: 30m - ETH-C: 35m - WBTC-A: 40m - WSTETH-A: 7m This shortens liquidation settlement time as seen on the chart below.  Chart1446×894 67.1 KB  We are also proposing to adjust the global auction throughput parameter hole from 100m to 150m in order to be more in line with local vault types changes. These parameter changes are proposed to be included in the on-chain poll next week, assuming there are no objections by the community. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/under-construction/12274/12",
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/ultraschuppi-delegate-platform/11193/9",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-november-2021/11914"
                    ],
                    "GPT-summary": "The author of the post is proposing adjustments to the auction throughput parameters due to the recent increase in debt from ETH and WBTC vaults. The post explains the current parameters and proposes new ones that are still in line with slippage models. The author also proposes adjusting the global auction throughput parameter. The post invites feedback and objections from the community.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.343796536796537
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "0",
                    "time": "12/11/2021-19:23:42",
                    "content": "This recommendation will go live for an onchain poll on Monday (2021-11-15), and voting will last for three days. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "12/02/2022-01:24:12",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "309"
}