{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/working-group-rwa-onboarding/4167",
            "title": "Working Group: RWA Onboarding ",
            "index": 4167,
            "category": [
                "Governance"
            ],
            "tags": [
                "gov-initiative",
                "real-world-finance",
                "working-group"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "9",
                    "time": "15/09/2020-11:42:14",
                    "content": "What/Why Following the signal request for prioritizing RWA inclusion, this working group aim to speed up implementation and insights on the subject. Who The working group currently: @mrabino1, @spin @williamr, @monet-supply, @equivrel, @sava , @allanca, @Planet_X, @schmittlea and @SebVentures People can join by contacting @SebVentures. How There is a working document I will maintain. This is open for transparency but the target for the working group is to have something more clean to present to the community at some point so it can be enforced by end of November (if we do signal + governance poll). Moreover, the community will be probed on specific subjects by polls. Calls will be scheduled to get community feedback/insights along the way. A RWA call is scheduled which will present shortly the working group. Let’s get things done! ",
                    "links": [
                        "https://docs.google.com/document/d/1MEu5LePELLTVI4sX2OMQCjwoY84hBIhf7blEVbUyJ30/edit?usp=sharing",
                        "https://forum.makerdao.com/t/agenda-discussion-collateral-onboarding-call-8-wednesday-september-16-17-00-utc/4062",
                        "https://forum.makerdao.com/t/rwa-last-2-months-review-updates-and-looking-forward/5225",
                        "https://forum.makerdao.com/t/mip41c4-sp1-facilitator-onboarding-real-world-finance/6226",
                        "https://forum.makerdao.com/t/fortunafi-external-audit-report-by-luca-prosperi/10363/3",
                        "https://forum.makerdao.com/t/a-maker-community-2020-summary/5848",
                        "https://forum.makerdao.com/t/mip7c3-sp5-domain-team-onboarding-risk-domain-team/5476",
                        "https://forum.makerdao.com/t/rwa-resena-de-los-ultimos-dos-meses-actualizaciones-y-lo-que-viene/5272",
                        "https://forum.makerdao.com/t/working-group-autonomous-makerdao-update/5197",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-8-centrifuge-6s-capital-wednesday-september-16-17-00-utc/4062",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-111-thursday-september-24-16-00-utc/4239/2",
                        "https://forum.makerdao.com/t/poll-rwa-working-group-hedging-dai-exchange-rate-for-rwa/4385",
                        "https://forum.makerdao.com/t/poll-rwa-working-group-centrifuge-model/4381",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-110-thursday-september-17-16-00-utc/4074/2",
                        "https://forum.makerdao.com/t/mip41c5-sp1-facilitator-offboarding-rwf-001/11306/2"
                    ],
                    "GPT-summary": "The author of the post is explaining the purpose and goals of a working group focused on RWA onboarding. The post invites people to join the working group and explains the process for community feedback and insights.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.3500000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/09/2020-17:24:01",
                    "content": "Thanks for kicking off this initiative. I think we should clarify that the format of the RWA call on Wednesday this week is following the regular format we established a few weeks. Both @mrabino1 and I will be presenting the two current initiatives to bring RWAs onto MakerDAO. I would propose that to keep the progress going we could do a RWA Call every two weeks following that? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/09/2020-20:50:59",
                    "content": "It seems a good idea  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#4",
                    "likes": "0",
                    "time": "15/09/2020-23:31:37",
                    "content": "Good idea, @spin ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#5",
                    "likes": "1",
                    "time": "15/09/2020-23:42:28",
                    "content": "Good idea - one concern I have about RWA-  will they be traded anywhere in real-world exchange so that we can have confidence in the current valuation - maybe even on chain price through an oracle?  One thing I like about Dai is the transparency.  I’m worried about having offline opaque assets that are difficult to value until they go into default. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#6",
                    "likes": "2",
                    "time": "16/09/2020-06:45:23",
                    "content": "@latetot Liquid RWA securities aren’t expected here (you can see PAXG or ARCA) and the idea is indeed to focus on illiquid stuff while keeping a good level of transparency on the underlying. On the plus side, valuation doesn’t change often. Notice also that the plan is to invest in securitized portfolios of RWA. There is therefore diversification and Maker has a safety buffer by investing only in the senior tranche. For instance, even with the subprime crisis, AAA (senior tranche) subprime RMBS lose only a few percentage point overall. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#7",
                    "likes": "1",
                    "time": "16/09/2020-15:09:07",
                    "content": "Thanks- so can you outline how the valuation process is expected to work after the CDP is opened- how can users be confident that the borrower is not on the verge of default if there is no liquid market for the securities?  Are there at least related securities from the borrower that trade on a market that could be used for valuation? Otherwise- it seems like we are totally at the mercy of the trustee to tell us if the borrower is going to default. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#8",
                    "likes": "0",
                    "time": "16/09/2020-15:43:20",
                    "content": "This is a good question for @mrabino1 and @spin ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#9",
                    "likes": "1",
                    "time": "16/09/2020-16:02:41",
                    "content": "All transaction under my RWA LendCo proposal for Credit Tenant Leases must go through an underwriting process before LendCo will even think about funding. LendCo needs to know (not comprehensive):  the tenant location loan amount budget target exit spread for the borrower developers history with LendCo appraisal from an independent licensed commercial real estate firm (groups like BBG (https://bbgres.com/our-services/valuation/) would be used) (other due diligence items, like site plans and permits, etc.)      latetot:  Are there at least related securities from the borrower that trade on a market that could be used for valuation?   The appraisal includes market comps. The appraisal can be shared with the Maker Rep (or anyone else that wants to see it provided they sign an NDA with LendCo). Part of the Maker Rep’s role is to help convey interim compliance. The appraisal drives an important Loan-to-Value metric constraint. This appraisal must be included in our package when LendCo goes for its annual audit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0249999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#10",
                    "likes": "2",
                    "time": "16/09/2020-16:29:30",
                    "content": "This always depends on the asset type but generally the idea is not to have a Vault backed by a single borrower but we pool individual loans and use shares in the pools as collateral in Maker. Over a large portfolio of assets you can build a general risk model that that can give a valuation of the portfolio with relatively high accuracy. We believe that this transparency must be available not just to Maker but anyone on chain. Therefore we’ve gone to great lengths to make sure this transparency is available on chain: the asset originators report loan by lone on a risk score and valuation of the asset and the pool models expected losses and revenue of these individual loans into the pool being able to give an accurate NAV to anyone investing in the pool. The asset originators will share their underwriting and origination process to determine if this is an asset they should add to the pool along with the data that they collect to feed into the credit model. As we scale this to a larger size, data that should be brought on chain by third party entities to verify that the on chain price model is correct. This data could for example include:  Personal Credit Score if there is a personal guarantor on the asset Real estate pricing: think of an oracle bringing zillow’s zestimate on chain for each NFT in the pool Cluster risk: an analysis of cluster risk on the entire pool such as (large counterparties, geographical risk, currency risk etc.)  As this entire structure scales up to larger amounts, these data sources can be integrated and the model overall will become more secure and more importantly not solely dependent on trusting the asset originator entirely. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.81952380952381
                }
            ]
        }
    ]
}