{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip47c1-adding-rwf-core-unit-multisig/7476",
            "title": "[MIP47c1] Adding RWF Core Unit Multisig ",
            "index": 7476,
            "category": [
                "Updates"
            ],
            "tags": [
                "real-world-finance",
                "multi-sig",
                "rwf-001",
                "mip-47",
                "multisig-rec"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "12",
                    "time": "13/04/2021-16:23:58",
                    "content": "Following my post here, I’m submitting a multsig wallet to be identified as ownership of MakerDAO. This wallet already received 40k DAI from the interim multisig. There is a legder spreadsheet here. Use of funds will be explained on the monthly Real-World Finance Core Unit report. Per MIP47c1:  Governance must be able to revoke funding and permissions from approved multi-sigs at any time.  You can check on the spending limit section here. The DSPauseProxy contract is allowed up to 1B DAI.  Signatory requirements providing no less than ⅔ of listed signatories to sign off on an action.  It’s a 1 of 1 multisig so above 2/3.  All signers must be tagged on the forum and their willingness to be included in the Multi-Sig publicly confirmed.  @SebVentures , I confirm  A representative for the Multi-Sig must be designated as an official point of contact.  @SebVentures  There must be a clear and public explanation of the purpose and scope of the Multi-Sig.  Holding the funds of the Real-World Finance Core Unit to pay for expenses.  A clearly defined process for onboarding and offboarding signatories.  All Real-World Finance Core Unit Facilitators are onboarded as soon as they are ratified and signatory requirements upgraded to be the next natural number equals or above 2/3 of participants. Same for the offboarding. When the last facilitator is offboarded, Governance should take back the remaining funds.  A wallet address to be whitelisted.  0x9e1585d9CA64243CE43D42f7dD7333190F66Ca09 @charlesstlouis @Davidutro @blimpa if any of you can add it to MIP47c2, it would be awesome. Thanks. ",
                    "links": [
                        "https://etherscan.io/tx/0x9745931bd3aae8796253d9c1fdbc3bed6672637bdd74c4025e18a4d013f3daff",
                        "https://docs.google.com/spreadsheets/d/17zB2ZJ-ANVVCH2cN68hZZHBCq_kClEk_qr6q1H_auSI/edit#gid=971858318",
                        "https://gnosis-safe.io/app/#/safes/0x9e1585d9CA64243CE43D42f7dD7333190F66Ca09/settings",
                        "https://forum.makerdao.com/t/transition-of-the-rwf-cu-multisig/12801",
                        "https://forum.makerdao.com/t/mip40c3-sp39-modify-core-unit-budget-rwf-001/10543",
                        "https://forum.makerdao.com/t/mip40c3-sp1-modify-core-unit-budget-real-world-finance/6225",
                        "https://forum.makerdao.com/t/mip40c3-sp12-modify-core-unit-budget-rwf-001/7985"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.759803921568628
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "20/04/2021-16:24:05",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}