{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/meet-your-delegate-19-onestone-w-truemaker/17858",
            "title": "Meet Your Delegate #19 - Onestone w/ @TRUEMAKER ",
            "index": 17858,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "delegation",
                "public-call",
                "pubcall-:-meet-your-delegate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "4",
                    "time": "12/09/2022-17:49:49",
                    "content": " Meet Your Delegate #19  Welcome to the (announcement of) nineteenth episode of Meet Your Delegate, where MKR holders and the broader community get to know their delegates. In this episode, we’ll have Onestone Recognized Delegate on, with @TRUEMAKER representing.  You can already check Onestone’s Delegation Platform to review and prepare questions for the event    Format will be a brief (~10 min) presentation from @TRUEMAKER followed by an open Question and Answer session.  Video Recording       Where    Zoom Video   Join our Cloud HD Video Meeting Zoom is the leader in modern enterprise video communications, with an easy, reliable cloud platform for video and audio conferencing, chat, and webinars across mobile, desktop, and room systems. Zoom Rooms is the original software-based conference...      Meeting ID: 827 7941 3306 Passcode: MYD19 Add to your calendar! ",
                    "links": [
                        "https://www.youtube.com/watch?v=MqbG43Ywr5E",
                        "https://us02web.zoom.us/j/82779413306?pwd=a3pBaG5PbTMrWkQ0TDZjbkQvN1I2dz09",
                        "https://us02web.zoom.us/j/82779413306?pwd=a3pBaG5PbTMrWkQ0TDZjbkQvN1I2dz09",
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=NmUxdWpoYW9sbzN0cWwyOXBoaWZuYXBmZHMgbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/16",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/17"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.585069444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kunfu-po",
                    "index": "#3",
                    "likes": "1",
                    "time": "22/09/2022-02:20:00",
                    "content": " Meet Your Delegate: Episode #19   Agenda   00:00: Introduction  00:46: Onestone Delegate Platform  16:04: Questions w/ TRUEMAKER  29:41: Conclusion   Video https://youtu.be/MqbG43Ywr5E  General Introduction  Payton Rose 00:00  Hello to everyone, and welcome. My name is Payton. I go by Prose11 online and am one of the governance facilitators at MakerDAO. Today is Meet Your Delegate call #19. We are joined by Onestone on delegation and represented by TRUEMAKER. We will start with a brief presentation about Onestone’s Delegation Platform, how they view governance, and plan to act as a delegate. Then we will open it up to questions and answers.   Delegate Introductions  Onestone Delegate Platform 00:46  I want to introduce myself. At the Forum and on Discord, I go by TRUEMAKER. My real name is Johnny; if anyone wants to reach out and use my real name, that is fine. The delegate platform’s name is Onestone, and I hope it grows and is more than just me, an individual contributor; for now, it is just me. I live in Fort Lauderdale. I am from a first immigration family. I want to provide a political context and my motivation to become a delegate and give a little bit of history on how long I have been in the Forum and have been a Maker holder and a Dai holder. I first acquired Maker in 2017/18. I have been holding Dai since this year when the risk appetite started falling, and I wanted to stay in crypto. I looked into Dai to compare many of my positions into it. But the main reasons for becoming a delegate are:   Delegate Platform1565×896 198 KB   DAI&#39;s market position1564×897 231 KB   Why a balanced DAI?1563×895 127 KB   Framework for Collateral Limits1564×894 164 KB   Questions 16:04   Matt_NZ: I have a two-part question. Part one, what do you think about Rune’s Endgame? Part two, what would you change if you had to change one thing about the Endgame Plan or the Proposal?  I agree with the Endgame Plan, especially the Eagle Stance. That is where I am comfortable and where my vision aligns most. The only section I cannot entirely agree with today is free-floating Dai. You can remain uncensorable and limit existential threats without removing that Peg, which would alter the product feature completely. The Phoenix Stance is the goal, but today, where the crypto industry is at, it is unrealistic to get there within that time frame unless the growth is exponential and the regulators do not get in the way of any growth that we want to achieve. I also agree that we need to grow our liquidity buffer as much as possible to test those theories down the road. For the next three to five years, I am in agreement with the Stances laid out.    18:05   PaperImperium: What do you think about the current MIPset for the Delegate’s Framework?  The main benefit I see is that the caps may not incentivize some delegate platforms to achieve broader knowledge on all the topics because they are already at the cap, and their expertise is being rewarded at the maximum level. So the ability to have more delegates than without ending a cap, they will be able to further their knowledge by either having the motivation that they probably did not have before to learn about the new topic or share some of that compensation with a new member on the team. Overall, it is a great initiative. Delegators are one of the ways that Maker holders can get their opinion and votes out there. As long as we stay motivated and do not harm the Maker’s price that much, and it is fair, at this point, it is not outrageous. It keeps delegates motivated, especially the ones that are at the cap. Three or four are very important to the Protocol and always provide good communication, so keeping them engaged is very important.    20:11   CodeKnight: Is the Eagle Stance based on free floating Dai? We need negative rates to get people to pull out of RWA and get them down to 25%. And to wiggle out of only talking about Endgame, how do you think we get the RWA exposure down without free floating Dai?  Free floating Dai is likely necessary. It is a theory yet to be proven because if you still have exposure to RWA, there are contractual agreements there that if the loan is for 100 million, for example, and you have free floating Dai, it might not be economically wise for the DAO to do that. At this time, RWAs are not a huge part of the Dai collateral, but in two to three years, as we try to wrap up the revenue and be resilient later on, it could be a growing part of the portion of the collateral and floating away from the USD Peg could impact the collateral and have a negative effect on Dai. It should not be seen as necessary. If it is, I would like to understand more and continue to educate myself on it. But today, I think Dai should remain in a hard Peg with maybe a broader range but still within a very tight range.    22:15   CodeKnight: Is the Eagle Stance based on free floating Dai? We need negative rates to get people to pull out of RWA and get them down to 25%. And to wiggle out of only talking about Endgame, how do you think we get the RWA exposure down without free floating Dai?  Free floating Dai is likely necessary. It is a theory that is yet to be proven because if you still have exposure to RWA, there are contractual agreements there that if the loan is for 100 million, for example, and you have free floating Dai, it might not be economically wise for the DAO to do that. At this time, RWAs are not a huge part of the Dai collateral, but in two to three years, as we try to wrap up the revenue and be resilient later on, it could be a growing part of the portion of the collateral and floating away from the USD Peg could impact the collateral and have a negative effect on Dai. It should not be seen as necessary. If it is, I would like to understand more and continue to educate myself on it. But today, I think Dai should remain in a hard Peg with maybe a broader range but still within a very tight range.    22:15   Payton Rose: A lot of people view USDC as an RWA. Many people are against the exposure or overexposure of USDC, and the only way to combat that that has been seen as viable is by swapping it for other RWA instruments. Does your vision involve a different plan for minimizing that exposure?  The USDC exposure today is greater than anybody in the DAOs. Most of us would agree that we are exposed to USDC, but a lot of that, as I mentioned in the presentation, is due to market conditions(…) As the industry grows and stablecoins become more prevalent and as we are starting to see more launches, that reliance on USDC will reduce substantially. On the other hand, USDC has done a good job of providing transparency into their collateral, which I am not saying is perfect. We should try to reduce that risk, but it gives a little comfort in knowing where the collateral is and how they generate yield; that transparency is very prevalent in the crypto industry. So even though it is a risk, there is a risk that we have transparency on the data. Regulatory risks are still prevalent, but it is hard to juggle all the different risks you have today. If you do not have the PSM, you might have a product whose key functionality, which is the Peg, might become more volatile.    24:37   PaperImperium: Do you have a delegator already lined up? If not, how do you plan to attract MKR?  I have a few small delegators that have committed to the platform. I plan to reach out to some others. But I have not gone on a campaign right now to whales. Mostly I want to get the committed delegate holders to delegate to me, start voting and communicating, get a field of their responsibilities of being a delegator before I go out, and attract other holders. If you want to see how it all plays out, many changes are coming soon, so I want to stay engaged and communicate as much as possible.    25:57   Payton Rose: You mentioned DAI adoption as a core principle of your platform. Where do you see these more users of DAI coming from?  It would be three main avenues for that:  Civilians of emerging countries that want to be exposed to DAI, such as the Argentina case and Venezuela case, are prevalent. There is a good understanding of DAI, but we are still experiencing some negativism towards crypto because of the USD collapse. Many people are still skeptical, even in those countries. If we continue to position a brand there, with the transparency and communication of the team, we can do organic growth for civilians that want exposure to USD, and the government is very limited in providing that. The second one is, for example, in other L1s and L2s making Dai available. It is already in Cosmos, but just growing that adoption across the board and maybe providing our flagship products for those blockchains. The last one would be for positioning DAI. You are ramping into DAI first-time users. It is a great coin. It provides you with a great community, and unfortunately, for many people today, their first coin is usually one they get into for other reasons, such as speculations. DAI provides you with that exposure of maintaining your phone safe but being able to interact with the rest of the DeFi, NFTs, and more.   Those are the three main places I see for a growth opportunity.    28:37   Payton Rose: Where can people get in touch if they want to follow up about your delegation platform?  I prefer the Forum.     Conclusion  Payton Rose 29:41  Thank you. I hope everyone has a great rest of the day, and let us continue the conversation in the Forum.   Common Abbreviated Terms DAO: Decentralized Autonomous Organinization RWA: Real World Asset DeFi: Decentralized Finance  Credits  Kunfu-po produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/MqbG43Ywr5E?t=46",
                        "https://youtu.be/MqbG43Ywr5E?t=964",
                        "https://youtu.be/MqbG43Ywr5E?t=1781",
                        "https://youtu.be/MqbG43Ywr5E",
                        "https://youtu.be/MqbG43Ywr5E",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854",
                        "https://youtu.be/MqbG43Ywr5E?t=46",
                        "https://youtu.be/MqbG43Ywr5E?t=964",
                        "https://youtu.be/MqbG43Ywr5E?t=1085",
                        "https://youtu.be/MqbG43Ywr5E?t=1211",
                        "https://youtu.be/MqbG43Ywr5E?t=1335",
                        "https://youtu.be/MqbG43Ywr5E?t=1335",
                        "https://youtu.be/MqbG43Ywr5E?t=1477",
                        "https://youtu.be/MqbG43Ywr5E?t=1557",
                        "https://youtu.be/MqbG43Ywr5E?t=1717",
                        "https://youtu.be/MqbG43Ywr5E?t=1781",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-september-2022/18396"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9083292104720675
                }
            ]
        }
    ]
}