{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - KF-DROP (Kickfurther DROP) - October 19, 2020",
            "index": "4064",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "33,819",
            "highest_fraction": 0.6
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/kf-drop-mip6-application-kickfurther-drop-consignment-inventory-finance-for-ecommerce-retail-brands/4064",
            "title": "[KF-DROP] MIP6 Application: Kickfurther DROP: Consignment Inventory Finance For eCommerce & Retail Brands ",
            "index": 4064,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "centrifuge"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Jason",
                    "index": "#1",
                    "likes": "6",
                    "time": "10/09/2020-00:09:01",
                    "content": "This MIP6 Proposal provides exposure to consignment inventory financing for eCommerce and retail Brands (the “Brands”) that is originated by Oiuby, Inc. DBA Kickfurther (“Kickfurther” or the “Asset Originator”). This is the fifth MIP6 application to use Centrifuge’s solution. The previous MIP6 applications can be found here: CF-DROP PC-DROP NS-DROP HTC-DROP  1. Who is the interested party for this collateral application? Kickfurther: is an Asset Originator that operates a marketplace for eCommerce and retailer brands to offer inventory available for purchase on consignment. Centrifuge: will provide the technology and framework for bringing real-world assets to MCD. The main contact on Tinlake for the application is Jason Jones (@Jason, [email protected]) as well as Lucas Vogelsang (@spin, [email protected]) of Centrifuge. Kickfurther Series One LLC (“KF1”): KF1 is the Issuer of KF-DROP. KF1 will enter into a purchase agreement with Kickfurther for a certain percentage of every deal originated on their platform. KF1 will utilize Centrifuge to pool its assets and offer ERC-20 tokens to investors, specifically DROP Tokens and TIN Tokens.  2. Provide a brief high-level overview of the project, with a focus on the applying collateral token We will start with a brief summary of Kickfurther, the Asset Originator, and provide information on the Tinlake Protocol, the technology that Centrifuge has built and how they interact with Maker later. The asset type we are proposing for inclusion in MCD is part of the real-world assets series that Centrifuge has been supporting in the previous months and differs slightly from the majority of collateral applications: the Asset Originators will be using MCD directly as a line of credit to originate new loans. This means they will add large amounts of debt likely using up the assigned debt ceiling for the collateral type while paying a stability fee in return that is in par with industry standard rates. About Kickfurther Kickfurther addresses the inventory cash flow problem faced by many fast growing consumer Brands that must provide ever increasing amounts of capital caused by the time duration between buying inventory to manufacture products and the generation of cash revenue upon selling the product (ie, the working capital cycle). Kickfurther’s marketplace matches Brands that need capital to purchase inventory with a community of Buyers who are willing to purchase inventory on consignment in exchange for a participation in the profits upon sale. Kickfurther’s Inventory Funding marketplace is based on the concept of a Consignment Opportunity, or Co-Op for short. Co-Ops represent consignment agreements between Brands and Buyers. Under these agreements, Brands present certain products for purchase and resale as consignment inventory. Co-Ops are made up of individual packs (“Packs”) of products offered for sale by the Brand. Buyers participate in Co-Ops by purchasing the Packs for consignment. When the inventory sells, the Buyers earn income. These assets have the following characteristics:   Collateral: consignment inventory  Average Co-Op Deal Size: ~$100,000  Range of Co-Op Maturities: 1-12 months  Avg Co-Ops Per Month: ~20  Total # of Co-Ops Financed on Kickfurther: 900+  Total $ Co-Ops Finance on Kickfurther: $48m+  Deal flow mix: 51% ecommerce / 49% retail  Repeat business: 70% of Brands  Average return to investors, net of fees and defaults: ~14%  The following describes an exemplary use case  When a Brand raises a successful Co-Op, the funds are used to purchase new inventory or reimburse the Brand for pre-existing inventory. When new inventory is being produced, the manufacturing process can take anywhere from a week to a few months. This is called the “Lead Days Period” and it is shaded in blue. The product is then made available for sale and it may take anywhere from a few weeks to a few months to sell the product. Co-Ops are structured so that, at most, only 80% of the products funded need to be sold to trigger the full payment obligation on the Co-Op. Payments for sales made are generally due pursuant to a business’s typical payment terms. The green dots on the graph above represent the timing and cumulative amount of actual payouts versus the purple dots, which represent the expected payouts. This Co-Op was for Piccolina Kids, a fast growing apparel company that offered a Co-Op in Feb 2020 after it generated over $250k in sales in its first quarter of business in 4Q19. The product was a 100% cotton, short-sleeve t-shirt called “Trailblazer Tees” featuring illustrated portraits of famous female leaders across various fields. They were manufactured by a female-owned factory in Peru and all of the art was designed by noteworthy female artists from around the globe. Several of these Tees were featured in Oprah’s Favorite Things 2019. The deal fully paid off well ahead of schedule and generated a 28% annualized profit over 3 months for Buyers.     $28     $1.63     28.39 %     3.1 Months       T-shirt Price     Profit per Pack     Return (annualized)     Co-Op Duration        Overview of Tinlake Smart Contracts Centrifuge is building a full stack of tools to bring real-world assets into DeFi:  Centrifuge provides the technology stack to tokenize real-world assets in the form of an NFT. Each NFT represents one unique real-world asset, a loan, with a unique default risk that is priced by an off-chain oracle. Tinlake is our securitization protocol that handles the bundling of these individual loans and issues an interest bearing ERC20 token against the pool to allow investors with different risk profiles to invest into the pool. For the Kickfurther asset pool these tokens will be called KF-TIN] and [KF-DROP] [KF-TIN] represents the junior tranche and takes first loss. For Kickfurther the ratio is set at 20%. Please find the documentation on our tranche structure here and the forum thread about how they work within MCD.  Legal Setup  END_Bridge LLC (the “Series Parent”), a Delaware Series LLC, which will offer a newly created series, Kickfurther Series One LLC (the “Issuer”). The Issuer will offer tokens to investors corresponding to inventory purchased from the Asset Originator, owned by the Issuer, and to be sold by Kickfurther’s Brands. The Series Parent will enter into an operating agreement with Centrifuge to facilitate transactions using Centrifuge technology at the lowest possible cost to investors. The Series Parent will also enter into a separate Series Agreement with the Issuer. The Issuer will enter into a purchase agreement with Kickfurther to purchase a certain percentage of every Co-Op offered on Kickfurther’s marketplace. The Issuer will also enter into the Tinlake Protocol Service Agreement with Centrifuge to utilize the Tinlake Protocol. The Issuer will also enter into a subscription agreement with investors. The Issuer is structured as a bankruptcy remote special purpose vehicle. As the pool size grows and becomes more institutional, the Issuer will continue to add additional investor protections like a back-up servicer and an SPV manager and/or trust structure.  3. Provide a brief history of the project About Kickfurther Kickfurther was founded by Sean De Clercq in 2014. In the last few years Kickfurther has experienced a significant acceleration and had a record breaking year in 2019 when revenue grew 43% yoy and is on track to grow over 100% in 2020. Its recent success is attributable to refining its offering, enhancing its credit underwriting, and benefitting from macro trends in ecommerce growth. Cumulatively to date (as of August 27, 2020), Kickfurther has helped raise over $48 million for over 895 business Co-Ops with funding from over 21k buyers and over 70% repeat business. The average deal size is $101k, the medium funding time is 24 minutes, and the average IRR is 14.2%.  1600×615 69.1 KB  About Centrifuge Centrifuge was founded in 2017 and has built a solution for businesses to use their assets as collateral and borrow money through DeFi protocols. It was founded by a team of experienced entrepreneurs who at their previous company, Taulia, built supply chain finance products for over 120 of the Global 2000 companies focusing on financing assets in the global supply chain. Centrifuge has received $8.2M in VC funding from a list of experienced & reputable investors and its core mission is to change the rules of global commerce by bringing fairer financing options to business around the world. With Tinlake, Centrifuge is building the tools to make these assets liquid and truly DeFi native. Centrifuge shares the vision that real-world assets will be the natural extension of the current MCD system bringing DAI to the masses while diversifying risk. We are closely working with the community on how real-world assets should be integrated into MCD and how we aim at minimizing trust as we bring these assets live. Centrifuge and the Maker Foundation have collaborated on helping numerous asset originators prepare for bringing real-world assets into DeFi. KF-DROP is the fifth MIP6 application to use Centrifuge.  4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. Kickfurther’s mainnet deployment is scheduled for late September and will be accessible via tinlake.centrifuge.io Technical documentation about Tinlake can be found here:  Github: https://github.com/centrifuge/tinlake  Tinlake Documentation A detailed walkthrough of the Tinlake smart contracts; Recording: here    5. Link any available audits of the project. Both procedural and smart contract focused audits. Centrifuge has conducted several audits of its technology stack. The audits can be found here:  https://github.com/centrifuge/security/tree/master/audits   6. Link to any active communities relating to your project.   Centrifuge Discourse Forum  Kickfurther Community Intro Forum Participation in Maker Community Calls [1], [2] Hosted Collateral Onboarding Calls with the Maker community; the recording of previous calls can be found here: [1], [2], [3], [4] Pre-MIP discussion: Vault Liquidation Mechanism for Centrifuge Assets in MCD MIP22 Proposal: Centrifuge Direct Liquidation Module   7. How is the applying collateral type currently used? Kickfurther has been actively funding consignment inventory since 2015. The Series Parent has reached an agreement to purchase up to 5% of every transaction from the Kickfurther marketplace to bring to the Maker. KF1 will launch on Tinlake in late September 2020 and target a starting pool size of 300,000 Dai. Centrifuge Tinlake has been in development since early 2018 and is evolving rapidly. Kickfurter One will be our eighth pool from five different Asset Originators. To date (as of Sept 8,2020) Tinlake has had a total transaction volume of more than 2 million DAI. Find details on all pools on https://tinlake.centrifuge.io/.  8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? Kickfurther Series One LLC, a Delaware LLC, will bear legal responsibility for the collateral. KF1 will be a buyer on Kickfurther’s marketplace. Kickfurther terms of service can be found here: Kickfurther Store Terms of Service. This SPV structure creates a bankruptcy-remote entity whereby owners, debt holders or interested parties of this newly created SPV are left unaffected by the parent’s financial, operational and/or legal health.  9. Where does exchange for the asset occur? The SPV enters into a subscription agreement with lenders who are receiving DROP from the SPV in turn for providing DAI. The DROP token can be redeemed against the cash flows of the underlying collateral directly from the SPV by any DROP holder. This is ensured by the Tinlake smart contracts and the primary way for interacting with these tokens.  10. (Determined by Legal Domain Team) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. We do not have any materials we can provide at this time.  11. (Determined by Legal Domain Team) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable.  12. (Optional) List any possible oracle data sources for the proposed Collateral type. Determining the correct price of a real-world asset behaves differently from pricing Ethereum native collateral tokens. In order to adequately price a [asset]-backed loan several factors must be considered (please read our fundamentals of pricing real-world assets for additional information). Tinlake requires not just an accurate price of the overall pool but details on a loan by loan basis. Kickfurther significantly upgraded its risk scorecard in 2017. The team applied their years of experience and backgrounds to develop a completely original risk scorecard. Credit Analysis and metrics:  Number of active wholesale relationships (last 90 days) Years in Business Annual Revenue PO Assignment Verified PO Personal Guarantee UCC-1 Lien Supplier Payment Verification Logistics Access Repeat Brand Self-Warehouse  The risk score is calculated from these inputs and is used to determine the profit per pack and Co-Op duration. Tinlake uses these NFT values to control how much money borrowers can withdraw. If a Co-Op does perform as expected it will be flagged as troubled and the Buyers will have the opportunity to vote to cancel the consignment contract and push the Co-Op into Kickfurther’s cancellation pipeline. If more than 50% of the Buyers, weighted by ownership, vote to cancel the Co-Op, then the cancellation process begins. There are three stages to the Cancellation process: Cure Period: The Co-Op will have approximately 15 days to cure their issue by buying out the inventory at a pre-negotiated option price, provide proof of delivery of inventory, doing a mix of buying inventory and returning inventory, or creating a unique settlement for Buyers, which Buyers will then vote to accept or reject. Review Period: During this period, settlement vote may occur and returned inventory may be made available for Buyers. Any goods left over after Buyers have the opportunity to take full or partial delivery of the goods they are entitled to are usually liquidated. Collection Period: The longer an item is not sold, the less likely it will be to successfully collect. For items between 0 and 30 days past due, the estimated collections rate is 50%. For items 30 to 60 days past due, the estimated collection rate falls to 25%. For items 60 to 90 days past due, the estimated collection rate falls to 10%. And finally, for items more than 90% past due, the estimated collections rate is only 1%.  1320×717 126 KB  To determine the value of the entire portfolio (simplified the sum of the market value of all loan NFTs) is usually by doing a net-asset-value (NAV) calculation across the portfolio. Centrifuge is implementing the NAV model in smart contracts that can calculate this information based on individual pricing information in real time based on the NFT price information.  13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type. Kickfurther Series One LLC will be a highly diversified asset pool. If KF1 takes 5% of every Kickfurther Co-Op and the average Kickfurther Co-Op is $100k, then each KF1 investment will be approximately $5,000. Assuming the target pool launch size is 300,000 Dai, then we expect the pool will quickly grow to 50+ Co-Ops. The TIN tranche will represent 20% of total assets, which will be 60,000 Dai at the launch. This means that approximately 12 Co-Ops will need to completely fail before the DROP tranche is impacted. We believe that this scenario is extremely unlikely. In the case of a DROP liquidation event, Tinlake contracts will enforce a rebalancing of the pool to bring the collateralization ratio back into compliance.Tinlake will prevent the issuance of any new loans while the collateralization ratio is out of range and will distribute all cash flow repayments to DROP token holders rather than reinvesting them. Once the liquidation process begins, KF1 will allow any short term payments (<90 days) to repay and KF1 will negotiate a sale of all remaining DROP assets to a private Kickfurther investor. There are over 20,000 Kickfurther investors. ",
                    "links": [
                        "https://forum.makerdao.com/t/pc-drop-mip6-application-paperchain-drop-tokenized-music-streaming-invoices/2215",
                        "https://forum.makerdao.com/t/ns-drop-mip6-application-new-silver-drop-real-estate-backed-loans/3477",
                        "https://forum.makerdao.com/t/htc-drop-mip6-application-harbor-trade-credit-drop-short-term-trade-receivables/3502",
                        "https://www.kickfurther.com/",
                        "https://piccolinakids.com",
                        "https://developer.centrifuge.io/chain/overview/introduction/",
                        "https://developer.centrifuge.io/tinlake/overview/tranches/",
                        "https://forum.makerdao.com/t/centrifuge-onboarding-rwa-backed-collateral-to-mcd/2721",
                        "http://info.kickfurther.com/the-origin-story-of-kickfurther",
                        "https://www.linkedin.com/in/seandeclercq/",
                        "https://taulia.com/",
                        "https://www.coindesk.com/makerdao-weighs-accepting-real-world-assets-as-crypto-loan-collateral",
                        "https://medium.com/centrifuge/black-thursday-showing-the-potential-for-real-world-assets-in-defi-d0538dd53da9?source=collection_detail----3fedb79e85fe-----3-----------------------",
                        "https://medium.com/centrifuge/defi-and-the-real-world-a-trust-issue-46f105eebe92",
                        "https://tinlake.centrifuge.io/pool/kickfurther-1",
                        "https://github.com/centrifuge/tinlake",
                        "https://developer.centrifuge.io/tinlake/overview/introduction/",
                        "https://www.youtube.com/watch?v=aXnpEcZHJIM&t=133s",
                        "https://github.com/centrifuge/security/tree/master/audits",
                        "https://discourse.centrifuge.io/",
                        "https://discourse.centrifuge.io/t/community-introduction-kickfurther/218",
                        "https://www.youtube.com/watch?v=rv3HpZ5ZSHU",
                        "https://www.youtube.com/watch?v=336RkUuI6hA&t=2s",
                        "https://www.youtube.com/watch?v=336RkUuI6hA&t=4s",
                        "https://www.youtube.com/watch?v=3WyBwisQggk&t=10s",
                        "https://www.youtube.com/watch?v=PmUd5Ua6UJ4",
                        "https://www.youtube.com/watch?v=x44aQJEWpEQ",
                        "https://forum.makerdao.com/t/vault-liquidation-mechanism-for-centrifuge-trade-finance-assets-a-pre-mip-discussion/3737",
                        "https://forum.makerdao.com/t/mip22-centrifuge-direct-liquidation-module/3930",
                        "https://tinlake.centrifuge.io/",
                        "https://www.kickfurther.com/store-terms",
                        "https://developer.centrifuge.io/tinlake/overview/pricing_rwa/",
                        "https://medium.com/centrifuge/tinlake-pricing-and-valuation-series-part-2-valuing-an-asset-portfolio-247d8f2f0d5",
                        "https://forum.makerdao.com/t/maker-relay-ep-12/4153",
                        "https://forum.makerdao.com/t/maker-relay-ep-18/4881",
                        "https://forum.makerdao.com/t/maker-relay-ep-17-en-espanol/4804",
                        "https://forum.makerdao.com/t/maker-relay-ep-17/4798",
                        "https://forum.makerdao.com/t/agenda-discussion-collateral-onboarding-call-8-wednesday-september-16-17-00-utc/4062/2",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/62",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/fft1-drop-mip6-application-fortunafi-drop-revenue-based-financing-assets/6015",
                        "https://forum.makerdao.com/t/p1-drop-mip6-application-peoples-company-drop-us-agricultural-real-estate/5518",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-8-centrifuge-6s-capital-wednesday-september-16-17-00-utc/4062",
                        "https://forum.makerdao.com/t/maker-relay-ep-18-pt-br-portugues/4891",
                        "https://forum.makerdao.com/t/maker-relay-ep-18-en-espanol/4882",
                        "https://forum.makerdao.com/t/maker-relay-ep-17-pt-br-portugues/4810"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.387074491992525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "1",
                    "time": "10/09/2020-08:16:06",
                    "content": "Hi @Jason and thank you for this collateral application, Consignment inventory finance is a highly interesting concept and should be well suited for Maker. The time to maturity for KF-DROP is long, but it should maybe be possible to average the maturities by bundling and so use the proposed Vault Liquidation Mechanism for Centrifuge Trade Finance Assets: A Pre-MIP Discussion? The rate possible for this product is probably the highest we in the Maker community have seen so far. Some questions/comments regarding Kickfurther and Centrifuge.  Kickfurther is already a growing business using crowdfunding. However, KF-DROP will be sold using Centrifuge’s subscription model. Does this mean that specific finance opportunities will not be offered on both platforms at the same time? For the Maker risk team: I could not find Quiby financial statements on the internet, but I suggest you ask for them if/when doing the Risk analysis. One thing is growth, but Quiby needs to be sort-of-profitable if the Maker-Centrifuge-Quiby/Kickfurther relationship is going to last. Otherwise the counterparty risk will be very high for Maker.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.123125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jason",
                    "index": "#3",
                    "likes": "0",
                    "time": "11/09/2020-00:30:00",
                    "content": "Hi @Planet_X Kickfurther’s maturities range from 1 to 12 months. We will outline a proposed Vault liquidation solution to be reviewed by Maker domain teams and community.   Kickfurther will continue to offer crowdfunding Co-Ops on their marketplace so that buyers can research and purchase individual offerings. KF1 will invest in a small slice of every Co-Op offered on the Kickfurther marketplace and will bridge the KF1 pool of Co-Ops to DeFi by using Tinlake to create KF-DROP tokens. KF1 will invest in the sames Co-Ops that are offered to all other buyers on Kickfurther, not in separate deals.   I agree that Kickfurther must have solid financial backing in order to minimize the risk for Maker. The firm has raised $2.3m in seed funding to date and is likely to close a Series A in the coming months. Given the quality of their board members, their recent momentum, their unique business model, and their ecommerce positioning, they seem well positioned to attract capital:  https://www.crunchbase.com/organization/kickfurther   Kickfurther has previously raised money from Draper Associates. VC investor Bill Tsai (Zoom, Canva, Birfury, Cryptokitties) sits on the board: https://www.globenewswire.com/news-release/2016/04/11/972636/0/en/Venture-Capitalist-Bill-Tai-Backs-Kickfurther-Joins-Advisory-Board.html And Lending Club co-founder and former board member, John Donovan is also a board member https://www.linkedin.com/in/jgdonovan/ ",
                    "links": [
                        "https://draper.vc/",
                        "https://www.globenewswire.com/news-release/2016/04/11/972636/0/en/Venture-Capitalist-Bill-Tai-Backs-Kickfurther-Joins-Advisory-Board.html",
                        "https://www.linkedin.com/in/jgdonovan/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jason",
                    "index": "#4",
                    "likes": "1",
                    "time": "27/10/2020-16:10:28",
                    "content": "Kickfurther is running a contest to award up to $250,000 in no-cost funding to help small businesses grow. They created the giveaway to spotlight the availability of small business capital even as businesses reported frozen or withdrawn funding from many lenders. Several prominent VCs will serve as judges. Here is the press release: Kickfurther Launches 2020 Growth Giveaway ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#5",
                    "likes": "0",
                    "time": "02/05/2022-04:46:26",
                    "content": "Dear @Jason, The process for MIP6 applications for off-chain collateral, so called real-wold assets, has been under significant review by the teams involved in collateral onboarding (RWF, CES, Growth and incubating LTS and LOVE). See more for collateral onboarding process. The goal of this process update is to provide MKR tokenholders and respective delegates a comprehensive view of MIP6-RWA applications from a credit, legal and technology perspective so tokenholders can make a more informed decision before moving applications through the execution of the onboarding process after greenlight. As part of this review, MIP67 and the underlying Methodology for structured finance transactions were written to provide applicants with a more comprehensive set of guidelines and requirements so MIP6 applications are fit for purpose and closer to a state where they could be executed, if prioritised by tokenholders during polls. MIP67 is now part of the MIP6 process. It is designed to fill the gaps in the MIP6 application for RWAs. Our domain team is aligned to the approved MIP67 process and Methodology. We are asking MIP6-RWA applicants to express whether they will retrofit their MIP6 applications in line with MIP67/Methodology guidelines. We ask applicants to express their intention by Mon 9 May at 12pm UTC. The collateral application template is located here: MIPs Portal. Status of MIP6 applications that do not express their interest by 9 May will be considered “withdrawn” from a MIP6 collateral onboarding point of view by the aforementioned Core Units and reflected in the CSI. We understand that once applicants express their intentions, there will be a period for drafting and updating documentation of the newly proposed MIP6 applications. Our teams will be available to provide guidance to applicants during this time. Kind regards, William. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip67-methodology-and-review-process-for-structured-finance-transactions/13737",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://vote.makerdao.com/polling/QmWt5fov#vote-breakdown",
                        "https://mips.makerdao.com/mips/details/MIP6#component-summary",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.713068181818182
                }
            ]
        }
    ],
    "group_index": "2686"
}