{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - RWA Arranger (BlockTower Credit) - August 15, 2022",
            "index": "16900",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "86,934",
            "highest_fraction": 0.75
        },
        {
            "title": "Add Multiple BlockTower Credit Vault Types (RWA010, RWA011, RWA012, RWA013) - November 21, 2022",
            "index": "16900",
            "option": "Yes",
            "supporting_mkr": "73,902",
            "highest_fraction": 0.78
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip6-collateral-onboarding-application-blocktower-credit-arranger/16900",
            "title": "MIP6 Collateral Onboarding Application: BlockTower Credit (Arranger) ",
            "index": 16900,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "centrifuge",
                "mips",
                "real-world-finance",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/humancapitol",
                    "index": "#1",
                    "likes": "21",
                    "time": "29/07/2022-13:24:09",
                    "content": "Collateral Application Questions [ MIP6c2 ] [ # ] refers to questions numbered below Background Information  Who is the interested party for this collateral application? - Answered here  Provide a brief high-level overview of the project, with a focus on the applying collateral token. - Answered here  How long has the project been live in production? - Centrifuge Tinlake has been live since 2019 Provide a brief history of the project. - Answered here  Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. - See Tinlake and Maker Tinlake documentation   Asset Information  What type of asset is it? (e.g. store of value, currency, commodity, capital asset, governance token etc.) - Answered here  How is the asset used and does it give any rights to holders? (e.g. financial claims, dividends, governance rights) - Answered here  What is the market cap for the asset? - Not yet applicable. Where does exchange for the asset occur? 9.a Provide exchange data on market liquidity, volume and order book depth. - Not yet applicable. Is the asset settled on chain (trustless) or off chain (trusted)? - Answered here  If offchain (trusted) settlement: describe what are the involved entities, process and estimated time. - Answered here  List any possible oracle data sources for the proposed collateral type. - Answered here  List any parties interested in taking part in liquidations for the proposed collateral type. - Answered here   Business Questions  What is/are the expected use case(s) of the Dai generated by the vault? - Answered here  What is the amount of Dai expected to be generated against the collateral and what is the timeline? Is there a commitment on a minimum amount of Dai to be generated? - Answered here  What are the strategic benefits for MakerDAO in onboarding the collateral? - Answered here   Legal Questions  What are the legal risks associated with the tokens? - Answered here  (Optional) Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? - Answered here  (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. - See Indenture Trustee post  (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. - See update on Trust Indenture Agreement post  Is issuance of the asset decentralized (trustless) or centralized (trusted)? If centralized/trusted: by which legal entity, type of entity and jurisdiction? - See Indenture Trustee post   Technical Questions  Link any available audits of the project. Both procedural and smart contract focused audits. - see Tinlake smart contract audits  Has the token (and/or supporting protocol) been formally verified? - No. That said, four RWA vaults with DROP / TIN tokens exist on Maker today Does the asset follow a token standard? (E.g. ERC20, ERC721, ERC1400) - ERC20 Is the asset, or asset balances, controlled by a central actor, or group of actors (e.g. through a multisig, or DAO)? - No Does the token have whitelist or blacklist functions? If so, what is the process for utilization and what stakeholders are involved? - Yes, see Centrifuge documentation on DROP / TIN tokens  Can the token implementation be upgraded/changed? If so, what is the process and what stakeholders are involved? - No Does the token contain rebasing logic? - No  The following questions apply to RWA collateral onboarding applications only:  Provide (a) proposed legal structure for transaction, including: type of legal entities, (offshore/onshore, form (trust, corporate, other)) and jurisdiction(s) of legal entities, and (b) likely funds flow (DAI => Fiat => DAI). - Answered here  Provide details on the organizational structure of the interested party, beneficial ownership, governance/control, key personnel, capital/funding resources and past financial performance. - Answered here  Provide detailed summary of the proposed economic terms of the transaction, including, without limitation: commitment term, principal amount, interest rate, frequency of principal and interest payments, disbursement schedule, equity amount, funding ratios (equity/debt pro rata, equity first, etc.), collateral security, coverage ratios, currency (if not DAI) and other material terms. The quality of the proposed economic terms will be a consideration for the prioritization process. - Answered here  Identify in reasonable detail the risks associated with this collateral application and the underlying asset(s) and proposed mitigants (if any). The risk summary should address, without limitation and to the extent relevant: market risks, commercial risks (e.g., diversification, credit, etc.), interest rate risks, legal and regulatory risks, general industry risks, competition, etc. - Answered here  Outline the applicant’s underwriting guidelines/policies, origination strategy (marketing, sales, channels), servicing strategy (charge-offs, collections), and historical asset performance. - Answered here  Outline the applicant’s risk monitoring and operations guidelines/policies (e.g., charge-offs, collection, recovery provisions, data collection and technology, etc). - Answered here  Describe the regulatory regime applicable to the underlying asset (if any) and the applicant’s legal and compliance program relating thereto. - Answered here  Identify any 3rd party persons likely to be relied upon by applicant to implement the transaction (legal, accounting, servicers, trustees, etc.). - Answered here    Summary of Terms [15] - [ # ] refers to questions from the MIP6c2 application template)    Counterparty: BlockTower Credit  Real World Asset(s): Super-senior, asset-backed credit secured by diversified pools of short duration, real-world loans and credit receivables  Initial Debt Ceiling: $150MM  Minimum BlockTower Junior Capital Position: 30% junior capital (TIN) on every exposure  12-month goal: Demonstrate exemplary performance, scale responsibly, and play a critical role in raising the bar for Maker through RWA arranger efforts and governance participation  Yield Benchmarks: SOFR (currently 1.53%) or like-term U.S. Treasuries (5-year UST currently ~2.715%)  Stability Fee: 4% - Fixed   Executive Summary [2]  BlockTower Credit is requesting a $150MM DAI facility at a 4% stability fee to fund senior secured, real-world credit assets. As an institutional structured credit investment fund within one of crypto’s most prominent asset management firms, we are committed to improving Real World Asset (RWA) DeFi and proving the merits of blockchain to the world. Furthermore, we are uniquely situated to partner with Maker as an “arranger” given our structural alignment with the protocol (BlockTower is a large MKR holder and active Maker governance member) and on each deal we facilitate (BlockTower stakes significant first-loss, junior capital on every deal). We believe there is room for many well capitalized entities with significant alignment of interest with Maker (which we effectuate through BlockTower’s junior capital, token ownership, and governance involvement) to become more active and generate value for the Maker community. We believe Maker’s long term interests are best served through a diversified set of high-quality arrangers, credit exposures, and other partners - we look forward to helping Maker raise the bar. You can read more about BlockTower Credit and our firm in our previous Maker forum introductory post.  BlockTower Credit (Asset Manager) [1, 4, 30]  BlockTower Credit (“BT”) is an institutional investment fund, applying the skills of professional underwriting, structuring and investing at the intersection of real-world credit (a massive but anachronistic traditional industry) and crypto. BlockTower Credit is the credit franchise of BlockTower Capital, an SEC-registered digital asset and blockchain investment firm founded in 2017 by Ari Paul (CIO) and Matthew Goetz (CEO). The firm manages well over half a billion dollars and draws on decades of combined experience across professional investing and trading, early-stage venture capital, and credit. A more detailed firm overview can be found here. BlockTower Credit manages a traditional asset-backed private credit strategy that primarily finances fintech and non-bank originators via senior secured debt facilities. The assets in our core credit portfolio are securitized through DeFi, proving DeFi’s potential to transform the traditional credit markets and bridging real-world assets into the digital realm. We as a team, and BlockTower as a firm, are committed to ushering in this future and working with long-term partners to make it the world-changing reality it promises to be. This includes partners like Centrifuge, a protocol BlockTower has invested in, and the Maker community where we are long-time believers, large MKR token holders, and active governance participants (particularly where our expertise can be additive and useful to the community and its goals). Drawing on our significant experience investing across the public and private structured credit and whole loan markets, as well as our operational experience running early-stage fintech lenders, we have a competitive advantage in sourcing, underwriting, and investing in real-world credit assets. Cheap bank and insurance capital is generally unavailable in this market segment, leading to attractive risk-adjusted yields for professionals who can execute on these types of opportunities. The underlying credit assets are also generally shorter duration in nature (<2-3 years), an ideal investment profile for Maker’s current stage of safe and scalable deployment into RWA. BlockTower Credit is led by seasoned credit investment professionals with experience running trading desks and credit strategies at leading institutions like Citigroup, Hildene Capital Management, Goldman Sachs, Capchase, and Axonic. BlockTower, the firm, also brings the support of ~30 professionals across investment, risk management, operations, legal and compliance, data science, and software development functions (and we’re hiring - reach out if you’re interested)! Biographies of BlockTower Credit’s principals: Ari Paul, Principal, Chief Investment Officer Ari Paul co-founded BlockTower Capital in 2017 and began his career in the financial services industry in 2006. From 2006 to 2010, Ari was a portfolio manager and derivatives market maker with Susquehanna International Group, and then a proprietary trader until 2013. From 2013 to 2017, Ari served as portfolio manager and risk manager for The University of Chicago’s $8 billion endowment where he also managed a “tail-hedging” strategy via long volatility investments. In his role, Ari also worked with the chief risk officer in risk management and analytics and performed research on the characteristics of endowment investments and asset classes, including researching cryptocurrency. Ari has been investing across the cryptocurrency and blockchain space since 2014. He brings experience as a professional trader, portfolio manager, risk manager, and institutional allocator to the digital asset industry. Ari earned a B.A. in political science from the University of Pennsylvania, and an M.B.A. from The University of Chicago’s Booth School of Business. He is a CFA charter holder. Matthew Goetz, Principal, Chief Executive Officer Matthew Goetz co-founded BlockTower Capital in 2017, and prior to that, had been involved in the financial services industry since 2006. From 2006 to 2017, Matthew worked at Goldman Sachs, most recently as vice president within Goldman Sachs Asset Management (“GSAM”) in New York, a leading global multi-asset class and research-driven institutional investment management organization. During his tenure, Matthew served across functions including operations, strategy, product development, client services, sales, trading, investing, and recruiting. Earlier in his career, Matthew was an engineer at Sargent & Lundy, where he focused on multi-disciplinary power generation projects across structural, mechanical, and electrical engineering in the energy sector. He currently serves on the Advisory Board for the University of Illinois Department of Industrial & Enterprise Systems Engineering. Matthew began his cryptocurrency research in 2012 and began personally investing in 2014. Matthew brings professional experience as an operator of institutional asset management strategies and businesses to the digital asset investment industry. Matthew earned a B.S. in systems engineering from the University of Illinois at Urbana-Champaign, and an M.B.A. from New York University’s Stern School of Business. Kevin Miao, Principal, Head of Credit Kevin Miao is Head of Credit at BlockTower Capital, with primary portfolio management responsibilities for BlockTower Credit. From 2014 through the beginning of 2021, Kevin worked at Citigroup, most recently as a vice president in the structured credit trading division. Kevin led a trading desk that primarily covered (i) non-mortgage asset backed securities and whole loans ranging from conventional (e.g., automobiles, credit card receives, student loans) to esoteric (e.g., railcar, whole business, marketplace lending); (ii) legacy ABS CDOs, SIVs, and RMBS CDS; and (iii) commercial real estate CLOs, managing a ~$2bn combined book across all asset classes. Following his time at Citigroup, Kevin became Director of Operations at Capchase, a Series A fintech company that lends to SaaS and other recurring revenue companies. At Capchase, Kevin was primarily responsible for the development, refinement, and automation of the core underwriting and risk management processes. In addition, Kevin supported capital markets efforts including credit facility negotiations and transaction reporting. Kevin earned a B.A. in economics with a minor in mathematics from Bowdoin College. More recently, Kevin was pursuing his M.B.A. at Harvard Business School until withdrawing to lead BlockTower Credit. Jack Carlisle, Principal, Director of Credit Jack Carlisle is Director of Credit at BlockTower Capital. From 2016 through the beginning of 2022, Jack worked at Hildene Capital Management, most recently as a Senior Investment Analyst. At Hildene, Jack covered primary and secondary trading for the firm’s positions in asset backed securities, legacy collateralized debt obligations, and agency commercial mortgage-backed securities. In addition to trading functions, Jack led the firm’s sourcing initiatives for non-bank lending products, facilitating forward flow agreements with non-qualified mortgage, residential transition lending, and marketplace lending originators. Jack earned a B.A. in philosophy and history (magna cum laude) from Colgate University.  Investment Process [33]  BlockTower’s approach to structured credit investing is honed through our collective experience investing, and managing investment teams, in private and public securitized credit opportunities at the highest professional levels. Our end-to-end process is focused on responsible investing and risk mitigation at every step, resulting in a rigorous and systematic investment approach that can be broken into four key components on a deal-by-deal basis: Sector Analysis to identify attractive investment opportunities, including broad analysis of the expected performance, liquidity, and correlation of the assets and originators to macroeconomic factors, including interest rates, unemployment, sector specific trends, and other economic indicators. Sourcing & Origination to generate a robust top-of-funnel deal flow through our ecosystem of partnerships and unique position as leading a digital asset investment firm partnering with tech-enabled originators. These partnerships are augmented by BlockTower’s broad relationships across both traditional and digital finance, community activity, media presence, and systematic outbound strategy, targeting originators generating assets with attractive risk and reward characteristics. Underwriting & Due Diligence to accurately project loan unit economics, expected performance, recovery value of the underlying secured asset (if applicable), financial position and viability of the originator itself, and other factors to analyze various stressed scenarios and price risk. This includes meetings with management, engaging third party experts for valuation and compliance reviews, background checks, which ultimately result in the negotiation and execution of a term sheet. Structuring, Executing & Monitoring to create appropriate legal documentation, perfect security of our collateral interest, institute meaningful financial and eligibility covenants, establish exclusivity terms, and identify backup servicing solutions and other service providers to manage distressed situations and maximize recovery. Once a transaction is consummated, covenant testing and collateral performance is monitored on an ongoing basis, with proactive management to arrest funding at the earliest stages of distress. Each deal will be surfaced to BlockTower’s investment committee, which considers input from BlockTower’s internal and external legal, compliance, operations, and finance divisions to provide a final go or no-go investment decision. BlockTower’s credit portfolio will be constructed with an eye towards limiting exposure and concentration in any specific originator or underlying asset, maximizing diversification and lowering the volatility of returns to the extent possible. New investments will not be made in a vacuum, but instead with consideration to the impact on the holistic construction of the portfolio. Additionally, new investments are generally evaluated against other sectors and historical valuation and performance benchmarks.  Transaction Legal Structure [10, 11, 17, 18, 29, 35]  Transactions will follow known legal structures that the Maker community has already deployed or audited. Centrifuge, our partner, has already laid the legal groundwork necessary to conduct on-chain securitization (see Centrifuge update with LTS CU, Indenture Trustee post, and progress update on legal structures for Centrifuge RWA vaults for examples). Furthermore, we will be adding assurances and including the best practices set forth by Huntingdon Valley Bank (click here for HVBank’s MIP 6 proposal). We have and will continue to engage counsel and Maker Core Units to ensure that proper legal structures are in place to align incentives, protect interests, and ensure regulatory compliance. At a high-level, the legal structure for transactions will involve:  SPV - a bankruptcy-remote entity that debt assets will be purchased into. SPVs enable owners, debt holders or interested parties of the entity to be unaffected by the parent entity’s financial, operational and/or legal health. Trustee - a regulated financial institution, like WSFS Bank, where the SPV enters into an Indenture. The Trustee will administer the SPV and act on the behalf of DROP/TIN token holders, including Maker and BlockTower. Furthermore, the Trustee will either engage with or play the role of a “Verification Agent” to ensure assets submitted into the SPV comply with pre-defined parameters agreed upon by the Maker community through a vote. The Trustee should be regulated, well capitalized, and carry insurance. Paying Agent - a regulated broker-dealer who can securely exchange Dai for USD and vice-versa based on pre-agreed upon terms on behalf of the Trustee  For illustrative purposes, we’ve created a high-level transaction flow overview below:  1600×358 85 KB   Transaction Financial Structure [6, 7, 14, 31]  We believe our proposed terms, inclusive of our junior equity commitments to protect Maker’s principal and align our interests, are very differentiated from prior proposals. With this in mind, BlockTower has solicited feedback from the community, delegates, and MKR holders to arrive at the following arranger proposal. Underlying Asset: BlockTower will arrange a diversified portfolio of DROP tokens, representing super-senior tranches of BlockTower’s core investments in senior-secured, asset-backed facilities to fintech or other non-bank lenders. These assets will be delivered to Maker in tokenized form via the currently operational and tested MIP21/22 protocols. The revolving facilities will be between 18-36 months in duration, with the underlying assets generally 1 month to 3 years in duration. Maker RWF has been provided our current deal pipeline for review (subject to NDA); these assets generally include invoice financing, trade finance, or other short term receivables (like those discussed here). For certain assets, BlockTower may directly purchase loans via forward flow agreements that we believe lead to more sustainable, better risk-adjusted returns. Overall, we believe these assets fit the right duration profile and, given BlockTower’s active management of the portfolio and the diversified nature of the underlying collateral, provide significant structural enhancements to Maker’s super-senior risk position. Principal Amount: We are looking for an initial commitment of $150MM DAI. We believe this commitment, if agreed upon by the Maker community, reflects our position as long-term partners to the Maker ecosystem. Over time, we are prepared and hopeful to scale this alongside Maker’s continued growth, provided there is continued interest from the Maker community and BlockTower Credit continues to deliver superb performance. In addition, we have already been asked by others if we have the capacity and desire to arrange portfolios of particular credits on behalf of Maker (e.g., direct clean money vision, short term treasuries, etc). We have significant investment experience across a wide range of credit assets and strategies, and we are open to direction from Maker to spin up separate pools going forward. Interest Rate / Stability Fee: BlockTower Credit is proposing a 4% fixed stability fee. Eligibility Criteria for Maker: Eligible DROP tokens for Maker financing will be required to fit a defined box (which we will codify through both off-chain legal documentation and on-chain via Centrifuge). BlockTower will enter into this, and all agreements with Maker, representing that the information provided by our borrowers has been verified to the best of our ability. In addition, we expect these terms to be further refined through Maker RWF CU’s, and the community’s, review of the contained materials.  Investment Process and Due Diligence:  Contingent on BlockTower investment committee approval of investment, as well as successful internal and external due diligence, in accordance with our process documented in the “Investment Process” section of this MIP  Minimum Junior Capital Threshold:  30% junior, subordinated BlockTower capital in every investment (effectuated through minimum TIN ratio of 30% on Centrifuge). This means that, for every dollar of exposure, BlockTower commits to absorbing the first 30c of loss on the underlying asset exposure  Isolation of Assets:  Subject to the Centrifuge Indenture Trust structure, the underlying assets will be purchased into a bankruptcy remote SPV, isolating the assets from originator and other possible intercreditors  Maximum Duration:  36 month revolving facility commitment, with self-liquidation through the amortization of the underlying short-duration credit assets  Payment of Maker Fees:  BlockTower Credit commits to paying fees, within reason, associated with the transaction on behalf of Maker  Active Management:  BlockTower commits to active management of the underlying assets and holistic portfolio, including ongoing transaction monitoring and reporting to the Maker community (subject to compliance with NDA and MNPI regulation)  Risks & Mitigants [12, 13, 16, 32, 34]  To reiterate from our introductory post, we believe the strongest mitigant of all is a structural alignment of interest through at-risk, first-loss capital that serves as credit enhancement to Maker’s senior position. This structure, as enforced automatically and directly on-chain through Tinlake, means that BlockTower will bear any losses until such a point when defaults breach both BlockTower’s capital and, if applicable, the originator’s equity position. This idea is akin to risk retention in traditional securitization markets, where an arranger’s capital is placed in a first-loss position to incentivize the arranger (BlockTower) to generate strong performing credits. This enhances Maker RWA scalability and security by leaving day-to-day risk management decisions to BlockTower, while Maker’s rights to the cash flows (and underlying assets) are encoded and enforceable by the DROP subscription agreement and smart contracts. Practically, this means that BlockTower would operate akin to a “Portfolio Manager” vs. “Originator” of loans for Maker. This is ideal because unlike originators, who generate the bulk of their economics outside of the SPV that Maker has recourse to (i.e., origination fees, servicing fees, broker fees, etc), BlockTower’s economics are driven by the performance of assets in the SPV. This means that, unlike an originator, we have every incentive to wind down poorly performing facilities early (whereas an originator has an incentive to continue selling assets into the SPV without consistent, enforceable monitoring by the lending party). Even more importantly, BlockTower is not a “transactional broker.” On every asset that Maker finances, BlockTower will have significant skin in the game by providing subordinated, junior capital that provides credit enhancement to Maker’s senior position. We do not make money by selling loans, without any residual exposure, into Maker’s treasury. We make money the old-fashioned way: by picking great assets, structuring responsible deals, and taking the vast majority of the risk ourselves. We don’t succeed unless Maker is also succeeding. Additional risk factors and BlockTower’s approach to mitigating them as follows:     Concern Description Blocktower Approach     Perfection of Collateral Ensuring that assets in the SPV are unencumbered and DROP/TIN token holders can enforce their legal claim on those assets BT will file UCC-1/3 (or relevant filing) per the BT <> Originator loan agreement, with DROP/TIN subscription docs clearly effectuating claim on the underlying assets and cashflows   Servicing Assets Ensuring that cash makes it from end borrower <> SPV (USD to USD) and SPV <> Maker (USD to DAI) We will employ the approach proposed by Centrifuge and RWAC/HVB; likely using Genesis (and/or others) as the transfer agent for DAI <> fiat <> DAI   Protecting Maker’s Interests as a Tokenholder Making sure that an arm’s length party will ensure Maker’s interests (as DROP note holder) are protected Indenture Trust (WSFS Bank in existing deals) as a trustee operating for the benefit of DROP/TIN holders. We will also follow prior Maker best practices with an independent verification agent to ensure Maker finances only eligible DROP assets   Transparency (Oracle) Consistent monitoring of asset performance; necessary to ensure that facilities are performing as expected given limited pricing transparency in secondary debt markets We will monitor asset performance on a daily, weekly, and monthly basis. We’ve made significant investments to build technology around this process [example asset report available upon request]   Principal Preservation/Asset Liquidation If performance suffers, there needs to be a reliable liquidation mechanism to protect Maker’s DROP position As the junior position on every deal we bring to MKR, our economic decisions are driven by asset performance and ultimate recovery. BT will monitor collateral performance daily and will trigger an event of default, acceleration, and/or liquidation if performance suffers.   Technical Integration Some integrations (i.e. RWA D3M) will take significantly longer than anyone expects. This involves both technical integrations w/ Transfer or Exchange agents (i.e. Genesis), platforms like Centrifuge, or directly with a RWA arranger Beyond using Centrifuge’s existing rails, BlockTower has significant institutional knowledge within DeFi and substantial technical resources at its disposal. We consider the latter resources for the MKR technical community, should they want it    Based on prior RWA discourse, we believe these risks are the most relevant for the Maker community. In the interest of decluttering the post, BlockTower Credit has compiled an exhaustive list of risk disclaimers beyond this. Please reach out directly if you’re interested in receiving it.  Partners [36]  A few key partners are necessary to properly execute the transactions we envision. We have already engaged several key players, many of whom have extensive experience working with the Maker ecosystem, namely:  Centrifuge provides a scalable and secure technology platform to properly securitize assets on-chain. Centrifuge Tinlake has already brought over $25M in assets to Maker through existing RWA vaults. In addition to leveraging Centrifuge’s deep technical expertise, we will also be extending much of the legal framework that the team has built around DROP and TIN tokens. Additional details, including structural and technical considerations associated with Centrifuge’s platform, can be found on our prior introductory Maker forum post (found here). WSFS Bank is our preferred partner in establishing the trust structure and providing the necessary banking services. WSFS has been referenced in previous MIPs as a key partner in TradFi that has experience working on behalf of Maker. Furthermore, through prior discussions with WSFS, we are confident that we may leverage existing structures and processes from previous Maker transactions for future deals. A broker / dealer, otherwise known as a paying agent, is necessary to convert between Dai used primarily within Maker’s ecosystem and Centrifuge Tinlake and fiat USD used primarily in real-world asset financing. Such a paying agent will likely be a regulated, reliable, and scalable partner like Genesis. A third-party verification agent may be required to enforce pre-agreed upon parameters with the Maker community in the trust structure. These pre-agreed upon parameters may include investment terms, payment schedules, etc. If such an external agent is required, we will work with both the Maker community and WSFS to identify ideal candidates to play this role. Legal counsel will be called upon for proper entity establishment, agreement execution, and general legal structuring. BlockTower Credit has both our own in-house counsel, and partners with Reed Smith LLP as our external counsel with access to several other law firms within the Am Law 200, including Sidley Austin LLP and Lowenstein Sandler LLP. This network ensures that we will have sufficient legal expertise in executing the proposal.  In addition to the third-parties noted above, we have also spent considerable time discussing our proposal and gathering feedback from relevant Maker Core Units including the Real-World Finance (RWF), Legal & Transactional Services (LTS), and Protocol Engineering (PE).  Final Words If our proposal is greenlit and successful after soliciting feedback, we look forward to engaging with the core units, delegates, token holders, and the rest of the Maker community to initiate an on-chain, senior-secured arranger model. We also recognize that, as we get the community feedback we hope to receive, this writeup will be a living document subject to revision, iteration, and eventual improvement. We’re eager to continue working with the community and, as always, please let us know if there’s anything that our team at BlockTower can do to illuminate or make clear any of the elements of this proposal or our firm. We’ve also kept the content here quite dry, but we have ambitious goals to help DeFi reach its potential. We are always happy to go down that rabbit hole; reach out to us at [email protected] to chat whenever. Thank you all for your time, BlockTower Credit cc: @BlockTower @JackintheBlox @blockdataguy @makeybakey @Real-World-Finance @christiancdpetersen @rune DISCLAIMER: Any projections or forecasts contained in this document are speculative in nature, as matters they describe are subject to known (and unknown) risks, uncertainties and other unpredictable factors. Investing in newer and smaller asset classes such as cryptocurrencies is speculative, risky and unsuitable for some investors even when representing only a portion of a broader investment program. The graphs, charts and other visual aids are provided for informational purposes only. No representation is made that these will assist any person in making investment decisions and no graph, chart or other visual aid can capture all factors and variables required in making such decisions. Certain links, too, are provided as a convenience and do not imply the Adviser’s sponsorship or approval of any third-party websites or their content. ",
                    "links": [
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.4v9n8u2mmffc",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.lvj0xar9p8at",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.4v9n8u2mmffc",
                        "https://github.com/centrifuge/tinlake",
                        "https://github.com/centrifuge/tinlake-maker-lib",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.jhuiz4gz1j2s",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.jhuiz4gz1j2s",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.nzt95kpxn940",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.nzt95kpxn940",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.bnuwp1gcllcj",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.bnuwp1gcllcj",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.jhuiz4gz1j2s",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.xaxj7c26svkt",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.bnuwp1gcllcj",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.nzt95kpxn940",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.nzt95kpxn940",
                        "https://forum.makerdao.com/t/what-is-a-trust-indenture-what-is-an-indenture-trustee/14697",
                        "https://forum.makerdao.com/t/centrifuge-update-cornerstone-agreement-complete-to-onboard-rwas-to-maker-with-centrifuge-successful-collaboration-with-incubating-lts/15005",
                        "https://forum.makerdao.com/t/what-is-a-trust-indenture-what-is-an-indenture-trustee/14697",
                        "https://github.com/centrifuge/security/tree/master/audits",
                        "https://github.com/centrifuge/security/tree/master/audits",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.nzt95kpxn940",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.4v9n8u2mmffc",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.jhuiz4gz1j2s",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.bnuwp1gcllcj",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.zh3nv2dal1dw",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.bnuwp1gcllcj",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.nzt95kpxn940",
                        "https://docs.google.com/document/d/1WlI7Vf-_xslSh01pYjl0iyOcQpu1moncKWuC4uCcJQ0/edit#heading=h.w5dqwyl038sx",
                        "https://github.com/makerdao/mips/blob/master/MIP6/MIP6c2-Collateral-Application-Template.md",
                        "https://forum.makerdao.com/t/blocktower-credit-introduction-arranger-proposal/16535",
                        "https://www.blocktower.com/about",
                        "https://twitter.com/AriDavidPaul?s=20&t=tW_SzPF_m0TZ49E9AjIM0Q",
                        "https://twitter.com/matthewgoetz?s=20&t=gdfrIkjYX8g33BzU0QHcnw",
                        "https://drive.google.com/file/d/1FCELDKFBYs21pijhXuss2IRzCN4RPjWr/view?usp=sharing",
                        "https://finance.yahoo.com/news/centrifuge-blocktower-announce-3-million-140000412.html",
                        "https://forum.makerdao.com/t/centrifuge-update-cornerstone-agreement-complete-to-onboard-rwas-to-maker-with-centrifuge-successful-collaboration-with-incubating-lts/15005",
                        "https://forum.makerdao.com/t/what-is-a-trust-indenture-what-is-an-indenture-trustee/14697",
                        "https://forum.makerdao.com/t/progress-update-on-the-legal-structure-for-centrifuge-rwa-vaults/13307/2",
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219",
                        "https://mips.makerdao.com/mips/details/MIP21",
                        "https://mips.makerdao.com/mips/details/MIP22",
                        "https://forum.makerdao.com/t/cryptocurrencies-and-credit-cards/16737/25",
                        "https://forum.makerdao.com/t/blocktower-credit-introduction-arranger-proposal/16535",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/18",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-47-blocktower-credit-arranger-ama/17128",
                        "https://forum.makerdao.com/t/blocktower-credit-commercial-and-legal-risk-assessment-part-i/18790",
                        "https://forum.makerdao.com/t/ari-paul-blocktower-maker/18787",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/31",
                        "https://forum.makerdao.com/t/introduccion-y-propuesta-del-grupo-de-spring-traduccion/18512",
                        "https://forum.makerdao.com/t/spring-cluster-introduction-and-proposal/18398/3",
                        "https://forum.makerdao.com/t/spring-cluster-introduction-and-proposal/18398",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/30",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/137",
                        "https://forum.makerdao.com/t/blockchain-columbia-delegate-platform/15202/22",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/3",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191/23",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-22-de-agosto-del-2022/17413",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/111",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-47-blocktower-credit-arranger-ama/17128/2",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/15",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/41",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-15-de-agosto-del-2022/17293",
                        "https://forum.makerdao.com/t/prospective-rwf-0x-july-2022-monthly-report/17003",
                        "https://forum.makerdao.com/t/blocktower-credit-monthly-report-12-21-2022-01-31-2023/19614",
                        "https://forum.makerdao.com/t/blocktower-credit-monthly-report-2-1-2023-2-28-2023/20006",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/8",
                        "https://forum.makerdao.com/t/pvl-delegate-platform/16022/42",
                        "https://forum.makerdao.com/t/mip6-blocktower-credit-transaction-documents/19019",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191/33",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/29",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/111",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/23",
                        "https://forum.makerdao.com/t/blocktower-credit-commercial-and-legal-risk-assessment-part-i/18790/8",
                        "https://forum.makerdao.com/t/blocktower-credit-ces-domain-team-assessment/18817"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.570211496766065
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zmtong",
                    "index": "#2",
                    "likes": "3",
                    "time": "29/07/2022-15:42:07",
                    "content": "Thanks for posting your application. As a first step, it is important to take a look at Quick Start Guide - Collateral Onboarding. As part of that, your application needs to reflect the latest application template (link: mips/MIP6c2-Collateral-Application-Template.md at master · makerdao/mips · GitHub). Second, it’s best if you do a self assessment to ensure your application clearly meets the collateral guidelines for structured finance transactions (Link: https://mips.makerdao.com/mips/details/MIP67). Please update this forum post at your earliest convenience. If you need any assistance, feel free to reach out to @Real-World-Finance  team for additional guidance. ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP6/MIP6c2-Collateral-Application-Template.md",
                        "https://mips.makerdao.com/mips/details/MIP67"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.768518518518518
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blockdataguy",
                    "index": "#3",
                    "likes": "4",
                    "time": "30/07/2022-00:49:03",
                    "content": "Hi @zmtong thank you for your review and interest! We’ve updated the forum post with references to questions from the MIP6c2 application template (see numbers in bracket’s - [#]). For easy navigation and completeness, we also added all MIP6c2 questions with hyperlinks to the relevant sections and information in the following publicly accessible Google Doc version of the MIP6 post. We hope you and others find it helpful! Also, we’re keenly aware of MIP67, and will continue to assess our work against these guidelines. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.552083333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "3",
                    "time": "03/08/2022-14:34:35",
                    "content": "    humancapitol:  What type of asset is it? (e.g. store of value, currency, commodity, capital asset, governance token etc.)   First that you for providing this MIP6 Arranger application and focusing your energy on providing as many details as possible to the Maker Community. I urge All @Recognized-Delegates to take a good look at this application that includes Senior Secured lending via Centrifuge’s Drop Token model. In the “type of asset” explanation your team mentions, “revolving facilities will be between 18-36 months in duration, with the underlying assets generally 1 month to 3 years in duration.” Does this also mean that you will also put money to work in short-term paper(T-bills), or is a 1-month to 12-month duration loan related to Trade financing for short to medium-term working capital?     humancapitol:  Minimum BlockTower Junior Capital Position: 30% junior capital (TIN) on every exposure   Does this debenture contain operating covenants, and how will BT monitor coverage ratios and cash flow from operations? If you can provide more colour on how you manage/monitor asset performance and transparency that would be splendid. Thanks in advance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.236742424242424
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#5",
                    "likes": "2",
                    "time": "03/08/2022-17:14:50",
                    "content": "The chart of concerns in BT’s MIP6 is underrated.     flipflopflapdelegate:  more colour on how you manage/monitor asset performance and transparency that would be splendid.   Agreed, would love to see if that transparency could be permissionless ( or at least low friction)? The tin/drop pools have a dashboard, maybe a simple Dune query would work? For the obsessives. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "3",
                    "time": "03/08/2022-17:30:14",
                    "content": "    twblack88:  The tin/drop pools have a dashboard, maybe a simple Dune query would work?   Just found this announcement–hot off the press:   Centrifuge Governance Forum – 3 Aug 22    Centrifuge Insights – An analytics dashboard for the Centrifuge ecosystem 🌀 Introducing Centrifuge Insights 🌀  Hi folks, we are EMBRIO.tech and we are happy to announce our close involvement and active contribution to the development of Centrifuge Insights: a comprehensive open-source analytics dashboard visualising the...  Reading time: 1 mins 🕑 Likes: 9 ❤       ",
                    "links": [
                        "https://gov.centrifuge.io/t/centrifuge-insights-an-analytics-dashboard-for-the-centrifuge-ecosystem/4429"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.111111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/humancapitol",
                    "index": "#7",
                    "likes": "5",
                    "time": "04/08/2022-16:17:30",
                    "content": "Hi! Apologies for the delayed response here: The underlying assets are very short (not T-bills but absolutely could be something like trade financing, at a conservative advance rate and secured by assets). That would be the 1mo-3yr duration. The nature of our commitment, however, would be to purchase these assets on a go-forward basis (subject to good performance, which we monitor weekly) over an 18-36mo commitment. These commitments give us the flexibility to wind down our exposure much earlier if the assets are not performing, while simultaneously allowing us to scale the investment if performance remains strong (leading to more scalability for Maker vs. constantly going out and sourcing new pools of assets). Our financing agreement absolutely contains operating covenants (which we define with the originator we finance, according to very strict parameters that we design to protect our principal). This is between BlockTower, actively managing the portfolio of assets, and the originator we finance. The 30% junior capital (TIN), however, will be codified through the Centrifuge contract. We created this writeup to explain how this works, but effectively the Tinlake platform will never allow our capital to drop below 30% junior capital (the minimum subordination percentage). And you saw the update on Centrifuge Insights! But we will also be providing ongoing performance reporting + commentary to the community separately in the forums (to the extent not sufficiently covered in Centrifuge Insights). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.951479076479076
                },
                {
                    "author_link": "https://forum.makerdao.com/u/humancapitol",
                    "index": "#8",
                    "likes": "3",
                    "time": "04/08/2022-16:23:09",
                    "content": "Hi! Thank you for the comment and question. As @flipflopflapdelegate kindly brought up, Centrifuge Insights will be a product that should bring a lot of transparency in permissionless/low friction fashion. That being said, we intend to provide full commentary + performance updates directly on the forum as well! In many cases, as active managers of these portfolios, we can provide qualitative context that gives the community a deeper understanding of the numbers ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.441666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#9",
                    "likes": "3",
                    "time": "04/08/2022-18:59:43",
                    "content": "Someone else just sent this across. Looks great. Something we could certainly learn from. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.535714285714286
                }
            ]
        }
    ],
    "group_index": "1492"
}