{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip29-modulo-de-estabilizacion-de-la-paridad/5110",
            "title": "MIP29: M\\xc3\\xb3dulo de Estabilizaci\\xc3\\xb3n de la Paridad ",
            "index": 5110,
            "category": [
                "Latin America"
            ],
            "tags": [
                "mips",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "3",
                    "time": "12/11/2020-16:33:33",
                    "content": "MIP29: Módulo de Estabilización de la Paridad Preámbulo MIP#: 29 Título: Módulo de Estabilización de la Paridad Autor(es): Sam MacPherson (@hexonaut) Colaboradores: Ninguno Tipo: Técnica Estado: Petición de Comentarios (RFC, Request For Comments) Fecha de Propuesta: 2020-11-09 Fecha de Ratificación: <yyyy-mm-dd> Dependencias: n/a Reemplaza: n/a Licencia: AGPL3+   Referencias  La implementación dss-psm 2 propuesta Discusión pre-MIP 4  Resumen Abreviado Esta propuesta proporciona la implementación de un contrato inteligente del Módulo de Estabilización de la Paridad. Resumen Extendido El PSM (Peg Stabilization Module, Módulo de Estabilización de la Paridad) se ubica entre cualquier adaptador gemJoin y el vat. En lugar de acreditarle gems al proveedor de los tokens, los reúne y saca una posición de deuda con un Ratio de Colateralización del 100% y emite los Dai recién acuñados a la persona que proveyó el colateral. En el sentido inverso, cualquier puede pasar de Dai al token colateral siempre que exista deuda por saldar. Las tarifas opcionales tin y tout también pueden ser activadas, lo que envía una fracción de la operación al vow. Esta implementación está en conformidad con la descripción establecida en la discusión pre-MIP 4. Sumario de Componentes MIP29c1: Definiciones: define Toll In (tin) y Toll Out (tout). MIP29c2: Código Propuesto: contiene un fragmento de la implementación propuesta. MIP29c3: Casos de Prueba: enumera los casos de prueba existentes, incluyendo el test de integración. MIP29c4: Consideraciones de seguridad: hace observaciones sobre la naturaleza limitada de las implicaciones para la seguridad que tiene añadir el PSM. MIP29c5: Verificación formal/información de auditoría: hace observaciones sobre la susceptibilidad del código propuesto a la verificación formal, aunque tanto la especificación formal como auditorías y revisiones del código todavía deben llevarse a cabo. MIP29c6: Licencia: declara la licencia bajo la cual la propuesta y el código han de distribuirse. Motivación Creación de más utilidad de Dai a través de una paridad estable El objetivo número uno del protocolo Maker y de la gobernanza de Maker es mantener la estabilidad de Dai de modo que la gente, los negocios y los protocolos DeFi que se apoyan en Dai puedan estar seguros de que su dinero está protegido de la volatilidad. Cumplir esta promesa impulsará el crecimiento continuo del proyecto. El módulo de Estabilización de la Paridad puede restaurar la paridad y la utilidad de Dai para usuarios de todo el mundo, lo que lo vuelve un cambio a considerar de mucha importancia. Fortalecimiento del portafolios de colaterales mediante el reemplazo de tipos de colateral que no pueden liquidarse El protocolo Maker tiene actualmente muchos Dai generados a partir del tipo de colateral USDC-A, cuyas liquidaciones están desactivadas. Esta no es una situación ideal porque el protocolo Maker no ha sido diseñado para implementar tipos de colateral con sus liquidaciones desactivadas; y puede tener como consecuencia vaults con más deuda que valor colateral que serían abandonados por sus dueños pero que permanecerían en el portafolios de colaterales. Pero desactivar las liquidaciones fue necesario puesto que el sistema de subastas actual no está bien adaptado a la liquidación de activos de bajo riesgo, de modo que se lo hizo como una solución de corto plazo que se reemplazaría más adelante. El Módulo de Estabilización de la Paridad es una solución capaz de reemplazar este tipo de colateral. Le permitiría a la gobernanza de Maker remover tipos de colateral basados en stablecoins en su totalidad del sistema a corto plazo, resolviendo así el problema de las liquidaciones desactivadas y eliminando el riesgo de que el sistema termine teniendo vaults abandonadas y sin liquidar con más deuda que valor colateral. Fomentar la generación natural de Dai a partir de otros tipos de colateral mediante estabilidad y liquidez Una ventaja significativa del Módulo de Estabilización de la Paridad es que ayuda con la estabilidad y la liquidez cuando el precio se alza encima de la paridad. También ayudar a proporcionar liquidez y estabilidad para cuando hay oferta de Dai para vender. Esto significa que ayuda a promover la la creación de vaults y la generación de Dai a partir de otros activos como ETH, porque les da a los usuarios de vaults mucha liquidez confiable para vender sus Dai si buscan extraer moneda fiduciaria de sus vaults. Dicho de manera general, una paridad confiable hace que los poseedores de vaults se sientan más dispuestos a generar Dai. Al contrario, una paridad incierta hace que generar Dai sea más arriesgado puesto que así es menos claro si más tarde será posible retraer la posición nuevamente sin tener que recomprar Dai a un precio diferente de la paridad. Solucionar este problema con el Módulo de Estabilización de la Paridad es una ventaja significativa a corto plazo para devolverle al Protocolo un balance natural. Asimismo continuará siendo una ventaja sustancial a largo plazo. Mejora de modo general la experiencia del usuario y las propuestas de valor que el sistema ofrece a sus usuarios, tanto a los de Dai como a los de vaults. Retracción natural Cuando el Protocolo Maker esté fuera de balance, el Módulo de Estabilización de la Paridad mantendrá la paridad estable mediante la acumulación de cantidades potencialmente grandes de stablecoins como colateral. Puesto que el Módulo de Estabilización de la Paridad promueve la generación natural de Dai, las stablecoins acumuladas dentro del Módulo de Estabilización de la Paridad serán usados por nuevos usuarios de vaults para salir a dinero fiduciario si existe una acumulación significativa (pero esto solo será temporal). Esto significa que el Módulo de Estabilización de la Paridad naturalmente se retrae cuando el sistema regresa a un estado de balance. Por lo tanto, el Módulo de Estabilización de la Paridad no contribuirá a la acumulación a largo plazo de stablecoins como colateral en el sistema. En cambio, actuará contra ello al ayudar al sistema a recuperar el balance rápidamente. En última instancia esto minimiza la cantidad de tiempo que necesita el Protocolo Maker para tener una exposición sustancial a las stablecoins. Convertirse en el punto central de compra-venta para swaps de stablecoins Otra ventaja a largo plazo ofrecida por el Módulo de Estabilización de la Paridad es la capacidad de convertirse en un punto central para la compra-venta de diferentes stablecoins. Si la gobernanza de Maker añade múltiples stablecoins a los Módulos de Estabilización de la Paridad y activa la compra-venta 1:1 con bajas tarifas para cada una de ellas (contra Dai), permitiría la compra-venta de diferentes stablecoins entre sí como un efecto secundario. Como consecuencia, esto  ayudará en última instancia con la liquidez general en el ecosistema DeFi. A la vez, Maker se vería compensado al cobrar el spread del Módulo de Estabilización de la Paridad dos veces por proveer el servicio. La creación de una señal confiable on-chain para ajustes automáticos de la Tasa de Interés de Dai (DSR, Dai Savings Rate) y de la Tasa Base Una característica en los planes para el Protocolo Maker es un sistema para ajustar automáticamente la DSR y la Tasa Base en respuesta a cambios en las dinámicas de mercado de Dai, para mejor mantener la estabilidad a largo plazo de Dai. Esto sería similar a una característica del sistema descrita anteriormente, la conocida como TRFM (Mecanismo de Feedback de la Tasa Objetivo, Target Rate Feedback Mechanism). Puesto que los cambios en las dinámicas del mercado se verán reflejadas instantáneamente en el balance de las stablecoins contra Dai en el Módulo de Estabilización de la Paridad, esto proporcionará una señal confiable on-chain que tal sistema podría usar. El Módulo de Estabilización de la Paridad es un concepto muy poderoso, de modo que no es improbable que haya incluso más ventajas a largo plazo que irán siendo descubiertas por la comunidad una vez el problema inmediato de gestionar la paridad haya sido resuelto. Especificación MIP29c1: Definiciones   Toll In: La fracción de la transacción Gem -> Dai enviada al vow como tarifa. Codificada como tin en unidades wad.  Toll Out: La fracción de la transacción Dai -> Gem enviada al vow como tarifa. Codificada como tin en unidades wad.  MIP29c2: Código propuesto Mira psm.sol 2. La funcionalidad central es simple: function slip(bytes32 ilk, address usr, int256 wad) external note auth {     if (wad >= 0) {         // Incoming         uint256 uwad = uint256(wad);         uint256 fee = mul(uwad, tin) / WAD;         uint256 base = sub(uwad, fee);         vat.slip(ilk, address(this), wad);         vat.frob(ilk, address(this), address(this), address(this), int256(wad), int256(wad));         vat.move(address(this), usr, mul(base, RAY));         vat.move(address(this), vow, mul(fee, RAY));     } else {         // Outgoing         uint256 uwad = uint256(-wad);         uint256 fee = mul(uwad, tout) / WAD;         vat.move(usr, vow, mul(fee, RAY));         vat.frob(ilk, address(this), address(this), usr, -int256(uwad), -int256(uwad));         vat.slip(ilk, address(this), -int256(uwad));     } }   MIP29c3: Casos de prueba Mira psm.t.sol  test_join_fee testFail_join_insufficient_gem test_join_other_exit testFail_join_over_line test_join_no_fee testFail_insufficient_dai_for_outgoing_fee testFail_join_exit_small_fee_insufficient_dai test_join_exit_fees test_join_exit_no_fee testFail_two_users_insufficient_dai test_zero test_join_exit_other_small_fee  MIP29c4: Consideraciones de seguridad La solución propuesta es simple y no invasiva, interactuando solamente con el vat con el gemJoin existente y el sistema urn. MIP29c5: Verificación formal/información de auditoría El contrato propuesto está escrito de manera tal que es susceptible de especificación y de verificación formales, de acuerdo al estilo y las prácticas de los contratos centrales multicolaterales de DAI, aunque no ha sido formalmente especificado. Todavía no han tenido lugar auditorías ni revisiones del código. MIP29c6: Licencia  AGPL3+   Esto es una traducción libre del artículo original en inglés, gracias a @blimpa y @Lozadaluis12 por la traducción. ",
                    "links": [
                        "https://forum.makerdao.com/t/peg-stabilization-modules-a-pre-mip-discussion/3045",
                        "https://forum.makerdao.com/t/peg-stabilization-modules-a-pre-mip-discussion/3045",
                        "https://github.com/BellwoodStudios/dss-psm/blob/master/src/psm.sol",
                        "https://github.com/BellwoodStudios/dss-psm/blob/master/src/psm.t.sol",
                        "https://www.gnu.org/licenses/agpl-3.0.en.html",
                        "https://forum.makerdao.com/t/mip29-peg-stability-module/5071",
                        "https://forum.makerdao.com/t/maker-relay-ep-30-en-espanol/6360",
                        "https://forum.makerdao.com/t/maker-relay-ep-29-en-espanol/6220",
                        "https://forum.makerdao.com/t/maker-relay-ep-28-en-espanol/6124"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.85625
                }
            ]
        }
    ]
}