{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dao-acquisition-competitors/9022",
            "title": "DAO Acquisition / Competitors ",
            "index": 9022,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rafinskipg",
                    "index": "#1",
                    "likes": "4",
                    "time": "29/06/2021-12:32:14",
                    "content": "In the traditional corporate world some companies will acquire other small competitors to gain advantage or position themselves in market niches. How do we translate this to the DAO ecosystem? Some ideas:  Acquiring governance tokens of different protocols  As a speculative treasure positioning As a mean of influencing on the protocol   Acquiring the talent behind the protocol  Ex: Reach protocol founders and fund their work aligning MakerDAO objectives, integrations, etc    This comes to my mind because QI DAO https://app.mai.finance/ is positioning itself as a “Maker on polygon”, and it’s starting to develop a stable currency called MAI and several functionalities similar to Maker. As an example, in this scenario it could be an interesting opportunity for Maker to:  A) Buy QI tokens as a speculative hedge against competition B) Reach the QI DAO team and purchase the project, integrating their teams in the Maker ecosystem. C) Other ideas (?)  This also opens more questions, like, how to do multi-protocol governance, etc. I’m pretty sure this is a bigger topic than this simple paragraph here. Just sharing some ideas, eager to listen to your thoughts. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.158088235294118
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "0",
                    "time": "29/06/2021-12:59:43",
                    "content": "There’s no way to make a tender offer, so it seems difficult to execute ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "1",
                    "time": "29/06/2021-14:14:53",
                    "content": "There are certain protocols that go on and actively “acquire” other protocols. But usually, it’s been more of partnership than acquire in traditional sense. For example, Yearn team announced that they “acquired” projects but in reality, it’s partnership rather than taking over their leadership. There are some cases where protocols might for example, via yield farming, gets large share of the governance token (Yearn and StakeDAO having large Curve (CRV) token). Considering MakerDAO community has been exploring potentially deploying USDC in PSM into DeFi to yield farm, that might be possible scenario. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.317261904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#4",
                    "likes": "4",
                    "time": "29/06/2021-14:16:28",
                    "content": "Also as it’s open sourced, they can simply get “acquired” and then fork away and recreate the protocol so quiet different from traditional corporate world (even if there’s an agreement, how would you enforce it especially if they are anonymous?) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafinskipg",
                    "index": "#5",
                    "likes": "1",
                    "time": "29/06/2021-14:44:32",
                    "content": "In case of being anonymous is complicated. I guess is a relationship of trust, and willingnes from both parties. Or in this case it could be a trustless scenario, for example, acquiring via a vested reward for X yeards, and it requires the approval of a vote to be changed, for example. So a team could collaborate with the DAO in exchange for some rewards, and this collaboration could be monitored by some agents, as another unit of the DAO. This in this area, and about acquiring governance tokens from another DAOs, i think is also really interesting. I think a mix of :  Acquiring governance tokens Approaching the team to stablish partnership and collaboration Create some incentive for a long term collaboration  Edit: I also like Yearns approach and their collaboration with CRV / etc. All that ecosystem is flourishing ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#6",
                    "likes": "3",
                    "time": "29/06/2021-14:52:25",
                    "content": "I think the more interesting way to approach this is to allow them to develop and gain traction (if they’re up to the task), and then extend them a line of credit so that they can grow - similarly to the D3M proposal from Aave. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#7",
                    "likes": "0",
                    "time": "29/06/2021-15:24:51",
                    "content": "Yeah that might be tricky as well. Since we are down the rabbit hole, I think it’s good to review the case of when Tron bought Steemit. There’s a lot of backlash and eventually led a group to fork the project into a project named Hive. I think it’s a case where it shows fully acquiring a project is difficult because you might be able to “buy” leadership but you can’t buy community.    CoinDesk – 17 Mar 20    Steem Community Plans Hostile Hard Fork to Flee Justin Sun's Steemit - CoinDesk The blockchain for bloggers, Steem, is moving to Hive.io, CoinDesk has learned. The hostile hard fork is scheduled for Friday.      ",
                    "links": [
                        "https://www.google.com/amp/s/www.coindesk.com/steem-community-plans-hostile-hard-fork-to-flee-justin-suns-steemit%3Famp=1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.967592592592593
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#8",
                    "likes": "1",
                    "time": "29/06/2021-15:32:11",
                    "content": "This is especially true if it’s competitor buying out. Like imagine, if a stablecoin competitor like Tether somehow decides to buy 51% of Maker, I am pretty sure the community will take actions one way or another. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.416666666666667
                }
            ]
        }
    ]
}