{
    "poll_list": [
        {
            "title": "Inclusion Poll for Parameter Proposal Groups (MIP46) - March 8, 2021",
            "index": "6341",
            "option": "Yes",
            "supporting_mkr": "27,976",
            "highest_fraction": 0.99
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip46-parameter-proposal-groups/6341",
            "title": "MIP46: Parameter Proposal Groups ",
            "index": 6341,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "rates-working-group"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "8",
                    "time": "03/02/2021-17:01:50",
                    "content": "MIP46: Parameter Proposal Groups Preamble MIP#: 46 Title: Parameter Proposal Groups Author(s): @LongForWisdom, Sam MacPherson (@hexonaut) Contributors: @ultraschuppi Type: General Status: Formal Submission Date Proposed: 2021-02-03 Date Ratified: <yyyy-mm-dd> Dependencies: None Replaces: None  References None. Sentence Summary MIP46 proposes the formalization of Parameter Proposal Groups. These groups are tasked with evaluating information produced by contributors and domain teams and using this analysis to produce parameter change proposals for consideration by governance. Paragraph Summary MIP46 proposes the formalization of Parameter Proposal Groups. These groups are tasked with evaluating information produced by contributors and domain teams and using this analysis to produce parameter change proposals for consideration by governance. Parameter Proposal Groups can form organically without a governance vote and are expected to consistently produce parameter adjustment proposals which may be included in the weekly governance cycle by the Governance Facilitator(s). Component Summary MIP46c1: Parameter Proposal Group Requirements Details the requirements for a group to be recognized as a Parameter Proposal Group under this MIP. MIP46c2: Parameter Proposal Requirements Details the requirements that a Parameter Proposal must meet to be valid for inclusion in the Weekly Cycle. MIP46c3: Parameter Proposal Process Details the governance process for parameter proposals created by recognized Parameter Proposal Groups. Motivation Certain parameters in the Maker protocol require frequent adjustment based on changing ecosystem conditions. As the Maker protocol grows in complexity it becomes harder for governance to micro-manage these system parameters. To counteract this growing complexity, an intermediate set of groups is proposed, which will take responsibility for analyzing and evaluating parameter settings in the context of the wider ecosystem. MIP46 proposes a framework for these groups to form in a consistent and transparent way. In order to avoid introducing further governance work, it is proposed that these groups can form organically without requiring a governance vote. Instead, they need only follow certain requirements laid out in this MIP in order to be recognized as a Parameter Proposal Group. In the event that these groups become more widespread, a ratification requirement can be introduced. Specification / Proposal Details MIP46c1: Parameter Proposal Group Requirements Each prospective Parameter Proposal Group must fulfill and maintain a set of requirements in order to be recognized by the Governance Facilitators as a Parameter Proposal Group. Each Parameter Proposal group must announce its creation in the forum and respond to each of the points below. Objectives - The Parameter Proposal Group must lay out what high objective or objectives they are trying to achieve through their proposals. Scope - The Parameter Proposal Group must lay out which parameters they consider ‘in-scope’ for the group. This should be related back to the group’s objective or objectives. Identity - Every new Parameter Proposal Group must take a new number in the PPG-X format where X is an increasing integer starting at 1. Each group may also use a more descriptive or informal name if they wish. Membership - The Parameter Proposal Group must publicize its members. Pseudonymous identities are acceptable but should have displayed activity in the community prior to the group’s formation. It is suggested (but not required) that a Parameter Proposal Group consists of at least three individuals. Consistency - The Parameter Proposal Group must commit to meeting once per month to discuss potential parameter changes. The outcome of this meeting must be communicated via the official forum, even if no parameter changes are proposed. Conflicts of Interest - The Parameter Proposal Group members must publicize any conflicts of interest at the time of group formation, and if further conflicts arise, these should be communicated via the official forum. Conflicts of Interest are not an issue so long as they are properly disclosed. Cooperative - Parameter Proposal Groups are not in competition with each other. All groups are encouraged to share and make public the data they are using. Where multiple Parameter Proposal Groups are covering the same parameters these groups must coordinate timing to give governance a choice of proposals. Reactive - In the event of unforeseen changes to the ecosystem or operation of the Maker Protocol, parameter proposal groups should consider making additional proposals. MIP46c2: Parameter Proposal Requirements Each parameter proposal must fulfill a set of requirements in order to be recognized by the Governance Facilitators as a valid proposal. These requirements are laid out here. Communication - Parameter Proposals must be posted publicly on the Maker Governance forum. Discussion - Parameter Proposals must be presented with enough of a feedback period to give the community time to respond and discuss the proposal. Questions, concerns, or queries must be answered if brought up by the Maker community, and feedback must be considered before finalizing the proposal. Clear and Unambiguous - Parameter Proposals must be clearly formatted and presented. There must be no confusion as to which parameter changes are being proposed, or what the current values of these parameters are. Rationale - Each parameter change must be accompanied by a rationale that explains why the change has been proposed. This rationale must connect to the stated goal of the Parameter Proposal Group. MIP46c3: Parameter Proposal Process Parameter Proposals are first presented on the Maker Governance forum and are then entered into the weekly governance cycle by the Governance Facilitators. Where possible, Parameter Proposals should be made public on the first Monday of the month for inclusion into the weekly cycle in the second week of the month. Sufficient time must be given for discussion, and inclusion in the weekly cycle may be delayed by the Governance Facilitators if they feel more discussion is required. Proposed Parameter Changes will be bundled into a single on-chain poll for inclusion in the weekly cycle, and if the outcome is favorable, will proceed to that week’s executive vote absent unforeseen circumstances. Urgent or emergency proposals from Parameter Proposal Groups should follow the existing guidelines for urgent or emergency proposals. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip55c3-sp5-interim-chief-legal-officer/15981",
                        "https://forum.makerdao.com/t/mid-month-parameter-changes-proposal-ppg-omc-001-2021-10-15/11037/3",
                        "https://forum.makerdao.com/t/mip57-rwa-committee/9304/16",
                        "https://forum.makerdao.com/t/mip57-rwa-committee/9304/8",
                        "https://forum.makerdao.com/t/signal-request-repeal-parameter-changes-proposal-makerdao-open-market-committee-june-28-2021/9242/31",
                        "https://forum.makerdao.com/t/signal-request-shorten-the-ppg-process/8862/17",
                        "https://forum.makerdao.com/t/signal-request-repeal-parameter-changes-proposal-makerdao-open-market-committee-june-28-2021/9242/11",
                        "https://forum.makerdao.com/t/signal-request-repeal-parameter-changes-proposal-makerdao-open-market-committee-june-28-2021/9242",
                        "https://forum.makerdao.com/t/maker-relay-ep-51-en-espanol/9063",
                        "https://forum.makerdao.com/t/maker-relay-ep-51/9011",
                        "https://forum.makerdao.com/t/signal-request-offboard-unprofitable-collateral-types/8628",
                        "https://forum.makerdao.com/t/replaced-signal-request-offboard-unprofitable-collateral-types/8620",
                        "https://forum.makerdao.com/t/fft1-drop-collateral-onboarding-risk-evaluation/8036",
                        "https://forum.makerdao.com/t/htc-drop-collateral-onboarding-risk-evaluation/8001",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-rwa-committee/7893",
                        "https://forum.makerdao.com/t/real-world-assets-report-2021-04/7850",
                        "https://forum.makerdao.com/t/informal-poll-increasing-the-sourcecred-payments/7489/45",
                        "https://forum.makerdao.com/t/informal-poll-increasing-the-sourcecred-payments/7489/41",
                        "https://forum.makerdao.com/t/discussion-activating-mkr-staking-rewards/7480",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355",
                        "https://forum.makerdao.com/t/maker-relay-ep-37-en-espanol/7168",
                        "https://forum.makerdao.com/t/maker-relay-ep-37/7154",
                        "https://forum.makerdao.com/t/weekly-mips-update-30/7083",
                        "https://forum.makerdao.com/t/maker-relay-ep-36-en-espanol/7053",
                        "https://forum.makerdao.com/t/maker-relay-ep-36/7039",
                        "https://forum.makerdao.com/t/weekly-mips-update-29/7000",
                        "https://forum.makerdao.com/t/maker-relay-ep-35-en-espanol/6949",
                        "https://forum.makerdao.com/t/maker-relay-ep-35/6932",
                        "https://forum.makerdao.com/t/maker-relay-ep-34-en-espanol/6815",
                        "https://forum.makerdao.com/t/maker-relay-ep-34/6802",
                        "https://forum.makerdao.com/t/weekly-mips-update-28/6791",
                        "https://forum.makerdao.com/t/discussion-eurodai/6521/64",
                        "https://forum.makerdao.com/t/maker-relay-ep-33-en-espanol/6729",
                        "https://forum.makerdao.com/t/maker-relay-ep-33/6694",
                        "https://forum.makerdao.com/t/weekly-mips-update-27/6649",
                        "https://forum.makerdao.com/t/maker-relay-ep-32-en-espanol/6600",
                        "https://forum.makerdao.com/t/maker-relay-ep-32/6596",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-22-february-2023/19936",
                        "https://forum.makerdao.com/t/maker-relay-ep-31-en-espanol/6455",
                        "https://forum.makerdao.com/t/maker-relay-ep-31/6450",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/16",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-127-thursday-february-4-17-00-utc/6261/5",
                        "https://forum.makerdao.com/t/discussion-eurodai/6521",
                        "https://forum.makerdao.com/t/the-risk-core-unit-2022-year-in-review/19372"
                    ],
                    "GPT-summary": "MIP46 proposes the formalization of Parameter Proposal Groups, which are tasked with evaluating information produced by contributors and domain teams and using this analysis to produce parameter change proposals for consideration by governance. The proposal outlines the requirements for a group to be recognized as a Parameter Proposal Group, the requirements that a Parameter Proposal must meet to be valid for inclusion in the Weekly Cycle, and the governance process for parameter proposals created by recognized Parameter Proposal Groups. The proposal aims to counteract the growing complexity of the Maker protocol by introducing an intermediate set of groups responsible for analyzing and evaluating parameter settings in the context of the wider ecosystem.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.352960729746444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#2",
                    "likes": "0",
                    "time": "03/02/2021-17:33:57",
                    "content": "How does this differ from the rates group? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "2",
                    "time": "03/02/2021-17:54:20",
                    "content": "This is largely a formalization and generalization of the rates group. Part of the initial rates group signal was a commitment to produce a MIP formalizing the group with April as the deadline. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party giving positive feedback on proposal"
                    ],
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "2",
                    "time": "01/03/2021-12:18:29",
                    "content": "This MIP is moving to Formal Submission for the March governance cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "3236"
}