{
    "poll_list": [
        {
            "title": "Investigate Implementation of an ETH-C Vault-type with a higher LR - February 1, 2021",
            "index": "6069",
            "option": "Yes",
            "supporting_mkr": "39,376",
            "highest_fraction": 1.0
        },
        {
            "title": "Add ETH-C as a new Vault Type - March 1, 2021",
            "index": "6069",
            "option": "Yes",
            "supporting_mkr": "31,278",
            "highest_fraction": 0.91
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-new-vault-type-for-eth-with-a-higher-lr/6069",
            "title": "[Signal Request] New vault-type for ETH with a higher LR ",
            "index": 6069,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "sig-status-accepted",
                "eth-c"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#1",
                    "likes": "6",
                    "time": "15/01/2021-20:56:02",
                    "content": " Overview Both ETH-A and ETH-B are heavily used and we are already facing the dilemma of trading-off risk VS business growth. Both ETH-A and ETH-B are in a spot where increasing the DC is questionable, as the protocol might end up with losses in case of another wave of liquidations. Still, we need to anticipate that DAI is popular and people want to leverage their ETH. @Primoz came up with the idea of creating a new vault-type for ETH with a lower LR, which will highly reduce the risk of the protocol losing money on liquidations, while on the other hand offering lower SF for people who want to stay heavily overcollateralized. This signal is about finding out if the community wants the risk team to come up with a proposal for a ETH-based vault type with a higher LR and a lower SF.  Pros  more DAI in circulation another hopefully valuable addition to our portfolio for risk-averse people willing to mint DAI less risky for the protocol than ETH-A   Cons  some work for the smart contracts team, as this is not only configuration   Should we add a new ETH-based vault type with higher LR and lower SF?     Yes No Abstain     0 voters      Next Step Poll will run until January 28th and depending on the result will move on-chain assuming the outcome of the poll deems it necessary. If the domain teams feel this should run shorter so it can be implemented earlier, I will update here accordingly. ",
                    "links": [
                        "https://forum.makerdao.com/t/iam-dc-eth-a-parameters-27th-jan-2021/6235",
                        "https://forum.makerdao.com/t/maker-relay-ep-34-en-espanol/6815",
                        "https://forum.makerdao.com/t/maker-relay-ep-30-en-espanol/6360",
                        "https://forum.makerdao.com/t/premip-discussion-vaults-with-lr-cr/6202/17",
                        "https://forum.makerdao.com/t/maker-relay-ep-30/6303",
                        "https://forum.makerdao.com/t/maker-relay-ep-29-en-espanol/6220",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-125-thursday-january-21-17-00-utc/6050/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-29/6214",
                        "https://forum.makerdao.com/t/signal-request-adjust-eth-a-debt-ceiling-2021-03/6187",
                        "https://forum.makerdao.com/t/governance-at-a-glance-january-14-21-2021/6145",
                        "https://forum.makerdao.com/t/maker-relay-ep-28-en-espanol/6124",
                        "https://forum.makerdao.com/t/maker-relay-ep-28/6118",
                        "https://forum.makerdao.com/t/maker-relay-ep-36/7039",
                        "https://forum.makerdao.com/t/maker-relay-ep-36-en-espanol/7053",
                        "https://forum.makerdao.com/t/maker-relay-ep-34/6802"
                    ],
                    "GPT-summary": "The author of the post is proposing a new vault-type for ETH with a higher LR and lower SF. The post is asking for feedback from the community on whether they want the risk team to come up with a proposal for this new vault-type. The post also lists pros and cons of the proposal. Some community members are asking questions and giving constructive criticism about the proposal.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Smart contract updates",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.2594795356159
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "15/01/2021-21:31:42",
                    "content": "Going to support the protocols in the ecosystem on this one ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/01/2021-21:52:12",
                    "content": "How does that conflict? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#4",
                    "likes": "3",
                    "time": "15/01/2021-21:53:37",
                    "content": "I voted yes, but I don’t consider this a high priority. I’d rather see progress on the already queued mountain of TODOs. Heart my post if you agree  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#5",
                    "likes": "0",
                    "time": "15/01/2021-23:21:56",
                    "content": "Same here I voted yes, But the priority should be to make this 400m at work. Also as this vault will target newbies ( experimented users know that rate doesn’t count as much as a low cf ).  it is in contractions with the 2000 minimum to open a vault. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "1",
                    "time": "15/01/2021-23:57:43",
                    "content": "Check out this write-up By Nim Also – did you see what Alexis wrote up there?      alexis:  this vault will target newbies   I was under the impression that we agreed that Maker Vaults were not for newbies, and rubes…  ¯_(ツ)_/¯ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "0",
                    "time": "16/01/2021-00:08:00",
                    "content": "BTW I do see a large opportunity/window to gain versus lenders/CeFi. Traditional banks in the U.S. are Flushed with Cash–but not lending: “Dimon has funding coming out of his ears. JPMorgan’s retail deposits swelled by one-third to nearly $1 trillion, and capital is well above regulatory minimums. Dimon often refers to his “fortress balance sheet,” and the term is ever more apt. Yet Dimon’s loan book, a gigantic $985 billion, didn’t grow. The $19.2 billion net increase in loans to consumers and small businesses in 2020 can be accounted for entirely by lending through the Payment Protection Program. Those Covid-19 relief loans are essentially backstopped by the government, and don’t soak up regulatory capital. Of a $39 billion increase in lending that wasn’t to consumers, more than half went to clients in the wealth management division.” –Reuters I just don’t know what the best  path forward is… We can always Yolo and find out  assuming we’ll accept the downside… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.960622710622711
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#8",
                    "likes": "2",
                    "time": "16/01/2021-02:29:05",
                    "content": "Is the plan to have ETH-A capped at some point? Currently ETH-A’s SF is so low, an even lower SF for ETH-C won’t do much to attract people. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#9",
                    "likes": "0",
                    "time": "16/01/2021-07:39:18",
                    "content": "    Jiecut:  Is the plan to have ETH-A capped at some point? Currently ETH-A’s SF is so low, an even lower SF for ETH-C won’t do much to attract people.   just based on the comment from Primoz on the last ETH-A-DC-signal I sense that risk is not super comfortable with the latest increase. The higher LR is just adding a lot of buffer to the potential protocol losses, that’s why I hope ETH-C could be a nice mitigation. Also, ETH-A SF is not really low: 2.5/3.5%. I can get <1% for putting up my house as collateral      alexis:  Also as this vault will target newbies ( experimented users know that rate doesn’t count as much as a low cf ). it is in contractions with the 2000 minimum to open a vault.   I don’t think this will only target newbies. People who are heavily overcollateralized might just want to switch over to ETH-C just to save some % on the SF (I for sure would do that) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.651041666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#10",
                    "likes": "0",
                    "time": "16/01/2021-10:43:27",
                    "content": "I haven’t done the math, but for the same liquidation risk you will save max 2% for 33% capital increase. For 1m it is 750k vs 500k at max. Compound is at 7%. I believe you should think about it and reconsider eth-a. Only difference is that if you get liquidated you may get more in return if liquidation works as expected. But in anycase that wouldn’t be a good investment. I am not sure at 100% but it doesn’t seem to be a good deal. However most people look at the rate especially new joiner. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.290404040404041
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#11",
                    "likes": "2",
                    "time": "16/01/2021-19:01:35",
                    "content": "Right now, 51% of ETH-A dai is above 400 CR, 10.5% is above 700. It is reasonable to think that some of them might swap. Maybe there are some users that just want small leverage on their long-term position. For Maker, I think it is much better to increase eth exposure with higher average LR vaults than just increase DC and SF. At some point, we will inevitably have to think of other options, than just increase the SF. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.355357142857144
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#12",
                    "likes": "0",
                    "time": "16/01/2021-19:40:27",
                    "content": "If you swap your leverage risk increase a lot. It will turn the same way. I believe people think that it may return to 600 and doesn’t want to be cought. But if you swap your position becomes riskier. However, I am in favor. I just think that people with experience would prefer economically eth-a or eth-c. May be I am wrong. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#13",
                    "likes": "1",
                    "time": "16/01/2021-19:47:20",
                    "content": "I guess the another argument against is whether we actually make the system safer with ETH-C. If those users would use high collateralization anyways with ETH-A. And we’d be earning less SF. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.988888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#14",
                    "likes": "0",
                    "time": "16/01/2021-19:58:18",
                    "content": "That is a valid point. However, this might also be a way of having more DAI from Eth without more risk (we would have from ETH-A) In the end we don’t know if this gets adopted, but it is probably a low effort potentially high reward (not in terms of fees, but more DAI in general) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#15",
                    "likes": "4",
                    "time": "17/01/2021-06:51:18",
                    "content": "I think ETH-C has no market and no competitiveness. High LR provides a certain buffer, but it is not competitive compared to other markets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.41547619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/textrapper",
                    "index": "#16",
                    "likes": "0",
                    "time": "17/01/2021-12:31:40",
                    "content": "Yes. the spice must flow ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#17",
                    "likes": "3",
                    "time": "17/01/2021-14:16:36",
                    "content": "I see this proposal only as temperature check whether community finds such product valuable at all, but not necessarily something we implement immediately. ETH-A DC still has some buffer left before it becomes too dangerous to increase it further. We are lucky that ETH-A Vaults are well collateralized on average, but should this metric become worse, I will recommend implementing ETH-C and limiting ETH-A DC. I assume there are concerns about ETH-A integrations of other DeFi protocol, but this is exactly the case why we should be having this discussion sooner than later, because we can not just simply assume ETH-A DC has no limit. ETH-C might be a bit uncompetitive in DeFi but Maker is the only platform (afaik) that allows users to unwind during 1h OSM delay, which means sophisticated users can afford to maintain their CR closer to LR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.936111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#18",
                    "likes": "0",
                    "time": "17/01/2021-14:30:26",
                    "content": "That is a good point, I believe having a higher LR allow an higher OSM delay which would make new joiner more comfortable about opening a vault. Having a different OSM should help to spread the risk too. What is eth biggest deep in 2hours/6hours/12hours/24hours ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.3977272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#19",
                    "likes": "0",
                    "time": "17/01/2021-15:24:43",
                    "content": "    Primoz:  I see this proposal only as temperature check   I see that proposal as any other proposal. If it gains enough support, it should have the same priority as any other proposal. Since the ETH vaults are close to the DC, and since DAI is at the peg or above, opening another vault could help with the peg and with decentralization. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#20",
                    "likes": "2",
                    "time": "17/01/2021-17:02:09",
                    "content": "After looking into this some more I’ve switched my vote from abstain to yes! I think there are a lot of neat applications exist for such a vault type, and ultimately with such a low implementation cost (and much lower risk parameters compared to our current offerings) seems like the right path to be on. Great Signal @ultraschuppi! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.1726190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#21",
                    "likes": "2",
                    "time": "17/01/2021-18:04:00",
                    "content": "I think we are getting way too picky with our favorite collateral, whose fate is ultimately tied up with the fate of MKR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jeffshaw",
                    "index": "#22",
                    "likes": "0",
                    "time": "26/01/2021-01:33:04",
                    "content": "I really like this idea. We might be surprised at the market demand to open a relatively highly collateralized vault in order to get a super low interest rate. For example, a 200% LR for a 2% SF. Let’s offer the option and let the market decide. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.661111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#23",
                    "likes": "0",
                    "time": "26/01/2021-01:41:22",
                    "content": "    Jiecut:  I guess the another argument against is whether we actually make the system safer with ETH-C. If those users would use high collateralization anyways with ETH-A. And we’d be earning less SF.   Rethinking this, not as big of a problem because ETH-C will be the new AAA vault and the SF for ETH-A will be able to be raised. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.524747474747475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#24",
                    "likes": "0",
                    "time": "26/01/2021-03:04:43",
                    "content": "Voted yes, and I think it’s a fairly uncontroversial idea, but it may not be a high priority compared to other collateral types. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.558333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#25",
                    "likes": "4",
                    "time": "28/01/2021-15:14:38",
                    "content": "Thanks everyone for participating, poll is now closed. I just pushed a PR for a pseudo-greenlight-poll that - Inshallah - will go onchain next Monday. stay tuned  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is updating on progress and next steps",
                        "3rd party asking for updates on proposal"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#26",
                    "likes": "0",
                    "time": "31/01/2021-01:45:10",
                    "content": "    ultraschuppi:  Also, ETH-A SF is not really low: 2.5/3.5%. I can get <1% for putting up my house as collateral    Except your house isn’t appreciating 600% a year  I know I’m late to the party but I’d rather see an ETH-C/D with same LR but higher SF and just cap ETH-A ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#27",
                    "likes": "3",
                    "time": "31/01/2021-07:00:30",
                    "content": "    Aaron_Bartsch:  I know I’m late to the party but I’d rather see an ETH-C/D with same LR but higher SF and just cap ETH-A   I guess this changes nothing risk wise. Also giving up ethA is probably pretty bad for apps like yield or b.protocol ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#28",
                    "likes": "0",
                    "time": "03/02/2021-15:16:55",
                    "content": "What if ETH-C had the same LR but a lower Loan to Value ratio? So you could have liquidations occur at 150% but you can only generate DAI up to 200%? @Primoz have you thought of this sort of implementation? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#29",
                    "likes": "1",
                    "time": "03/02/2021-16:49:53",
                    "content": "Yeah this is definitely also a good way to manage risks, especially in this high DAI debt growth period. I believe Aave uses it. Not sure how feasible this is from technical standpoint at Maker currently. Good question for @Smart-Contracts. Still, ETH-C with LR equaling LTV is safer, because you make sure people react at higher CR, I think. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.144444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#30",
                    "likes": "1",
                    "time": "03/02/2021-16:55:04",
                    "content": "So have a CR != LR situation is definitely do-able. In fact this may be a worthwhile addition to LIQ-2.0 as it would need to be added to either the cat or the upcoming dog contract. Basically we would define a liquidation ratio to be some fraction of the vat safety margin instead of them being equal which is what it is now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#31",
                    "likes": "0",
                    "time": "03/02/2021-17:15:18",
                    "content": "    hexonaut:  So have a CR != LR situation is definitely do-able.   One thing that i don’t get about this CR > LR idea is how do you ensure that people keep their vaults collateralized in that way if you don’t liquidate them? Sure you can enforce them to put in a certain amount of collateral initially but what happens when the price goes down and the vault ends up below the CR? My guess is that overtime the CRs trend down to the LR anyway and you have the same situation as today, but that is just me hypothesizing. You could maybe start charging an “undercollaterlized fee” or something, but it seems like more contract work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.564484126984127
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#32",
                    "likes": "0",
                    "time": "03/02/2021-17:18:00",
                    "content": "I dunno, thats what Aave does. We could probably gather some analysis from them to determine whether it works or not. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#33",
                    "likes": "0",
                    "time": "03/02/2021-17:20:28",
                    "content": "    Aaron_Bartsch:  What if ETH-C had the same LR but a lower Loan to Value ratio? So you could have liquidations occur at 150% but you can only generate DAI up to 200%? @Primoz have you thought of this sort of implementation?   i started a premip on this idea a couple of days ago. if this is quite easy to implement, it would be great if this can be stated there. I would try to push it forward if this is reasonable and doable: PreMIP discussion: Vaults with LR << CR ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 6.433333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#34",
                    "likes": "1",
                    "time": "03/02/2021-18:09:15",
                    "content": "Posted this in the other Pre-MIP thread, but I added a PR for this to go in LIQ-2.0. I can’t speak to whether this will make the cut for the initial release as they are in final code review. Maybe something that can go in the next upgrade. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#35",
                    "likes": "0",
                    "time": "03/02/2021-19:26:06",
                    "content": "I am not too sure if that will actually decrease massively the risk. As the main problem is the domino effect. AK as we sell the price decrease and more are coming. Time spread looks to me more efficient to spread liquidation over time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.388888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#36",
                    "likes": "1",
                    "time": "03/02/2021-19:34:52",
                    "content": "    Andy_McCall:  One thing that i don’t get about this CR > LR idea is how do you ensure that people keep their vaults collateralized in that way if you don’t liquidate them? Sure you can enforce them to put in a certain amount of collateral initially but what happens when the price goes down and the vault ends up below the CR?   Even if we don’t enforce it, I guess most vault holders will appreciate the added time to react by unwinding (partially). Sure, this is not as good as enforcing, but at least you cannot initially putting yourself in risk of liquidation  ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.088183421516755
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#37",
                    "likes": "0",
                    "time": "03/02/2021-21:06:13",
                    "content": "It is not time we give to him, it is more a way to enforce the CR spread and have a better repartition when the liquidation happen. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#38",
                    "likes": "2",
                    "time": "05/02/2021-17:03:45",
                    "content": "thanks everybody for participating! on-chain poll closed yesterday with a 99.97% approval. ETH-C gets added to the collateral sheet soon. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1IX9e2fyfz7djtDMKn5gMyGsyFxHoY75GncMbAjnSXrM/edit#gid=0"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#39",
                    "likes": "0",
                    "time": "12/02/2021-17:03:47",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#40",
                    "likes": "0",
                    "time": "20/02/2021-11:02:52",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#41",
                    "likes": "0",
                    "time": "21/02/2021-08:00:48",
                    "content": "This topic was automatically closed after 20 hours. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#42",
                    "likes": "0",
                    "time": "22/02/2021-10:18:18",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#43",
                    "likes": "1",
                    "time": "22/02/2021-10:53:41",
                    "content": "exciting update: @Risk-Core-Unit posted the proposed parameters for ETH-C - so some progress is one the horizon  please chime in over there for further conversation ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#44",
                    "likes": "0",
                    "time": "22/02/2021-10:58:12",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "3158"
}