{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dicu-monthly-updates-thread/14960",
            "title": "DICU Monthly Updates (Thread) ",
            "index": 14960,
            "category": [
                "Core Units",
                "Data Insights"
            ],
            "tags": [
                "cu-update",
                "din-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#1",
                    "likes": "2",
                    "time": "04/05/2022-13:19:32",
                    "content": "Welcome to the Data Insights Core Unit Monthly Updates thread  We’ll be posting a short update on the work done once the month has finished, our aim is to publish it in the week following the month’s close. If you have any questions, feedback and ideas feel free to post them in this thread or write to us through whichever channel you feel most comfortable with. Name: Data Insights Core Unit Short name: DICU Code: DIN-001 Forum: @data-insights-cu Discord: #data-insights-public Email: [email protected] Website: data.makerdao.network Github: makerdao-data gDrive: MakerDAO - Data Insights Core Unit Meeting: Book a meeting with us ",
                    "links": [
                        "https://github.com/makerdao-data",
                        "https://drive.google.com/drive/folders/1wsMZ1N4jY8hnmUtkafwvvfoHB6SH0IJW?usp=sharing",
                        "https://calendly.com/makerdao_data-insights/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#2",
                    "likes": "4",
                    "time": "04/05/2022-13:19:49",
                    "content": " DICU Monthly Update: April 2022  MIP governance cycle We successfully confirmed the renewal of the mandate and budget with governance. Through this process a lot of aspects of our work have become evident, we appreciate the feedback and aim to rectify the negative ones as soon as possible.  DevConnect Amsterdam & New member We’ve welcomed Leo (@03ladr) as the new member of our core unit. We are thrilled to have him, he already shares a passion for Maker and his full stack skills will help us deliver amazing things to come. Several of us attended DevConnect in Amsterdam so we had the chance to meet each other in person for the first time. It was a fantastic and enriching experience to run a few densely packed sessions, mainly focused on discussing the past performance and planning for the future. We talked a lot about how to create a workflow that will allow us to scale while minimizing maintenance and communication costs and workload. We also had a lot of very enriching conversations with other CU members, delegates and people outside of Maker.  Datasets   Created the MKR transfers dataset   Added MKR transfer dataset to Data API → currently testing   Created the DAI transfers dataset, currently used by Strategic Finance via Snowflake share.   Added MKR transfer dataset to Data API → currently testing   Fixed Data API documentation inconsistencies based on user feedback in discord.   Published first datasets in the Snowflake Marketplace (Protocol Parameters and Vault History).   Fixed debt equivalence error    Analyses  Created a historical ilk overview and stability fee (gSheet) Second iteration of Ranked Poll Analysis used by GovAlpha Automated vault usage report used by Growth   Pipeline  Added CAT contract data to the Protocol Parameters dataset (CAT is the old collateral liquidation contract (Liq 1.0) (UI, API) Fixed monitoring lambda function, used by TechOps Created a telegram monitoring bot for airflow   UIs  Optimized trackers: quicker response for users, less strain on the server (Gov Tracker, Vault Tracker)   RWAs  Created a draft template based on the reporting from RWA Co on 6S Capital performance. Signed NDA with RWA Co to allow the sharing of sensitive information   Bugs  Current open issues:  Vaults with negative collaterals: data source related issue, modified data pipelines, rebuilt datasets → currently testing. Curve vaults with no owner/ds-proxy: incorrect heuristics/assumptions → currently modifying data pipeline    This the first instalment of our monthly updates, we welcome any feedback on them. We’ll probably be changing the format until we find the most suitable one. ",
                    "links": [
                        "https://app.snowflake.com/marketplace/listing/GZT0Z116HK4B?category=7",
                        "https://docs.google.com/spreadsheets/d/19HGVn2SdlzwaI4T1bhesIXyXCeWgVKAeFuNApcr7xow/edit?usp=sharing",
                        "https://tracker-gov.makerdao.network/protocol_parameters",
                        "https://data-api.makerdao.network/redoc#tag/protocol-parameters",
                        "https://tracker-gov.makerdao.network/",
                        "https://tracker-vaults.makerdao.network/",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-april-2022/15217"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.554968287526427
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#3",
                    "likes": "1",
                    "time": "04/05/2022-19:41:20",
                    "content": "I see that you’re still testing some things and have open bugs but could you add a section with plans for the coming month and perhaps a roadmap with longer term goals on the horizon? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#4",
                    "likes": "0",
                    "time": "05/05/2022-17:10:17",
                    "content": "Hi @Traster_Tray! We are working on a separate post with a quarterly view of the work planned, as well as the work done with more in depth commentary, I think this would give a better context to them. For the long term roadmap, we’ll be updating the existing public roadmap that you can find in our website. Having said all this, I do agree with you that having some visibility is better than none so I’ll add some bullet points below. Please note that when I use the word “build” it means that we might not be publishing it that month as we want to minimise releasing bugs  out into the wild.  Planned for next month (May)  Publish DAI dataset Publish MKR dataset Build StarkNet dataset Rationalise databases Break down data pipelines into smaller modules Build RWA Proof of Concept Build ESM Threshold analysis Build Ranked Polls simulation Publish DAI Fee Performance report Close budget & execute return of excess funds  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7746913580246915
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#5",
                    "likes": "1",
                    "time": "05/05/2022-17:22:49",
                    "content": "Great, thank you!  PoC is point of contact right? The website is great.  Often times, it’s just not knowing where to look or forgetting that something like that exists so maybe keeping it updated and a simple link to it would work.  Now I’m wondering if other core units have something like this that I don’t know about.  But again, thank you for your response.  For something in the background like data insights, it’s helpful to understand where your value lies and maybe even spur new ideas that can help the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7475649350649345
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#6",
                    "likes": "2",
                    "time": "06/05/2022-11:15:56",
                    "content": "Sorry, PoC is Proof of Concept, I’ll change it above, it’s a bad habit to use acronyms that not everyone is familiar with. You’re expressing a very real sentiment in the community, even as a core unit member I find myself surprised at what people have built, the other day I discovered that @hernandoagf built cool notebooks analysing Sourcred. I hope as we mature we find better ways to make our work more accessible. I fully agree with you, we would love to get new ideas from you and the rest of the community. Thank you for response and input in this. On the roadmap, I really like what the DUX core unit do, here. It allows people to provide feedback directly on their planned roadmap. ",
                    "links": [
                        "https://makergovernance.canny.io/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6785511363636365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#7",
                    "likes": "2",
                    "time": "09/06/2022-20:33:46",
                    "content": " DICU Monthly Update: May 2022  MIP governance cycle & Budget Closing We have posted the MIPs for the facilitator offboarding and onboarding. The latter will be voted on in the upcoming June governance cycle. We executed the closing of the previous budget. We have returned excess of funds to the protocol (52,401 DAI / 14.28%).  Datasets  Published new datasets  MKR transfers MKR balances DAI transfers DAI balances    We want to have a broader reach within the community so we decided to firstly publish the datasets as part of a web-app for everyone to interact with. Link to post | Link to web-app  Added protocol parameters to the existing dataset  PSM tin & tout (for USDC, GUSD, USDP) ESM min DSPAUSE delay GSM pause FLOPPER & FLAPPER tau     Analyses / tools   Built ESM Threshold analysis Collaborated with GovAlpha to create a data driven decision making to define the threshold to activate the Emergency Shutdown module. This was an excellent use case to fully build and test the MKR balances dataset. We also found ourselves breaking down the true ownership of the tokens staked in the governance contract, a feature we believe will be helpful for some future use cases.   Built Sentiment Prioritization Poll Simulation Supporting GovAlpha & DUX efforts in rolling out this new form of governance signalling, we have built a web-app that shows how the choices/options behave through each round of the Instant-Runoff Voting system. The goal is to give clarity on how the 2nd, 3rd preference choices from a voter impact the final outcome of the poll. Including below a sneak preview that we will publish in early June.  1619×533 67.4 KB    Built Vote Data Export report Simply put, it’s a gSheet where we copy the onchain polls and executives. This simple sheet actually can enable a lot of use cases. Firstly, we worked with one of the recognised delegates (Gauntlet), to feed directly into their project management tool (Asana) to ease the workload of keeping on top of the necessary voting. We made this implementation with Zapier and will be soon publishing a write-up so other delegates can make use of it. Secondly, the same gSheet will be used by GovAlpha to support their onchain poll tagging process.Link to gSheet.   Nature POAPs queries Built a set of queries to support the launching of the Nature POAP by the Growth CU. As part of this effort, we reached out to DeFiSaver to validate our vault tagging methodology. We are looking into tooling that would allow us to provide a more “do it yourself analytics” for which this type of use case would be perfect for.    Data Pipeline We have being doing a fairly large refactoring (modification/re-writing of our existing code) of our data pipelines. We firstly breaking down our pipelines into smaller components, this modularity allows us to re-use components, easier to pin point issues and resolve them (avoiding the dreaded “I fixed one thing but that made another thing break”).This a time intensive initiative that unfortunately does not yield any visible results rather its value will come from less bugs, less time building and maintaing.  RWA Data Initiative & Collaborations  Continued the collaboration with RWAco Enganged with other RWA stakeholders to gather feedback and requirements We are now part of the CES workflow for CMON & CMOFF, ensuring that with every new collateral being onboarded we are ready from day one to provide data about them.   Bugs   PSM debt value issue One of our data sources had an incorrect value for the PSM which they fixed within 40 mins. We informed them of the issue and have added monitoring tool that checks certain metrics between different data sources.   Tracker URL The old url domains for the trackers went offline when we transitioned the domains between services. We still maintain the following domain urls but highly encourage using the new ones: http://mcdgov.info/ → https://tracker-gov.makerdao.network/ http://mcdstate.info/ → https://tracker-vaults.makerdao.network/    Current open issues: The main two issues from last month are still open, these will be fixed by the data pipeline refactoring work that is ongoing.  Vaults with negative collaterals: data source related issue, modified data pipelines, rebuilt datasets. Curve vaults with no owner/ds-proxy: incorrect heuristics/assumptions.   Initially planned for May Publish DAI dataset Publish MKR dataset Build StarkNet dataset → delayed until June, we are collaborating with other CUs to build a monitoring system for L2s. Rationalise databases → delayed until we finish refactoring the data pipelines Break down data pipelines into smaller modules Build RWA Proof of Concept → delayed while we gather feedback and requirements from RWA stakeholders Build ESM Threshold analysis Build Ranked Polls simulation (now named Sentiment Prioritization Poll Simulation) Publish DAI Fee Performance report → delayed until June Close budget & execute return of excess funds  Planned for next month (June) not exhaustive   Data Pipeline  Continue the refactoring. We will start switching out certain already completed sections into production.   L2s  L2 Monitoring System (cross CUs) Most likely build StarkNet (canonical) Dai datasets for transfers and balances first.   RWA  Feedback & requirement gathering Kick-off work related to HV Bank   Protocol Parameters  Add FLASH max & toll (Flash mint module) Add contract type → show whether a protocol parameter was change by a one-off spell, lerp or iam   Data API  Feature to decide the order of output by the user defined parameter MKR & DAI datasets   UIs  Deliver more datasets as Streamlit web-apps for higher accessibility.  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip41c4-sp35-facilitator-onboarding-din-001/14948",
                        "https://forum.makerdao.com/t/dicu-2021-2022-financial-year-in-review/13961/2",
                        "https://forum.makerdao.com/t/dicu-dai-mkr-datasets-web-app-showcase/15497",
                        "https://streamlit-ui.herokuapp.com/",
                        "https://zapier.com/",
                        "https://docs.google.com/spreadsheets/d/1MkC0GILLWaRUEKU1hz6nKft21uyZATTreAVxg5x3hkU/edit?usp=sharing",
                        "http://mcdgov.info/",
                        "https://tracker-gov.makerdao.network/",
                        "http://mcdstate.info/",
                        "https://tracker-vaults.makerdao.network/",
                        "https://streamlit.io/",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-may-2022/15932",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-mayo-del-2022/16043"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.441159976387249
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#8",
                    "likes": "0",
                    "time": "02/08/2022-10:47:40",
                    "content": " DICU Monthly Update - June 2022 I’m sorry I missed doing the update last month. I’ll do it as if it was last month apart from the upcoming work for July which I’ll post right away.  L2 Future With the upcoming onboarding of MCD (Multi Collateral Dai) onto L2s (Layer 2s, rollup blockchains), we’ve taken a hard look at how we can deal with the technical complexity and how we can abstract it away for our users. We dedicated some time this month to design those two sides:  Data sourcing: We are ensuring to always have redundant raw data feeds. As of now, we consume data from TokenFlow and Nansen for L1, we expect to incorporate others in the future to ensure that every chain has at least 2 independent providers. We support this with a node of our own that is mostly focused on acquiring the latest available data (rather than the historical). Data Delivery: We want users have a smooth experience, where they look up data from all chains or one in the same context. For that we will design the future Data API endpoints to include the selection of chains while at the same time taking care to avoid the “double counting” problem.   Refactoring / background work The refactoring we mentioned previously is still ongoing. We don’t have anything major to update on. We are hoping to release the liquidations pipeline soon.  Bugs  Open  Revenue/Fees: We don’t account for fees in D3M and RWA vaults correctly. This is due to assuming that these “vaults” have the same design pattern as you standard crypto collateral vaults. We are documenting the correct way to capture all fees and will then do the correct implementation.   Closed  Delegate voting power report: when we switched [email protected] to a Recognized Delegate, we stopped pulling their address and instead started pulling an empty row without shadow or recognized delegate in the type column and no delegate name or address in the delegate column. We fixed this behaviour.   Data Delivery  Web-apps  We have grown quite fond of releasing web-apps using Heroku, it allows us to manage them quite lightly and we avoid the major bugs we saw with AWS. To make things quicker, we created a Heroku design pattern to deploy scalable web apps, files to support deployment, and a docker image.   Protocol Parameter UI  We’ve taken over the project/product management of the Protocol Parameter UI duties from GovAlpha. Being built by dSpot, we are helping ensure the final features are in place before presenting it to the community. The website will allow users to see all present and past parameter values for all elements in the protocol.   Ranked Poll Simulation   Released v1  Visualisation of ranked poll votes The data has a ~20 mins delay Simulation of voting (select preference, input MKR support) Scorecard (see the final preference for all options)     ESM Threshold Analysis  The ESM Threshold Analysis was posted by GovAlpha. We are looking forward to creating a more long term monitoring solution that while maintaining the privacy of wallets, can help users understand the composition of MKR holders.   Reports  Voting Data Export  Link to gSheet gSheet that displays on-chain polls and executives data. Currently being used by Gauntlet to feed their Asana board. We’ve stabilised it, fixing some bugs and setting it to run 3 times a day.   RWA Data Initiative & Collaborations  Designed a high-level architecture for the short term data pipeline/process for the upcoming TradFi partnerships.   Collaborations  We are constantly looking to expand the scope of our collaborations. Not only within MakerDAO but beyond. We’ve been having conversations with some teams that are looking to build or expand their current offerings. One of the collaborations that came to light this month was with Flipside Crypto. Given that they also have a delegate team in MakerDAO governance. We believe they’ve acted in good faith reaching out to us and we are excited to work with them to fulfil our mandate (making Maker data available to as many people as possible). This can take several forms, onboarding Maker contextualised/semantic datasets, having Maker related bounties for data analysts as well as sharing best practices and tooling.   Initially planned for June  Data Pipeline Continue the refactoring. We will start switching out certain already completed sections into production. L2s → ended up focusing on the design, implementation will happen in July RWA → Adjusting for the HVB project timeline, we expect to receive data in July Protocol Parameters → contract type has been a bit more difficult than initially expected, pushing the release to July Data API → MKR & DAI datasets passed all tests  Planned for next month (July) not exhaustive This would be cheating  ",
                    "links": [
                        "https://forum.makerdao.com/t/informal-poll-disable-the-emergency-shutdown-module/16292/3",
                        "https://docs.google.com/spreadsheets/d/1MkC0GILLWaRUEKU1hz6nKft21uyZATTreAVxg5x3hkU/edit#gid=1910669550"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.422533681008257
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#9",
                    "likes": "4",
                    "time": "02/08/2022-10:56:56",
                    "content": " DICU Monthly Update - July 2022  L2s (Layer 2 blockchains)  Signed contract with Nansen for the provision of L2 data. We now have Token Flow and Nansen powering our data sourcing for every L2 in PEs roadmap. While at first we’ll focus on onboarding them, we want to create modules that can be agnostic to which data provider we have (including directly from a node) as well as run data quality & integrity checks against each other, ensuring that we have the most sound quality data possible. Captured StarkNet L1 and L2 raw data (L1 bridge and escrow, L2 bridge) Decoded StarkNet L2 transfers Captured Optimism and Arbitrum L1 raw data (L1 bridge and escrow)   Tooling - a Decoder This one I’m over the moon about. We setup DICU to be a public goods CU, the idea behind being it is that data unshared is meaningless, the work we do to build a use case for GovAlpha can be equally valuable to other CUs, MakerDAO and the web3 community. To that point, we believe that the services and products we are building nowadays will evolve to become tools. Said tools don’t require DICU executing it for users, nor does it necessitate DICU running a server for it, tools can be independently used by users however way they want. We are still far away from this and hope to continue building towards it.  We created an internal, python-based, TX log decoder which others may find useful. In this case, rather than decoding using web3.py TX receipt objects, we directly decode both log topics and data - solely referencing a contracts ABI. This is necessary when using third-party data providers (TokenFlow, Nansen).  We’ll identify and patch any edge cases before releasing this utility to the community via our Github. We will be publishing more general-usage utilities moving forward as well.  Refactoring  Released new liquidations pipeline. Can be summarised as “updated and fixed”. We are now able to switch between the Ethereum ETL and TokenFlow EDW. We’ve improved the monitoring of the Data API and Trackers. This will allow us to more quickly respond to outages and also help us debug and prevent future ones.   RWA Data Initiative  HV Bank: We have received the initial designs in the agreement documents. Created mockups based on them. We are waiting to receive data to start processing it. SocGen: We are waiting to receive data to start processing it.   DAI & MKR web-app  Re-published our web-app for DAI and MKR. Works harder, better, faster, stronger.   Protocol Parameters  Refactored pipeline Implement the contract type (source/contract/change, we still haven’t figured out the right naming convention)   Data API  Publish Token endpoints (MKR & DAI), these datasets are pretty heavy so we’ll be monitoring how they affect performance.   Planned for next month (August) not exhaustive  L2s: We’ll fully source, decode and contextualise the Maker Teleport contracts. The semantic datasets will be firstly used to build an analytics dashboard for monitoring the bridges. We are looking to expand it to other use cases afterwards. As always, the underlying data will be available for anyone to build more and better use cases.  I want to keep this list extremely short this month, our big focus is getting L2s right and come out of the gate fully supporting the tremendous work from the other teams in this domain. We’ll probably end up working on other topics but I’ll let you know next month. Until next time, the DICU team wishes you happy building!  Screenshot 2022-08-01 at 10.10.56 AM864×766 41.6 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.634158376345876
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#10",
                    "likes": "1",
                    "time": "02/08/2022-14:28:29",
                    "content": "    tadeo:   We created an internal, python-based, TX log decoder which others may find useful. In this case, rather than decoding using web3.py TX receipt objects, we directly decode both log topics and data - solely referencing a contracts ABI. This is necessary when using third-party data providers (TokenFlow, Nansen).    very excited about this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#11",
                    "likes": "0",
                    "time": "02/08/2022-21:51:09",
                    "content": "Not an official ISCU communication.     tadeo:  Ranked Poll Simulation   After listening to this podcast, I got convinced that Scale or Approval Voting is simpler to understand than Rank Choice Voting (RCV) and is a better way to assess voter sentiment. As one of the original proponents of RCV, I wonder if there is interest in Scale or Approval Voting for on-chain polls? ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Score_voting"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#12",
                    "likes": "0",
                    "time": "09/09/2022-14:36:04",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#13",
                    "likes": "3",
                    "time": "12/09/2022-13:36:40",
                    "content": "Hi everyone!   DICU Monthly Update - August 2022  L2 Future & Maker Teleport We have fully decoded Arbitrum, Optimism and StarkNet data for the bridge and DAI contracts (both L1 and L2). The first use case is the Maker Teleport Monitoring Dashboard, the first version is be aimed at helping bridge operators with a holistic view of the movement of DAI between chains, for that we focus on the inflows/outflows and the movement of L2 DAI.  1280×1114 77.8 KB   Pending short-term work:  Coordinating with Nansen to fix Optimism bug related to missing data prior to re-genesis Decoding of latest Teleport specific contracts   Later versions will potentially include:  Oracle performance metrics, such as # of attestations & who is reporting events Split the top holders of DAI between EOAs and protocols Canonical DAI vs Non-Canonical DAI Non-Maker bridges   Bugs  Updated delegate compensation pipeline, we now support new delegates contracts Resolving a bug related to vaults, particularly LP token related vaults   Collaborations - Dune Analytics We are collaborating with the Dune team to take advantage of their newly released V2 engine and the open sourcing of their Spellbook. The improvements now allow us to build simple & contextualised tables within Dune for data analysts to quickly build beautiful things with. Right now as a Dune user you need to work off data around smart contracts in order to build your query; usually users will fork someone else’s query and build on top of it. While workable, this is quite limiting, you depend on super users to have a working dataset. The first step has involved including all relevant contracts that are not yet decoded in the platform.  image778×582 29.7 KB  Next step will be about creating ‘spells’, these will allow data analysts to pick a table such as “delegates” and query the current delegated MKR instead of having to interact with multiple smart contract based tables.  Unified Governance analytics We’ve had a great set of meetings with GovAlpha and DUX. We are planning to collaborate together to unify all governance related analytics to help users have a better experience and for the respective teams to be able to focus on their key skills. We ran an ideation session with DUX where we surfaced the most relevant topics to collaborate on together. We’ll be working on these in the upcoming months.  Research support We’ve had a few researchers, PhD students reach out to us for help making use of our governance related datasets. We are continuing this support and looking to improve it to better support the research community.  Protocol Parameter UI dSpot has been making the final changes and feature implementations. They will be releasing the website soon, we hope the community finds it valuable, allowing anyone to easily understand protocol parameters and how/when they change.  Planned for next month (September) not exhaustive  L2s: continued work on datasets and dashboard, looking to incorporate some of the features listed above. Financial reporting: increase transparency by reporting budget level items. Improved tooling: The decoder was only the beginning, we are putting the pieces together to make it easier for users to grab data on-chain and have it fully processed.  ",
                    "links": [
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-august-2022/16955"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.830367965367965
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#14",
                    "likes": "1",
                    "time": "23/10/2022-10:09:36",
                    "content": "Hi everyone!  DICU Monthly Update - September 2022  Maker Teleport Monitoring  You can see the working version in the following URL, we’ll be adding a custom domain soon: https://l2s-metrics.herokuapp.com/  Continuing to work on the monitoring app, we have included the latest contracts and now track the fast-withdrawal functionality (particularly the debt ceiling). After the app goes live we will focus on making short-term improvements and then building the endpoints to expose the data through the API for everyone to access. Optimism issue: this is still pending, as a short-term measure we’ll include the state or balance of accounts before the regenesis. Long term we’ll rebuild the chain with a combination of Optimism datadir packages and pulling missing transactions from publicly available sources.   Bugs  Curve LP vaults: We used to show Curve LP vaults incorrectly (they would be duplicated, one instance would have the correct id but no balance while the other would have the correct balance but no id). This was to the specific design pattern for these types of vaults where the CDP Registry interaction was different. It’s now fixed.   Performance improvements  Reducing false positives: We’ve been living with tons of alerts that were “fake” (the system assumed a couple of seconds of delay were an error that it can actually handle without many disruptions to the end-user). We did a significant infrastructure upgrade to the pipeline orchestrator monitoring system (Airflow, Flower) and now the team is alerted only when real errors surface. In an effort to reduce the computing power needed to service users, we have implemented the use of JSON objects that should make it quicker and more efficient to produce statistics. As we continue to scale we will pay more attention to this and dedicate more of our efforts.   Team Offsite  Taking advantage of ETHWarsaw, the team met in Warsaw and worked side by side with others at Maker for the week following the conference. We discussed new ways of working, our roadmap and the possible implications of Endgame. The latter is an ongoing conversation within the team and with other stakeholders to find the best organizational fit in the next itineration of MakerDAO.   Planned for next month (October)  L2s: continuing the work, improving the metrics shown, adding a custom domain, adding fees Governance: starting work to unify all governance analytics-related activities into one Endgame research: finding possible set-ups for DICU and other data-related initiatives within the MetaDAO structure. Financial reporting: previously scheduled for the previous month, we’ll most likely release it in November, we need to correctly do reconciliation based on FX differences that are proving to be quite tricky.  ",
                    "links": [
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-september-2022/18288"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5336921850079746
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#15",
                    "likes": "1",
                    "time": "22/11/2022-13:16:26",
                    "content": "Hi everyone!   DICU Monthly Update - October 2022  tags: monthly update   Maker Teleport Monitoring  Custom domain for the website at teleport.makerdao.fyi  Improved info shown in charts, converted KPIs to charts for easy comparison.  1854×535 32.4 KB   Alerting: set-up alerts for uncommon variance   Optimism issue: solved…ing  [x] Querying the L2 DAI supply through a node (rather than aggregating individual balances) [ ] Rebuilding the pre-regenesis transactions in a local environment, extracting the relevant transfer events to then build the correct DAI balance for each address     Bugs  Curve LP vaults: Creating Curve LP vaults include interaction with CDP Registry which is a slightly different flow than for other vaults. Due to this difference, we had duplicated/broken vaults in our dataset.   Performance improvements  Improved L2 monitoring checks Decoding upgrade (harvester): decoding nested structs Dai transfers and volumes metrics Adding a production data source to delegates’ mapping pipeline (mapping for new voteDelegate contracts)   Front-end  We will be developing a DICU website to improve the user experience, unifying all the different web apps and expanding further with datasets that we have built but have not been used The initial step has been to aggregate all the different UI elements available throughout Maker, particularly from DUX, into a UI library that any front-end engineer can make use of.   Planned for next month (November)  L2s: adding fees, re-building Optimism transfers Front-end: Migrate Teleport Monitoring to the new Data Insights portal  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.653743315508021
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#16",
                    "likes": "0",
                    "time": "20/02/2023-13:16:28",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}