{
    "poll_list": [
        {
            "title": "PPG - Open Market Committee Proposal - January 9, 2023",
            "index": "19327",
            "option": "Yes",
            "supporting_mkr": "93,070",
            "highest_fraction": 0.98
        },
        {
            "title": "PPG - Open Market Committee Proposal - February 6, 2023",
            "index": "19637",
            "option": "Yes",
            "supporting_mkr": "93,464",
            "highest_fraction": 1.0
        },
        {
            "title": "PPG - Open Market Committee Proposal - February 27, 2023",
            "index": "19936",
            "option": "Yes",
            "supporting_mkr": "57,916",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-2-february-2023/19637",
            "title": "Parameter Changes Proposal - PPG-OMC-001 - 2 February 2023 ",
            "index": 19637,
            "category": [
                "Updates"
            ],
            "tags": [
                "rates",
                "rates-working-group",
                "ppg-omc-001",
                "ppg",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "7",
                    "time": "02/02/2023-20:05:36",
                    "content": "Parameter Proposal Group: MakerDAO Open Market Committee  Authors: @Primoz @LongForWisdom, @Monet-supply, @SebVentures, @hexonaut, @ultraschuppi, @rema, (and @ChrisB in an advisory capacity)  1600×803 305 KB  Source: Risk Premiums & Competitive Rates - Updates for February 2023  Lending Market Overview Borrowing rates at competitive DeFi platforms remained fairly steady through the start of the month, with a slight decline in stablecoin borrow rates at Compound and slight increase at Euler. Aave has seen ETH deposit yield decline by roughly a third since last month, which has increased the effective cost of borrowing stablecoins against ETH and is one of the larger drivers in the observed change in average competitive rates from December to January. Rates have ticked up in the last week of the month as the market grew more bullish.  1326×746 78.6 KB  Source: Blockanalitica Dashboard Many small and mid capitalization assets remain disabled as collateral on external lending protocols. Currently, Maker is the only protocol accepting YFI, GNO, and rETH as collateral. We’ve seen a moderate increase in YFI and rETH vault usage over the past month which reflects the lack of competition. Aave recently launched their v3 protocol on mainnet, with only major large cap assets. It is expected that additional, smaller assets will be added over time, which may reintroduce some competition in the small cap lending space. Aave v3 is better equipped to handle small cap assets vs Aave v2 or Compound v2, due to the availability of supply and borrow caps, collateral isolation mode, and efficiency modes. Adding direct deposit (D3M) support for Aave v3 could offer an efficient way to support DAI borrowing demand against smaller collateral assets. Derivatives markets have also reflected increasing bullishness, with funding on ETH perpetuals consistently positive in the back half of the month.  1600×1062 106 KB  Source: Coinalyze The recent FOMC meeting raised rates by 0.25%, with a decent possibility that this represents the last or second to last hike in this rate cycle. More favorable TradFi conditions could present an additional tailwind to crypto markets. On the other hand, this would limit increase in revenues from Maker’s stable asset portfolio.  1600×867 64.4 KB  Treasury Yield Curve The DSR has so far seen limited adoption, with most of the ~35 million DAI within the contract contributed by a large account. However, there are additional sources of deposits on the horizon, including Olympus (recently voted to deposit around 70 million DAI), along with lending markets such as Aave and Compound.  Proposed Changes This month’s proposal includes several debt ceiling increases for vaults that have reached their max capacity, as well as stability fee changes to realign vaults based on risk or encourage growth. Impact on revenue is fairly minimal. Accompanying images are gathered from Makerburn. CRVV1ETHSTETH-A: Increase line to 100 million DAI  1414×654 41.5 KB  After a year of operation with relatively low usage, the CRVV1ETHSTETH vault type has recently seen a spike in utilization. This was primarily driven by a whale wallet who recently minted DAI close to the maximum debt ceiling. This user has additional LPs currently deposited to Convex, and they (or other LPs) might be interested in further usage of Maker vault if more capacity becomes available. Considering this collateral has a similar risk profile to WSTETH-A vault type, it does not present outsize risk to significantly increase the maximum debt ceiling available. WSTETH-B: Increase stability fee to 0.5%  1412×640 48.8 KB  As indicated in last month’s proposal, stability fees for this vault type are being increased to reach parity with ETH-A. While the initial increase in rates has only been live for a few days, it has been proposed for around a month and during this time usage of the vault type increased significantly, indicating that marginally higher rates don’t negatively impact demand. It is expected that rates for this vault type will remain close to ETH-A going forward. RETH-A: Reduce stability fee to 0.5% and increase line to 10 million DAI  1418×644 33.1 KB  The RETH-A vault type has seen slow and steady usage since launch. With liquidity conditions improving and the vault and oracle having been proven out over a period of weeks, it is now suitable to pursue further growth. The reduction in stability fee along with increase in maximum debt ceiling are intended to spur new user acquisition among the Rocketpool community. It is expected that rates will be maintained at a level no higher than 0.5% for at least the next 3 months. WBTC-A: Reduce stability fee to 1.75%  1412×640 61.5 KB  Historically, large CeFi lenders have made up a significant share of WBTC-A vault usage, but with many of these businesses failing or seeing sharply lower demand from users, this source of minting has largely dried up. Reducing stability fees is intended to help grow more organic defi focused usage, and potentially encouraging migration from other protocols. A 0.25% spread between the corresponding ETH vault stability fee is maintained to account for custody risks. WBTC-B: Reduce stability fee to 3.25%  1400×642 47.6 KB  WBTC-B has seen fairly low utilization since launch. Reduction in stability fees should help make this vault type more attractive to defi users, and potentially allow for migration from other lending protocols, or from lower cost WBTC vault types at Maker. MATIC-A: Increase line to 15 million DAI  1408×642 51 KB  The debt ceiling for MATIC-A was reduced in the aftermath of the FTX collapse. With markets more stable and the largest vault user having significant overcollateralization, it is now safe to increase capacity. This change would leave roughly 800,000 DAI available to be minted against MATIC, which shouldn’t present significant liquidation risk while allowing Maker to see if further untapped demand for this vault type exists in the market. Compound v2 D3M: Increase line to 30 million DAI  1412×640 44.7 KB  Further increase in debt ceiling from 20 to 30 million DAI will allow Maker to take advantage of attractive total returns (currently around 2% including COMP rewards), while remaining far below the 30% of real supply max deposit target to mitigate liquidity risk. This can also help further improve user experience for DAI borrowers on Compound. Aave v2 D3M: Initialize new deployment with bar of 2%, gap of 5 million DAI, ttl of 12 hours, and line of up to 20 million DAI (when ready) The old deployment of the Aave v2 D3M has recently been decommissioned, and an updated version is expected to launch in the near future. Once live, it is proposed to initialize it with a target borrow rate of 2% (matching Compound v2 D3M), target available debt of 5 million DAI, cooldown period of 12 hours, and maximum debt ceiling of up to 20 million DAI. As this involves new code, PECU may recommend lower starting debt ceiling and target available debt parameters to minimize technical risk.  Forward Guidance on Parameter Changes Below are a set of forward guidance commitments on future parameter changes. This is intended to give vault users and other system stakeholders greater confidence to interact with the Maker protocol, which should help improve utilization and monetary policy effectiveness. Forward guidance commitments are non-binding on either PPG-OMC-001 or Maker governance, and simply represent the committee’s current intent towards parameter changes. We hope to build trust with stakeholders over time by adhering to forward guidance commitments wherever possible and clearly specifying conditions where guidance may be adjusted or terminated. RETH-A: Stability fees Stability fees on the above vault types should not be increased through April 30, 2023. This commitment will be terminated if (1) DAI generated from peg stability modules falls below 30% of total DAI supply, (2) the indicative risk premium of the RETH-A vault type (as determined by the risk core unit) rises 2% or more above the vault’s stability fee, or (3) the price of rETH falls below 0.97 ETH per each unit of ETH backing rETH.  Proposal Impact and Next Steps At current exposure levels, the proposed changes would lead to a roughly 240,000 DAI increase in annual protocol revenue (a 0.6% increase from current levels). However, net earnings may decline over the coming month if total DAI deposited into the DAI savings rate contract increases. In particular, Olympus DAO is expected to deposit ~70 million DAI in the near future, which would increase costs by 700,000 DAI per year. Proposed changes will be submitted for on chain polling next week. If approved, they will be included in the next available executive vote.  Notes:  Risk premiums and maximum debt ceilings are calculated based on recent market conditions Negative competitive rates are mostly due to liquidity mining rewards on Compound and Aave, as well as interest and rewards earned on deposited collateral Lending products are not standardized across defi and cefi lenders, and therefore rates can not be strictly compared on a like for like basis   Disclaimer and License: The recommendations and data presented here are provided for informational purposes only, on an “as is” basis, and without warranty of any kind. This is not intended or offered as financial, legal, regulatory, tax, or investment advice. The PPG-OMC-001 committee operates in a purely advisory capacity, and has no authority over system parameters as per MIP46. MKR voters and MakerDAO governance retain full control over parameter changes and are free to use or disregard this information as they see fit. Copyright and related rights waived via CC0. ",
                    "links": [
                        "https://forum.makerdao.com/u/primoz",
                        "https://forum.makerdao.com/u/longforwisdom",
                        "https://forum.makerdao.com/u/monet-supply",
                        "https://forum.makerdao.com/u/sebventures",
                        "https://forum.makerdao.com/u/hexonaut",
                        "https://forum.makerdao.com/u/ultraschuppi",
                        "https://forum.makerdao.com/u/rema",
                        "https://docs.google.com/spreadsheets/d/13xzTFelcZpDZgl6IcRmx-OQguZCmnuxb0NGYs9_I3Cs/edit?usp=sharing",
                        "https://maker.blockanalitica.com/defi/",
                        "https://coinalyze.net/ethereum/funding-rate/",
                        "https://www.ustreasuryyieldcurve.com/",
                        "https://makerburn.com/#/rundown",
                        "https://creativecommons.org/share-your-work/public-domain/cc0/",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/43",
                        "https://forum.makerdao.com/t/coldiron-eth-delegate-platform/11193/160",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/58",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/43",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/38",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806/48",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/121",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/86",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/96"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.457266206878009
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jasper_ETH",
                    "index": "#2",
                    "likes": "1",
                    "time": "03/02/2023-04:11:42",
                    "content": "Hi there! I wanted to extend my support for this proposal. The long-term potential for rETH is clear and with a lower fee plus the 3x supply potential of the Atlas upgrade for Rocket Pool, the vault should see tremendous growth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/husband_dong",
                    "index": "#3",
                    "likes": "0",
                    "time": "03/02/2023-09:53:54",
                    "content": "I fully support this proposal to decrease the fee for rETH from 1.5% to 0.5%. The reduction in stability fee will not only provide incentives for existing Rocketpool users to continue using rETH as their preferred collateral but also attract new users who are looking for a more cost-effective and reliable decentralized lending solution. Rocketpool’s reputation as the most decentralized and robust LSD is well deserved, and this proposal will help further solidify its position as a leading player in the DeFi space. By providing a lower fee structure, the community will be able to benefit from a more accessible, secure, and efficient lending platform, which will ultimately contribute to the growth and success of Rocketpool as a whole. I also appreciate the commitment to maintaining stability fees at 0.5% for the next 3 months, which provides additional stability and certainty for users looking to adopt rETH as their collateral of choice. Overall, I believe that this proposal represents a positive step forward for Rocketpool and the DeFi community, and I fully support its implementation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.212878787878788
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "3",
                    "time": "07/02/2023-13:56:14",
                    "content": "Flip Flop Flap Delegate LLC will support the current Poll, but does not support a Stability Fee decrease for rETH. We believe RETH-Vault has not proven that it can scale as a collateral type. Hope to be proven wrong, but even the rETH liquidity pool for wETh/rEth on Velodrome (OP) was a disappointment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.1666666666666665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#5",
                    "likes": "3",
                    "time": "07/02/2023-15:47:04",
                    "content": "Appreciate your perspective! rETH has had trouble scaling up supply so far, but upcoming protocol changes (such as lowering required ETH from validator operators from 16 ETH to 8 ETH) could help with this a lot. Personally I think it is worth a shot, and DAI from rETH is small enough now that there is barely any hit to revenue from temporarily dropping stability fee. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "0",
                    "time": "07/02/2023-16:11:52",
                    "content": "Beginning to understand that Dust Parameters are just too high, or opening Vaults on L1 is no longer attractive to Retail. There’s also a lack of marketing to such. It can also be the current environment in DeFi (un-attractable yields). But yes, let’s see what develops. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "21/02/2023-16:12:15",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-22-february-2023/19936",
            "title": "Parameter Changes Proposal - PPG-OMC-001 - 22 February 2023 ",
            "index": 19936,
            "category": [
                "Updates"
            ],
            "tags": [
                "rates",
                "rates-working-group",
                "ppg-omc-001",
                "ppg"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "6",
                    "time": "23/02/2023-22:34:41",
                    "content": "Parameter Proposal Group: MakerDAO Open Market Committee  Authors: @Primoz @LongForWisdom, @Monet-supply, @SebVentures, @ultraschuppi, @rema, (and @ChrisB in an advisory capacity)  1600×632 248 KB  Source: Risk Premiums & Competitive Rates - Updates for March 2023  Lending Market Overview Borrowing rates are broadly higher across competing defi lending protocols over the past month. This corresponds to an increase in market bullishness and risk appetite, as demonstrated by significant price appreciation in certain altcoins (particularly liquid staking and arbitrum related tokens).  1338×754 77.2 KB  Source: Blockanalitica Dashboard Aave has added additional assets to their Ethereum v3 market, including cbETH and rETH, which could lead to increasing competitive pressure vs Maker’s liquid staking collateral vaults. However, borrowing costs are generally higher for stablecoins at Aave and most liquid staking collateral seems to be used to borrow ETH rather than stables. Alongside increase in stablecoin borrowing costs on defi protocols, perpetuals and centralized funding costs have increased over the past month.  1396×1230 79 KB  Source: Coinalyze General financial conditions continue to tighten, and move towards a “higher for longer” paradigm for USD benchmark rates. This has been driven by persistent inflation and high asset prices forcing the Fed’s hand on maintaining and further increasing rates. Essentially, the gap between the Fed’s hawkish dot plot and more dovish market expectations have narrowed as market rates more closely reflect stated intentions towards rate policy. The below charts show how expected rates have increased across the curve in the past month. As benchmark rates rise, this arguably makes defi lending more competitive from a cost perspective, but may also constrain values of crypto asset collateral which are generally considered long duration assets.  1600×867 64.4 KB   1544×864 43.5 KB  Treasury Yield Curve With OlympusDAO’s recent deposit to the DSR, total deposits have broken through 100 million DAI. Further deposits are likely as defi protocols or other large holders take advantage of the current DAI savings rate. Particularly, integrations from secondary lending markets including Aave, Compound, and Euler could lead to hundreds of millions in idle DAI being added to the DSR. This would increase Maker’s cost of capital, but should also make DAI a more attractive and competitive asset for end users.  Proposed Changes This month’s proposal includes several debt ceiling increases for vaults that have reached their max capacity, as well as stability fee changes to realign vaults based on risk or encourage growth. Impact on revenue is fairly minimal. Accompanying images are gathered from Makerburn. ETH-C: Increase stability fee to 0.75%  1368×642 75.4 KB  With utilization of the DSR increasing, and greater potential for Maker to drive revenue with alternative RWA structures, it is proposed to increase stability fees for low rate vault types. This will help Maker to improve balance sheet utilization and efficiency. Rates on ETH-C will remain among the lowest available in defi, which should help reduce likelihood of significant user attrition. WSTETH-B: Increase stability fee to 0.75%  1372×640 64.3 KB  Similar to above, stability fees for this vault type are proposed to be increased to get closer to the DSR rate and improve balance sheet utilization. This vault type would remain the least costly mechanism for borrowing against stETH after this change. WBTC-C: Increase stability fee to 1%  1374×644 58.7 KB  Similar to above, stability fees for this vault type are proposed to be increased to reach parity with the DSR rate and improve balance sheet utilization. This vault would remain among the least costly mechanisms to borrow against WBTC. RETH-A: Increase line to 20 million DAI  1374×650 43.7 KB  With the last proposal’s reduction in stability fee for a 3 month period, it is expected that RETH-A could see significant growth in usage and demand. As liquidity conditions for RETH have improved markedly, it is proposed to increase the maximum debt ceiling from 10 million DAI set in the previous proposal to 20 million DAI. YFI-A: Increase line to 4 million DAI, and increase stability fee to 1.5%  1374×630 76.9 KB  The YFI-A vault currently has the lowest stability fee among non-large cap vault types. The proposed stability fee increase will help drive additional protocol revenue, while still maintaining acceptable cost levels for vault users. In particular, Yearn is currently earning around 5% depositing drawn DAI to Gearbox, indicating they should still have a sufficient yield spread to maintain their usage. The increased stability fee will also counterbalance potential increase in risk premium if the additional 1 million DAI in available debt ceiling is utilized. Compound v2 D3M: Increase line to 70 million DAI  1376×640 62.3 KB  The Compound v2 D3M has been operating successfully for several months, and recently supply rates have increased as market conditions have grown more bullish. Given a real supply (excluding recursive positions) of roughly 320 million DAI, Maker can increase liquidity significantly without reaching liquidity thresholds previously specified by the community. It is proposed to increase the maximum debt ceiling from 30 million to 70 million DAI to increase DAI usability on Compound v2 and drive increase in protocol revenue. Aave v2 D3M: Increase line up to 20 million DAI when ready The old deployment of the Aave v2 D3M has been decommissioned, and an updated version is being launched with an initial debt ceiling of 5 million DAI. Once the new D3M mechanism has seen sufficient usage in production to gain confidence in its safety, it is proposed to increase the maximum debt ceiling as high as 20 million DAI. PECU is empowered to limit debt ceiling increases at their discretion. This item is unchanged from the past parameter change proposal.  Forward Guidance on Parameter Changes Below are a set of forward guidance commitments on future parameter changes. This is intended to give vault users and other system stakeholders greater confidence to interact with the Maker protocol, which should help improve utilization and monetary policy effectiveness. Forward guidance commitments are non-binding on either PPG-OMC-001 or Maker governance, and simply represent the committee’s current intent towards parameter changes. We hope to build trust with stakeholders over time by adhering to forward guidance commitments wherever possible and clearly specifying conditions where guidance may be adjusted or terminated. RETH-A: Stability fees Stability fees on the above vault types should not be increased through April 30, 2023. This commitment will be terminated if (1) DAI generated from peg stability modules falls below 30% of total DAI supply, (2) the indicative risk premium of the RETH-A vault type (as determined by the risk core unit) rises 2% or more above the vault’s stability fee, or (3) the price of rETH falls below 0.97 ETH per each unit of ETH backing rETH.  Proposal Impact and Next Steps At current exposure levels, the proposed changes would lead to a roughly 1,750,000 DAI increase in annual protocol revenue (a 4.2% increase from current levels). However, net earnings may decline over the coming month if total DAI deposited into the DAI savings rate contract increases. OlympusDAO’s recent DSR deposit has increased cost by roughly 700,000 DAI per year, and integrations with other protocols such as lending markets could lead to further significant increases in DSR cost. Proposed changes will be submitted for on chain polling next week. If approved, they will be included in the next available executive vote.  Notes:  Risk premiums and maximum debt ceilings are calculated based on recent market conditions Negative competitive rates are mostly due to liquidity mining rewards on Compound and Aave, as well as interest and rewards earned on deposited collateral Lending products are not standardized across defi and cefi lenders, and therefore rates can not be strictly compared on a like for like basis   Notes on Endgame and PPG-OMC-001 The PPG-OMC-001 group and current parameter change proposal process may be significantly impacted by the endgame plan. Expected areas of impact include:  Constraints on setting stability fees based on the stability and liquidity, decentralized collateral, and RWA scopes Requirement to offboard certain vault types that are not considered strategically important and fail to meet required minimum revenue thresholds, or sustain usage at required levels of stability fee Possible removal of or changes to MIP46, which is the current mechanism allowing for PPG-OMC-001 proposals to be added to the weekly governance cycle  Endgame MIPs have not yet been adopted, and even after adoption would not necessarily prevent this group from meeting for informal discussions and to provide information to the broader Maker community. Members of PPG-OMC-001 feel the group serves as a valuable forum for discussing risk, competition, and strategic considerations. We will continue to meet on a monthly basis and provide updates and parameter change proposals for the foreseeable future.  Disclaimer and License: The recommendations and data presented here are provided for informational purposes only, on an “as is” basis, and without warranty of any kind. This is not intended or offered as financial, legal, regulatory, tax, or investment advice. The PPG-OMC-001 committee operates in a purely advisory capacity, and has no authority over system parameters as per MIP46. MKR voters and MakerDAO governance retain full control over parameter changes and are free to use or disregard this information as they see fit. Copyright and related rights waived via CC0. ",
                    "links": [
                        "https://forum.makerdao.com/u/primoz",
                        "https://forum.makerdao.com/u/longforwisdom",
                        "https://forum.makerdao.com/u/monet-supply",
                        "https://forum.makerdao.com/u/sebventures",
                        "https://forum.makerdao.com/u/ultraschuppi",
                        "https://forum.makerdao.com/u/rema",
                        "https://docs.google.com/spreadsheets/d/1s8I_Be1nwauAsXfQzEDfqnTb5zid3zw1Vz5eE5G5yAI/edit?usp=sharing",
                        "https://maker.blockanalitica.com/defi/",
                        "https://coinalyze.net/ethereum/funding-rate/",
                        "https://www.ustreasuryyieldcurve.com/",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/mip46-parameter-proposal-groups/6341",
                        "https://creativecommons.org/share-your-work/public-domain/cc0/",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/102",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/48",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-february-2023/20011",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/124",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/64",
                        "https://forum.makerdao.com/t/coldiron-eth-delegate-platform/11193/167",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/43",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806/54",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/42",
                        "https://forum.makerdao.com/t/mip104-the-decentralized-collateral-scope-framework/19685/4",
                        "https://forum.makerdao.com/t/4-boletin-de-noticias-febrero-de-2023/20078"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4387572150072145
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#2",
                    "likes": "5",
                    "time": "24/02/2023-11:35:56",
                    "content": "I’m happy to put this up next week; I’m just aware that it’s during ETH Denver, and I told the delegates yesterday that I wasn’t expecting any weekly votes. @Recognized-Delegates, pinging to let you know this will be going up on Monday. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "10/03/2023-11:36:33",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-5-january-2023/19327",
            "title": "Parameter Changes Proposal - PPG-OMC-001 - 5 January 2023 ",
            "index": 19327,
            "category": [
                "Updates"
            ],
            "tags": [
                "rates",
                "rates-working-group",
                "ppg-omc-001",
                "ppg",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "8",
                    "time": "05/01/2023-23:37:56",
                    "content": "Parameter Proposal Group: MakerDAO Open Market Committee  Authors: @Primoz @LongForWisdom, @Monet-supply, @SebVentures, @hexonaut, @ultraschuppi, @rema  1600×800 307 KB  Source: Risk Premiums & Competitive Rates - Updates for January 2023  Lending Market Overview Rates across defi protocols have remained fairly steady over the past month, with just a slight downtick in rates for borrowing against ETH across primary competitors Compound and Aave. However, the lending market overall has changed significantly, with fewer long tail assets supported as collateral in response to Avi Eisenberg’s attempted market manipulations and general drop in liquidity for smaller assets.  1326×744 76.2 KB  Source: Blockanalitica Dashboard Compound has halted new deposits for BAT, MKR, YFI, and ZRX, and has tightly limited total amount that can be borrowed for most non-stablecoin assets. Aave has frozen deposits for many long tail assets including MANA and YFI, and has also disabled new borrows for additional assets that can still be deposited such as CRV and LINK. Euler had a smaller list of collateral assets to begin with, but has made the decision to delist LINK and UNI as collateral. The Treasury Yield Curve has stabilized somewhat with rate expectations over the next several years roughly flat since last meeting. But, the current federal funds rate has risen and at least one more rate rise is expected before reaching the expected terminal rate of around 4.5%. Due to the rate differential between defi and risk free tradfi rates, the crypto space may continue to see fund outflows. Funding on ETH perps has begun to recover into positive territory as the market has traded in a tight range for the past month, with quarterly futures basis also slightly positive. This indicates growing demand for long positioning that could carry over to defi protocols.  1600×731 74.1 KB  Source: Coinalyze Withdrawals remain frozen at Genesis, with pass through user deposits through Gemini Earn and others also inaccessible. With Genesis inactive, the cefi lending space has now faced near complete collapse over the past year. While this reduces competition, historically cefi lenders have also been some of the largest users of defi protocols through rehypothecation of user collateral, so this could present a headwind to utilization in the near term. The DAI savings rate contract saw a rate increase from 0.01% to 1% in the last parameter change proposal. For most of the past month, TVL growth was very low with only around 1 million DAI in additional deposits since the rate increase. But in the past day roughly 30 million DAI was added to the DSR, and further increases are expected as external protocols (defi lending platforms, bridges, etc) begin to integrate the DSR for idle DAI funds.  Proposed Changes This proposal would reactivate the Aave D3M with a modest debt ceiling, increase the debt ceiling for the Compound v2 D3M, begin gradually normalizing stability fees for the WSTETH-B vault type, and increase fees on the USDP PSM to avoid growth in exposure. Based on current exposure levels and market conditions, these changes would lead to a roughly 525,000 DAI increase in annual revenue, along with increase in COMP rewards accruing to the Maker treasury from the Compound D3M. Accompanying images are gathered from Makerburn. WSTETH-B: Increase stability fee to 0.25%  The WSTETH-B stability fee was previously reduced to 0% to try to grow usage. However, we’ve seen that a large portion of minting after this change was simply exposure being migrated from the WSTETH-A vault, and didn’t represent net new usage. Considering that risk posed by this vault type is at least as high as the ETH-C vault and the 0% rate didn’t drive significant gains in usage, we are proposing to slowly raise stability fees on this vault type, beginning with a 0.25% increase this month. We expect to propose further gradual increases in the future until the stability fee reaches parity with ETH-C. Compound v2 D3M: Increase line to 20 million DAI, set gap of 5 million DAI  The Compound v2 D3M has been operating for the past month without any issues. Increasing the maximum debt ceiling to 20 million will allow Maker to generate additional revenue through this facility and deepen available DAI liquidity for Compound users. Total D3M deposits are still far below the 30% of real supply threshold, limiting liquidity risk. Additionally, Compound has recently tightened risk parameters on long tail assets, which further reduces risk of loss. Aave v2 D3M: Reactivate with bar of 2%, line of 20 million DAI, and gap of 5 million DAI  Aave has significantly derisked their v2 Ethereum market over the past month, with delisting of low liquidity assets and tightening of risk parameters. Given these improvements, now is a good time for Maker to reactivate this D3M to grow revenues while improving user experience of DAI borrowers on Aave. Proposed 20 million debt ceiling is well below the 30% of real supply maximum exposure threshold. Protocol engineering may want to move to the updated D3M architecture before reactivating the debt ceiling for Aave v2, and we support any PE decision on this matter. PSM-USDP-A: Increase tin to 0.2%  USDP has relatively lower on-chain usage and liquidity versus Maker’s primary liquidity asset USDC. And unlike GUSD, Paxos has not committed to revenue sharing or other additional benefits to Maker. Increasing the fee in parameter (tin) to 0.2% from current 0.1% should limit increases in USDP exposure, helping to concentrate Maker’s liquidity position in assets that provide more value to the protocol.  Proposal Impact and Next Steps At current exposure levels, the proposed changes would lead to a roughly 525,000 DAI increase in annual protocol revenue (a 5% increase from current levels). However, net earnings may decline over the coming month if total DAI deposited into the DAI savings rate contract increases. Proposed changes will be submitted for on chain polling next week. If approved, they will be included in the next available executive vote.  Notes:  Risk premiums and maximum debt ceilings are calculated based on recent market conditions Negative competitive rates are mostly due to liquidity mining rewards on Compound and Aave, as well as interest and rewards earned on deposited collateral Lending products are not standardized across defi and cefi lenders, and therefore rates can not be strictly compared on a like for like basis   Disclaimer and License: The recommendations and data presented here are provided for informational purposes only, on an “as is” basis, and without warranty of any kind. This is not intended or offered as financial, legal, regulatory, tax, or investment advice. The PPG-OMC-001 committee operates in a purely advisory capacity, and has no authority over system parameters as per MIP46. MKR voters and MakerDAO governance retain full control over parameter changes and are free to use or disregard this information as they see fit. Copyright and related rights waived via CC0. ",
                    "links": [
                        "https://forum.makerdao.com/u/primoz",
                        "https://forum.makerdao.com/u/longforwisdom",
                        "https://forum.makerdao.com/u/monet-supply",
                        "https://forum.makerdao.com/u/sebventures",
                        "https://forum.makerdao.com/u/hexonaut",
                        "https://forum.makerdao.com/u/ultraschuppi",
                        "https://forum.makerdao.com/u/rema",
                        "https://docs.google.com/spreadsheets/d/1KEixg0MZ1fA5fzQhvXumj_5DvhMdNrtMtOUDryVCe6I/edit?usp=sharing",
                        "https://maker.blockanalitica.com/defi/",
                        "https://www.ustreasuryyieldcurve.com/",
                        "https://coinalyze.net/ethereum/funding-rate/",
                        "https://makerburn.com/#/rundown",
                        "https://makerburn.com/#/collateral/WSTETH-B",
                        "https://makerburn.com/#/collateral/DIRECT-COMPV2-DAI",
                        "https://makerburn.com/#/collateral/DIRECT-AAVEV2-DAI",
                        "https://makerburn.com/#/collateral/PSM-PAX-A",
                        "https://creativecommons.org/share-your-work/public-domain/cc0/",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/12",
                        "https://forum.makerdao.com/t/calblockchain-delegate-platform/18407/12",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806/40",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/86",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/35",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/146",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/35",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/30",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/47",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-january-2023/19632"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.281454339311482
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "19/01/2023-23:38:40",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2059"
}