{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/statement-regarding-b-protocol-v2-and-maker-integration-and-risk-considerations/13257",
            "title": "Statement regarding B.Protocol v2 and Maker integration and risk considerations ",
            "index": 13257,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "discussion",
                "governance",
                "bprotocol",
                "wbtc-b"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#1",
                    "likes": "9",
                    "time": "15/02/2022-16:28:41",
                    "content": "This is a follow up to [WBTC-B] and [WBTC-BProt-A]: Review and Plan of Action and the latest B.Protocol v2 Declaration of Intent from risk perspective. After observing activity of low LR WBTC-B vault for some time now and further evaluating applications of integration with B.Protocol v2 and it’s BAMM mechanism we have decided to recommend freezing the declaration of intent to integrate until further notice due to the reasons listed below. From the risk perspective, we believe that this integration has actually no downside. In the worst case, where liquidations into BAMM fail, the liquidations would revert to regular Maker collateral auctions, so the BAMM mechanism can be seen as an additional protective layer. Nevertheless we have doubts about dai demand for BAMM, especially if we would want to scale this integration into hundreds of millions of dai minted. Additionally, dai deposited into BAMM is effectively reducing supply on the market and adds pressure to dai premium and increases PSM stablecoin reserves. Main arguments why we believe this proposal should be delayed: (i) Lack of potential of B.Protocol v2 to scale to sufficient level required by Maker. The BAMM mechanism of the B.Protocol requires sufficient dai committed at all times to the contract in order to achieve the potential of the system; enabling Maker to liquidate vaults into dai liquidity and thus adding an additional layer of protection against bad debt. Based on the conversation with the B.Protocol team, they have about 5m dai committed from different entities. Current liquidity committed is not sufficient enough to launch a new vault type with significant enough debt ceiling and we are not convinced that there is general demand for supplying dai into the BAMM contract in general, thus we have our doubt about scalability of the product. (ii) We have concerns such as that dai can be withdrawn at any time from the BAMM contract, meaning that there is no guarantee that the dai suppliers will actually follow through with a large market drawdown. As an example, stakers in Aave’s Safety Module, can withdraw their asset after 10 days has passed since the withdrawal was requested; this waiting period exists in order to prevent participants from withdrawing the liquidity when it is needed the most. (iii) General lack of demand for higher leverage demonstrated by the low LR WBTC-B vault. Since inception of the vault in November last year, the vault type newer exceeded more than 3.1m dai minted and currently only has 9 users, of which only 6 exceed more than 100k debt minted. Therefore, we believe that generally speaking demand for high leverage or low liquidation ratio requirements is smaller than initially anticipated by the community. It could be the case that the stability fee is too high for the product to be competitive with various venues that offer leveraged positions cheaper. With added risk mitigation from B.Protocol the risk premium of the vault type would be lower compared to WBTC-B, which means we could offer lower stability fee, but at the same time, we risk the situation where instead of attracting new users and increasing total dai minted in the system, current users from higher liquidation ratio vaults migrate to the lower one integrated with B.Protocol and we subsequently reduce Maker’s revenue. On top of that, rates at Maker are already very low. In the Risk CU we believe that benefits from integrating with B.Protocol v2 at current time does not outweigh the opportunity cost of resources needed to achieve that (governance overhead of launching and maintaining this vault), as we believe that the debt ceiling of such a vault would be restricted due to lack of dai liquidity in the BAMM contract and questionable potential for increasing it via market incentives. Additionally, general demand for such a product is also questionable demonstrated by WBTC-B. TL;DR If B.Protocol can demonstrate high demand for dai locked in BAMM and implements time lock mechanism, we think this proposal has more potential of being implemented sooner, but for the time being we think CU resources would be better spent by focusing on L2 and D3M type of modules. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp11-onboarding-a-new-collateral-type-backed-by-b-protocol-v2-declaration-of-intent/8802",
                        "https://forum.makerdao.com/t/the-risk-core-unit-2022-year-in-review/19372",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-february-2022/13512",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-10-17-2022/13292"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1660522810522815
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/02/2022-17:07:07",
                    "content": "tldr: Gamblers should use dydx perpetuals? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#3",
                    "likes": "2",
                    "time": "15/02/2022-18:30:42",
                    "content": "Thanks for the detailed respond. To quickly answer (i) and (ii), B.Protocol thus far demonstrated its ability to get over $200m in user deposits for other products we have (around $120m of it to other BAMMs). The $5m is an initial hard commitment to bootstrap things, and it is hard to expect a bigger commitment given WBTC-B total debt is below $5m… As for implementing a deposit lock mechanism this is also something we can address. But the bottom line is that it seems the demand for new vaults is currently not high. When we started this initiative it was high, and it is not unlikely it will become high again at the future. We understand the prioritisation from the CU side, and at this point we also lack the bandwidth to implement and audit everything. But given once there will be a demand, additional iteration will likely takes month, it might help to setup tentative timelines for the next iteration, and have the integration ready by the time demand is high. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.282467532467533
                }
            ]
        }
    ]
}