{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip38-dao-primitives-state/6095",
            "title": "MIP38: DAO Primitives State ",
            "index": 6095,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "core-unit",
                "operating-model"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#1",
                    "likes": "7",
                    "time": "18/01/2021-21:27:28",
                    "content": "MIP38: DAO Primitives State Preamble MIP#: 38 Title: DAO Primitives State Author(s): @juanjuan Contributors: @elprogreso, @iammeeoh Type: Informational Status: Formal Submission Date Proposed: <2021-01-18> Date Ratified: <yyyy-mm-dd> Dependencies: MIP39, MIP40, MIP41, MIP4c2-SP10, MIP4c2-SP12 Replaces: n/a  References N/A Sentence Summary DAO Primitives State is a MIP that keeps track of all the states related to Core Units, Budgets and Facilitators. Paragraph Summary DAO Primitives State is a MIP that keeps track of the current state related to Core Units, Budgets and Facilitators. The state of the Primitives is maintained in the DAO Primitives MIP. The Primitives cannot be modified through this MIP but by the corresponding dedicated MIP Component in the MIP Set. Component Summary MIP38c1: Core Unit State Maintenence This component defines the Core Unit State list, its format and its upkeep. MIP38c2: Core Unit State The component that contains all of the DAO Primitives State, with Core Units as the key. Motivation This MIP lays down a basic structure based on Core Units (MIP39) capable of supporting the increasing complexity of the DAO and its continuous expansion. It also documents and keeps track of the state of the elements that make up this new structure and their dependencies. Under its stripped-down, homogeneous nature, this structure avoids the hassle of ad-hoc implementations that are hard to analyze and interface. Thinking forward, it also provides Governance with a straightforward process to fund teams beyond the dissolution of the Foundation. Specification / Proposal Details MIP38c1: Core Unit State Maintenence This dataset contains all of the Core Units approved by the community, alongside the Core Units’ data. It includes:  Core Unit Mandates Budget Implementation and Breakdown Facilitator name, information, and commitment. Key Dates  This dataset is updated by the MIP Editors when a subproposal from MIP39, MIP40, or MIP41 becomes accepted. List Entry Template:  NAME-XXX ID - XXX# (assigned by the Operational Support Core Unit or a MIP Editor) Summary - 30 word max summary. Date Ratified -  Mandate - MIP39c2-SPX Budget Amount - xxx,xxx DAI / year Budget Implementation - Manual/Simple/Advanced - MIP40c2-SPX Budget Breakdown - MIP40c2-SPX Facilitator A - Awes M. Example - MIP41c2-SPX Facilitator B - Gre T. Example - MIP41c2-SPY …  MIP38c2: Core Unit State There are currently no active Core Units. Entry ‘EXMPL-000’ exists as an example for formatting Core Unit State Entries.  EXMPL-000 Example Core Unit - Provides a decent descriptive name for a Core Unit example. Summary - Provides an awesome and great example of a Core Unit List template. Date Ratified -  1970-01-01 Mandate - MIP39c2-SP0 Budget Amount - 100,000 DAI / year Budget Implementation - Manual - MIP40c2-SP0 Budget Breakdown - MIP40c2-SP0 Facilitator A - Awes M. Example - MIP41c2-SP0 Facilitator B - Gre T. Example - MIP41c2-SP00     Edit: Incorporated feedback for clarity, added to my github (accepting PRs) and also PRed the Maker Github. Thanks to @blimpa, @Deimos, @LongForWisdom, and everyone else that helped with the revision. Edit2: removed the MIP4c2-SP11 from dependencies, moved to formal submission. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-37-en-espanol/7168",
                        "https://forum.makerdao.com/t/maker-relay-ep-37/7154",
                        "https://forum.makerdao.com/t/weekly-mips-update-30/7083",
                        "https://forum.makerdao.com/t/maker-relay-ep-36-en-espanol/7053",
                        "https://forum.makerdao.com/t/maker-relay-ep-36/7039",
                        "https://forum.makerdao.com/t/weekly-mips-update-29/7000",
                        "https://forum.makerdao.com/t/maker-relay-ep-35-en-espanol/6949",
                        "https://forum.makerdao.com/t/maker-relay-ep-35/6932",
                        "https://forum.makerdao.com/t/maker-relay-ep-34-en-espanol/6815",
                        "https://forum.makerdao.com/t/maker-relay-ep-34/6802",
                        "https://forum.makerdao.com/t/weekly-mips-update-28/6791",
                        "https://forum.makerdao.com/t/maker-relay-ep-33-en-espanol/6729",
                        "https://forum.makerdao.com/t/maker-relay-ep-33/6694",
                        "https://forum.makerdao.com/t/weekly-mips-update-27/6649",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106",
                        "https://forum.makerdao.com/t/maker-relay-ep-32/6596",
                        "https://forum.makerdao.com/t/maker-relay-ep-31-en-espanol/6455",
                        "https://forum.makerdao.com/t/maker-relay-ep-31/6450",
                        "https://forum.makerdao.com/t/maker-relay-ep-30-en-espanol/6360",
                        "https://forum.makerdao.com/t/maker-relay-ep-30/6303",
                        "https://forum.makerdao.com/t/maker-governance-review-january-2021/6296",
                        "https://forum.makerdao.com/t/weekly-mips-update-26/6291",
                        "https://forum.makerdao.com/t/maker-relay-ep-29-en-espanol/6220",
                        "https://forum.makerdao.com/t/maker-relay-ep-29/6214",
                        "https://forum.makerdao.com/t/discussion-disengagement/6173/5",
                        "https://forum.makerdao.com/t/know-your-mip-kym-03-the-core-operating-unit-model-monday-jan-25-2021-at-20-00-utc/6146",
                        "https://forum.makerdao.com/t/maker-relay-ep-28-en-espanol/6124",
                        "https://forum.makerdao.com/t/maker-relay-ep-28/6118",
                        "https://forum.makerdao.com/t/maker-relay-ep-32-en-espanol/6600"
                    ],
                    "GPT-summary": "The post is a formal submission of MIP38, which proposes a structure based on Core Units capable of supporting the increasing complexity of the DAO and its continuous expansion. It also documents and keeps track of the state of the elements that make up this new structure and their dependencies. The post includes details of the proposal, such as the dataset containing all of the Core Units approved by the community, alongside the Core Units’ data, and the component that contains all of the DAO Primitives State, with Core Units as the key. The post also incorporates feedback for clarity and is accepting PRs.",
                    "GPT-proposal-categories": [
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.808080808080808
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "3",
                    "time": "20/01/2021-01:10:11",
                    "content": "Thoughts  Title can be better, it wasn’t immediately clear. Maybe MIP38: State of Core Units? What other DAO primitives are there beyond Core Units? It seems this MIP is designed to include more in the future.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.9750000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "0",
                    "time": "20/01/2021-15:30:55",
                    "content": "    juan:  Motivation The DAO Primitives State makes it very easy to get an overview of the current state of DAO Primitives by providing a single place to see all the important variables approved by Maker Governance.   Should go into more detail. This shouldn’t be solely the benefits of , but rather why it’s important to do this thing and why we’re doing this important thing in this way and not some other way.     juan:  MIP38c1: Core Unit State   I would suggest splitting this into components for each of the core primitives. IE, a list of Facilitators, a list of Core Units, and a list of approved budgets. I’m aware that many of these will contain duplicate information, but it would be nice for governance / any users to be able to see a clear list of all the facilitators, all of the core units, all of the budgets, etc separately.     juan:  This list contains all of the Core Units approved by the Community, alongside the core data associated with the Core Units: Core Unit Mandate, Budget Implementation and Breakdown, Facilitator name and information, and their commitment.   Who is responsible for keeping this MIP up to date? What is a budget implementation versus a budget breakdown? Would a glossary or definitions component be useful here? I think a one sentence explanation with a link to the MIP containing the full details would be useful.     juan:  Some of these entries can be lists containing multiple elements, or long form text.   Lists of elements and/or long form text don’t lend themselves well to a list entry with a defined structure. I feel like you could maybe avoid this via having separate lists for each DAO primitive. For example, the facilitator list would list which Core Units the Facilitator was heading, the details of which could then be in the Core Unit list.     juan:  Facilitator Commitment   Not sure what this is at this point. Again, glossary might be useful.  I would suggest that each facilitator be required to publish a permissions address that can be used as keys for any multi-sig or permissions related to their Core Unit(s). These should be included in the list of Facilitators. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.112370600414079
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#4",
                    "likes": "0",
                    "time": "01/02/2021-15:28:06",
                    "content": "Edited incorporating feedback + PR in github. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}