{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/pregame-constitution-breakout-groups-document-2023-02-09/19769",
            "title": "Pregame Constitution Breakout Groups Document - 2023-02-09 ",
            "index": 19769,
            "category": [
                "Governance"
            ],
            "tags": [
                "artifact"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "3",
                    "time": "09/02/2023-18:25:13",
                    "content": "Adding a thread to link any learnings and artifacts from our break out groups today, feel free to continue the discussion here  ",
                    "links": [],
                    "GPT-summary": "The post is an explanation of a document called \"Pregame Constitution Breakout Groups Document\" and the author is inviting others to contribute to the discussion and share their learnings and artifacts from the breakout groups.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaveringtonPLLC",
                    "index": "#2",
                    "likes": "1",
                    "time": "09/02/2023-19:05:22",
                    "content": "That was a superb re-design of the G&R call, bravo and thank you. Thought I’d drop a few bullet points I raised in Group #2 on Accountability   Does the Endgame need a separate judiciary branch mechanism for Constitutional Interpretation? Excellent comments here by @Matt_NZ . MKR holders generally will not have the in-depth knowledge of the Constitution and what it requires to perform this function and adjudicate. Meanwhile other specified participant roles are potentially conflicted as described in the Forum comment .   Interpretation of what the Constitution requires is a separate matter from another challenge of interpreting and enforcing compliance with agreements to perform work. Project based funding restructuring such as with DLOs should help make activities, responsibilities and oversight easier, which begs the question…   Who are the actual people that will dedicate the full time effort to learn the Endgame, build it during the Pregame, and remain neutral so as to represent MakerDAO’s interest purely in its entirety? Workforce that needs to plan for survival by forming businesses that compete for access to MakerDAO funding cannibalizes the pool of those most trusted and informed to help build the new system.   Trouble with Endgame: Even if it is the most brilliant scientific design to solve all the problems of humanity, is it adoptable? Are there enough persons with good incentives to devote the time and expertise needed over the next 24 months, especially in a capacity that can credibly and neutrally hold all participants accountable?   The plan is presented and approached by some in the community with the spirit of a brand new project requiring verve, sacrificial enthusiasm and idealism of crypto circa 2014. The reality is now one of any industry in a matured stage of adoption and the consequential risks. Billions of value stand to be leverage for the benefit of a select few.   ***To expect a person to sacrificially give to the Endgame preparations and build this value without proper compensation and proof of social values that give all equal and fair access to reward is to expect people should be okay with their value as a contributor being exploited for the benefit of others who are institutionally wealthy, OG or otherwise favored by insiders. The greening of the Preamble does not magically solve this. ",
                    "links": [
                        "https://forum.makerdao.com/t/how-dlos-will-inspire-core-units-ecosystem-actors-to-become-entrepreneurs/19677"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.240891053391053
                }
            ]
        }
    ]
}