{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/jan19-23-post-mortem-for-governance-portal-issues/19506",
            "title": "[Jan19 '23] Post-Mortem for Governance Portal issues ",
            "index": 19506,
            "category": [
                "Updates"
            ],
            "tags": [
                "governance-portal",
                "post-mortem",
                "dux-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#1",
                    "likes": "10",
                    "time": "20/01/2023-16:47:18",
                    "content": " Summary  On January 19th 2023 at 1:46pm UTC time the DUX team discovered an issue loading certain pages on the Governance Portal, caused by time-out errors. Multiple community members also reported issues loading the Governance Portal in the following minutes. Upon investigation together with the TechOps team we found out about spiking network requests to the Governance Portal API and gov-polling-db database, which caused the infrastructure to be maxed out. We restarted the API and database, but this did not resolve the issue. We then decided to upgrade the database instance size and container size & numbers, which made the Governance Portal and aforementioned database functional again. Upon further investigation (after the issue was resolved) we have reasons to believe the issues were caused by a (D)DoS attack.   Background On January 19th 2023 at 1:46pm UTC time the DUX team discovered an issue loading certain pages on the Governance Portal. The issue was discovered when trying to access an address detail page (vote.makerdao.com/address/x) which returned a 504 error. Upon further investigation the issue seemed more widespread and also impacting older poll detail pages. In the following minutes community members also reported issues related to the performance of the Governance Portal. The DUX team started investigating and also reached out to TechOps, who joined the investigation. We soon learned that the Voting Portal was dealing with time-out issues caused by dramatic increases in the number of requests sent to the Governance Portal API and the gov-polling-db database. This caused the underlying infrastructure to be maxed out. The requests originated from the Governance Portal domain, but the nature of the activity was not clear until after a temporary solution was introduced and further analysis was performed.  Detailed Analysis When DUX and TechOps started investigating we soon discovered the huge spikes in network requests to the Governance Portal API and gov-polling-db database, and the high strain on the underlying infrastructure (ie. TechOps members found the API and db CPUs maxed out), which caused the Governance Portal to time out. When looking into the requests that were clogging up the infrastructure we learned that the requests were coming from the Governance Portal app domain. Upon deeper digging into our logging system we discovered a lot of unusual requests coming from a particular IP address located in France, registered by someone from the Philippines. The requests do not seem like they were generated through organic use of the Governance Portal webapp, thus we have reasons to believe these requests were generated as part of a (D)DoS attack. This also lines up with other unusual alerts coming from automated monitoring on other components, earlier this week. As described below, we’re now expediting work on a better firewall solution for the Governance Portal.  Mitigation Steps We’ve discovered that parameter validation is missing on some endpoints, which we are currently working to mitigate. We have also enabled more granular logging together with TechOps, which will help simplify the root cause analysis future scenarios. Next week we’re also collaborating with TechOps to assess where we can further improve our monitoring and logging setup for the entire backend. Lastly, we’re expediting work on a firewall solution for the Governance Portal. Together with TechOps we have been looking into a solution using our current cloud provider, which did not offer expected results. TechOps is now working on a solution using a different cloud provider, which will be enabled as soon as they can. It’s important to note that Maker’s voting system (the off-chain components) is highly dependent on web2 infrastructure at this time, and since we want the code to be open-source and forkable we cannot entirely close down the system by adding API endpoint authentication. This makes the system somewhat vulnerable to (D)DoS attacks which we’ll need to mitigate without compromising on transparency and forkability. We are collaborating with TechOps to work towards a short-term solution. A long-term solution for Maker’s voting system would be to move away from web2 infrastructure in favour of more resilient infrastructure and more redundancy. We believe that the Endgame transition will eventually achieve this through mitigating reliance on censorable infrastructure, and through incentivising redundancy—but this will take a lot of time to execute.   Apologies for any inconvenience caused, and we’re happy to answer any questions in this thread.  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.499187892211149
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaveringtonPLLC",
                    "index": "#2",
                    "likes": "2",
                    "time": "20/01/2023-19:12:36",
                    "content": "    0xdeniz:  Upon deeper digging into our logging system we discovered a lot of unusual requests coming from a particular IP address located in France, registered by someone from the Philippines. The requests do not seem like they were generated through organic use of the Governance Portal webapp, thus we have reasons to believe these requests were generated as part of a (D)DoS attack.   what) I love how spicy things are getting around here, but this is wild. Can and should there be further investigation to identify who is doing this? Pretty serious kind of governance attack… has this ever been detected before? Thanks for the speedy and thorough Post-Mortem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.935185185185185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#3",
                    "likes": "2",
                    "time": "20/01/2023-22:03:18",
                    "content": "Thanks for the update @0xdeniz. I agree that it would be good to know a bit more about this potential DDoS attack on the Governance Portal - when you say “we have reasons to believe” that it is a DDoS attack, is this a reference to the other unusual alerts that corroborate or is there information that might be relevant?     0xdeniz:  A long-term solution for Maker’s voting system would be to move away from web2 infrastructure in favour of more resilient infrastructure and more redundancy   Agreed. It doesn’t take too much imagination to think about how a well-timed and comprehensive DDoS attack on the Portal as it stands could compromise Maker governance’s ability to respond appropriately or quickly to a time-sensitive emergency (/attack). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.549242424242424
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#4",
                    "likes": "0",
                    "time": "22/01/2023-12:01:03",
                    "content": "Thanks for the interest and questions—we have a followup meeting with TechOps CU scheduled on Tuesday to discuss further learnings and remaining action items. I’ll provide an update here immediately after! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#5",
                    "likes": "4",
                    "time": "24/01/2023-19:58:20",
                    "content": "Quick update based on a follow-up meeting between DUX and TechOps which took place today: Regarding mitigation steps:  TechOps is still working on a firewall solution for the Governance Portal frontend DUX team has added validation checks on the remaining API endpoints TechOps will be exploring further ways in which we can add monitoring & logging of infrastructure load so we can get a clearer picture of the needs at traffic peaks (eg. when a round of polls close and/or when an exec goes live) DUX team will be anticipating on ‘high-attention days’ for the Governance Portal (based on the governance schedule—an example would have been the closing times of the controversial GUSD polls) and communicate this to TechOps, so that we can be extra responsive and alert on such days. We are working on some process improvements to make for faster and smoother coordination between DUX and TechOps in case of serious incidents like this one.  Regarding transparency on the potential attack: We unfortunately don’t see any ways to get more clarity on who/which entity was behind the potential (D)DoS attack from last week, mostly due to the nature of these attacks. However, for the purpose of transparency we’ve asked TechOps to aggregate any relevant data/details from the available logs in an easy-to-read document, which we’ll share in this thread once ready. Also answering some questions below:     Matt_NZ:  when you say “we have reasons to believe” that it is a DDoS attack, is this a reference to the other unusual alerts that corroborate or is there information that might be relevant?       DaveringtonPLLC:  Can and should there be further investigation to identify who is doing this? Pretty serious kind of governance attack…   When performing a root cause analysis using our logging system last week, we found a large amount of weird requests generated by a bunch of different IP addresses. The queries did not make sense (eg. requesting vote tally of polls that don’t exist) so could not have been generated by using the Governance Portal, but rather by directly interacting with various API endpoints. However the queries did result in strain on the infrastructure, which ended up disrupting access to the app. Note that based on what we can see it’s not possible to confirm that this was a politically motivated attack (as opposed to eg. a bug bounty hunter or a troll) and I’m not sure whether we’ll ever find out.     DaveringtonPLLC:  has this ever been detected before?   For the Governance Portal specifically, and to this degree: Not that I can think of. cc @dux-core-unit @techops-core-unit ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.223134708428826
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#6",
                    "likes": "1",
                    "time": "25/01/2023-20:48:20",
                    "content": "    0xdeniz:  Note that based on what we can see it’s not possible to confirm that this was a politically motivated attack (as opposed to eg. a bug bounty hunter or a troll) and I’m not sure whether we’ll ever find out.   Fair enough - thanks for the due diligence and the follow-up @0xdeniz. Looking forward to the firewall solution from TechOps and other thinking about redundancy protection in the event there is a politically motivated attack in the future. (As far as I know, there is no ‘Plan B’ for how governance could actually do anything if the portal is down for an extended period of time). How to build in that kind of protection is something to think about as the Endgame governance transition takes shape. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.337301587301587
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#7",
                    "likes": "1",
                    "time": "31/01/2023-16:10:51",
                    "content": "Another quick update:  The aforementioned firewall solution is live since this week Validation checks have been added to the remaining endpoints last week More details about the attack itself can be found here   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.969696969696969
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "14/02/2023-16:11:39",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}