{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/add-maker-dao-to-the-list-of-daos/17958",
            "title": "Add Maker DAO to the List of DAOs ",
            "index": 17958,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/List_of_DAOs",
                    "index": "#1",
                    "likes": "0",
                    "time": "18/09/2022-04:24:58",
                    "content": "Hello, This is John from the List of DAOs. We had a community member reach out to us and want Maker DAO added to the List of DAOs. Just wanted to post in here to make sure there was no objection to this. It is free and we just us mission statement and logo to point people to the project. We have over 220 DAO s currently listed.Would love to add Maker DAO! Thanks John    decentra-list.com    List of DAOs We are a simple website to help search for your favorite Decentralized Autonomous Organizations (DAOs). Select by genre or search the 200 DAOs and counting.      ",
                    "links": [
                        "https://www.decentra-list.com/list-of-daos"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.640625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/List_of_DAOs",
                    "index": "#2",
                    "likes": "0",
                    "time": "16/10/2022-21:24:06",
                    "content": "Hey any opposition to this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smartcontracts",
                    "index": "#3",
                    "likes": "0",
                    "time": "16/10/2022-21:48:14",
                    "content": "excellent roadmap for the CFTC, the SEC, and rando DAO litigants to run rampant throughout our industry. very nice ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.800000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/List_of_DAOs",
                    "index": "#4",
                    "likes": "0",
                    "time": "17/10/2022-05:09:01",
                    "content": "Hello, I was actually asked to post this here by the community to get added. No pressure to get added just thought it would be nice to offer. Also I am sure you are aware that there are many DAO directories out there right with Maker added? Once again no pressure but this is being incorrectly marked as spam. Respectfully John ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.709821428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/List_of_DAOs",
                    "index": "#5",
                    "likes": "0",
                    "time": "17/10/2022-05:23:26",
                    "content": " Screen Shot 2022-10-16 at 11.23.04 PM918×179 21 KB  And here is the proof of my response above. As I mentioned no pressure just being nice and following through on a community request. I then received a reply back saying to reach out on the forum.* ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#6",
                    "likes": "1",
                    "time": "17/10/2022-13:10:24",
                    "content": "The reason this isn’t getting responses and is being marked as spam is because by the definition of what a DAO is, no single individual can permit/oppose you from adding MakerDAO to your list. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.226190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/List_of_DAOs",
                    "index": "#7",
                    "likes": "0",
                    "time": "17/10/2022-14:38:44",
                    "content": "Hey! Thanks for the reply. I understand what you are saying by this. So since our listing is free we take approval from (Founders, Core Contributor, Moderators, and Marketing Teams). Yes this is a weird ask because we are asking for permission in a permissionless web3, but we feel it is the right thing to do before we use an organization’s logo/mission statement on the site. Has any other site asked you for this (probably not). However, if Maker DAO approved this you have a POC to talk too and I would too. Instead of pulling API’s I am walking the walk and reaching out to DAOs 1 by 1. We have done this for 236+ DAOs and counting (so it works!!) and we are trying to focus on relationships. It is tough for sure, and others might disagree with the tactics, but it differentiates us. So in this specific case you are designated as a “Governance Core unit Team”. We could take your approval, or if you think this would have to go for a proposal vote by the DAO that would be okay too. I understand if you might not be comfortable with making that decision alone. From my personal perspective, I was asked by one of your community members to post here. We want approval from a (Founders, Core Contributor, Moderators, and Marketing Teams) before I use maker material.  As you can see from me being here this is not spam. I am honestly just trying to talk to people and go through the process (proposal or simple approval).  While I understand this ask is unusual simply tossing me to spam because its unusual doesn’t seem to me to be appropriate, but as I said I am here just trying to follow up on one of your community’s member’s requests. No pressure to get listed just doing our due diligence. John ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.715698026895943
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#8",
                    "likes": "1",
                    "time": "17/10/2022-14:42:57",
                    "content": "If it’s represented as a DAO then you don’t need permission to list it. Stop asking. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/List_of_DAOs",
                    "index": "#9",
                    "likes": "0",
                    "time": "17/10/2022-14:49:29",
                    "content": "Thanks Chris, So I will take the email I received and this conversation as permission then. I was going to say I have also worked with pods/guilds/departments who manage partnerships/collabs too so that could be an option as well. Thanks John ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                }
            ]
        }
    ]
}