{
    "poll_list": [
        {
            "title": "Fund Ambassadors Program Pilot - March 14, 2022",
            "index": "13199",
            "option": "Yes",
            "supporting_mkr": "57,496",
            "highest_fraction": 0.73
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-fund-ambassadors-program-pilot/13199",
            "title": "[Signal Request] Fund Ambassadors Program Pilot ",
            "index": 13199,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted",
                "impact-:-medium",
                "ambassador-program"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/kat",
                    "index": "#1",
                    "likes": "13",
                    "time": "11/02/2022-22:21:02",
                    "content": " Summary: The MakerDAO Ambassador program provides non-english speaking communities with resources and educational materials to expand the MakerDAO community. Ambassadors provide two-way translation services, engage their communities with local events, and share content produced in their own language with the MakerDAO community. During the pilot, the ambassador program is focusing on Latin America with Ambassadors in Argentina and Venezuela. The Ambassador Program’s pilot funding has been disrupted by the offboarding of the Content Production core unit. We are seeking 25,000 DAI to complete our pilot and the projects we started over the next three months. This includes:  Weekly translations of governance updates Full translation of MOM Translation of the Community Portal Organization of meetups Represent MakerDAO at conferences Building engagement on the @makerdao_lat twitter  During the pilot program the ambassadors have:  Translated weekly governance materials (G+R Snippet, Relay, Polls, Dailights) Translated video subtitles for “How to Vote” video Translated major portions of the MOM Translated important MIPS Participated in virtual meetups Created the @makerdao_lat Twitter account   Option One - Fund Pilot Program:  Pros  Continued weekly translation of governance materials Evergreen resources for the Spanish-speaking MakerDAO community Increased engagement with Latin American community   Cons  Will cost the DAO 25,000 DAI Project should probably be an SPF, but timing of the offboarding makes that option too delayed. Oversight is not charged to a facilitator already onboarded by the DAO     Option Two - Do Not Fund Pilot Program  Next Steps: This signal will last two weeks, concluding on Feb. 25th. At that time, if more than 50% of the non-abstaining votes are in favor of this Signal, it will advance to an onchain poll. If there is not more than 50% support, no further action will be taken at this time.    Fund Ambassadors Program Pilot  Yes - Fund Ambassadors Program Pilot No - Do not fund Ambassadors Program Pilot Abstain     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/monthly-governance-review-february-2022/13661",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-24-march-2-2022/13590",
                        "https://forum.makerdao.com/t/relay-semana-22-28-de-febrero-del-2022/13587",
                        "https://forum.makerdao.com/t/weekly-relay-february-22-28-2022/13499",
                        "https://forum.makerdao.com/t/mip55c3-sp17-continue-to-fund-the-ambassador-program/20042",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-febrero-del-2022/13404",
                        "https://forum.makerdao.com/t/weekly-relay-february-15-21-2022/13348",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-10-17-2022/13292",
                        "https://forum.makerdao.com/t/weekly-relay-february-8-14-2022/13239",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-17-24-2022/13425",
                        "https://forum.makerdao.com/t/monthly-governance-review-april-2022/14986",
                        "https://forum.makerdao.com/t/relay-semanal-12-18-de-abril-de-2022/14724",
                        "https://forum.makerdao.com/t/weekly-relay-april-12-18-2022/14691",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/10",
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-marzo/13987",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/42",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-14-de-marzo-de-2022/13917",
                        "https://forum.makerdao.com/t/weekly-relay-march-8-14-2022/13906",
                        "https://forum.makerdao.com/t/content-production-core-unit-offboarding-post-mortem/13756",
                        "https://forum.makerdao.com/t/governance-and-risk-180-thursday-march-03-17-00-utc/13622/3"
                    ],
                    "GPT-summary": "The post is a signal request for funding the MakerDAO Ambassador program's pilot in Latin America. The program aims to provide non-English speaking communities with resources and educational materials to expand the MakerDAO community. The post presents two options for funding the pilot program and asks for feedback from the community. Additionally, the post advertises the program's achievements during the pilot and provides details on the funding requirements. The post also invites questions and constructive criticism from the community.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.42578125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "3",
                    "time": "11/02/2022-22:32:15",
                    "content": "I participated at the beginning in the DAG (Dai Action Group) it was a good start and a great introduction for a Latino community that wants to know about DEFI and DAI at the forefront. The most important thing and what I liked about the initial project, was to do it in my native language Spanish, without the need to speak English, which was very good because it gave a great opportunity to participate in maker. Without a doubt I would like to repeat the experience and it would be great to be part of it again. I attach proof of work.     DAG VENEZUELA - Resumen trimestral febrero/abril 2021 Latin America       Resumen MakerDAO Venezuela - febrero/abril 2021  Embajadores MakerDAO para Venezuela:   Diego Ortiz (@Saludiego201) Luis Lozada (@LozadaLuis12) Alejandro Fernandes (@Alefcripto)  El Team en Venezuela se enorgullece de su tercer periodo de prueba, en el mismo hemos presentado avances que sumados a otros consolidan una base de información y herramientas para nuestros usuarios a nivel local y tips de manera general para el público en LATAM. En ese sentido hemos definido los puntos que más importan …         MakerDAO Venezuela Round Up - February/April 2021 Community Development       MakerDAO Ambassadors for Venezuela:   Diego Ortiz (@Saludiego_201) Luis Lozada (@LozadaLuis12) Alejandro Fernandes (@Alefcripto)  The Team in Venezuela is proud of its third trial period, in which we have presented advances that, added to others, consolidate a base of information and tools for our users at the local level and tips in a general way for the public in LATAM. In that sense we have defined the points that are most important to highlight throughout this quarter, which has been dedicat…     ",
                    "links": [
                        "https://forum.makerdao.com/t/makerdao-venezuela-round-up-february-april-2021/7708"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.162
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "1",
                    "time": "14/02/2022-18:43:49",
                    "content": "    kat:  Option One - Fund Pilot Program:   There needs to be some explanation / transparency over how the funds are to be transferred and managed for this to be valid, I think. In an ideal world, the funds would be streamed to a 2-of-3 multi-sig wallet over the next three months (dates would need to be clarified). At the very least we need to understand how this will be managed before we can action it, but really the earlier the better as it will be a meaningful input into some voters decision-making process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1312500000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#4",
                    "likes": "2",
                    "time": "14/02/2022-19:03:34",
                    "content": "@Saludiego_201 Quite impressive the work you guys did with the DAGs  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#6",
                    "likes": "4",
                    "time": "15/02/2022-02:00:29",
                    "content": "    MadShills:  Do you have examples of what evergreen resources you intend to work on or planned deliverables? These seem to be some of the best bang for the buck with regards to translation.   Hey, I just wanted to weigh in some of my own ideas, which are up for debate based on the budget and bandwidth of the Ambassadors Program as well as what the community believes is needed. I would like to see Monthly Governance Reviews and Forum at a Glance translated. Forum posts are almost always in English. There is the opportunity for GovComms to even further scale the Forum at a Glance to provide more and greater detailed TL;DRs of the forums, which can then be translated into Spanish and help unlock the entire Latin American audience to our forum activities. Thoughts and opinions? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#7",
                    "likes": "1",
                    "time": "15/02/2022-02:24:56",
                    "content": "I wanted to know what evergreen content because it would provide value well beyond the term of the pilot program regardless of the outcome. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#8",
                    "likes": "3",
                    "time": "28/02/2022-16:07:00",
                    "content": "Hey folks quick update here! GovAlpha is pushing this signal back a week for onchain voting so @kat has a chance to provide some of the implementation details requested before we take an onchain vote. As Long pointed out:     LongForWisdom:  There needs to be some explanation / transparency over how the funds are to be transferred and managed for this to be valid, I think.   The multisig doesn’t need to be created until after the poll, but indicating who the signers are, what the signing threshold is (how many signers to take an action), and expectations on reporting the expenditures should be listed so MKR voters can make an informed decision when this gets on chain.  This item was put through the signal process rather than having to go the MIPs route due to the urgency/unfinished business from the offboarding of the Content Production CU. It is not my intention to make this delay problematic for all involved with the ambassadors program, so please reach out publicly or privately if this delay is negatively impacting the team. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.338541666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kat",
                    "index": "#9",
                    "likes": "2",
                    "time": "02/03/2022-22:16:14",
                    "content": "For evergreen content, the Ambassador Program is currently translating GovAlpha’s Maker Operational Manual (https://manual.makerdao.com/). And plans to translate: Community Portal (https://makerdao.world/) MakerDocs (https://docs.makerdao.com/) Collateral Onboarding Introduction (https://collateral.makerdao.com/) MIPs Portal (https://mips.makerdao.com/) ",
                    "links": [
                        "https://makerdao.world/",
                        "https://docs.makerdao.com/",
                        "https://collateral.makerdao.com/",
                        "https://mips.makerdao.com/"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#10",
                    "likes": "0",
                    "time": "02/03/2022-22:39:50",
                    "content": "the translators don’t get sourcecred @kat ? who verifies the quality some quality control? sounds like lot of $ for unprofessional translation? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kat",
                    "index": "#11",
                    "likes": "4",
                    "time": "02/03/2022-22:50:35",
                    "content": "The Ambassadors are professional translators who have taken on additional responsibilities as ambassadors.  They abide by our “translation guide” so that translations are consistent in use of terms specific to MakerDAO.  QA is done on each translation by another Ambassador and receives final approval before posting by the head of the Ambassador Program (me). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#12",
                    "likes": "0",
                    "time": "02/03/2022-22:53:53",
                    "content": "    kat:  The Ambassadors are professional translators   brb i need to consult ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Harrizko",
                    "index": "#13",
                    "likes": "5",
                    "time": "02/03/2022-23:32:04",
                    "content": "I think that the final statement about the quality of a translation it is given ipso facto by the readers. Same with transcriptions. If someone is not working good, that can be spotted immediately; I mean, you —in most cases— don’t have a clue about what is going on after a mechanic put his hands in your car, but this is not the case with a text: in front of a shitty transcription or translation, you can positively know if the work is bad just by reading it, and then report the situation. On a personal note: I would love to see —and help produce— more and more translated material (in spanish —as it is my mother tongue— and other languages). I’m from Argentina. Just this week two friends were excited about joining MakerDAO. They have money to buy DAI, they have potential and things to offer to the community, but they don’t have enough knowledge about english to properly immerse in some key areas related to how Maker works, for example. And there is a lot of people out there with the same situation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party is advertising proposal"
                    ],
                    "Sentiment": 5.515422077922078
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kat",
                    "index": "#14",
                    "likes": "11",
                    "time": "10/03/2022-02:00:24",
                    "content": "Hello all and sorry for the delay in posting these details, as we all know, there’ve been a lot of moving parts in all of this. I will implement a 2-3 multisig for this budget:   @Davidutro, @tadeo and myself @kat will be the signers.  The budget will be streamed monthly and the cost breakdown for the three month pilot is as follows: Hourly Compensation:     Role Quantity Hourly Rate Approximate Cost     Lead Ambassador 1 40 DAI 3200 DAI / Month   Ambassadors 2 30 DAI 4000 DAI / Month   Ambassador Manager (Kat) 1 0 0    We will use the remaining 1133 DAI/month budget for expenses related to meetups (venue, food+drink, technology rentals/supplies for documentation). This buffer will also allow for some flexibility if Ambassadors need to put in more hours on any larger projects. Unused funds will be returned to the DAO. Milestones:     Month Milestones     1 - March Weekly Governance Translations  Maker Operational Manual Translation (ongoing project-will require more translations as it is completed) Increased participation on social platforms (Forum, Discord, Twitter, Telegram)   2 - April Weekly Governance Translations MakerDocs Translation 2x Meetups (1x intro, 1x deep) Increased participation on social platforms (Forum, Discord, Twitter, Telegram)   3 - May Weekly Governance Translations 1x Meetup Community Portal Translation Collateral Onboarding Introduction Translation Increased participation on social platforms (Forum, Discord, Twitter, Telegram)     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#15",
                    "likes": "0",
                    "time": "10/03/2022-02:16:20",
                    "content": "@kat can you provide synopsis of past results? The idea sounds good and would appreciate summary of facts in past. This seems cheaper and more likely to deliver value than a million dollars for party plan core unit. Thank you  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kat",
                    "index": "#16",
                    "likes": "6",
                    "time": "10/03/2022-02:30:56",
                    "content": "    kat:  During the pilot program the ambassadors have:  Translated weekly governance materials (G+R Snippet, Relay, Polls, Dailights) Translated video subtitles for “How to Vote” video Translated major portions of the MOM Translated important MIPS Participated in virtual meetups Created the @makerdao_lat Twitter account    @Puzzler You’ll find a lot of our work in the Latin America section of the Forum, but here are a few links to see our progress so far:  Manual Operacional de Maker - Maker Operational Manual MakerDAO Latin America Twitter How to Vote - Spanish Subtitles G+R Snippets en Español  ",
                    "links": [
                        "https://twitter.com/MakerDAO_Lat",
                        "https://forum.makerdao.com/t/como-votar-en-el-protocolo-de-maker-video-subs-en-espanol/12279",
                        "https://forum.makerdao.com/t/como-votar-en-el-protocolo-de-maker-video-subs-en-espanol/12279"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#17",
                    "likes": "5",
                    "time": "10/03/2022-19:49:59",
                    "content": "Confirming with the implementation details present, this will go up for an on-chain poll on Monday, March 14th. Thanks for getting this info public and I encourage anyone with questions or concerns to speak up! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#18",
                    "likes": "4",
                    "time": "18/03/2022-00:54:27",
                    "content": "    Harrizko:  I think that the final statement about the quality of a translation it is given ipso facto by the readers. Same with transcriptions. If someone is not working good, that can be spotted immediately; I mean, you —in most cases— don’t have a clue about what is going on after a mechanic put his hands in your car, but this is not the case with a text: in front of a shitty transcription or translation, you can positively know if the work is bad just by reading it, and then report the situation.   As a fellow argentinian, i can’t agree more. The work the ambassadors are doing for the maker community is really valuable for us latin americans, and for the maker community as a whole. LATAM has an enormous potential in the crypto world.     Harrizko:  I would love to see —and help produce— more and more translated material (in spanish —as it is my mother tongue— and other languages).   Same here. If needed, i’ll even do it for free. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party is advertising proposal"
                    ],
                    "Sentiment": 5.813098086124402
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#19",
                    "likes": "0",
                    "time": "18/03/2022-01:16:01",
                    "content": "Is this program only for Spanish at the moment? Or also other languages? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#20",
                    "likes": "0",
                    "time": "18/03/2022-01:26:18",
                    "content": "I believe it’s only for spanish at the time ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#21",
                    "likes": "2",
                    "time": "18/03/2022-15:30:57",
                    "content": "For now it will be managed in Spanish, some time ago there was a Portuguese version, but the community moves a lot is in Spanish (outside the English), that shows the interest that DAI has on the part of deficient economies such as those of Latam. Possibly in the future if there is interest on the part of diverse community and a great activity in the forum it can be expanded to other languages. You can look at the Latin American section and see the high rate of activity in their posts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1812499999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#22",
                    "likes": "4",
                    "time": "21/03/2022-23:55:14",
                    "content": "Hello! Sorry for being so bold just commenting here but I just wanted to say that I’d love to help with translations in general and organizing IRL events. I’m from Argentina and currently living near Buenos Aires and I have a nice experience translating organizational docs & organizing events cuz I have had several roles at some big NGOs like AIESEC & Techo, where some of these roles involved this kind of thing . So I will be really excited if I can help & collaborate on the development & growth of the Maker LATAM community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.9356060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#23",
                    "likes": "2",
                    "time": "07/04/2022-09:40:18",
                    "content": "Looking to update our executive calendar with an expected date for dispersing the funds, could we get an update on the multisig address/any blockers @kat ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NoeliS",
                    "index": "#24",
                    "likes": "4",
                    "time": "11/04/2022-23:07:29",
                    "content": "    nahueth:  cited if I can help & collaborate on the development & growth of the Maker LATAM community.   Hi all, The idea seems really good. I am from Argentina and there are a large number of people interested in Crypto and DAOs but they are limited by their mother tongue(I went to a DeFi meetup last Friday and I could appreciate that). Although it is a little bit late, please, feel free to contact me as I am happy to help the community:)! Regards, Noeli ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party offering to collaborate on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.215178571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#25",
                    "likes": "3",
                    "time": "12/04/2022-00:11:26",
                    "content": "    NoeliS:  there are a large number of people interested in Crypto and DAO   Truthful & accurate.     NoeliS:  I went to a DeFi meetup last Friday and I could appreciate that   First time assisting to DeFi LATAM monthly meet? Will nice see you on other like events and to be curious are you in at MEC? Welcome to MakerDAO forum Noeli! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.494642857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NoeliS",
                    "index": "#26",
                    "likes": "1",
                    "time": "12/04/2022-01:37:09",
                    "content": "@nahueth thank you! It was the second time but I had the opportunity to talk to different people. I heard about MEC in some but I’m not in the group. Does the project have a Telegram or Discord account? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#27",
                    "likes": "0",
                    "time": "12/04/2022-02:46:33",
                    "content": "A lot of people were there like to find you in the crowd, right? Check your DM. I sent you more info. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9642857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kat",
                    "index": "#28",
                    "likes": "2",
                    "time": "12/04/2022-20:28:48",
                    "content": "Multisig is here: maker-ambassadors  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#29",
                    "likes": "0",
                    "time": "13/04/2022-12:59:24",
                    "content": "Could @Davidutro and @tadeo confirm that they are signers on the multi-sig? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#30",
                    "likes": "3",
                    "time": "13/04/2022-13:44:12",
                    "content": "I confirm that I’m a signer on the multi-sig. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#31",
                    "likes": "3",
                    "time": "13/04/2022-14:19:01",
                    "content": "I am indeed a signer on the multi-sig ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#32",
                    "likes": "0",
                    "time": "25/04/2022-09:01:55",
                    "content": "Hello! First wanted to confirm that the distribution of 25,000 DAI took place here. Only thing missing from the multisig is the spending limit for the Proxy Address. This should be put in place so that in the event that 2 or more keys are lost/compromised, the funding can be pulled back through an executive vote. Spending limits for the multisig can be viewed here. Most Core Units use a spending limit of 1B DAI, but anything over 25,000 would suffice for these purposes. Please let me know if you need assistance setting up the spending limit transaction @kat , @Davidutro , and @tadeo  ",
                    "links": [
                        "https://gnosis-safe.io/app/eth:0xF411d823a48D18B32e608274Df16a9957fE33E45/settings/spending-limit"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#33",
                    "likes": "0",
                    "time": "20/05/2022-03:38:30",
                    "content": "The Latin America section of the Forum is growing, it´s a fact. For many reasons (mainly economic, I can expand on this if anyone wants to) there is a lot of crypto adoption here in LATAM, the ecosystem is solid and it´s growing, and stablecoins are the key. DAI is a benchmark, the second most adopted stablecoin in the region. There is still a lot to do here.      NoeliS:  I heard about MEC in some but I’m not in the group. Does the project have a Telegram or Discord account?   Hi NoeliS, you can find all the contacts HERE. See you in the next DeFi LATAM meetup! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#34",
                    "likes": "0",
                    "time": "19/06/2022-13:39:02",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "681"
}