{
    "poll_list": [
        {
            "title": "Ratification Poll for Sustainable Ecosystem Scaling Core Unit MKR Budget, SES-001 (MIP40c3-SP17) - June 14, 2021",
            "index": "8043",
            "option": "Yes",
            "supporting_mkr": "33,000",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp17-sustainable-ecosystem-scaling-core-unit-mkr-budget-ses-001/8043",
            "title": "MIP40c3-SP17: Sustainable Ecosystem Scaling Core Unit MKR Budget - SES-001 ",
            "index": 8043,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "ses-001",
                "mkr-compensation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#1",
                    "likes": "7",
                    "time": "12/05/2021-22:58:20",
                    "content": " Preamble MIP40c3-SP#: 17 Author(s): @wouter, @juanjuan Contributors: Status: Accepted Date Applied: 2021-05-12 Date Ratified: 2021-06-28   Sentence Summary MIP40c3-SP17 adds the MKR Incentive Plan budget for Core Unit SES-001: Sustainable Ecosystem Scaling.  Paragraph Summary MIP40c3-SP17 adds the MKR Incentive Plan budget for Core Unit SES-001: Sustainable Ecosystem Scaling. It contains:  Total MKR Expenditure Cap Estimated MKR Expenditure (based on the current team) Escrow Wallet mechanism  MKR incentives have been determined based on the Program discussed here. This is a 3-year vesting plan with 1-year cliff vest.  Total MKR Expenditure Cap The total MKR Expenditure will not exceed  3,309.85 MKR. This covers the entire 3 years plan for 10.90 FTEs.  Estimated MKR Expenditure The Estimated MKR Expenditure is our best guess of how much MKR will be used with the current team configuration. Reasons why the Actual MKR Expenditure could rise closer to the MKR Expenditure Cap:  A raise for a member of the team New hires (2 are covered by the cap) Repricing (and resetting) the program, in the case of bear market  Price floor: -30%. If any Contributor chose to reprice their program, they could do it at a maximum of -30% from the set MKR price.  Permanent Team Forecast For the permanent team, assuming the team configuration remains the same as today, this would result in the vesting schedule below.     Vesting Date MKR Amount     30 Nov 2021 0 MKR   31 May 2022 556.00 MKR   30 Nov 2022 278.00 MKR   31 May 2023 278.00 MKR   30 Nov 2023 278.00 MKR   31 May 2024 278.00 MKR   Total 1,668.00 MKR    This covers the total vesting schedule of 3 years for the current 8.90 FTEs. On average, this yields 61.82 MKR per FTE per year. Any changes to these amounts will be reported in the Monthly Budget Statement and reviewed by our budget auditors.  Parameters     Property Value     MKR/USD lock-in Price (New) Trailing 6 month average   MKR/USD lock-in Price (OG) MKR = $1,956 (11/12/20 - 05/12/21)   MKR Price Floor -30% ($1,369)   Vesting Period 3 years   Cliff Vest 12 months   Vesting Schedule After cliff has expired, the Biannual MKR amount vests every 6 months   Manual Repricing yes   Auto-Renewal yes     Incubation Program For the Incubation Teams, MKR incentives will be included in the respective budget MIPs as they are published. This may include a back pay amount for the incubation time, but the details are still being discussed.  Grants Program Grantees will not receive MKR as part of the Grants Program. Moving into the DAO as a full-time Contributor might include a back pay amount for the contribution time, but the details are still being discussed.  Payment Implementation  Payment of the MKR tokens will follow the same flow as described in the original SES budget MIP (MIP40c3-SP10).   20210601-mkr-payment-flow4113×519 118 KB    As defined above and in MIP40c3-SP10, the Monthly Budget Statement will contain the MKR vesting schedule. This schedule specifies when in the future MKR is vesting, and how much.   To keep the risk acceptable for Maker governance as well as for the team, the MKR is moved from the protocol to the contributors in stages:   Following the MKR vesting schedule, any MKR that is vesting in 6 months or less, will be included in the top-up transaction which is added to the executive vote. This will move the MKR from the protocol to the SES Auditors Wallet, which then acts as an escrow wallet.   Following the MKR vesting schedule, after review and approval by the auditors, any MKR that is vesting in 3 months or less, will be included in the monthly top-up transaction that moves funds from the SES Auditors Wallet to the SES Permanent Team Operational Wallet.   When the MKR has vested, it is paid out to the contributor, either directly or through an intermediate payment processor.     Any excess MKR in the SES Auditors Wallet or the SES Permanent Team Operational Wallet will be returned to the protocol, following the monthly payment transactions.   This payment implementation makes no assumptions about the origin of the MKR. It can either be moved from the protocol’s treasury, newly minted, or obtained from another source. The MKR that’s held by the SES Auditors Wallet and the SES Permanent Team Operational Wallet will not be used for voting, signaling, or any other type of governance participation. It will remain in the wallets untouched until it moves to the next step in the process. Once DssVest or another payment flow has been adopted by the community, SES may propose to update its payment flow to comply with the standardized flow. That is assuming that the standardized flow is compatible with the vesting schedule, and that the risk is deemed acceptable by the team. ",
                    "links": [
                        "https://github.com/makerdao-ses/transparency-reporting/tree/main/Monthly%20Budget%20Statements",
                        "https://www.investing.com/crypto/maker/mkr-usd-historical-data",
                        "https://forum.makerdao.com/t/mip40c3-sp10-modify-core-unit-budget-ses-001/7369#multi-sig-wallets",
                        "https://forum.makerdao.com/t/mip40c3-sp10-modify-core-unit-budget-ses-001/7369#multi-sig-wallets",
                        "https://github.com/makerdao-ses/transparency-reporting/tree/main/Monthly%20Budget%20Statements",
                        "https://forum.makerdao.com/t/mip-54-dssvest/8025",
                        "https://forum.makerdao.com/t/mip40c3-sp41-immunefi-security-core-unit-mkr-budget-is-001/10814",
                        "https://forum.makerdao.com/t/mip40c3-sp27-development-ux-core-unit-mkr-budget-dux-001/9777",
                        "https://forum.makerdao.com/t/maker-relay-ep-53-en-espanol/9330",
                        "https://forum.makerdao.com/t/maker-relay-ep-53/9305",
                        "https://forum.makerdao.com/t/weekly-mips-update-42/9010",
                        "https://forum.makerdao.com/t/weekly-mips-update-41/8892",
                        "https://forum.makerdao.com/t/weekly-mips-update-40/8759",
                        "https://forum.makerdao.com/t/weekly-mips-update-39/8606",
                        "https://forum.makerdao.com/t/mip40c3-sp87-modify-the-sustainable-ecosystem-scaling-core-unit-budget-ses-001/18339",
                        "https://forum.makerdao.com/t/mip40c3-sp72-lending-oversight-core-unit-mkr-budget-love-001/15104",
                        "https://forum.makerdao.com/t/mip40c3-sp64-add-data-insights-core-unit-budget/13791",
                        "https://forum.makerdao.com/t/mip40c3-sp55-modify-core-unit-budget-sustainable-ecosystem-scaling-ses-001/12097",
                        "https://forum.makerdao.com/t/mip40c3-sp51-modify-core-unit-budget-mkr-maker-talent-mt-001/12076",
                        "https://forum.makerdao.com/t/mip40c3-sp44-adding-sidestream-auction-services-core-unit-mkr-budget-sas-001/10802"
                    ],
                    "GPT-summary": "MIP40c3-SP17 proposes the MKR Incentive Plan budget for Core Unit SES-001: Sustainable Ecosystem Scaling. The proposal includes the total MKR Expenditure Cap, Estimated MKR Expenditure, and Escrow Wallet mechanism. The proposal also outlines the vesting schedule for the permanent team and the payment implementation process. The proposal will be audited and reviewed by budget auditors, and any changes to the amounts will be reported in the Monthly Budget Statement.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Token economics",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.224376114081997
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#2",
                    "likes": "3",
                    "time": "18/05/2021-17:24:26",
                    "content": " Update After carefully reading Nik’s Proposal, we have borrowed a couple of tweaks:  We have updated our floor to 35% (from 20%). We feel this is fair and creates more equality. We have raised the lock price of MKR, which translates to a lower total MKR compensation for the Core Unit. We think this is fair with other Core Units and will produce more consistency. We have kept our Program length at 3-years. We encourage other Core Units do the same since four years is an eternity in DeFi, and the Program auto-renews (with a fair price).  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "0",
                    "time": "18/05/2021-20:26:06",
                    "content": "    juan:  We encourage other Core Units do the same since four years is an eternity in DeFi   Ha! 3-months is an eternity in DeFi. Totally support this! It’s more than fair, IMO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.075
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#4",
                    "likes": "0",
                    "time": "27/05/2021-16:24:14",
                    "content": "Edit: moved subproposal number to 17. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#5",
                    "likes": "2",
                    "time": "01/06/2021-11:25:07",
                    "content": "The proposal has been updated with the details of the payment flow. Note that the MKR is moved to the SES Auditors Wallet 6 months before vesting, and then to the SES Permanent Team Operational Wallet 3 months before vesting. Any feedback is appreciated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "1",
                    "time": "01/06/2021-11:42:29",
                    "content": "    wouter:  Any feedback is appreciated   I know we all know the answer, but MKR held in the SES wallet for vesting will not be used for voting, correct? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#7",
                    "likes": "0",
                    "time": "01/06/2021-11:53:41",
                    "content": "    PaperImperium:  MKR held in the SES wallet for vesting will not be used for voting, correct?   Hah. Interesting take. The only idea of this implementation is to minimize risk transparently (this helps with Contributors). This was not created with the idea of swinging any vote. That said, I don’t think that the amount accrued and not vested will ever be enough to have a real impact. I’m trying to think if there’s any situation where it would be beneficial to use that MKR, for example, to protect the hat. Again, I don’t think it would ever make a real impact. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#8",
                    "likes": "0",
                    "time": "01/06/2021-12:10:13",
                    "content": "    juan:  I’m trying to think if there’s any situation where it would be beneficial to use that MKR, for example, to protect the hat.   Hmmm. I would assume this would follow whatever rules the 84k treasury MKR follows. Or maybe not, since a CU is in many ways a contractor of the DAO and its own independent entity. Anyway, maybe it doesn’t need to be spelled out right this minute. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.732142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#9",
                    "likes": "6",
                    "time": "01/06/2021-13:27:03",
                    "content": "Hypothetical future use cases aside, I think we can definitely commit to not use the MKR that’s sitting in the multisig wallets for voting. If that ever changes, we can propose a change first. I added a sentence about it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#10",
                    "likes": "1",
                    "time": "02/06/2021-14:02:56",
                    "content": "The opening post was just updated to reflect the final salaries and MKR number based on the new parameters with 35% salary floor and the new lock price:  Updated the MKR Estimate from 1,650.58 MKR to 1,668.00 MKR for the entire 3-year plan. Updated the Total MKR Expenditure Cap from 3,263.24 MKR to  3,309.85 MKR.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.2727272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#11",
                    "likes": "7",
                    "time": "08/06/2021-23:37:06",
                    "content": "Edit: moving this to Formal Submission (FS). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#12",
                    "likes": "6",
                    "time": "27/06/2021-22:39:29",
                    "content": "Bumping this one since the vote is really close with only 17 hours to go: https://vote.makerdao.com/polling/QmSmhV7z Note that it needs 10k MKR to pass. Support is much appreciated and sends the message that Maker is willing to invest in the talent that will secure its future success. (Not just SES, but in general.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is advertising proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.875
                }
            ]
        }
    ],
    "group_index": "3622"
}