{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-security-module-vote-failure/1077",
            "title": "Governance Security Module vote failure ",
            "index": 1077,
            "category": [
                "Governance"
            ],
            "tags": [
                "concerns",
                "govsec-module"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/censureworld",
                    "index": "#1",
                    "likes": "4",
                    "time": "07/01/2020-18:39:03",
                    "content": "Since the vote to add a 24 hour delay to the Governance Security Module failed, is there a timeline for when MakerDAO will put it up for a vote again? If not, does MakerDAO intend to allow the vulnerability it fixes to remain exploitable? ",
                    "links": [],
                    "GPT-summary": "The post is a question about the timeline for a vote on the Governance Security Module and whether MakerDAO intends to leave the vulnerability it fixes exploitable.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 2.9583333333333335
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "10/01/2020-02:02:14",
                    "content": "There is not a timeline currently. I don’t believe the vulnerability will remain exploitable though. It was always planned to activate the GSM at some point. Part of the problem is that it’s difficult to judge the intention of MKR Token Holders with respect to that executive. The fact that it didn’t pass could indicate either:  MKR Token Holders do not think that activating the GSM at this time is a good idea. MKR Token Holders were not paying attention to the executive vote and did not move their MKR from the previous executive to the GSM activation.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "0",
                    "time": "16/02/2020-02:58:11",
                    "content": "I’ve listened to the Feb 13 Governance and Risk Meeting (Ep. 73). The darkfix plan makes sense to me. Great work! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#4",
                    "likes": "0",
                    "time": "16/02/2020-09:54:34",
                    "content": "It is interesting, but it forces MKR holders to accept execution of a code that they do not know in hope that it is genuine fix not exploit. If someone remember Parity Multisign Wallet “Fix” he will understand a risk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "0",
                    "time": "16/02/2020-15:00:17",
                    "content": "    Adam_Skrodzki:  it forces MKR holders to accept   I disagree with this characterization. MKR holders can approve the darkfix or not. It’s an option. It’s a matter of social consensus whether the security researcher can convince the big MKR holders that the darkfix is in our/their best interests. If this option allows us to enable the GSM then I’m all for it. You mention the Parity Multisig Wallet fix. How is this relevant? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#6",
                    "likes": "1",
                    "time": "16/02/2020-17:32:18",
                    "content": "    psychonaut:  You mention the Parity Multisig Wallet fix. How is this relevant?   Guys introduced a bug while fixing another one found previously, It have led to 250 mln locked. This is kind of risk You fall into when not enough eyes is watching and that is exacly what darkfix is by design. Code seen before by as few eyes as possible. But I agree that if it will allow to enable GSM it is woth it especially that dark fix is a tool of a last resort to an existing bug, hopefully will be never used. Does not change the fact that it is dangerous as hell. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.941666666666666
                }
            ]
        }
    ]
}