{
    "poll_list": [
        {
            "title": "Launch Maker Teleport with 1 Basis Point Fee - May 23, 2022",
            "index": "15109",
            "option": "Yes",
            "supporting_mkr": "57,011",
            "highest_fraction": 0.68
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-launch-maker-teleport-with-1-basis-point-fee/15109",
            "title": "Signal Request - Launch Maker Teleport with 1 basis point fee ",
            "index": 15109,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#1",
                    "likes": "14",
                    "time": "11/05/2022-17:25:43",
                    "content": "Authors: @Aes, @hexonaut Contributors: @juanbug This Signal Request allows the Maker community to signal if it wants to launch Maker Teleport with a 1 basis point fee. Maker Teleport, formerly known as Maker Wormhole, will launch with some key advantages over other bridge offerings.  Teleport allows users to withdraw L2 funds near instantly by avoiding the need to wait for fraud proofs Teleport burns DAI on the origin chain and mints DAI on the destination chain without the need for any centralized party or liquidity pools that are seen by hackers as a honeypot  As a result, Maker Teleport will launch being both faster and safer than current competitive offerings. Strategic Finance has researched bridge offerings across the ecosystem and found that even launching with a 1 basis point fee, Maker Teleport is estimated to be 75-99% cheaper than other bridge products. Though 1 basis point may seem insignificant, we strongly believe that bridging is a subset of web3 that will show strong secular growth and likely have significantly lower correlation and possibly even negative correlation to the protocol’s core business, creating a new and extremely valuable revenue stream for the protocol. While the current plan is to launch Maker Teleport with only DAI, we could potentially expand our offering to include PSM stablecoins. Some of the larger bridges are already earning over $2.1M/month in fees, and while Multichain is covering many more chains and crypto-assets, it’s quite clear that stablecoins are the most bridged asset and will likely continue to be long-term. Teleport Fee Parameters per Domain: Set the Arbitrum Wormhole Fee parameter to 1 bp Set the Optimism Wormhole Fee parameter to 1 bp    Should Maker Teleport launch with a fee?  Yes - Launch with 1 basis point fee No - Launch with no fee Abstain     0 voters      Next Steps Poll will end on 2022-05-19T00:00:00Z, and if positive, will move on-chain on the following Monday. ",
                    "links": [
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/43",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/78",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/65",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/20",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/15",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-23-de-mayo-de-2022/15344",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-6/15313",
                        "https://forum.makerdao.com/t/relay-semanal-10-16-de-mayo-de-2022/15289",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-12-18-2022/15280",
                        "https://forum.makerdao.com/t/weekly-relay-may-10-16-2022/15238",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-5-11-2022/15154",
                        "https://forum.makerdao.com/t/weekly-relay-may-17-23-2022/15346",
                        "https://forum.makerdao.com/t/relay-semanal-24-30-de-mayo-de-2022/15594",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/17",
                        "https://forum.makerdao.com/t/weekly-relay-may-24-30-2022/15488",
                        "https://forum.makerdao.com/t/relay-semanal-17-23-de-mayo-del-2022/15392"
                    ],
                    "GPT-summary": "The post is a signal request for the Maker community to vote on whether to launch Maker Teleport with a 1 basis point fee. The post explains the advantages of Maker Teleport over other bridge offerings and provides research on the estimated cost savings. The post also mentions the potential for expanding the offering to include PSM stablecoins. The signal request includes a poll with options for launching with a fee or no fee.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.505411255411255
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#2",
                    "likes": "5",
                    "time": "11/05/2022-17:28:36",
                    "content": "Originally we were defaulting to 0 fees, but I think there is a strong argument here to start at 1bps. The average user will not notice this (gas fees already come out so it’s not 1:1 regardless), and it’s a much easier adjustment to lower the fees to 0 later rather than raise them. xchain stablecoin transfers are going to have massive volume even beyond what’s happening today. This seems like a good compromise rather than completely free. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.223958333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "0",
                    "time": "11/05/2022-17:36:27",
                    "content": "Apologies, just updated some of the poll settings. Please vote again if you’d already done so. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#4",
                    "likes": "10",
                    "time": "11/05/2022-17:51:46",
                    "content": "With cross-chain interoperability (IBC, CCIP, Stargate, etc.) as the key theme in crypto right now, such a product will be in high demand. This is because it simultaneously capitalizes on inter-op while catering to and directly addressing the weaknesses of trusted honeypot bridges. I like the move towards a nominal fee. Maker creates valuable products that the market needs and will be happy to pay for. To charge appropriately for such products is to fund the pace of R&D required to keep trailblazing the frontier. To @hexonaut’s point, anchoring is critical here. If we are providing a cross-chain highway, users should expect to pay a toll, however small. Politically a nightmare to open a free road and then install a toll booth later. The toll should be priced in a way that drives customer acquisition and promotes lock-in/loyalty. Then, should the DAO seek to mirror standard for-profit business practice, ultimately lean in to pricing power. Recent events in stablecoin (UST) and bridge land (Wormhole, Ronin) have rudely reminded users how critical robust architecture and conservatism are. There’s arguably no better time to launch and charge for an MKR-branded product that’s damn good. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.510884353741496
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "6",
                    "time": "11/05/2022-18:35:18",
                    "content": "I’ll take the otherside of the trade–too many options for someone who cruises the L2 spectrum, including Stargate which works like a charm and even swaps stablecoin to stablecoin in 1 transaction while transporting you to another realm. Very soon™ launching support for DAI, and one of the biggest criticisms why Coinbase is getting shellacked is the FEES. Let’s keep the UX seamless and free. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#6",
                    "likes": "8",
                    "time": "11/05/2022-18:59:59",
                    "content": "    Aes:  expand our offering to include PSM stablecoins   I love the idea of expanding our offering to include other PSM stablecoins and charging a fee for everything that’s not DAI ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#7",
                    "likes": "5",
                    "time": "11/05/2022-19:22:40",
                    "content": "I think maybe start with 1 basis point and see the market appetite. Launching free first and then requiring toll would be quite unpopular from PR perspective as well ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#8",
                    "likes": "1",
                    "time": "11/05/2022-21:16:28",
                    "content": "Good callout, and here i was comparing all the fees at a service level. Comparing with inflationary token offerings…   when we could just alter it if users don’t like it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#9",
                    "likes": "7",
                    "time": "12/05/2022-09:51:46",
                    "content": "Lowering pricing is infinitely easier than raising it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#10",
                    "likes": "4",
                    "time": "12/05/2022-10:35:30",
                    "content": "A few questions this Signal got me thinking about. May not be entirely relevant (I frankly know too little about the bridge market), but here they are: a) What is the expected competitor reaction set? On the surface one could assume the competitors would set fee at zero for DAI to retain customer relationships, volumes and make their money on other chains and assets? If so, then is there value in starting at 1 bps? Is “story value” of 0 Bps better? And would “start at 1bps” and move to 0bps erode such story value? Also if the competitors do set their fee to zero, then will customers move? Or remain with existing for convenience? b) What is the most valuable story to tell the market for Maker right now that aligns with Maker strategy? 0 bps → For instance something like: “Maker constantly working to make DAI as friction-free as possible: teleport DAI freely” (or something much more clever that is relevant for the potential customers) ? 1 bps → For instance something like: “Maker charge 1 bps and use it to protect your teleportation the following way: something something” - it is always good give customers logical reasons for a fee, that they can buy into and see some value/benefit in. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.81312656641604
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#11",
                    "likes": "3",
                    "time": "12/05/2022-17:28:58",
                    "content": "Greetings everyone. There is actually private information that is relevant to this poll. Would like to start dog fooding the task forces proposal and schedule a meeting with all @Recognized-Delegates and the Growth Task Force next week. Does that sound good? Will schedule a time shortly. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip75c2-sp1-onboard-task-force-growth-task-force/15094"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#12",
                    "likes": "0",
                    "time": "12/05/2022-17:37:30",
                    "content": "Following Allan_Pedersen’s good comments:     Allan_Pedersen:  a) What is the expected competitor reaction set? On the surface one could assume the competitors would set fee at zero for DAI to retain customer relationships, volumes and make their money on other chains and assets? If so, then is there value in starting at 1 bps? Is “story value” of 0 Bps better? And would “start at 1bps” and move to 0bps erode such story value? Also if the competitors do set their fee to zero, then will customers move? Or remain with existing for convenience? b) What is the most valuable story to tell the market for Maker right now that aligns with Maker strategy? 0 bps → For instance something like: “Maker constantly working to make DAI as friction-free as possible: teleport DAI freely” (or something much more clever that is relevant for the potential customers) ? 1 bps → For instance something like: “Maker charge 1 bps and use it to protect your teleportation the following way: something something” - it is always good give customers logical reasons for a fee, that they can buy into and see some value/benefit in.   Begs a general question of whether we can have something between 0bps and 1bps? One point here with respect to fee and competition. As one who has been a long time arbitrage user there is a few things to consider.  Bridges are significant attack surfaces.   Money has been lost in bridges. Take 1/2 the fee specified and create wormhole insurance fund (what cases this insurance will cover will need to be specified, but in the end it should be clearly stated - up to Maker Governance IN ALL cases whether to pay out or NOT).   Using the fee to generate an insurance fund I think people will look upon favorably. wormhole performance.   IF I can beat an arbitrager to a trade - and this makes me money - then I will pay a fee. Being able to adjust the fee to like .12bps vs. 1.22bps I think has some use with respect to competition. I tend to trust Maker PECU much more than other dev groups.   Provided performance is competitive I am going to pay a fee.  To put this in perspective.  100M across such a bridge at 1bps would cost 10,000.   Which begs another question.  Is there some way to set a fee based on the size of the tx.  say tx’s over 1M get .15bps, under 1M .35bps?  I believe fees for services to be important but I think understanding competition is also important I think performance metrics would be useful.   Support to people explaining why 10000 DAI wormhole move cost them .35DAI may be important…  But when I put this all in context of fees to do these moves I have to wonder if the tx cost me 20 am I going to care if I pay .35 or 1.35 in wormhole fees?   But if this becomes 10,000 to more 100M when the tx cost $200 might be a little stiff. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.928120490620491
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Juanbug",
                    "index": "#13",
                    "likes": "1",
                    "time": "12/05/2022-18:03:09",
                    "content": "Sounds good! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#14",
                    "likes": "4",
                    "time": "12/05/2022-20:34:30",
                    "content": "I don’t think this is a good idea. Not sure what the private information is or its relevance, but I am not comfortable with the proposed Growth Task Force beginning to operate before there has been voting and consensus on this approach through our usual governance process. Also I have concerns about special meetings being arranged with Delegates only as a group that are not open to the entire community to attend or view a recording. I do recognize at times there is the need for conversations and information sharing that is NOT public. I guess more disclosure about the nature of the information and why it cannot be shared here would be helpful to know. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.3896103896103895
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#15",
                    "likes": "6",
                    "time": "12/05/2022-22:05:00",
                    "content": "I mean this is exactly what I’m talking about in the other post. We are in a situation with this vote where a potentially sub-optimal decision is being made due to lack of information. I’m open to alternatives, but the tried and true method is to have unified front towards our counter-parties and discuss internally about what is in the best interest of the DAO. I hear the uneasiness about private talks, but when faced with binary options of get good deals with private negotiations or not be able to reach deals at all then I choose the one that makes progress in a messy way. Obviously feel free to sit out of the chat, but I still would like to present information to inform the vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.716911764705882
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#16",
                    "likes": "0",
                    "time": "13/05/2022-08:20:09",
                    "content": "Wormhole is an astounding technological feat. It’s a good idea to open it up for business. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#17",
                    "likes": "0",
                    "time": "13/05/2022-08:21:31",
                    "content": "Sorry, but how does this pertain to the Maker Teleport? Really curious, and an honest question. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#18",
                    "likes": "0",
                    "time": "13/05/2022-12:05:17",
                    "content": "That’s not public information. Hence why we need to discuss privately. I’m not sure how else to elaborate on this other than we have the meeting and tell you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#19",
                    "likes": "2",
                    "time": "13/05/2022-14:08:40",
                    "content": "Understood, fair enough. I will sit out and wait to see the outcome once appropriate to disclose publicly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Juanbug",
                    "index": "#20",
                    "likes": "16",
                    "time": "13/05/2022-20:50:31",
                    "content": "Just want to provide some additional data and context to this post. When creating our own bridge, it’s essential to understand the competitors in the space. Here’s an analysis of the most prominent players in the space as well as the native bridges for the L2 chains Arbitrum and Optimism. L2 Native Bridges: Arbitrum and Optimism Something we often see with a native bridge is a costless transaction to onboard onto that chain and then a hefty fee on the way back, often coupled with multiple days of waiting. This is also apparent with the Optimism and Arbitrum native bridges. Bridging from Mainnet to the L2 is costless aside from an ethereum gas transaction and takes about 10 minutes. Going the other way, we see that on Arbitrum, the transaction will take 7 days to bridge fully. For Optimism, this is 8 days. Additionally, it costs another ethereum gas transaction to actually send the token to your balance once they are transferred. In crypto, the saying “time is money” is even more apparent as any time waiting for a bridge to finish is time lost from generating passive yields. Assuming a relatively conservative 10% yield for stablecoin investments in Defi, this week-long waiting process directly correlates to ~20bps of lost yields, which can be thought of effectively as an upfront bridging fee. \"Fast\" Third Party Bridges Going from Mainnet to L2 (~5-10 minutes to bridge):   Multichain: $0.90 base fee   Synapse: Minimum 8 bps of fees, additional slippage based on the liquidity of the starting and destination chains, at times 10+ bps extra. (positive slippage possible, quite rare)   Stargate: Minimum 6 bps of fees, additional slippage based on the liquidity of the starting and destination chains, at times 10+ bps extra. (positive NOT slippage possible)   Hop: Minimum 6 bps of fees, additional slippage based on the liquidity of the starting and destination chains, at times 30+ bps extra. (positive slippage is NOT possible)   Celar: Minimum 4 bps of fees, additional slippage based on the liquidity of the starting and destination chains, at times 10+ bps extra. (positive slippage is NOT possible)   Going from L2 to Mainnet (~5-30 minutes to bridge):   Multichain: $40 base fee, plus 10 bps (maximum of $1000 per bridge)   Synapse: $60 base fee, plus 8 bps, plus additional slippage based on the liquidity of the starting and destination chains, at times 10+ bps extra. (positive slippage possible, quite rare)   Stargate: ~$50 base fee, plus 6 bps, plus additional slippage based on the liquidity of the starting and destination chains, at times 10+ bps extra. (positive slippage is NOT possible)   Hop: $50 base fee, plus 6 bps, plus additional slippage based on the liquidity of the starting and destination chains, at times 30+ bps extra. (positive slippage is NOT possible)   Celar: $50 base fee, plus 4 bps, plus additional slippage based on the liquidity of the starting and destination chains, at times 10+ bps extra. (positive slippage is NOT possible)   It’s important to note that there needs to be sufficient liquidity on the destination chain to complete the bridge for all third party bridges, or else there will be no tokens to redeem once the bridging has finished. Maker Teleport Bridge Our proposed 1bps flat fee for all bridges is advantageous for the end-user in mostly every situation aside from a few edge cases. Compared to third-party “fast” bridges, Teleport will be even faster, with near-instant bridging capabilities. Further, the flat 1 bps fee is >75% cheaper than other bridges. The story is much the same when comparing to native bridges. We believe the ability to now bridge fully composable DAI to these L2s instead of creating a wrapped version on the destination chain, leaving the bridge contractors susceptible to malicious hackers, offsets the 1 bps fee. Further, on the way back to mainnet, the saved week-long wait can be equated to 20 bps of lost yields, something that could have been earned with an instant bridge charging only 1 bps. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.099871959026888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#21",
                    "likes": "2",
                    "time": "20/05/2022-08:28:12",
                    "content": "This poll ended yesterday with a majority of non-abstain respondents in favour. An on-chain poll will follow on Monday. Thank you to everyone that participated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#22",
                    "likes": "10",
                    "time": "22/05/2022-16:44:22",
                    "content": "Hello, I’d like to provide additional context before the poll goes live. This was originally part of some private negotiations, but it’s become clear now that this is no longer important. Stablecoins are likely to be the vast majority of cross-chain transfers. This is great, but due to our permissionless PSMs it actually allows other stablecoins to use our system without paying or promoting Maker / DAI as the back-end. Ideally we would like to be able to charge only other stablecoins for using our system, but there is no way to do this without charging for DAI transfers as well unless we turn on the fees for PSMs (which I am against as this is very bad for RWA borrowers). I think as long as we are the most competitive we should be able to charge a small fee. If it later becomes clear that this is not optimal then we can lower it. Long term when we solve USD redeem-ability for DAI directly we can shift the fees to the PSMs and make DAI free. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.635272727272728
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#23",
                    "likes": "1",
                    "time": "23/05/2022-03:40:08",
                    "content": "I agree a tiny fee is a good idea. It makes it much easier PR-wise to raise fees later if needed. It also adds a bit of friction for attacks and attempted attacks against the bridge. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#24",
                    "likes": "0",
                    "time": "24/05/2022-21:44:57",
                    "content": "Regardless if MKR token owners & Delegates decide a Fee is good, or not–landing some deals for the integration of Maker Teleport into other 3rd party apps will be lucrative. Hop & InstaDapp have made an initial move, w/out DAI inclusion:  image1096×1328 87.4 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HospitableOryx",
                    "index": "#25",
                    "likes": "1",
                    "time": "25/05/2022-02:46:14",
                    "content": "Thank you Juanbug for the indispensable analysis. How price-sensitive do you think bridge users are to fees? Based on what I’ve read about DeFi yield farming, it seems like users are very sensitive to fees/returns and move capital quickly in response to incentives. With a 1bps fee, it sounds like we’re drastically undercutting the market and creating a significant incentive that we expect users to respond to. Have we seen users being responsive to pricing changes (if any) with existing bridges? If we don’t make Teleport free now, I think that we should revisit making Teleport free in the future once we have a better sense of market appetite. If we think that bridges will go through a growth phase where they exponentially increase in usage in the future, we want to be positioned as the obvious, easy, default option before that growth trajectory launches (cross-reference Allan’s comment’s on the story we tell). The only way to do that is to be free. Put another way, if we think the raw total addressable market here will be huge someday, it seems relatively cheap to go all-in here and get exposure to potential asymmetrically large upside. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.093469250048197
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#26",
                    "likes": "4",
                    "time": "25/05/2022-02:53:44",
                    "content": "The most likely scenario is that we enter a world where bridge/dex aggregation services will just pick the most optimal route and switch between services the minute the fees become lower somewhere. This is DeFi and fortunately there is no such thing as vendor lock. If volume starts routing elsewhere we can lower the fees then and pick up the volume again immediately. Much like we can get the bulk of ETH and WBTC market share just by undercutting the competition, but not free we should do the same here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HospitableOryx",
                    "index": "#27",
                    "likes": "2",
                    "time": "25/05/2022-03:06:39",
                    "content": "Ah, duh. That makes sense. I’m coming from a b2b software background where things are not quite as liquid. It sounds like the “what’s the story” question is not as important when you’re merely building a “money lego” that will be aggregated and abstracted away. I will vote in favor of this proposal with the understanding that we can update to free later if we find there are new market dynamics at play. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.113636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#28",
                    "likes": "8",
                    "time": "25/05/2022-10:53:51",
                    "content": "I will add - in the triad of fee-generating possibilities that we have, namely:  Net interest margin Fees and commissions Trading revenues  We basically are overexposed to 1. This business is unfortunately susceptible to the vagaries of macro cycles. At the moment, even as rates rise elsewhere, crypto lending is facing an environment of compressed yields as capital rotates out of the asset class. We don’t have a business on 3. yet as we do not have proprietary positions and likely will never offer brokerage services. The only remaining lever for growth that we have left is 2. Over time competition may well push it to 0. But until it does, there is no benefit (not even marketing benefit) to writing off completely the capital investment and ongoing maintenance that go into the bridge. Also, considering the compressing environment, do we really have the luxury to say no to revenue-generating opportunities? Especially when they stand to absorb a significant amount of bridge market share on a purely comparative basis alone (1bps is much much much lower than competitive bridges). As others have said before, you can make it go from 1 → 0 much more easily than from 0 → 1. Edit: changed a-> arrow to a → because of the existential pain ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.585622710622711
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MightyOx",
                    "index": "#29",
                    "likes": "2",
                    "time": "25/05/2022-19:49:46",
                    "content": "Voted Yes - this is a critical initiative for MakerDAO’s multichain future with a reasonable fee that can help generate additional revenue. As others have mentioned, the fee can be removed if it becomes a roadblock. However, in light of the many recent bridging exploits, I’m sure that many users will pay a small fee for Maker’s security and reliability if given the option. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.027777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#30",
                    "likes": "0",
                    "time": "25/06/2022-05:49:59",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1077"
}