{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-update-6s-vault-parameter-to-appropriate-applicable-rate/16861",
            "title": "[Signal Request] Update 6S Vault Parameter to Appropriate Applicable Rate ",
            "index": 16861,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-withdrawn",
                "impact-:-medium",
                "signal-request"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#1",
                    "likes": "6",
                    "time": "27/07/2022-19:07:59",
                    "content": "Background The 6S conformed credit agreement states that the Applicable Rate shall be the Prime Rate as published daily in the Wall Street Journal minus 25 basis points.  Screen Shot 2022-07-27 at 2.43.31 PM1208×148 33.2 KB   Screen Shot 2022-07-27 at 2.43.39 PM1342×368 88 KB  At the genesis of the 6S vault, that was 3.00%, but that rate has never been adjusted on chain. Apparently the trust will not adjust the fees until they are adjusted on-chain, so Maker is losing revenue by not updating the rate to reflect the agreed-upon terms. This signal requests that the on-chain vault rate reflect the appropriate level, particularly after two substantial rate hikes. Should the 6S vault stability fees be reset to the Prime Rate as published by the Wall Street Journal on August 10, 2022? (August 10th will be the date this signal request is scheduled to close) Note that the credit agreement may or may not allow Maker to adjust the Applicable Rate by a maximum amount, which means it may not be possible to fully “catch up” the rate in a single raise. Also note that the Applicable Rate at the trust level appears to only update on the 1st of a month, so any executive updating this parameter should keep that in mind. Pros More accurately reflect the fees accruing in the 6S vault Apparently needed to update fess charged at the trust level Marginally more revenue Cons 6S will have a fairly substantial jump in rates since Maker did not raise it as rates rose over the last year    Set 6S Vault Stability Fee to Prime Rate minus 25 bps as published in the WSJ on August 10?  Yes No Abstain     0 voters     If this signal is successful, the parameter change will move to an on-chain MKR poll. This signal closes on August 10. Tagging @g_dip and @mrabino1 so they’re not surprised. ",
                    "links": [
                        "https://www.bankrate.com/rates/interest-rates/wall-street-prime-rate/",
                        "https://forum.makerdao.com/t/6s-capital-rwac-monthly-report-may-2022/15686/3",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/9",
                        "https://forum.makerdao.com/t/prospective-rwf-0x-july-2022-monthly-report/17003",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-28-de-julio-03-de-agosto-del-2022/17139",
                        "https://forum.makerdao.com/t/governance-and-risk-202-thursday-august-04-at-17-00-utc/16978/2"
                    ],
                    "GPT-summary": "The author of the post is explaining a proposal to update the 6S vault parameter to reflect the agreed-upon terms of the credit agreement. The proposal requests that the on-chain vault rate reflect the appropriate level, particularly after two substantial rate hikes. The post also includes pros and cons of the proposal. A 3rd party is giving constructive criticism by pointing out that the 6S vault will have a substantial jump in rates since Maker did not raise it as rates rose over the last year. The post also includes a call to action for readers to vote on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.911309523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "27/07/2022-19:08:00",
                    "content": "This post has been reserved for GovAlpha’s proposal summary ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "1",
                    "time": "27/07/2022-20:32:51",
                    "content": "6S Capital is the Author and grandfather of MIP21 and the introducer of the Delaware Statutory Trust Structure (currently being used by HVB) which was an EXPENSIVE endeavor that was NOT subsided by the DAO. To date, RWA001-A Vault has not yielded winning results for either MakerDAO, or 6S. More than likely it has been a LOSING proposition for 6S. 3F Delegate recommends to the community to keep the RWA001-A Stability Fee steady at 300 basis point and Poll NO to this Signal Request, as the recommended increase to prime rate -25 bps will not do anybody any good. Lets focus on the innovation ahead (EndGame) and not impede relationship growth for a fistful of DAI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.976190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#4",
                    "likes": "4",
                    "time": "27/07/2022-20:39:06",
                    "content": "    flipflopflapdelegate:  3F Delegate recommends to the community to keep the RWA001-A Stability Fee steady at 300 basis point and Poll NO to this Signal Request, as the recommended increase to prime rate -25 bps will not do anybody any good.   Can you expand on this? It’s not a recommendation. It’s simply updating the parameters to reflect what is in the credit agreement. Maker cannot even fully raise the fees to what 6S agreed upon in the credit agreement. This shouldn’t be viewed as punitive. It’s due to this parameter never being updated, when it should have been adjusted upwards three times already: +25 basis points in March 2022 +50 basis points more in May 2022 +75 basis points more in June 2022 +75 basis points more now Continuing to not raise it to the level in the agreement means Maker risks taking even longer to catch up. As you can see, the fees are already in excess of the maximum the agreement will allow to take effect. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.601190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#5",
                    "likes": "2",
                    "time": "28/07/2022-01:48:50",
                    "content": "The facility is designed to work in such a way that it reflects Maker’s independent assessment of what 6s should pay, plus the DSR. We only used Prime as a benchmark because WSFS insisted on using an established benchmark and wouldn’t let us reference the DSR. Note that the spread applied can be less or more than Prime, which wouldn’t make sense if we were trying to benchmark to Prime. In that context, has the risk of the 6s Vault substantially changed since its inception? Or is Maker just trying to extract as much value as possible from the facility? To echo @flipflopflapdelegate , this has been a pretty thankless experience for 6s. I voted no in the poll. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.489583333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#6",
                    "likes": "4",
                    "time": "28/07/2022-01:55:53",
                    "content": "I am reading the rate as being a variable/floating rate linked to prime minus 25bps. I dont understand why we wouldnt reset it to reflect the contractually agreed upon rate. If rates went down I am sure 6S would be requesting a repricing as soon as possible… But that is really besides the point, the repricing should be automatic (it states it resets daily) based on the floating rate ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.444444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#7",
                    "likes": "0",
                    "time": "28/07/2022-02:01:33",
                    "content": "    6S Capital - RWAC Monthly Report - May 2022 Miscellaneous       The facility is “programmed” to track the Maker stability fee, so nothing has changed. I’m not sure where you sourced that quote but here is the language from the conformed credit agreement.  “Applicable Rate” means, for any day, a rate per annum (rounded, if necessary, to the next 1/16 of 1%) equal to the Prime Rate in effect on such day, plus the Spread as set forth in the applicable Note. The initial Spread shall be -25 basis points.  “Spread” means the difference between the interest rate ce…     ",
                    "links": [
                        "https://static1.squarespace.com/static/60942fb61249302a48a934a5/t/61130d4225a5da3f1991b36e/1628638530538/Credit+Agreement+7.29.21+-+conformed+-+redacted.pdf"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#9",
                    "likes": "0",
                    "time": "28/07/2022-03:40:10",
                    "content": "Are you guys reading my replies? Has anyone actually read the agreement? According to the agreement and every previous post/communication regarding this facility, it does not and was not intended to track the prime rate. There is an additional spread in place which evens out the rate to whatever Maker wants it to be (with certain limitations, e.g. usury laws). Maker can raise the rate if it wants, but that decision should have nothing to do with mechanical changes in the Prime rate because it doesn’t and isn’t supposed to track that rate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.447619047619048
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#10",
                    "likes": "5",
                    "time": "28/07/2022-04:42:42",
                    "content": "    GFXlabs:  Can you expand on this?   I’m under the believe that the 6S deal was structure in the hope that it would scale into the Billions, therefore those terms were proposed. But since I believe 6S has spent more money on innovating via MIP21 and their vault has been pushed to a stagnant phase, it would send a terrible signal to future RWA applicants who want to scale via MakerDAO. Therefore I recommend that this vault should be left as is until the DAO can find a path forward were both MKR token owners and 6S benefit from a mutual relationship. I believe that fundamental business principles are statements that a DAO should also adhere to in order to identify its RWA priorities and guide future decisions. One of those key principles is promoting MakerDAO’s products, services, and it’s strength. The DAO should treat its current and future partners with better business sense. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.95
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#11",
                    "likes": "1",
                    "time": "28/07/2022-10:32:47",
                    "content": "    g_dip:  Maker can raise the rate if it wants, but that decision should have nothing to do with mechanical changes in the Prime rate because it doesn’t and isn’t supposed to track that rate.   Hi Greg. This conflicts with our reading of this:  Screen Shot 2022-07-28 at 6.29.21 AM1716×214 49 KB  and this:  Screen Shot 2022-07-28 at 6.29.34 AM1758×218 98.1 KB  and this:  Screen Shot 2022-07-28 at 6.34.38 AM1808×788 115 KB  At this point, it’s probably best to tag @Real-World-Finance to provide some insight, if they have any. Also, if there are additional resources you can provide to support that this is not supposed to mechanically float, that would be helpful. Our view is that if people feel strongly the rate should stay at 3%, they should start a Signal Request to alter the spread to minus 250 bps, and should be a separate discussion from simply updating a parameter. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.486111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#12",
                    "likes": "1",
                    "time": "28/07/2022-12:17:38",
                    "content": "Which part of it conflicts?     GFXlabs:  Also, if there are additional resources you can provide to support that this is not supposed to mechanically float, that would be helpful.   The screenshot you pasted above is the resource I am using. Prime = x Ex: 5.5% Rate by Verification Agent = Maker stability fee = y Ex: 3% Spread = y - x = z (note that z becomes further negative as Prime increases and the Maker rate stays the same) Ex: 3% - 5.5% = -2.5% Applicable Rate = y + z Ex: 5.5% - 2.5% = 3% The Vault tracks the Maker stability fee not Prime. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pipko",
                    "index": "#13",
                    "likes": "5",
                    "time": "28/07/2022-12:55:40",
                    "content": "Based on the credit agreement the lender should be providing written notice to the borrower reflecting the adjustments of the spread component.  As your post mentions, spread (z) has become increasingly negative as the prime rate has increased. Can you provide the written notices reflecting the spread changes after each prime rate increase? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#14",
                    "likes": "0",
                    "time": "28/07/2022-13:11:53",
                    "content": "Since the spread component is a static formula, where do you see an adjustment? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pipko",
                    "index": "#15",
                    "likes": "2",
                    "time": "28/07/2022-13:42:01",
                    "content": "    g_dip:  Spread = y - x = z (note that z becomes further negative as Prime increases and the Maker rate stays the same) Ex: 3% - 5.5% = -2.5%   According to this explanation, the spread is not static:  At origination z (Spread) = y (Verification Agent / Maker SF) - x (Prime Rate), therefore -25bps (spread) = 300 bps (Verification Agent / Maker SF) - 325 bps (Prime Rate) Currently -250bps (spread) = 300 bps (Verification Agent / Maker SF) - 550 bps (Prime Rate)  The spread has changed from -25 bps to roughly -250 bps, correct? Where and when was notice given to the borrower of the spread change? Either the contract floats off the prime rate and a given spread, or we are updating the spread to maintain an flat rate for the borrower and giving written notice of the spread change to the borrow. IMO we can’t have it both ways. Please let me know if I’m misunderstanding something. Seems like @GFXlabs, @PaperImperium, and I are thinking the same way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.578125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#16",
                    "likes": "1",
                    "time": "28/07/2022-13:50:57",
                    "content": "Upper Fed Funds Target is 2.50% - How are some supporting a credit rate at 3.00% when interest conditions have materially changed… Soon it will be better to just deploy the capital in a Savings account ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#17",
                    "likes": "0",
                    "time": "28/07/2022-13:53:22",
                    "content": "I think this conversation has pushed beyond the boundaries of pointless, but I’ll just reiterate that while the spread is not static the “spread component” was intentionally designed as a formula so that constant maintenance would not be required. If Maker raises the stability fee, I’d imagine that there would be a similar lack of required written notice unless the formula itself changes. To imply that the formula should not be used unless it’s redundantly applied via a notification from the Trust Sponsor would mean that the Trust Sponsor has discretion over the implementation of rates… Which is something Maker would clearly not want. In summary, my initial point stands – the facility uses the Maker stability fee to set interest rates. Prime was only inserted to satisfy the Trustee. In an ideal world it would have just said “applicable rate = Maker stability fee”. It still says this, but in a roundabout way. You guys can raise the rate if you want. You will only create more headaches for the DAO given the utilization of the facility is low and the increase will generate more in phantom stability fees than it does in actual revenue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.279166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#18",
                    "likes": "6",
                    "time": "28/07/2022-13:55:24",
                    "content": "I am reading the interest rate this way as well. Applicable Rate = Prime + Spread per defined terms Spread is initially set at -25bps in Applicable Rate definition Section 2.07 (b) states that the Lender may adjust the Spread before the end of a given quarter at the request of the Trust Sponsor. (1)  So unless Trust Sponsor has been adjusting the Spread down, it is till -25bps (2)  If the Trust Sponsor has been adjusting the Spread down, where is the appropriate documentation and how/why was this authorized? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.236111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#19",
                    "likes": "0",
                    "time": "28/07/2022-13:58:17",
                    "content": "where is the Maker Stability Fee defined in the documents?  Hopefully this can help clear things up I will also see if anyone at RWF remembers/did the actual deal as I did not ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#20",
                    "likes": "0",
                    "time": "28/07/2022-14:03:15",
                    "content": "The Maker stability fee is the rate inputted by the Verification Agent. See the Trust Agreement and its exhibits. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pipko",
                    "index": "#21",
                    "likes": "0",
                    "time": "28/07/2022-14:03:46",
                    "content": "    g_dip:  Since the spread component is a static formula, where do you see an adjustment?       g_dip:  I’ll just reiterate that while the spread is not static the “spread component” was intentionally designed as a formula so that constant maintenance would not be required.   Is the spread static or not static? Under the language of the credit agreement the spread is static (unless updated with written notice to the borrower) and the instrument is a floating rate debt instrument, a structure which Maker has not enforced.     g_dip:  You guys can raise the rate if you want. You will only create more headaches for the DAO given the utilization of the facility is low and the increase will generate more in phantom stability fees than it does in actual revenue.   I agree with you 100% on this from a customer relationship / customer management perspective. That being said, the debt instrument should perform as written in the CA as a default. Looks like in this situation the instrument was administrated and serviced in a borrower friendly way without anyone at RWA communicating this to the DAO as rates increased 250 bps. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.989583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#22",
                    "likes": "0",
                    "time": "28/07/2022-14:04:49",
                    "content": "But I disagree that we even need to clear things up. This is a semantic point. If Maker thinks the rate should be higher, it’s entirely within its ability to raise it. I’m only here to point out that it will not do so mechanically without a change in the stability fee. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#23",
                    "likes": "0",
                    "time": "28/07/2022-14:10:04",
                    "content": "Greg - folks are asking fair questions.  Can you please provide the documentation that shows that the rate is defined as you say it is? Given how the credit agreement is written, it appears to float on the Prime Rate, though it appears that may not be the broader reality ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#24",
                    "likes": "0",
                    "time": "28/07/2022-14:15:07",
                    "content": "deleted by user ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#25",
                    "likes": "0",
                    "time": "28/07/2022-14:27:12",
                    "content": "All the docs are public and I’ve already explained this in detail. There’s not much else that I can offer here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pipko",
                    "index": "#26",
                    "likes": "2",
                    "time": "28/07/2022-16:21:41",
                    "content": "The way I see it, there are several key questions here:   Is the 6s / RWA-001 facility a floating or fixed rate instrument?   The original term sheet is quite clear that the pricing is based on a floating component (Wall Street Prime) + a Maker risk adjustment. Notably that risk adjustment is proposed to be a function of the total debt ceiling (representing a rate subsidy vs. prime at smaller debt tonnage).  5105cc75ab408fa5911ca06d0e1152ba18c874401920×2485 209 KB    Somewhere from the term sheet to the finalized CA the structure changed:   “Applicable Rate” means, for any day, a rate per annum (rounded, if necessary, to the next 1/16 of 1%) equal to the Prime Rate in effect on such day, plus or minus the Spread.  “Spread” means the difference between the interest rate certified by the Verification Agent on a given date and the Prime Rate. Putting these together: “Applicable Rate” means […] a rate per annum […] equal to the Prime Rate […] plus or minus the difference between the interest rate certified by the Verification Agent on a given date and the Prime Rate.     This reads like fixed rate, unless Maker votes on a stability fee change. This is unfortunate because both the original term sheet and the face-value language in the credit agreement suggest a floating rate instrument unless you read very carefully. I guess it depends on whether it’s reasonable to expect Maker holders to read the CAs of every RWA deal?     If it is a fixed rate instrument why has the Lender not provided written notice to update the Spread?  Shouldn’t our Lender be providing written notice to the borrower of spread changes in accordance with the credit agreement? Shouldn’t the arranger (working hopefully on behalf of Maker) be communicating with MKR holders and trying to extract the best possible returns out the debt we have deployed?    ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.439130434782609
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#27",
                    "likes": "2",
                    "time": "28/07/2022-16:51:49",
                    "content": "    pipko:  I guess it depends on whether it’s reasonable to expect Maker holders to read the CAs of every RWA deal?   I don’t think so. I think anyone getting paid by the protocol to issue recommendations about RWA facilities should have read the credit agreement, especially considering that it’s one of a handful of live facilities and the final documentation has been available for a very long time. Ironically, 6s wanted the rate to be attached to prime (hence the borrower-proposed term sheet) and it was MKR-holder feedback at the time that caused it to be changed. Their logic was that they may need to raise the rate over prime, so we shouldn’t box ourselves in. So I think they did read this specific credit agreement, for whatever it’s worth.     pipko:  Shouldn’t our Lender be providing written notice to the borrower of spread changes in accordance with the credit agreement?   Once again I believe you are misinterpreting. The “Spread” is a variable in the agreement that has been set to a formula. The Spread from an economic perspective is variable, the Spread in the legal agreement is referring to the formula. No one is going to provide written notice unless Maker changes the formula. There’s really no point in arguing this because this is obviously how the Trustee and Trust Sponsor have interpreted it thus far. If you want to change it to be that they’ll write 6s every time the spread changes (which happens automatically anyway), that’s an easy thing to do.     pipko:  Shouldn’t the arranger (working hopefully on behalf of Maker) be communicating with MKR holders and trying to extract the best possible returns out the debt we have deployed?   For one, what exactly is an arranger? I’ve only seen this term used as a meme and not in a practical definition. Two, who is the arranger in this context? Three, if there’s any misconception that RWA Co. is an arranger, let me correct that now by clarifying that we are not. Our role in the 6s facility is monthly reporting to the DAO, nothing more or less. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.8470075757575755
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#28",
                    "likes": "5",
                    "time": "09/08/2022-23:47:00",
                    "content": "Given the current uncertainty around RWF staffing and higher priority RWA issues at the moment, we are withdrawing this signal for now. It is not urgent and can be revisited when there is a more settled environment where it doesn’t risk becoming a distraction. This was intended to be simply tying up a loose end rather than beginning a new debate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.8996003996004
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#29",
                    "likes": "0",
                    "time": "09/09/2022-09:47:06",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}