{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/confirmation-not-enough-info-is-available-in-tx-logs-to-determine-interest-accrued/8513",
            "title": "Confirmation: Not enough info is available in tx logs to determine interest accrued ",
            "index": 8513,
            "category": [
                "Miscellaneous",
                "Developers"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/bohendo",
                    "index": "#1",
                    "likes": "1",
                    "time": "03/06/2021-10:03:39",
                    "content": "I’m building a portfolio analyser that converts chain data into asset distribution over time. I’m trying to determine how much interest income has been earned from DSR. Given the tx logs of a compound withdrawal, I can parse out the starting balance, new balance, and, from these, calculate how much principal is being withdrawn and how much income from interest has accrued. It looks like maker does not provide such info in it’s tx logs. I see that the system logs nothing except notes containing fn signatures & arguments and suck, drip, move, exit, none of these take chai as an argument which is what I think I need to determine how much interest has accrued since depositing. Put another way: given 2 tx receipts: a deposit of 100 DAI and a withdrawal of 100 DAI, what balance remains in that account’s DSR? Can someone confirm: is it really impossible to calculate how much interest has accrued from tx logs without having access to an archive node? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.26094276094276
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "02/09/2021-16:03:44",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}