{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-repeal-parameter-changes-proposal-makerdao-open-market-committee-june-28-2021/9242",
            "title": "[Signal Request] Repeal \"Parameter Changes Proposal - MakerDAO Open Market Committee - June 28, 2021\" ",
            "index": 9242,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "rates",
                "sig-status-rejected",
                "ppg-omc-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "1",
                    "time": "08/07/2021-00:04:53",
                    "content": " Overview A parameter change was proposed and put into a poll which dramatically affects the cash flow of MakerDAO. These changes are currently in the executive awaiting passage, and there is no way to organize opposition to these rate changes short of campaigning against the entire executive. These changes are drastic in nature, and should be opposed on grounds of both process and substance. Given:   The proposed changes to rates are large, with a 42% reduction in rates for our largest ilk and similar across nearly all Maker ilks, representing millions of dollars in lost revenue on even a monthly basis,   The changes were put into an on-chain poll the very day they were proposed,   There was no attempt to informally poll the community about these changes,   The changes were put into an active poll at a time when no other new polls were created,   These changes were immediately put into a poll exactly as proposed by a group that is not vested with any power by MKR holders,   That this group violated the very MIP46 it is organized under, which repeatedly names discussion and feedback as a requirement, and clearly states, “Sufficient time must be given for discussion,”   The stated rationale behind these changes is to grow DAI supply, and DAI supply daily sits at new highs already,   That revenues have been rising for Maker, indicating that no rate cut is necessary to maintain competitiveness with other protocols,   That the only alternative to this signal is to fight the current executive proposal, which includes other necessary things,   …then MakerDAO members should loudly and forcefully vote YES in the poll below. Maker is known to stand for decentralization. Decentralization is not a small group of unelected members putting a poll on-chain the very same day as their proposal is announced. That small group was given time to wrangle votes, quietly plan and discuss amongst themselves, and present a plan immediately on-chain. That no opposition could be organized in such short time should not be surprising. Whether you agree or disagree with whether Maker should drastically slash income even in the face of a growing supply of DAI and revenue, any civil person can agree that even a self-appointed group organized under MIP46 is still bound by its own terms of formation to allow “Discussion - Parameter Proposals must be presented with enough of a feedback period to give the community time to respond and discuss the proposal. Questions, concerns, or queries must be answered if brought up by the Maker community, and feedback must be considered before finalizing the proposal.” While surely unintentional, Maker cannot leave intact this deviation from our solemn aspiration of decentralization and due process. **Vote YES to repeal “Parameter Changes Proposal - MakerDAO Open Market Committee - June 28, 2021”    Should Maker Repeal \"“Parameter Changes Proposal - MakerDAO Open Market Committee - June 28, 2021?”  Yes No Abstain     0 voters     This poll will run for 7 days (until Wednesday, July 14, 16:00) ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmfZWY87?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355",
                        "https://forum.makerdao.com/t/mip46-parameter-proposal-groups/6341",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355/28",
                        "https://forum.makerdao.com/t/maker-relay-ep-53-en-espanol/9330",
                        "https://forum.makerdao.com/t/signal-request-shorten-the-ppg-process/8862/19",
                        "https://forum.makerdao.com/t/maker-relay-ep-53/9305"
                    ],
                    "GPT-summary": "The post is about a proposal to change the rates for MakerDAO, which was put into an on-chain poll without any informal polling of the community. The author of the post is explaining why the proposal should be opposed on grounds of both process and substance. The post also includes constructive criticism of the proposal and questions about the changes. The proposal is currently awaiting passage, and the post is urging MakerDAO members to vote YES to repeal the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.194382006882007
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/07/2021-00:19:49",
                    "content": "It appears to me that you did not read this:     [Signal Request] Rates V2 Signal Archive       The rates working group would like to present the results of our discussion over the past 2 weeks into a formal proposal. We originally had a large document explaining how to adapt the formula from the current system, but as mentioned in this post we kept running into edge cases. Based on the results of the informal poll we have stripped down the proposal to the points below.  Current Issues:   Smart Contracts team finds it hard to follow how Base Rate change affects final Stability Fee for all …     Please correct me if Im wrong. ",
                    "links": [
                        "https://forum.makerdao.com/t/informal-poll-guidance-on-rates-v2/4444"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.252442002442002
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/07/2021-00:26:30",
                    "content": "    Akiva:  Please correct me if Im wrong.   The changes were submitted under the parameter proposal group organized under MIP46. It clearly states that in the proposal’s own title. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#4",
                    "likes": "1",
                    "time": "08/07/2021-00:32:41",
                    "content": "Well I think “not vested with any power” is not completely accurate. Regardless, you may consider opening your own PPG? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "1",
                    "time": "08/07/2021-00:36:25",
                    "content": "Tough call Sir, tough call. In one hand if I proposed to Jaime Dimon that we take a 42% cut I’d be out of a job tomorrow morning. On the other hand, this PPG has good intentions and is composed of trusted Community members. Also, I do believe the lack of whale MKR voters speaks volume–but I do worry that Core Unit Budget Distributions will be needed and a political point of view will hamper the ability to get funding to CUs. But then again–the voting is stagnant. So, what can you do. I had to vote “NO”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.7972222222222225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "1",
                    "time": "08/07/2021-00:39:01",
                    "content": "    flipflopflapdelegate:  I do worry that Core Unit Budget Distributions will be needed and a political point of view will hamper the ability to get funding to CUs.   To be clear, this signal exists so that the current executive does not need to be opposed, even with a component in it that violates Maker’s own due processes. Voting YES would simply repeal the aberrant parameter change once this signal completed our valued governance process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.479166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "3",
                    "time": "08/07/2021-00:50:47",
                    "content": "    PaperImperium:  Voting YES would simply repeal the aberrant parameter change once this signal completed our valued governance process.   Understood. But is that even possible? I would like to hear from GovAlpha if such is doable. I mean you make some valid points/arguments. I do think we the community had an opportunity to speak up but we have not, for a reason. That reason being that we seem to be content with the lack of due process. Or, perhaps exhausted. I can tell you that I have heard some old school MKR token hodlers and former voters who would tell you today that it was exhausting in the old days to figure out what Stability Fees should be. And that is one of the primary reasons they are no longer community members… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving entirely negative feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.7102272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#8",
                    "likes": "1",
                    "time": "08/07/2021-00:51:52",
                    "content": "    flipflopflapdelegate:  But is that even possible   It’s a rate change. I’m not sure why they wouldn’t be reversible. It would just be resetting the rates to what they are today. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NH98",
                    "index": "#9",
                    "likes": "1",
                    "time": "08/07/2021-02:36:32",
                    "content": "I read through the different posts and it doesn’t seem that there is an actual economic analysis outlining the pros and cons of this proposal? Maybe I’m not looking deep enough but if someone could point me towards something that would be great. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#10",
                    "likes": "4",
                    "time": "08/07/2021-04:05:41",
                    "content": "I will not comment on the specifics of your opposition to the process but by and large, there is going to be a tradeoff between fast reactions and consensus building. It may be worth discussing that independently if you wish. I believe the following points are the non-process related arguments - correct me if I should have added any of the others from your list.     PaperImperium:   The stated rationale behind these changes is to grow DAI supply, and DAI supply daily sits at new highs already    The rationale behind these changes was indicated both in the original post and a reply later in the thread. I am quoting both here.  The Open Market Committee has identified the concerns of the community around tail-risk with USDC as being a material discussion point on the topic of the longevity of MakerDAO. As a result we have concluded that the optimal course of action is to increase DAI supply (from non-PSM ilks).   The OMC has identified moving the USDC off the books as a primary goal.  I think both posts were fairly clear. It is not to grow DAI supply, it is to grow DAI supply from non-PSM ilks. The rationale has been clearly described as concerns around the amount of USDC on the books.     PaperImperium:   The proposed changes to rates are large, with a 42% reduction in rates for our largest ilk and similar across nearly all Maker ilks, representing millions of dollars in lost revenue on even a monthly basis    Technically, depending on how many users choose to mint DAI at the new rates, this statement might not be true. However, even if it is, the supply increase of DAI is needed to ensure that DAI remains on peg without (mis)using the PSM. For much too long, the PSM has been used as rug under which we’ve been sweeping our core DAI supply problems. DAI is taking lots of reputational damage because it is seen as a USDC wrapper and this is not an entirely false picture. I am glad that we’re finally waking up to this issue and correcting course.     PaperImperium:   That revenues have been rising for Maker, indicating that no rate cut is necessary to maintain competitiveness with other protocols,    This is really disingenuous now, @PaperImperium. You know better than most of us here that long term prospects can be in conflict with short term goals. Exclusively prioritizing revenue at the expense of a huge existential risk is not the right measure of competitiveness.     PaperImperium:  …then MakerDAO members should loudly and forcefully vote YES in the poll below.   For the reasons above, I disagree completely with this and have voted no. ",
                    "links": [
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-28-june-2021/8991/8"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.559391827684511
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#11",
                    "likes": "4",
                    "time": "08/07/2021-05:01:16",
                    "content": "    PaperImperium:  [Proposal] dramatically affects the cash flow of MakerDAO   My sense is the community has higher objectives than optimizing for short term profits.     PaperImperium:  These changes are currently in the executive awaiting passage, and there is no way to organize opposition to these rate changes short of campaigning against the entire executive. These changes are drastic in nature, and should be opposed on grounds of both process and substance.   To me this signal comes across as campaigning against this execute, or at least seems likely to have that effect.     PaperImperium:  These changes were immediately put into a poll exactly as proposed by a group that is not vested with any power by MKR holders ,   This statement seems crafted to suggest the group lacks legitimacy.  But as you later note the group is formed in accordance with MIP46, and happens to also have multiple members who are mandated actors vested with power by, and therefore accountable to MKR token holders.     PaperImperium:  That this group violated the very MIP46 it is organized under , which repeatedly names discussion and feedback as a requirement, and clearly states, “Sufficient time must be given for discussion,”   This criticism is not entirely unfair in this case but completely overlooks MIP46c3 which states:    MIP46: Parameter Proposal Groups   Urgent or emergency proposals from Parameter Proposal Groups should follow the existing guidelines for urgent or emergency proposals.   My sense is that as USDC backing Dai has recently skyrocketed, the community does want urgent action (consistent with maintaining 1 Dai = $1.00)  to dampen this phenomenon. The Parameter Changes Proposal in question clearly identifies this concern and objective:    Parameter Changes Proposal - PPG-OMC-001 - 28 June 2021   The Open Market Committee has identified the concerns of the community around tail-risk with USDC as being a material discussion point on the topic of the longevity of MakerDAO. As a result we have concluded that the optimal course of action is to increase DAI supply (from non-PSM ilks).       PaperImperium:  The stated rationale behind these changes is to grow DAI supply, and DAI supply daily sits at new highs already,   As noted above, the rationale is not just to increase the Dai supply, but to increase it from non-PSM ilks. I think it would be a mistake to optimize stability fees for MakerDAO profitability, which aside from process seems to be the main issue this signal is targeting.  Vault holders should be comfortable knowing that MakerDAO does not exist for the purpose of extracting rent. Additionally, understanding how vault holders react to rate changes is still in early stages.  Substantial rate changes create the risk of overshooting but also opportunities to gather that data. I am voting NO on this signal request. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip46-parameter-proposal-groups/6341",
                        "https://forum.makerdao.com/t/mip46-parameter-proposal-groups/6341/1",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-28-june-2021/8991/1"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.181556948798328
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#12",
                    "likes": "3",
                    "time": "08/07/2021-05:42:51",
                    "content": "just a formal point: Is this even a Signal Request if it is not having a clear next step? What should happen if “Yes” gets the majority? Should someone fork the Mainnet excluding the exec which is up for vote after the onchain poll passed with 12868 MKR in favour and 2.6 MKR against it? ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmfZWY87?network=mainnet#vote-breakdown"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#13",
                    "likes": "0",
                    "time": "08/07/2021-06:03:56",
                    "content": "    ultraschuppi:  Mainnet excluding the exec which is up for vote after the onchain poll passed with 12868 MKR in favour and 2.6 MKR against it?   Some times its bit expensive for minority. ))  Something should be done in that direction.  Besides to that according to Wyoming Law it should be 50% Quorum on protocol changes. Of course you can intrepert one way or another. But at least it should be 50% jf voting power from vote contract. Legal advice on that issue is a must. Tommorow finally somebody go to court and say !!! This  people were responsible.  wyoleg.gov    SF0038.pdf 41.24 KB       Besides to that. There are no alternative options were proposed. Budget proposal could go separate in Exec. I dont think somebody think that core units shouldt be incentivised. (Taking to the account the fight with Link) ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmfZWY87?network=mainnet#vote-breakdown",
                        "https://wyoleg.gov/2021/Introduced/SF0038.pdf",
                        "https://wyoleg.gov/2021/Introduced/SF0038.pdf",
                        "https://wyoleg.gov/2021/Introduced/SF0038.pdf"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.6
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#14",
                    "likes": "0",
                    "time": "08/07/2021-06:20:07",
                    "content": "Just to make it clear and simple. My voting power 40 Mkr. Voting power of my followers 500 Mkr. If we want some stability in Mkr holders and a Quorum. We should have some other way to vote other than on mainchain. Some times it cost 100$ And As I expected earlier that exec vote will stay on hold. First reason is market bearish santiment. Second - Mkr price manipulation expectations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#15",
                    "likes": "0",
                    "time": "08/07/2021-06:31:46",
                    "content": "And finally we should say great thank to Instadapp farmers which are responsible for increased Dai supply from PSM. Shall we booster farming even further. Yes we should. But lets disscuss the outcomes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#16",
                    "likes": "0",
                    "time": "08/07/2021-07:12:24",
                    "content": "I am against changing it because there is the poll before it and people voted on chain. However, I do agree that the rate change is a concern regarding the protocol security. And I do believe this group has a lot of pressure from the community. The reality is by introducing the PSM we opened the Pandora box. We now have some flexibility and more room on the rate setting. Before the PSM, the problem was easy, do we maintain the peg or do we cut the income. The first one was the priority. Now, the peg is not an issue as we traded it for the usdc risk ( less visible), so the priority has changed. And rates are a touchy parameter to change therefore what ever we do we will have this conversation over and over. Unfortunately, I can’t see how we can secure the protocol and not having this conversation again without an automated rate adjustment directly embedded into the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.726190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#17",
                    "likes": "0",
                    "time": "08/07/2021-07:18:28",
                    "content": "    alexis:  Before the PSM, the problem was easy, do we maintain the peg or do we cut the income. The first one was the priority.   I think the exact same measures apply now but it’s actually more clear what should be done. If the PSM USDC increased over the previous month, that means that DAI would have been, on average, over peg had there been no PSM. If the PSM USDC decreased, we know DAI would have been, on average, under peg. This should make rate setting easier and make it even more clear what direction we need to move in wrt rates. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.527777777777779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#18",
                    "likes": "8",
                    "time": "08/07/2021-07:31:45",
                    "content": "Let’s first add that the idea was already discussed with the community earlier in the DeFi Summer by MakerDAO post. There was wide support for the idea and this support was used as an input. A Governance Facilitator is in the group so I would say the process is followed.     PaperImperium:  The stated rationale behind these changes is to grow DAI supply, and DAI supply daily sits at new highs already,   Maybe you should understand the difference between DAI supply and DAI demand before (for which the imbalance is handled by PSM-USDC). The decision of the MOMC was not an easy one. You can certainly say we were too slow to react last month (and I agree we were, but easier in hindsight). Maybe too quick this month? Maybe. Is it better than 9 months ago? For sure. If you want to change the process, do it, if you want to propose another PPG, do it. But I don’t see the point in Signal Request to bypass the work of people mandated by the DAO to do it (and this PPG was never challenged by MKR holders if I’m correct and contains 3 mandated actors). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.602813852813853
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#19",
                    "likes": "4",
                    "time": "08/07/2021-08:22:22",
                    "content": "Not long ago, a big argument broke out because process was being followed too tightly (according to some, me included) which resulted in governance inaction when action was clearly preferable. I remember being scared that Maker would turn itself into a sclerotic org, with layers of rules capable of blocking obvious choices. Maybe that PPG vote was too rushed, maybe not, but I’m happy that it could happen at all. At the current margin, informal governance processes should go faster. The point of rules on this forum are, I think, just consensus-building. Actual executive power rests in the hands of MKR voters. They can reject any proposal. They can also create, vote on, and pass proposals without going through this forum or even the governance portal. So as long as there is rough consensus I think it’s basically fine to submit executives, and my perception on this PPG vote was that consensus was there. Finally on substance the rates change can be reversed with another executive. It’s not like a new collateral type was rushed through. And the PR impact of changing rates a little too fast does not worry me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.42998790425261
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#20",
                    "likes": "0",
                    "time": "08/07/2021-10:50:13",
                    "content": "    swakya:  Actual executive power rests in the hands of MKR voters. They can reject any proposal.   It is difficult to reject a proposal that is simultaneously birthed and polled — many do not even check here in a three day window. We will with one breath say that governance participation is so low and quality so lacking that we need to convince holders to delegate their votes, and then with the other that ramming through a proposal that violates its own MIP is ok?     swakya:  Finally on substance the rates change can be reversed with another executive.   That is exactly the purpose of this request. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.680555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#21",
                    "likes": "1",
                    "time": "08/07/2021-11:57:12",
                    "content": "    PaperImperium:  It is difficult to reject a proposal that is simultaneously birthed and polled — many do not even check here in a three day window.   To clarify, by “proposal” I meant “executive vote”. So rejecting is as easy as it gets: you simply don’t vote for it!     PaperImperium:  We will with one breath say that governance participation is so low and quality so lacking that we need to convince holders to delegate their votes, and then with the other that ramming through a proposal that violates its own MIP is ok?   I am confused as to what one of those things has to do with the other. It is simultaneously true that delegation will (one hopes) increase voting activity and that, very recently, a rate change seemed urgent, went to executive (with overwhelming onchain polling support), and may or may not pass the executive vote.     PaperImperium:  That is exactly the purpose of this request.   Right, so on process I’m clearly glad things can move along quickly so obviously I’m not supporting a reversal on that basis. On substance I was for the rates change and, if it passes, I hope we’ll learn a lot looking at how the market reacts. Very happy to revisit in a few weeks and evaluate then  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.861011904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#22",
                    "likes": "1",
                    "time": "08/07/2021-12:09:17",
                    "content": "    swakya:  I hope we’ll learn a lot looking at how the market reacts. Very happy to revisit in a few weeks and evaluate then    I don’t know how we will do that. We are leaving no ETH ilks as a control. We are capturing little time series data.     swakya:  may or may not pass the executive vote.   Let’s stop passing the buck to an absentee voter base. The absence of MKR holders from a 72-hour poll posted by itself without even a debate period on the forum should not be construed as the will of MKR holders. I struggle to reconcile the DAO’s principles of decentralization and duty to serve MKR holders with a small cadre slipping a poll immediately on-chain when there is no period of debate and they had the opportunity to find the de minimus votes required to pass, while any opposition is not afforded the opportunity to do the same. Surely you would feel differently if another small group self-styled themselves a PPG and followed the exact same process to double rates rather than cut them in half? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.927777777777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#23",
                    "likes": "2",
                    "time": "08/07/2021-12:20:58",
                    "content": "    flipflopflapdelegate:      PaperImperium:  Voting YES would simply repeal the aberrant parameter change once this signal completed our valued governance process.   Understood. But is that even possible? I would like to hear from GovAlpha if such is doable.   To clarify, the passing of the Executive Vote would change the parameters upon its execution. We would need another Exec in order to pass and execute in order to undue the rates change. So as far as @ultraschuppi 's point on next steps, the most direct line would be having this signal lead to an onchain poll to roll back the latest rates changes from the MOMC. Then if that passed it could then be included in the following exec to “undo” the rates changes. Might be worth adding that clarification to the poll @PaperImperium, unless you were envisioning something different. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#24",
                    "likes": "0",
                    "time": "08/07/2021-12:42:23",
                    "content": "    PaperImperium:  Surely you would feel differently if another small group self-styled themselves a PPG and followed the exact same process to double rates rather than cut them in half?   Great question, thank you! So after introspecting a little bit and with the usual caveats about bias etc, I would not feel bad about the process at all, I would hope the executive does not pass, and I would not want to wait a few weeks before discussing lowering rates again. That last part is not in symmetry with my current “let’s wait a bit” stance, maybe for good reasons (temporarily excessive rates can create lasting PR damage whereas temporarily insufficient rates are just some lost revenue) but also maybe for bad ones (more motivation to keep an outcome I agree with than to keep one I don’t like). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.06469298245614
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#25",
                    "likes": "13",
                    "time": "08/07/2021-13:44:47",
                    "content": "So I want to start out by thanking you for raising this as an issue, @PaperImperium, it’s hard to get people invested in the process of governance itself, and it’s always a highlight when someone does, even if it’s to object in some way.     PaperImperium:  That this group violated the very MIP46 it is organized under , which repeatedly names discussion and feedback as a requirement, and clearly states, “Sufficient time must be given for discussion,”   You are correct that the process we followed violated the spirit of MIP46. I’ll go into a little detail about why I decided this was fine in this case a bit further down.  With all this said, if you’re going to setup signal requests like this, please make an effort to present the issue in a neutral and unbiased manner. You have argued towards repeal, and spent no words on arguing the advantage to making this exception to process. The inclusion of emotionally charged terms and lack of representation of the other side, makes this feel like an effort to convince people to vote in favour of repeal. Signal Requests are intended to reveal and solidify consensus, not to push one side of an issue.      PaperImperium:  That small group was given time to wrangle votes, quietly plan and discuss amongst themselves,   Just to be clear, while I recognize the opportunity for this, none of this happened.     PaperImperium:  Discussion - Parameter Proposals must be presented with enough of a feedback period to give the community time to respond and discuss the proposal. Questions, concerns, or queries must be answered if brought up by the Maker community, and feedback must be considered before finalizing the proposal.   To this, I would argue that this proposal was at least partially a response to the feedback from the previous proposal.     flipflopflapdelegate:  Understood. But is that even possible? I would like to hear from GovAlpha if such is doable.   We would put up another on-chain poll, if it passed we would include a repeal in a subsequent executive vote.     SebVentures:  A Governance Facilitator is in the group so I would say the process is followed.   Want to push back a bit on this. My presence isn’t a guarantee that we’re doing the ‘right’ thing.     PaperImperium:  It is difficult to reject a proposal that is simultaneously birthed and polled — many do not even check here in a three day window.   So I want to be clear that I’d considered this issue, and ensured that I informed the larger holders that I am in contact with that the vote existed, and that it reduced rates. I also encouraged them to vote.  So, I should have included my reasoning for breaking the process in the thread in question. I did respond to it, but should have been more clear as to why I felt it was valid. So I’ll do that now: I felt it was acceptable in this instance to expedite the process because:  Response to the previous PPG proposal did not feel that we had gone far enough with changes - and people were concerned that the delay was resulting in a lack of competitiveness and materially harming the protocol. The mandated actors had also discussed the idea of further rate reductions outside of the PPG and were broadly (though not entirely) in favour. It’s possible that the mandated actors would have pushed something similar if the PPG hadn’t. There was a signal request that commented on speeding up the process, to which I highlighted cutting down the discussion time as one of the optimisations to improve turnaround. Frankly, it felt like a workable idea, and I wanted to see what the response would be. Delays to the PPG turnaround have been highlighted multiple times in the past and we’ve made no process change, again, it felt like it was worth attempting to lean in the other direction. The proposal is just that, a proposal. The PPG group does not have the power to implement anything. We expedited a proposal for a change, not the change itself. The 3 day weekly  poll duration is not new, it’s existed for multiple years. If larger MKR Holders felt that it was unsuitable, they have had years to change it. They haven’t done so. Ultimately a number of MKR Holders were present and voted in the poll, others were not. If larger holders cannot check in once a week when they have literally hundreds of millions of dollars on the line, to see if there is something that concerns them even when directly prompted to do so, my sympathy is limited. The executive vote exists as a final backstop to prevent something passing if it is unpopular. Delaying CU budgets for a week is unfortunate and would cause some problems, but those problems can be worked around if people truly do not want this. Additionally, as you’ve stated, there is nothing here that cannot be reversed. Downside is that governance looks a bit schizophrenic. Again, that’s unfortunate, but maybe that encourages people to take the weekly poll processes more seriously.  ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-53-en-espanol/9330",
                        "https://forum.makerdao.com/t/maker-relay-ep-53/9305",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355/30"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving entirely negative feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.833268913626057
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#26",
                    "likes": "3",
                    "time": "08/07/2021-16:10:03",
                    "content": "    PaperImperium:  Questions, concerns, or queries must be answered if brought up by the Maker community, and feedback must be considered before finalizing the proposal   I am supporting the repeal because I specifically asked a couple questions, the most important in my view received no response, which was “Please show, based on current usage and not expectations of gained market share, profit or loss if those rates are implemented. Apologies if I missed it somewhere.  If losing, then what additional market share/volume would need to be obtained to break even.”   The proposal should not have proceeded until this question was answered in some form. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party giving entirely negative feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#27",
                    "likes": "0",
                    "time": "08/07/2021-16:35:26",
                    "content": "    omahalawyer:  Please show, based on current usage and not expectations of gained market share, profit or loss if those rates are implemented.   Central banks major duty is not a profit in a first way. But market share). But I do have on question to you. As a legal adviser what do you think of Wyoming Law. Seems to me 75000 votes is not enough for the quorum. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.427083333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#28",
                    "likes": "7",
                    "time": "08/07/2021-16:35:46",
                    "content": "I am voting Yes. My primary concern is related to the downstream bundling of the Executive which may contain contentious items. We really want to avoid scenarios where folks launch campaigns against an executive. With basically zero time to have any debate, we are rapidly pushing toward putting all of the power in the hands of a few. I don’t have an issue with recommendations in the hands of a. few, but debate is essential with a minimal process to allow modifications. I do not think we need a wee, even 24 hours would be better than zero. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#29",
                    "likes": "0",
                    "time": "08/07/2021-16:44:29",
                    "content": "You are right for shure. Right know there is no place for democracy. We are on the same groundfield with Circle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9523809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#30",
                    "likes": "1",
                    "time": "08/07/2021-17:20:38",
                    "content": "This would be a good addition to the report and could be added easily to the spreadsheet (well it doesn’t have RWA revenues but that’s not much). We need 74% more minting to be break-event, which is unlikely. Revenues before/after:  image349×782 15 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.033333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/KryptoKnight",
                    "index": "#31",
                    "likes": "3",
                    "time": "08/07/2021-17:28:39",
                    "content": "I voted “yes” as ultimately I believe there should have been a more formal discussion/debate as outlined in MIP46c2. That said, I do want to recognize the circumstances laid out by @LongForWisdom in that there was already some debate/precedence from a prior PPG, and that the judgement call to expedite was not entirely unwarranted. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#32",
                    "likes": "0",
                    "time": "08/07/2021-17:46:27",
                    "content": "Same vi     SebVentures:  We need 74% more minting to be break-event, which is unlikely.   And the expectations are? 1.5 mil extra Eth would be locked in colaterall? I hope there are some market strategy to bring this extra supply of eth from the market? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#33",
                    "likes": "0",
                    "time": "08/07/2021-17:56:40",
                    "content": "Thanks.   What is our current annual expense budget? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#34",
                    "likes": "0",
                    "time": "08/07/2021-17:58:43",
                    "content": "Expenses estimated - $32,000,000 according to Makerburn app ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#35",
                    "likes": "0",
                    "time": "08/07/2021-18:23:18",
                    "content": "There were a poll that last 3 days or more. While it seems little the next rate changes is in 20 days. That is leave 15 days at max before the next PPG, how do you want to evaluate the impact on the previous change if it did not happen. May be the debate should happen before the PPG. The same way we had the summer party debat. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.104166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#36",
                    "likes": "1",
                    "time": "08/07/2021-18:35:48",
                    "content": "I am careful to not opine without knowing all of the facts. However, maybe an option to consider would be to have the proposal released on a Friday so the community would have time to digest over the weekend and raise any issues and then go into a poll on Monday. From my lens, that would allow a decent hybrid of both speed and informational flow. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.166666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#37",
                    "likes": "2",
                    "time": "08/07/2021-19:03:28",
                    "content": "    mrabino1:  However, maybe an option to consider would be to have the proposal released on a Friday so the community would have time to digest over the weekend and raise any issues and then go into a poll on Monday.   Yep, I actually already proposed this to the group, and they agreed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#38",
                    "likes": "0",
                    "time": "08/07/2021-19:15:30",
                    "content": "Would it changed the decision?  It wouldn’t because once you take a decision you don’t change it 2 days after and 2 days after again.     mrabino1:  I am careful to not opine without knowing all of the facts.   I understand your point of view. And you can see actually the vote against this rate changes being on the case you raise. If we remove the PSM today the dai would be at 10 dollars right now. I would ask you what the fact which lead to have a PSM full? Why people want to have an easy cash access? Why do they want no liability on this cash?     alexis:  Unfortunately, I can’t see how we can secure the protocol and not having this conversation again without an automated rate adjustment directly embedded into the protocol.   The only way to sort this out and avoid all political problems - as it is - is to make the rules clear by coding them and shipping the code. That is how we do, that is how we are removing the need to know all of the facts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4859307359307365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#39",
                    "likes": "1",
                    "time": "08/07/2021-19:39:17",
                    "content": "    alexis:  The only way to sort this out and avoid all political problems - as it is - is to make the rules clear by coding them and shipping the code. That is how we do, that is how we are removing the need to know all of the facts.   I think it could be even easier than this. If the rates group is following a formula, they could just publish the formula and this will be the assumed changes on a weekly basis. If you think something is wrong, you’ll be able to see the outcome from a while away and petition to change the formula/override it. I’d advise against anything too “on-chain” unless it’s gone through some serious manipulation-testing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#40",
                    "likes": "0",
                    "time": "08/07/2021-19:57:22",
                    "content": "    g_dip:  I think it could be even easier than this.   Easier than not having to worry about checking them?   tho I understand what you meant. Most of the issue with not having coded rule is that you end up with non deterministic rules, like parlements. If the rules are deterministic they can be built if not you will end up with the same problem “the interpretation of the rules”. And quickly you will have the unwritten arrangements / rules. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.388888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#41",
                    "likes": "8",
                    "time": "08/07/2021-20:19:19",
                    "content": "IMO the number one reason why we should lower fees is to guarantee our survival in a highly competitive market. I understand the concerns about short term cash flow, but I can’t overemphasize how important it is that we focus on growth at the current nascent state of the market. Maker MUST be the cheapest place to borrow at large scale against ETH, always, and guaranteed at prices our users will know to be highly competitive and worth it. This way, most automated systems will target Maker for their integrations, and will become highly sticky demand. The risk of keeping fees high is that maker might lose out on these integrations and be left in the dust as other protocols take off, when things start to take off for real. Only exception should be if we are hitting dangerous levels of exposure, which we definitely aren’t any time soon compared to the risk in USDC and the incredible liquidity and value prop of ETH (and don’t forget that we earn from the liquidation penalty!) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.727901785714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#42",
                    "likes": "0",
                    "time": "08/07/2021-21:07:26",
                    "content": "@Aes, who was on MKR compensation MIP those last weeks, will work on an annual expense budget. You can expect something like $20-25M (excl. MKR) I would say. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#43",
                    "likes": "2",
                    "time": "08/07/2021-21:31:09",
                    "content": "Thank you.   With that information, doesn’t that give you all pause?  At $25 MM expenses, the proposal wipes out over two-thirds of our profits on current basis and without providing evidence to show what market share or business will be gained by doing so.  This is something that should have been stated and defended by the proponents.  With that information I would have emphasized my suggestion on that forum post to first match or beat more liberal/risky collateralization requirements of competitors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#44",
                    "likes": "4",
                    "time": "08/07/2021-21:51:17",
                    "content": "This is not far from what I proposed 2 months ago (DeFi Summer 2.0) and that was supported by a vast majority. I also highlighted here, that some significant loan positions are already barely profitable and might unwind. So this profit is lost one way or the other. This was what convinced me that we don’t really have a choice. Moreover, in the long run, I always stated that crypto-backed lending will not earn much more than 10-50bps over the risk-free rate (not much more than lending against stocks). Hence my focus on RWA and term lending. Institutions are coming to farm the alpha between crypto lending and LIBOR/SOFR. ",
                    "links": [
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-28-june-2021/8991/33"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#45",
                    "likes": "0",
                    "time": "08/07/2021-22:04:09",
                    "content": "    SebVentures:  Moreover, in the long run, I always stated that crypto-backed lending will not earn much more than 10-50bps over the risk-free rate (not much more than lending against stocks). Hence my focus on RWA and term lending. Institutions are coming to farm the alpha between crypto lending and LIBOR/SOFR.   Don’t disagree, need to focus on RWA, but the issue here is substantive process in adopting what must admittedly be one of most significant issues that has come up recently. P.S. You have a broker who lends on stock at less than 7%?  Send his/her email address to me.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.817708333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#46",
                    "likes": "0",
                    "time": "08/07/2021-22:08:38",
                    "content": "    SebVentures:  Hence my focus on RWA and term lending. Institutions are coming to farm the alpha between crypto lending and LIBOR/SOFR.   This right here  wait till the FED and banks step on the Deflation gas—it will be a huge opportunity for Maker, IMO. Not financial advice. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.142857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#47",
                    "likes": "1",
                    "time": "08/07/2021-22:12:16",
                    "content": "    omahalawyer:  At $25 MM expenses, the proposal wipes out over two-thirds of our profits   I think folks tend to forget that even the great ones went years without being profitable: “ Amazon did not expect to make a profit for four to five years. This comparatively slow growth caused stockholders to complain that the company was not reaching profitability fast enough to justify their investment” -Wiki **Not Financial Advice ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#48",
                    "likes": "2",
                    "time": "08/07/2021-22:18:44",
                    "content": "    omahalawyer:  You have a broker who lends on stock at less than 7%?   Interactive Broker, 1.6% for small fish, 75bps at scale. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.958333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#49",
                    "likes": "1",
                    "time": "08/07/2021-22:20:59",
                    "content": "    flipflopflapdelegate:  I think folks tend to forget that even the great ones went years without being profitable   Amazon didn’t race to the bottom. They remained cash flow positive — and didn’t require liquidation of customers to do it. We are the logical destination for big customers because they can’t accidentally move rates with us like they can elsewhere. To think we need to compete on pure pricing suggests a misunderstanding of how our own business works. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.742965367965368
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#50",
                    "likes": "0",
                    "time": "08/07/2021-22:39:04",
                    "content": "    PaperImperium:  Amazon didn’t race to the bottom   Ser?     PaperImperium:  require liquidation of customers to do it.   MakerDAO can make profits in various ways, IMO. See Oracles CU presentation for reference. Not financial advice. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#51",
                    "likes": "0",
                    "time": "09/07/2021-00:06:34",
                    "content": "    omahalawyer:  At $25 MM expenses, the proposal wipes out over two-thirds of our profits   @Aes has estimated low $30 millions I believe. Not including Oracle gas. I think that includes CUs that are not officially approved yet, though ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#52",
                    "likes": "1",
                    "time": "09/07/2021-02:28:23",
                    "content": "Our annual expense run rate for approved CUs (including new quarterly budgets for previously approved CUs) is $25.6M. Those in formal submission total $9.6M and RFC proposals total $0.9M. All together that’s $36.2M DAI expenses. This excludes all oracles gas costs which have been trending lower with L2s taking off and should continue to trend lower as EIP-1559 rolls out. No idea what these would be but I’ve heard suggestions of $2-$5M. @NikKunkel will be posting a sub-proposal for the gas fees. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.962121212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#53",
                    "likes": "4",
                    "time": "09/07/2021-16:45:37",
                    "content": " image702×101 5.94 KB  @PaperImperium  Sir can we refrain  : from making such statements. We are a community with the same passion and goal. We All get frustrated at times . Trust me I know. But, let’s not alienate the community. Together as one please. Lets be good to each other. Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafinskipg",
                    "index": "#54",
                    "likes": "0",
                    "time": "14/07/2021-05:59:13",
                    "content": "Yeah. We need to have additional revenue streams and plans to have a sustainable future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#55",
                    "likes": "0",
                    "time": "14/07/2021-15:16:54",
                    "content": "Given that this poll closes in 5 hours – I had not thought the executive containing these parameter changes would still remain unexecuted by today – @LongForWisdom may go ahead and close this thread if it’s convenient to do so. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#56",
                    "likes": "0",
                    "time": "14/08/2021-01:17:49",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}