{
    "poll_list": [
        {
            "title": "Offboard KNC Legacy Token - September 13, 2021",
            "index": "10081",
            "option": "Yes",
            "supporting_mkr": "70,576",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-offboard-knc-legacy-token/10081",
            "title": "[Signal Request] Offboard KNC Legacy Token ",
            "index": 10081,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "knc",
                "sig-status-accepted",
                "collateral-offboard"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "6",
                    "time": "30/08/2021-21:03:11",
                    "content": "Previously, the Maker community has supported offboarding of the deprecated KNC legacy token. The process for offboarding assets has been further discussed in a recent forum thread. This post presents a plan for completing the offboarding of the KNC legacy token, and seeks confirmation from the community to move forward with the proposed next steps.  Background Kyber network began an upgrade to a new KNC token contract earlier this year. Much of the supply has now migrated to the new KNC token, and support and liquidity for the legacy KNC token is declining. There are 5 remaining Maker vaults using the KNC-A vault type, with the following collateralization and debt levels.  1280×370 66.5 KB  The KNC legacy token price feed is not used by any third parties, so once these vaults are closed Maker will be able to remove support for the KNC price feed and reduce operating costs.  Proposed Offboarding Process I propose the following parameter changes to complete offboarding of the KNC legacy token. Set the KNC-A liquidation penalty to 0% Removing the liquidation penalty ensures that we don’t penalize users for deprecation of the KNC-A vault type. This is important from a user experience and public relations perspective, and the total remaining debt from KNC legacy token is only ~9,000 DAI so the amount of revenue gained from keeping the liquidation penalty is negligible. Increase liquidation ratio to 5,000% over 2 months We can use the lerp module to linearly increase the liquidation ratio from the current 175% to 5,000% over the course of 2 months. This should be high enough to trigger liquidation for all remaining vaults, allowing for the removal of the KNC-A vault type and related price feed. Based on current vault collateralization levels, all existing vaults should be below liquidation ratio within roughly 1-2 weeks of the linear stability fee increase beginning. The longer lerp period with higher final liquidation ratio is intended to accommodate any potential changes in KNC price. The two parameter changes have been bundled into one signal request because of their shared purpose. Feel free to comment if you object to these changes being bundled together, or for any other feedback.  Signal Request Poll Do you support the parameter changes outlined above to offboard the KNC-A vault type?     Yes No Abstain     0 voters      Next Steps This signal request poll will run for the next 10 days, until Thursday September 9. If a majority of forum voters (excluding abstain votes) are in favor and the signal request receives sufficient community engagement, the proposed changes will be submitted for an on-chain governance poll the following week.  Change Log 30 August 2021 - Removing KNC-A stability fee increase from proposed changes based on feedback. Stability fee will remain set at 5%. ",
                    "links": [
                        "https://forum.makerdao.com/t/offboarding-unprofitable-collaterals/9785",
                        "https://github.com/makerdao/dss-lerp",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-august-2021/10106",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-27th-september-2nd/10125",
                        "https://forum.makerdao.com/t/maker-relay-ep-62/10311",
                        "https://forum.makerdao.com/t/maker-relay-ep-62-en-espanol/10399"
                    ],
                    "GPT-summary": "The author proposes a plan to complete the offboarding of the KNC legacy token and seeks confirmation from the community to move forward with the proposed next steps. The proposal includes two parameter changes to remove support for the KNC price feed and reduce operating costs. The post also includes a signal request poll and a change log. The post explains the background of the proposal and provides details on the proposed offboarding process. The post may receive constructive criticism, questions, and reviews from third parties.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.153097147950088
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#2",
                    "likes": "9",
                    "time": "30/08/2021-21:39:07",
                    "content": "My preference would be to NOT change the rate.  It’s not the user’s fault that this collateral type is being off-boarded. Users obviously know that rates may be variable to account for risk/peg.  If the rate change is related to risk, that’s fine.  But if we are just using it as an incentive to prompt the position to be closed, I don’t think that’s necessary or fair to the KNC Vault holders. They have taken some debt with some rate expectation.  If we make the liquidation penalty 0 and lerp the collateralization ratio to 5000%, this will naturally clean up these Vaults with plenty of warning for the user, and more importantly, without sacrificing more of their collateral. Worse PR case under this regime, they emerge from the woods after 5 years to find their position closed, and only enough of their collateral sold to cover their outstanding debt and fees.  This is the best-case scenario they could have hoped for in the case where the collateral type is off-boarded. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.927777777777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#3",
                    "likes": "3",
                    "time": "30/08/2021-21:58:59",
                    "content": "This is a fair take. Considering that the vaults would probably only face the 5% rate increase for 1-2 weeks until their position is liquidated, the added cost to users would be relatively small (roughly 0.1% to 0.2% increase in total debt). But I’m just as happy to remove the borrowing rate increase and only adjust the liquidation ratio and penalty if this is better from a user and PR standpoint. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.03125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#4",
                    "likes": "4",
                    "time": "30/08/2021-22:26:58",
                    "content": "I’d vote Yes with the adjusted suggested by @cmooney ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#5",
                    "likes": "5",
                    "time": "30/08/2021-22:33:39",
                    "content": "I’m convinced  Thanks @cmooney and @psychonaut for feedback. I’ve removed the stability fee increase from the proposed changes. This signal will only include removing KNC-A liquidation penalty and increasing liquidation ratio. cc @PaperImperium @flipflopflapdelegate @Patrick_J - I see you have already voted, just wanted to make you aware of this change so you can adjust your vote if desired. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "3",
                    "time": "30/08/2021-22:49:35",
                    "content": "That change makes sense. Not like it’s a revenue raiser for us or likely to be much incentive compared to the lerp. There’s also only 5 active vaults. Most of it is probably abandoned. So I doubt it matters much as long as we clean it out. Or even just set DC to 0 and turn off Oracles and let them migrate themselves or get liquidated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.630952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#7",
                    "likes": "5",
                    "time": "30/08/2021-22:54:57",
                    "content": "Thanks for the heads up. I agree the adjustment from @cmooney does sound better ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "2",
                    "time": "31/08/2021-12:37:54",
                    "content": "    monet-supply:  We can use the lerp module to linearly increase the liquidation ratio from the current 175% to 5,000% over the course of 2 months. This should be high enough to trigger liquidation for all remaining vaults, allowing for the removal of the KNC-A vault type and related price feed.   One thing that I want to highlight about this approach. The lerp module doesn’t actually change the liquidation ratio at fixed intervals, it just guarantees that it changes to the correct point along the function at time t when it is updated. We should ensure that there is a bot that is calling the lerp update at a reasonable interval, such that users have a chance to close their vaults manually to avoid liquidation. Basically, the actual parameter changes are going to look like a step function with the step length depending on the frequency that the lerp contract is updated. We should try to ensure that the step frequency is as small as is feasible given gas costs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1049999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#9",
                    "likes": "1",
                    "time": "07/09/2021-18:52:52",
                    "content": "Friendly reminder that this signal request poll ends on Thursday (assuming sufficient participation)   Be sure to vote! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#10",
                    "likes": "2",
                    "time": "07/09/2021-19:06:13",
                    "content": "    LongForWisdom:  Basically, the actual parameter changes are going to look like a step function with the step length depending on the frequency that the lerp contract is updated. We should try to ensure that the step frequency is as small as is feasible given gas costs.   I’m not so concerned about this; from a vault user perspective LERPing the liquidation ratio implies a specific date when their vault will be able to be liquidated (based on their vault’s collateral ratio), and any delays or infrequency in calling the LERP contract will give them additional time to close their position manually. From my perspective, the main benefit of using LERP is spacing out liquidations over time hopefully leading to better auction efficiency, and less governance overhead (only needing to include liquidation ratio change in 1 vote instead of multiple successive changes).  image865×204 25.8 KB  Based on current vault collateral levels, the remaining vaults would be available for liquidation between 6 to 14 days from when the LERP is initiated. This could vary somewhat based on changes in KNC price. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5227272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "1",
                    "time": "08/09/2021-10:57:38",
                    "content": "    monet-supply:  I’m not so concerned about this; from a vault user perspective LERPing the liquidation ratio implies a specific date when their vault will be able to be liquidated (based on their vault’s collateral ratio)   Oh, interesting, I hadn’t considered that side of it. You make a good point. I was more concerned about vault users that might miss the memo on the offboarding, but had setup some notification system to warn them when their vault was close to being liquidated. Such systems don’t tend to be used super frequently, though, and if they are, they usually assume a fixed LR. In conclusion, you’re right, it’s probably fine in this case. if we were doing this on a vault-type that had more users though, I think I’d still be more comfortable if we had a bot to update the lerp once a day at least. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.3392857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#12",
                    "likes": "3",
                    "time": "13/09/2021-18:10:05",
                    "content": "The poll is now live on chain here: https://vote.makerdao.com/polling/QmQ4Jotm Voting is open until this Thursday at 16:00 UTC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#13",
                    "likes": "5",
                    "time": "21/09/2021-14:48:42",
                    "content": "MKR holders have passed the relevant executive vote to offboard KNC, and it will become available for execution later today. Once all remaining KNC legacy vaults are closed in the coming weeks/months, we will be able to remove the KNCL price feed. For KNC-A vault users, it is encouraged to close out your vault manually to avoid additional costs involved in liquidation. The liquidation penalty will be set to 0%, but liquidators will typically bid below market value to account for (1) gas costs of liquidation and (2) a few % profit to make liquidation economically viable. Manual closure also gives users the possibility to have their transaction mined with lower gas price. TL;DR: it’s likely that KNC-A vault users will see better outcomes from closing their own position rather than allowing it to be liquidated. Thanks to everyone who participated in this signal request in the forum and on chain  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.013888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#14",
                    "likes": "0",
                    "time": "22/10/2021-00:49:08",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "32"
}