{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/timing-for-updated-dai-smart-contract-with-a-limited-permit/19243",
            "title": "Timing for updated DAI smart contract with a limited permit? ",
            "index": 19243,
            "category": [
                "Miscellaneous",
                "Developers"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ronan",
                    "index": "#1",
                    "likes": "0",
                    "time": "22/12/2022-16:09:39",
                    "content": "Is there any estimate on when there’ll be a DAI smart contract available that has a limited permit function? Ideally it would be nice to also have a transferWithAuthorisation function like USDC has. For payments integrators like Trelis the lack of a limited permit makes DAI pretty unusable if we’re offering gasless payments. At least with a permit, we could offer gasless payments with a deployed smart contract. With transferWithAuthorisation we’d be able to offer gasless DAI payments just as we do for USDC. Any indications on timeline or roadmap are much appreciated. I’m guessing it would have to wait until some major protocol update…which probably isn’t soon. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.207589285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "0",
                    "time": "22/12/2022-20:16:37",
                    "content": "I understand that DAI as we have it today the token itself and its parameters cannot be changed without having to fork it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#3",
                    "likes": "2",
                    "time": "22/12/2022-20:52:23",
                    "content": "I thought Dai already had a permit function that enabled this behaviour? But yes, as @Saludiego_201 said we are unable to ever upgrade the smart contract (to protect Dai holders from any possibility of blacklisting) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.2857142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ronan",
                    "index": "#4",
                    "likes": "0",
                    "time": "22/12/2022-21:11:51",
                    "content": "Yeah the permit function is there, but it is unlimited. This means that anyone signing a permit is giving unlimited spend approval. Some protocols have devised different work arounds, but it’s clunky and results in users often unknowingly signing unlimited approvals for DAI to be spent from their wallet. In a network where txes are largely irreversible, this is quite a drawback. I’m trying to make payment UX better with Trelis and this means getting rid of the need to have Eth for gas. With USDC I can nicely use limited permits or their transferWithAuthorisation function. It might seem like a small thing, but this UX friction is a significant adoption barrier imo. I thought that since Aave moved to v2, and since Maker might move to a floating peg some day, maybe there is some future opportunity to have a better smart contract. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.900974025974026
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#5",
                    "likes": "1",
                    "time": "22/12/2022-21:50:28",
                    "content": "One of DAI’s biggest strengths is the network effects around its specific erc20 contract. Not worth it to ever abandon its current contract, so we probably won’t ever migrate to a new one. A floating peg is possible in the current contract ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.988636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#6",
                    "likes": "1",
                    "time": "22/12/2022-22:50:19",
                    "content": "Maybe not with this current version of DAI but the idea of creating other assets similar to DAI within the same Maker has already been mentioned, maybe EURDAI or floating DAI can bring that big UX leap you propose. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                }
            ]
        }
    ]
}