{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-29-de-septiembre-6-de-octubre-de-2022/18363",
            "title": "Relay Semanal: 29 de septiembre - 6 de octubre de 2022 ",
            "index": 18363,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "weekly-relay",
                "relay-semanal",
                "ambassadors"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/brigith238",
                    "index": "#1",
                    "likes": "3",
                    "time": "13/10/2022-21:10:55",
                    "content": " Hola a todos. ¡Gracias por consultar el Relay Semanal! Ya sea que poseas MKR o DAI, tengas tu propia Vault o te quieras involucrar más con la Gobernanza, esta es tu parada obligatoria para estar al día con las actualizaciones de MakerDAO. Autores: @alec, @nothsa, @Sol_Invictus, y @Artem_Gordon   Versión PDF Online en inglés - pronto      EVENTOS ACTUALES  Navegar los foros en este momento se siente como manejar por una carretera inundada. Con mucho por discutir, y mucho siendo discutido, es excepcionalmente fácil dejarse llevar. Así que, tomemos un momento para navegar a través de la gran cantidad de propuestas impactantes, analizar lo que ofrecen y explorar el sentimiento actual de la comunidad.   Gemini: GUSD Proposal  Siguiendo la estela de la MIP81 propuesta por Coinbase, dos propuestas similares llegaron al Foro la semana pasada. La primera por @tylerwinklevoss de Gemini, un CEX de primer nivel y emisor de la stablecoin GUSD. Según el anuncio, Gemini ha apoyado durante mucho tiempo el Protocolo Maker. Para referencia:  Custodia: MKR ha sido compatible con Gemini desde agosto de 2020 y con el Dai desde abril de 2020.  Trading: El comercio de MKR fue compatible en septiembre de 2020 y el de Dai en mayo de 2020.  Earn: MKR es compatible con el producto Gemini Earn con un APY del 1,26%, y Dai con una de las tasas más altas con un APY del 5,31% para nuestros usuarios.  Nifty Gateway: Los usuarios de Nifty Gateway pueden utilizar los saldos de sus cuentas de Gemini exchange para comprar en NG. Esto significa que un usuario de Gemini exchange que tiene Dai en su wallet puede utilizarlo para pagar en Nifty Gateway, donde se realiza una conversión de ETH o USD. Tarjeta de Crédito: Los clientes pueden seleccionar Dai y MKR como sus recompensas para ganar recompensas cripto instantáneas en la tarjeta de crédito de Gemini.  Resumen de las Propuestas Según Gemini, el 1 de octubre de 2022 comenzó un programa de tres meses, en el que Gemini aporta una tasa fija del 1,25 % a la DAO sobre cualquier GUSD presente en el PSM. Estas recompensas se pagarán mensualmente siempre que se mantenga un saldo promedio mínimo de 100 millones de GUSD. Además, sería necesario configurar y procesar una entidad legal a través de KYC para reclamar estas recompensas acumuladas. Como esto se anunció como un incentivo de marketing, el GUSD retenido en el PSM no será trasladado del PSM ni a la custodia de Gemini.  “Reconocemos la importancia del PSM para asegurar los canjes de Dai y creemos que mantenerlo on-chain es la mejor manera de cumplir con esa tarea.”  El equipo de Gemini también proporcionó la siguiente consulta de Dune para ayudar a rastrear las tenencias de GUSD de la DAO.   Se puede encontrar un enlace al anuncio completo aquí, o en el enlace anterior.   MIP87: OUSD Decentralized Rewards  La segunda fue publicada por @pete, representando al Protocolo Origin, emisor de la stablecoin OUSD. OUSD es una “moneda estable generadora de rendimiento que cambia de base positiva y diariamente para distribuir el rendimiento directamente a las wallets de los usuarios”. Según la propuesta, OUSD está respaldada 1:1 por DAI, USDC, y USDT. Genera su rendimiento a través de préstamos a protocolos como Aave, Compound, Curve, y Convex. Todo el interés acumulado se convierte luego en OUSD y se distribuye proporcionalmente. Resumen de la MIP87  La MIP sugiere una asignación del 1% que se puede aumentar en cualquier momento a medida que crece la confianza. Maker convertiría hasta el 33% de sus tenencias de USDC a OUSD.   “Maker almacenará el OUSD en una wallet compatible con la reorganización, como MetaMask, Ledger, Coinbase Wallet, MEW, etc. Si utiliza una wallet multi-sig (multifirma), Maker ‘optará’ por participar en la reorganización llamando a la función rebaseOptIn() de OUSD. Esto se puede habilitar fácilmente a través de la aplicación OUSD en Gnosis Safe.”  “El Elefante en la Habitación”  En noviembre de 2020, OUSD fue explotada por $7M en fondos. La DApp para el momento incluía un claro disclaimer advirtiendo que el producto estaba en fase BETA y que los contratos no habían sido auditados. Sin embargo, la tesorería de Origin optó por cubrir las pérdidas de estos primeros holders de OUSD… OUSD no ha sufrido otra falla de seguridad desde su re-lanzamiento en enero de 2021.\"  Opinión de OUSD sobre las propuestas de Coinbase, Coinshares y Gemini  “Origin está al tanto de las propuestas de Coinbase (MIP81), CoinShares (MIP86), y Gemini (Propuesta: GUSD PSM). Si bien estas propuestas son legítimas, creemos que lo mejor para Maker DAO y la comunidad de Maker DAO es permanecer lo más descentralizados posible con socios comerciales, avanzando, y con la inversión MIP13c3-SP12, ya que ni Coinbase, CoinShares ni Gemini se alinean con los principios descentralizados de Maker.”  La propuesta completa está enlazada a continuación o puede ser vista aquí.   Crimson Creator Cluster  @hexonaut propone el Cluster inaugural de Maker, Crimson Creator. El equipo tiene como objetivo incorporar una gran base de usuarios a través de una interfaz DeFi fácil de utilizar, ofreciendo los productos de Maker y farming de rendimiento junto con otras innovaciones únicas. Resumen de la propuesta El problema percibido:  \"El superpoder de Maker siempre ha sido el económico costo de capital debido al éxito del DAI como la stablecoin descentralizada más popular. Sin embargo, Maker ha tenido problemas para ganar tracción en el lado de la oferta. Nuestro principal caso de uso de préstamos durante la última carrera alcista fue como prestamista mayorista de CEXes que se embolsarían el margen de interés. Esto demuestra la fuerte demanda de experiencias de usuario sin fricciones, rápidas y de bajo costo. Los únicos que ofrecen esto en este momento son los exchanges centralizados. Maker puede otorgar crédito a estos protocolos/CEXes, pero es posible que sus misiones no se alineen con la DAO. Maker depende de contrapartes externas.\"  La solución propuesta: El equipo tiene como objetivo dar nueva vida a los productos de Maker al ofrecer las mejores tarifas del mercado debido a las inyecciones de capital de bajo costo a través de inyecciones D3M. Su producto inicial sería un fork (una ramificación) de una plataforma de préstamos existente líder en su clase, reacondicionada para integrarse directamente con Maker a través de D3M.  “Nos centraremos en segmentos de mercado a gran escala. No estamos interesados en respaldar activos de cola larga, solo ETH, BTC y derivados de ETH stakeados”.  La plataforma utilizaría dos oráculos externos, Maker y Chainlink, para abordar los problemas de seguridad observados en todas las DeFi. La propuesta señala que el equipo está investigando la adición de un tercer proveedor de oráculo para una futura implementación. Además, a medida que se encuentran disponibles más soluciones de escalado (como zkEVM), el equipo se siente adecuadamente situado para capturar este nuevo mercado. El flujo general seguiría de la siguiente manera:  Click aquí o el enlace anterior para tener acceso a la publicación completa.   **Actualización de Descentralización, Delegación, y Distribución de MKR 3er trimestre 2022 **  @lyt de la Core Unit de Finanzas Estratégicas proporciona un resumen de alto nivel de métricas seleccionadas sobre la descentralización, delegación y distribución de la gobernanza de MKR. Un Vistazo General  Desglose Completo Resumido La mayoría de estas métricas experimentaron una disminución trimestral además de un aumento en el total de holders. Además, algunos contratos de delegados vencidos todavía tienen un saldo de MKR. Esto se puede ver como una medida de la cantidad total de MKR representada por “delegadores pasivos”, que se muestra a continuación.   Otra tendencia notable se correlaciona positivamente con el crecimiento y la distribución de la delegación. Si bien la participación directa ha disminuido constantemente, la participación por delegación ha prosperado. No solo para los principales delegados, sino en general.   El número de holders de MKR con al menos un token ha estado aumentando constantemente desde mayo de 2022. Con ese aumento, hemos visto una tendencia alcista constante en la cantidad de wallets y entidades requeridas para comprometer el 50% de las tenencias de MKR disponibles. Esto representa un aumento en la descentralización general del token MKR. Según el informe, esta forma de ataque tomaría 23 de las principales wallets de MKR, adecuadas para un aumento interanual del 17% en la seguridad del protocolo. La publicación concluyó con una mirada al coeficiente Gini de MKR, comúnmente utilizado para medir la distribución del ingreso. Su escala va desde la igualdad completa en 0 hasta la desigualdad completa en 100. Maker utilizó anteriormente esta métrica para medir el riesgo de concentración de los activos aceptados. El alto riesgo ocurre cuando la mayor parte de la deuda proviene de unas pocas vaults grandes. Esta vista, en cambio, utiliza la métrica para evaluar la propiedad de MKR.   MKR actualmente tiene un coeficiente Gini de 96.69, representando un alto grado de desigualdad en la propiedad. Dicho esto, esta cifra se situó en 96.74 el 14 de julio, mostrando leves signos de regresión. Conclusiones resumidas  Existe una tendencia de gobernanza a largo plazo de participación directa que cambia a participación por delegación. Hay una buena cantidad de MKR en contratos delegados vencidos por primera vez. El número de participantes de 1MKR+ representados en el contrato de gobernanza ha ido en constante aumento, pero ha tenido una ligera tendencia a la baja intertrimestral. Hemos visto ligeros aumentos en la descentralización de MKR desde el último trimestre.  La publicación completa puede ser encontrada aquí o en el enlace anterior. Para ver el tablero adjunto de Dune Analytics, click aquí.    Esta semana en la Gobernanza  Actualización Semanal de MIPs #107  Encuestas de Ratificación, propuestas y debates pre-MIP.   Votos Ejecutivos   ¡Noticias frescas!   Incorporación de Monetalis Clydesdale (RWA007-A), Financiamiento del Programa Embajador SPF, Flujos y Transferencias de Core Unit MKR – Publicado el 4 de octubre, 2022. Expira el 4 de noviembre, 2022, 15:28 UTC.   Si esta Propuesta Ejecutiva se aprueba, Los siguientes cambios ocurrirán dentro del Protocolo Maker:   Monetalis Clydesdale (MIP65) será incorporado como un nuevo tipo de vault, RWA007-A.  81,000 DAI serán distribuidos al Programa Embajador Special Purpose Fund. Se configurarán transmisiones por un total de 787.70 MKR para las Core Units GovAlpha (GOV-001) y StarkNet Engineering (SNE-001). Un total de 497.64 MKR será transferido a las Core Units StarkNet Engineering (SNE-001) y Sustainable Ecosystem Scaling (SES-001).    Aprobadas la Semana Pasada:   Actualizar la dirección de PROXY_ACTIONS_END_CROPPER, Aumento del límite de depósito de Starknet Bridge, adquisición de Core Unit MKR – Aprobada el 29 de septiembre, 2022, 12:59 UTC. Ejecutada el 1ero de octubre, 2022, 13:00 UTC.  Esta Propuesta Ejecutiva aprobó, y se produjeron los siguientes cambios dentro del Protocolo Maker:    PROXY_ACTIONS_END_CROPPER Actualización de Dirección  Según esta publicación del Facilitador de la Core Unit de Ingeniería de Protocolo @Derek, la dirección para PROXY_ACTIONS_END_CROPPER fue actualizada.   Según esta encuesta de gobernanza, el límite de depósito para el puente Starknet se elevó de 50 DAI a 1,000 DAI.  Adquisición de Core Unit MKR  Un total de 1161.49 MKR fueron transferidos a tres Core Units:   20 MKR a la Core Unit de Finanzas del Mundo Real (RWF-001).  966.49 MKR a la Core Unit de Servicios de Ingeniería Colaterales (CES-001).  175 MKR a la Core Unit de Riesgo.         Votaciones Activas     Nombre Discusión Fecha de Inicio Fecha de Cierre     Propuesta de Comité de Mercado Abierto Discusión 3 de octubre, 16:00 UTC 6 de octubre, 16:00 UTC   Multisig para Gestión de Velodrome NFT Discusión 3 de octubre, 16:00 UTC 6 de octubre, 16:00 UTC      Votaciones del Visto Bueno de la Comunidad      Nombre Desglose de Votación Fecha de Inicio Fecha de Cierre     ANCLAJE ![]  3 de octubre, 16:00 UTC 6 de octubre, 16:00 UTC       Votaciones Finalizadas   Aprobadas   Actualizaciones de Parámetros:      Nombre Desglose de Votación Fecha de Cierre     Actualizar los Parámetros de Incorporación de rETH  721×249 6.44 KB  29 de septiembre, 16:00 UTC   Actualizaciones de Parámetros de Subasta de Colateral  721×249 6.42 KB  29 de septiembre, 16:00 UTC      Votaciones del Visto Bueno de la Comunidad:      Nombre Desglose de Votación Fecha de Cierre     Originador de Hipotecas Canadienses Reguladas por el Gobierno Federal  715×248 7.2 KB  3 de octubre, 16:00 UTC     ¡Feliz votación!      Reuniones y Eventos  Grabaciones de las llamadas de la semana pasada:  Horas de Oficina de los delegados | Foro | Grabación  Gobernanza y Riesgo #210 | Foro | Grabación  DVC/Endgame | Foro | Grabación   Próximas Llamadas:  Endgame RFC DVCs | Foro | Unirse | [fecha=2022-10-07 hora=15:00:00 zona horaria=“UTC”] Conoce a tu Delegado 21 - ConsenSys | [fecha=2022-10-12 hora=18:00:00 zona horaria=“UTC”] DVC/Endgame | Unirse | [fecha=2022-10-12 hora=19:00:00 zona horaria=“UTC”]    Horas de Oficina de las Core Units    Unirse |  GovAlpha, Preguntas y Respuestas de la Gobernanza - Lunes a las 17:00 UTC  Unirse | Immunefi Security - Cada Dos Lunes a las 23:00 UTC | Alternativa Unirse - Cada Dos Miércoles 15:00 UTC  Unirse | Sustainable Ecosystem Scaling - Martes a las 13:30 UTC  Unirse | Protocol Engineering - Martes a las 15:00 UTC  Unirse | Strategic Finance (bIBTA SPF) | Martes, 30 de agosto a las 17:00 UTC  Unirse | 6S Capital - Cada dos miércoles a las 14:00 UTC  Unirse | Growth - Primer miércoles de cada mes a las 17:00 UTC  Unirse | Real World Finance - Cada dos miércoles a las 18:00 UTC  Unirse | Governance Communications - Viernes a las 18:00 UTC    Recursos  Lista Abierta  Todos los Tableros Disponibles   Todas las Guías Disponibles   Calendario de Llamadas   Foro y Discord de Maker   Tracker de los Tableros de Gobernanza | Versión en Google Sheet  Discusiones del Foro - Tablero de Gobernanza    Conoce tu Índice MIP   Portal de aprendizaje and Technical Documentation   Servidores de Discord de MakerDAO   MakerBurn   Lista de Charlas   Herramientas de Participación   Calendario de Votaciones y Fechas Importantes    Disclaimer Disclaimer: Esta actualización fue ensamblada por un grupo de miembros que contribuyen a la comunidad de MakerDAO. La misma no debería servir como asesoría financiera ni como incentivo para votar de alguna forma específica. Esta actualización es meramente informativa y se ha realizado solamente con fines informativos.  Esta es una traducción libre del artículo original en inglés gracias a @Brigith238 y @Sebix     ",
                    "links": [
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/7",
                        "https://forum.makerdao.com/t/mip87-ousd-decentralized-rewards/18216",
                        "https://defillama.com/protocol/origin-dollar",
                        "https://forum.makerdao.com/t/mip87-ousd-decentralized-rewards/18216#mip87c8-our-view-on-mip81-mip86-and-gusd-psm-16",
                        "https://forum.makerdao.com/t/crimson-creator-cluster/18241/2",
                        "https://forum.makerdao.com/t/crimson-creator-cluster/18241",
                        "https://forum.makerdao.com/t/q3-2022-mkr-decentralization-delegation-and-distribution-update/18247",
                        "https://forum.makerdao.com/t/q3-2022-mkr-decentralization-delegation-and-distribution-update/18247",
                        "https://dune.com/stratfi/mkr-token-decentralization-and-distribution-metrics",
                        "https://forum.makerdao.com/t/weekly-mips-update-107/18199",
                        "https://vote.makerdao.com/executive/template-executive-vote-monetalis-clydesdale-rwa007-a-onboarding-funding-ambassador-program-spf-core-unit-mkr-streams-and-transfers-october-5-2022#proposal-detail",
                        "https://mips.makerdao.com/mips/details/MIP55",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP3",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP19",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP19",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP10",
                        "https://vote.makerdao.com/executive/template-executive-vote-update-the-proxy-actions-end-cropper-address-starknet-bridge-deposit-limit-increase-core-unit-mkr-vesting-september-28-2022",
                        "https://forum.makerdao.com/t/28th-september-executive-updating-the-proxy-actions-end-cropper-address/18057",
                        "https://vote.makerdao.com/polling/QmbWkTvW#poll-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP1",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP20",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP2",
                        "https://vote.makerdao.com/polling/QmbLyNUd",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-29-september-2022/18143",
                        "https://vote.makerdao.com/polling/QmSqUMMR",
                        "https://forum.makerdao.com/t/signal-request-create-a-multisig-to-manage-the-velo-venft/17777",
                        "https://vote.makerdao.com/polling/QmWUL19K",
                        "https://vote.makerdao.com/polling/QmS7dBuQ",
                        "https://vote.makerdao.com/polling/QmREbu1j",
                        "https://vote.makerdao.com/polling/QmYRjEA9",
                        "https://forum.makerdao.com/t/delegate-office-hours-13/18111",
                        "https://www.youtube.com/watch?v=Pt1G5Ho_GnU",
                        "https://forum.makerdao.com/t/governance-and-risk-210-thursday-september-29-at-17-00-utc/18115",
                        "https://www.youtube.com/watch?v=BWCkZCL20S4",
                        "https://forum.makerdao.com/t/endgame-call-wednesdays-9pm-cest-link/18123",
                        "https://www.youtube.com/watch?v=4XeKLEQTsJI",
                        "https://forum.makerdao.com/t/endgame-rfc-dvc-calls/17773",
                        "https://us02web.zoom.us/j/87005527061?pwd=bHN0M2ExY1hQU0xFcENsREhEUFJPUT09",
                        "https://us02web.zoom.us/j/89326394914",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://makerdao.bigbluemeeting.com/adm-eox-jtz-tsi",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://meet.google.com/vmp-jiwx-nkn",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com/t/all-available-dashboards/16104",
                        "https://forum.makerdao.com/t/all-available-guides/16159",
                        "https://forum.makerdao.com/t/the-calls-calendar/16095",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://www.makerdao-governance-dashboard.com/tracker",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://www.makerdao-governance-dashboard.com/tracker/forum-discussions",
                        "https://forum.makerdao.com/t/know-your-mip-index/6768",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forum.makerdao.com/t/makerdaos-discord-servers/16110",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/office-hours-list/16162",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://forum.makerdao.com/t/the-votes-and-important-dates-calendar/16096",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/19"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.422077922077922
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-29-de-octubre-4-de-noviembre-2022/18729",
            "title": "Relay Semanal 29 de octubre - 4 de noviembre, 2022 ",
            "index": 18729,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "weekly-relay",
                "relay-semanal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/brigith238",
                    "index": "#1",
                    "likes": "5",
                    "time": "09/11/2022-14:35:42",
                    "content": " Hola a todos. ¡Gracias por consultar el Relay Semanal! Ya sea que poseas MKR o DAI, tengas tu propia Vault o te quieras involucrar más con la Gobernanza, esta es tu parada obligatoria para estar al día con las actualizaciones de MakerDAO. Autores: @alec, @Sol_Invictus, y @Artem_Gordon Versión en PDF    EVENTOS ACTUALES  En la llamada de Gobernanza y Riesgo de la semana pasada dos Clusters propuestos —Crimson y Viridian—  detallaron más acerca de sus esquemas generales. A continuación, un desglose resumido de cada segmento de Q&A.  Cluster Crimson  La presentación del Cluster aquí.  “¿Cúal es la generación de flujo de dinero de Crimson, y cómo se incorpora al token de la metaDAO?” Según @hexonaut, el lanzamiento inaugural de Crimson será una interfaz de préstamos de alta eficiencia. Inicialmente, el flujo de dinero se generará a partir de tasas de interés surgidas de dicho mecanismo de préstamos.  Como en las Maker Vaults, los usuarios podrán depositar activos digitales para tomar prestado DAI (con el agregado de un Stability Fee ). Se recaudarán primas adicionales de los usuarios que “toman prestados” estos colaterales.  Estas tarifas recolectadas luego se distribuirían entre las LP y la metaDAO. “¿Planean usar D3M para plataformas de RWA?” Actualmente, Crimson no se enfoca en RWAs, sino más bien en activos nativos de DeFi. “¿Crimson tendrá gobernanza on-chain?” Si, el metaToken funcionará como el token de gobernanza de la plataforma. “¿Cuáles son algunos competidores potenciales, y por qué es mejor este Cluster?” Competidores listados: Aave, Compound, Oiler Finance. hexonaut cree que Crimson posee dos ventajas en su nicho:  La plataforma se enfoca en activos significativos (p.e., BTC, ETH, y derivados de stETH) y no competirá por activos de menor relevancia. Los demás mercados de prestamos utilizan los oráculos de Chainlink. Al inicio, Crimson, en su lugar, utilizará los oráculos de Maker, pero la visión final sigue siendo un sistema de múltiples oráculos, utilizando tanto los de Chainlink como los de Maker.  “¿Están planeando tener tarifas algorítmicas?” Las stables se pueden tomar prestadas a tasas fijas en cantidades que no excedan el límite de deuda actual. @hexonaut ve estas tarifas fijas como una parte integral del atractivo de la plataforma. “A los usuarios no les gusta tomar posiciones apalancadas en plataformas con tasas de préstamo volátiles que pueden aumentar en cualquier momento, por lo que [Crimson] prefiere el modelo de Maker para el préstamo de monedas estables.” La entrevista completa se puede encontrar aquí, o a través del enlace anterior.  Cluster Viridian  La presentación del Cluster aquí.  “¿Qué piensa su Cluster acerca de la posibilidad de asociaciones percibidas como de bajo riesgo con organizadores que buscan, justamente, oportunidades más riesgosas?” Según @Allan_Pedersen, la idea es generar el máximo rendimiento, pero muchas de las estratagemas dependen de los “esquemas duros” que Maker desarrolle para expandir los RWA. “¿Ven alguna oportunidad a corto o mediano plazo con Corporates?” Viridian actualmente opera con conceptos de bajo riesgo, y el proceso de gobernanza actual se mueve muy lento como para asumir riesgos de ese tipo en el contexto actual. Puede que el equipo vea posibilidades potenciales en esto, pero no convenientes para el momento actual de Maker. “¿Cómo planean cubrir el riesgo de las RMBS cuando se expongan a él a través de los arrangers?” Ya que estos bonos se compran por debajo del “par”, Viridian debería obtener rendimiento adicional. Por lo general, esto crearía riesgos adicionales a medida que este ingreso se reinvierta, pero el equipo no espera sufrir pérdidas en este rendimiento ya que el flujo de dinero de Viridian está lo suficientemente comprimido. “En el ambiente actual, ¿por qué no apostar todo en bonos del tesoro y ganar más del 4 % con un riesgo mínimo?” Según @SebVentures, el equipo ha considerado reinvertir sus bonos de corto plazo, pero hacerlo a través de instrumentos DeFi se presenta un problema: “En algún punto, tenemos que darle parte de este flujo de dinero a los holders de DAI incrementando el DSR.” Para recibir un rendimiento el 4% “libre de riesgos” las stables asignadas tendrían que ser arbitradas. Usando productos DeFi para este proceso, mucho de este rendimiento se perderia debido al slippage y el arbitraje. Sumado esto a cualquier aumento de DSR, la diferencia general sería muy estrecha. “¿Viridian Cluster es responsable de las evaluaciones legales y de riesgo de sus acuerdos de RWA?” Según Allan_Pedersen, el equipo espera proporcionar evaluaciones legales y de riesgo independientes con respecto a las “contrapartes directas” (p.e., Monetalis y cualquier arreglo futuro ratificado a través de la gobernanza). La conversación completa puede ser encontrada aquí, o a través del enlace en el título.    ¡Algunos avisos!  ¡Drinks with Delegates ft. Kurt Barry de PECU!  @ultraschuppi y @flipflopflapdelegate se reunen nuevamente, pero esta vez invitan a @Kurt_Barry para discutir acerca de las stablecoins descentralizadas y los desafíos asociados con el scaling a largo plazo. Además, el trío compartió sus opiniones y las posibles implicaciones que tendría la reactivación del DSR a medida que las tasas de interés federales continúan aumentando. Esta idea se originó en el canal de gobernanza. Sin embargo, las bebidas no terminaron tan pronto; hubo más discusiones, y estas se centraron en el Mecanismo de Retroalimentación de la Tasa Objetivo y el Problema Colateral de DeFi.  SES Ecosystem Performance API & Dashboard - Nueva versión   Visita su panel en https://expenses.makerdao.network/  Se puede acceder a la API de GraphQL usando el API explorer  Descarga la última herramienta de presupuesto aquí   SES se alegra de anunciar las siguientes adiciones a su Panel de Gastos:    DAO-Level Activity Feed  Un feed de actividad global con todo lo que sucede en la plataforma, con la posibilidad de filtrar según la Core Unite que interese buscar.    Privacy Control Improvement    Permite que el usuario elija si las cookies se pueden usar para recordar el modo oscuro, marcadores de última visita y el seguimiento del uso de funciones básicas.    Commenting Improvement for Expense Reports    Una herramienta de comentarios generales para el informe mensual de gastos permite a los Administradores de Core Unit brindar más contexto sobre sus gastos.    Offboarded Core Units Improvement    Con los cambios votados recientemente para eliminar varias Core Units de MakerDAO, SES ha especificado aún más estos cambios en el panel al introducir el estado “obsoleto” para dichas Core Units.   new User Authentication    SES está trabajando actualmente en la capacidad de los usuarios para autenticarse en el panel, lo cual es un requisito fundamental para futuras funciones de colaboración.       Llamadas, Reuniones y Eventos  Visita: Calendario de Llamadas  Llamadas de la Semana Pasada   Reunión de la Gobernanza de MakerDAO & Riesgo #214   Video / Foro / Editorial  Discussion Seleccionada: ¡Sam MacPherson (@hexonaut) & Allan Pedersen (@Allan_Pedersen), miembros de los Clusters Crimson y Viridian, nos guiaron a través de los objetivos principales de sus Clusters y respondieron nuestras preguntas!   La llamada de DVC de la semana pasada fue cancelada El Delegate Office Hours de la semana pasada fue una ‘sesión relajada’ y, por lo tanto, no se grabó.   Próximas Llamadas   Comité de Votantes Descentralizado - Mañana a las 4:00PM  Unirse    Delegate Office Hours - 10 de noviembre del 2022, a la 1:00PM  Unirse    Reunión de la Gobernanza de MakerDAO & Riesgo #215 - 10 de noviembre del 2022, a las 2:00PM  Unirse      Core Unit Office Hours    Unirse | Preguntas y Respuestas de GovAlpha Governance - Ayer, a las 2:00PM  Unirse | Immunefi Security - Mañana, a las 12:00PM  Unirse | Escalamiento de Ecosistemas Sostenibles - Hoy, a las 11:30AM  Unirse | Protocol Engineering - Hoy, a las 12:00PM Unirse | 6S Capital - Cada dos miércoles a las 14:00 UTC  Unirse | Growth - Primer miércoles de cada mes a las 17:00 UTC  Unirse | Real World Finance - Cada dos miércoles a las 18:00 UTC  Unirse | Governance Communications - 11 de noviembre del 2022, a las 4:00PM     Recursos  Open List  Todos los Tableros Disponibles   Todas las Guías Disponibles   Calendario de Llamadas   Foro y Discord de Maker   Tracker de los Tableros de Gobernanza | Versión en Google Sheet  Discusiones del Foro - Tablero de Gobernanza    Conoce tu Índice MIP   Portal de aprendizaje y Technical Documentation   Servidores de Discord de MakerDAO   MakerBurn   Lista de Charlas   Herramientas de Participación   Calendario de Votaciones y Fechas Importantes    Disclaimer Disclaimer:  Esta actualización fue ensamblada por un grupo de miembros que contribuyen a la comunidad de MakerDAO. La misma no debería servir como asesoría financiera ni como incentivo para votar de alguna forma específica. Esta actualización es meramente informativa y se ha realizado solamente con fines informativos.  Esta es una traducción libre del Artículo original en inglés por @Brigith238 y @Harrizko ",
                    "links": [
                        "https://www.youtube.com/watch?v=1CldERGVzFM",
                        "https://www.youtube.com/watch?v=1CldERGVzFM&t=864s",
                        "https://www.youtube.com/watch?v=1CldERGVzFM&t=864s",
                        "https://www.youtube.com/watch?v=1CldERGVzFM&t=1853s",
                        "https://www.youtube.com/watch?v=1CldERGVzFM&t=1853s",
                        "https://discord.com/channels/893112320329396265/899667119426371625/1037677514774020187",
                        "https://expenses.makerdao.network/",
                        "https://studio.apollographql.com/public/Performance-Dashboard-Prd",
                        "https://github.com/liberuum/budget-tool/releases",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://youtu.be/1CldERGVzFM",
                        "https://forum.makerdao.com/t/governance-and-risk-214-november-03-at-17-00-utc/18637",
                        "https://forum.makerdao.com/t/crimson-creator-cluster/18241",
                        "https://forum.makerdao.com/t/viridian-cluster-introduction/18332",
                        "https://forum.makerdao.com/t/no-meeting-today-endgame-call-wednesdays-9pm-cest-link/18123",
                        "https://us02web.zoom.us/j/89326394914",
                        "https://us02web.zoom.us/j/88920093364",
                        "https://zoom.us/j/697074715",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://makerdao.bigbluemeeting.com/adm-eox-jtz-tsi",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com/t/all-available-dashboards/16104",
                        "https://forum.makerdao.com/t/all-available-guides/16159",
                        "https://forum.makerdao.com/t/the-calls-calendar/16095",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://www.makerdao-governance-dashboard.com/tracker",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://www.makerdao-governance-dashboard.com/tracker/forum-discussions",
                        "https://forum.makerdao.com/t/know-your-mip-index/6768",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forum.makerdao.com/t/makerdaos-discord-servers/16110",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/office-hours-list/16162",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://forum.makerdao.com/t/the-votes-and-important-dates-calendar/16096",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/23"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.311992694805195
                }
            ]
        }
    ],
    "group_index": "1843"
}