{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ces-september-2022-update/18304",
            "title": "CES September 2022 Update ",
            "index": 18304,
            "category": [
                "Core Units",
                "Collateral Engineering Services"
            ],
            "tags": [
                "cu-update",
                "ces-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#1",
                    "likes": "1",
                    "time": "10/10/2022-14:58:28",
                    "content": "CES Update: September 2022  1600×586 90.6 KB  Roadmap: collapse version - only milestones. Timelines in these updates only include technical scope from CES CU. Most projects include work from other CUs and those timelines are not displayed in these updates.  TL;DR  MIP65 pilot deployment Executive Spell is live! New module called RwaCageSettlement to take care of Emergency Shutdown collateral redemption for RWAs GNO Token Assessment has been published. rETH Onboarding spell is work in progress.  Reaching out to Coinbase to address feasibility for MIP81 Technical implementation suggested in the forum. Early discussions on MIP82 and Blocktower MIP6 deals.   Collateral Onboarding  On Chain and Off Chain Collateral Onboarding   1600×475 60.8 KB    EPIC: GNO Technical Assessment As per greenlight for the MIP6 application, CES has delivered a Token assessment for GNO. During the monday CSI calls CES has also aligned with other CUs such as Risk and Oracles to plan the coordinated onboarding of this collateral.  EPIC: rETH onboarding CES is working on an onboarding spell for this collateral. During CSI calls we’ve coordinated the effort with PE, SAS and Risk Core Units.  EPIC: Blocktower Technical Assessment CES had interactions with Centrifuge and Christian Petersen during September to discuss and shape the deal. CES also invested time on getting acquainted with existing Centrifuge integrations and the overall Centrifuge protocol.  Collateral Management  1600×505 72.8 KB   EPIC: Deliver on MIP65: Monetalis Clydesdale: Liquid Bond Strategy & Execution In collaboration with GovAlpha, SF, PE, Christian and Monetalis, CES delivered the Executive Spell for this vault. This is a pilot deployment of 1M DAI as defined in Resolution 3 here We remain in contact with Monetalis to coordinate the success of the pilot deployment and secure a secondary spell which will automatically allow Monetalis to mint 50M DAI more each week until they reach the debt ceiling of 250M DAI. CES also delivered a new module called RwaCageSettlement to take care of Emergency Shutdown collateral redemption for RWAs. This was a piece missing in the overall RWA smart contract suite. The design and implementation has been discussed with PECU and is under review. We aim to launch this with MIP65 in the upcoming month and define how to implement it for deals moving forward from a technical and legal perspective.  EPIC: MIP82: Monetalis/Coinbase Appaloosa Tech Assessment CES has been interacting with Monetalis and Christian Petersen on discussing and shaping this deal. This has informed an early technical solution which will later inform the final Tech Assessment which will be published in the forum as always.  EPIC: MIP81: Coinbase Institutional Rewards CES provided input in the forum to help Coinbase and MakerDAO define the MIP81 further to secure a correct technical implementation. We’ve proactively reached out to Coinbase Technical contacts facilitated by Growth CU in order to further discuss the suggested technical implementation approach and assess feasibility.  General Updates  CU Management & Operations  Published the Sept 2022 Budget Summary    Previous Sprint Updates  CES Sprint Update #1 (2022/Q1 - Jan 31st to Feb 11th 2022) CES Sprint Update #2 (2022/Q1 - Feb 14th to Feb 25th 2022)  CES Sprint Update #3 (2022/Q1 - Feb 28th to Mar 11th 2022) CES Sprint Update #4 (2022/Q1 - Mar 14th to Mar 25th 2022) CES April 2022 Update CES May 2022 Update CES June 2022 Update CES July and August 2022 Update  Questions❔ Join our Discord and engage with us! JOIN NOW ",
                    "links": [
                        "https://github.com/makerdao/mip21-toolkit/pull/23",
                        "https://forum.makerdao.com/t/gno-erc20-token-smart-contract-technical-assessment/18162",
                        "https://github.com/makerdao/spells-goerli/pull/114",
                        "https://forum.makerdao.com/t/mip81-coinbase-usdc-institutional-rewards/17703/201",
                        "https://vote.makerdao.com/polling/QmcUnpWV#vote-breakdown",
                        "https://forum.makerdao.com/t/gno-mip6-collateral-onboarding-application-gnosisdao/17321",
                        "https://forum.makerdao.com/t/gno-erc20-token-smart-contract-technical-assessment/18162",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672&range=A13",
                        "https://github.com/makerdao/spells-goerli/pull/114",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672&range=E15",
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-documentation-hq/17923/7",
                        "https://github.com/makerdao/mip21-toolkit/pull/23",
                        "https://forum.makerdao.com/t/mip81-coinbase-usdc-institutional-rewards/17703/201",
                        "https://github.com/monkeyirish/ces-core-unit/blob/master/reporting/budget-monthly/2022-10-01.md",
                        "https://forum.makerdao.com/t/ces-sprint-update-1-2022-q1-jan-31st-to-feb-11th-2022/13273",
                        "https://forum.makerdao.com/t/ces-sprint-update-2-2022-q1-feb-14th-to-feb-25th-2022/13514",
                        "https://forum.makerdao.com/t/ces-sprint-update-3-2022-q1-feb-28th-to-mar-11th-2022/14033",
                        "https://forum.makerdao.com/t/ces-sprint-update-4-2022-q1-mar-14th-to-mar-25th-2022/14451",
                        "https://forum.makerdao.com/t/ces-april-2022-update/14999",
                        "https://forum.makerdao.com/t/ces-may-2022-update/15825",
                        "https://forum.makerdao.com/t/ces-june-2022-update/16485",
                        "https://forum.makerdao.com/t/ces-july-and-august-2022-update/17817",
                        "https://discord.gg/n7tNRyVYQz",
                        "https://forum.makerdao.com/t/ces-update-october-november-and-end-of-2022-forecast/19050",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-september-2022/18288",
                        "https://forum.makerdao.com/t/ces-update-january-2023/19783"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.364036325992848
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/01/2023-14:58:34",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}