{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/launching-oasis-on-ipfs/3755",
            "title": "Launching Oasis on IPFS ",
            "index": 3755,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "oasis"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MagoCrypto",
                    "index": "#1",
                    "likes": "8",
                    "time": "20/08/2020-17:36:06",
                    "content": "Hello, My name is Mago and I am with Unstoppable Domains. We built Oasis on IPFS and would like to transfer the website oasisapp.crypto to the Maker DAO. Why we believe this is important:  Puts the DAO in charge of the Oasis App instead of any one person It would give users the ability to interact with Oasis in the case the website servers were attacked or removed by a third party It would give users the ability to interact with Oasis in the case oasis.app was seized by the domain registrar  Once the domain is transferred, Maker DAO will have full control over the website. Please let us know where to transfer the domain or if you have any questions you would like us to answer. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-121-thursday-december-10-16-00-utc/5468/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-09/3793"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#2",
                    "likes": "3",
                    "time": "20/08/2020-17:55:25",
                    "content": "Really interesting idea! I wonder if controlling a UI and domain through IPFS could expose MakerDAO to new legal risks? I think it would be a first for the DAO directly controlling user facing content. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.311363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#3",
                    "likes": "0",
                    "time": "20/08/2020-18:13:18",
                    "content": "I’ve been thinking about this and wondering if any jurisdictions are putting into place legal structures that a DAO can have legal signatory authority. So say we wanted to sign a contract. We could vote on an executive that on execution (if passed) signs a digital contract. We would just need governmental backing that enforces the legitimacy of our existence, similar to a corporation. Thats how I see the future of DAO’s anyways. Decentralized, block-chain native corporations. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#4",
                    "likes": "0",
                    "time": "20/08/2020-20:49:30",
                    "content": "I imagine that’s why Augur has all of their disclaimers and warnings before the site loads.  I’d be more concerned about UX and making updates.  I’m not sure the kind of mechanisms the DAO would need to have in place to manage these decisions.  I can’t imagine we would be voting on color pallets and layout  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#5",
                    "likes": "4",
                    "time": "22/08/2020-08:50:01",
                    "content": "We should delegate the UI/UX work to a team which has such skills. This could be a group of designers / devs from any organization that we determine is trustful. We should then have the mechanism in place to pay to 3rd parties for their services. I propose a mechanism for the webpage which has a basic JS script which loads remaining content from the blockchain. The page will load its content from another IPFS “address” (hash) which lives in the Blockchain and we can vote for. If there is any bad intention from one of those 3rd parties we pay to make the work, we simply put their content down and remove their ability to modify content. In resume:   The page that loads all the content displayed lives in IPFS, has its own hash (therefore it cannot be modified like a Smart Contract). It only loads the content that it is really displayed to the user.   This page loads the content from another IPFS address which lives in the bloackchain, in one of our controlled contracts that we could vote for.   We then could add/remove 3rd party addresses to be able to modify the content.   Governance could always vote for changing the content, and changing the 3rd parties which can as well change the content.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2352607709750565
                }
            ]
        }
    ]
}