{
    "poll_list": [
        {
            "title": "Ratification Poll for Modify Core Unit Budget - Collateral Engineering Services, CES-001 (MIP40c3-SP57) - February 14, 2022",
            "index": "12578",
            "option": "Yes",
            "supporting_mkr": "81,598",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp57-modify-core-unit-budget-collateral-engineering-services-ces-001/12578",
            "title": "MIP40c3-SP57: Modify Core Unit Budget - Collateral Engineering Services (CES-001) ",
            "index": 12578,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "budget",
                "core-unit-budget",
                "ces-001",
                "dai-budget"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#1",
                    "likes": "3",
                    "time": "12/01/2022-16:44:43",
                    "content": " MIP40c3-SP57: Modify Core Unit Budget - Collateral Engineering Services (CES-001)  Preamble MIP40c3-SP#: 57 Author(s): @monkey.irish Contributors: @lollike Tags: core-unit, ces-001, budget, dai-budget, active Status: Accepted Date Applied: 2022-01-12 Date Ratified: 2022-02-28   Sentence Summary MIP40c3-SP57 is a new MIP providing for the continuation of the Dai budget implementation for Core Unit CES-001: Collateral Engineering Services.  Paragraph Summary The MIP40c3-SP57 Dai budget implementation for Core Unit CES-001: Collateral Engineering Services contains:  The CES-001 budget for Q2 2022 through Q1 2023. This is a continuation of the Q4 2021 through Q1 2022 budget in MIP40c3-SP30. Automates Dai payments from the Maker Protocol surplus buffer to the Auditor Wallet by establishing a DssVest stream for funding. Unless specified in MIP40c3-SP57, all prior terms and conditions ratified in the prior Dai budget implementation, MIP40c3-SP30, are considered active and are not modified or revoked by this proposal.   Specification  Motivation To support the ongoing needs and innovation of Maker protocol collateral, funding is requested to:  Support the ongoing onboarding needs of on-chain (crypto-native) collateral. Architect and implement off-chain (real-world assets) collateral solutions to aggressively onboard and scale Dai in 2022. Enable a portion of prospective collateral to be onboarded using individuals, partners, and/or intermediaries. Maintain and operationalize all collateral within the Maker Protocol. Support the entire collateral lifecycle with Product Management best practices.   Core Unit ID CES-001  Budget Implementation The CES budget is designed to pay for the operational costs to run and sustain the CES Core Unit. Therefore, a vote to ratify MIP40c3-SP57 means MKR holders make a commitment to a continuous funding model that operates on an annual basis starting April 1, 2022.  CES Payment Flow Structure1322×756 94.2 KB   Multisig Wallets The following wallets are involved:   Auditor Wallet – A 3-out-of-4 multi-sig, controlled by trusted MakerDAO members. This multi-sig will hold funds in Dai and receive the DssVest stream. All funds pass through this wallet before any are sent to the CES Operational Wallet. The Maker Protocol (MCD_PAUSE_PROXY, 0xBE8E3e3618f7474F8cB1d074A26afFef007E98FB) is listed as a beneficiary on the Auditor Wallet. This allows the Maker protocol to withdraw up to 1B Dai from the Auditor Wallet, ensuring control over these funds and acting as a back-up.   CES Operations Wallet – A 2-out-of-3 multi-sig, controlled by CES. This multi-sig will be used for Core Unit expenses.    Core Unit Monthly Budgeting Cycle Within the first 10 days of each month, CES will publish a public Monthly Budget Statement with the following sections:  For each month, an accounting of funds spent in the prior month An updated budget forecast for the next three months A detailed overview of CES MKR vesting Requests for funding transfer(s) from DssVest to the Auditor Wallet Requests for funding transfer(s) from the Auditor to the CES Operations Wallet A list of transfer(s) from the CES Operations to the Auditor Wallet A list of transfer(s) from the Auditor Wallet to the surplus buffer  The Monthly Budget Statements can be found within this git repository on Github.  Funding Cycle   Funding Requests - Requests for funding the CES Operations Wallet will be listed in the Monthly Budget Statement. The request will be based upon the 3-month budget forecast and Dai on hand in the CES Operations Wallet. The goal is to keep approximately 3-months of runway in the CES Operations Wallet.  Funding Transaction - CES submits the necessary transaction requests for the Auditor Wallet signers to sign.  Transaction Verification - The Auditor Wallet signers will verify the Monthly Budget Statement and Funding Transaction(s).  DssVest Pull - The Auditor Wallet signers will pull available funds from the CES DssVest contract, replenishing the available funds in the Auditor Wallet.  Transaction Execution - The Auditor Wallet signers sign the transaction and then it is executed.  Return of Excess Funds - CES has the ability to return Operations Wallet surplus Dai to the Auditor’s Wallet or surplus buffer.   Projected CES Dai Balance On April 1, 2022, the following are the projected CES Dai balances based upon the current budget projections:     Projected Budget Summary (Dai)      Auditor Wallet (opening balance) 575,958   Operations Wallet (opening balance) 647,594   Q4 2021 CES Budget -275,917   ETH (cost, time of purchase) -12,484   Q1 2022 CES Budget (projected) -499,195   Projected Balance 435,956       CES 3-month runway, Apr 1 2022 695,140       Shortfall -259,184    In Oct 2021, CES funded the Operations Wallet with an initial transfer of 647,594 Dai from the Auditor Wallet. This has been sufficient to fund the CES operations in Q4 2021. CES will transfer 575,958 Dai from the Auditor to Operations Wallet in Feb or March 2022 to maintain a 3-month runway. Based upon the projected analysis above, CES will need additional funding transferred to the Auditor Wallet to establish the 3-month runway for the Q2 2022-Q1 2023 budget. This amount will be 259,184 Dai.  Transfers/Transactions   3-Month Budget Runway Top Up Transfer   What: Provide the 3-month budget runway shortfall for the CES Q2 2022 - Q1 2023 budget.  When: Automatically, upon spell execution.  Amount: 259,184 Dai   Sender: Maker Protocol Surplus Buffer   Recipient: Auditor Wallet 0x25307aB59Cd5d8b4E2C01218262Ddf6a89Ff86da     DssVest Stream   What: Create a DssVest stream for the CES Q2 2022 - Q1 2023 budget.  When: Automatically, upon spell execution, starting on April 1, 2022 and ending March 31, 2023.  Amount: 2,780,562 Dai   Sender: - Maker Protocol Surplus Buffer   Recipient: Auditor Wallet 0x25307aB59Cd5d8b4E2C01218262Ddf6a89Ff86da     April 2022 Budget Transfer   What: Operations Wallet top up.  When: Manually, upon executive vote approval.  Amount: 259,184 Dai   Sender: Auditors Wallet: 0x25307aB59Cd5d8b4E2C01218262Ddf6a89Ff86da   Recipients: Operational Wallet: 0xD740882B8616B50d0B317fDFf17Ec3f4f853F44f      Budget Breakdown  Total Budget Cap for Q2 2022 - Q1 2023 The Total Budget Cap is 2,780,562, spanning a 12-month Cycle of Q2 2022-Q1 2023.  Budget Detail     Summary Q2 2022 Q3 2022 Q4 2022 Q1 2023 12 Months     Compensation 477,500 477,500 477,500 477,500 1,910,000   Benefits, Taxes, Retention, Other 51,481 59,858 76,611 76,611 264,562   Travel 24,000 24,000 24,000 24,000 96,000   Hardware 30,000 3,333 3,333 3,333 40,000   IT & Subscriptions 9,000 9,000 9,000 9,000 36,000   Gas Costs 16,000 16,000 16,000 16,000 64,000   Professional Services 20,000 20,000 20,000 20,000 80,000   Audits 37,500 37,500 37,500 37,500 150,000   Contingency Buffer 35,000 35,000 35,000 35,000 140,000   Total 700,481 682,191 698,945 698,945 2,780,562    Notes on the budget detail:   Compensation - The team consists of ten full- and part-time Core Unit contributors. Individual positions are detailed in the next section.  Benefits, Taxes, Retention, Other - The overhead cost of a contributor such as benefits (including healthcare), currency fluctuations/conversions, reserves, taxes, salary adjustments, or other costs outside of normal compensation. Based upon data for CES in the last quarter, approximately 13% is the actual calculation for this category of expenses.  Travel - The team may travel to present at industry events or participate in a team offsite. The budgeted amount is $1000 per person per month. The goal would be to meet twice a year around an ETH event and Devcon. Consideration is given a geographic distribution of 8-10 people and the higher than normal costs for travel and expenses.  Hardware - Costs for laptops and a local node setup, up to $3,500 per laptop or node hardware.  IT & Subscriptions - Ongoing costs relating to software subscriptions, cloud services, and contract service providers.  Gas Costs - Deploying a new standard collateral type today will cost about 1 ETH. If we onboard 20 collateral types, 20 ETH = 64,000 USD. These costs could scale up substantially.  Professional Services - Coverage for managing general operational overhead and services, contractors, legal costs, legal officer/company insurance, as well as monthly and annual financial reporting.  External Code Audits - This depends on how many new complex modules are built this year and would cover the audit of two large, complex modules. We also plan to utilize Sandboxing to minimize the complexity.  Contingency Buffer - Approximately 5-6% of budgeted costs to be held in reserves for any contingencies that might arise.  Budget Changes vs. MIP40c3-SP30  This budget implementation represents an increase of 405,093 Dai on an annualized basis. Headcount has increased from 7 to 10 contributors. The Compensation line item has increased by 628,750 Dai. The Benefits, Taxes, Retention, Other line items have decreased from 30% to approximately 13%. The Gas Costs and Audits line item has increased due to the anticipated scaling of onboarding real world collateral and the complexity of some of those solutions. The Contingency Buffer line item has decreased from 15% to approximately 5%. Overall operational costs were lower than expected and those funds are being shifted to support additional headcount.     Team Structure The team consists of eight full- and two part-time Core Unit contributors. As of the publishing of this MIP, three headcounts are open: Lead Engineer, Engagement Manager, and one Advisor.  Team Summary for Q2 2022 - Q1 2023     Team Members      Full Time    Core Unit Facilitator/Team Lead 1   Technical Product Owner 1   Solutions Architect 1   Engagement Manager 1   Lead Engineer 1   Software Engineer 3   Part Time    Advisors 2   Team Total 10    In Q4 2021, CES made significant progress in our recruiting efforts and hiring the team. There is still a little more work to do. Due to upcoming needs of the Maker protocol, especially with real-world assets, three positions were added to the headcount:   Solutions Architect - In Nov 2021, CES was very fortunate to have Nikolaj Lollike transfer from the SES to CES Core Unit. Nikolaj has an extensive background at the Maker Foundation and DAO and has been instrumental in bootstrapping CES.  Lead Engineer - (TBH) To lead the design, architecture, and implementation of the engineering solutions for real-world assets and our parallelization initiative (sandbox), a Lead Engineer is being hired to fill this role.  Engagement Manager - (TBH) To support the anticipated flow of real-world assets deals and the need for technical onboarding and maintenance, an enagement/program/project manager is being hired to fill this role.  ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP40c3SP30",
                        "https://github.com/monkeyirish/ces-core-unit/tree/master/reporting/budget-monthly",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP30",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/19",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-14-de-febrero-de-2022/13265",
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-febrero-de-2022/13294",
                        "https://forum.makerdao.com/t/weekly-relay-february-8-14-2022/13239",
                        "https://forum.makerdao.com/t/weekly-mips-update-73/13092",
                        "https://forum.makerdao.com/t/weekly-mips-update-72/12945",
                        "https://forum.makerdao.com/t/weekly-mips-update-70/12695",
                        "https://forum.makerdao.com/t/ces-q4-2021-highlights-and-beyond/12579",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-febrero-del-2022/13404",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/36",
                        "https://forum.makerdao.com/t/ces-sprint-update-2-2022-q1-feb-14th-to-feb-25th-2022/13514",
                        "https://forum.makerdao.com/t/monthly-governance-review-february-2022/13661",
                        "https://forum.makerdao.com/t/fallback-interim-facilitator-selection-process-ces-001/18911/32",
                        "https://forum.makerdao.com/t/weekly-relay-february-15-21-2022/13348",
                        "https://forum.makerdao.com/t/ces-sprint-update-1-2022-q1-jan-31st-to-feb-11th-2022/13273"
                    ],
                    "GPT-summary": "The post is a proposal for the continuation of the Dai budget implementation for Core Unit CES-001: Collateral Engineering Services. It includes a detailed breakdown of the budget, payment flow structure, funding cycle, and team structure. The proposal is explained by the author, and there is positive feedback and constructive criticism from third parties. The proposal is also audited and reviewed.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Board composition",
                        "Interoperability and Scaleability",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.259659409218233
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#2",
                    "likes": "2",
                    "time": "12/01/2022-16:45:32",
                    "content": "@blimpa Please note this MIP is in RFC and would you assign the SP number? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#3",
                    "likes": "1",
                    "time": "12/01/2022-16:51:20",
                    "content": "Also, in the next several days, CES will post a ​​Collateral Management Product Lifecycle (CMPL) overview to the forum which will give additional details on the deliverables from CES in 2022. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "2",
                    "time": "13/01/2022-03:22:35",
                    "content": "    monkey.irish:  |Team Members|| |Full Time|| |Core Unit Facilitator/Team Lead|1| |Technical Product Owner|1| |Solutions Architect|1| |Engagement Manager|1| |Lead Engineer|1| |Software Engineer|3| |Part Time|| |Advisors|2| |Team Total|10|   Hello there Rojo! With a nice sized team of 10 individuals, would it be possible for you or @lollike to list out what your performance expectations are of each person from the CES CU? And how will you determine if those expectations have been met: what are the outcomes you will track for each individual? As an example, let’s suggest 4 categories within which you can nest “KPIs” depending on your Core Unit model and strategy objectives per team member. Using a basic balance scorecard:  Velocity: measurement to evaluate deliverables and estimate your team’s productivity   Number of task assigned & completed measured in days Average time to complete/ deliver a project   Productivity Metrics (quality, timeliness, cost/efficiency)   Will CES use a measurement like commits (as an example), commits volume, code volume, etc. Assessing and quantifying Key Risk Indicators and its potential impact. Providing perspective through benchmarking.   Communication (Community engagement and satisfaction, turnover, innovation)   Enabling other Maker CU teams and key personnel to help scale collateral types faster than ever before. Providing time to develop the appropriate and effective risk responses.   Financial Frameworks   Monitoring CU expenditures and cashflow.  If we are requesting too much, I totally get it–but please provide input with regards to the first question–that will be totally appreciated. Thanks in advanced! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.769736842105263
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#5",
                    "likes": "0",
                    "time": "13/01/2022-14:39:19",
                    "content": "Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#6",
                    "likes": "4",
                    "time": "13/01/2022-19:09:31",
                    "content": "Hey! Thanks for the question. Let me start by giving you some thoughts behind this statement from another budget MIP    MIP40c3-SP56: Modify Core Unit Budget, RISK-001   This was my shameless attempt at trying to figure-out if KPIs in a DAO/Core Unit are even possible?   The perception and reality of working in a DAO is quite different than what many believe. Yes, DAOs are decentralized in structure…and very centralized in decision making. I’m not talking about what we do when voting on polls or execs. I’m talking about how people work together and build consensus to jointly own and build something. Opinions and feedback are encouraged and at the end of the day, we need to agree on something then move forward. While this doesn’t apply in all cases, it does apply to the most important cases. Look at any strategic cross core unit initiative and help me understand how we would do that if we didn’t align on a common vision for the initiative? I bring this up since a DAO structure makes it incredibly difficult to set real KPIs/OKRs/etc. due to the dependencies on key stakeholders and Core Units. Only after we build consensus and a working plan with prioritizations (e.g. the GovComms work), then we can communicate to the community what we are delivering and the timeline. From there, sure, we set team metrics to ensure we are delivering. At this level, my opinion is that you only care if our Core Unit delivered or not and stayed within our budget. Do I plan to share the deliverables and timing from CES? You bet. The upfront work needs to happen first and that is currently in progress. Remember, no one has successfully figured this out yet. We are the first and the trailblazers. There are many very experienced professionals with long histories in technology bringing in our best practices and experiences to experiment our way through this. I’m confident and excited in what we are doing.     flipflopflapdelegate:  Velocity: measurement to evaluate deliverables and estimate your team’s productivity   For CES, one of the best practices we use on the team is scrum, https://scrumguides.org/scrum-guide.html. Our agile project management tool is Shortcut.com. We used it at the Maker Foundation and I think most technical teams in the DAO are also using it. All of these productivity measures are automatically tracked and built into scrum. For me velocity is a tricky term to use. In an agile sense, it refers to how much work can be completed within each iteration or sprint. It’s a number and one team’s number is independent of any other team. What is important is how we use the velocity to complete work in our product and iteration backlogs. These backlogs are built from higher level goals/initiatives/milestones that are set based upon A LOT of information gathering and prioritization. Much of that is from cross core unit coordination.     flipflopflapdelegate:  Productivity Metrics (quality, timeliness, cost/efficiency)   Many years ago, I moved away from individual productivity metrics. What is important is team productivity. The agile and scrum processes automatically take care of any individual performance or productivity issues. Almost all of those types of issues are handled by the team themselves. Occasionally, I’ll need to step in to take care of a specific issue but I find that to be few and far between. For team productivity, that is based upon accurate estimates, cycle time, testing, rework/bugs, docs, and planned vs actual on delivery of value. For example, we are working on RWA implementations and the first one is SocGen. Will Remor asks me, what does that cost you guys? Great question! SocGen is being tracked as a body of work and we’re using that as the baseline case. And, we think there are a variety of sub use cases for MIP21 so those use cases might have different estimations. As we cycle through the implementations, my estimates will get much better based upon our actual vs. estimated work and that will factor into our overall decision making and planning process.     flipflopflapdelegate:  Communication (Community engagement and satisfaction, turnover, innovation)   A huge part of this is the cross core unit alignment meetings that we are an active participant in, https://docs.google.com/spreadsheets/d/18FFp6aG39zW7uLnHcoqBhKNHe2FbK96txRoFFQn7lt0/edit#gid=852734118. We’re working on an external readout of these meetings that track the individual initiatives and deliverables to keep the community informed on our progress and to get feedback. It’s a large effort that will start to show some serious results very soon. The other component that supports our external focus is implementing an agile product development model that provides for a product manager always have key stakeholders involved with most everything we do. This is an overwhelming slide deck but it will give you an idea of the techniques I’ve been trained on and using for years, https://agilealliance.org/wp-content/uploads/2016/01/Stakeholder-Management-by-Drew-Jemilo-Agile2012.pdf.     flipflopflapdelegate:  Financial Frameworks   CES has process in place already and currently post the results here, https://github.com/monkeyirish/ces-core-unit/tree/master/reporting/budget-monthly. We saw the system SES uses to track their expenses (spreadsheet) and ours is similar. Someone please develop a Quickbooks for crypto! ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/18FFp6aG39zW7uLnHcoqBhKNHe2FbK96txRoFFQn7lt0/edit#gid=852734118",
                        "https://www.google.com/url?q=https://scrumguides.org/scrum-guide.html&sa=D&source=docs&ust=1642102040629149&usg=AOvVaw2mKvMEEh1Xow_6xVHpqeV4",
                        "http://Shortcut.com",
                        "https://www.google.com/url?q=https://docs.google.com/spreadsheets/d/18FFp6aG39zW7uLnHcoqBhKNHe2FbK96txRoFFQn7lt0/edit%23gid%3D852734118&sa=D&source=docs&ust=1642092542886186&usg=AOvVaw1olZFCiohLdQrxtCR4wdA8",
                        "https://www.google.com/url?q=https://agilealliance.org/wp-content/uploads/2016/01/Stakeholder-Management-by-Drew-Jemilo-Agile2012.pdf&sa=D&source=docs&ust=1642092542886412&usg=AOvVaw2ax03aCwB5disft5WdhbgY",
                        "https://www.google.com/url?q=https://github.com/monkeyirish/ces-core-unit/tree/master/reporting/budget-monthly&sa=D&source=docs&ust=1642091290890108&usg=AOvVaw050UY00sfgPA2vrX477sgz",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/69"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.003174603174603
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "1",
                    "time": "13/01/2022-19:33:42",
                    "content": "    monkey.irish:  There are many very experienced professionals with long histories in technology bringing in our best practices and experiences to experiment our way through this. I’m confident and excited in what we are doing.   100% agree with you Rojo! And from your keyboard to God’s ears–I hope we solve this riddle.     monkey.irish:  For CES, one of the best practices we use on the team is scrum, https://scrumguides.org/scrum-guide.html.   Interesting you bring this up–I have a friend who’s fortune 500 company paid him to get certified as both a Scrum 'Master\" and to get certified as a Facilitator. Super cool that your team is using such. What statistics and metrics does the scrum monitor? And TY for pointing out the “shortcut” tool     monkey.irish:  For me velocity is a tricky term to use. In an agile sense, it refers to how much work can be completed within each iteration or sprint. It’s a number and one team’s number is independent of any other team. What is important is how we use the velocity to complete work in our product and iteration backlogs.   Yeah, for sure–I was trying to gauge the “velocity” that CES can sprint some of these collateral type of MIP6 applications. Recently there has been talks within the community that there is a backlog of MIP6 applications that were “greenlighted” and then nothing was heard back. So, just trying to get more clarity there as to how your team will monitor – but as you mentioned, “These backlogs are built from higher level goals/initiatives/milestones that are set based upon A LOT of information gathering and prioritization. Much of that is from cross core unit coordination.”     monkey.irish:  And, we think there are a variety of sub use cases for MIP21 so those use cases might have different estimations. As we cycle through the implementations, my estimates will get much better based upon our actual vs. estimated work and that will factor into our overall decision making and planning process.   On the subject of MIP21, assuming MIP#??? becomes the Arranger Model MIP–how will that help improve productivity and do you think the Arranger model along with a revamped RWF team will help you more, or, do you think there will be a learning curve/will it get easier? All in all thank you so much for providing answers to my questions–totally appreciate it! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.451736111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#8",
                    "likes": "1",
                    "time": "14/01/2022-09:10:33",
                    "content": "    flipflopflapdelegate:  What statistics and metrics does the scrum monitor? And TY for pointing out the “shortcut” tool   Hola ElProgreso! Miguel here, Product Owner in CES. I personally look at burndown charts (how many points we are “burning”). Points is a proxy for work effort based on complexity of each task in the sprint. Velocity is, at the end, just the amount of points burned per sprint (2 weeks sprints for CES). By looking at burn down charts I can see when there are blockers in the sprint and at which stage the tickets get blocked. This helps discuss what are the causes of this at a team level. Most likely it is dependencies: technical or cross-team. Sometimes it can be misunderstandings about team internal processes, or even personal issues within the team. I also like to review sprint goals and check if we really accomplish them, which helps me gauge how focused the team is and how willing we are at walking the extra mile to make the goal on the last days of a sprint. Having said that, we are just starting. Some processes are being internalized by the team, new ones each sprint. This processes become habits, good ones. Once habits are formed a certain velocity is established and then review and improvement needs to happen. Of course, there are more metrics which are used once a problem has surfaced which would help identify the root causes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.836792292674646
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#9",
                    "likes": "1",
                    "time": "14/01/2022-13:33:35",
                    "content": "Buenas tardes Miguel! Thank you for describing the specific data points that CES tracks and uses to improve efficiency/effectiveness. Sounds like you folks at CES have the right stuff!  Well, actually that was never in doubt  Thanks again to you, and Rojo for taking time to answers my questions. Looking forward to seeing this Core Unit blossom. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.696428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#10",
                    "likes": "1",
                    "time": "14/01/2022-16:42:12",
                    "content": "    flipflopflapdelegate:  Recently there has been talks within the community that there is a backlog of MIP6 applications that were “greenlighted” and then nothing was heard back.   Thanks for bringing this up. The backlog clean up is high on our list of priorities and we’re working on it now. Once we have the updated onboarding requirements for MIP6 finalized, we’ll circle back with all the greenlight collaterals and update them on their status. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.605555555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#11",
                    "likes": "3",
                    "time": "02/02/2022-14:52:27",
                    "content": "@blimpa Please move this MIP into formal submission, thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#12",
                    "likes": "1",
                    "time": "07/02/2022-17:59:43",
                    "content": "@blimpa I know I was a week early so for clarity of the MIP process, please move this MIP into formal submission. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                }
            ]
        }
    ],
    "group_index": "530"
}