{
    "poll_list": [
        {
            "title": "Ratification Poll for Modify Core Unit Budget, COM-001 (MIP40c3-SP62) - April 11, 2022",
            "index": "13724",
            "option": "Yes",
            "supporting_mkr": "43,058",
            "highest_fraction": 0.47
        },
        {
            "title": "Ratification Poll for Modify Core Unit Budget, COM-001 (MIP40c3-SP63) - April 11, 2022",
            "index": "13654",
            "option": "No",
            "supporting_mkr": "68,031",
            "highest_fraction": 0.74
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp62-modify-core-unit-budget-com-001/13724",
            "title": "MIP40c3-SP62: Modify Core Unit Budget, COM-001 ",
            "index": 13724,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "mip-accepted",
                "com-001",
                "core-unit-budget",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "2",
                    "time": "07/03/2022-21:15:56",
                    "content": "This version of our budget modification proposal excludes the plan for a 4th full-time hire. It includes the other budget modifications we are asking for anyway. Both proposals will run in parallel with SP63 being contingent on SP62. Assuming SP62 passes; If SP63 doesn’t pass then SP62 will be carried out. If SP63 passes, then SP63 instructions will be carried out.   MIP40c3-SP62: Modify Core Unit Budget, COM-001  Preamble MIP40c3-SP#: 62 Author(s): David Utrobin Contributors: Tags: core-unit, cu-com-001, budget, dai-budget, active Status: Accepted Date Applied: 2022-03-02 Date Ratified: 2022-04-25 Forum URL: https://forum.makerdao.com/t/mip40c3-sp62-modify-core-unit-budget-com-001/13724 Ratification Poll URL: https://vote.makerdao.com/polling/QmWQBUi6   Sentence Summary MIP40c3-SP62 slightly modifies the existing budget for COM-001 and extends funding to the end of December 2022.  Paragraph Summary This modification adjusts the team’s budget figures, extends our funding through to the end of 12/22, and updates the budget implementation. A vote to ratify this MIP means MKR holders agree to:  Fund new budget figures through to the end of Q4 2022. Approve the new budget figures below. Approve associated stream and one-time payment implementations. Top-up our team’s Continuous Operation multi-sig.   Specification  Motivation Updating the Governance Communications Core Unit budget and extending our funding for the next 6 months past our previous agreement that funds us through to the end of Q2 2022.  Core Unit Name Name: Governance Communications ID: COM-001  Contingent Execution Upon passing, MIP40c3-62 will be disregarded and marked as obsolete if MIP40c3-SP63 passes . Otherwise, if MIP40c3-SP63 fails, it will be enacted.  Budget Implementation  Smart Contract Implementation Actionable Changes If SP63 passes, ignore the instructions below and use the instructions there. New stream will be created with a total of 336,672 DAI streamed to 0x1eE3ECa7aEF17D1e74eD7C447CcBA61aC76aDbA9 starting 2022-07-01 and ending 2022-12-31 One-time payment26,390 to the Governance Communications Operational multi-sig 0x1eE3ECa7aEF17D1e74eD7C447CcBA61aC76aDbA9 One-time payment46,836 to the Continuous Operation multisig 0x99E1696A680c0D9f426Be20400E468089E7FDB0f Information Governance Communications Operational multi-sig: 0x1eE3ECa7aEF17D1e74eD7C447CcBA61aC76aDbA9  Implementation: Distribution to the Core Unit multi-sig will be executed by a DssVest Dai stream. Ownership: This multi-sig is 1 of 1, with additional signers to be added as needed. Frequency: Protocol distributions to the multi-sig will occur continuously.  Governance Communications Continuous Operation multi-sig: 0x99E1696A680c0D9f426Be20400E468089E7FDB0f  Implementation: This multi-sig was already funded in full upon successful onboarding of the Governance Communications Core Unit. Access: In order for funds to be accessed from this multi-sig, the Maker protocol must be in a state where it is unable to pay team salaries due to protocol error, shutdown and/or under governance attack. Ownership: The Continuous Operation multi-sig will require 3 of 6 signatures from the following keyholders. This may be expanded to other critical Core Units as they are formed:  DavidUtro (COM-001): 0xE91f4F5834bB9312A45B2bd75804b32CC3DA8fd3 LongForWisdom (GOV-001) : 0x66f40F044E0e2F77bB746e3275E82e88dCBA2D69 Primoz (RISK-001): 0x5d67d5B1fC7EF4bfF31967bE2D2d7b9323c1521c Aes (SF-001): 0xe9daebb99B1D29E1AE32F44fdfccbc8Df0ef3Aa7 Brian McMichael (PE-001): 0xC0dE1AB51082442f821bA273273B4F7d32521D8b Nik Kunkel (ORA-001): 0xB4CFf22c0d5a015460Fd503a9328Bf00a24f686c  Continuous Operation To ensure 3 months of continuous operation in the event of emergency shutdown or protocol issues, we have been granted an upfront lump-sum of 3 months of runway to sit in a protocol owned multi-sig. Calculation: Use initial annual budget figure(from SP8) divided by 4 to determine the 3-month runway sum: 121,500 DAI → SPXX based figure: 168,336 DAI – 46,836 difference Detail:  Change to 168,336 requested, see third actionable change above. The lump-sum will be held outside of the surplus buffer in a protocol owned multi-sig. If normal protocol operation is not possible due to emergency shutdown or other protocol failure, these funds will be used to ensure continuous operation as the system gets back up and running. At the conclusion of the year, the lump sum will remain in the multi-sig for the following year and may be increased or decreased at that point in time due to changes in the projected budget.   Monthly Budget Statement Within the first 14 days of each month, COM-001 will submit an update to its public financial documentation:   Last Month Actuals, i.e. the actual expenses (DAI and MKR) of the month that just ended, this includes reporting any surplus or deficit.  The Budget Forecast, based on the latest available information, of the budget (in DAI) that is required to maintain a 3-month runway for the team.  The MKR Vesting Overview, this is a schedule that has the expected MKR vesting amounts for the current team configuration, grouped by the pay-out month.  Totals, Total received and spent to-date.  The Monthly Budget Statements are added to this git repository on Github. Our other public financial documentation includes this public budget overview.  Budget Breakdown     Descriptions (Updated Feb 2022) Annual (SP40) Annual (This SP) Change     Salaries (3 FTE) $ 285,000.00 $ 310,200.00 $ 25,200.00   Hourly Compensation (~1 FTE) $ 45,000.00 $ 70,000.00 $ 25,000.00   Healthcare $ 43,200.00 $ 43,200.00 $ -   Employer Taxes $ - $ 37,224.00 $ 37,224.00   Sign-on Expenses $ 1,800.00 $ - $ (1,800.00)   Travel & Events $ 32,000.00 $ 42,000.00 $ 10,000.00   Operating Expenses $ 8,000.00 $ 80,720.00 $ 72,720.00   Legal Services $ 50,000.00 $ 30,000.00 $ (20,000.00)   Contingency Buffer $ 50,000.00 $ 60,000.00 $ 10,000.00   Total $ 515,000.00 $ 673,344.00 $ 158,344.00    Notes:  “Professional Services” category has been renamed to “Legal Services.” “Operating Expenses” now includes our accounting and admin costs, hence the large increase. This expense was formerly in the “Professional Services” category. This change more accurately reflects costs and categories for purposes of transparency. We previously budgeted 0 for legal services and have been using the contingency buffer to fund this expense. The 50k you see from the previous proposal was 100% for AccountAble and other professional service costs. We previously budgeted 0 for Employer Taxes and have been using the contingency buffer to fund this expense.  Changes:   Salaries: We have adjusted existing salaries for annual raises.  Hourly Compensation: We significantly increased our contributor budget since MKT-001 was offboarded causing our stakeholder content production team to be understaffed.  Healthcare: Healthcare benefits for full time employees that averages $1200 per month per person.  Employer Taxes: Employer tax contributions are 12% of salary for US based employees. We did not account for this expense in prior budget proposals. The contingency buffer provided coverage for this up until now.  Sign-on Expenses: We are no longer doing sign on bonuses. The initial bonuses were to compensate the initial team members for the inconvenience of not getting paid for 2 months until our payroll setup was completed.  Travel & Events: We request a 15k events budget,formerly 5k, to allow our team to more comfortably contribute to Makerdao CU event expenses (dinners, offsites, coworking spaces, etc) The other 30k is for travel and team expenses. This assumes 1x team-wide offsites (3 persons) & 3x one-off events for 2 person per year.  Operating Expenses: Includes accounting & admin costs, software subscriptions, hardware & physical materials, and transaction gas fees.  Legal Services: Funds our work with TechGDPR legal firm.  Contingency Buffer: Increase associated with total increased budget size. We aim for ~10% contingency buffer.  Continuous Operation multi-sig: Adjustment to reflect 3 months of operating expenses.   MKR Vesting The Governance Communications Team will add some version of MKR vesting for its team members, retroactively dated to the first day of their employment. Instead of offering our own unique proposal now, we will wait for the community to come to consensus around how Core Units should set this up. We support the formation of an overarching MKR Vesting framework that all Core Units can follow. ",
                    "links": [
                        "https://github.com/MakerDAO-Governance-Communications-CU/transparency-reporting",
                        "https://docs.google.com/spreadsheets/d/1H41VHDwZDlF9CSAlbR-u5NBUhp1qwTcaSGNkYB5C5bI/edit?usp=sharing",
                        "https://forum.makerdao.com/t/governance-and-risk-187-thursday-april-21-17-00-utc/14708/2",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/57",
                        "https://forum.makerdao.com/t/relay-semanal-12-18-de-abril-de-2022/14724",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-18-de-abril-de-2022/14700",
                        "https://forum.makerdao.com/t/weekly-relay-april-12-18-2022/14691",
                        "https://forum.makerdao.com/t/weekly-mips-update-83/14673",
                        "https://forum.makerdao.com/t/relay-semanal-5-11-de-abril-de-2022/14616",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-11-de-abril-de-2022/14594",
                        "https://forum.makerdao.com/t/weekly-relay-april-5-11-2022/14590",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-mar-14-mar-25/14263",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-feb-28-mar-11/13887",
                        "https://forum.makerdao.com/t/weekly-relay-may-3-9-2022/15084",
                        "https://forum.makerdao.com/t/relay-semanal-3-9-de-mayo-de-2022/15157",
                        "https://forum.makerdao.com/t/monthly-governance-review-april-2022/14986"
                    ],
                    "GPT-summary": "The post is a proposal to modify the budget for the Governance Communications Core Unit, extending funding through to the end of December 2022. The proposal includes a breakdown of the budget figures, implementation details, and a monthly budget statement. The post also mentions a contingency plan in case of emergency shutdown or protocol issues. The proposal is explained in detail by the author, and there is constructive criticism and questions from third parties.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.224658373754759
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#2",
                    "likes": "1",
                    "time": "24/03/2022-04:06:50",
                    "content": "Reminder that this proposal will enter its Frozen Period in one week, on March 31, 2022. Last day for modifications is March 30, 2022. Substantive modifications beyond that date will render the proposal ineligible for the upcoming Governance Cycle / reset its Frozen Period, as the case may be. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "1",
                    "time": "06/04/2022-14:54:10",
                    "content": "@MIP-Editors I am formally submitting this for April’s cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#4",
                    "likes": "1",
                    "time": "14/04/2022-02:49:16",
                    "content": "This proposal is currently being voted on. Its RP will run from 04/11 to 04/25. Please vote here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp63-modify-core-unit-budget-com-001/13654",
            "title": "MIP40c3-SP63: Modify Core Unit Budget, COM-001 ",
            "index": 13654,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "com-001",
                "core-unit-budget",
                "impact-:-high",
                "mip-rejected"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "2",
                    "time": "04/03/2022-19:59:32",
                    "content": "This version of our budget modification proposal includes the plan for a 4th full-time hire. It includes the other budget modifications we are asking for as well. Both proposals will run in parallel with SP63 being contingent on SP62. Assuming SP62 passes; If SP63 doesn’t pass then SP62 will be carried out. If SP63 passes, then SP63 instructions will be carried out.        MIP40c3-SP63: Modify Core Unit Budget, COM-001  Preamble MIP40c3-SP#: 63 Author(s): David Utrobin Contributors: Tags: core-unit, cu-com-001, budget, dai-budget Status: Rejected Date Applied: 2022-03-07 Date Ratified: Forum URL: https://forum.makerdao.com/t/mip40c3-sp63-modify-core-unit-budget-com-001/13654 Ratification Poll URL: https://vote.makerdao.com/polling/QmUntLXk   Sentence Summary MIP40c3-SP63 significantly modifies the existing budget for COM-001, adding a fourth FTE, and extends funding to the end of December 2022. The passing of this proposal is contingent on the passing of SP62, a parallel budget proposal.  Paragraph Summary This modification adjusts the team’s budget figures, extends our funding through to the end of 12/22, and updates the budget implementation. A vote to ratify this MIP means MKR holders agree to:  Fund us through to the end of Q4 2022. Approve the new budget figures below. Approve associated stream and one-time payment implementations. Top-up our team’s Continuous Operation multi-sig.   Specification  Motivation Updating the Governance Communications Core Unit budget and extending our funding for the next 6 months past our previous agreement that funds us through to the end of Q2 2022.  Core Unit Name Name: Governance Communications ID: COM-001  Budget Implementation  Smart Contract Implementation Actionable Changes Existing stream will be supplemented by a new stream; New stream will be created with a total of 50,765 DAI streamed to 0x1eE3ECa7aEF17D1e74eD7C447CcBA61aC76aDbA9 starting 2022-05-01 and ending 2022-06-31 New stream will be created with a total of 409,792 DAI streamed to 0x1eE3ECa7aEF17D1e74eD7C447CcBA61aC76aDbA9 starting 2022-07-01 and ending 2022-12-31 One-time payment83,396 to the Continuous Operation multisig 0x99E1696A680c0D9f426Be20400E468089E7FDB0f Information Governance Communications Operational multi-sig: 0x1eE3ECa7aEF17D1e74eD7C447CcBA61aC76aDbA9  Implementation: Distribution to the Core Unit multi-sig will be executed by a DssVest Dai stream. Ownership: This multi-sig is 1 of 1, with additional signers to be added as needed. Frequency: Protocol distributions to the multi-sig will occur continuously.  Governance Communications Continuous Operation multi-sig: 0x99E1696A680c0D9f426Be20400E468089E7FDB0f  Implementation: This multi-sig was already funded in full upon successful onboarding of the Governance Communications Core Unit. Access: In order for funds to be accessed from this multi-sig, the Maker protocol must be in a state where it is unable to pay team salaries due to protocol error, shutdown and/or under governance attack. Ownership: The Continuous Operation multi-sig will require 3-of-6 signatures from the following keyholders. This may be expanded to other critical Core Units as they are formed:  DavidUtro (COM-001): 0xE91f4F5834bB9312A45B2bd75804b32CC3DA8fd3 LongForWisdom (GOV-001) : 0x66f40F044E0e2F77bB746e3275E82e88dCBA2D69 Primoz (RISK-001): 0x5d67d5B1fC7EF4bfF31967bE2D2d7b9323c1521c Aes (SF-001): 0xe9daebb99B1D29E1AE32F44fdfccbc8Df0ef3Aa7 Brian McMichael (PE-001): 0xC0dE1AB51082442f821bA273273B4F7d32521D8b Nik Kunkel (ORA-001): 0xB4CFf22c0d5a015460Fd503a9328Bf00a24f686c  Continuous Operation To ensure three months of continuous operation in the event of Emergency Shutdown or protocol issues, we have been granted an upfront lump sum of three months of runway to sit in a protocol owned multi-sig. Calculation: Use initial annual budget figure(from SP8) divided by 4 to determine the 3-month runway sum: 121,500 DAI → SPXX based figure: 204,896 DAI – 83,396 difference Detail:  Change to 204,896 requested, see third actionable change above. The lump sum will be held outside of the surplus buffer in a protocol owned multi-sig. If normal protocol operation is not possible due to Emergency Shutdown or other protocol failure, these funds will be used to ensure continuous operation as the system gets back up and running. At the conclusion of the year, the lump sum will remain in the multi-sig for the following year and may be increased or decreased at that point in time due to changes in the projected budget.   Monthly Budget Statement Within the first 14 days of each month, COM-001 will submit an update to its public financial documentation:   Last Month Actuals, i.e. the actual expenses (DAI and MKR) of the month that just ended, this includes reporting any surplus or deficit.  The Budget Forecast, based on the latest available information, of the budget (in DAI) that is required to maintain a 3-month runway for the team.  The MKR Vesting Overview, this is a schedule that has the expected MKR vesting amounts for the current team configuration, grouped by the pay-out month.  Totals, Total received and spent to-date.  The Monthly Budget Statements are added to this git repository on Github. Our other public financial documentation includes this public budget overview.  Budget Breakdown     Descriptions (Updated Feb 2022) Annual (SP40) Annual (This SP) Change     Salaries (4 FTE) $ 285,000.00 $ 390,200.00 $ 105,200.00   Hourly Compensation (~1 FTE) $ 45,000.00 $ 80,000.00 $ 35,000.00   Healthcare $ 43,200.00 $ 57,600.00 $ 14,400.00   Employer Taxes $ - $ 46,824.00 $ 46,824.00   Sign-on Expenses $ 1,800.00 $ - $ (1,800.00)   Travel & Events $ 32,000.00 $ 45,000.00 $ 13,000.00   Operating Expenses $ 8,000.00 $ 89,960.00 $ 81,960.00   Legal Services $ 50,000.00 $ 30,000.00 $ (20,000.00)   Contingency Buffer $ 50,000.00 $ 80,000.00 $ 30,000.00   Total $ 515,000.00 $ 819,584.00 $ 304,584.00    Notes:  “Professional Services” category has been renamed to “Legal Services.” “Operating Expenses” now includes our accounting and admin costs, hence the large increase. This expense was formerly in the “Professional Services” category. This change more accurately reflects costs and categories for purposes of transparency. We previously budgeted 0 for legal services and have been using the contingency buffer to fund this expense. The 50,000 you see from the previous proposal was 100% for AccountAble and other professional service costs. We previously budgeted 0 for Employer Taxes and have been using the contingency buffer to fund this expense.  Changes:   Salaries: We plan to hire a fourth full time team member, a Public Relations Project manager, and have adjusted existing salaries for annual raises.  Hourly Compensation: We significantly increased our contributor budget since MKT-001 was offboarded causing our stakeholder content production team to be understaffed.  Healthcare: Healthcare benefits for full time employees that averages $1200 per month per person, we are budgeting for four people.  Employer Taxes: Employer tax contributions are 12% of salary for US based employees. We did not account for this expense in prior budget proposals. The contingency buffer provided coverage for this up until now.  Sign-on Expenses: We are no longer doing sign on bonuses. The initial bonuses were to compensate the initial team members for the inconvenience of not getting paid for two months until our payroll setup was completed.  Travel & Events: We request a 15,000 events budget, formerly 5,000, to allow our team to more comfortably contribute to Makerdao CU event expenses (dinners, offsites, coworking spaces, etc). The other 30,000 is for travel and team expenses. This assumes 2x team-wide offsites (four persons) & 3x one-off events for one person per year.  Operating Expenses: Includes accounting & admin costs, software subscriptions, hardware & physical materials, and transaction gas fees.  Legal Services: Funds our work with TechGDPR legal firm.  Contingency Buffer: Increase associated with total increased budget size. We aim for ~10% contingency buffer.  Continuous Operation multi-sig: Adjustment to reflect three months of operating expenses.   MKR Vesting The Governance Communications Team will add some version of MKR vesting for its team members, retroactively dated to the first day of their employment. Instead of offering our own unique proposal now, we will wait for the community to come to consensus around how Core Units should set this up. We support the formation of an overarching MKR Vesting framework that all Core Units can follow.  @MIP-Editors, needs an SP # assigned. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP40c3SP40",
                        "https://github.com/MakerDAO-Governance-Communications-CU/transparency-reporting",
                        "https://docs.google.com/spreadsheets/d/1H41VHDwZDlF9CSAlbR-u5NBUhp1qwTcaSGNkYB5C5bI/edit?usp=sharing",
                        "https://forum.makerdao.com/t/weekly-mips-update-81/14443",
                        "https://forum.makerdao.com/t/weekly-mips-update-80/14274",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-mar-14-mar-25/14263",
                        "https://forum.makerdao.com/t/weekly-mips-update-79-pinata/14106",
                        "https://forum.makerdao.com/t/governance-and-risk-187-thursday-april-21-17-00-utc/14708/2",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-feb-28-mar-11/13887",
                        "https://forum.makerdao.com/t/call-for-responsible-budget-and-process/13816/5",
                        "https://forum.makerdao.com/t/weekly-mips-update-78/13903",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/57",
                        "https://forum.makerdao.com/t/relay-semanal-12-18-de-abril-de-2022/14724",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-18-de-abril-de-2022/14700",
                        "https://forum.makerdao.com/t/weekly-relay-april-12-18-2022/14691",
                        "https://forum.makerdao.com/t/weekly-mips-update-83/14673",
                        "https://forum.makerdao.com/t/relay-semanal-5-11-de-abril-de-2022/14616",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-11-de-abril-de-2022/14594",
                        "https://forum.makerdao.com/t/weekly-relay-april-5-11-2022/14590",
                        "https://forum.makerdao.com/t/governance-and-risk-185-thursday-april-07-17-00-utc/14464/2",
                        "https://forum.makerdao.com/t/governance-and-risk-184-thursday-march-31-17-00-utc/14314/2"
                    ],
                    "GPT-summary": "The post is a proposal to modify the budget for the Governance Communications Core Unit, extending funding through to the end of December 2022 and adding a fourth full-time hire. The proposal includes details on the budget implementation, monthly budget statements, and MKR vesting. The post explains the motivation behind the proposal and the changes made to the budget breakdown. The post also includes information on the Continuous Operation multi-sig and the team's contingency buffer. The post may be of interest to those interested in the MakerDAO protocol and its governance.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.297229923634418
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "2",
                    "time": "05/03/2022-05:16:22",
                    "content": "@Davidutro Thank you for the proposal. I have two questions:  What would be the role of Public Relations Project manager? What would be the focus?      Davidutro:  Salaries: We plan to hire a fourth full time team member, a Public Relations Project manager, and have adjusted existing salaries for annual raises.    Is it possible to see how the amount of work has almost doubled in details? For example, overview of hours spent breakdown before and after would be helpful for the community.      Davidutro:  Hourly Compensation: We significantly increased our contributor budget since MKT-001 was offboarded causing our stakeholder content production team to be understaffed.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.446428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#3",
                    "likes": "1",
                    "time": "05/03/2022-11:25:41",
                    "content": "can u pls make the healthcare part of compensation it reads dishonest to separate costs no other core unit separate same with exmployer taxes the dao must not care the setup of core unit why contingey buffer go up u should be gettng better and need less buffer ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.095833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#4",
                    "likes": "3",
                    "time": "05/03/2022-17:34:07",
                    "content": "    Descriptions (Updated Feb 2022) Annual (SP40) Annual (This SP) Change     Salaries (4 FTE) $ 285,000.00 $ 390,200.00 $ +105,200.00    Hourly Compensation (~1 FTE) $ 45,000.00 $ 80,000.00 $ +35,000.00    Healthcare $ 43,200.00 $ 57,600.00 $ +14,400.00    Employer Taxes $ - $ 46,824.00 $ +46,824.00   Sign-on Expenses $ 1,800.00 $ - $ (1,800.00)   Travel & Events $ 32,000.00 $ 45,000.00 $ +13,000.00    Operating Expenses $ 8,000.00 $ 89,960.00 $ +81,960.00    Legal Services $ 50,000.00 $ 30,000.00 $ (20,000.00)   Contingency Buffer $ 50,000.00 $ 80,000.00 $ +30,000.00    Total $ 515,000.00 $ 819,584.00  $ +304,584.00     Budget Increase Review This is a really significant increase (+59%) and it is unclear what the DAO pragmatically gains from it. What are “employer taxes”? Why were “employer taxes” not included in the previous budgets? What is your per headcount comp including all of the benefits, taxes, accountable, etc? Generally teams use 15% for benefits in Maker, here if you include healthcare and “taxes” it is closer to 25%. This means your headcount cost line item is significantly under reporting the actual cost.  Budgeting failures in and of themselves are not a rationale to further grow budgets. To the point above, can we get a breakdown of why all your costs are increasing significantly? Why are your operating expenses 81,000 dollars more? What does this cover? Accountable? Accountable is not actually needed for non-EU based core units and the DAO should be moving away from something so wasteful. What are the hourly comp roles you are going to be taking on and how will you demonstrate that spend? The cost of your previous budgeting errors were covered by the past contingency buffer. Now you have included all those costs at a significant budget increase. Yet, you then also increase the contingency buffer. It is unclear why this is necessary. What are possible contingencies you are planning for that require $80,000? Are there any budgeting issues you see now we should just address, instead of masking them with a contingency buffer? Public Relations and Governance Communications Prior feedback to govcomms was to trim their budget and focus their mandate in order to make it a low flying and over-delivering core unit. Instead, the new direction splits govcomms in two directions-- managing governance meetings and a calendar/ forum posts, and now, moving into PR and corporate comms. This is managing a calendar and calls, with an unclear “PR” project for $819,000.00 of spend. I am concerned regarding the public relations direction. As far as I gather, nobody on your team has any PR or commercial communications experience. If they did, you would not need to hire new headcount. That suggests you will be relying entirely on one person, a new hire, to manage and deliver on initiatives for the DAO. This also means their manager will have neither the expertise nor experience to manage and evaluate their performance appropriately. This mismatch sets both the hire and the core unit up for failure. It would be wise for govcomms to trim their budget instead of go in the other direction. Do one thing well. If you want to go in the PR direction, the proposal requires more substance to explain what that is and how it is going to work. It would be better to focus on your core duties and if you want to do PR, define a project scope and ask for specific budget after you have gathered vendor quotes and done the planning and due diligence. It is probably better to just have an independent PR CU rather than start loading random roles into existing CU. This could be as simple as some sort of vendor through SES… 300k goes a long way hiring a PR firm. Just because the community expresses it wants PR, that doesn’t mean throwing a PR hire under govcomms is the right way forward or makes any sense. I would suggest you remove all PR complications, focus on your core mandate, and trim the budget to something more palatable, simply continuing what you have been doing. It would also be nice to make the budget more transparent by including all appropriate costs in the correct budget category (benefits, compensations taxes, all under compensation). If you did the above, it would be much easier for MKR holders to be confident in the budget and vote it in without issue. Less is more… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.589410974827641
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#6",
                    "likes": "0",
                    "time": "06/03/2022-15:43:36",
                    "content": "Are all contributors to the core unit employees or will there also be contractors? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#7",
                    "likes": "2",
                    "time": "07/03/2022-14:31:06",
                    "content": "I think that is irrelevant for the DAO. It should be up to each Core Unit how to structure their relationship with their contributors. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#8",
                    "likes": "2",
                    "time": "07/03/2022-14:48:52",
                    "content": "    Doo_StableLab:  Is it possible to see how the amount of work has almost doubled in details? For example, overview of hours spent breakdown before and after would be helpful for the community.   Hey, @Doo_StableLab! I can help answer this:  We have our consistent ~5 contributors that work 2-3 hours each week in rotation to prepare, transcribe, and QA the G&R, MYD, IDC, SS, and other calls for transcriptions.  Now we have included two more contributors for the stakeholder program publications (Weekly Relay, Forum at a Glance, MGR, CU Updates, State of Dai, etc.). MKT-001 used to aid in these publications, but now we have a professional writer and editor to help with these projects. We also have an Excel specialist to help us with online information management, accessibility, and utilization. In addition, if willing, some of these contributors aid me in simple and recurring tasks that are part of either a data collection or publication preparation process.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.53125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#9",
                    "likes": "0",
                    "time": "07/03/2022-15:51:14",
                    "content": "Thank you for the detailed response. That makes sense ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#10",
                    "likes": "1",
                    "time": "07/03/2022-18:48:54",
                    "content": "Hi, thanks for your questions.     Doo_StableLab:  What would be the role of Public Relations Project manager? What would be the focus?   The vision is to grow this person into a Public Relations Lead that will eventually work with a dedicated Marketing CU. At the inception of this role the responsibilities will include;  Point Person for Media Manages [email protected] email Handles membership requests to Media forum group  Press Releases Pilots a press-release program for MakerDAO.  Stakeholder Content Support Supports writing and quality assurance needs for stakeholder publications.  Emergency Comms Support Role Acts as the communications manager within Maker’s Incident Response framework.       Doo_StableLab:  Is it possible to see how the amount of work has almost doubled in details? For example, overview of hours spent breakdown before and after would be helpful for the community.   When MKT-001 was offboarded, contributor needs went up by around 50%. We are asking for a doubling of this budget(+100%) so we have some room to work with as we grow and improve. Keep in mind we agree to return any surplus to the protocol. Content Loss: 2 MKT-001 team members working ~4hrs per week each Replacement: 1 primary contributor (Larry), working ~8hrs per week (~$1000 per month) Status: Onboarding other newer contributors. Design Loss: 1 MKT-001 designer working to create all the needed banners and images. Replacement: Hiring the same contributor to produce banners on our own budget (~$1000 per quarter) Status: Facilitator of COM-001 temporarily creating all the needed images, while slowly coming to an agreement to hire @kat for needed batches of images. Other Loss: 1 MKT-001 team member who uploads calls to youtube. Replacement: COM-001 facilitator temporarily handles this extra work (~1hr per week). The main projects that were affected are Maker Relay, the Monthly Governance Review, and all the banners. Though due to the expansion of our stakeholder publications in general(larger Forum at a Glance, Monthly CU Updates, etc) we need to expand our writing team since Artem is getting quite overloaded.      Deimos:  can u pls make the healthcare part of compensation it reads dishonest to separate costs no other core unit separate same with exmployer taxes the dao must not care the setup of core unit why contingey buffer go up u should be gettng better and need less buffer   I don’t understand what you’re asking for. You’re upset we separate our line items this granularly? How can being more transparent be dishonest? Healthcare costs vary per state, I budget for an average. Employer Taxes must be paid as well, up to 12% in some cases for US employees. Employer and employee split the cost of several things in the US (this additional 12% Is the employer side of these taxes)  Social Security Medicare Federal Unemployment (FUTA) State Unemployment (SUTA) Workers Comp Insurance General & Personal Liability Insurance Taxes associated with the employer medical plan.  The contingency buffer goes up or down according to the team’s resource needs. Being better means offering a higher quality level of professional service across all our communication programs, it doesn’t necessarily mean spending less. We recognize it’s important to carefully control our spend. Our goal is not to spend more, but rather to develop the team into a more effective service provider. Sometimes that requires an expansion of resources.      MadShills:  it is unclear what the DAO pragmatically gains from it.   I think it’s pretty clear. This budget adjustment  Provides more help to our stakeholder content projects. Enables the DAO to hire a Public Relations specialist. Positions MakerDAO properly in preparation for a Marketing CU.      MadShills:  What are “employer taxes”? Why were “employer taxes” not included in the previous budgets?   Mentioned above what they are. I did not include them because I did not realize they are an expense on top of the salaries. I thought salaries covered this, but in US actually employer is responsible for a portion of the employee taxes. In short, it was an oversight that they were not included.     MadShills:  What is your per headcount comp including all of the benefits, taxes, accountable, etc? Generally teams use 15% for benefits in Maker, here if you include healthcare and “taxes” it is closer to 25%. This means your headcount cost line item is significantly under reporting the actual cost.   Here is a breakdown of facilitator compensation from December 21’     Salary Recurring monthly Payroll Fee Healthcare Employer Taxes Onboard Offboard     10000 200 722.04 1200 200 350    We run ~21% according to this. It was my fault for not including things properly in the previous budget (missing the Taxes item). I report everything in the team’s actuals every month, with notes. So I have been reporting this spend.     MadShills:  To the point above, can we get a breakdown of why all your costs are increasing significantly? Why are your operating expenses 81,000 dollars more? What does this cover? Accountable? Accountable is not actually needed for non-EU based core units and the DAO should be moving away from something so wasteful.   The increases associated with this proposal are mainly related to onboarding a new full time hire. Our Accounting and payroll costs are fixed and known. Also important to note, as I did in the proposal itself, our categories changed slightly. We moved the AccountAble & Payroll costs into the Operating Expenses line instead of the Legal Services line (formerly Professional Services). This makes it look like our operating costs went up, when it reality they are the same, adjusted for one extra team member. Breakdown of Accountable & Papaya Payroll AccountAble 3500 per month 3500 x12 = $42,000 Papaya Payroll 770 per month per employee 770x12 = 9240 x 4 = 36960 Perhaps we should move away from AccountAble eventually, but they offer us a very convenient set of services that we would end up paying a very similar amount for anyway. Not to mention the huge headache of finding another provider or solution and switching. Additionally, our team would like to keep the door open for EU hires.     MadShills:  What are the hourly comp roles you are going to be taking on and how will you demonstrate that spend?    1x Designer for batches of images - hourly rate REDACTED 3-5x Content writers - 30-40 Dai per hour.  We demonstrate it by producing work and keeping track of it via our contributor invoice spend. Our other contributors include  1x Excel specialist to help us improve internal docs. ~4x Call Transcribers & QA folks - 30 - 40 Dai per hour.      MadShills:  The cost of your previous budgeting errors were covered by the past contingency buffer. Now you have included all those costs at a significant budget increase. Yet, you then also increase the contingency buffer. It is unclear why this is necessary. What are possible contingencies you are planning for that require $80,000? Are there any budgeting issues you see now we should just address, instead of masking them with a contingency buffer?   Every time I put one of these together I do so with the utmost care. I hope I have not missed any major expense or made any errors. The 10% contingency buffer is there as security. There is a small chance our legal spend is under-budgeted for. Besides that I don’t see any anticipated use for the contingency buffer. Having it there is very helpful.     MadShills:  Prior feedback to govcomms was to trim their budget and focus their mandate in order to make it a low flying and over-delivering core unit. Instead, the new direction splits govcomms in two directions-- managing governance meetings and a calendar/ forum posts, and now, moving into PR and corporate comms.   This is somewhat of a mischaracterization. Our direction from the beginning has been to positively affect stakeholder communications, PR support was always a part of that. Our PR support(formerly “Media Relations Support”) has been strategically set up to leave room for a dedicated Marketing/PR Core Unit by being reactive and covering the bare minimum of service needs. Hiring a PR professional will give MakerDAO the dedicated support it needs, and it will also free me up to do more focused work as the facilitator of the team. Proposed mandate under MIP39c2-SP30  Stakeholder News & Reports Public-Call Summaries Public Calendars Stakeholder Database & Mapping Stakeholder Alignment & Initiatives Tracking Framework Core Unit Communications Audit Issue Discussion Public Call Series Governance and Risk Call Support Emergency Communications Support Public Relations Support Communication Platform Stewardship      MadShills:  I am concerned regarding the public relations direction. As far as I gather, nobody on your team has any PR or commercial communications experience. If they did, you would not need to hire new headcount. That suggests you will be relying entirely on one person, a new hire, to manage and deliver on initiatives for the DAO. This also means their manager will have neither the expertise nor experience to manage and evaluate their performance appropriately.   Yes, actually that is why we need to hire a PR person. So far I have been the public relations lead for the team & DAO. Given that I have limited experience, it’s been my strategic inclination to hire a more seasoned specialist to lead the effort. I am fairly confident in my ability to facilitate this role under govcomms. Though I am not a long time PR professional, I will be able to evaluate a new hire’s professional competence. Will I be able to speak to their strategic recommendations? Sure. I am a seasoned communications professional after all, and I have experienced various PR and communications challenges throughout my career and my time here at Maker.     MadShills:  Do one thing well. If you want to go in the PR direction, the proposal requires more substance to explain what that is and how it is going to work. It would be better to focus on your core duties and if you want to do PR, define a project scope and ask for specific budget after you have gathered vendor quotes and done the planning and due diligence. It is probably better to just have an independent PR CU rather than start loading random roles into existing CU. This could be as simple as some sort of vendor through SES… 300k goes a long way hiring a PR firm.   Our “one thing” that we do well is stakeholder communications. Public Relations Support has always been a part of that, which is why it’s been in our mandate from the start. As for more substance around the direction; it’s fairly simple, we want to provide the bare minimum for Public Relations support at MakerDAO;  Provide a point person for our public. Respond to direct media inquiries. Manage Media Inquiries Section on the Maker Forum Manage Media group on the Maker Forum Create Press Releases on behalf of MakerDAO Support other PR messaging needs.  Between the points above and supporting Artem in his stakeholder publications, I see room for a full-time hire that can develop into a more experienced asset for the DAO. MakerDAO needs continuous and dedicated service, hiring a firm might work if done right. ~100k for a hire in this area is a worthy pursuit in my view.     MadShills:  Just because the community expresses it wants PR, that doesn’t mean throwing a PR hire under govcomms is the right way forward or makes any sense. I would suggest you remove all PR complications, focus on your core mandate, and trim the budget to something more palatable, simply continuing what you have been doing.   Feedback noted. I think we are addressing MakerDAO’s PR needs in a very complimentary way with this proposal. We did a lot of outreach and feedback gathering before putting forward this team expansion and have received nothing but support. I am in favor of a Marketing/PR CU, however I recognize that they are quite far away from existing. Additionally, if one were to come into existence, our PR support would not conflict with their work. In fact, it would be complementary since our team member is handling incoming requests and general press releases(more details TBD around those). And it would give their team someone with experience and resources to call upon. And if it were desired, I don’t think I’d be against formally handing off PR support completely, including a transition of my would-be team member to a new Core Unit. However, the need for Public Relations support is here now and that is why we are proposing this team expansion. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP39c2SP8",
                        "https://forum.makerdao.com/t/mip39c2-sp30-governance-communications-core-unit-com-001-mandate-refresh/13197"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.578446889274915
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#11",
                    "likes": "4",
                    "time": "07/03/2022-19:11:49",
                    "content": "    Davidutro:  However, the need for Public Relations support is here now and that is why we are proposing this team expansion.   If the DAO rejects the expansion, what does that mean for your budget? The problem with the way this is proposed, there is no opportunity to reject the expanded PR budget without defunding your CU, all-or nothing, if I understand correctly. From a game theoretic perspective this is coercion.  In general, a CU mandate refresh and budget expansions should probably be presented independent of a budget supporting ongoing operations. Note, this is not a criticism of COM, but more broadly of budget increase requests. This approach affords two valuable pieces of information:   An approval/rejection of the budget to provide continued services.   A separate signal approving or rejecting the proposed expansion.   Hence, why it was suggested you compile your budget in two components. First and foremost, propose a budget for continuing operations consistent with your new categorizations and transparency above. Separate from this, in the next cycle. present and additional budget that breaks out the PR role and the additional costs for the expansion. This way the DAO can clearly give you a signal, yes or no on the new costs, without threatening your ongoing operation. This would be of benefit for both you and the DAO. First, it does not put at risk your core unit, while providing you the opportunity to expand if appropriate. Second, it allows the DAO the ability to determine whether the expansion is appropriate, without feeling coerced into an all or nothing vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5681818181818175
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#12",
                    "likes": "1",
                    "time": "07/03/2022-19:12:47",
                    "content": "Thanks for the detailed response  As it’s very late here, I will review it tomorrow but thank you for the transparency ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3500000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#13",
                    "likes": "2",
                    "time": "07/03/2022-19:27:29",
                    "content": "    MadShills:  If the DAO rejects the expansion, what does that mean for your budget? The problem with the way this is proposed, there is no opportunity to reject the expanded PR budget without defunding your CU, all-or nothing, if I understand correctly.   Yes, this is something that was on my mind when putting this together. This is why we proposed this a month early. In the event of significant pushback during RFC, It gives us a chance to put up a normal, non-expanded budget continuation proposal in April to be passed before end of June.     MadShills:  In general, a CU mandate refresh and budget expansions should probably be presented independently of a budget supporting ongoing operations.   This is a good point, I think moving forward I will try to use this model.  Propose MIP40SPx - continue budget as-is Propose MIP40SPx2 - expands budget and asks for delta in payout.  @MIP-Editors any opinions on this? IS there any reason this isn’t a good idea? I am curious how doing the streams will work. Budget continuation just creates a new stream with the original numbers. then the budget expansion sets up a second stream? or can I set it up as a one-time payment of that delta? I really don’t want to deal with multiple streams to claim my budget. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.874621212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#14",
                    "likes": "2",
                    "time": "07/03/2022-19:41:25",
                    "content": "    Davidutro:  This is a good point, I think moving forward I will try to use this model.  Propose MIP40SPx - continue budget as-is Propose MIP40SPx2 - expands budget and asks for delta in payout.  @MIP-Editors any opinions on this? IS there any reason this isn’t a good idea?   Not a MIP editor but the immediate thing that springs to mind is what happens if the vote for option 2 passes and the vote for option 1 doesn’t? Obviously, this scenario would seem unlikely but there is a non-zero chance that this could happen and it would need to be planned for. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#15",
                    "likes": "0",
                    "time": "07/03/2022-20:23:17",
                    "content": "btw @MadShills here is the difference between this proposal and a downgraded one without the team expansion. I am working to convert this proposal to the base one and will be adding the second as contingent on the base proposal, separating out the team expansion item.  image997×813 87.6 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 2.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#16",
                    "likes": "0",
                    "time": "08/03/2022-00:05:49",
                    "content": "    Davidutro:  AccountAble 3500 per month 3500 x12 = $42,000 Papaya Payroll 770 per month per employee 770x12 = 9240 x 4 = 36960   One last thing, can you describe the services these both providing? It may help the DAO better understand what is expected. I have heard of papaya but not totally familiar. This is approximately 20% overhead on the base salary, with the benefits and taxes that is quite a bit. Maybe some other core units could chime in on their relative spend here and offer you some recommendations if they have better options. It just seems a lot, though I know ADP is quite expensive too but gusto more reasonable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.828125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#17",
                    "likes": "2",
                    "time": "08/03/2022-16:59:27",
                    "content": "AccountAble provides a number of services to us for a fixed rate Cost: $3500 per month.  Payroll Service (They set up and handle the relationship with Papaya, fees paid by us) Contractor Payments Bank account & Corporate card Send us monthly P&L report Send us monthly ledger cards Send us a monthly balance sheet  Papaya is a PEO(Professional Employer Organization) that has a contract with AccountAble. Costs: recurring 200 per month per employee (3x) one-time 770 per employee onboarded 350 per employee offboarded (if >12 months)  Employer of record services US & Global Payroll Benefits Services Employment Agreements   Always open to hearing alternatives that could save us some money and provide us the same or better level of service. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#18",
                    "likes": "0",
                    "time": "08/03/2022-20:48:48",
                    "content": "    Davidutro:  How can being more transparent be dishonest?   i will asume good faith @LongForWisdom suggests contributor 1: 100 salary contributor 2: 40 salary 40 tax 30 accountable 20 papaya 10 car 10 office 25 for food 30 for house 15 for flights you get the point     juan:  I think that is irrelevant for the DAO. It should be up to each Core Unit how to structure their relationship with their contributors.   as @juan says it is irrelevant it is dishonest maybe inintentional to hide costs from what is contributor real cost ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.857142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#19",
                    "likes": "3",
                    "time": "08/03/2022-21:57:59",
                    "content": "So it’s $4,100 per month for AccountAble and Papaya? Maybe you mentioned this above, but what exactly is the value add provided for these services? Seems exorbitant for payroll services when you can use ADP for $50/month and Quickbooks for even less. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.138888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#20",
                    "likes": "3",
                    "time": "08/03/2022-22:28:40",
                    "content": "    Davidutro:  Always open to hearing alternatives that could save us some money and provide us the same or better level of service   David checkout Fondo — hearing a lot of startups are super happy with their services: https://www.tryfondo.com/ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.633333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#21",
                    "likes": "0",
                    "time": "09/03/2022-00:16:19",
                    "content": "Can’t set those up without a bank account or entity. We basically use AccountAble as our entity. I am considering our options for incorporating and setting up banking. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#22",
                    "likes": "0",
                    "time": "09/03/2022-00:18:51",
                    "content": "we should keep conversation on topic and no on recommendation for @Davidutro it is nice but not part of the topic some more questions for this new budget: a- can u provide ur view generally on your hires to the moment @Artem_Gordon and @thomas.flitter and evaluate competence? b- u have consider outsourcing to improve on cost and speed and accuracy of all publications or looking for professional service or writer? c- why did you start doing the things that from offboard core unit?     Davidutro:  Though I am not a long time PR professional   d- r u a short time pr professional? how?     Davidutro:  I will be able to evaluate a new hire’s professional competence.   e- how ?     Davidutro:  So far I have been the public relations lead for the team & DAO   f- pls show press release     Davidutro:  I am a seasoned communications professional   g- i though maker was your first real job? how fast the season is accumulating?     Davidutro:  Our “one thing” that we do well is stakeholder communication   h- this goes beyond forum + discord ? how much maker needs this? can stakeholder communicate without you? thanks ! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.928030303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#23",
                    "likes": "3",
                    "time": "09/03/2022-01:15:50",
                    "content": "All of this seems on topic, happy to answer questions about any costs and to hear recommendations for how we can change or who we can use for service providers. a - not sure how this relates to the new budget…but sure Pretext; we do 6-month evaluations where we set personal objectives and one-on-ones as needed to track progress or lack thereof. Artem was hired into a junior role and has developed significantly. His time management and responsiveness are excellent. His contributor team management skills are good. His writing has improved in the last 6 months, it’s been a focus for improvement. Overall he is very competent, easy to work with, but mainly lacks years of experience leading professional-grade publications hence the junior role. Thomas was also hired into a junior role and has many years of experience doing various stakeholder engagement roles for a large US energy company. Onboarding a non-crypto native professional proved to have its fairly steep learning curve, but from the start Thomas has made significant progress both on the programs he owns and on the demonstration of his growing Maker knowledge. Both have their identified weaknesses that they are improving upon, same for me. b - Outsourcing stakeholder publications is not a good idea for one main reason–it won’t improve costs or speed. Also it’s in Maker’s interest to keep this stuff in-house for the sake of efficiency and control over the messaging. c - We haven’t taken on any of former MKT-001’s projects. They used to colaborate with us on several stakeholder publications which we have had to fully produce ourselves since their offboarding. d - I’ve studied Public Relations in my college years and have consistently focused on it throughout my intellectual life and professional career in various ways. I do not have the experience of a proper PR professional who might have created press releases, pitch decks, conducted market-driven research projects, led social media marketing strategies, and all the other experiences that would help me evaluate such a professional. e - I will measure them by how well they can execute on the job description and according to all the general professional competencies that carry across roles. Not to mention a regular cadence of goal-setting and oversight. f - We haven’t published any. I’ve been a PR lead in the sense that I have been fielding incomng inquiries from the media and managing the small duties associated with the support role outlined in our mandate. g - Maybe I overstated, but it is how I see myself. In the 6 years since graduating with a BA in corporate communications, I’ve held three different roles since becoming facilitator. One was an administrator for a new Masters program that involved relationship management, corporate communications, and even to a small extent PR (I wrote copy to promote the program). Shortly after I worked for two years as an Operations Manager for a small private e-commerce company where my communications skills were not at the forefront of my work but still contributed to how I helped the business develop. Then I worked for two years as a Community Development Lead at the Maker Foundation where I took part in many communication-related projects. And finally, now, I am here leading an organizational communications team at Maker. I am not a communications professional with a dozen years of experience, no, but I am getting to be decently seasoned. h - Maker needs it badly. The amount of opportunity cost due to poor information accessibility and stakeholder coordination is large. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.60537707906129
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#24",
                    "likes": "2",
                    "time": "09/03/2022-01:49:03",
                    "content": "I would recommend creating an entity, it’s quite cheap and setting up a bank account for it is free. It will pay for itself within a week relative to your current costs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#25",
                    "likes": "3",
                    "time": "09/03/2022-02:23:58",
                    "content": "Several things will fall onto my plate that I need to have a plan for:  Accounting for the entity (i’m not an accountant) Conversion of Dai into USD or EUROs (need to set up exchange account) Disbursement of funds to contributors. Disbursement of MKR bonus comp, and associated tax withholding Managing the ADP/Gusto/Fondo relationship & associated duties.  Other tradeoffs  No longer open to non-US hires.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#26",
                    "likes": "2",
                    "time": "09/03/2022-03:52:27",
                    "content": "Hey, @Deimos. If you’re curious about a detailed update on the stakeholder program and publication side of things, I will be posting a complete Q1 2022 review and forward outlook by ~March 31st. It will include many value-based revisions, objective changes, improvements, updated roadmap, and more. Please be patient and keep an eye out for it! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.270833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#27",
                    "likes": "3",
                    "time": "10/03/2022-22:40:58",
                    "content": "@MadShills @Doo_StableLab @Deimos @Recognized-Delegates Hope this adds some needed context to our proposal.      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#28",
                    "likes": "5",
                    "time": "11/03/2022-07:40:51",
                    "content": "Thank you for another detailed response. I fully understand the need for an increase in Hourly Compensation part. But in terms of hiring a Public Relations PM, I still have my reservations. And I feel like some of these are difficult to resolve as I don’t think there’s wrong or right answer. It’s just different perspective. 1. Question of effectiveness of PR team in the current proposal Within the crypto space, the Maker protocol is covered quite often. For example, for past 1 year, even without a dedicated PR team, MakerDAO has been mentioned in 74 different articles on Coindesk and 82 on Cointelegraph. Now some of them are likely to be noises so if we reduce to 1/3 then it’s 24 and 28 which still roughly comes out to be 2 organic news articles per month on crypto news sites. So it’s more of mainstream news that the community desires such as this The Wall Street Journal article. But with the current resource that the team is thinking, I am not sure whether it would be sufficient to regularly allow the Maker protocol to be shared to such mainstream news (Forbes doesn’t count in my opinion). Therefore, even if it’s waiting for few months or even a year, I am inclined to believe that this is something that should fall to dedicated Marketing Core Unit or use a third party PR service that can distribute such. 2. Whether this new role is critical to COM CU The downside mentioned from “What happens if we don’t hire this person?” that posted on Youtube actually doesn’t seem too detrimental. So far the COM operation has been doing well and another 6 months of status quo shouldn’t make a big difference. Also, I think it’s fine if the team scales down the PR-side of the mandate. If it really causes a problem, the community will take a notice and can revisit the issue again.  Overall, want to thank for the detailed response and the budget breakdown again. And whether it’s passed or not, excited to see the team’s initiative. ",
                    "links": [
                        "https://forum.makerdao.com/t/doo-delegate-platform/13246/31"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.047691779546618
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#29",
                    "likes": "2",
                    "time": "11/03/2022-14:31:32",
                    "content": "Thank you, David. I agree that a PR resource needs to be internal and full-time living and breathing inside the community in order to do the job well and cost-effectively. In addition, the person MUST be crypto native IMO and be extremely literate in the Web3 DAO space generally, and the DeFi landscape in particular. This person would also need a background in traditional finance communications in order to translate well and contextualize what we are doing to the wider TradFi universe. I’d like to see more discussion or proposal around what this resource will accomplish in terms of the overall business objectives and goals of MakerDAO. The focus here seems more day-to-day operational rather than aligned with a specific business strategy or outcome. How does public relations support revenue growth, for example? How does the role help the bottom line and longer-term objectives? Public Relations needs to operate in lock step with Executive vision and sales in a traditional business. Given the diversity of views and challenges we currently have with prioritization, how does a Public Relations resource that represents the DAO as a whole decide which voices to elevate and which audiences to target with messaging? When the DAO in general has conflicting views and priorities among stakeholders (as is the nature of DAOs), how can a PR resource have a clear mandate in terms of pro-active work? Do you envision submitting signal requests and Polling the community on the content of PR messaging? Happy to have your general thoughts on these points, not necessarily point-by-point answers. Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.572916666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#30",
                    "likes": "2",
                    "time": "11/03/2022-15:59:06",
                    "content": "Thank you both for the fantastic feedback. Doo, I agree it wouldn’t be very detrimental, though hiring such a role would give us a headstart on developing answers to some of the questions Kianga mentions above in addition to provided some much-needed labor on the day-to-day tasks at Govcomms. Though, perhaps a part-time contributor might be able to do enough and in a more cost-effective way.  Kianga, although the focus is definitely helping on the day-to-day, the PR resource I propose would aide in a number of business objectives–I don’t think the two are in conflict;  Improving MakerDAO’s communications to our public by organizing and coordinating around a DAO-wide press-release program. The outcome is a stronger image of MakerDAO as a top-tier well-run organization. Also through the Press Release program-- we become more effective at communicating messages to our customers (for product offboardings, disruptions, additions, etc) The outcome would be better customer service and also may help grow the userbase of our products. Ultimately it falls under the primary motivation of our team–provide information to our stakeholders more effectively.  Of course, this is off the top of my head. I expect a PR specialist would be able to articulate and design more comprehensive objectives and results that align with Maker’s overall business strategy. My vision for this role is highly collaborative. They work with Growth, GovAlpha, Strategic Finance, and other teams to determine criteria for press releases. We would create documentation outlining what qualifies for press releases, perhaps rolling them out for the minimum needs and then expanding coverage as we develop that appropriate criteria. I think there are obvious things to cover, and less obvious things to cover which we will have to reason about in the future. I don’t know if Signal Requests are the right way to go. They might be. Informal Polls might be the better way to go since the topic wouldn’t be linked to any on-chain governance action. I think opening up feedback channels to Recognised Delegates and Core Units is key. I am open-minded, and am willing to change my view. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.227886002886002
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#32",
                    "likes": "1",
                    "time": "11/03/2022-17:13:45",
                    "content": "    MadShills:  I am worried GovComms is going to fail on its new mandate by going in too many directions.   Our directions are all quite complimentary, though I understand your worry.     MadShills:  As a result of the CP offboarding, govcomms spent the last quarter focusing on refreshing your mandate. In the midst of this, you hired a new green headcount whose onboarding was resource intensive. As you know, hiring takes a lot of time and energy.   Not accurate. We did a mandate refresh as a best practice independent of the CP offboarding. Also, Thomas was hired back in October, so way before the CP offboarding (I assume you mean Thomas, our Engagement Lead hire.) Yes hiring does take time and energy–it’s a key decision that can have positive results or major setbacks if hiring the wrong person.     MadShills:  New responsibilities with performance yet to be delivered. You now have a mandate managing internal communications, which the team did not do before, on top of the regular duties and ones adopted from content production. We have not yet spent three months operating under the new mandate, we do not know how you will perform. We are in uncharted territory—caution and prudence are advised.   Fair point. Scaling the internal coordination program is an ongoing project of mine. So far the teams we have been involved with are satisfied with how it’s going. We hope to continue progressing at a healthy pace with objectives here to (1) get fuller initiative coverage, (2) train more people to lead the stakeholder coordination process, and (3) to develop a better method of reporting on initiative status.     MadShills:  Now you want to add a new headcount underneath you. You acknowledge no commercial communications experience and want to hire a new “seasoned professional” to work underneath you and report to you. Unfortunately, this is not what seasoned professionals do, someone with that skillset is not available at the comp you offer and will not take a role reporting to someone with 0 PR experience---- it would be career suicide. Ultimately, what you will be left with is someone who is low quality who just wants the paycheck. This is not what we need. PR should fall somewhere where they are reporting to a facilitator who has managed PR professionals before, as a contractor, or in an independent, decentralized core unit.   This is a very interesting point to me, I would love to hear if others(@Recognized-Delegates) agree. From my perspective, this person would be given a very strong career opportunity by leading the PR program. Yes they report to me, but ultimately they are meant to lead the charge here, hence why we want someone with several years of experience. I operate with a principle of giving specialists autonomy over their domains, reducing micromanagement. My intention with this hire would be to start them off at a fair market rate and to bump them up once they prove their competency. If they cannot fulfill and excel at their role we would let them go and find a replacement. Maybe we should be hiring in the 100-130k range and looking for someone with 4-7 years of experience?      MadShills:  Focus—underpromise and over deliver   Yes, it might be wise to take it slow here though my confidence is pretty high in being able to oversee this and deliver. It will take 2 or so months to find the right candidate, and another 2 to ramp up the performance. Along with the two months for our proposals to be considered and possible ratified, this is roughly a 6-month timeline anyway, but of course I want us to deliver high quality work. I think this hire would help with that both on our stakeholder publications as well as freeing up my bandwidth as the facilitator to focus more on programs like the Stakeholder Alignment framework and team management. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.785732945215704
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#33",
                    "likes": "0",
                    "time": "14/03/2022-21:22:32",
                    "content": "@Davidutro community is still see the value of two hires you say junior but compensation is not for junior role excepting some calls by @thomas.flitter and weather report by @Artem_Gordon we haven seen much i am sorry but is true maybe focus on setting them to speed first in stead of more hire more hire i as the lead PR of the DAO ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#34",
                    "likes": "2",
                    "time": "15/03/2022-01:35:22",
                    "content": "@Deimos What would you like to see us deliver? What do you believe is missing right now that GovComms can provide for you? Any projects, ideas, thought pieces, communication services, things like that? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#35",
                    "likes": "1",
                    "time": "15/03/2022-14:09:20",
                    "content": "Thanks for your feedback. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#36",
                    "likes": "1",
                    "time": "24/03/2022-04:11:18",
                    "content": "Reminder that this proposal will enter its Frozen Period in one week, on March 31, 2022. Last day for modifications is March 30, 2022. Substantive modifications beyond that date will render the proposal ineligible for the upcoming Governance Cycle / reset its Frozen Period, as the case may be. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#37",
                    "likes": "1",
                    "time": "06/04/2022-14:54:22",
                    "content": "@MIP-Editors I am formally submitting this for April’s cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#38",
                    "likes": "1",
                    "time": "14/04/2022-02:51:03",
                    "content": "This proposal is currently being voted on. Its RP will run from 04/11 to 04/25. Please vote here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "761"
}