{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/introducing-maker-wormhole/11550",
            "title": "Introducing Maker Wormhole ",
            "index": 11550,
            "category": [
                "Core Units",
                "Protocol Engineering"
            ],
            "tags": [
                "dai",
                "wormhole",
                "layer-2",
                "optimism",
                "pe-001",
                "arbitrum",
                "teleport"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "61",
                    "time": "10/11/2021-14:19:17",
                    "content": " maker-wormhole-logo2595×665 23.8 KB   Introduction Maker’s Protocol Engineering Core Unit is building upon its multichain strategy by introducing DAI Wormholing - the ability for almost instant teleportation of DAI between supported Layer 2s + Ethereum. As the Layer 2 ecosystem evolves and DAI liquidity grows within these domains, it will become important for users to be able to move DAI between them in a trustless manner. This initiative to Wormhole DAI across Layer 2 ecosystems, starting with Optimism and Arbitrum, will become an integral feature of the fungibility of Layer 2 DAI. Our proposed design is fully trustless and allows system participants to bridge virtually unlimited liquidity via the instantaneous minting of DAI on the destination domain. This means no longer being at the mercy of a counterparty having available liquidity.  Expanding Upon Fast Withdrawals A key observation is that the Maker Wormhole is a generalized version of Fast Withdrawals and that it allows DAI transfers across Layer 2 domains. After some discussion within the Protocol Engineering team it became clear that we should generalize the concept before implementing the special case of L2 → L1 “Fast Withdrawals”. By taking this approach we will be able to seamlessly deploy Maker Wormhole to any L2 after MCD becomes available on that chain.  Example: L2 → L1 “Fast Withdrawal”  wormhole-l2-l11920×1423 108 KB  In the image above there are 3 users wanting to make DAI withdrawals to L1. Instead of the usual approach of initiating an L2 → L1 message, the system will emit an event on L2 of the user’s intent. The L2 DAI will be burned at this point, and a storage slot will be marked for the Checkpoint Slow Fallback contract. The Maker Oracle Network will run L2 nodes which can attest to the finality and validity of L2 transactions. Operators will watch for these wormhole events and provide signed attestations. Users will be able to query for these attestations and provide them to the Oracle Fast Withdrawal contract for authentication. In the happy path the authentication is successful, new DAI is minted and sent to the user provided the Wormhole adapter has enough debt ceiling available. In the case where the Oracle Network is not available for any reason it will be necessary to provide an on-chain fallback. We do this by allowing users to submit a merkle proof that a particular storage slot has been set in the L2. If the proof is valid it guarantees the corresponding initWormhole() has been called (assuming the L2 state merkle root is valid). One important subtlety here is that the settlement stage has been grouped into one fungible block of DAI. This is in contrast to some other popular protocols which need to match each fast transfer with a corresponding settlement transaction after the 7 day fraud proof window. This may not seem like a big deal, but it has huge implications for scalability. If there are hundreds of thousands of transactions for $5.00 of DAI, it is simply too gas inefficient to clear these out 1:1. It is because of this constraint Maker is choosing to make the debt issued by the Wormhole module to be fully fungible. One problem introduced by fungible debt is that due to the limited debt ceiling it’s possible for users to be front-run and denied access to their DAI, possibly even after the 7 days has elapsed. This problem can be solved by introducing a fee market. The details of how this will work is still being actively researched, and we welcome any ideas from the broader community. We believe this trade off is worth it. Being able to route an unlimited number of individual transactions is key to scaling L2s. Settlement is the main bottleneck, and we believe we have found a robust solution.  L2 Multi-Collateral DAI (L2-MCD) The special case of L2 → L1 is relatively simple to get online because we already have MCD on L1. In order to support the general purpose wormhole we first need to deploy MCD on target L2s. Once MCD is deployed it will be trivial to add support for the minting side. The code can be re-used almost exactly from L1 along with the same Oracles API. The only difference is during settlement as well as the Checkpoint Slow Fallback, but these are minor details.  Example: L2 → L2 “Wormholing”  wormhole-l2-l21920×984 98.4 KB  As visible in the diagram above the initWormhole() on L2-A and oracle attestations on L2-B are identical to the L2 → L1 special case. Settlement is also roughly the same except it needs to send the DAI repayment to the target domain’s DAI bridge instead of settling debt on L1’s Wormhole Join. The idea is to use Ethereum as the primary settlement layer, but for end users they do not need to touch L1 to move across L2s. Generalizing this further, we no longer need to even think in terms of L2s or even blockchains. We have opted to use the term “domain” which refers to anywhere an instance of MCD is deployed. There could even be multiple deployments on the same chain. MCD (and Wormhole) could be deployed on other L1s if governance so desires. Of course consideration needs to be given to the security models of these L1s since we no longer inherit Ethereum security, and so cannot provide the same guarantees of the DAI showing up during settlement. It is our belief that the combination of fungible debt, zero cost of capital and virtually unlimited liquidity will cement DAI as the dominant cross-chain currency.  Timeline Building upon the previous work completed earlier this year we estimate delivery for the Fast Withdrawals (L2 → L1) feature in Q1 2022. Due to expanded team capacity and reduction of the urgent priority items we are able to move much quicker on these longer term commitments. The full Wormhole feature will take longer as there is a prerequisite of MCD on L2, but when that is delivered we get everything all at once. Vaults, Wormhole, D3M, etc. Tentative delivery for this is Q2 2022. We are initially targeting Optimism and Arbitrum, but L2-MCD / Wormhole will be expanded to other L2s as they become available. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/weekly-mips-update-68/12460",
                        "https://forum.makerdao.com/t/makerdao-vision/12880/3",
                        "https://forum.makerdao.com/t/rocking-the-defi-chasm-will-og-defi-applications-look-to-reinvent-themselves-in-2022/12173/2",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-4th-november-11th/11591",
                        "https://forum.makerdao.com/t/presentamos-maker-wormhole-traduccion/15112",
                        "https://forum.makerdao.com/t/mip69-l2-to-l1-fast-withdrawals/14041",
                        "https://forum.makerdao.com/t/multichain-strategy-community-call/12976",
                        "https://forum.makerdao.com/t/optimism-dai-bridge-with-fast-withdrawals/12860/3",
                        "https://forum.makerdao.com/t/weekly-mips-update-70/12695",
                        "https://forum.makerdao.com/t/compound-d3m-risk-assessment/12580",
                        "https://forum.makerdao.com/t/weekly-mips-update-69/12543",
                        "https://forum.makerdao.com/t/maker-governance-review-2021/12478",
                        "https://forum.makerdao.com/t/pecu-q4-highlights-and-looking-forward-to-2022/12430",
                        "https://forum.makerdao.com/t/weekly-mips-update-67/12387",
                        "https://forum.makerdao.com/t/under-construction/12274/14",
                        "https://forum.makerdao.com/t/weekly-mips-update-66/12190",
                        "https://forum.makerdao.com/t/forum-at-a-glance-december-2-9-2021/12119",
                        "https://forum.makerdao.com/t/mip40c3-sp47-core-unit-budget-sne-001-phase-ii-starknet-fast-withdrawal-and-wormhole/12041",
                        "https://forum.makerdao.com/t/starknet-wormhole-implementation-details/12042",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/5",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/15",
                        "https://forum.makerdao.com/t/ruta-de-layer-2-historia-y-futuro-traduccion/17387",
                        "https://forum.makerdao.com/t/layer-2-roadmap-history-and-future/17310",
                        "https://forum.makerdao.com/t/teleport-oracle-overview/15077",
                        "https://forum.makerdao.com/t/relay-semanal-17-23-de-mayo-del-2022/15392",
                        "https://forum.makerdao.com/t/weekly-relay-may-17-23-2022/15346",
                        "https://forum.makerdao.com/t/nuevo-nombre-de-maker-wormhole-maker-teleport-traduccion/15273",
                        "https://forum.makerdao.com/t/maker-wormhole-new-name-maker-teleport/15115"
                    ],
                    "GPT-summary": "The post introduces Maker Wormhole, a trustless way to move DAI between supported Layer 2s and Ethereum. The proposed design is fully trustless and allows system participants to bridge virtually unlimited liquidity via the instantaneous minting of DAI on the destination domain. The post explains the concept of Maker Wormhole, its features, and how it works. The author also provides examples and a timeline for the delivery of the feature. The post does not advertise the proposal, but rather explains it in detail. Some constructive criticism and questions are also addressed.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.726928374655648
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yondon",
                    "index": "#2",
                    "likes": "4",
                    "time": "11/11/2021-17:06:23",
                    "content": " If the proof is valid it guarantees the corresponding initWormhole() has been called (assuming the L2 state merkle root is valid).  In this fallback path, after the user calls initWormhole() on L2, they would need to wait through the oRU dispute period to provide the proof to Checkpoint Slow Fallback on L1 because L1 wouldn’t consider the L2 state root produced after the user’s initWormhole() call on L2 as valid until then right?  The only difference is during settlement as well as the Checkpoint Slow Fallback, but these are minor details.  IIUC in the L2 → L1 case, Checkpoint Slow Fallback can rely on the state roots that the L2 is constantly publishing to L1 for the storage proofs. In order to support Checkpoint Slow Fallback in the L2 → L2 case, would the destination L2 need to have a contract that serves as a light client for the origin L2 that is always aware of the latest valid state root of the origin L2? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.084415584415584
                },
                {
                    "author_link": "https://forum.makerdao.com/u/krzkaczor",
                    "index": "#3",
                    "likes": "7",
                    "time": "11/11/2021-19:43:39",
                    "content": "    yondon:  In this fallback path, after the user calls initWormhole() on L2, they would need to wait through the oRU dispute period to provide the proof to Checkpoint Slow Fallback on L1 because L1 wouldn’t consider the L2 state root produced after the user’s initWormhole() call on L2 as valid until then right?   Yes. Checkpoint Slow Fallback (TM  ) works only after dispute period is over so ~7days.     yondon:  IIUC in the L2 → L1 case, Checkpoint Slow Fallback can rely on the state roots that the L2 is constantly publishing to L1 for the storage proofs. In order to support Checkpoint Slow Fallback in the L2 → L2 case, would the destination L2 need to have a contract that serves as a light client for the origin L2 that is always aware of the latest valid state root of the origin L2?   Yes, you are right that we would need to have a contract on domain B that understands storage proofs of domain A. To avoid this we will probably only support issuing Checkpoint Slow Fallback requests through L1 even when wormholing between L2s. It’s gonna work similarly to the “force tx mechanism” that is available in many rollups. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.350446428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#4",
                    "likes": "5",
                    "time": "15/11/2021-19:50:31",
                    "content": "  twitter.com    MakerMegaphone @MakerMegaphone  https://t.co/2iJC3slCGa         5:52 PM - 15 Nov 2021           4                1            ",
                    "links": [
                        "https://twitter.com/MakerMegaphone/status/1460304829369126912",
                        "https://twitter.com/MakerMegaphone/status/1460304829369126912",
                        "https://t.co/2iJC3slCGa",
                        "https://twitter.com/MakerMegaphone/status/1460304829369126912"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maciejka",
                    "index": "#5",
                    "likes": "5",
                    "time": "17/11/2021-13:25:10",
                    "content": "Why not to use regular l2 to l1 messaging for Slow Fallback? It will be just slightly slower (dispute period will count from the moment of fallback initialization, not from the moment of opening the wormhole), probably cheaper (no need to verify merkle proofs on L1), and simpler to implement. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#6",
                    "likes": "1",
                    "time": "17/11/2021-15:42:20",
                    "content": "Yup good call on this. The design is very much being worked out in detail. The above is just a snapshot at that moment in time. Firing off a l2->l1 message which doesn’t get relayed is much simpler and doesn’t break any scaling requirements. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "2",
                    "time": "20/11/2021-18:17:18",
                    "content": "Hey man, I was not able to attend the call yesterday and had a few questions (sorry if these were already asked). With regards to the quick withdrawal fee–would it be possible to Stake “DAI” in order to reduce the fee? Say you Stake 1,000 DAI your fee gets reduced from 0.3% to 0.25%, etc. 2nd Question? Will it be possible to expand this product into something similar to what Li Finance is doing (allowing end users to swap DAI on Arbitrum to ETH on OP)? A swap feature/mechanism for multiple asset types. And last question–would it be possible to expand Maker Wormhole to other EVM compatible chains like AVAX, Aurora (NEAR), Harmony, etc. and other L2’s like StarkEx/StarkNet, ParaState, xDAI, etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.726190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#8",
                    "likes": "1",
                    "time": "22/11/2021-18:52:50",
                    "content": "    flipflopflapdelegate:  With regards to the quick withdrawal fee–would it be possible to Stake “DAI” in order to reduce the fee? Say you Stake 1,000 DAI your fee gets reduced from 0.3% to 0.25%, etc.   This is an interesting idea. It is likely a fee mechanism of some sort will be required to prevent denial of service attacks. We discussed a possibility of people just dumping their own DAI into the Wormhole technically that would increase the available debt ceiling because an excess of DAI is now available. This was thought of in the case where someone loses access to their DAI, but staking is an interesting design option which doesn’t result in you just donating your DAI to Wormhole.     flipflopflapdelegate:  2nd Question? Will it be possible to expand this product into something similar to what Li Finance is doing (allowing end users to swap DAI on Arbitrum to ETH on OP)? A swap feature/mechanism for multiple asset types.   The swap itself would probably be through an AMM (or aggregator) on the source/destination chains, but yeah no reason UIs can’t provide this to the end user just using Wormhole as the chain to chain step.     flipflopflapdelegate:  And last question–would it be possible to expand Maker Wormhole to other EVM compatible chains like AVAX, Aurora (NEAR), Harmony, etc. and other L2’s like StarkEx/StarkNet, ParaState, xDAI, etc.   Yes the design is quite generic. We can easily support any EVM-compatible chain - even other L1s. This is not a free lunch though. MKR holders will be on the hook when something goes wrong on any of these chains. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.394097222222221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#9",
                    "likes": "1",
                    "time": "22/11/2021-23:45:46",
                    "content": "It will be interesting to see how this works. A few questions and I apologize if I misunderstand anything.   Since these are L2s and there will be a MCD instance there does this means that the MCD instance on L2 mints L1 DAI?   Again since there are MCD instances on L2 we basically have collateral on L2 minting DAI.  This means that liquidations for that L2 collateral would have to happen on the same L2?   It looks like you will rely on Oracles to provide the burn/mint accounting glue.  I am guessing since they are Maker Oracles they are pretty robust to DDOS attacks but what is the network information passing going to look like.   Is each node going to run a instance of that L2 or many?   I am just wondering if an attack on one or a few oracle nodes could take down wormhole activity on any particular L2.  Or a better question does our oracle cost infrastructure increase?   What will the data security paths look like between the oracle nodes relating to this accounting information they will pass on the fast paths?   Like the same information on the slow paths or something different?   If an issue is found with any of the L2 networks (some security or bridge/code issue) what is the contingency plan to firewall off those networks from continued transactions or is this not possible?   I am thinking like a L2 oracle or MCD IAM module.    Biggest issue I see is that I don’t think we just have a MCD halt.  We can shut off some things but we can’t just halt a MCD instance - we ES it.    What does that look like in the context of L2 MCD instances and governance…   I am really excited to see what team comes up with here but as this has significant complexity as well as potential latencies and dependencies on additional network functionality (oracles) the I am concerned surface area for problems gets pretty large. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.65142021720969
                },
                {
                    "author_link": "https://forum.makerdao.com/u/krzkaczor",
                    "index": "#10",
                    "likes": "1",
                    "time": "30/11/2021-20:26:17",
                    "content": "@MakerMan, sorry I missed your message. Note that MCD on L2 is a separate (yet related) topic and you can expect a separate blog post diving into details there.   This is an excellent question as solving this problem is required to have DAI fungible between different bridges (ie. bridge can never run out of liquidity on L1). Our current plan is to pre-mint DAI available to mint (distribute) on L2. This DAI would be permitted on L1 and locked into DAI bridge of a particular domain.   Yes L2 “slave” MCD will have it’s own liquidations. Think about the case where the collateral is L2 native and it’s not even available on L1.   CC: @marcandu. If we want oracles to run full nodes of L2s we should expect a cost of running oracles to increase (better hardware required etc.)   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.325757575757576
                },
                {
                    "author_link": "https://forum.makerdao.com/u/marcandu",
                    "index": "#11",
                    "likes": "0",
                    "time": "30/11/2021-21:25:40",
                    "content": "    MakerMan:  It looks like you will rely on Oracles to provide the burn/mint accounting glue. I am guessing since they are Maker Oracles they are pretty robust to DDOS attacks but what is the network information passing going to look like. Is each node going to run a instance of that L2 or many? I am just wondering if an attack on one or a few oracle nodes could take down wormhole activity on any particular L2. Or a better question does our oracle cost infrastructure increase?   In an ideal situation every individual oracle feed will need run their own L2 nodes (one for each chain), but that will significantly increase the burden  of running feeds (servers + operations). Increasing their monthly feed stipend is certainly an option. To keep feed operation as simple and easy as possible, we are also considering a scenario where the feeds can use several third party nodes and cross-validate their responses. In case of a discrepancy (e.g. one of the node is compromised and an attacker tries to trick feed to attest on a nonexistent transaction), the feed would no sign the attestation. Feeds could then use a mix of L2 nodes operated by paid services, trusted third parties, friends, etc.     MakerMan:  What will the data security paths look like between the oracle nodes relating to this accounting information they will pass on the fast paths? Like the same information on the slow paths or something different?   Not certain I’m fully getting the question, but oracle feeds will be attesting the presence of specific on-chain events, and these events will contain the necessary information to complete the withdrawal (destination, amount, etc.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.649343711843712
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#12",
                    "likes": "0",
                    "time": "28/02/2022-21:26:06",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}