{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-reserves-for-salaries-in-usdc/6587",
            "title": "[Discussion] Reserves (for salaries) in USDC ",
            "index": 6587,
            "category": [
                "Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#1",
                    "likes": "5",
                    "time": "15/02/2021-11:27:51",
                    "content": "During the weekend, on the MakerDAO chat, one the current top smart-contract developers (@galabasquer) working for MakerDAO (with the Maker Foundation) wrote something that I think is very important and should be discussed properly.  If there is something that I can not complaint regarding the Foundation is about certainty on monthly payments and job security, which is very important for someone that carries a family. I know that working for a DAO will bring some more uncertainties which I believe I’m up to take but wanna see up to which point they will be.  Currently we are increasing the Surplus Buffer, which is a first step towards “certainty about payments”. Problem: However the SB can be used for many things, MKR-holders can change their minds every few months about its usage and, perhaps most importantly, it is expressed in DAI. Obviously DAIs are correlated to MakerDAO’s performance and in principle could lose the peg. People working want to work, not to lose sleep thinking that the crypto market could crash, that the reserves could be depleted, etc! PROPOSAL: what do you think about starting a reserve of uncorrelated assets (e.g., USDC) intended to be exclusively used to guarantee security of payments to people working for (Core Units of) MakerDAO? Ideally for a decent time-frame lile 24 months. GOAL: We want to make MakerDAO the best place for talents in the crypto–space to come and work. Good salaries, exciting jobs. And this also included job security. Of course job security does not mean that you can sleep, do nothing, and still get your salary. It only means that if you do well your job, and your Core Unit facilitator is happy about it, you can sleep well knowing that MakerDAO has reserves of money (uncorrelated to its potential failure) to pay your salary. ",
                    "links": [],
                    "GPT-summary": "The author proposes creating a reserve of uncorrelated assets, such as USDC, to guarantee job security and payments for people working for MakerDAO. The proposal aims to make MakerDAO an attractive place for talents in the crypto-space to work. A 3rd party is giving constructive criticism and asking questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.268509615384615
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/02/2021-11:41:19",
                    "content": "I think small DAI/USD drifts can be managed by governance on an ad-hoc basis by over/underselling DAI for those who want their salary in denominated in USD. Facilitators could also preemptively convert DAI to reserves on their own terms if they wish. One more reserve for governance to formally manage seems like a slowdown we don’t need at the moment.     iammeeoh:  GOAL: We want to make MakerDAO the best place for talents in the crypto–space to come and work. Good salaries, exciting jobs. (…)   Hard agree.     iammeeoh:  And this also included job security.   Extremely small caveat: we are all in a risky environment and I think everyone is aware of that. Fundamentally we can’t yet provide the job security a public institution can promise – that’s OK. We’re a lot more interesting. So I think we should commit to extremely good faith efforts towards job stability and very satisfying compensation levels but also stay honest about the risks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.877604166666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/02/2021-12:51:55",
                    "content": "    MIP37: Static Reserve For Governance RFC       MIP37: Static Reserve For Governance Introduction Following the MIP Discussion and the long time on-going discussion about having a reserve,  this MIP formalises the need for the governance to have a proper reserve to store Dai or any tokens.  MIP#: 37 Title: Static Reserve For Governance Author(s):  Alexis Type: Technical Status: Request for Comments (RFC) Date Proposed: 2021-01-15 Dependencies: None Replaces: Nothing  Sentence Summary MIP37 defines a static reserve which can receive any tokens…     Isn’t it similar to MIP37? ",
                    "links": [
                        "https://forum.makerdao.com/t/mip34-keg-streaming-payments-module/6013/6"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#4",
                    "likes": "0",
                    "time": "15/02/2021-12:53:02",
                    "content": "@iammeeoh as far as I know most of your proposal is already covered by the Keg. Check it out - tell me if I am wrong? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#5",
                    "likes": "0",
                    "time": "15/02/2021-12:57:30",
                    "content": "Partially, only dai for the keg. Tho I believe it is fine. Main problem is would governance allow to pick on a negative vow? And what would be the consequence of increasing our debt with regard to dai holder. There is also an issue in case of shutdown, salaries won’t be paid ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.354166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#6",
                    "likes": "0",
                    "time": "15/02/2021-13:32:35",
                    "content": "    alexis:  There is also an issue in case of shutdown, salaries won’t be paid   Yes that was the main point of my post. We ideally want something SAFE and UNCORRELATED to the (short term) success or failure of MakerDAO.     swakya:  So I think we should commit to extremely good faith efforts towards job stability and very satisfying compensation levels but also stay honest about the risks.   In principle I agree, but if you have a family you might want more security than just “good faith” towards MKR holders. Anyway, this is just a discussion to see what is the sentiment about this. I personally have a very stable job, basically risk free. So perhaps I am a bit too biased, beyond what is commonly considered necessary, towards giving security and certainties. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.433333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#7",
                    "likes": "2",
                    "time": "15/02/2021-13:46:42",
                    "content": "I don’t think it is technically complicated to prepare a Smart Contract to hold the salary funds with some strong rules to avoid governance “changing their mind about it”, for instance:  Any decision of governance about those funds would have a freeze period of (3 months?) Funds on the smart contract should have min (3 - 6 months) of payment regarding to salary costs. …  What I mean, we could come up with any set of rules that we all coincide are fair and ensure payment stability. The Smart Contract then could guarantee all these rules, and our workforce would not have to worry about it, since this contract would be trustless. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.688350340136054
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#8",
                    "likes": "5",
                    "time": "15/02/2021-15:06:21",
                    "content": "MIP47 allows for that IMO. A mandated actor multisig is soon in place. It should be noted that this wallet is the property of MakerDAO. It will be used to pay Core Units (some at least) Nothing prevents this wallet to own 6/12/18 months of expected expenses for Core Units. It is the simplest path. People are not employed by the DAO so there are obviously some risks (but Core Units can employ people and provide some insurance). Converting some DAI into USDC in this wallet is maybe a bridge too far. It’s like working for Bank of America and asking your employer to keep an account at Citigroup in case Bank of America is no longer solvent. What message is that sending to DAI users if even Maker employees don’t trust DAI for their compensation? ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmWtqqLK?network=mainnet"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#9",
                    "likes": "0",
                    "time": "15/02/2021-15:16:26",
                    "content": "I don’t think MIP47 apply to it, for me multi sign means we give the full right on the wallet to mandated users vs governance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.589285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#10",
                    "likes": "0",
                    "time": "17/05/2021-21:16:53",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}