{
    "poll_list": [
        {
            "title": "Ratification Poll for Modify Oracle Core Unit Budget (MIP40c3-SP75) - August 8, 2022",
            "index": "16397",
            "option": "Approve proposed budget (Reduced budget exempt from further cuts for 12 months)",
            "supporting_mkr": "82,440",
            "highest_fraction": -1
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp75-modify-oracles-core-unit-budget-ora-001/16397",
            "title": "MIP40c3-SP75: Modify Oracles Core Unit Budget, ORA-001 ",
            "index": 16397,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "core-unit-budget",
                "oracle-core-unit",
                "ora-001",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#1",
                    "likes": "6",
                    "time": "06/07/2022-23:40:54",
                    "content": " MIP40c3-SP75: Modify Oracle Core Unit Budget, ORA-001  Preamble MIP40c3-SP#: 75 Author(s): Niklas Kunkel (@NiklasKunkel) Contributors: Tags: core-unit, cu-ora-001, budget Status: Accepted Date Applied: 2022-07-06 Date Ratified: 2022-08-22 Budget Start Date: 2022-07-01 Budget End Date: 2023-06-30 Forum URL: https://forum.makerdao.com/t/mip40c3-sp75-modify-oracles-core-unit-budget-ora-001/16397 Ratification Poll URL: https://vote.makerdao.com/polling/Qma3P8v9 Extra: Winning option was C: Approve proposed budget (2022-2023) (Reduced budget exempt from further cuts for 12 months).   Sentence Summary MIP40c3-SP75 renews the Oracle Core Unit ORA-001 budget from July 1 2022 through June 30 2023.  Paragraph Summary MIP40c3-SP75 renews the Oracle Core Unit ORA-001 budget from July 1 2022 through June 30 2023.  Specification  Motivation The Oracle Core Unit (ORA-001, aka OCU) is responsible for R&D of the Oracle Protocol. Oracles are a critical component of securing the Maker Protocol. The Oracles protect the solvency of the Maker Protocol by ensuring Dai in circulation are sufficiently collateralized, enabling liquidations when the value of collateral declines. Oracles act as the consensus mechanism for the Maker Teleport bridges which are critical for scaling Dai in a multi-chain world. The Oracle Core Unit is essential to ensure the Oracle Protocol can evolve in a secure and scalable manner to meet the ever-growing demands of the Maker Protocol. This budget represents the resources needed to employ the exceptional talent to take on this critical responsibility.  Core Unit ID ORA-001  Budget Implementation This budget proposal institutes a continuous funding model similar to those proposed by RISK-001, SES-001, DUX-001, and SF-001. At the end of the proposed term, monthly payment amounts from this proposal will be rolled over unless modified by a MIP40c3 - Modify Core Unit Budget Subproposal.  Smart Contract Implementation The budget implementation utilizes DssVest to continuously vest the budget in a linear fashion. The vesting schedule begins July 1, 2022 and extends to June 30, 2023. If no MIP40c3 to modify the Core Unit’s budget has been published for RFC, submitted for FS, or ratified, a new stream will be generated with the same budget specification as the previous budget proposal.  DAI per month = 379,547.90 (proposed budget) or 421,760.42 (previous budget) Destination Wallet = eth:0x2d09B7b95f3F312ba6dDfB77bA6971786c5b50Cf A total of 4,554,575 DAI (proposed budget) or 5,061,125 DAI (previous budget) will be streamed to eth:0x2d09B7b95f3F312ba6dDfB77bA6971786c5b50Cf starting date 7/1/22 and ending date 6/30/23.   Budget Breakdown  Budget Cost-Cutting The Oracle Core Unit recognises the active discussions being had in the community around cutting costs. Therefore, the Oracle Core Unit is proactively reducing its budget by 10%. There are however several parallel initiatives in the community for slashing Core Unit budgets. It is unclear at this point in time whether these cuts will target specific Core Units, specific initiatives, or just a universal haircut across all Core Units. The Oracle Core Unit needs to balance being a good citizen and proactively reducing its budget with the real risk that further cost cutting initiatives could place it in ‘double jeopardy’. Therefore, the Oracle Core Unit is adding the clause to this budget renewal that, should the proposed reduced budget be approved, the Oracle Core Unit will be exempt from further budget reductions for 12 months. Should voters find that compromise unfavourable, they are able to vote for the previous year’s budget and reduce it through the DAO-wide cost-cutting initiatives which are underway.  Reporting Transparency Budget     Expense Category 2021-2022 Budget (1 year) 2022-2023 Budget (1 year) Monthly Equivalent     Compensation & Benefits $3,347,500 $2,250,575 187,547.95   Recruitment / Referral / Sign-On Bonus $300,000 $250,000 $20,833.33   Travel & Entertainment $150,000 $180,000 $15,000   Headcount Expense Subtotal $3,797,000 $2,680,575 $223,381.29         Feed Stipend $360,000 $954,000 $79,500   Tech-Ops CU 24/7 Monitoring $150,000 $216,000 $18,000   Legal $100,000 $150,000 $12,500   Audits $200,000 $100,000 $8333   Marketing $100,000 $75,000 $6250   Training 0 $30,000 $2500   Hardware Expense $30,000 $35,000 $2916.67   Software Expense $35,000 $15,000 $1250   Deployment Costs $50,000 $10,000 $833.33   Non-Headcount Expenses Subtotal $1,025,000 $1,585,000 $132,083.33         Contingency $238,625 $289,000 $24,083.33         Grand Total $5,061,125 $4,554,575 $379,547.9     Budget Term The ORA-001 budget will begin on July 1st, 2022 and end on June 30, 2023.  Budget Details Compensation & Benefits Contributors are paid for their work in DAI, USD or Euros every two weeks. This encompasses full time and part time contributors as well as research grants for external researchers. Low-risk work items may also be contracted out to external teams or agencies. Recruitment / Referral / Sign-on Bonus These are acquisition costs for onboarding talent to the Core Unit. This includes posting job listings on job boards, newsletters, and podcasts. External recruiters generally charge sizable recruitment fees proportional to a candidates annual salary. These are significant especially for senior candidates. Signing bonuses can be leveraged to convince candidates whose salary requirements are outside of the designated budget to join the Core Unit without increasing the Core Units long term expenditures. Travel This applies to transportation, lodging, nourishment, professional venues such as conference rooms, team activities, and conference passes. Frequent team offsites are critical for remote organisations as they foster interpersonal relationships and generate alignment and trust. These are vital qualities in a company’s culture that improve collaboration, productivity, and retention. They also have a habit of teasing out critical discussions and knowledge sharing via informal and impromptu conversations. Conferences are hot spots for interfacing with partners and clients in a much more personal (read “effective”) manner. They also are ideal for scouting potential new talent as well as staying on top of industry developments, trends, and competition. Speaking at these events, participating in panels, and hosting workshops are also ideal methods to reinforce Maker’s reputation as a thought leader. Feed Stipends All Feeds are compensated with a Feed Stipend of 1000 Dai per month. There are currently 26 total Feeds; 12 Light Feeds, and 14 Dark Feeds. We expect to continue onboarding new Feeds in the coming year to meet the growing security requirements of the Maker Protocol as it scales. Tech-Ops Core Unit - Production Coverage Tech-Ops Core Unit provides excellent coverage in monitoring production systems 24/7 365 across a multitude of timezones. Legal Coverage for legal costs including entity creation, legal officer/company insurance, regulatory filings, annual fees, as well as financial reporting. Audits As the Oracle Protocol evolves, audits are an indispensable part of the QA process. In many cases, multiples audits may be required for a single release due to the sensitive role that Oracles play in securing the Maker Protocol. Audits vary in price depending on the code size and complexity, as well as the prestige of the auditor. During bull markets especially, auditors are booked months in advance and charge heavy premiums for fast-tracking. The Oracle Core Unit will always prioritise the security of the Maker Protocol over agility. Marketing The marketing budget is for building a brand around the Oracle Protocol. As we won’t have an in-house designer initially, some of the budget will be used to outsource design work. Conference sponsorships, ad campaigns with select partners, and user incentives, also fall under this umbrella. Training Training is a critical component for a healthy Core Unit. This includes hard (technical) and soft skill training for individual contributors as well as executive training for management.  Hardware Expense Hardware expenses pay for servers that run testing and staging environments, as well as monitoring for testing and production systems. Software Expense Software expenses encompass quite a broad range of services. These include:  administrative applications like email, documents, and cloud storage monitoring software API services productivity applications like Notion and Shortcut staging and production logging services  Deployment Costs Deployment costs are used for smart contract deployment and configuration, as well as multisig administration.  Increasing Value to Maker Tokenholders Facilitate Maker Protocol and Dai expansion to other blockchains including L2 By expanding the responsibility of the Feeds to not just poll prices but monitor other blockchains, the Maker Oracles are able to power the consensus engine for the Maker Teleport initiative. This will enable Dai Fast-Withdrawals between Ethereum and L2 chains such as Optimism, Arbitrum, and StarkNet. This is the first step to expanding Dai’s hegemony across all chains. Furthermore, the Oracle Core Unit is building out L2 Oracles, which will be critical infrastructure for the deployment of the Maker Protocol on other chains. Increase Protocol Security One of the Oracle Core Unit’s main responsibilities is to protect the Maker Protocol from Oracle attacks. Oracle attacks are primarily an existential threat to the protocol as they enable the attacker to mint unbacked Dai, leading to losses for the protocol and, in the worst case, insolvency. They can also cause the protocol to liquidate its entire crypto collateral portfolio, which could cause a liquidity crisis and realize losses for both Vault owners, Dai holders, and the Maker protocol. Therefore, it is imperative that the Oracle Core Unit spends a significant amount of its resources on bolstering its security. This is done in a defense by layers approach. New high-quality Feeds are added to increase the quality and size of the validator set. Oracle Data Models are routinely refactored to more accurately profile the liquidity properties of their reference asset. Oracle stack components and infrastructure are constantly being rearchitected to patch bugs, simplify code, and remove external dependencies. Minor releases are extensively tested with end-to-end testing in advanced staging environments which simulate real world conditions. Major releases are audited by both internal and external parties for quality and safety. This is an area where no news is good news, and the Oracle Core Unit’s track record speaks for itself. Optimize Oracle expenditures The Oracle Core Unit is painfully aware of the gas costs of the Oracles being linearly correlated with the Ethereum gas cost base fee. With peaks of over 7000 gwei within the past year, the Oracle Core Unit has spent an enormous of time on optimizing the Oracles to reduce gas usage. Past and current initiatives:  Fine-tuning quorum. Fine-tuning price spread. Fine-tuning expiration time. Offboarding unprofitable collateral types. Novel signing mechanisms research. Data compression research (multi-asset medianizer). Reducing external contract calls (medianizer-OSM hybrid). Oracle Security Module rearchitecture (OSMv2). MegaPoker ‘smart-poke’. L2 optimized Oracle smart contracts (calldata compression).  Oracle as a Service (OaaS) business The Oracle Core Unit is building an Oracle as a Service product to create an Oracle business on behalf of the DAO. This Oracle business will bolster the reputation of MakerDAO as a secure and reliable high-value service provider, help subsidize the costs incurred by Oracles, and potentially generate profit. Oracles as a service can also be used as leverage for partnerships and integrations. For example, MakerDAO may be more willing to lend Dai to a secondary lender if they utilize Maker Oracles as it minimizes MakerDAO’s risk exposure to external Oracle providers.  Roadmap and Objectives  Research and Publish Oracle Assessments to Advise the DAO on collateral onboarding. Implement and deploy Oracles to support collateral onboarding. Deploy Oracles on L2 & EVM-based L1. Maker Teleport Oracle to support MakerDAO L2 Initiatives.  Arbitrum. Optimism. StarkNet.   Optimize Oracle Gas Costs. Next-gen Oracle client (Ghost). Extend Feed Validator Set. Re-Architecture Oracle Security Module smart contract. Oracle Dashboard. Next-gen Oracle relayer client. Advanced Oracle Monitoring.   Headcount Planning / Team Summary The Oracle Core Unit made the deliberate decision to pause hiring during the peak of the bull-run as candidate salary expectations were unreasonably high and ultimately unsustainable. Now that market sentiment has mean-reverted, the Oracle Core Unit plans to aggressively pursue hiring for key roles. Due to the nature of finding exceptional talent, projections for modeling number of FTEs over time are not meaningful and therefore not provided.  Current: 6 FTE + 1 PT Target: 15 FTE + 2 PT  Current Roles  Facilitator Engineering Lead 3x Senior Backend Engineer Backend Engineer Researcher (PT)  Open Roles *Varying Seniority  Operations Manager Risk / Research Lead Researcher Governance and Community Liaison Smart Contract Engineer Fullstack Engineer Backend Engineer DevOps Engineer Marketing Associate   Headcount Strategy The expansion with open roles is meant to professionalize the Oracle Core Unit. Currently the Oracle Core Unit has strong specialised engineering talent. This engineering core needs to be supplemented with key skills to create supporting products and infrastructure that reinforce the transparency, accessibility, reliability, and marketability of the Oracle service. Operations Manager Currently all operations-related functions are being handled by the Facilitator, including accounting, payments, expenses, organizing offsite logistics, recruiting, interviews, etc. As the organisation scales, these responsibilities will amplify and take up more and more of the Facilitator’s bandwidth. An operations manager will free up the Facilitator to work on higher-impact items such as business initiatives and improving internal processes. Head of Risk / Research & Researcher Key here is that the risk and research function is split out from the engineering side. The investment of resources into a dedicated research arm ensures MakerDAO’s Oracles remain on the cutting-edge while freeing up engineers to focus on implementation. Focus areas for research will include scalability, security, decentralisation, data compression, and data integrity. GovComm Liaison The Governance and Community Liaison is a role dedicated to increasing transparency and giving Maker Governance more insight into the progress made by the Core Unit on deliverables. They will serve as the key interface point between the Core Unit and Maker Governance acting as a two-way bridge. This will free up leadership to focus on Core Unit initiatives. Fullstack Engineer Recent forays into community-driven prototypes have produced notable results (https://makeroracles.xyz/). In a bid to increase transparency and awareness of the Oracles, an internally driven effort for an Oracle Dashboard by a dedicated fullstack engineer is planned. Backend Engineer Reinforcement of the backend team will create redundancy in several key areas, as well as free up senior engineers from trivial tasks. DevOps Engineer Acquiring an internal DevOps engineer will enable the Oracle Core Unit to begin to wean itself off of its dependency on Tech-Ops for production monitoring. This will enable more focused attention on the needs of the Core Unit, as well as a lower latency communication loop with respect to issues/emergencies. It will also support the transition of the Maker Protocol to go multi-chain, as Oracles will be required to expand to every chain Maker wants to support. Marketing Associate A marketing role is necessary to engage with the crypto ecosystem about the exceptional reliability and security properties of the Maker Oracles. This marketing would aim to onboard new Oracle consumers and Feeds.  MKR Vesting The Oracle Core Unit uses a linear interpolation model which utilizes contributor compensation to calculate the amount of MKR each individual will vest.  Formulas [Initial Annual FTE Incentive Value in USD] = MAX(     2.45 * [Annual FTE Gross Salary] -275,000 USD;     [Annual FTE Gross Salary] * 0.35 )  [Initial Annual FTE Incentive (MKR)] =     [Initial Annual FTE Incentive Value in USD] /     [180-Average Price of MKR at the first date of employment]   Vesting Details     Property Value     MKR/USD lock-in Price (New) Trailing 6 month average   Annual MKR Amount Initial Annual Incentive Value (USD) / MKR/USD lock-in Price   Vesting Period 4 years   Cliff Vest 12 months   Vesting Schedule After cliff has expired, half of the annual MKR amount vests every 6 months.   Manual Repricing yes   Auto-Renewal yes   Estimated Max Total team MKR After 1 Year (15 FTE + 2 PT)* 1100   Estimated Max Total team MKR After 4 Years (15 FTE + 2 PT)* 4400    *MKR amounts can change if a contributor’s lock-in is reset via manual repricing. Resets will be reported to the DAO on a quarterly basis.  Multisig Management The Oracle Core Unit has four multisig wallets.  Oracle Core Unit Operations multisig Oracle Core Unit Emergency multisig Oracle Core Unit Gas multisig Oracle Core Unit Gas Emergency multisig  Oracle Core Unit Operations Multsig This multisig holds the general operational funds of the Oracle Core Unit. Signers = 3 Quorum = 2  Signers: Nik - Oracle Core Unit Facilitator - @NikKunkel 0xB4CFf22c0d5a015460Fd503a9328Bf00a24f686c  Marc-Andre - Oracle Core Unit Engineering Lead - @marcandu 0xf63EfEE2A663b04cB5a09De6E3EB910d8442131D  Derek - Protocol Engineering Facilitator - @Derek 0xe3a76328edE8Fd61d5fA7840b878Dd69cdfD67d8  Current Balance: 1,253,473.75*  (DAI) Unclaimed vested funds from previous budget: 2,216,771 (DAI) *Some of these funds are earmarked to vendors which have yet to submit invoices Oracle Core Unit Emergency Multisig This multisig has funding designated exclusively for emergencies. While unforeseen events that broaden the scope of what entails an emergency can occur, the scope is intended to be narrow.  The protocol undergoes emergency shutdown and needs to be redeployed and bootstrapped. A hacker manages to attack the protocol potentially resulting in a loss of assets or mass printing of unbacked Dai. Governance is captured by an objectively malicious actor.  Signers = 7 Quorum = 4  Signers: Nik - Oracle Core Unit Facilitator - @NikKunkel 0xB4CFf22c0d5a015460Fd503a9328Bf00a24f686c  Primoz - Risk Core Unit Facilitator - @Primoz 0x5d67d5B1fC7EF4bfF31967bE2D2d7b9323c1521c  Derek - Protocol Engineering Core Unit Facilitator - @Derek 0xe3a76328edE8Fd61d5fA7840b878Dd69cdfD67d8  LongForWisdom - GovAlpha Core Unit Contributor - @LongForWisdom 0x66f40F044E0e2F77bB746e3275E82e88dCBA2D69  Nadia - Growth Core Unit Facilitator - @Nadia 0xc8E6c287F6c127AFE5e4CB30bC440607b44c35f8  SebVentures - Strategic Finance Core Unit Contributor - @SebVentures 0x0D61C8b6CA9669A36F351De3AE335e9689dd9C5b  Juan - Sustainable Ecosystem Scaling Core Unit Facilitator - @juan 0xFCa6e196c2ad557E64D9397e283C2AFe57344b75  Current Balance: $800,000 (DAI) Oracle Core Unit Gas Multisig This multisig is used exclusively for holding funds designated for Oracle gas expenditures. These costs are variable as gas prices fluctuate on blockchain networks (Ethereum, Optimism, Arbitrum, StarkNet, etc.) and as the number of deployed Oracles increases over time. Gas costs are typically forecast and renewed by the Maker Protocol every three months. Gas prices are unpredictably volatile and funding drawdown can occur rapidly. The Bored Ape Yacht Club APE land sale caused gas prices to temporarily spike as high as 5000 gwei more than 200x the average over the previous month. For this reason, funds budgeted for Oracle gas costs are issued by governance as a lump-sum payment rather than vesting over time. A variety of factors have led to an exponential reduction in Oracle gas price expenditures relative to initial projections. These include:  Gas cost optimizations by the Oracle Core Unit Collateral offboarding by Maker Governance Ethereum gas base fee reduction  The remainder of funds initially allocated by the DAO to cover Oracle gas costs for 3 months at current expenditure rates, should now cover the next ~2.5 years. If the base fee were to trend higher, that 1.5 year runway would reduce significantly. Signers = 6 Quorum = 3  Signers: Nik - Oracle Core Unit Faciliator - @NikKunkel 0xB4CFf22c0d5a015460Fd503a9328Bf00a24f686c  Marc-Andre - OCU Engineering Team Lead - @marcandu 0xf63EfEE2A663b04cB5a09De6E3EB910d8442131D  Simon - Tech-Ops Core Unit Co-Facilitator - @simonkp 0xA60C77efe539166F1C4a6cE2512F3cBF451fFbc5  Dumitru Zavrotschi - Tech-Ops Core Unit Co-Facilitator - @dumitru 0xcebd4Fa8c2c6014F2F7924De3Ae617BdD42ca25B  Primoz - Risk Core Unit Facilitator - @Primoz 0x5d67d5B1fC7EF4bfF31967bE2D2d7b9323c1521c  PunchIt Inc. - Protocol Engineering Core Contributor - @cmooney 0xEeF3026eF864C9398c008195E65d16D9cb42a512  Current Balance: $1,966,214.12 (DAI), 201.26 ETH Oracle Core Unit Gas Emergency Multisig These funds are allocated for an emergency scenario where either:  The funds in the primary Oracle Core Unit Gas Multisig have been expended The fund in the primary Oracle Core Unit Gas Multisig are unaccessible due to signers being “on a plane, on vacation, asleep, off-the-grid, bus factor, or generally unavailable.  The emergency multisig has a lower signing threshold than the primary gas multisig in order to ensure that funds can be withdrawn on short notice in the event that quorum cannot be achieved in the primary. Signers = 3 Quorum = 2  Signers: Nik - Oracle Core Unit Faciliator - @NikKunkel 0xB4CFf22c0d5a015460Fd503a9328Bf00a24f686c  Marc-Andre - OCU Engineering Team Lead - @marcandu 0xf63EfEE2A663b04cB5a09De6E3EB910d8442131D  Simon - Tech-Ops Core Unit - @simonkp 0xA60C77efe539166F1C4a6cE2512F3cBF451fFbc5  Current Balance: $1,805,407 (DAI)  Contingency Planning In a super bear scenario, the Oracle Core Unit could temporarily abandon long-term objectives such as:  Feed Stipend increases. Feed validator set expansion. Customer Oracle development. Marketing. Offsites + Conferences. Research. Engineering team expansion.  Cutting all of the above would reduce expenses to ~2,500,000 DAI annually. The Core Unit could then use its remaining resources to focus on security and reliability. It could operate in this vegetative state for a considerable amount of time (12 months+), though eventually negative externalities stemming from pulling investment from long-term initiatives will coagulate and compound. Retention and team morale may also become an issue. Oracle gas optimization efforts may lose ground relative to the increase of gas prices the longer the super bear period continues increasing long-term costs of the DAO.  Unwinding and Defunding Within one month of the ratification of the offboarding proposal, the Facilitator will submit a proposal to the community documenting the plan for wind-down of the Oracle Core Unit. This plan will include line items of the necessary tasks to complete unwinding, a projected timeline, as well as a cost estimate for completion of the wind-down proposal. After the completion of the shutdown, any remaining budget will be returned to the DAO with the following exceptions:  Any outstanding payments that are owed to external parties and contributors but have not yet been paid. The Oracle Core Unit and/or its management are involved in active litigation and need to retain a subset of the budget to resolve legal disputes.  Oracle Core Unit contributor MKR vesting will be accelerated to the nearest 6-month vest on completion of the wind-down. This means a contributor vesting 10 MKR annually would vest 5 MKR at completion of the wind-down. The above clause overrides the 12-month cliff.  Return of Excess Funds As specified in MIP4c2-SP19 (’Budget Process Amendment’), once every three months, all funds held in the Oracle Core Unit Operations Multisig in excess of three months worth of budget will be returned to the DAO (minus outstanding liabilities). Three months of budget being defined as 1/4 of the allotted annual budget rather than relative to the previous three months actual expenditures. Note that this exclusively applies to the Operational multisig. Fund management of the Emergency, Gas, and Gas Emergency multisigs are distinctly exempt and will be handled on a case by case basis.  Proposal Parameters This MIP40c3 subproposal provides the following options, fully described above, for ranked-choice voting:  A: Abstain B: Approve existing budget (2021-2022) (Business as usual) C: Approve proposed budget (2022-2023) (Reduced budget exempt from further cuts for 12 months) D: Reject budget    Related Materials  MIP39c2-SP12 Oracles Core Unit MIP MIP41c4-SP13 Facilitator Onboarding, Oracles Core Unit Proposal MIP40c3-SP15 Modify Oracle Core Unit Budget Proposal MIP40c3-SP45 Modify Core Unit Budget, ORA-001 (Oracle Gas Costs) Oracle Core Unit Launch Pad Session  ",
                    "links": [
                        "https://makeroracles.xyz/",
                        "https://gnosis-safe.io/app/eth:0x2d09B7b95f3F312ba6dDfB77bA6971786c5b50Cf/balances",
                        "https://gnosis-safe.io/app/eth:0x53CCAA8E3beF14254041500aCC3f1D4edb5B6D24/balances",
                        "https://gnosis-safe.io/app/eth:0x2B6180b413511ce6e3DA967Ec503b2Cc19B78Db6/balances",
                        "https://gnosis-safe.io/app/eth:0x1A5B692029b157df517b7d21a32c8490b8692b0f/balances",
                        "https://forum.makerdao.com/t/mip39c2-sp12-adding-oracles-core-unit/8048",
                        "https://forum.makerdao.com/t/mip41c4-sp13-facilitator-onboarding-oracles-core-unit/8046",
                        "https://forum.makerdao.com/t/mip40c3-sp15-modify-oracles-core-unit-budget/8047",
                        "https://forum.makerdao.com/t/mip40c3-sp45-modify-core-unit-budget-ora-001-oracle-gas-costs/11621",
                        "https://www.youtube.com/watch?v=niWT5wk2MNo",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/10",
                        "https://forum.makerdao.com/t/weekly-mips-update-100/17265",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/109",
                        "https://forum.makerdao.com/t/intangible-assets-as-public-goods-questions-for-oracle-core-unit/17254",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/13",
                        "https://forum.makerdao.com/t/relay-semanal-02-08-de-agosto-del-2022/17223",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/93",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-8-de-agosto-del-2022/17138",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/9",
                        "https://forum.makerdao.com/t/weekly-mips-update-99/17102",
                        "https://forum.makerdao.com/t/weekly-mips-update-98/16940",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-7-13-de-julio-del-2022/16740",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/5",
                        "https://forum.makerdao.com/t/governance-and-risk-198-thursday-july-07-at-17-00-utc/16370/3",
                        "https://forum.makerdao.com/t/cu-budget-reduction-initiatives-wiki-summary/16448",
                        "https://forum.makerdao.com/t/informal-poll-voluntary-budget-adjustment-in-exchange-for-1-year-guaranteed-budget/16445",
                        "https://forum.makerdao.com/t/mip40c3-sp88-techops-core-unit-dai-budget/19017",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/63",
                        "https://forum.makerdao.com/t/mip40c3-sp86-modify-techops-core-unit-dai-budget/18290",
                        "https://forum.makerdao.com/t/psa-oracle-core-unit-mkr-distribution/19030",
                        "https://forum.makerdao.com/t/off-chain-proposal-bounties-round-up-3/17860",
                        "https://forum.makerdao.com/t/weekly-mips-update-101/17392",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/42",
                        "https://forum.makerdao.com/t/blockchain-columbia-delegate-platform/15202/20",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191/22",
                        "https://forum.makerdao.com/t/relay-semanal-09-15-de-agosto-del-2022/17353",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/17",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806/12",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-15-de-agosto-del-2022/17293"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4224968434343435
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "2",
                    "time": "07/07/2022-06:07:28",
                    "content": "Thanks for voluntarily cutting the budget. And do understand that the current uncertainty is unfortunate but hopefully it’s resolved soon.     NikKunkel:  The Oracle Core Unit recognises the active discussions being had in the community around cutting costs. Therefore the Oracle Core Unit is proactively reducing its budget by 10%. There are however several parallel initiatives in the community for slashing core unit budgets. It is unclear at this point in time whether these cuts will target specific Core Units, specific initiatives, or just a universal haircut across all Core Units. The Oracle Core Unit needs to balance being a good citizen and proactively reducing its budget with the real risk that further cost cutting initiatives could place it in ‘double jeopardy’.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/07/2022-22:53:50",
                    "content": "    NikKunkel:  Therefore, the Oracle Core Unit is adding the clause to this budget renewal that should the proposed reduced budget be approved that the Oracle Core Unit is exempt from further budget reductions for 12 months   How would you expect this provision to be enforced? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#4",
                    "likes": "8",
                    "time": "12/07/2022-19:02:36",
                    "content": "    NikKunkel:  Current Balance: 1,253,473.75* (DAI) Unclaimed vested funds from previous budget: 2,216,771 (DAI)   I don’t envision this as a big problem. The DAO has a reputation to uphold that it will honor its commitments. If it starts to infringe on its commitments, it will not be able to make credible promises in the future. There is a tangible cost to the DAO that is manifested in different ways:  a Core Unit that is needed doesn’t get formed because the Core Unit members don’t trust the DAO Core Units struggle to hire key talent because they don’t have certainty that they won’t lose their job Core Units have to pay contributors more compensation to compensate for job security risk a partnership with a counterparty doesn’t happen because the counterparty doesn’t trust the DAO  ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-96/16688",
                        "https://forum.makerdao.com/t/weekly-mips-update-95/16504"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.685185185185185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#5",
                    "likes": "0",
                    "time": "12/07/2022-22:15:49",
                    "content": "    NikKunkel:  The DAO has a reputation to uphold that it will honor its commitments. If it starts to infringe on its commitments, it will not be able to make credible promises in the future.   It’s an interesting and important point as although DAO might not have a written legal contract, there can be a social contract or construct that can hold. Though I guess there can be also a way to send 1 year worth at once (which is controversial) or some technical aspect to keep streaming for a year. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.441666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SelenaPotter",
                    "index": "#6",
                    "likes": "0",
                    "time": "12/07/2022-23:38:27",
                    "content": "Hey, so is there any chance we’ll have a “second best” oracle that’s cheap enough to not offload smaller collateral types? Also, how is the oracle infrastructure updated? Is that governance only? And can the CU turn oracles on/off? If there are privileged actors, what mitigations do we take to lower rug risk or just simple bus risk? Paging @ChrisBlec since this seems like his kind of thing and maybe has better questions than me on the topic ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.388888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#8",
                    "likes": "5",
                    "time": "14/07/2022-08:50:11",
                    "content": "    SelenaPotter:  Hey, so is there any chance we’ll have a “second best” oracle that’s cheap enough to not offload smaller collateral types?   I think you’re misunderstanding that Oracles are the security (solvency) of your protocol. Your security is only as strong as your weakest link. You don’t outsource your security. Despite being a common practice in the industry, it serves as evidence of how poor risk management practices are. Other DeFi lenders just recently introduced debt ceilings to cap risk exposure, something Maker has had for 5 years. I suggest you familiarize yourself with the Rekt Leaderboard and take note of how many exploits were triggered via Oracles. Re smaller collateral types. Take a look at the Dune Dashboard which tracks Oracle costs. Over the past 2 weeks the average daily cost for ALL of Maker’s Oracles is $867. That is ~316k annually. Oracles are not the limiting factor for the profitability/viability of smaller collateral types. The engineering hours to onboard a small collateral type and the opportunity cost of working on more worthwhile initiatives are orders of magnitude more expensive than the lifetime revenue of a small collateral type. The Uniswap V2 LP collateral types that are currently being offboarded had annual stability fee revenue of less than $4000 each. There’s no path for Maker to generate any significant amount of revenue with small collateral types.     SelenaPotter:  Also, how is the oracle infrastructure updated? Is that governance only? And can the CU turn oracles on/off?   The Oracle Core Unit does not run any Oracle production infrastructure, its only responsibility is to write the software. When a new release of the Oracle software is ready, Feeds and Relayers are informed to update by the Oracle Core Unit. The Oracle Core Unit has no ability to turn the Oracles on/off. The Oracles were designed to be truly decentralized. All administrative permissions are controlled by Maker Governance.     SelenaPotter:  If there are privileged actors, what mitigations do we take to lower rug risk or just simple bus risk?   There are no privileged actors. ",
                    "links": [
                        "https://dune.com/madumas/Maker-Oracle-Costs?2.+Start+Date=2021-09-07+00%3A00%3A00&2.+Start+Date_d2ed0a=2022-07-01+00%3A00%3A00&2.+Start+Date_d0e447=2022-07-01+00%3A00%3A00&3.+End+Date_d60c40=2022-07-13+00%3A00%3A00&3.+End+Date_d8ab47=2022-07-13+00%3A00%3A00"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.297348484848485
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#9",
                    "likes": "0",
                    "time": "15/07/2022-11:44:31",
                    "content": "This post summarizes the main points of this subproposal from GovAlpha’s perspective:  This MIP40c3 subproposal proposes a new budget for the Oracles Core Unit (ORA-001). The proposed budget will run from 2022-07-01 until 2023-06-30. This end date is in line with the proposed budget windows detailed in MIP40 and will allow a follow-up budget to be ratified in the June 2023 governance cycle, to commence in July 2023. It falls within the grace period for new budget submissions detailed here, so it is eligible to enter the August Governance Cycle. Two options are presented for Maker Governance to choose between:  Business as usual: 5,061,125 DAI streamed over 12 months Reduced Budget: 4,554,575 DAI streamed over 12 months These will be submitted on-chain along with reject budget and Abstain as options.   The Reduced Budget would also exempt the Oracles Core Unit from future DAO-wide budget reductions - see below. The budget also details updates to the MKR vesting for the Oracles Core Unit that MKR holders approved in MIP40c3-SP15. At the end of the budget proposal, if no other budget has been proposed or approved, the budget will roll over with a new stream created via Executive Vote. This proposal has been assigned High-Impact based on the methodology listed here.   Further discussion While MIP40 specifies that the options for budget proposals should be increased budget; no change; reject; and abstain, GovAlpha feels that this budget that proposes no change and a reduced budget amount meets the spirit of the new budget framework and will allow it to proceed on-chain. GovAlpha thinks that asking the proposal author to propose an increased budget amount to meet the requirements of the new budget framework (MIP40) as written is counter-productive and not in keeping with the spirit of the MIP and that the MIP should be further clarified to account for this scenario. (pinging @strat-fin-core-unit in case they disagree with this interpretation) With regards to the reduced budget option - this exempts the Oracles Core Unit from DAO-wide budget reductions that Maker Governance may approve in the future. GovAlpha feels that this provision is clear and will not permit such proposals to enter an executive vote unless the Oracles Core Unit is exempted if this option is approved. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP40c3SP15",
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267",
                        "https://forum.makerdao.com/t/weekly-mips-update-97/16816",
                        "https://forum.makerdao.com/t/weekly-mips-update-96/16688"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.487807765151516
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#10",
                    "likes": "0",
                    "time": "18/07/2022-08:22:32",
                    "content": "3 posts were split to a new topic: Provision Clause (1 year) for CU Certainty ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#11",
                    "likes": "3",
                    "time": "01/08/2022-13:20:27",
                    "content": "I am submitting this MIP for Formal Submission for the August governance cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#12",
                    "likes": "0",
                    "time": "09/08/2022-15:36:14",
                    "content": "This proposal is currently being voted on. Its PR will run from 08/08 to 08/22. Please vote here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#13",
                    "likes": "1",
                    "time": "16/08/2022-09:55:25",
                    "content": "Thanks for this proposal, Nik! Love the proactive approach and sensible handling of budgets.     NikKunkel:  |Manual Repricing| yes   Any chance this could be amended to be more similar to “traditional” equity vestings? Something that leads to a lot of upside when the MKR appreciates and has not so much or not at all when it drops in price. Manual repricing has some incentive issues, which I’m sure you are aware of. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Llama",
                    "index": "#14",
                    "likes": "3",
                    "time": "21/08/2022-16:57:31",
                    "content": "    NikKunkel:  The Oracle Core Unit is building an Oracle as a Service product to create an Oracle business on behalf of the DAO. This Oracle business will bolster the reputation of MakerDAO as a secure and reliable high-value service provider, help subsidize the costs incurred by Oracles, and potentially generate profit. Oracles as a service can also be used as leverage for partnerships and integrations. For example, MakerDAO may be more willing to lend Dai to a secondary lender if they utilize Maker Oracles as it minimizes MakerDAO’s risk exposure to external Oracle providers.   This is a great initiative, and it would really help offset some of the costs and potentially become a self-sustaining / revenue-generating unit. Like AWS for Amazon, they built it because they needed it internally, and then it became their most profitable business unit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.068181818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#15",
                    "likes": "3",
                    "time": "28/10/2022-13:17:51",
                    "content": "Marc-Andre is no longer a member of Chronicle in its capacity as the Oracle Core Unit. Shortly he will be removed from all multi-sigs related to the Oracle Core Unit. Affected Multisigs Oracle Core Unit Operations multisig Oracle Core Unit Gas multisig Oracle Core Unit Gas Emergency multisig Substituting for Marc-Andre will be Rachel, the Operations Manager of Chronicle. Changes  Add (Rachel) - 0xE878Eb19646067103a80bef95E6729C12277C066  Remove (Marc-Andre) - 0xf63EfEE2A663b04cB5a09De6E3EB910d8442131D  Key Verification cast --to-ascii 0x54686973206b657920697320666f7220746865206f7065726174696f6e616c206d756c74697369672e0a0a52616368656c20426965720a323032322f31302f31380a31303a34333a3335 This key is for the operational multisig.  Rachel Bier 2022/10/18 10:43:35  \"address\": \"0xe878eb19646067103a80bef95e6729c12277c066\", \"msg\": \"0x54686973206b657920697320666f7220746865206f7065726174696f6e616c206d756c74697369672e0a0a52616368656c20426965720a323032322f31302f31380a31303a34333a3335\", \"sig\": \"a681b2c518e5a8684ce818dce4989d5d4478a65e8f99372a4c7667718a8618382a248d67bce5ba355b92de2c8b29f104dbc3acb44904a3aa4e6a569ee6ec178901\", \"version\": \"3\", \"signer\": \"ledger\"  cast wallet verify --address 0xE878Eb19646067103a80bef95E6729C12277C066 \"$(cast --to-ascii 0x54686973206b657920697320666f7220746865206f7065726174696f6e616c206d756c74697369672e0a0a52616368656c20426965720a323032322f31302f31380a31303a34333a3335)\" 0xa681b2c518e5a8684ce818dce4989d5d4478a65e8f99372a4c7667718a8618382a248d67bce5ba355b92de2c8b29f104dbc3acb44904a3aa4e6a569ee6ec178901 Validation success. Address 0xE878Eb19646067103a80bef95E6729C12277C066 signed this message.  Following successful transition of the multisigs, the multisig registry in the OP will be updated to reflect the changes. ",
                    "links": [
                        "https://gnosis-safe.io/app/eth:0x2B6180b413511ce6e3DA967Ec503b2Cc19B78Db6/balances",
                        "https://gnosis-safe.io/app/eth:0x1A5B692029b157df517b7d21a32c8490b8692b0f/balances"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#16",
                    "likes": "1",
                    "time": "28/10/2022-14:30:37",
                    "content": "@marcandu thank you for the many years of services to the DAO. Truly appreciate the hard work and dedication you provided to Maker. Wishing you the very best in all your future endeavors! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.510416666666666
                }
            ]
        }
    ],
    "group_index": "1383"
}