{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/weekly-relay-march-28-april-4-2022/14450",
            "title": "Weekly Relay: March 28 - April 4, 2022 ",
            "index": 14450,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "1",
                    "time": "05/04/2022-13:28:15",
                    "content": " 1727×390 306 KB  Hi everyone, thanks for checking out the Weekly Relay! Whether you hold MKR or DAI, own a vault, or want to get more involved in governance, this is your one-stop shop for MakerDAO updates.  The public PDF version is available here. Show some love to our Medium account     Current Events  Forum Upgrades: Forum Explorer & Impact Estimations With most public discussions of MakerDAO and its governance centered around our forums, forum management and ease of use are increasingly important, especially as the number of ecosystem participants and contributors grows. Two initiatives aim to make it easier to browse and search the forum and help forum-goers decide which governance items may be worth spending more time investigating.  Introducing Forum Explorer  The Forum Explorer is a Discourse plugin added to the forum by GovAlpha to make it easier to search through the forums using accessible filters and custom queries.  Main Features  Forum admins can create custom queries complete with titles and descriptions. This enables us to surface key forum content more effectively than the default tools. Users can apply tag and category filters using the sidebar at the left, allowing more natural exploration and discoverability of relevant content. Users can search/filter boxes for posts, tags, and categories within this UI to further aid navigation to relevant content.  Here at GovComms, we make heavy use of Forum Explorer every time we put together one of these publications.  Introducing Impact Estimations  Last week, GovAlpha announced that they are investigating applying impact estimations to active MIPs and Signal Requests. In an impact estimation, a GovAlpha team member will assign a value—Likely Low Impact, Likely Medium Impact, Likely High Impact—to each new governance item posted to the forum. These estimations aim to give forum users a sense of how important and impactful new governance items are likely to be and help readers decide how much time to spend engaging with each one.  More Details About Impact Estimation Values  Likely High Impact  Anything that adds concretely identifiable risk to the Maker Protocol Anything the DAO is doing for the first time Anything that removes a non-trivial amount of money from the surplus buffer Core Unit onboarding and offboarding Anything that permanently changes governance processes or structures within MakerDAO  Likely Medium-Impact  Items that may lead to later decisions that add risk or deplete the surplus buffer Anything that removes a trivial amount of money from the surplus buffer  Likely Low Impact  Minor wording changes and/or fixes to existing MIPs    Look for impact tags on forum posts about RFC MIPs and Signal Requests. They will also be included in the governance tracker spreadsheet.   This Week in Governance  Maker Improvement Proposals (MIPs) Weekly MIPs Update #81 by @blimpa  952×714 28 KB  Two Short Ratification Polls (three-day polls for proposals that enter the Weekly Cycle) went up on March 28 and closed on March 31. Both proposals passed—the MIP62 amendments have been merged. The SPF disbursement will go into an executive as soon as the multisig details have been sorted out.  As per MIP4c3, MIP4c3-SP3: Amend MIP64 to Allow More Flexibility in Scope is a weekly-cycle sub proposal that requires a Signal Request passing with at least 51% before being promoted on-chain. That Signal Request is now live and will run for one week. Please go vote!   The April Formal Submission Window is now open and will remain so until EOD Wednesday 6. This is relevant for proposals that enter the Monthly Governance Cycle and have fulfilled their Feedback Period and complied with their Frozen Period—and are eligible to enter the April cycle.    RFC and FS Dates for reference and existing proposals can be seen on this proposal tracker (WIP). If you have any questions about the voting process at MakerDAO, the Practical Guide to Voting will be useful.    Executive Vote Core Unit Budget Distributions and Vesting Streams Setup, Gelato Keeper Network Budget Stream Setup This executive proposal passed, and the following changes occurred within the Maker Protocol:  Core Unit Budget Transfers As per multiple successful budget proposals, 2,433,452.30 DAI was transferred to multiple Core Units. More Information:     Core Unit Amount Budget Proposal     GovAlpha 30,000 DAI Proposal   Immunefi Security 348,452.30 DAI Proposal   Real World Finance 2,055,000 DAI Proposal      Core Unit Budget Streams As per multiple successful budget proposals, 7,945,149.90 DAI was streamed to multiple Core Units. More Information: | Core Unit | Amount | Budget Proposal | | GovAlpha | 1,079,793 DAI | Proposal | | Immunefi Security | 700,356.90 DAI | Proposal | | Real World Finance | 6,165,000 DAI | Proposal | The existing DAI budget stream for Real-World Finance Core Unit will be revoked.   Core Unit MKR Vesting Streams As per their successful MKR budget proposal, a total of 167.64 MKR was vested to members of the GovAlpha Core Unit (GOV-001), as itemized below. More Information:     Person/Core Unit Amount Start End     LongForWisdom 73.70 MKR 2022-02-08 2023-02-08   prose11 52.74 MKR 2022-02-08 2023-02-08   GovAlpha Multisig 41.20 MKR 2022-02-08 2023-02-08      Retroactive MKR Compensation for LongForWisdom As per GovAlpha Core Unit’s (GOV-001) successful MKR budget proposal, a total of 60 MKR was transferred to Facilitator LongForWisdom at 0xC818Ae5f27B76b4902468C6B02Fd7a089F12c07b.  Gelato Keeper Network DAI Budget Stream As per the ratified MIP63c4-SP3: Onboard Keeper Network - Gelato Network, further clarified in this forum post, a total of 183,000 DAI was streamed to Gelato Keeper Network. More Information: 183,000 DAI was streamed to Gelato Keeper Network at 0x926c21602fec84d6d0fa6450b40edba595b5c6e4 starting on 2022-04-01 and ending on 2022-09-30 at a rate of 1,000 DAI/day.   Active Governance Polls     Poll Name Discussion     Launch Maker Wormhole With Optimism and Arbitrum Domains Discussion   PPG - Open Market Committee Proposal Discussion    Check out March 28th’s issue of Weekly Relay for more information on the most recently concluded polls.  Community Greenlight Polls There were no active community greenlight polls for the week of March 29 - April 4, 2022. Check out an “at-a-glance” view of the current Vault types and their parameters on MakerBurn.  Active Signal Requests [Signal Request] Onboard PAXG Sebastien from the Strategic Finance Core Unit revisits the topic and attempts to push PAXG to be onboarded. More Information: All risk assesments have been submitted during 2020:  [PAXG] ERC20 Token Smart Contract Domain Community Assessment [PAXG] Collateral Onboarding Oracle Assessment (MIP10c3-SP16) [PAXG] Collateral Onboarding Risk Evaluation  Additionally, PAXG was previously approved for onboarding through a governance poll. Today, both market cap and liquidity for PAXG have significantly increased, and the Uni V2 poll, although small, is handling 2M of hourly volume and 50M daily. Parameters proposed for PAXG are a Debt Ceiling of 5M, a Liquidation Ratio of 125% (which may be instead set to 130%), and a Stability Fee of 4% that may also be altered based on current situations. Sebastien provides the pros and cons of onboarding PAXG and concludes the signal request by asking the community whether they want to onboard PAXG as a collateral type in Maker’s MCD? Vote will run until April 5, 2022.  Here are the current voting results:  1677×995 137 KB   Advance “MIP4c3SP3: Amend MIP64 to allow more flexibility in scope” to on-chain poll @psychonaut submits a signal request to push MIP4c3-SP3 as an on-chain poll. Vote will run until April 12, 2022. Here are the current voting results:  1745×590 72.3 KB     Community Deep Dai-ve  Tweet of the Week   twitter.com    korpi @korpi87  There are examples of overcollateralized stablecoins that are below the peg for some longer period but it's not because of their low liquidity but low utility in DeFi. DAI as the first DeFi stablecoin has been used in many projects and this risk is extremely low.  DAI won't die.   10:57 PM - 2 Apr 2022           34                1             Forum Insight Penn Blockchain Delegate Platform Penn Blockchain, a student-run blockchain organization at The University of Pennsylvania, has officially published its delegate platform to the forum. Penn Blockchain hopes to use its wide-ranging experience in crypto governance to help Maker make the best decisions for our protocol. Members are involved in governance initiatives for several popular protocols they have delegations for, including Aave, Compound, Uniswap, and DyDx. Proposal author @juanbug is currently working with us internally to investigate on-chain strategies for increasing treasury and liquidity for Dai. Core Values  Broadcast Maker to not only Penn but also the greater university community Help Maker through its Layer-2 and cross-network integrations Advise and support Maker with treasury management initiatives Educate and teach students about the Maker project, expand its connections with university teams, and provide opportunities for future collaboration  [Discussion] Rethinking budgeting for CUs Core Unit budgeting has been a hot topic on the forums in recent weeks. The latest addition to the discussion comes from Recognized Delegate Justin Case, who analyzes the topic into its parts and explores which parts may be most valuable to focus on. @JustinCase begins by identifying the different elements any budget process must balance:  Ease of comparing different budgets to each other Governance overhead of evaluating a growing number of budgets The ability to make meaningful changes to a budget vs. the need to avoid micromanagement and respect CU autonomy The need for oversight vs. work demand on reporting and evaluation The risk of providing CUs with too many funds that remain unused and unreturned vs. keeping efficient operations and the need for frequent additional budget requests Over- or underutilization of a given core unit given their budget, especially for core units that primarily serve other core units  Next, Case focuses on two areas where improvement can encourage better budget discipline and help ensure resources are spent on more valuable initiatives. Indirect Financing Indirectly financing some Core Units—meaning they will not receive a direct budget but will be funded on an as-needed basis—will help ensure that only the community’s services are funded. Competition Next, Case describes an interesting idea for introducing natural competition to exert downward pressure on budget proposals. By adding redundancy to the organization of Core Units, namely by establishing parallel CUs in the same field while also ensuring that neither CU can monopolize all the work, CUs will compete to provide the best services to the DAO at the lowest cost. Like any proposal, this one comes with its advantages and disadvantages. Pros  Greater focus on objectives as they are now set at the protocol level. Increased cost control because Core Units will have to be attractive to win bids for work. Better redundancy because other Core Units can step up and replace others if they cease to function. Less focus on micromanaging Core Units and detailed budget proposals. Increased Core Unit autonomy.  Cons  Increased governance overhead in designing objectives. With individual Core Units reduced in size, they may be less capable of independently moving the protocol forward. Less security for Core Units may lead to detachment from the protocol.  Discussion on this topic is already heating up. Share your input here.   Meetings and Events  Last Week’s Call Recordings  Governance and Risk | Ep. 184   Video | Summary | Forum    Issue Discussion Call # 5 | Budget Modification Process   Video | Summary | Forum      Upcoming Calls  Governance & Risk   Join Link | Agenda - Thursdays at 17:00 UTC   Core Unit Office Hours   Join Link | GovAlpha Governance Q&As - Mondays 17:00 UTC  Join Link | Immunefi Security - Tuesdays 00:00 UTC  Join Link | Protocol Engineering - Tuesdays 15:00 UTC  Join Link | Sustainable Ecosystem Scaling - Tuesdays 15:30 UTC  Join Link | Growth - Wednesdays 17:00 UTC  Join Link | Real World Finance - Wednesdays 17:00 UTC  Join Link | Governance Communications - Fridays 18:00 UTC    Useful Links Forum and Maker Chat Discuss and debate MakerDAO. Call Calender | Votes & Event Calendar Subscribe to both for all public calls, votes, and other reminders. Participation Tools Library of useful links for stakeholders: protocol analytics, DAI analytics, collateral & liquidation metrics, governance history, and auctions data. Governance Portal Voting dashboard for MKR voters. MIPs Portal MIPs dashboard for everyone. Learning Portal and Technical Documentation Learn more about the Maker protocol.   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only.  Credit @Artem_Gordon @nothsa ",
                    "links": [
                        "https://medium.com/@MkrGovComms",
                        "https://forum.makerdao.com/t/introducing-forum-explorer/14384",
                        "https://forum.makerdao.com/explorer",
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://forum.makerdao.com/t/weekly-mips-update-81/14443",
                        "https://github.com/makerdao/mips/pull/487/files",
                        "https://forum.makerdao.com/t/mip55c3-sp3-ethamsterdam-event-spf/13781/72",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://manual.makerdao.com/governance/voting-in-makerdao/practical-guide-voting",
                        "https://vote.makerdao.com/executive/template-executive-vote-core-unit-budget-distributions-and-vesting-streams-setup-gelato-keeper-network-budget-stream-setup-april-1-2022#proposal-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP3",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP24",
                        "https://mips.makerdao.com/mips/details/MIP4c2SP17",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP61",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP3",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP24",
                        "https://mips.makerdao.com/mips/details/MIP4c2SP17",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP61",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP60",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP3",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP3",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP60",
                        "https://etherscan.io/address/0xC818Ae5f27B76b4902468C6B02Fd7a089F12c07b",
                        "https://mips.makerdao.com/mips/details/MIP63c4SP3",
                        "https://forum.makerdao.com/t/mip63c4-sp3-gelato-network-clarification/14340",
                        "https://etherscan.io/address/0x926c21602fec84d6d0fa6450b40edba595b5c6e4",
                        "https://vote.makerdao.com/polling/Qmbzzbna#poll-detail",
                        "https://forum.makerdao.com/t/request-to-poll-for-maker-wormhole-deployment-and-associated-risk-parameters/14209",
                        "https://vote.makerdao.com/polling/QmdS8mCx#poll-detail",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-31-march-2022/14347",
                        "https://forum.makerdao.com/t/weekly-relay-march-22-28-2022/14300",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-onboard-paxg/13768",
                        "https://forum.makerdao.com/t/paxg-erc20-token-smart-contract-domain-community-assessment/3443",
                        "https://forum.makerdao.com/t/paxg-collateral-onboarding-oracle-assessment-mip10c3-sp16/5376",
                        "https://forum.makerdao.com/t/paxg-collateral-onboarding-risk-evaluation/4833",
                        "https://vote.makerdao.com/polling/QmYwY5gP",
                        "https://forum.makerdao.com/t/advance-mip4c3sp3-amend-mip64-to-allow-more-flexibility-in-scope-to-on-chain-poll/14435",
                        "https://forum.makerdao.com/t/mip4c3sp3-amend-mip64-to-allow-more-flexibility-in-scope/14200",
                        "https://twitter.com/korpi87/status/1510390940166500352?s=20&t=6eMtn9893taRERUuRgpb_A",
                        "https://twitter.com/korpi87/status/1510390940166500352?s=20&t=6eMtn9893taRERUuRgpb_A",
                        "https://twitter.com/korpi87/status/1510390940166500352?s=20&t=6eMtn9893taRERUuRgpb_A",
                        "https://twitter.com/korpi87/status/1510390940166500352?s=20&t=6eMtn9893taRERUuRgpb_A",
                        "https://forum.makerdao.com/t/penn-blockchain-delegate-platform/14419",
                        "http://pennblockchain.com/",
                        "https://forum.makerdao.com/t/discussion-rethinking-budgeting-for-cus/14410",
                        "https://forum.makerdao.com/t/discussion-rethinking-budgeting-for-cus/14410",
                        "https://youtu.be/P9DBZ5sXwcI",
                        "https://medium.com/@MkrGovComms/makerdao-governance-mips-forums-and-steth-market-share-strategy-9a5983e3b95c",
                        "https://forum.makerdao.com/t/governance-and-risk-184-thursday-march-31-17-00-utc/14314",
                        "https://youtu.be/1UE98EVrk2I",
                        "https://medium.com/@MkrGovComms/makerdao-budget-modification-process-discussion-b259784c5468",
                        "https://forum.makerdao.com/t/issue-discussion-call-5-budget-modification-process/14226",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com",
                        "https://chat.makerdao.com",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/relay-semanal-28-de-marzo-4-de-abril-de-2022/14495",
                        "https://forum.makerdao.com/t/weekly-relay-april-5-11-2022/14590",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-april-2022/15012"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.907834408777805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "19/04/2022-13:28:42",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}