{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-reflections-optimism-and-maker/14957",
            "title": "Governance Reflections: Optimism and Maker \\xf0\\x9f\\x94\\xb4 ",
            "index": 14957,
            "category": [
                "Governance"
            ],
            "tags": [
                "discussion",
                "optimism",
                "longform"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#1",
                    "likes": "12",
                    "time": "04/05/2022-10:59:55",
                    "content": " What Can Maker Learn/Borrow From Optimism’s New Governance Model?   I am a technology lawyer and academic who has been in and around DeFi since 2020. My specific research interest is decentralised governance, and in that vein, Optimism’s announcement last week represents a pretty fascinating new experiment in how a decentralised protocol might be managed. Optimism and MakerDAO are obviously very different kinds of projects, with different goals, but I think that the Optimism model is still worth examining with an eye to what we might learn or borrow to improve Maker governance. I’ve set out a few thoughts below. NB - I have no insider knowledge or financial stake in Optimism (I didn’t even qualify for the airdrop!)  tl;dr   Optimism dropped its token (OP) last week, and announced a new governance model   Optimism will be governed by two co-equal chambers: the Token House and the Citizens’ House. The latter is comprised of soulbound (non-transferrable) NFT-holding ‘citizens’ who cast votes of equal weight   Maker could borrow some of Optimism’s thinking around building a more democratic system for governance. For instance, Maker has an informal ‘citizen’ model for some governance processes already (see: signal votes). Why not formalise this, maybe with our own soulbound NFTs?   Optimism also offers some exciting ideas for incentivising positive contributions to the community, like retroactive funding. We could trial something similar at Maker - perhaps supplementing SourceCred with retroactive funding for particularly useful governance contributions    Reflections on Optimism’s Governance Vision You have almost certainly already heard that Optimism announced an airdrop of its new OP token. However, it also set out its plan to decentralise governance of the Optimism protocol. This is a big deal for a few reasons: first, Optimism is one of the leading L2 networks. Second, the Optimism team has pushed the boat out - this isn’t a typical road map for decentralisation. Optimism are envisaging a governance structure of two “co-equal chambers” - a Token House and a Citizens’ House:  The upcoming Airdrop #1 establishes the Token House by distributing OP to thousands of addresses that have engaged in positive-sum, community-oriented behavior. Token holders will be able to vote on the distribution of project incentives as a part of a Governance Fund, protocol upgrades, and more.  There isn’t too much to see here: this is a standard coin voting governance system, likely to turn into a plutocracy of OP whales. The implicit promise of Optimism’s announcement is that the Token House will represent the mercurial self-interest of the Optimism community - who want the network to keep running, for incentives to flow, and (probably) for the OP price to appreciate.  Next, the Collective will establish a Citizens’ House to facilitate and govern a process to distribute retroactive public goods funding. Citizenship will be conferred by “soulbound” non-transferrable NFTs, and the set of citizens will grow over time.  On the other hand, the Citizens’ House is something else entirely. My reading of Optimism’s proposal is that Citizens’ House will be governed on a ‘one person, one vote’ basis. It is a little vague what exactly the Citizens’ House will be responsible for at this stage, beyond deciding how retroactive funding should be distributed. However, if the Citizens’ House is truly meant to be a coequal ‘branch’, I assume it will receive other key governance responsibilities.  image2000×1000 137 KB  Optimism’s delineated model is explicitly aiming to balance short-term incentives with long-term vision. This is a perennial challenge for any successful protocol - I think this recent discussion in the Maker forum captures this dynamic perfectly. Of course, we don’t know the extent to which Optimism’s model will actually work or not, and that might not be apparent for several years. That said, I think the Optimism vision has two notable features:   It envisages a more democratic system of governance. Plutocratic governance by the token-rich has its problems. Providing more opportunities for all community members to have a meaningful say in governance, like through a Citizens’ House, is a great thing, and in an ideal world stands DeFi apart from TradFi. MakerDAO already does this informally at points, like with signal votes, and Optimism has taken this to a logical conclusion with its more formal ‘citizenry’.   It explicitly incentivises community contributions (Optimism calls this the ‘impact = profit’ axiom). Undoubtedly with an eye to its market share and a desire to bootstrap its ecosystem, Optimism is setting up a series of mechanisms to encourage contributions from its wider community. Again, Maker is doing this already  (eg, SourceCred). However, Optimism have some additional cool ideas for building up a community and ecosystem that we could look at. I like retroactive funding in particular - and that doesn’t have to be for Ethereum-wide public goods, per se. We could use it as an additional mechanism to promote good governance at Maker.    Optimism-Inspired Ideas For Maker Governance As stated (not least by the Optimism team), Maker is already doing a lot of things right when it comes to decentralised governance. However, Optimism has injected some exciting thinking into the space, particularly through their conception of citizenship, and use of new reward mechanisms. Maker could borrow some of the more interesting ideas for use in our own governance:   Soulbound NFTs for Maker community members. This could help promote participation in the Maker system and provide signal voters with something a bit more tangible than a forum record to prove their involvement with Maker. It might also help formalise the key idea that the whole community matters at Maker, not just token whales/delegates/CU.   Retroactive funding to support the Maker ecosystem. There are a variety of ways in which Maker could use retroactive funding. One starting point could be an annual vote to reward community members/delegates that have provided the most value to Maker governance over the preceding year. Sometimes it is only clear with the benefit of hindsight which contributions have been particularly important to the protocol, and in this way retroactive funding could complement the week-to-week SourceCred.   For my part, I’m really excited to see how these different experiments in decentralised governance continue to evolve. Feel free to reach out if you want to chat about some of these governance issues, and it would be great to read any other thoughts on Optimism’s governance and Maker. ",
                    "links": [
                        "https://community.optimism.io/docs/governance/",
                        "https://vitalik.ca/general/2022/01/26/soulbound.html",
                        "https://community.optimism.io/docs/governance/",
                        "https://vitalik.ca/general/2022/01/26/soulbound.html",
                        "https://en.wikipedia.org/wiki/One_man,_one_vote",
                        "https://forum.makerdao.com/t/signal-request-restart-the-burn-v2/14918/41",
                        "https://vitalik.ca/general/2021/08/16/voting3.html",
                        "http://podcast.banklesshq.com/introducing-the-optimism-collective-op-airdrop-1",
                        "https://forum.makerdao.com/t/governance-and-risk-189-thursday-may-05-17-00-utc/14965/2",
                        "https://forum.makerdao.com/t/the-endgame-plan-parts-1-2/15456/34",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-28-may-4-2022/14981"
                    ],
                    "GPT-summary": "The author, a technology lawyer and academic, discusses Optimism's new governance model and how it could be applied to improve Maker governance. The author explains the two co-equal chambers of governance in Optimism, the Token House and the Citizens' House, and suggests that Maker could formalize its informal 'citizen' model with soulbound NFTs. The author also suggests that Maker could trial retroactive funding for particularly useful governance contributions. The author concludes by expressing excitement about the experiments in decentralized governance and inviting others to share their thoughts.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 6.040485739750445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "7",
                    "time": "04/05/2022-11:38:21",
                    "content": "Appreciate the post, I wasn’t aware that anyone was going down the Soulbound NFT route. I’ll have to take a closer look at the Optimism stuff when I get a moment. Soulbound NFT for voting idea isn’t super new, it’s an option I’ve been aware of for some time. It’s been a while since I’ve thought about it. If I remember correctly, these were the outstanding points that had occurred to me. #1 - Division of Governance Responsibility between houses It’s not immediately clear how to divide formal governance responsibilities between a token house and a citizens house. Do this wrong or badly and you end up with either one of the houses being meaningless, or the houses deadlocked such that no progress can be made. Take Maker, and imagine that we’ve revamped the executive system such that citizen and token houses are both able to vote on executives. You have a few options here:  Require approval in both houses separately. Require approval in both houses combined (how do you equate a citizen vote versus a token-weight vote?) Have one house’s votes be meaningless.  None of those are great options, so, well, lets try something else. In traditional governments, different houses have different responsibilities and powers. So say instead that you specialize, and give the houses different responsibilities, how do you decide who is responsible for what? Can you divide responsibilities such that the houses are balanced in power? Should you? In an ideal world you take advantage of the benefits of each structure.  Token-weighted structures are sybil-proof and have built in financial incentives. Democratic structures allow for more diverse opinion and discussion, as well as appealing on the level of fairness.  But how to do this in such a way that leverages the advantages of each structure while mitigating the downsides, rather than the reverse? #2 - Issuance and Maintenance of Citizenship Someone needs to determine who gets a soulbound NFT, and who doesn’t. Any clear and publicly known criteria  will be abused via sybil behavior. Furthermore (in Maker), the Token House initially needs to consent to the creation of a meaningful Citizen’s House, which involves giving up some amount of its control of the Maker Protocol. How large is the Citizen House? How large should it be? Why?  I hadn’t really come to any firm conclusion from the above. But the key thought that runs around in my mind is: “What problem are we trying to solve?” - I think without having a clear idea of what we’re trying to achieve, adding a second house is too much risk, without any clear reward. In general you don’t want to add complexity to a system unless it’s absolutely necessary to meet its requirements. I don’t have a huge amount to say re: retroactive funding. Feels like less of a governance issue to me, and more of an operational decision. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.502831106091976
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#3",
                    "likes": "1",
                    "time": "04/05/2022-11:56:50",
                    "content": "This is really good post with great info. This is a good way to start a discussion and gather community feedback. I love NFTs. Whenever I see posts incorporating NFTs it peaks my attention. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 8.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/05/2022-12:54:52",
                    "content": "This DAO is building relationship Graphs… They have a hackathon in 30 days and are open to challenges. If anyone is interested I’m happy to make an introduction. Emblem - Decentralized Reputation (emblemdao.com) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#5",
                    "likes": "14",
                    "time": "04/05/2022-18:28:22",
                    "content": "Hi All, For those who don’t know me, I’m Brian Avello, the former General Counsel for the Maker Foundation and now a director with the Optimism Foundation. More than happy to be a resource for our community here on the governance goings on with Optimism, or provide any assistance to people wanting to get involved with Optimism more generally. Just put your request here or DM me. And stay Optimistic! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.59375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#6",
                    "likes": "0",
                    "time": "05/05/2022-00:08:42",
                    "content": "Got any good legal issues brewing over there at Optimism ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#7",
                    "likes": "2",
                    "time": "05/05/2022-02:35:38",
                    "content": "Well, I’d say the most interesting will be the small “c” constitutional issues that arise out out the bicameral Token House v. Citizen House approach. The skeletal Optimism Collective constitution is being worked on now, so if you’d like to see and/or comment on it, you can find it here: Working Constitution of the Optimism Collective - Optimism Collective. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#8",
                    "likes": "0",
                    "time": "05/05/2022-03:16:32",
                    "content": "    Bri174:  Well, I’d say the most interesting will be the small “c” constitutional issues that arise out out the bicameral Token House v. Citizen House approach. The skeletal Optimism Collective constitution is being worked on now, so if you’d like to see and/or comment on it, you can find it here: Working Constitution of the Optimism Collective - Optimism Collective .   This is fascinating - thanks for the link and for your offer above @Bri174. It makes sense that the key constitutional dilemma is how to balance power between the Token House and the Citizen House. As @LongForWisdom has already pointed out, there is a tightrope to be walked. You don’t want a single house to be too powerful and render the other pointless, but it would also be a disaster to have a ‘vetocracy’ where the houses are of equal power and the protocol can grind to a halt in the event of disagreement or polarisation. The political scholar Francis Fukuyama is good to read on the dangers of a vetocracy - the prospect is particularly dangerous in a fast-moving space like crypto. An oft-repeated phrase over the last few years has been that DeFi is ‘speedrunning the history of finance’, but DAOs are on their own speedrun: politics, governance and constitutional design! Looking around the space, it’s hard to deny that Maker and Optimism are ahead of that particular curve. ",
                    "links": [
                        "https://www.sfchronicle.com/opinion/article/A-few-steps-to-overcome-American-vetocracy-9222920.php?t=d9ced31d94&cmpid=twitter-premium"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.507142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#9",
                    "likes": "1",
                    "time": "05/05/2022-11:05:53",
                    "content": "This is interesting, thanks for posting the link. Maybe it’s just the lawyer in me (and political science major) but I do find it exciting when I see new ways of governance being formulated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.999053030303029
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#10",
                    "likes": "0",
                    "time": "05/05/2022-15:07:15",
                    "content": "Excellent, thanks for sharing this may be a new precedent in gonernances  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.2272727272727275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#11",
                    "likes": "0",
                    "time": "04/08/2022-21:07:17",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}