{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/updated-govalpha-administered-multisig/15601",
            "title": "Updated GovAlpha Administered Multisig ",
            "index": 15601,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "multi-sig",
                "gov-001",
                "multisig-rec"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "4",
                    "time": "03/06/2022-22:22:06",
                    "content": " Updated GovAlpha Multisig As per MIP47, GovAlpha is posting an update to our Multisig. Most information is the same, the notable difference being that @LongForWisdom 's signing address has been replaced with @Patrick_J’s. Here is the transaction adding @Patrick_J and here is the transaction removing @LongForWisdom. Besides that, and transfering the point of contact to @prose11, all other aspects of the GovAlpha Multisig remain the same. A ledger spreadsheet for all our transactions is available here, and tends to accurate within a day of the most recent transactions. Multi-sig Address: 0x01D26f8c5cC009868A4BF66E268c17B057fF7A73 Keyholders:   @prose11 : 0xf3ED2bdeBa77940E6759B806cd55CE20cAE369BE  @Patrick_J : 0x06ADa798f9323392cA30C755383Af879bd853168  Per MIP47c1:   Governance must be able to revoke funding and permissions from approved multi-sigs at any time.   You can check the spending limit section here. The DSPauseProxy Contract is allowed up to 1B DAI.   Signatory requirements providing no less than ⅔ of listed signatories to sign off on an action.   It’s a 2 of 2 mult-sig currently, with @prose11 and @Patrick_J  as keyholders.  All signers must be tagged on the forum and their willingness to be included in the Multi-Sig publicly confirmed.  Confirmed.  A representative for the Multi-Sig must be designated as an official point of contact.  @prose11  is the primary contact.  There must be a clear and public explanation of the purpose and scope of the Multi-Sig.  Administering funds designated by Maker Governance to be spent to achieve the GovAlpha Core Unit mandate.  A clearly defined process for onboarding and offboarding signatories.  Facilitators of GovAlpha will be added as keyholders to this multi-sig. Signatory requirements will be adjusted as necessary to maintain 2/3rd signers wherever possible. In certain circumstances members of GovAlpha may be added as keyholders at the existing facilitators discretion to maintain an adequate level of security for administered funds.   A wallet address to be whitelisted.   0x01D26f8c5cC009868A4BF66E268c17B057fF7A73  Following an approved Governance action that involves a newly recognized Multi-Sig, the information provided will be added to a list of recognized Multi-Sig Wallets.  @MIP-Editors update the MIP47 list when appropriate. ",
                    "links": [
                        "https://etherscan.io/tx/0x1bb49b5aac9971d6bb7c4e819ae5b65270b3a2a8322316d6e782259b6261d37b",
                        "https://docs.google.com/spreadsheets/d/1IhTFGRh3NGL3Kp6TXj035T-898zHBSc2epEZGOPAF2k/edit#gid=934247838",
                        "https://gnosis-safe.io/app/#/safes/0x01D26f8c5cC009868A4BF66E268c17B057fF7A73/balances",
                        "https://mips.makerdao.com/mips/details/MIP47",
                        "https://gnosis-safe.io/app/#/safes/0x01D26f8c5cC009868A4BF66E268c17B057fF7A73/settings",
                        "https://etherscan.io/address/0xBE8E3e3618f7474F8cB1d074A26afFef007E98FB",
                        "https://gnosis-safe.io/app/#/safes/0x01D26f8c5cC009868A4BF66E268c17B057fF7A73/balances",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2022-06-03/15600",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-02-08-2022/15703"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.971842145949289
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#2",
                    "likes": "1",
                    "time": "04/06/2022-13:12:25",
                    "content": "    prose11:  @Patrick_J : 0x06ADa798f9323392cA30C755383Af879bd853168   I confirm I am the owner of this address. Verification. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "02/09/2022-13:12:27",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}