{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ama-proposing-the-maker-portfolio-core-unit-with-chris-cameron/9062",
            "title": "[AMA] Proposing The Maker Portfolio Core Unit with Chris Cameron ",
            "index": 9062,
            "category": [
                "Core Units",
                "Core Unit Archive"
            ],
            "tags": [
                "public-call",
                "archive-mkt-001",
                "pubcall-:-ama"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#1",
                    "likes": "4",
                    "time": "30/06/2021-22:26:54",
                    "content": " PromoFix1002×720 802 KB  @PaperImperium’s proposing a new Core Unit “to build a portfolio of publicly traded, real-world financial assets that the Maker Protocol can be exposed to.” Join Chris on Zoom 2021-07-02T15:00:00Z  to learn more about the proposal and ask any questions you may have. See you there!  Links Proposal Budget Facilitator Onboarding ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp16-adding-maker-portfolio-core-unit-mpcu-001/8996",
                        "https://forum.makerdao.com/t/mip40c3-sp22-modify-maker-portfolio-core-unit-budget/8998",
                        "https://forum.makerdao.com/t/mip41c4-sp17-facilitator-onboarding-maker-portfolio-core-unit/8997",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-25-july-1/9079",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-148-thursday-july-1-17-00-utc/9036/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.951704545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#2",
                    "likes": "1",
                    "time": "01/07/2021-20:32:08",
                    "content": "You can also submit Anon questions in our submission box https://app.suggestionox.com/r/ContentAMA ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-52/9191",
                        "https://forum.makerdao.com/t/maker-relay-ep-52-en-espanol/9209"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "1",
                    "time": "02/07/2021-17:15:57",
                    "content": "Man I totally missed this! Was it announced on the Rocket Chat? Usually when I get a @ Here notification that gets my attention more than anything… Can you please post the recording here? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#4",
                    "likes": "0",
                    "time": "02/07/2021-18:36:42",
                    "content": "This proposal sits at the intersection of profits, charity, PR, lobbying, and peg management. It’s tough to go in-depth on all the complex implications of such a simple mechanism, so if anyone has a specific question that wasn’t covered, my RC or forum inbox is always open. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.425925925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#5",
                    "likes": "1",
                    "time": "03/07/2021-00:26:34",
                    "content": "It’s now up for watching/listening on the youtube!      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brettlyons",
                    "index": "#6",
                    "likes": "0",
                    "time": "03/07/2021-04:12:45",
                    "content": "I don’t fully understand how a final distribution is made to charity.  When the treasury notes mature, does the principal repayment go to charity, or does it go to buy back the DAI that was minted to purchase the assets?  Also, do the coupon payments that are income to the trust flow back to MKR holders? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "1",
                    "time": "03/07/2021-11:45:28",
                    "content": "    brettlyons:  When the treasury notes mature, does the principal repayment go to charity, or does it go to buy back the DAI that was minted to purchase the assets? Also, do the coupon payments that are income to the trust flow back to MKR holders?   Great question! The trust will not have much in the way of assets at the beginning, so yes, the principal at maturity will be used to close out the vault debt. In the interim, the interest payments (semi-annual for most Treasury obligations) will go to Maker in the amount to account for the SF. If the bond pays 1.4%, for instance, and Maker is supposed to get 1.1%, then the amount needed to pay the vault debt down will be swapped for DAI and used to pay the vault. Of the remaining interest income, the trust will pay its overall expenses — around $7500 flat fee for the first couple million in assets, then 10bps and 7.5bps and so on for larger amounts + around $1500 for tax filings + brokerage fees. Note that for Treasuries there are typically no or extremely low trading fees, and can even be held directly without a broker through treasurydirect.gov. Any income remaining after the trust has paid its operating expenses and Maker are then distributed to the selected charity. The charity will also get anything inside the trust when it winds down at the predetermined date, which is after it has already repaid in total the vault it used to finance the purchase. Note that this income (as opposed to the remainder) is not strictly required to go to charity, but because there will be little “remainder” at the end of the trust’s life and it is a KYC hurdle to distribute to Maker and I didn’t want a core unit to receive this kind of money, I think it is best to send a little regular income to the charity. If we felt less charitable, we can probably direct payments elsewhere, but for now I’d like to stick to basics and also make it clear we’re not being abusive. In the proposed structure, Maker makes money with high quality collateral, charities make money, and the government gets an alternative source of cheap debt financing that’s not just the Fed. That leaves pretty much no one with space to complain about some crypto boogeyman entering the markets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.83611111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "02/08/2021-11:46:27",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}