{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/central-bank-risk-teams/349",
            "title": "Central bank risk teams ",
            "index": 349,
            "category": [
                "Governance"
            ],
            "tags": [
                "dao-structure",
                "idea"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ginworkflow",
                    "index": "#1",
                    "likes": "1",
                    "time": "31/08/2019-21:29:23",
                    "content": "This might sound farfetched but has there been any discussions on enticing a central bank to mobilize a MakerDAO risk team? ",
                    "links": [],
                    "GPT-summary": "The post is asking a question about the possibility of a central bank mobilizing a risk team for MakerDAO. It does not fit entirely into any of the given topics, but it is closest to \"3rd party asking questions about proposal\" and \"3rd party extending to proposal\". The author is not advertising the proposal, but rather seeking information and feedback. The post also explains the proposal in question.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#2",
                    "likes": "0",
                    "time": "01/09/2019-07:01:26",
                    "content": "Why would they do it? What’s their motivation? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ginworkflow",
                    "index": "#3",
                    "likes": "1",
                    "time": "01/09/2019-19:26:46",
                    "content": "First of all I am assuming central banks are interested in learning about cryptocurrency systems so that they will not become somewhat obsolete some day in the future. It seems like they are with all the talk about central bank digital currencies. The mandate of at least some central banks states the responsibility of maintaining a secure and reliable payment system. Decentralized systems has the potential to be significantly more secure and reliable than centralized systems hence imo it is the responsibility of some central banks to eventual implement decentralized payment systems. One could argue that basing a payment system on a single platform or protocol is somewhat centralized. So to me it would not be unlikely if a central bank maintained multiple payment systems to be as reliable as possible. MakerDAO (or just the smart contracts) seems to me like a currency system that could be part of a secure and redundant national/fiat payment system. Also the fact that the system is backed by collateral locked in smart contracts makes it easier to trust (in case you are a fiat sceptic) and hence make fiat more trustworthy. So maybe a central bank would like to get acquainted/experienced with the MakerDAO system so that they could deploy their own instance of MakerDAO. An “easy” and safe way of launching a CBDC imo. MakerDAO already kind of works like a central bank and the system has been in production and somewhat proven. Maybe a central bank (more likely of a smaller nation) would get involved with MakerDAO if MakerDAO launched a Dai pegged to their national currency (I.e. basically create their CBDC). Maybe they would like to get involved because MakerDAO already plans to launch a Dai pegged to their national currency and they would like to take part in that to have a say in governance and risk assessment. Even if a central bank issued its own CBDC why not also have a Dai version of this currency to increase the reliability (redundancy) of the payment system. Especially when this could be achieved “easily” (compared to creating a CBDC from scratch). Central bank risk teams are very likely not happening any time soon (if ever) but maybe they could be part of a risk solution for the long run. Also on boarding such a risk team would imo really earn MakerDAO some deserved recognition in the legacy financial world and potentially increase demand for Dai significantly. Anyways just my thoughts. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.625830564784053
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ginworkflow",
                    "index": "#4",
                    "likes": "0",
                    "time": "03/09/2019-08:21:45",
                    "content": "   CoinDesk – 2 Sep 19    A Crypto Fix for a Broken International Monetary System - CoinDesk Mark Carney's recent statements about a new digital global currency has opened the door to fresh ideas built on blockchain, Michael J Casey writes.      Kind of related article that imo suggests maybe some central banks would like CBDC earlier rather than later. Also sounds like even the IMF could be interested in a stablecoin so maybe even they would like to get acquainted with MakerDAO and mobilize a risk team. Then we should maybe bring back the SDR pegged version of MKR to keep them interested  Hope my rambling at least inspires people to think about these things. ",
                    "links": [
                        "https://www.coindesk.com/a-crypto-fix-for-a-broken-international-monetary-system"
                    ],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.393048128342246
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#5",
                    "likes": "0",
                    "time": "03/09/2019-08:46:51",
                    "content": "    ginworkflow:  First of all I am assuming central banks are interested in learning about cryptocurrency systems so that they will not become somewhat obsolete some day in the future   They are almost certainly interested, since crypto potential seems kind of obvious. Their role might even change significantly, maybe even naming themselves as ‘central bank’ becomes anachronism. It will be interesting, for sure.     ginworkflow:  Decentralized systems has the potential to be significantly more secure and reliable than centralized systems   This is probably already true, at least regarding availability. Just some food for thought: http://bitcoinuptime.com/     ginworkflow:  One could argue that basing a payment system on a single platform or protocol is somewhat centralized.   Strongly agree.     ginworkflow:  So maybe a central bank would like to get acquainted/experienced with the MakerDAO system so that they could deploy their own instance of MakerDAO.   It will not be easy to compete, if Maker achieves success. Especially for smaller nations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.118799603174603
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "0",
                    "time": "06/09/2021-10:19:07",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}