{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/proposal-to-include-deliberate-stability-fee-experiments-in-the-s-l-scope-mip103/19886",
            "title": "Proposal to include deliberate stability fee experiments in the S&L scope (MIP103) ",
            "index": 19886,
            "category": [
                "Governance"
            ],
            "tags": [
                "risk",
                "fees"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#1",
                    "likes": "1",
                    "time": "21/02/2023-07:57:23",
                    "content": "This proposal is based on research by Flipside Data Science. Shoutouts to Carlos Mercado aka @charliemktplace, Angela Minster and Austin Blackerby. We propose to run an experiment and deliberately raise the stability fees for the ETH-B vault to 6.5% in 0,5% increments on a fixed schedule every month, or every six weeks. This should be done so we can get reliable data of vault user elasticity to stability fees. The stability and liquidity scope (MIP103) should optimize for protocol revenue but requires experimentation to set parameters correctly. Our research suggests users are not elastic to vault stability fees and mint DAI instead as a separate function of the value of the collateral. We argue rates should be set to maximize vault revenue first and foremost, with the proceeds available to incentivize DAI demand elsewhere. All of our research is open source, and this link allows for interaction with the visualizations included here. We appreciate your feedback and contributions. If you want to support more research like this, kindly delegate to our new delegate contract.  Key Points of our research There is no conclusive evidence that users of Maker ETH-B Vault are elastic to the stability fee. Daily Implied Revenue for the ETH-B Vault peaked during a high fee period, even though DAI Outstanding peaked in a low fee period. In our view, the key driver of ETH-B utilization is the Ether price. However, our analysis was severely limited by two confounding factors:  The early days of ETH-B when the Debt Ceiling reached the Debt Limit. The stability fee exclusively decreased from Dec 2021 to Jan 2023.   Historical Context  Stability Fee vs. Debt Ceiling (adjusted by Keepers) vs Debt Limit (adjusted by Governance) The ETH-B Vault has both a Debt Ceiling and Debt Limit.   Debt Ceiling: VAT.ilks.line limits excessive short-term minting of DAI and can be raised by anyone as needed. Maker uses Keepers to make sure the debt ceiling stays in line with outstanding DAI plus gap to de-risk rapid DAI minting.   Debt Limit: DC-IAM.ilks.line is a hard limit on the amount of DAI that can be generated by a vault. It is determined by governance and is set extremely high, allowing the Debt Ceiling to be the main (soft) constraint for DAI generation.     ETH-B before July 2021 In the first seven months, the Debt Limit was raised to 50M DAI, which was quickly filled. Consistent increases in the stability fee did lead to some withdrawals and paybacks. Still, ultimately, the demand for DAI was extremely inelastic to the stability fee, and the Debt Limit remained fully utilized. Zooming in, after four increases of the stability fee (6.5%, 7.5%, 9%, 10%) failed to reduce demand, governance raised the Debt Limit to 300M DAI and introduced the Instant Access Module.  Only once after August 2021 did the line fall to < 50M ( first half of July 2022) and only for a few days.   DAI Outstanding & Implied Revenue We defined DAI Outstanding at the day level as cumulative (DAI minted - DAI repaid - DAI paid off via liquidations) as of that day. We defined Implied Revenue as DAI Outstanding x (Stability Fee / 365).  DAI Oustanding ETH-B’s DAI Outstanding peaked in June 2022 at ~230M DAI. The stability fee at the time was 4%.   Implied Revenue Implied Revenue is calculated at the daily level as: daily_implied_revenue = dai_outstanding * stability_fee / 365 This relatively simple calculation unifies the competing priorities of Maker.  Making more revenue improves the protocol’s strength and enables more funding for the DSR. Having more DAI in the ecosystem allows it to more easily integrate into DeFi, which can be demanded as a unified decentralized stablecoin.  This chart contrasts with the DAI Outstanding chart above, as it shows revenue peaked when the stability fee was growing from 5% to 6.5% around Nov 2021, despite the DAI Outstanding being 30% lower than the July 2022 peak.   Implied Revenue vs Stability Fee In tax theory, the Laffer Curve states that government revenue is 0 at both a 0% tax rate and a 100% tax rate. Thus there is concavity around an optimal tax rate that enables economic growth while maximizing government revenue. A Laffer Curve relationship may exist between ETH-B daily implied revenue and the Stability Fee. This Loess (locally estimated scatterplot smoothing) view obscures a lot of confounding factors (i.e., ETH Price and a limited number of changes to stability fees), but separating out the data for after July 2021 does provide shallow support to the argument that there is an optimal stability fee around 6% to 6,5%. The research link provided allows for interaction with all visualizations for those interested.   ETH Price & RSI  DAI Outstanding Nov ’21 Spike DAI Outstanding has a 0.494 correlation with ETH’s Price, which we consider noticeably high. The two major peaks in DAI Oustanding are the November 2021 peak of the bull market and the June 2022 bottom of the market, when ETH fell to <$1,000 after the Terra / Luna collapse.  In the first instance, the stability fee rose. We assume governance did so consciously to take advantage of the demand and grow revenue. These kinds of active choices confound analysis like this, which will be discussed in conclusion. In the latter, the stability fee remained unchanged through the entire spike.     DAI Outstanding June ’22 Spike The DAI Outstanding spike of June 2022 coincides with a significant and rapid decrease in the price of ETH. Looking at the Relative Strength Index (RSI), a traditional finance measure of an asset being overbought (>70) or oversold (<30), shows 11 days of Oversold status for ETH’s price coinciding with very large and rapid DAI generation events. We assume that the likely reason one would mint DAI at ETH’s local low would be to take leverage. You mint DAI, buy ETH, deposit that ETH, and repeat the process. On June 19, 2022 ETH was at its lowest $995, with 223,000,000 DAI Outstanding from this Vault. On July 8, 2022, with ETH’s price recovering to $1,240 the DAI Outstanding was down nearly 90% to 23,280,000 DAI. The smaller but still noticeable (-0.225) negative correlation with RSI indicates that DAI generation can occur even when ETH’s price is low, (i.e., if it is oversold quickly). This again supports the perspective that users are not elastic to the stability fee, they are reactive to ETH’s price and its relative change in price.  732×532 34.1 KB    Conclusion While we see the noticeable correlation between DAI Outstanding, ETH Price, and ETH RSI. There is no correlation between DAI Outstanding and the Stability Fee. Whether in the totality of the time period of analysis (Inception to Jan 13, 2023) or since June 2021 (Correlation: 0.05) We believe the path forward for identifying how to best set the stability fee for Maker’s goals is to experiment with the fee. We recommend a preset growth of the stability fee from the current 3% up to 6.5%, 0.5% at a time, over equal length time periods, ignoring all other factors: ETH price, RSI, competitors, revenue, DAI outstanding, etc. We recommend that such experiments be integrated into MIP103. Given a predefined unbiased fee strategy, formal modeling could parse out the marginal effects of stability fee increases after adjusting for changes in ETH’s price and RSI. We expect high volatility periods for ETH will draw increased revenue as the fee grows. We can then follow up this defined time period with structured decreases, again, ignoring all other factors to study the marginal effects in reverse. With more data coinciding with a predetermined unbiased fee strategy, more and better analysis can be done to inform fee strategies and methodologies for Maker stability fees on other vaults beyond ETH-B. All in all we argue fees should be set to optimize protocol revenue and propose this research inspired experimentation to better set parameters towards this goal. We welcome feedback and want to thank @tadeo and @piotr.klis as well as @ultraschuppi for their willingness to engage with us and explain the intricacies of MCD.  Resources Interactive Report: https://science.flipsidecrypto.xyz/mkr_ethb_report/ Exploratory Visualizations: https://science.flipsidecrypto.xyz/mkr_ethb_viz/ Github w/ Queries & Data: https://github.com/fsc-data-science/MKR-Elasticity-ETHB  ",
                    "links": [
                        "https://science.flipsidecrypto.xyz/mkr_ethb_report",
                        "https://vote.makerdao.com/address/0x222d46d1229036c7bb6ea3f453406792ca3c3ea2",
                        "https://en.wikipedia.org/wiki/Laffer_curve",
                        "https://science.flipsidecrypto.xyz/mkr_ethb_report",
                        "https://science.flipsidecrypto.xyz/mkr_ethb_report/",
                        "https://science.flipsidecrypto.xyz/mkr_ethb_viz/",
                        "https://github.com/fsc-data-science/MKR-Elasticity-ETHB",
                        "https://forum.makerdao.com/t/mip103-the-stability-and-liquidity-scope-framework/19675/18",
                        "https://forum.makerdao.com/t/deco-q4-2022-forum-update/19662/4"
                    ],
                    "GPT-summary": "The post is a proposal to run an experiment and deliberately raise the stability fees for the ETH-B vault to 6.5% in 0.5% increments on a fixed schedule every month or every six weeks. The proposal is based on research by Flipside Data Science, and the author explains the key points of their research. The post also includes historical context, charts, and conclusions. The author welcomes feedback and contributions.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.927617784992785
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#2",
                    "likes": "4",
                    "time": "21/02/2023-15:26:54",
                    "content": "Elasticity to rates probably isn’t as simple. It also depends on alternatives available to customers. We tried to consider this by comparing to AAVE v2 in our analysis, which has different findings: Quick Lending Market Update + Analysis of Rate Changes of Major Vaults We also did not limit our analysis to a single ilk: ETH-A and ETH-C rates are also very relevant to ETH-B utilization. I’m for the idea of experimentation, but I think there are some important details we need to consider:  we would need to be careful not to annoy customers and drive them away. we would need to ensure that the output isolates lurking variables enough that it is useful over the output we already have via natural rate changes. For instance, if we ran this experiment and rates at AAVE happened to go up at the same time as we increased rates, we wouldn’t get a clean read.  The best way to accomplish both of the above is an A/B test (with one group of addresses receiving deliberately lower rates so they can’t sidestep our action by using a different address and wouldn’t want to), but I’m not sure whether this is technically possible. For this reason, 1) above makes me very hesitant. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.76387987012987
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "2",
                    "time": "21/02/2023-15:38:42",
                    "content": "    rspa:  We believe the path forward for identifying how to best set the stability fee for Maker’s goals is to experiment with the fee. We recommend a preset growth of the stability fee from the current 3% up to 6.5%, 0.5% at a time, over equal length time periods, ignoring all other factors: ETH price, RSI, competitors, revenue, DAI outstanding, etc. We recommend that such experiments be integrated into MIP103.   It’s an interesting research but then even if we set up an experiment to “ignore all other factors”, there’s now new factor that heavily influence the behavior which is the users are aware of the future stability fee, which would be steadily increasing. Similar to how expected inflation as well as expected interest rate change the behaviors in traditional markets, this accurate predicted future stability fee will change such behvaiors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.575757575757576
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#4",
                    "likes": "8",
                    "time": "21/02/2023-15:47:39",
                    "content": "This is an interesting analysis, but I would suggest we do not jump to conclusions and predetermined rate setting, especially as part of the Scope, based on one analysis alone, especially not if the reason is data sampling without predetermined methodology which incorporates various other important factors listed below. The analysis ignores some of the major factors which impacted state of the debt exposure inside MCD, which potentially negate the whole conclusion of the analysis, mainly;  External rate environment Available unutilized debt exposure Super users behavior and risk management (concentrated debt exposure)  Good example is the exposure peak in June 2022, which was produced due to one of the super users maintaining the CR buffer, and basically moving the position from higher LR vaults into ETH-B during price decline. Drawing conclusions of rate sensitivity from this data point is probably not feasible, since the user was optimizing for rate-non related factors. Below is the total exposure of this particular super user combined, and only ETH-B vaults on second chart.  1420×795 47.9 KB   1600×870 138 KB  Additionally, rates in the Core Strategic vaults - Strategic vaults based on the newest terminology defined in the Decentralized Scope - which also present the majority of outstanding exposure when it comes to decentralized assets, are not optimized for revenue only. In the recent past, one of the important goals of rate setting was to optimize for market share in DeFi and most importantly to stimulate supply from decentralized assets and consequently lowering excess demand for dai represented as PSM reserves - which is one of the reasons why current DSR setting is completely out of context. As explained above, there are multiple factors which should be considered when deciding what L&S scope should optimize for. In a high expected return environment, it is probably reasonable to assume that agents are not rate sensitive. A similar dynamic can be observed in the amount of capital crypto startups are able to raise in the idea phase before there is any real product, users, revenue, etc. Basically, when expectation of return is high as it is in crypto, risk tolerance is high and general cost sensitivity is relatively small. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.680344202898551
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlieflipside",
                    "index": "#5",
                    "likes": "1",
                    "time": "21/02/2023-16:49:38",
                    "content": "Yes, but the perfect alternative (randomize stability fee changes) is not practical. The broader point is that over a long enough time period (ETH price & RSI going up and down significantly) unidirectional changes in the stability fee will still allow some kind of signal. Right now, there isn’t enough unbiased data to argue that this elasticity & Laffer curve are accurate. Our argument is that this limited data supports experimentation which would then lead us to a more accurate analysis in the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.2629731379731375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlieflipside",
                    "index": "#6",
                    "likes": "1",
                    "time": "21/02/2023-16:59:51",
                    "content": "Interesting, I see what you’re saying, but it gets me to the opposite conclusion. Our argument is that ETH Price & RSI are the overwhelming drivers of ETH-B activity, looking at your charts over the key price & RSI time periods, it seems to correlate similarly with AAVE v2 debt as well. Doing this unbiased fee strategy, then parsing out whatever AAVE does over the same period feels like even more of a reason to experiment with the rate on vault of lower importance (<$30,000 daily revenue) even if rational users move to other vaults or other platforms; I actually suspect there is a sizeable amount of irrationality among borrowers in both AAVE and Maker. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5681818181818175
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#7",
                    "likes": "0",
                    "time": "21/02/2023-17:00:06",
                    "content": "    lyt:  The best way to accomplish both of the above is an A/B test (with one group of addresses receiving deliberately lower rates so they can’t sidestep our action by using a different address and wouldn’t want to), but I’m not sure whether this is technically possible.   I really like this idea, in concept. This would definitely be the best and cleanest signal. Like you say it’s hard to imagine how this is done in practice. We can’t really have a “lottery vault” were users see different rates depending on a lottery. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.815972222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#9",
                    "likes": "0",
                    "time": "21/02/2023-17:04:18",
                    "content": "    charlieflipside:  Right now, there isn’t enough unbiased data to argue that this elasticity & Laffer curve are accurate.   And how would having more biased data allow the team to test it. Also if we are looking it from elasticity, it might be better to look broadly and compare Maker ETH positions to AAVE or Compound. Comparing substitutes might be one way to see how elastic they are. Because it’s not just how it decreases or increases based on stability fee but how it acts compared to others. For example, if AAVE and Compound also has rate or simillar to Maker stability fee rate, when Maker changes its stability fee, how fast does the market move to alternatives? the slower it is, the more inelastic it is. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.530133928571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#10",
                    "likes": "0",
                    "time": "21/02/2023-17:05:34",
                    "content": "Granted, the above is more for looking at elasticity from demand side ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#11",
                    "likes": "0",
                    "time": "21/02/2023-17:11:44",
                    "content": "    Doo_StableLab:  compare Maker ETH positions to AAVE or Compound.   The issue here is that Aave is not really comparable. Aave capital becomes very pricey at scale. Maker’s doesn’t. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#12",
                    "likes": "1",
                    "time": "21/02/2023-17:11:49",
                    "content": "    rspa:  Like you say it’s hard to imagine how this is done in practice. We can’t really have a “lottery vault” were users see different rates depending on a lottery.   To be clear, this isn’t my hesitation. I have no qualms with giving randomly selected address’s temporary promotional rates as a test. I just don’t know if it’s technically possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.590277777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#13",
                    "likes": "0",
                    "time": "21/02/2023-17:12:26",
                    "content": "You’re braver than I. I’d have hesitations because it would be deemed as “unfair”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlieflipside",
                    "index": "#14",
                    "likes": "1",
                    "time": "21/02/2023-17:22:14",
                    "content": "Do you think there is a certain set of Vaults that have more frequent (and bidirectional) rate changes that could be better than ETH-B for that type of review? The idea here is that the experiment on ETH-B would have a predefined set of rate changes (and to your point a rational market would react differently knowing the future changes in advance!) that are agnostic to everything else (AAVE rates, COMP rates, ETH Price, ETH RSI, other vault fee changes, etc.) The goal being there would then be enough data within each fee epoch, we can do a real stats analysis that can (hopefully) parse out all the concerns you are correctly noting. (the ideal stats thing being randomized fees but no way that is practical) To specify on the problem: there have been exclusively decreases in the fee since Dec 9, 2021  This of course makes sense, the ETH top was Nov 2021. Less demand is a logical reason to consider lowering the fee. But why 6.5% → 4%, as opposed to 5 or 4.5? We argue that experimentation could have, in hindsight, provided a defensible framework for earning more revenue in the June 2022 collapse. Other comments here note that this may not be true, because the June 2022 spike in DAI from ETH-B was predominantly a super user. I hear that and am more convinced that experimentation with the fees on a lower importance vault can give us signal to understand that segment of Maker customers as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.230820105820106
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#15",
                    "likes": "1",
                    "time": "21/02/2023-17:47:32",
                    "content": "It’s pretty standard practice. Right now even, Coinbase is A/B testing a 4% interest rate on USDC holdings (vs 1.5% for everyone else), offered to only some users. We don’t even know if those users were randomly selected. Random selection only increases “fairness” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.668367346938775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#16",
                    "likes": "1",
                    "time": "21/02/2023-17:48:55",
                    "content": "That’s a good point. Could be done on the frontend probably if you have two “identical” vaults in the backend…  Just rambling. But might be worth to explore this path further. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#17",
                    "likes": "1",
                    "time": "21/02/2023-18:23:52",
                    "content": "Ironically, if you want to just see the relationship between stability fee and minted or at least hypothesis around it, SAI would be a better dataset. Back then there was also no PSM, so Dai (now which we call SAI) peg could swing more than now, which required stability fee to change often. Also, there were no competitors till much later. Also there was literally only one collateral: ETH. And only 1 type too ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#18",
                    "likes": "0",
                    "time": "21/02/2023-18:30:06",
                    "content": "For example, it’s mentioned here too but there was a period Dai was under $1 and yet even after raising stability fee many times, it was still difficult and if you think about it, when Dai was 0.98 or 0.97, that means those who were minting were taking instant 2-3% loss, and yet even with increase rate and such, they still minted, which might help show your point that it’s quite inelastic.    Cointelegraph    DAI Struggles to Maintain $1 Peg, But MakerDAO Supporters Still Believe Supply, demand and the April bull market: Why MakerDAO’s DAI hasn’t been all that stable.      ",
                    "links": [
                        "https://cointelegraph.com/news/dai-has-been-struggling-to-maintain-its-1-peg-but-the-makerdao-community-believes-it-will-soon-be-cryptos-default-stablecoin"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#19",
                    "likes": "3",
                    "time": "21/02/2023-19:39:23",
                    "content": "ETH-B currently consists of 84 individual vaults and perhaps even less individual users. The result of a test would likely not be representative of the whole current crypto user population, and even less of the whole financial sector which is yet to experiment with crypto financial protocols. There are multiple factors that impact demand, user behavior change based on external environment, market cycle, etc, - drawing conclusions about rate setting from an isolated analysis of a few quantifiable factors is imo not reasonable. This test would provide a single data point, which would say; these few specific users are or are not sensitive to ETH-B rate, ignoring all other factors. There is plenty of historical data available from several on-chain credit protocols, and lending/margin markets on various CEX (Bitfinex, Kraken, potential other) and funding rates on perp contracts CEX (Bitmex and similar) or on-chain protocols with similar mechanics. I am not against experimentation and research, but we need to be careful to not do things which potentially can’t even be used at the end, while it is potentially harmful for current users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.9211309523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlieflipside",
                    "index": "#20",
                    "likes": "0",
                    "time": "24/02/2023-20:03:25",
                    "content": "This makes sense. We looked at ETH-B from the perspective of low-downside risk to Maker overall. But I’m hearing it is also low-impact. Which vaults would you want to see a similar analysis on, if any? Do you think there is a path forward to some differentiation of a vault’s stability fee from the broader trend to study further? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#21",
                    "likes": "2",
                    "time": "27/02/2023-10:46:57",
                    "content": "We have a couple of ideas where research and analysis could produce insight which could be directly used in parameter setting and eventually written down in the respective Scopes. Assuming that MIP101 and Scopes are accepted, I imagine that Risk will produce a list of work to be done as interim Facilitator of Decentralized scope. In the short-term, perhaps an analysis on a vault type which has significantly more users; ETH-A and ETH-C would yield more insightful results. In addition, whale positions could be abstracted from the analysis. Finally, once a user had closed the position in MCD, it would be useful to know if they perhaps moved the position into external protocol where position is cheaper to maintain - this would signal more clearly that the reason was rate related, especially if the reason was not due to some other factor such as cross collateralization or higher leverage/liquidation buffer. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.536651234567901
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#22",
                    "likes": "0",
                    "time": "01/03/2023-12:57:19",
                    "content": "Hey Rema, We’d love to do that. Would it be okay if we tackle it in 2-3 weeks? Just got a lot going on atm ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/imkharn",
                    "index": "#23",
                    "likes": "1",
                    "time": "01/03/2023-20:39:38",
                    "content": "The stability fee goes to MKR holders to compensate them for risk of a rapid price drop greater than the margin of extra collateral e.g. 30%. Consider the cost of buying a -30% put every day (crash insurance against the collateral e.g. ETH dropping by more than 30% in a day). Last I looked on deribit the cost of insuring against a 30% drop comes out to be about 2% per year, thus 2% per year is an appropriate compensation to MKR holders who are essentially far out of money short dated put sellers. I believe this methodology of pricing -(CDP min margin)% puts given the daily volatility of the collateral should be used across the board. While the elasticity of the stability fee is of academic interest, it is not required knowledge for operating the protocol, and discovering it by upsetting users with fees and imposing gas costs on all of them is arguably a mild abuse of customers in the name of curiosity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.966666666666667
                }
            ]
        }
    ]
}