{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/target-below-dollar-peg/3039",
            "title": "Target Below Dollar PEG ",
            "index": 3039,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "alignment",
                "idea",
                "comp"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Jeffshaw",
                    "index": "#1",
                    "likes": "4",
                    "time": "03/07/2020-18:52:20",
                    "content": "Due to the extreme demand for Dai due to Compound, coupled with a backdrop of global macroeconomic risk factors including the Covid-19 pandemic, at a time when global central banks have blown “The Everything Bubble”, and a strong correlation of crypto assets with equity markets (Dai demand will increase if equity/crypto prices decrease), I believe we should set the intention of utilizing our tools to target Dai below the 1 dollar PEG, perhaps 0.99, to allow greater ability to mitigate risks in an increasingly uncertain economic environment. This is not a long term recommendation, just for an interim period until risks have been abated. This should be accomplished by pulling all levers immediately to increase Dai supply. This includes:  Increasing Debt Ceiling for assets that are currently at their Debt Ceiling. This includes USDC-A and WBTC. Increase Debt Ceiling for assets nearly at their Debt Ceiling. This includes ETH-A. Lower Liquidation Ratio for stable assets. This includes USDC-A, USDC-B, and TUSD. Recommend lowering from 120% to 105%. Lower Stability Fees for all assets to 0%.  Once we get Dai below the dollar PEG, we can tighten parameters as necessary. I think we are not taking the current risks of a strong Dai seriously enough and the risk of an emergency shutdown is increasing. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.44607843137255
                }
            ]
        }
    ]
}