{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/todays-endgame-call-cancelled-agenda-for-tomorrow-endgame-v4-vision-call-rollup-ai-tokenomics/20015",
            "title": "Today's Endgame Call cancelled; agenda for tomorrow Endgame v4 vision call (Rollup, AI, tokenomics) ",
            "index": 20015,
            "category": [
                "Governance"
            ],
            "tags": [
                "public-call"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "0",
                    "time": "01/03/2023-16:24:05",
                    "content": "Since there are still some last minute fixes required on the Maker Constitution MIP Set, I’ve decided to cancel the Endgame call tonight so in case anything else pops up I can focus on fixing any last issues. Instead I will be talking about the long term vision of Endgame v4 at the call tomorrow, same time. There are a lot of final pieces of the puzzle that have been coming together and I’m excited to share this stuff, because it will be the starting point for all the details and decisions we’ll have to flesh out over the Pregame. Topics will include:  Maker Rollup/Multichain compatible L1 Using AI and large language models to simplify governance accessibility, verify workforce results and project negotiations and decisions, and grow/“populate”/market SubDAOs Rebranding for Endgame and preparing an educational campaign Tokenomics changes, including Dai rewards from the Sagittarius Engine as the next step of the technical roadmap (this will mean large scale voter incentives arrive sooner) Reduced ossification of the constitution - with some changes to the design of the voter incentives, and through large scale leveraging of AI to power governance processes and make them more accessible and intelligent, I believe we can achieve a more desirable long term governance equilibrium where small, sensible adjustments to the Maker Constitution are feasible, and won’t cause dangerous misalignment risk.  ",
                    "links": [],
                    "GPT-summary": "The author of the post is explaining the agenda for the Endgame v4 vision call, which has been rescheduled due to last minute fixes required on the Maker Constitution MIP Set. The author will be discussing various topics related to the long term vision of Endgame v4, including Maker Rollup, AI, tokenomics, and rebranding. The post does not contain any feedback or questions from third parties, nor does it advertise collaboration opportunities.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.5191326530612255
                },
                {
                    "author_link": "https://forum.makerdao.com/u/quntangled",
                    "index": "#3",
                    "likes": "0",
                    "time": "02/03/2023-09:22:42",
                    "content": "I would like to attend this call. Please can anyone share the link? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#4",
                    "likes": "1",
                    "time": "02/03/2023-11:31:13",
                    "content": "The call starts at 19:00 UTC today. This is the link -   Zoom Video   Join our Cloud HD Video Meeting Zoom is the leader in modern enterprise video communications, with an easy, reliable cloud platform for video and audio conferencing, chat, and webinars across mobile, desktop, and room systems. Zoom Rooms is the original software-based conference...      You can find all upcoming DAO calls in the Calls Calendar which can be accessed on the Maker Operational Manual. ",
                    "links": [
                        "https://us02web.zoom.us/j/84758425312",
                        "https://manual.makerdao.com/makerdao/calendars/calls-calendar"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.680555555555555
                }
            ]
        }
    ]
}