{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/collateral-onboarding-call-37-cauris-global-fintech-fund-wednesday-august-25-4pm-utc/9994",
            "title": "Collateral Onboarding Call #37: Cauris Global Fintech Fund - Wednesday, August 25 4PM UTC ",
            "index": 9994,
            "category": [
                "Collateral Onboarding",
                "Collateral Meetings"
            ],
            "tags": [
                "public-call",
                "rwa",
                "pubcall-:-collateral"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "4",
                    "time": "23/08/2021-22:39:00",
                    "content": " Collateral Onboarding Call #37: Cauris Global Fintech Fund - Wednesday, August 25 4PM UTC  1280×720 66.5 KB  Time in your local-timezone format: 2021-08-25T16:00:00Z Mark it on your Google Calendar!  Dial In Details Zoom call Passcode: RWA-WG  Intro An open discussion where we discuss projects and potential assets for MCD, open for anyone to join. If you’d like to present, check out this thread.  Agenda Intro by @JuanJuan Presentation by SAM_CAURIS  Cauris Global Fintech Fund — https://www.caurisfinance.com/index.html  MIP6: [CIM] MIP6 Application: Cauris Global Fintech Fund  Cauris is a mission driven company that applies advanced technology to solve financial issues while providing high risk adjusted returns to its investors. We aim to give 100 million more people access to capital. We believe that access to credit is key to empowering individuals and enabling economic growth. According to the World Bank, to close the gap on financial inclusion and enable the gig economy, medium & small enterprises need $5.2TN in financing. Traditional banks unfortunately have been unable to fulfil this gap as illustrated by the fact that only 25% of Africa’s population has a bank account vs. 90% in OECD countries. As shown above, there is clearly a need to disrupt the traditional banking system to make financial inclusion around the globe a reality. At Cauris, we believe that fintech is the fastest way to efficiently connect millions to financial services, and that DeFi provides a unique opportunity to democratize and lower the cost of financing. Driven by this mission, we are finding the best-in class fintechs operating in international markets which are providing working capital and access to financing to consumers and SMEs. We use a combination of strong underwriting and legal protections to secure our debt investments in fintechs.   Attn: @Risk-Core-Unit, @GovAlpha-Core-Unit, @Protocol-Engineering, @Real-World-Finance, @flipflopflapdelegate, @ejbarraza, @_LS, @planet_x, @g_dip, @PaperImperium ",
                    "links": [
                        "https://us02web.zoom.us/j/88508073720?pwd%3DR1FiRCtKK0hIVGJyMlpiekZIelY2Zz09&sa=D&source=calendar&usd=2&usg=AOvVaw2bZFk9OiwA_yeyeiUyPYwE",
                        "https://forum.makerdao.com/t/collateral-calls-calling-all-projects/3715/",
                        "https://forum.makerdao.com/u/juanjuan",
                        "https://forum.makerdao.com/u/sam_cauris/summary",
                        "https://www.caurisfinance.com/index.html",
                        "https://forum.makerdao.com/t/mip6-application-cauris-global-fintech-fund/9610",
                        "https://www.worldbank.org/en/topic/smefinance",
                        "https://www.afdb.org/fileadmin/uploads/afdb/Documents/Knowledge/AEB_Vol_6_Issue_5_2015_The_Banking_System_in_Africa__Main_Facts_and_Challenges-10_2015.pdf"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.128055555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#3",
                    "likes": "4",
                    "time": "25/08/2021-20:14:14",
                    "content": "The full call is now available on the MakerDAO Youtube channel for review:      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#4",
                    "likes": "4",
                    "time": "30/08/2021-04:35:30",
                    "content": " Collateral Call Summary - Episode #37  August 25th, 2021  Agenda   00:00: Intro with Juan Guillén  00:55: Collateral Cauris Global Fintech Fund with Alexandre Liege, Azer Songnaba, Charles Parker, and Ramesh Dhanaraj  37:45: Q&A and Discussion about Collateral Cauris Global Fintech Fund   Video https://youtu.be/x8HxS7gZl7E  Introduction  Juan Guillén  Agenda and Preamble 00:00  Hello everyone! Welcome to another MakerDAO collateral call. My name is Juan. I am the facilitator for the SES CU. Today, we have another RWA call. We are going to be exploring Cauris and the team behind them. We have a very interesting presentation ahead. Discussions about collateral happen in the Forum.    Collateral X  Name of Thread - Forum Thread   Alexandre Liege, Azer Songnaba, Charles Parker, and Ramesh Dhanaraj  Presentation 00:55  Cover1440×849 90.2 KB   Presenters1437×802 171 KB   Objective1440×811 153 KB   TargetEndBorrowers1440×816 121 KB   CaurisFinances1433×812 86.8 KB   InvestmentManagementProcess1440×812 69.1 KB   Underwriting1440×812 133 KB   StructuralProtections1440×813 104 KB   DROPLossProtection1439×812 116 KB   TransactionDiagram1440×812 144 KB   FintechPollSpecs1/21439×815 155 KB   FintechPollSpecs2/21440×814 122 KB   DeepdiveDemo1440×809 164 KB   GlobalFintechPool1433×831 151 KB   GlobalFintechPool21439×833 135 KB   PortfolioSection1434×816 107 KB   PortfolioCharacteristics1440×861 117 KB   PortfolioPerformance1438×855 118 KB   CovenantCompliance1440×820 131 KB   Discussion  37:45 - Payton Rose: You are doing a lot of lending in different parts of the world with many different legal and regulatory structures.How would you deal with it, if one of the Fintechs were to face legal scrutiny? 39:14 - Juan Guillén: Can you cover more on FX risks and how you mitigate that? 41:30 - Planet_X: How do you approach and grow your business with the customers? Is that on a demand basis, or is it more of a relationship where you have offered revolving credits? 46:15 - Someone: First, you mentioned that this is similar to a revolving line. Is it similar to revolver or to an invoice financing line? Revolvers are unsecured: what type of secure lien do you have on the underwriting loan? Second, do you have any buy back agreements with the originators? 48:05 - Someone: To make sure I understood correctly,  let me ask a last question. The revolver line is secured on the overall assets of the company,  is it secured as an extra lien on the lending collateral, or the ending collateral is pledged just to size the line? 48:52 - Frank Cruz (from chat): What type of analysis do you perform to anticipate losses and how do you monitor the compliance of covenants?   Closing Comment  Juan Guillén  Outro 52:46  Is there anything else that the team would like to say before closing the call? Where can people find you if they want to know more about these topics?  Alexandre Liege: There is a MIP6 application with our email addresses and how to contact us.   We can keep the discussion going at the forum. Thank you for presenting; it was really nice having you. Thank you to everyone else for coming!   Credits   @gala produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/x8HxS7gZl7E?t=55",
                        "https://youtu.be/x8HxS7gZl7E?t=2265",
                        "https://youtu.be/x8HxS7gZl7E",
                        "https://youtu.be/x8HxS7gZl7E",
                        "https://forum.makerdao.com/c/risk/collateral-meetings/23",
                        "https://forum.makerdao.com/t/mip6-application-cauris-global-fintech-fund/9610",
                        "https://youtu.be/x8HxS7gZl7E?t=55",
                        "https://youtu.be/x8HxS7gZl7E?t=2265",
                        "https://youtu.be/x8HxS7gZl7E?t=2354",
                        "https://youtu.be/x8HxS7gZl7E?t=2490",
                        "https://youtu.be/x8HxS7gZl7E?t=2775",
                        "https://youtu.be/x8HxS7gZl7E?t=2885",
                        "https://youtu.be/x8HxS7gZl7E?t=2932",
                        "https://youtu.be/x8HxS7gZl7E?t=3166",
                        "https://forum.makerdao.com/t/maker-relay-ep-60/10082",
                        "https://forum.makerdao.com/t/maker-relay-ep-60-en-espanol/10375"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1899999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "29/11/2021-10:35:50",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}