{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/growth-update-north-america/16702",
            "title": "Growth Update: North America ",
            "index": 16702,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Jenn",
                    "index": "#1",
                    "likes": "15",
                    "time": "19/07/2022-17:08:47",
                    "content": "North America Growth Updates Following on from the Growth CU June updates, and with a focus to provide more regional granularity for the community, here are some happenings from the wilderness of North America. Highlights/ Strategic Initiatives  Lending RWA/D3M  Increasing Dai demand across L1s and L2s has been a key focus for Growth this year. In the current DAO set up (there isn’t a dedicated liquidity provisioning CU) it has been challenging to provide loans of DAI to market makers who we’d typically lean on to provide liquidity across other networks and venues. For example, using a vault or institutional vault is not always capital efficient, especially for market makers, because they don’t want to lock up assets as collateral that could otherwise be put to work. As a solution to this, we’ve been examining a framework with lending platforms like Maple and TrueFi to facilitate loans of DAI to target borrowers. Earlier in the exploration we focused on using the D3M as a tool to distribute DAI, however the changed market conditions have made the prospect of using unsecured/under collateralized loans of DAI (the structure of loans on these platforms) to crypto borrowers less tenable so we are currently regrouping with them on more traditional RWA structure utilizing their platforms in a programmatic way. Over the past months we’ve been working closely with our partners like Maple and TrueFI and more recently Goldfinch to identify a process that will utilize their platform’s capabilities to manage loans of DAI (via “pool delegates”) to target quality borrowers that we want to work with. Maker is uniquely positioned to meet the current growing demand for credit and we’re excited about the opportunities to productize, with our partners, a more programmatic and scalable way to facilitate loans. This has been helped immensely by the work we’ve already done with our partner Centrifuge. Through a cross core unit collaboration; including PE, CES and RWF we’ve learned the risks/tradeoffs of using the D3M vs a more traditional RWA model within these lending platforms. We currently have a number of high quality institutional participants that want to work with us as a pool delegate (s) as well as high quality borrowers from traditional finance interested in acquiring loans from Maker. During this quarter we will be helping our partners re-propose MIPs that will outline the refined structure to utilize their platforms for loans of DAI.  L2/L1 development  As a way to increase DAI liquidity on L2s and L1s in the absence of having a formal DAI reserve to pull from for this goal, we’ve been working creatively through partnerships to increase DAI usage and liquidity provisioning. We worked with Avalanche to activate AVAX rewards back onto Aave v3 resulting in DAI supply increasing from 129M to 477M in 1 day of turning AVAX rewards on. https://twitter.com/makergrowth/status/1532087648663240704?s=28 Umee added support and promotion of DAI on via the gravity bridge https://twitter.com/umee_crosschain/status/1534587939484839936?s=21&t=tXk3K5ogPHf2Kv2lE4l_3g Completed collaboration with Axelar Network to enhance DAI usage and liquidity through cross promotion and other initiatives Hashport added support for DAI making it the 1st stablecoin supported on their bridge (Hedera)https://twitter.com/HashportNetwork/status/1549020125667663872?s=20&t=rW_VjM41tO9PZ2tg-Yfehg We submitted a proposal on Optimism to receive OP rewards in the future with the planned deployment of MCD smart contracts. We will be posting a signal request in the Maker forum to gauge community feedback on managing the rewards and re-proposing a new structure for the rewards that motivate users to add DAI liquidity to apps across Optimism as the roadmap for MCD deployment will take some time.    Optimism Collective – 23 Jun 22    [DRAFT][GF: Phase 1 Proposal] MakerDAO Project Name: MakerDAO  Author Name: @Facundo @JenSenhaji  Number of OP tokens requested: 500,000  L2 Recipient Address: TBD  Relevant Usage Metrics: (TVL, transactions, volume, unique addresses, etc.)  You can see an overview of MakerDAO’s metrics...  Reading time: 5 mins 🕑 Likes: 88 ❤       Velodrome, a new Optimism AMM, supports Dai and allocated MakerDAO with ~1% of initial voting power to steer emissions on its trading and liquidity marketplace. - Link   twitter.com    MakerDAO Growth @MakerGrowth  This is $DAI on @optimismPBC, frens!  USDC/DAI ➡️ 9.33% APR OP/DAI ➡️ 30.43% APR sUSD/DAI ➡️ 31.37% APR  Well, specifically, these yield pools are available in @VelodromeFi 🚴📈   Check them out: app.velodrome.finance/liquidity https://t.co/YmyeePn5Vi   3:28 PM - 1 Jul 2022           22                1            We acquired an allocation of SAFE tokens for being an active partner to Gnosis in their recent SAFE Gaudian token allocation. This will allow us to participate in their governance.    guardians.gnosis-safe.io    Safe Guardians This page is dedicated to the Safe Guardians program, a program designed to reward active members of the Safe community, who use their powers to contribute positively to the ecosystem       MKR Support on CEFI  Working with Nexo, BlockFi and another (former) Cefi platform that unfortunately is no longer functioning  … MKR has more utility for buying/selling, borrowing against and earning yield.   twitter.com    Maker @MakerDAO  [email protected] just listed $MKR and unlocked new useful features for it:  ↔️ Transfer MKR to your @Nexo account or buy it with a card + cashback. 💸 Borrow against your MKR, starting at 0% rates. 🔄 Swap MKR with 7 available pairs. 📈 Leverage your portfolio for buying more MKR.   2:37 PM - 15 Apr 2022           130                22               BlockFi    BlockFi Adds 9 New Cryptoassets for All Non-US Clients Today, we’re adding nine new cryptoassets for all non-US clients to buy, sell, trade, and earn crypto interest.      Market and Strategy Overview  Regulatory & Competitive landscape  Crypto regulation continues to be debated by US politicians; some want regulations that support innovation and practical consumer protection while others are very critical of crypto and continue to double down on their calls for heavy handed regulation. Last fall, the Biden administration put together “The President’s Working Group” (PWG), a proposal that effectively limits stablecoin issuance to large banks. This has gotten a decent amount of pushback and it’s still tbd on what lands. The other major question is what US financial agency (s) should be the regulator of stablecoins. The general sentiment from institutional investors/traditional finance is (not surprisingly) to take a low risk approach for the time being which translates into less participation in DeFi. There continues to be a fairly common misconception that DAI is an algorithmic stablecoin (mostly from the mainstream but even for the crypto familiar– believe it or not!). As a way to educate and inform how DAI is designed as an over collateralized stablecoin, we’re having discussions with professionals in academia (Ivy league colleges), tradfi and partners who work with the regulatory agencies in the US, to develop 3rd party content about Maker that will help correct these misconceptions and build trust. Going forward into the second half of the year the focus will be to continue to identify and acquire high quality/volume borrowers through direct relationships using vaults, institutional vaults, the D3m (when applicable) and via our platform partners as well increasing DAI liquidity across L2s and some L1s. This will be supported by the communication efforts (educational and awareness) of the newly formed Brand team. While it feels grim out there at the moment, I believe Maker is in a powerful place to onboard more users and increase DAI supply. General integrations from last quarter: Nexo MKR listing (tier 1) Unstoppable Domains Timeswap Mobilum Axelar Umee Celsius MKR listing (tier 1 to tier none…sigh) ",
                    "links": [
                        "https://twitter.com/makergrowth/status/1532087648663240704?s=28",
                        "https://twitter.com/umee_crosschain/status/1534587939484839936?s=21&t=tXk3K5ogPHf2Kv2lE4l_3g",
                        "https://axelar.network/",
                        "https://twitter.com/HashportNetwork/status/1549020125667663872?s=20&t=rW_VjM41tO9PZ2tg-Yfehg",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-makerdao/2755",
                        "https://gov.optimism.io/t/draft-gf-phase-1-proposal-makerdao/2755",
                        "https://app.velodrome.finance/",
                        "https://www.optimism.io/",
                        "https://twitter.com/MakerGrowth/status/1529552361877823489",
                        "https://twitter.com/MakerGrowth/status/1542892786889940992?s=20&t=i-G35pJMMWtHUBeBaVB2OA",
                        "https://twitter.com/MakerGrowth/status/1542892786889940992?s=20&t=i-G35pJMMWtHUBeBaVB2OA",
                        "https://twitter.com/MakerGrowth/status/1542892786889940992?s=20&t=i-G35pJMMWtHUBeBaVB2OA",
                        "https://twitter.com/optimismPBC",
                        "https://twitter.com/VelodromeFi",
                        "https://app.velodrome.finance/liquidity",
                        "https://t.co/YmyeePn5Vi",
                        "https://twitter.com/MakerGrowth/status/1542892786889940992?s=20&t=i-G35pJMMWtHUBeBaVB2OA",
                        "https://guardians.gnosis-safe.io/",
                        "https://guardians.gnosis-safe.io/",
                        "https://twitter.com/MakerDAO/status/1514976090820861963?s=20&t=BRvzlAWgIUhUAVYXvaOzkA",
                        "https://twitter.com/MakerDAO/status/1514976090820861963?s=20&t=BRvzlAWgIUhUAVYXvaOzkA",
                        "https://twitter.com/MakerDAO/status/1514976090820861963?s=20&t=BRvzlAWgIUhUAVYXvaOzkA",
                        "https://twitter.com/Nexo",
                        "https://twitter.com/MakerDAO/status/1514976090820861963?s=20&t=BRvzlAWgIUhUAVYXvaOzkA",
                        "https://blockfi.com/new-cryptoasset-interest",
                        "https://blockfi.com/new-cryptoasset-interest",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-14-20-de-julio-del-2022/16911",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/6",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-july-2022/16954"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.574549656692515
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#2",
                    "likes": "2",
                    "time": "19/07/2022-17:16:28",
                    "content": "    Jenn:  As a way to increase DAI liquidity on L2s and L1s in the absence of having a formal DAI reserve to pull from for this goal, we’ve been working creatively through partnerships to increase DAI usage and liquidity provisioning.   So excited for this! DAI’s brand recognition as a safe, trustless and effecient stablecoin has never been higher, L1 and L2 cross chain integration would lead to massive organic growth. Hopefully we can capitalize on this momentum ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.21875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#3",
                    "likes": "2",
                    "time": "20/07/2022-13:45:27",
                    "content": "    Jenn:  We acquired an allocation of SAFE tokens for being an active partner to Gnosis in their recent SAFE Gaudian token allocation. This will allow us to participate in their governance.   Will growth or the DAO be the one participating in their governance? Isn’t better spend those tokens on DAI (or xDAI) incentives in the same Gnosis chain? Btw, congrats for this update, pretty clear and very excited to see what you guys can bring in the future! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.102083333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#4",
                    "likes": "2",
                    "time": "20/07/2022-17:05:58",
                    "content": "Glad to see the reference to regulatory. Whether we like it or not, it is coming in some form and fashion. Trying to be prepared is the way, or else it is much worse. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jenn",
                    "index": "#5",
                    "likes": "1",
                    "time": "20/07/2022-17:22:12",
                    "content": "Thanks for the question on this @RoFz. Yes we can apply these to rewards entirely and plan to post a signal request to ask the community how they want to use these. Governance was one idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#6",
                    "likes": "3",
                    "time": "20/07/2022-23:36:47",
                    "content": "Excellent update and am especially excited to hear about L2 and mainnet integrations and partnerships. OP rewards proposal is also well done and look forward to hopefully see it pass     Jenn:  We submitted a proposal on Optimism to receive OP rewards in the future with the planned deployment of MCD smart contracts. We will be posting a signal request in the Maker forum to gauge community feedback on managing the rewards and re-proposing a new structure for the rewards that motivate users to add DAI liquidity to apps across Optimism as the roadmap for MCD deployment will take some time.   ",
                    "links": [
                        "https://forum.makerdao.com/t/growth-cu-monthly-update-september-2022/18686",
                        "https://forum.makerdao.com/t/growth-cu-monthly-update-august-2022/17947",
                        "https://forum.makerdao.com/t/growth-cu-monthly-update-july-2022/16974"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.10064935064935
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "18/10/2022-23:36:58",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}