{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/forum-at-a-glance-july-30th-august-5th/9708",
            "title": "Forum at a Glance: July 30th - August 5th ",
            "index": 9708,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "forum-at-a-glance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "5",
                    "time": "05/08/2021-15:10:40",
                    "content": " Forum at a Glance!  July 30th - August 5th The one-stop-shop for finding out what’s being discussed by governance right now. Links reflect my view of the most noteworthy activities in the governance, risk, and oracles categories right now. Disagree? Think something should be added? Leave a reply or a pm.  Three-Point Summary ‘What do I need to know as an MKR Holder this week?’  There are now 9 delegates with a total of 2,088.21 MKR delegated. Total DAI supply keeps hitting new highs, now at nearly 5,7B. System Surplus is about to reach 50MM DAI!    ICYMI - Announcements The third Meet Your Delegate call is scheduled for August 11th at 6 PM UTC. Make sure to join and find out more about future delegates’ platforms. @monet-supply, along with another recognized delegate, will be featured. @bainpm and the dUX Core Unit team published a post announcing the released soft-launch of the Vote Delegation UI, which can be found in the Governance Portal. It offers the ability to create a delegate contract, delegate and undelegate MKR, as well as view information for both recognized and shadow delegates.   Active Discussions  ‘What’s going on? You think what?! You’re 100% wrong, and here’s why…’ Gauntlet Delegate Platform - @inkymaze, also known as Nick Cannon, from Gauntlet submitted his application as a Maker delegate to help provide risk management and parameter optimization. Let’s Talk Liquidity Rewards That Maker Is Entitled To But We Aren’t Collecting - @PaperImperium starts a discussion towards potential ways for collecting unclaimed CFG liquidity rewards from the Tinlake platform. Institutional and Long Term Vaults Proposal - @Derek and the Protocol Engineering Core Unit have put forward a proposal to create Institutional Vaults and Long-Term Vaults through a new mechanism. Create a PAX PSM - @carlkvogel from Paxos proposed to create a PAX PSM to extend PAX as a way to diversify DAI collateral. This comes on the heels of community concern around the growth of DAI’s USDC backing, which sits at 60.6% according to Daistats.com. To sweeten the deal, Paxos plans to add DAI to its platform before Q1 of 2022. Dai on Different Networks #4 - @alec from the Content Production Core Unit team provides the community an overview of DAI circulating on non-ETH blockchains, layer-2 Rollups, and various bridges. [INFORMAL POLL] Should MakerDAO Require American Vault Owners To Also Stake Insurance Protection? - @flipflopflapdelegate asks the community whether MakerDAO should require Vault owners to have “insurance” protection. He also asks if the Maker community should begin speaking with U.S. regulators about what can be done to comply with regulatory frameworks?   Ongoing Initiatives  ‘Oh my god, this is taking ages; why can’t things be simple?’ Recognised Delegate Requirements - @LongForWisdom writes a detailed overview of the current requirements and application system to become a delegate in the Maker community. Check out this thread for more posts related to delegation.  Collateral Calls - Calling all Projects! - @juan sets up a signup thread for projects wishing to present on the bi-weekly collateral call. Know any potential collateral partners that want to present? Refer them here. Collateral Status Index - Confused about the current status of the various collateral types that have been discussed recently? Check out this post to find out the status and current position of each within the onboarding process. Weekly MIPs Updates - @Davidutro and @charlesstlouis bring the latest updates in the world of MIPs. The Official Welcome Thread - A welcome and introductions thread. Not strictly speaking governance, but if anyone new or old wants to introduce themselves, now is your chance!   Help Wanted  ‘Oh %#$?, we need a doodad, and we need it now.’ Wanted: Engagement Lead - @Davidutro is looking to hire a full-time Engagement Lead for the Governance Communications Core Unit. His hiring post summarizes the position responsibilities and requirements along with the GovComms mandate. Wanted: Governance Contributors for GovAlpha - @LongForWisdom puts out the call for new team members! Different tracks are available depending on interest and time commitment. Wanted: Risk Domain Monitoring Tools - @Primoz puts out a call for additional support to produce monitoring tools for the risk team. Grants are available. We could always use help reviewing MIPs in the Request for Comment phase​. ",
                    "links": [
                        "https://forum.makerdao.com/t/vote-delegation-ui-release/9646",
                        "https://forum.makerdao.com/t/vote-delegation-ui-release/9646",
                        "https://forum.makerdao.com/latest",
                        "https://forum.makerdao.com/t/gauntlet-delegate-platform/9675",
                        "https://gauntlet.network/",
                        "https://forum.makerdao.com/t/lets-talk-liquidity-rewards-that-maker-is-entitled-to-but-we-arent-collecting/9624",
                        "https://tinlake.centrifuge.io/",
                        "https://forum.makerdao.com/t/institutional-and-long-term-vaults-proposal/9586",
                        "https://forum.makerdao.com/t/create-a-pax-psm/9683",
                        "https://daistats.com/",
                        "https://forum.makerdao.com/t/dai-on-different-networks-4-july-29-2021/9597",
                        "https://forum.makerdao.com/t/informal-poll-should-makerdao-require-american-vault-owners-to-also-stake-insurance-protection/9674",
                        "https://forum.makerdao.com/t/governance-initiatives/1347",
                        "https://forum.makerdao.com/t/recognised-delegate-requirements/9421",
                        "https://forum.makerdao.com/search?expanded=true&q=%40LongForWisdom%20%23governance%3Adelegates",
                        "https://forum.makerdao.com/t/collateral-calls-calling-all-projects/3715",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/tag/mips-update",
                        "https://forum.makerdao.com/t/the-official-welcome-thread/771/4",
                        "https://forum.makerdao.com/c/miscellaneous/help-wanted/11",
                        "https://forum.makerdao.com/t/help-wanted-engagement-lead/9711",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP8",
                        "https://forum.makerdao.com/t/help-wanted-govalpha/8811",
                        "https://forum.makerdao.com/t/wanted-risk-domain-monitoring-tools/4168",
                        "https://forum.makerdao.com/tag/rfc",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-153-thursday-august-5-17-00-utc/9671/5",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/47",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-153-thursday-august-5-17-00-utc/9671/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6871287627101585
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "19/08/2021-15:11:24",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}