{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/wtfaq-is-the-moonshot-fund/8016",
            "title": "WTFAQ is the Moonshot Fund? ",
            "index": 8016,
            "category": [
                "Core Units"
            ],
            "tags": [
                "cpm-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#1",
                    "likes": "5",
                    "time": "12/05/2021-08:55:57",
                    "content": "Here are the top 10 +1 most frequently asked questions about the Moonshot Fund:  What is a Moonshot Fund?  It is a fund, as well as a solution, the Strategic Marcomms team has proposed to capture significant marketing or ad opportunities.  How would such an opportunity look?  An ad or marketing campaign proposal that creates buzz with high ROI for awareness and exposure. One way to picture it is FTX’s naming rights of the Miami NBA stadium. It has successfully created buzz as an example of getting seen and known by a target audience beyond crypto. (It serves only as an example.)  How do you measure success?  The metrics differ depending on the type of campaign, but it is mainly measured by the buzz it has created. As an example, the measurement of FTX’s naming rights of the Miami NBA stadium would include:  An estimate of media exposure Total number of impressions (Or eyeballs) Traffic to the FTX site User growth A total number of FTX goods sold for merchandise branding The number of mentions associated with FTX’s name   How much are you asking?  5 million DAI  That sounds expensive.  On average, marketing budgets account for about 10 percent of a company’s revenue. It is important to note that there are average and some companies spend up to 20 to 30 percent. Our proposed budget is at 8.2 percent. With the Moonshot fund, it will take us to about 17 percent. For comparisons, FTX’s one single deal has a reported cost of $135 million over 19 years, which comes down to about $7 million a year. Other well-known top technology companies spend billions a year on their marketing budget.  We could have spent that money on XYZ.  Marketing, like sales, function as revenue drivers as it reaches a broader targeted audience. Not only that, it enables other units like Growth or RWA to start business-related conversations more easily as potential partners would have heard of MakerDAO because of Marketing. In addition to marketing, PR activities and initiatives bring credibility to an organization. The value of strategic positioning, branding and credibility is crucial for MakerDAO at the next stage of growth as more people learn about open finance or DeFi.  What do other advertising experts say about this?  Someone with years of experience at a well-known advertising agency: The level of the fund sounds about right, and it is needed as it opens up the potential conversations with offers and opportunities. Marketing veteran: Those deals are likely to be offered on a confidentiality basis, which means no details can be disclosed.  Why can’t the unit apply for the funding when the time comes?  There are great opportunities offered in the past that require swift decisions. The team and I feel responsible for finding solutions for problems that we foresee coming. We see the Moonshot Fund as a solution when urgency and confidentiality are necessary to achieve our goals. It would enable us to sign confidentiality agreements and act swiftly on windows of opportunity that are vital business practices for success. All discussion on this Moonshot Fund is based on an anticipated scenario that the unit deems as an opportunity that can potentially provide great ROI on exposure and recognition.  With gas fees and dust being so high, we are not in the stage for massive marketing campaigns.  Those issues will be tackled, and we simply can’t afford to wait. Each day passing by is a lost opportunity to market DAI and promote the Maker protocol. Based on a SWOT analysis, one can see that even though Dai captures all the advantages of blockchain, its growth has lagged behind centralized stablecoin. Without a more aggressive approach, it could potentially put MakerDAO further behind others. This needs to tackled on many fronts, and marketing is one of the vital ways for MakerDAO to grow.  Will the fund be safu?  The fund will be held in a separate multisig and jointly held by three to five facilitators. That limits the scope of those with confidential information and protects MakerDAO from losing the fund. One idea is to set up a committee with the same members and invite them as observers in the process.  I still don’t see the value of the moonshot fund.  Apple’s “Think Different” TV ads and AOL’s free trial CDs are some excellent examples of how we can creatively approach our target audience. Apple’s ad touches people in so many ways without a word on computers. AOL’s CD campaign successfully onboarded millions of users. That is what the potential of a moonshot fund can offer. ",
                    "links": [
                        "https://www.cnbc.com/2021/03/26/crypto-industry-to-get-first-major-us-stadium-with-miami-dade-county-approving-ftx-for-heat-home.html",
                        "https://docs.google.com/spreadsheets/d/1lEO2qNE_hZCmDjIgW1dqNsQna8F08EjFlE3wUS9fFWU/edit?usp=sharing",
                        "https://youtu.be/cpzvwkR1RYU",
                        "https://www.mentalfloss.com/article/87291/youve-got-mail-history-aols-free-trial-cds#:~:text=According%20to%20some%20estimates%2C%20AOL,in%20a%20matter%20of%20years.",
                        "https://forum.makerdao.com/t/campaigning-vote-no-on-inclusion-poll-for-strategic-marcomms-core-unit-mip-set-may-10-2021/7951/25"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.757693292370711
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#2",
                    "likes": "1",
                    "time": "12/05/2021-11:34:40",
                    "content": "Let me highlight this is what’s at stake.     Kathleen:  Each day passing by is a lost opportunity to market DAI and promote the Maker protocol. Based on a SWOT  analysis, one can see that even though Dai captures all the advantages of blockchain, its growth has lagged behind centralized stablecoin. Without a more aggressive approach, it could potentially put MakerDAO further behind others. This needs to tackled on many fronts, and marketing is one of the vital ways for MakerDAO to grow.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#3",
                    "likes": "4",
                    "time": "12/05/2021-12:06:52",
                    "content": "    Kathleen:  Each day passing by is a lost opportunity to market DAI and promote the Maker protocol. Based on a SWOT  analysis, one can see that even though Dai captures all the advantages of blockchain, its growth has lagged behind centralized stablecoin   This is not the right picture at all. Right now, DAI trades above $1 because there’s too much demand and not enough supply for it. DAI’s growth problem on the supply side is a far bigger issue than that on the demand side. We’re actually filling up our PSM with USDC because of this. At the very least, there is no urgent need for marketing - maybe there is a long term one but that’s debatable. Secondly, you’re conflating the $5M moonshot with the general marketing budget. If you do want to get word of DAI and Maker out, that can start without this moonshot fund. How about getting on Twitter, on Reddit or YouTube first and make some progress there? Maker’s presence in all these areas is patchy and this is low hanging fruit that needs very little budget. Thirdly, Apple and AOL are your go-to examples of what the moonshot fund might achieve. Those campaigns were two out of millions of equally well-funded and well-conceived campaigns. This is survivorship bias! This cannot be a valid CU strategy. You cannot throw money at the problem until you get that kind of response - that’s not how things work, especially not in the internet-era (both those examples are pre-internet examples). And lastly, some of your answers certainly put the WTF in WTFAQ.     Kathleen:   What do other advertising experts say about this?  Someone with years of experience at a well-known advertising agency: The level of the fund sounds about right, and it is needed as it opens up the potential conversations with offers and opportunities. Marketing veteran: Those deals are likely to be offered on a confidentiality basis, which means no details can be disclosed.   Honestly, is this even an answer? Random unverifiable sources that purportedly vaguely agree with what you have to say? This is really absurd - where is the evidence based discussion? You’re literally saying \"Please allocate 5M to us because “marketing veteran” and “guy who worked a long time in advertising” think that’s about right.     Kathleen:   Why can’t the unit apply for the funding when the time comes?  There are great opportunities offered in the past that require swift decisions. We see the Moonshot Fund as a solution when urgency and confidentiality are necessary to achieve our goals   I would have hoped that million dollar deals get carefully evaluated and considered, not get “swiftly” decided. Not sure how many people you’re planning to include in the confidential talks with partners but that’s far too much pressure on each of them to decide. You’re going to be asking them to decide whether hundreds of thousands of dollars need to be spent and giving them barely any time to think about such decisions - a recipe for bad decisions. This is very very poor judgement on display here. This along with my other concerns about your track record leaves me questioning if you are the right person to be leading Maker’s marketing efforts. ",
                    "links": [
                        "https://forum.makerdao.com/t/are-we-having-a-loud-minority-problem/7972/13"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.989128151260504
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#4",
                    "likes": "0",
                    "time": "12/05/2021-12:31:06",
                    "content": "    AstronautThis:  This is not the right picture at all. Right now, DAI trades above $1 because there’s too much demand and not enough supply for it. DAI’s growth problem on the supply side is a far bigger issue than that on the demand side. We’re actually filling up our PSM with USDC because of this. At the very least, there is no urgent need for marketing - maybe there is a long term one but that’s debatable.   Your opinion is welcome, but when someone see things differently, that doesn’t make them wrong, or more right than you do. When it comes to stablecoin, If we are willing to take a step back and look at the big picture, DAI is not that significant. As someone who is all for unbiased currency and a foundation member, I would love to say it is, but it is not. There are many reasons and yes I have been following our ups and downs in the past two years, but DAI is not where it can be in the world of stablecooin. That’s going to change and that’s why my team and I believe in this community. I know you probably think otherwise, which is fine.     AstronautThis:  Secondly, you’re conflating the $5M moonshot with the general marketing budget. If you do want to get word of DAI and Maker out, that can start without this moonshot fund. How about getting on Twitter, on Reddit or YouTube first and make some progress there? Maker’s presence in all these areas is patchy and this is low hanging fruit that needs very little budget.   It is about the level of impact and the scale of impact, not where we can make impact.     AstronautThis:  Thirdly, Apple and AOL are your go-to examples of what the moonshot fund might achieve. Those campaigns were two out of millions of equally well-funded and well-conceived campaigns. This is survivorship bias! This cannot be a valid CU strategy. You cannot throw money at the problem until you get that kind of response - that’s not how things work, especially not in the internet-era (both those examples are pre-internet examples).   They are not my go-to examples. I used FTX. And let me point out this isn’t a strategy, but a description and a vision of where a marketing CU can achieve. For strategy, it’s best to go through the proposal. And exclamation makes it sound like you are upset which isn’t what the FAQ is meant for.     AstronautThis:  Honestly, is this even an answer? Random unverifiable sources that purportedly vaguely agree with what you have to say? This is really absurd - where is the evidence based discussion? You’re literally saying \"Please allocate 5M to us because “marketing veteran” and “guy who worked a long time in advertising” think that’s about right.   The FAQ is meant to help people understand and I am quoting individuals who may join the team when the proposal is passed.     AstronautThis:  I would have hoped that million dollar deals get carefully evaluated and considered, not get “swiftly” decided. Not sure how many people you’re planning to include in the confidential talks with partners but that’s far too much pressure on each of them to decide. You’re going to be asking them to decide whether hundreds of thousands of dollars need to be spent and giving them barely any time to think about such decisions - a recipe for bad decisions.   I would hope the same. If I were in your shoes, I would find it hard to understand too. That’s why I created this to help people understand. Please also read it carefully, I am not asking others to decide, one idea is to have them join as observers.     AstronautThis:  This is very very poor judgement on display here. This along with my other concerns about your track record leaves me questioning if you are the right person to be leading Maker’s marketing efforts.   You are entitled to your opinion. I think the community can benefit from and tolerate different views and opinions. That’d make MakerDAO strong. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.358741928974979
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#5",
                    "likes": "1",
                    "time": "12/05/2021-13:10:53",
                    "content": "    AstronautThis:  DAI’s growth problem on the supply side is a far bigger issue than that on the demand side. We’re actually filling up our PSM with USDC because of this.   And to be fair, @AstronautThis you have raised a valid point. Hats off to the governance community. All the discussions, ways to get the peg back, PSM, I have witnessed all. It certainly hasn’t been easy to maintain the peg. Regarding to marketing, it is a way to help the ecosystem grow by building our brand, reputation, and help promote and prime potential partnership discussions. It is a long term approach and it isn’t only about boosting near-term demand. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6988095238095235
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#6",
                    "likes": "1",
                    "time": "12/05/2021-20:56:25",
                    "content": "I agree with you, we have to move on, now. If even stronger competition comes like CBDCs and Diam, it will be even more expensive, even harder to gain new customers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.045454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#7",
                    "likes": "5",
                    "time": "13/05/2021-04:28:50",
                    "content": "@Kathleen thanks for your response. I think our disagreement about your strategy and the way you seek to execute it are fairly fundamental. I think we agree on this at least! I think I am happy for people to read both our sides here and decide for themselves. That said, I’d like to just say that while different opinions are always welcome, there is a point where facts and logic should also be considered (e.g. when I say DAI is currently above $1 due to demand exceeding supply). I will also add for the record that while my reservations about your strategy and your record remain, I do not think you’re engaging in bad faith or trying to swindle the DAO out of money. I am happy to engage either publicly via a thread or privately via DM to help, should you want my opinion with the future of your unit. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#8",
                    "likes": "4",
                    "time": "13/05/2021-04:55:10",
                    "content": "@AstronautThis  I want to say thank you for taking the time to give your input and thoughts into the proposal. You highlighted the issue of supply/demand unbalance. As mentioned in the proposal, the unit seeks to evolve with the community and address the needs of MakerDAO. Marketing can potentially solve the problem of supply-demand unbalance by getting more vaults opened. It can be done through promotion and marketing that open doors of opportunity, leading to conversations about partnerships. I will certainly reach out and seek your advice for the unit in the near future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.678571428571429
                }
            ]
        }
    ]
}