{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/its-time-for-a-second-governance-facilitator/1998",
            "title": "It's time for a second Governance Facilitator ",
            "index": 1998,
            "category": [
                "Governance"
            ],
            "tags": [
                "gov-facilitator"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#1",
                    "likes": "29",
                    "time": "16/04/2020-05:07:53",
                    "content": "Hi Community, It’s been a very long road that has lead from our first governance call to where we are now. From discovering together what we wanted from governance, to testing out ideas as we internalised the governance framework, to finally coming together as an ecosystem to make some pretty weighty decisions. My own role has developed as well. From the guy who modded our subreddit, to Head of Community Development, to being ratified by the community as the first Interim Governance Facilitator. Some of the hallmarks of the culture we’ve built here are iteration and bootstrapping. It’s becoming increasingly clear to me that the bootstrapping phase of the IGF role is over and now it’s time to iterate, and fullfill the promise made in the original IGF Mandate. Namely, that the IGF role is singular until such time as a community member can be found to take up the mantle and change the singular into a team of Governance Facilitators. I’d like to ask the community to consider ratifying LongForWisdom as their first representative Governance Facilitator. Why LongForWisdom?  He’s has shown exceptional leadership skills Highly coordinated Has incredible tenacity Very technically proficient Deeply unimpressed by titles held by Foundation personnel ( ) Excellent insight into the protocol and the governance ecosystem He’s lead numerous initiatives:  Establishing general processes Forum moderation Created the signalling guidelines Took a leadership role in the collateral onboarding group A member of the Community PR team Mentored and onboarded new governance stakeholders Closely tracked and fostered debate and development of new community proposals Launched governance at a glance initiative Project managed the mkrgov.science grant Highly engaged in providing a community based perspective to the MIPs architects    Most importantly, he’s extremely principled and, I truly believe, is fiercely dedicated to the ideals that have attracted the community to this project. Essentially, he’s done the vast majority of the things that I’d intended to do myself when I naively stepped into the role… So: I would like to ask that LFW formally signals his intention to represent the community as it’s first Governance Facilitator. What does the community think? ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-april-23-9am-pst-4-00-pm-utc/2145/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-april-16-9am-pst-4-00-pm-utc/1996/3",
                        "https://forum.makerdao.com/t/mip0c12-sp2-subproposal-for-core-personnel-onboarding-governance-facilitator/2351"
                    ],
                    "GPT-summary": "The author of the post is proposing LongForWisdom as the first representative Governance Facilitator and explaining why he is the best candidate for the role. The post also asks for feedback from the community on the proposal. The post receives entirely positive feedback from the author and constructive criticism from the community. The post also extends the proposal to the community and invites collaboration.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.015732323232323
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#2",
                    "likes": "2",
                    "time": "16/04/2020-05:38:27",
                    "content": "ill signal my support @LongForWisdom  kills it on these forums/reddit/governance calls. Can’t wait to hear from the man himself though. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "2",
                    "time": "16/04/2020-07:06:40",
                    "content": "Emphatic Yes thirded for @LongForWisdom for GF. caveated of course on his acceptance of the position. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adrianhacker-pdx",
                    "index": "#4",
                    "likes": "4",
                    "time": "16/04/2020-08:48:34",
                    "content": "The one-person media team of MKR Holder’s DAI-gest would like to endorse @LongForWisdom as IGF Co-facilitator.  I’m relatively new in the community, four months, and he has been friendly and straight forward in orienting me to the DAO.  Plus, I just believe anything said in a British, British? Australian? British…accent. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.592803030303031
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#5",
                    "likes": "2",
                    "time": "16/04/2020-08:53:45",
                    "content": "I signal my support for @LongForWisdom . Having worked with him on the collateral onboarding MIPs I believe he will be a great asset for Maker going forward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/andytudhope",
                    "index": "#6",
                    "likes": "7",
                    "time": "16/04/2020-08:54:23",
                    "content": "Coercion by friendly forum post. What a time to be alive   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#7",
                    "likes": "2",
                    "time": "16/04/2020-13:31:53",
                    "content": "Same, I fully support having @LongForWisdom for this position. We’re lucky to have him. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "2",
                    "time": "16/04/2020-14:49:09",
                    "content": "Niiice!! Well Deserved LFW–will pencil you in  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "8",
                    "time": "16/04/2020-15:27:12",
                    "content": "I’ll do a proper response to this over the next few days. Just wanted to thank Rich and everyone for the kind words.     andytudhope:  Coercion by friendly forum post.   Just to put peoples minds at ease, Rich did discuss this with me before posting this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0892857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/andytudhope",
                    "index": "#10",
                    "likes": "2",
                    "time": "16/04/2020-16:32:19",
                    "content": "My mind is consistently at ease, to the point where some might even call its inner working nothing more than pulped fiction… Looking forward to your considered response brother  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#11",
                    "likes": "3",
                    "time": "17/04/2020-14:15:38",
                    "content": "LFW has my vote 1000000000000% Absolute star of a community member. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#12",
                    "likes": "1",
                    "time": "17/04/2020-19:01:11",
                    "content": "I second this ! @LongForWisdom Great work and communication like usual. Keep up the good work sir, i vote for ya!     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.78125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#13",
                    "likes": "3",
                    "time": "20/04/2020-10:57:41",
                    "content": "Right, so Governance Facilitator. My first impressions of this when Rich suggested it were ‘your job is horrible, why would I want to do it?’ That said, there are some fairly compelling reasons why I feel like I should do it.  It’s a concrete step towards decentralization of the DAO. Rich is overworked, and is often not able to give the role his full attention (though to be fair, he does a great job of balancing it with his other responsibilities.) Having a second facilitator should help to increase coverage. At this stage, there don’t appear to be viable alternative candidates (this is not meant to throw shade on anyone/everyone, if you disagree, please make yourself known)  The plan has always been to have multiple facilitators sharing the work and representing different geographic groups. My hope is that we can get there as quickly as possible, but ultimately someone has to be first. So, with all this in mind, I’d be willing to take the role, if you’ll all have me. Once we have other Facilitators in place, I may re-evaluate and either decide to step down or aim to move into a different role.  If I am to join Rich as a new Governance Facilitator though, there are several issues that need to be addressed. I’ll speak to these below. The Mandate The Mandate was written a good while ago. While there are many points in it that are very relevant, it’s a long document that has aged somewhat. Before a ratification vote takes place, I want to take the change to clean up that document and present a more compact list of roles, responsibilities and selection criteria. My hope is to add this to MIP0 before MIPs are ratified to match the MIP Editor Role that is defined in that document. Having the role and responsibilities as part of MIP0 would also allow me to be onboarded using the onboarding subproposals in MIP0, which I think is important in terms of giving the MIPs and the ratification legitimacy. Impartiality Are the Governance Facilitators supposed to be impartial on governance issues? I enjoy weighing in on the issues we are all facing. As a Governance Facilitator, will I be required to keep those views to myself? Naturally I'll attempt to approach and treat both sides of an issue as objectively as possible, but is sharing my view and voting in public forum polls appropriate? Time Commitment I can't commit to working full-time hours. Luckily, I don't think that the Facilitator Role necessarily requires that many hours, but I want this to be made clear upfront.  Salary What do you all think a Governance Facilitator should be paid? Should they be paid hourly, or a fixed rate per month? At some point (not initially) this money is going to come out of the protocol, so I think it makes sense to look for input at this stage. My plan is to try to replicate whatever the consensus is with Rich through the grants program, though of course the final decision will lie with him. Conflicts of Interest and Centralisation of Power Conflicts of interest is perhaps too strong of a title for what I’m describing, but I do a number of other things in the community that are appropriate for a community member to do but may not be appropriate for a Governance Facilitator to do. Here’s a list of everything I’m currently doing, along with my judgement of whether it’s potentially problematic given centralisation of power and conflict of interest concerns. Please comment if you have strong feelings around these. I can go with my gut on each issue, but I’d love as much input as possible from the community. Product Managing the mkrgov.science dashboard This is probably okay, but could become problematic in the future. I have input into the scoping and choice of work done. My intention is to use that input to improve the metrics available to the community however that input could be used maliciously to stall or push metrics according to an agenda. Thus far there are no competing dashboards that show similar governance metrics. Collateral Onboarding Group I took a leading role in the development of the Collateral Onboarding Document. This work has mostly finished now, and the group is having ongoing discussions as to whether it should dissolve or if it’s mandate should change to suggesting and pushing collateral types for onboarding. If the group does move in that direction, it may be better that I leave the group. Forum Management I don’t think there is a large problem here. I think this is intended to be covered by the Governance Facilitator role. Includes very light moderation, managing tags, providing navigation aids and generally working to make everything as easy to navigate as possible. Governance At A Glance I write Governance At A Glance every week, and I go through it on the Governance and Risk calls. Previously I would have felt this was a risk, however considering that @adrianhacker-pdx is now producing Dai-gest, there is an uncorrelated alternative source of weekly summary. Given that an alternative exists, I would be comfortable continuing Governance at a Glance. SourceCred Trial Ironically there may now be less of a conflict of interest here. I strongly expect that if we end up adopting SourceCred for the long-term that ‘official’ domain role will be excluded from payment through SourceCred to prevent double-dipping. In the short-term I already planned to exclude myself from the trial, so no change there. MIPs The Governance Facilitators should probably be prevented from acting as the author on MIPs due to their role in the governance and ratification process for those MIPs. I do not expect this to be an issue as my direct work on MIPs will end before I am ratified as Governance Faciliator. Governance Documentation I’ve written / helped collate a number of governance documents that currently live on the Comm-dev portal. Given that Rich already moderates what can and can’t appear on the comm-dev portal, I don’t believe that there are any additional conflict of interest or centralisation concerns here. Community Communications Group I’m currently semi-involved in the community communications group under the title ‘governance liaison.’ The group is new, and this role hasn’t been decided or fully specified yet. However, as the comms group is the initial form of what we hope to one day be a full domain team, it may be inappropriate for the Governance Facilitator to also be a part of that team, even in a liaison capacity.  I think that covers most of my questions, concerns and thoughts. I know there is a lot going on at the moment, and these issues don’t all need to be resolved immediately, but please keep them in mind in the future. ",
                    "links": [
                        "https://community-development.makerdao.com/",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-april-23-9am-pst-4-00-pm-utc/2145/2"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.941579485329486
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#14",
                    "likes": "1",
                    "time": "20/04/2020-12:50:24",
                    "content": "    LongForWisdom:  What do you all think a Governance Facilitator should be paid? Should they be paid hourly, or a fixed rate per month?   I feel strongly that we should try to build a culture of trust and autonomy. Therefore, I am against hourly payment. Hourly sends the message that we don’t trust you to self-manage your time. For background see How To Revolutionise The Way We Work With Aaron Dignan ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#15",
                    "likes": "0",
                    "time": "20/04/2020-12:55:39",
                    "content": "    LongForWisdom:  Are the Governance Facilitators supposed to be impartial on governance issues? I enjoy weighing in on the issues we are all facing. As a Governance Facilitator, will I be required to keep those views to myself?   I see no problem with expressing your opinion as long as you try to be explicit about when you are doing so. This should be easy; start a sentence with “In my opinion” and that’s all it takes. In my opinion, part of the reason that you are nominated to be a gov facilitator is because you have built a track record of well-thought-out opinions. If you are suddenly prohibited from expressing those opinions that I think the community has lost a valuable resource. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.979166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#16",
                    "likes": "1",
                    "time": "20/04/2020-13:32:44",
                    "content": "That’s an interesting perspective. As it stands I track my hours anyway, and would do so even if I were salaried. In many ways I prefer being paid by hour as it means overtime is remunerated fairly and in quieter periods I can slack off without feeling obligated to make more work for myself to justify the salary. I can totally see your point about trust and autonomy though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.199999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#17",
                    "likes": "0",
                    "time": "20/04/2020-14:07:12",
                    "content": "I think you should ask your own salary, not ask opinion about it, you well deserve it i think and i am pretty sure most of contributor here will say the same. If you need help, buzz me up, but you doing a great work, and care too much about what is good or not for YOU You should discuss a salary in private with the selected people, then make it public. Want my opinion on how much  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.704545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#18",
                    "likes": "0",
                    "time": "20/04/2020-14:11:12",
                    "content": "This is what Good Leaders do , they care about other and need their opinion accredited by other, i am like this also, not to move out of the subject. I think we are wasting time on arguments like this. Just an opinion nothing personal or with disrespect. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.283333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#19",
                    "likes": "1",
                    "time": "20/04/2020-14:15:31",
                    "content": "    Sirlupinwatson1:  You should discuss a salary in private with the selected people, then make it public.   I will be doing this with Rich, but I would still like to get some idea of the communities feels towards it. Eventually, they’ll be the ones paying it (through the Protocol). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#20",
                    "likes": "0",
                    "time": "22/04/2020-10:43:40",
                    "content": "    LongForWisdom:  Having the role and responsibilities as part of MIP0 would also allow me to be onboarded using the onboarding subproposals in MIP0, which I think is important in terms of giving the MIPs and the ratification legitimacy.   I have now added the responsibilities and criteria for Governance Facilitator to MIP0. PR is here, for those interested: https://github.com/makerdao/mips/pull/10 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.625
                }
            ]
        }
    ]
}