{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/proposal-use-the-ens-airdrop-to-subsidize-mkr-holder-onboarding-into-ens/11753",
            "title": "Proposal: Use the ENS airdrop to subsidize MKR holder onboarding into ENS ",
            "index": 11753,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "feedback",
                "clean-money"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/sirverik",
                    "index": "#1",
                    "likes": "2",
                    "time": "22/11/2021-03:04:39",
                    "content": "With the recent creation of the ENS DAO and the ENS token airdrop, the MakerDAO treasury has obtained 46,000 ENS tokens. The ENS DAO ratified a Constitution as a foundational document, which can be read here: ENS DAO Constitution - ENS Documentation Articles II and III of the ENS Constituion conform the ENS DAO as a non-profit entity whose revenues will be used only for the purpose of maintaining, developing, and improving ENS. Funds that are not reasonably required to achieve this goal may be used to fund other public goods within web3 as ENS governance sees fit. What is ENS and why is it important? “The Ethereum Name Service (ENS) is a distributed, open, and extensible naming system based on the Ethereum blockchain. ENS’s job is to map human-readable names like ‘alice.eth’ to machine-readable identifiers such as Ethereum addresses, other cryptocurrency addresses, content hashes, and metadata. ENS also supports ‘reverse resolution’, making it possible to associate metadata such as canonical names or interface descriptions with Ethereum addresses.” More info: https://docs.ens.domains/ Essentially, your name on ENS is a portable cross-platform username that you can use for any protocol or application imaginable. Not only is it a web address, but also a human readable identifier for anything: a website, a person, an alias, a server, a sensor, an IP address, an IPFS address, a wallet address, a content hash, a username on an arbitrary service. A single name can support linking to many URIs at once. With a .eth name you can have a name redirect to a website when you type it on a web browser, to an ETH account if you type it on an Ethereum wallet, to an IP address or phone number if you dial the name on VoIP, etc. By allowing identified names to seamlessly connect across all domains of the internet, the web, digital money, smart contracts, IoT, VR, AR, clouds, AI, etc. will all converge into the meta-verse. These names will enable endless decentralized (web3) applications which can replace every centralized service imaginable. DNS, ICANN, Facebook & Google Login, IM, VoIP, Twitter, Instagram, Youtube. You name it. A project like this requires a network effect to succeed. Having the apex name registry of the world hosted on Ethereum would be a necessary component of the ecosystem in a winner-take-all or winner-take-most scenario. Just like DeFi is likely to converge into a single blockchain, so too will names. Winning the namespace is part of winning the blockchain. ENS is the prime candidate. Proposal: As beneficiaries of the ENS Airdrop, the MakerDAO community could choose to use a fraction of the ENS tokens held in the treasury to incentivize holders of MKR to onboard themselves into the .eth namespace. Registering a name on ENS and setting the name as the Primary Reverse record of an Ethereum account requires three transactions, totaling an estimate gas limit of 500,000. At a price of 150gwei and $4500 ETH per DAI, this corresponds to 337 DAI. This is currently a major barrier to entry, but is of course expected to improve as parts of the Ethereum ecosystem including parts of ENS are offloaded to L2, and with the introduction of sharding. The proposal is essentially to offer a rebate on the gas fees to MKR holders who decide to register a .eth name on ENS and set it as a Primary ENS name. Accounts with a certain minimum amount X MKR before a certain date would be eligible to claim a rebate of Y ENS from the treasury after setting up an ENS name for the account. This would allow MKR holders to register on ENS and recover gas costs. The 46,000 ENS tokens have a market value of around 1.8 million DAI. Depending on how we choose parameters X and Y, we could for example allow 1000 rebates of 4.6 ENS, thus vesting a max of 10% of the ENS in the treasury among the top 1000 holders. This is not a profit oriented proposal, and (re)funds are being allocated to larger holders as an exercise in reciprocation with ENS DAO and the Ethereum ecosystem as a whole. It would only make sense for Maker to do this if governance is ideologically aligned with the goal of strengthening the network effects of the Ethereum ecosystem indirectly and long into the future, and if they recognize the importance of the namespace use-case for blockchains. I ask the MakerDAO forum to please provide your valuable insights with regards to this proposal and this type of proposals in general. ",
                    "links": [
                        "https://docs.ens.domains/",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-18-25/11827",
                        "https://forum.makerdao.com/t/signal-request-lp-our-aave-and-ens-with-eth-on-uniswap-v3/15863"
                    ],
                    "GPT-summary": "The author proposes using a fraction of the ENS tokens held in the MakerDAO treasury to incentivize holders of MKR to onboard themselves into the .eth namespace. The proposal is to offer a rebate on the gas fees to MKR holders who decide to register a .eth name on ENS and set it as a Primary ENS name. The author explains the proposal in detail and asks for feedback from the MakerDAO forum.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.510416666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#2",
                    "likes": "0",
                    "time": "22/11/2021-04:39:23",
                    "content": "I’m out of the loop on this one but how did the Maker Treasury qualify for the airdrop? Did that account happen to register an ENS domain? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sirverik",
                    "index": "#4",
                    "likes": "2",
                    "time": "22/11/2021-05:12:37",
                    "content": "A total of 100 million total ENS tokens were distributed as follows: 25% airdrop to .ETH holders (>137k accounts) 25% to ENS contributors (>100 individuals and groups, plus hundreds of Discord users) 50% to the ENS DAO community treasury  We are part of #2 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#5",
                    "likes": "12",
                    "time": "22/11/2021-05:43:56",
                    "content": "Hello @sirverik first of all: welcome to the community! I strongly disagree on doing anything with the ENS airdrop MakerDAO received - the only thing that makes sense from my POV is participating in the ENS governance.  For the sake of simplicity, let’s think of the airdrop as a gift (and there is some kind of backstory why MakerDAO received it in the first place, but I leave this story for others to tell). How does it look from the outside if we receive a gift and then dump it to the market? Helping MKR holders (how would we even decide on that? MKR holding at the moment of getting an ENS domain?) to get onboarded to the ENS product looks like a nice move, but it is neither our domain nor is it worth to spend engineering capacity on that - would mean we will have fewer capacity left to build things we need to grow our own ecosystem. If ENS wants to subsidize on gas costs, ENS could do that on their own. No need to use airdropped ENS for that. The airdrop was for a large portion of the ENS userbase a retroactive airdrop - saying “thank you” to early adopters.  How could MakerDAO participate in ENS governance is a whole different and also complicated topic. It feels it has no real priority right now but as long as we haven’t sorted that out, let’s just keep it as part of our treasury and not play around with it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.061553030303031
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sirverik",
                    "index": "#6",
                    "likes": "0",
                    "time": "22/11/2021-06:39:41",
                    "content": "Thank you for your comments, @ ultraschuppi. Regarding observation 1; the intention of the proposal is not to dump ENS into the market, but instead inviting participants of MakerDAO to be users of ENS and receive part of their gas cost back in ENS token. ETH would be thrown into the ENS contract as registration fees and into the EVM as gas fees, then only the ETH spent for gas would be reimbursed with ENS. The ultimate fate of this ENS would be determined at the discretion of each recipient. I do imagine that a substantial portion of those tokens would be dumped to market, but only after a registration took place which provided added value to the ENS ecosystem. I also suspect that another substantial portion of the recipients would choose to hold their ENS tokens and perhaps participate in governance. If you look at it from the point of view of ENS DAO, it may seem like a decent trade-off, considering eligibility for the reward correlates with a certain familiarity with DAO governance and closeness to a community of crypto researchers, developers, and disseminators. The members of this community may be of high value to the ENS user base. Regarding observation 2, for fairness it would make sense to use a cutoff date for eligibility that predates this proposal (has to have held X MKR at the time), and the name registration would have to take place after the announcement of the rebate. I agree that this is out of left field with respect to the operation of MakerDAO and that something of this sort should only be implemented if there is engineering power to spare, for instance if enough people want to help voluntarily. It also would only make sense if a lot of potentially eligible persons show an interest in the first place. Your third observation is very compelling. I have no argument there, other than to clarify that we would not subsidize gas costs on behalf of ENS, but on behalf of MKR holders who see value in onboarding into ENS namespace and/or governance. While keeping in mind that the goal of this is to create external value for the ecosystem through reciprocation, I am generally in favor of trying to deliver perks and value to MKR holders in any other way additional to burning MKR, including airdropping NFTs to MKR holders (another proposal I read on this forum) or even onboarding MKR as collateral (controversial, I know) thus allowing MKR holders access to the financial product of their own DAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.256448412698412
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ianaz",
                    "index": "#7",
                    "likes": "5",
                    "time": "22/11/2021-09:35:49",
                    "content": "Hi @sirverik  I agree with @ultraschuppi, especially on his second point about engineering capacity.     sirverik:  The proposal is essentially to offer a rebate on the gas fees to MKR holders who decide to register a .eth name on ENS and set it as a Primary ENS name.   This sounds very expensive for engineering for the little benefit it would bring and even if the community does it, we’d still have to allocate core resources for review etc., am I right? I’d prefer to keep the ENS tokens for now ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.891581632653061
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#8",
                    "likes": "0",
                    "time": "23/11/2021-04:43:22",
                    "content": "Alternatively, we could be selling the ENS tokens for MKR and either keep them in the treasury or burn them. It’s not fully clear to me if ENS tokens are going to have long-term value making it worth hodling. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#9",
                    "likes": "1",
                    "time": "23/11/2021-14:37:33",
                    "content": "@ultraschuppi not that I disagree necessarily with anything you said but:     ultraschuppi:  For the sake of simplicity, let’s think of the airdrop as a gift […] 1. How does it look from the outside if we receive a gift and then dump it to the market?   I think this (gift) is not what actually happened. MakerDAO got ENS due to:     sirverik:  25% to ENS contributors (>100 individuals and groups, plus hundreds of Discord users)    I am kind of skeptical about this:     ultraschuppi:  the only thing that makes sense from my POV is participating in the ENS governance.   because participating in governance is very costly (in terms of time, resources, etc), and we don’t want to participate in the Governance of every protocol that airdrops us some tokens. NOTE: ENS is very cool, and it might make strategic sense for MakerDAO to participate in their Governance. But this should be discussed and, eventually, voted (not urgent at all). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3500000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#10",
                    "likes": "4",
                    "time": "23/11/2021-15:16:10",
                    "content": "    iammeeoh:  because participating in governance is very costly (in terms of time, resources, etc), and we don’t want to participate in the Governance of every protocol that airdrops us some tokens.   Off-topic here, but it does not have to be costly. We could also just delegate to one/some of the >1000 ENS-delegates - I already spotted @monet-supply and @MakerMan on the list, and I will be active there as well. I am also fine with just keeping it in the treasury for now until we have the bandwidth to do something with it. I just want to avoid dumping it right now  ",
                    "links": [
                        "https://discuss.ens.domains/t/ens-dao-delegate-applications/815/742",
                        "https://discuss.ens.domains/t/ens-dao-delegate-applications/815/1153",
                        "https://discuss.ens.domains/t/ens-dao-delegate-applications/815/881",
                        "https://forum.makerdao.com/t/signal-request-restart-the-burn-v2/14918/54"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.961309523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sirverik",
                    "index": "#11",
                    "likes": "2",
                    "time": "23/11/2021-23:09:57",
                    "content": "I have now realized that it makes a whole lot more sense for ENS DAO to do this than for MakerDAO to do it. Regarding Maker participating in ENS governance, I think sitting on the ENS tokens is a valid form of participation and reciprocation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#12",
                    "likes": "1",
                    "time": "02/12/2021-05:00:49",
                    "content": "    ultraschuppi:  I am also fine with just keeping it in the treasury for now until we have the bandwidth to do something with it. I just want to avoid dumping it right now   Genuine questions about this  Will there ever be a time when we have bandwidth for careful consideration of how to deal with it? I can see it being forgotten quickly, even if we have some delegates on both projects. Dumping it makes it sound bad but what it is the endgame here from MakerDAO’s point of view? Hodl till the moment is right and sell? If yes, that moment is going to be hard to identify too.  To me, it seems like there’s no good reason to hold it - it just adds to the list of things we need to think about. With all due respect to ENS, there’s been lots of governance tokens that have a lot of fanfare at the start but slowly lose value over time with respect to ETH. See for example UNI.  Screenshot 2021-12-02 at 12.59.40 PM1320×474 35.1 KB  I’m thinking of making an SR about this but would like to hear your thoughts since you’re actively involved in both ENS and MakerDAO. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.13265306122449
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Breezy",
                    "index": "#14",
                    "likes": "0",
                    "time": "26/02/2022-06:20:51",
                    "content": "Hi, what was the end result?  Are we doing anything with the ENS tokens?  Have then been sold? Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#15",
                    "likes": "0",
                    "time": "26/02/2022-10:22:41",
                    "content": "    Breezy:  Hi, what was the end result? Are we doing anything with the ENS tokens? Have then been sold?   No, we have not sold them. They are currently in our treasury: makerburn.com ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#16",
                    "likes": "0",
                    "time": "11/10/2022-10:35:39",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}