{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-budget-simulator-11-1-revenue-cash-flow-forecast/12364",
            "title": "MakerDAO Budget Simulator - 11+1 Revenue & Cash Flow Forecast ",
            "index": 12364,
            "category": [
                "Updates"
            ],
            "tags": [
                "financial-report"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#1",
                    "likes": "11",
                    "time": "24/12/2021-17:02:02",
                    "content": "All, Please find the 11+1 Revenue and Cash Flow Forecast here. All existing and prospective Core Units are listed with an associated status, as well as corresponding MKR budgets if applicable. All CU expenses are included in the forecast and P&L calculations. We are forecasting to finish 2021 at nearly 13x 2020 FY revenue, the rolling 12 month forecast is even more favorable due to an increase in ETH-A and W-BTC SF rates - if the current market remains stable we would expect $157.8M in revenue next year    Forecast Assumptions: Stability Fee Rates: maintain stable at current levels Liquidation Fees: prior six month average. In September we saw a significant increase in crypto price volatility, leading to $3.5M in liquidation fees. If crypto markets stabilize or downward volatility decreases, it is likely less liquidation fees will be generated. Trading Fees: prior three month average. Opportunities to drive incremental revenue not included in forecast:  Nearly $3.2B USDC and $500M USDP in the PSM that could be invested to earn interest (see @rune’s thread  on investing these assets in ESG credit. Scaling Real World Assets (NS-DROP $20M, SolarX $21M, 6S $15M, FortunaFi $15M, Treasuries), etc. Investing in DAI Integrations (i.e. Compound D3M, Maple D3M) Onboarding additional Staked ETH collaterals Institutional vaults, SushiLPs, CropJoin  As a reminder, non-cash expenses reflect the MKR compensation; green highlighted plans have been approved and red are placeholders. While these expenses impact Net Protocol Income, there is no impact on cash flow. While cash flow is positive, the SB will increase by 1M Dai per week and excess MKR will continue to be burned. However, this model assumes a safe scenario where no MKR is burnt until the SB is above risk targets, which we are currently below. For a detailed breakout of actual expenses incurred to date, please see the following thread and spreadsheet. As with all models we share, please feel free to download and include your own inputs and assumptions. If you have any questions, please let me know. ",
                    "links": [
                        "https://forum.makerdao.com/t/the-case-for-clean-money/10684",
                        "https://forum.makerdao.com/t/makerdao-actual-expenses-vs-budget-november-2021-now-with-mkr-vesting/12358",
                        "https://forum.makerdao.com/t/weekly-relay-dec-14-2021-jan-3-2022/12463",
                        "https://forum.makerdao.com/t/forum-at-a-glance-dec-16-2021-jan-6-2022/12507",
                        "https://forum.makerdao.com/t/relay-semanal-14-de-diciembre-de-2021-3-de-enero-de-2022/12531",
                        "https://forum.makerdao.com/t/maker-governance-review-2021/12478"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.483445566778899
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#2",
                    "likes": "5",
                    "time": "24/12/2021-19:21:34",
                    "content": "This is great @Aes, Like you, I believe that the opportunities to drive incremental revenues for the protocol are endless. Although each would require deep analysis.     Aes:  Nearly $3.2B USDC and $500M USDP in the PSM that could be invested to earn interest (see @rune’s thread  on investing these assets in ESG credit.   I personally would not feel comfortable to deploy the proprietary part of the balance sheet, with significant liquidity and credit quality requirements, without a very deep understanding of the liquidity profile of all assets and liabilities and a proper ALM exercise.     Aes:  Investing in DAI Derivatives (i.e. Compound D3M, Maple D3M)   I would include Maple among so-called real-world assets rather than a derivative of some kind. Maple, like other platforms, would simplify the access to business financing for Maker via performing onboarding, KYC, ALM, technical wrapping, and risk tranching, but the type of exposure that the protocol would get is mainly credit risk. Obviously we should technically get exposed to a credit derivative, i.e. a tranched note written vs cash flows that ultimately are structured into a derivative instrument, but if we look at it like that, everything is a derivative. Thanks for providing the excel as usual, it is useful for the geeks among us  Merry Christmas! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.662280701754386
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MungoBlakey",
                    "index": "#3",
                    "likes": "1",
                    "time": "27/12/2021-03:05:49",
                    "content": "Thanks for all your hard work this year! I know everyone in the DAO appreciates all the update posts on the forum and I wish you a happy new year! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.007339015151515
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "0",
                    "time": "27/12/2021-10:33:11",
                    "content": "@Aes I am looking at how you are accounting for cash vs. non-cash expenses and trying to understand why the non-cash expenses are additive? My inclination since these are an expense to actually subtract them from revenue, but if they are subtracted in the cash line (as the cash value) and re-added in the non-cash line because they are income then it becomes a neutral earning line vs. what I would expect which would be a negative vs. a positive or neutral. Can you please explain this because it has a significant effect on when one looks at revenues to expenses.   99.1M earnings on 157M revenues looks a lot better than 68.6M earnings on 157M revenues. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.802272727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#5",
                    "likes": "3",
                    "time": "27/12/2021-16:48:55",
                    "content": "    MungoBlakey:  Thanks for all your hard work this year! I know everyone in the DAO appreciates all the update posts on the forum and I wish you a happy new year!   Appreciate the kind words Mungo, glad you’ve found our reporting helpful      MakerMan:  I am looking at how you are accounting for cash vs. non-cash expenses and trying to understand why the non-cash expenses are additive?   Expenses are listed as total and non-cash expenses, not cash and non-cash expenses. Non-cash expenses are expenses that hit the Income Statement but do not have an actual cash transaction - common examples include depreciation, amortization, and stock-based compensation (100% of MakerDAO’s non-cash expense). Many public companies report non-GAAP earnings which exclude stock-based compensation as a cost which I believe is quite deceptive to investors (GAAP includes it). Warren Buffet explained it well in his 2015 letter to shareholders: \"…it has become common for managers to tell their owners to ignore certain expense items that are all too real. ‘Stock-based compensation’ is the most egregious example. The very name says it all: ‘compensation.’ If compensation isn’t an expense, what is it? And, if real and recurring expenses don’t belong in the calculation of earnings, where in the world do they belong? Wall Street analysts often play their part in this charade, too, parroting the phony, compensation-ignoring ‘earnings’ figures fed them by managements. Maybe the offending analysts don’t know any better. Or maybe they fear losing ‘access’ to management. Or maybe they are cynical, telling themselves that since everyone else is playing the game, why shouldn’t they go along with it. Whatever their reasoning, these analysts are guilty of propagating misleading numbers that can deceive investors.\" ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.504799268192126
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tobalgarcia",
                    "index": "#6",
                    "likes": "0",
                    "time": "27/12/2021-21:03:05",
                    "content": "@Aes thanks for sharing and explaining this. I love how Maker prioritizes its transparency. I have doubts about what I understood on each breakdown, could you help me to know if I’m correct please?:   Rolling 12m Revenue Fcst: Means expected revenue for all 2022.   2021 Revenue Breakdown:   NovYTD: Revenue until November 30.  To Go: Expected revenue for Dec 2021.  11+1 Fcst: Expected revenue for all 12 months of 2021 (NovYTD + To Go).    MakerDAO PnL (Rolling 12 months): Expected PnL for all 2022.   Thanks again! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.392857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#7",
                    "likes": "2",
                    "time": "28/12/2021-14:57:41",
                    "content": "Hi Tobal - please see below comments in bold to the right     tobalgarcia:    Rolling 12m Revenue Fcst: Means expected revenue for all 2022. - this is correct if current market conditions persist and only includes current revenue drivers (excludes opportunities listed in the OP). We’re not at the point yet where we can reliably predict revenue and income due to how volatile the market and rates are - this past year we’ve seen ETH-A rates as high as 5.5% and a slow as 2%.  2021 Revenue Breakdown:  NovYTD: Revenue until November 30. - yes   To Go: Expected revenue for Dec 2021.- yes   11+1 Fcst: Expected revenue for all 12 months of 2021 (NovYTD + To Go). - yes   MakerDAO PnL (Rolling 12 months): Expected PnL for all 2022. same as above rolling 12m, though based on CU budgets rather than actual spend. Once we have some more visibility to CU expenses we will be able to forecast the expense side with more accuracy     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.316854636591479
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "28/03/2022-14:58:24",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}