{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussing-anchor-protocol-as-a-competitor-to-maker-vaults/9837",
            "title": "Discussing Anchor Protocol as a competitor to Maker Vaults ",
            "index": 9837,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "competition"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/autobot98765",
                    "index": "#1",
                    "likes": "2",
                    "time": "13/08/2021-09:16:23",
                    "content": "  twitter.com    Joseph @Josephliow    To the owners of the 2,300,732 ETH locked as collateral to mint DAI, in a few days you're about to have a better option. https://t.co/1x5GWobU96   4:04 AM - 12 Aug 2021           320                120            Thoughts on this, guys? *Post was flagged as spam / advertising for being too short. So I’ll explain more (thought this was self-explanatory): In a couple of hours time, bETH will be launched on the Terra blockchain which will allow stakers to borrow UST and earn a net APR of 30% (currently). Locked ETH in Oasis vaults cannot and do not generate any yield, and incur a 2% stability fee on borrowed DAI. In a world of rational decision-makers, borrowers will shift their ETH collateral to Lido Finance to be paid to borrow UST on Anchor Protocol. In time, Maker will gradually lose its market dominance to Terra if all things stay equal. Thoughts? ",
                    "links": [
                        "https://twitter.com/Josephliow/status/1425669404407250945",
                        "https://twitter.com/Josephliow/status/1425669404407250945",
                        "https://t.co/1x5GWobU96",
                        "https://twitter.com/Josephliow/status/1425669404407250945"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.571428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "13/08/2021-09:35:16",
                    "content": "Feels like spam / advertising. If you want to start an actual conversation about it put some more effort into the post. Resolved below. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/autobot98765",
                    "index": "#3",
                    "likes": "0",
                    "time": "13/08/2021-10:12:03",
                    "content": "Thanks for your feedback - I have elaborated as per your request. To be honest, I am just flagging a potential business model issue / competitor. If this can’t even get properly discussed on in a governance forum, then I think Maker is headed for a tough ride. Try to look at substance over form of the post please? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.411111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "8",
                    "time": "13/08/2021-10:17:04",
                    "content": "    autobot98765:  If this can’t even get properly discussed on in a governance forum, then I think Maker is headed for a tough ride. Try to look at substance over form of the post please?   Here’s the thing man, you:  Are an infrequently posting account with a bot-like username. You posted a link to a twitter post which essentially boils down to ‘please switch to using us instead of Maker’ You posted it with 4 words of commentary.  If I’ve mischaracterized you here, my apologies, but perhaps you can see why this might be seen as spam content. Since you’ve added the commentary, I’ve re-visibilitied the post. Happy to have discussions about competitors,  less happy to allow competitors to use the forum as an advertising platform - hope you can see the difference here. Also going to modify the title, since as written, it is more clickbait-advertisy than discussiony. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.868055555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/davidkohcw",
                    "index": "#5",
                    "likes": "0",
                    "time": "14/08/2021-16:22:31",
                    "content": "    autobot98765:  In a couple of hours time, bETH will be launched on the Terra blockchain which will allow stakers to borrow UST and earn a net APR of 30% (currently). Locked ETH in Oasis vaults cannot and do not generate any yield, and incur a 2% stability fee on borrowed DAI.   I think potentially it could be, but it’s too early to tell, especially since they are still going through their liquidity mining program (without the incentives, borrowers have to pay ~20% interest).  Although their traction so far has been impressive, having already locked up 28k eth in ~24 hours. I think one of their strongest points though is that Terra is very strong and focused on scaling across multiple chains, whereas Dai is mainly just on Eth at the moment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.965
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#6",
                    "likes": "0",
                    "time": "15/08/2021-16:32:35",
                    "content": "    autobot98765:  Thoughts?   Not only with Terra, but any protocol that allows you to generate interest on the collateral you pledged as security for a loan will be a competitor to Maker. For now I know of Core Units plans that are working to find a way to make this possible, that the collateral is giving you %%%. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "2",
                    "time": "16/08/2021-02:59:16",
                    "content": "Seems relevant, but not an expert here. Perhaps someone more knowledgeable could weigh in, as it’s certainly interesting   Medium – 15 Aug 21    Anchor Protocol: How the dev team rigged liquidations Background  Reading time: 7 min read       ",
                    "links": [
                        "https://medium.com/@_0xfr/anchor-protocol-how-the-dev-team-rigged-liquidations-a188fb87a99f"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#8",
                    "likes": "0",
                    "time": "16/08/2021-12:24:29",
                    "content": "It’s too early to tell and we saw recently that when the market falls, it’s not sustainable to maintain such high APR. And rational decision-making involves not just following APR but including risk analysis and reputation so we will have to see how their system function in extreme market conditions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#9",
                    "likes": "3",
                    "time": "17/08/2021-16:03:00",
                    "content": "I remember when people thought the same about Iron Finance, “the marker killer” or the same with VAI. The black swans arrive and everything falls down, we wait a couple of weeks, and then “The maker killer” arrives again. Curious, isn’t it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5777777777777775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#10",
                    "likes": "1",
                    "time": "17/08/2021-16:49:46",
                    "content": "This is a dangerous trend and unfortunately many people fall for and lose money on these promises. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#11",
                    "likes": "0",
                    "time": "16/11/2021-22:49:56",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}