{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-pax-vault-dc-change/7540",
            "title": "[Signal Request] PAX vault DC change ",
            "index": 7540,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-rejected"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#1",
                    "likes": "4",
                    "time": "17/04/2021-08:44:44",
                    "content": " Overview Pax vault has been used to avoid the PSM, the vault passed from 12M to 20M, while I think it is a good stable coin we can’t just take the risk to hold Pax for 0% return. Also overall we are stabilising Pax more than it stabilises dai.    Pax DC  DC to 0 DC to 50M No change Abstain     0 voters      Next Steps The Poll will run until April 22th; its outcome will either result in a on-chain-poll assuming the outcome of the poll deems it necessary or its intermediate results are going to be taken to another initiative - another signal (lead by the risk team), onchain-poll or urgency executive. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-138-thursday-april-22-17-00-utc/7515/2",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-16-22/7609",
                        "https://forum.makerdao.com/t/maker-relay-ep-41-en-espanol/7614"
                    ],
                    "GPT-summary": "The author of the post is explaining a proposal to change the debt ceiling (DC) of the Pax vault. The proposal suggests changing the DC from 12M to either 0 or 50M. The author believes that holding Pax is too risky for 0% return and that stabilizing Pax is more important than stabilizing Dai. The post includes a poll and outlines the next steps for the proposal. A third party gives constructive criticism by asking questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "2",
                    "time": "17/04/2021-13:49:31",
                    "content": "I Voted no. so far the plan was to shut down (aka: set DC to 0) for the other stable coin vault typed as soon a corresponding PSM is available. It is just taking some more weeks until the SC team will run outside of the foundation, so implementing the PSM for PAX will be doable then. It is not that we are missing out a huge portion of the possible fees just for this short period for time. So it is not hurting us that much, but on the other hand diversifies stable coin risk (a bit). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.414351851851852
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#3",
                    "likes": "1",
                    "time": "17/04/2021-13:58:22",
                    "content": "btw: A similar Signal was done ~2 months ago which got support in the forum and failed onchain. Imho nothing drastically changed in the last two months… So at least the signal should run a bit longer than just 5 days if it needs to run at all ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmfDb77D#poll-detail"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#4",
                    "likes": "0",
                    "time": "17/04/2021-17:25:52",
                    "content": "Interestingly on the signal request you point the only usdc option didn’t win but yet was still proposed 1 week after ;). Also we just went up to 22M and the only reason I can see is to bypass the PSM. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the other topics listed match."
                    ],
                    "Sentiment": 6.550000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#5",
                    "likes": "0",
                    "time": "17/04/2021-17:30:54",
                    "content": "The Signal you are referring to won because it was not about shutting down (DC=0) but also about having a proper replacement for USDC-A. Just shutting down PAXUSD-A without having a PSM is not having any benefit for us ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.481481481481481
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#6",
                    "likes": "1",
                    "time": "17/04/2021-17:33:29",
                    "content": "I don’t see a problem with reducing PAX right now. I think losing out on fees outweighs the stablecoin diversification benefit. Having more PAX in a vault long term is more of a headache/overhead for governance because we may have to sweep it and trade it as opposed to just setting a parameter to 0 and having it deal with itself. I don’t think this is a super big deal whichever outcome wins but just wanted to share my top-of-mind opinion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.335034013605442
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#7",
                    "likes": "3",
                    "time": "17/04/2021-18:03:14",
                    "content": "IMHO it is more a question of continuity. yes, we are losing fees. but how much? The referred increase of 8MM on PAX-A would have generated 8k of fees (assuming tin of 0.1% like we have on PSMUSDC). That’s peanuts. The message we send out by doing that is: “We don’t want to have you here”. We onboarded PAX for a reason, and as long as we don’t have a corresponding PSM the negative message to the outside world does outweight the lost fees. Don’t get me wrong: I am all in for setting DC to 0 on all 0%-stablecoin vaults, but only as soon as we have a corresponding PSM for it. USDC-A shows that this does work pretty good, almost half of the DAI generated from it has been payed back (replaced by PSMUSDC) since we set the DC to 0. This will happen with PAX as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.287878787878788
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#8",
                    "likes": "2",
                    "time": "17/04/2021-18:19:13",
                    "content": "    ultraschuppi:  The message we send out by doing that is: “We don’t want to have you here”. We onboarded PAX for a reason, and as long as we don’t have a corresponding PSM the negative message to the outside world does outweight the lost fees.   This is a good point I did not think about. The PR implications are definitely food for thought. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.3500000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#9",
                    "likes": "0",
                    "time": "17/04/2021-18:24:57",
                    "content": "I fully agree on the fees, Vaults for stable coin are just the wrong solution as it lets the vault owner the timing to unwind. Look at tusd we wanted to unwind it but it is still full and we currently have no solution to empty it. Also Pax is the last stable coin ilk and one of the less liquide. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.652777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#10",
                    "likes": "3",
                    "time": "17/04/2021-18:57:38",
                    "content": "I think it’s completely worth exploring this option, but agree there should probably be a little bit more time on the Signal (especially with it going up on the weekend). I know we try to shoot for a “standard” of two weeks to give time to debate and vote accordingly, so unless there’s some urgency behind turning the DC to 0, I think keeping the poll open for two weeks would be a good place to start @alexis. I am curious as to @Risk-Core-Unit 's perspective on the stablecoin vaults we still have open, I know the grand plan is to have more PSMs for different collaterals, but given the backlog on the SC side I don’t know if we should be considering taking action beforehand. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7355769230769225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#11",
                    "likes": "0",
                    "time": "18/04/2021-07:40:12",
                    "content": "I think more pressing is the question: when will the SC-team be able to deliver the remaining PSMs ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#12",
                    "likes": "5",
                    "time": "18/04/2021-07:57:00",
                    "content": "We all agree that PSMs with significantly regulated stablecoins are the future. Currently, we are relying only on USDC. While we need to remove those legacies from the past, I’m not liking putting everything on USDC, mainly for PR reasons. This would be centralizing our peg management as well. PS: Notice we also have a GUSD-A vault that is also open for business even if smaller (5M DC). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.182291666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#13",
                    "likes": "3",
                    "time": "19/04/2021-15:31:11",
                    "content": "Hi all thanks for taking the time to reply and sorry for the delay. For some reason I thought the running signal request was by default 1 week, I will adjust next time. The main reason of this signal was due to the anormal increase of pax and also the fact that we sort of let the DC as where it was before the PSM. Now that we are nearly half way to the top, it is probably not that important anymore. However I think we need to do something about it as the current setup provide either a way to by pass the PSM and get the fees or an insurance against pax for free. Both on our expenses. I believe we need to sort this out and don’t let it settled. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#14",
                    "likes": "2",
                    "time": "19/04/2021-17:27:19",
                    "content": "Excellent, I think it would be a worthwhile discussion on this week’s Governance and Risk call time permitting! We’ll see how this vote plays out until then and hopefully we can have some discourse around the issue Thursday to help us with next steps. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.708333333333332
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#15",
                    "likes": "1",
                    "time": "22/04/2021-11:40:10",
                    "content": "Hi All, Last day for this poll, If you haven’t given your voice, this is your last chance to do it. Cheers ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#16",
                    "likes": "2",
                    "time": "23/04/2021-09:53:14",
                    "content": "Hi All, This poll is now closed, the no change won and probably for the PR raison. However, it was closed and I will let @LongForWisdom and the Param group to decide what to do next. I don’t think this need to go on chain and Param group should take over. I also believe this poll request was needed to wake us up on this issue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#17",
                    "likes": "0",
                    "time": "23/04/2021-15:22:16",
                    "content": "By integrating PAX, integrating BUSD as well? Well, they are basically not the same. As explained by the CEO of Binance Cz, BUSD is not a Binance product, but a PAX product, they only use the Binance brand. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#18",
                    "likes": "0",
                    "time": "23/04/2021-19:29:53",
                    "content": "PAX has now filled 71M/100M of the vault. Guess we’re gonna have to sweep it eventually or hope they move it when we add a PSM. Free money for them.  Screen Shot 2021-04-23 at 3.29.36 PM954×593 55.4 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#19",
                    "likes": "0",
                    "time": "24/05/2021-05:30:20",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}