{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/what-alternatives-do-we-have-to-restore-the-peg/2295",
            "title": "What alternatives do we have to restore the peg? ",
            "index": 2295,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "rates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/halilakin",
                    "index": "#1",
                    "likes": "4",
                    "time": "01/05/2020-08:20:39",
                    "content": "Given that stability fee is 0%, and cap is $120M, but peg is still 2% above $1, what else can be done other than introducing new assets? Should we entertain the idea of a negative stability fee to encourage borrowing? My long term concern about Maker is that the demand for a stable-coin is always going to be higher than the borrowing. Currently, most ETH is sitting idle because there is no way of staking it. If it becomes heavily staked (e.g Tezos is 75% staked), then I fear we will have even less supply. Curious about others’ opinions. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.972348484848485
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "3",
                    "time": "01/05/2020-09:26:27",
                    "content": "Just onboard more collateral types. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#3",
                    "likes": "0",
                    "time": "01/05/2020-10:54:21",
                    "content": "You’ll never onboard them all so that will definitely work  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#4",
                    "likes": "2",
                    "time": "01/05/2020-11:15:40",
                    "content": "The point about ETH 2.0 when ETH could be staked is excelent. Probably You are right that it is going to increase problems with a peg. My minority opinion is that we should distinguish two values and do not consider them being equal:  Amount of collateral backing up each DAI Price of DAI  and we should stabilize second by lowering first (by minting unbacked DAI and selling them off for MKR), or under opposite circumstances  (high SF, dai below the peg) buying it back. For me it looks like MakerDAO hopes to fight laws of economy with the idea that price of DAI can be allways 1$ under various market conditions, when it is backed by 1$ of collateral. In my opinion utility of DAI and on the other hand opportunity cost of holding DAI will allways fluctuate DAI price around 1$ if collateral amount backing each dai is allways fixed at 1$. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.335357142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#5",
                    "likes": "1",
                    "time": "01/05/2020-12:22:38",
                    "content": "    Adam_Skrodzki:  by minting unbacked DAI and selling them off for MKR   Minting unbacked DAI would make Maker a worse shitcoin than Tether. DAI either holds the peg in the market or it does not. If it does not then we must work to improve system parameters until it does. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#6",
                    "likes": "0",
                    "time": "01/05/2020-14:50:23",
                    "content": "We need uncorrelated collateral types with 0% stability fee.  Keep in mind that right now the only  collateral type uncorrelated with ETH is USDC and it has a 6% SF, which is a huge barrier to minting DAI from USDC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.142857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#7",
                    "likes": "1",
                    "time": "01/05/2020-16:10:33",
                    "content": "Obligatory plug for creating inflation via uniswap tokens. Incentivize people to put their DAI on the market and inflate the supply while doing it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#8",
                    "likes": "0",
                    "time": "01/05/2020-17:10:18",
                    "content": "    Planet_X:  If it does not then we must work to improve system parameters until it does.   Do you consider LR<100% also an allowed value (“improvement”) of a system parameter? If you limit the changes only to changes that you are comfortable with, then maybe there exist no combination of system parameters that can restore the peg. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#9",
                    "likes": "1",
                    "time": "02/05/2020-05:27:32",
                    "content": "DAI market cap is 100 million and centralized stable coins market cap is about 10 billion and it is even growing faster than DAI supply percentage-wise that means we are not going to meet the demand for DAI by depending on ether or other small market caps coins so I think we should consider accepting that most DAI supply to be collateralized by other centralized stable coins and we could generate revenue for Maker by: 1- arbitration as I explained in this topic     USDC vaults VS arbitrage reservoirs Risk       adding USDC as collateral was an important decision to provide liquidity in emergencies and to prevent the peg from going too far above 1$.  however, having USDC (or any centralized stablecoin) have several disadvantages, for example:  1- illegal earned USDC can easily be used to open a vault and mint DAI… which might expose the USDC in the vault to be frozen  2- arbitrators will have a limited ability to help with liquidity and the peg if there is a systemic problem that could keep the peg abov…      2- by lending our centralized stable coins reserves to secondary markets to generate revenue this way DAI will mostly be collateralized by a basket of centralized assets and the more diversified basket the less risk until we have better infrastructure to attract huge collaterals I  think this is the only option to really scale DAI supply ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.498809523809523
                }
            ]
        }
    ]
}