{
    "poll_list": [
        {
            "title": "Ratification Poll for Requesting Protocol DAI Transfer to fund TechOps CU for March 2023 (MIP14c2-SP5) - March 13, 2023",
            "index": "19624",
            "option": "Yes",
            "supporting_mkr": "76,410",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip14c2-sp5-requesting-protocol-dai-transfer-to-fund-techops-cu-for-march-2023/19624",
            "title": "MIP14c2-SP5: Requesting Protocol DAI Transfer to fund TechOps CU for March 2023 ",
            "index": 19624,
            "category": [
                "Maker Improvement Proposals",
                "Formal Submission"
            ],
            "tags": [
                "core-unit",
                "tech-001",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/simonkp",
                    "index": "#1",
                    "likes": "1",
                    "time": "01/02/2023-06:24:10",
                    "content": " MIP14c2-SP5: Requesting Protocol DAI Transfer to fund TechOps CU for March 2023  Preamble MIP14c2-SP#: 5 Author(s): @simonkp Contributors: Tags: tech-001, core-unit, Status: Formal Submission Date Proposed: 2023-02-01 Date ratified: - Forum URL: https://forum.makerdao.com/t/mip14c2-sp5-requesting-protocol-dai-transfer-to-fund-techops-cu-for-march-2023/19624 Ratification Poll URL: - --- Amount: 138,894 DAI   Specification  Sentence Reason This amount will sustain the team, critical infrastructure, tools and services through the month of March. This is our second and last MIP14 subproposal before the full budget will be resubmitted for voting in March.  Reason Details This amount is a monthly cap of TechOps CU’s new revised NewBase DAI budget. After submitting our 2023 budget to the community it was rejected for a number of reasons, including:  Very high budget overall — bad time for new hires and TechOps CU failing to judge the community’s sentiment for cost cutting. Not giving Bear market vote options — as per MIP40 (only if the budget is higher) and as the new expected standard. Our role in Endgame — transitioning to Ecosystem Actor and/or Tribunal.  We’ve taken this feedback onboard and have revised our new budget significantly which will be up for voting in March 2023. Due to budgeting cycle happening quarterly we’re left without funding for February and March 2023. This amount will cover our expenses for the month of March. The first MIP14 subproposal has passed, now this is the second and last MIP14 subproposal that will sustain us for the month of March. Any excess funds as always will be promptly returned to the protocol.  Surplus Analysis Proposed transfer can be taken from the current surplus.  DAI Transfer Ceiling Analysis The transfer ceiling was removed during January 2023 voting period.  Targets Recipient is TechOps CU Auditor Multi-sig Wallet. Recipient Address: 0x2dC0420A736D1F40893B9481D8968E4D7424bC0B Amount To Transfer: 138,894 DAI   Relevant Information:  2023 Revised DAI Budget MIP TechOps CU Mandate  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-spxx-techops-core-unit-dai-budget/19017",
                        "https://forum.makerdao.com/t/mip39c2-sp29-adding-techops-core-unit-tech-001/12070",
                        "https://forum.makerdao.com/t/weekly-mips-update-126/19881",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806/69",
                        "https://forum.makerdao.com/t/weekly-mips-update-124/19706",
                        "https://forum.makerdao.com/t/weekly-mips-update-124/19706/3",
                        "https://forum.makerdao.com/t/weekly-mips-update-125/19812",
                        "https://forum.makerdao.com/t/weekly-mips-update-130/20226",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/128",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/106",
                        "https://forum.makerdao.com/t/weekly-mips-update-129/20172",
                        "https://forum.makerdao.com/t/weekly-mips-update-128/20070",
                        "https://forum.makerdao.com/t/weekly-mips-update-127/20001"
                    ],
                    "GPT-summary": "The post is a formal submission of a proposal, MIP14c2-SP5, requesting a transfer of 138,894 DAI to fund TechOps CU for March 2023. The proposal explains the reason for the transfer and provides details on the revised budget and feedback received from the community. The post also includes relevant information such as the recipient address and the TechOps CU mandate. The post may be of interest to those who want to understand the proposal and ask questions or provide constructive criticism.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.17780303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "02/02/2023-16:44:26",
                    "content": "This is a summary of the contents of this subproposal and its impact, from GovAlpha’s perspective:  This is a valid subproposal to request a DAI transfer from the Maker Protocol, as defined in MIP14: Protocol DAI Transfer. TECH-001 is requesting a budget extension of 138,894 DAI. This amount will fund TECH-001’s continuity work for the month of March. TECH-001 has submitted a budget subproposal that will enter March’s Governance Cycle. No other budget extensions should be needed. If this subproposal is ratified, 138,894 DAI will be transferred to the specified MIP47-compliant multisig wallet through the earliest executive vote. This proposal has been assigned High-Impact based on the methodology listed here.  Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. Updated 2023-02-24 ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp88-techops-core-unit-dai-budget/19017/6",
                        "https://mips.makerdao.com/mips/details/MIP47",
                        "https://manual.makerdao.com/governance/off-chain/impact-estimations"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/simonkp",
                    "index": "#3",
                    "likes": "1",
                    "time": "06/03/2023-03:06:23",
                    "content": "@MIP-Editors, We would like to formally submit this proposal for the March 2023 cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "2121"
}