{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/borrowers-concentration-analysis/12014",
            "title": "Borrowers concentration analysis ",
            "index": 12014,
            "category": [
                "Core Units",
                "Strategic Finance"
            ],
            "tags": [
                "analysis",
                "alm",
                "sf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "36",
                    "time": "06/12/2021-08:22:45",
                    "content": " Summary  Borrower concentration at MakerDAO is increasing over time 3 borrowers are currently ~55% of our crypto-loans exposure and ~60% of our crypto-loans revenues 2 of those borrowers are CeDeFi platforms and represent 45% of our crypto-loans exposure and ~50% of our crypto-loans revenues Efforts to diversify our borrower base should continue to limit one customer actions of impacting too much our balance sheet   Motivation Maker is a lending protocol with more than $5.5B of crypto-backed loans. Interests on those loans are the main revenue source of the protocol. It is also the main supply of DAI. A decrease in crypto-loans outstanding would increase the fiat stablecoin PSMs and decrease revenues. Both are not favorable outcomes for MakerDAO in the current context. Asset-Liability Management (ALM) on the analysis and optimization of the balance sheet (broadly DAI demand and DAI supply) in order to limit risks and optimize MKR returns (in terms of profitability and/or volatility of those profits). One of those risks is the concentration of borrowers which is the topic of this study. Credit and market risks are outside of this analysis.  Methodology Dune Analytics was used to create the queries to find exposure and revenues per vaults. The biggest vault users were identified by using the Risk CU website. Risk CU added a metric related to this analysis recently as well that @josolnik discussed here. Numbers are limited to crypto-loans vaults and exclude stablecoins-vaults (both PSM and traditional vaults), RWAs vaults and D3M. They include Liquidity Pools like GUNI-DAI/USDC. The borrower nicknamed 7-Farmer is a collection of 7 wallets identified by Risk as having the same pattern of usage, therefore most likely belonging to the same customer. There is a live dashboard that tracks the metrics displayed in this analysis. It also contains sources of the queries. Data presented here are up to December 6st, 2021.  Findings  Concentration of borrowers over time The most striking result is that MakerDAO is more and more exposed to the 3 main borrowers. They now represent around 55% of the crypto-lending activity of MakerDAO and not far from 60% of the revenues.  image917×352 33.7 KB  If we remove those 3 borrowers, we are down 52% from peak revenues.  image919×348 22 KB  Moreover, as shown below, since the May peak, the vast majority of the increasing DAI supply from crypto-loans is due to those 3 borrowers.  image921×350 34.7 KB   CeDeFi is the main driver of crypto-loans Of the 3 biggest borrowers, 2 are CeFi platforms: Nexo and Celsius. Their behavior is to pledge crypto-collateral, mint DAI and convert it to US Dollars to lend them to their customers. They are acting as a regulated intermediary between retail and DeFi. Combined Nexo and Celsius represent around 45% of the crypto-loans exposure and around 50% of the protocol revenues. It might therefore be important to understand the main drivers of CeFi lending activities as they are influencing significantly the MakerDAO balance sheet. The efforts of Growth to foster an institutional vault initiative and better B2B relationships might help significantly to avoid CeDeFi borrower churn and increase this kind of borrower exposure. While an exciting opportunity, it also represents a medium ALM issue of increasing our stablecoins exposure above what we would consider enough (as they are DAI sellers). Indeed, should Nexo close its relationship with MakerDAO, the PSMs (most likely USDC) would increase by $2B to reach $5.3B. This would move our liquidity buffer in terms of DAI from 36% to 57%. Such a level was considered excessive and prone to an unacceptable regulatory (USDC freeze of the PSM) risk by the community in the past.  The second whale is less risky from an ALM standpoint The 7-Farmer customer is borrowing to earn a spread by farming on Aave and Compound. From the Risk website, we can see that DAI Capital Share is around 100%. The customer is delta-hedged in terms of DAI (around the same amount of DAI-denominated assets and DAI-denominated liabilities).  1053×354 88 KB  The ALM risk of this customer is therefore quite limited. If he unwinds his positions, both the asset and liabilities part of MakerDAO will decrease i.e. this will not significantly impact the stablecoin exposure nor the DAI price. It is nevertheless 15M DAI of annual revenues that could vanish should the spread between ETH-A Stability Fees and yields on Aave/Compound become negative. This should be taken into consideration when setting the Stability Fees.  Conclusion The analysis shows the value of having closer relationships with those key customers like it is developed with Institutional Vaults. As at least 45% of the crypto-loans exposure is owned by CeFi platforms, this can be a trend towards CeDeFi (at least in the scope of Maker), with CeFi focusing on customer acquisition and experience while DeFi works in the background. While this trend is good for MakerDAO (allowing it to indirectly reach a wider audience than DeFi only), efforts should probably continue to increase the diversification of our borrower base. We should avoid having a particular borrower being able to significantly impact MakerDAO’s balance sheet. ",
                    "links": [
                        "https://forum.makerdao.com/t/dai-supply-growth-and-risk-metrics/11704/3",
                        "https://dune.xyz/SebVentures/MakerDAO-Borrower-Concentration-Analysis",
                        "https://forum.makerdao.com/t/financial-report-2021-12/12566/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-74/12035",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/29",
                        "https://forum.makerdao.com/t/mip39c2-sp36-modifying-strategic-finance-core-unit-mandate-sf-001/17750",
                        "https://forum.makerdao.com/t/mip40c3-sp69-modify-core-unit-budget-strategic-finance-sf-001/15090",
                        "https://forum.makerdao.com/t/state-of-dai-march-1-7-2022/13732",
                        "https://forum.makerdao.com/t/compound-d3m-risk-assessment/12580",
                        "https://forum.makerdao.com/t/forum-at-a-glance-december-2-9-2021/12119",
                        "https://forum.makerdao.com/t/signal-request-d3m-parameters-guidance-for-momc/11898/8",
                        "https://forum.makerdao.com/t/mip39c2-sp27-adding-strategic-finance-core-unit/11938",
                        "https://forum.makerdao.com/t/maker-relay-ep-74-en-espanol/12071"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.48302368927369
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "1",
                    "time": "07/12/2021-00:54:31",
                    "content": "@SebVentures thanks for taking a good look at this.   Technically was something I got used to seeing in the risk reports long ago… I reiterate again this idea of MakerDAO offering a bounty for vault owners and DAI holders to fill out some kind of poll information. Now you have identified 3 key players (Celcius, Nexo, and 7-Farmer) so two of these can be talked to.  Wouldn’t it be nice to at least ‘try’ to get some feedback from 7-Farmer and others? I am really glad to see people starting to really dig into on-chain data metrics to understand where Maker is making it’s DAI, and where it is losing customers, much less managing what is becoming an increasing concentrated balance sheet risk. One thing that I think is interesting at least with Celsius, and Nexo is that they basically are acting as the 2nd party intermediary between Maker and 3rd parties, so in principle we get better vault management and some liquidation buffering between their clients and the greater vault. The above was a reason why I wanted to have staggered LR, SF, DC institutional vaults instead of a single one.   Try to force via multiple vaults DC limits (that the customer can manage themselves) and different LR, SF the clients to spread their liquidation risk. Which brings up a question in the data. Does Celsius and Nexo both hold only a single vault in each of the collateral types or do they own a few and is the liquidation risk clumped massively because of these?  One thing I wanted to see from risk was a weekly animation of the liquidation charts that we used to get.   Point here was to see how the huge liquidation clumps moved and whether they were growing in size. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.765079365079365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "1",
                    "time": "07/12/2021-10:07:23",
                    "content": "For Celsius (they might have other addresses as well, hard to know). Notice that they use Mana.  image835×337 42.3 KB  For Nexo  image832×336 41.8 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.958333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#4",
                    "likes": "1",
                    "time": "07/12/2021-12:23:14",
                    "content": "Interesting. Thanks for pulling this together. I see three ways of mitigating this risk:  Reduce their economics to discourage borrowing. Incentivize new whales to onboard to spread risk. Incentivize smaller users in large numbers.  The first seems like a bad idea from a product standpoint, so let’s focus on 2 and 3. The teams are working to bring on additional institutinal partners via help with onboarding. Not sure what else we could do here, except increasing a budget to hire additional team members. Number 3 could be solved through a reworking of the risk parameters for various vaults at low debt levels, but this doesn’t seem like an easy lift. The basic idea would be that smaller deposits could be riskier, since they are a relatively smaller part of the collateral. None of these options seem great. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5279942279942285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#5",
                    "likes": "3",
                    "time": "07/12/2021-15:25:50",
                    "content": "Seb - this is a great analysis. It raises some key questions as others have already touched on.  What is the value and economics to Maker of serving small users, large users (or both), in unit economics and strategically? Where does Maker want to be in this value chain? What are the economics for CeDeFi players such as Nexo?  How do they make the small user market work economically? What would it take for Maker to make significant inroads to small users, such as better User Experience and Marketing?  Would it be a good investment? Strategically does Maker want to cede small users to CeDeF or seriously compete in this space, too?  Typical startups are highly focused/obsessed with how well their product meets the market’s needs.  Perhaps Maker needs a User Experience type CU that is also obsessed with our product design and market fit… one other question: Who were the “Other” borrowers who left Maker since the spring?  And why did they leave? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.199821428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#6",
                    "likes": "1",
                    "time": "07/12/2021-15:36:08",
                    "content": "Great points on targeting market fit here, perhaps with a CU. Eth may just not be capable of supporting smaller users at this time, which may be  both the problem and the answer (move to an L2 or another L1). I think fees are high even with a semi-large account that’s generally doing 6 figure moves when interacting with the protocol. We would have to subsidize anyone with less than ~$50k vault probably. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.058333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#7",
                    "likes": "4",
                    "time": "07/12/2021-19:22:13",
                    "content": "    Gaucho:  move to an L2 or another L1   For some reason, Maker is extremely slow (and difficult?) to switch from Ethereum L1 - but maybe that’s just me. However, if we stick to the “central bank” terminology then maybe we don’t have to. Instead of attracting more whales, we should be working with more liquidity providers. We should give them large DAI liquidity so they can spread it around to smaller users on other chains with cheap transaction costs. It seems to me that Ethereum L1 will not get cheaper, it will just become worth moving larger and larger single-value transactions on it, which will increasingly exclude smaller users.  Therefore, unless something is done about it, Maker will be a sandbox for whales. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3804945054945055
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#8",
                    "likes": "1",
                    "time": "07/12/2021-21:32:23",
                    "content": "How are the Nexos of the world making their small accounts profitable? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#9",
                    "likes": "0",
                    "time": "07/12/2021-21:33:47",
                    "content": "I hope we pick the strategy that makes the most business sense as opposed to being unable to adapt to any other strategy!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.739583333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#10",
                    "likes": "2",
                    "time": "07/12/2021-21:43:02",
                    "content": "No idea if this was sarcastic, but in case it wasn’t, Nexo looks like a Blockfi and like it’s mostly off-chain or uses their own chain (which I’ve never heard of). It has a web2 style front-end that requires me to login, so doesn’t appear to be web3 wallet compatible and thus you have to trust them to custody your assets. This isn’t even close to a comparable product. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#11",
                    "likes": "0",
                    "time": "07/12/2021-21:48:56",
                    "content": "thanks for explanation.  it was not sarcastic at all ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#12",
                    "likes": "1",
                    "time": "07/12/2021-22:09:37",
                    "content": "I think that a good business model - to use a car racing analogy - is to participate in all the races that you can. I have the feeling of a driver who has his car fixed in the pits while the race is on.  But otherwise the car is very competitive, but unfortunately it can only corner in one direction, so it’s only good for oval tracks. On that track, it beats everybody, but it can’t win a full season of racing. I was trying to be sarcastic…  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.305555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rbrandt",
                    "index": "#13",
                    "likes": "1",
                    "time": "03/03/2022-01:56:30",
                    "content": "Hello Seb. Would be much trouble to take a look at the code in dune? i would love to help, but still don’t know how to code in dune  if can’t… dont worry! thanks in advance RB  Untitled1871×988 37.2 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#14",
                    "likes": "2",
                    "time": "03/03/2022-19:05:14",
                    "content": "It’s fixed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#15",
                    "likes": "0",
                    "time": "01/06/2022-19:05:29",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}