{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/what-so-what-now-what-psm-solution/3154",
            "title": "What?, So What?, Now What? PSM Solution ",
            "index": 3154,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "analysis",
                "alignment",
                "pegstab-module"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#1",
                    "likes": "4",
                    "time": "10/07/2020-00:59:34",
                    "content": "What? After spending a few days mulling over the PSM especially at these forum posts here Pre MIP PSM discussion here PSM Timeline and here PSM Lending Post This is the problem I am seeing: “How does MakerDao scale while also defending the Peg and restoring confidence in the system in a manner that is sustainable and limits exposure to collateral risk (mainly USDC is the current focus)?” So What? We need to balance demand.  Demand on one side of collateral in the system generating Dai as a loan and Demand on the other side of Dai as a stable-coin in the markets. We want this balanced in a way that fits the risk tolerance MakerDao has for all of the different collateral types especially custodial stable-coins. Now What? We implement a PSM.  The exact details are still open for debate.  This will accomplish many things including these main pros:  Increased confidence and liquidity in the system from all sides Massively increased collateral in the system and Dai being lent More fees being generated by the system A tighter kept and defended Peg price for Dai All positive side effects and feedback loops associated with above  MakerDao fears these main cons from PSM implementation:  Too much collateral builds up in the system (specifically USDC) Risks that come with increased collateral such as devaluation or blacklisting of that collateral.  Think USDC falling to $0.00 overnight. Potential negative impact of PSM on MakerDao incentive structure Long term negative feedback loops / outcomes that stem from the above  Ok great, What? Now, we discuss mitigation of the cons because I think it is clear that the demand problems MakerDao has are ones associated with not having enough collateral in the system and the PSM massively increases collateral but as of the current thinking comes at the expense of these cons listed above. If MakerDao can navigate these cons it can extract the value from the pros at the least cost possible yielding a good return from a PSM implementation. So What? These are the four major cons again and what I think can be done to mitigate them:   Too much collateral builds up in the system. MakerDao can address  this by inviting more of the collateral types it wants into the system and trading out via lending for Dai the ones it wants to remove exposure to.  In doing so it will actually generate even more fees and pull more collateral into the system but in this case the collateral it chooses.  It will do so as a result at better rates than the competition because it can afford to subsidize these loans  if needed using PSM profit.   Risks that come with increased collateral such as devaluation or blacklisting of that collateral. Think USDC falling to $0.00 overnight. MakerDao can address this by loaning out the collateral types that it wants to reduce exposure to and accepting collateral of other types in return.  So it would loan out the USDC for example essentially selling it for 1 Dai debt each in the process and take in more collateral of other types.  This will earn MakerDao more stability fees, increase Dai supply further, and at the same time remove the exposure of whatever asset that gets loaned out.   Potential negative impact of PSM on MakerDao incentive structure The negative impacts that are unseen I do not have an answer for yet because they are unseen, but the ones that have come up so far in discussion appear to be overstated.  For example: the main one I have heard is that market makers will have less room to market make.  This is not that big of a deal compared to the pros MakerDao is getting in return and also these market makers can still work inside of any range excluded by MakerDao PSMs, can front run PSMs, and can get engaged in other parts of the MakerDao system to make profit such as trading to the PSM etc…  I feel that this isn’t that big a con and has some pros along side it anyway.   Long term negative feedback loops / outcomes that stem from the above The feedback loop MakerDao needs to be aware of is that this collateral lending and trading is not infinite.  If at some point the demand for Dai is just too high and there is no collateral to onboard as a result of debt ceilings being maxed across all collateral types and users refusing to take out loans of the collateral MakerDao wants to limit exposure in there is no simple easy solution. The best solution I have I will share in a future post, but here is a quick summary of it:   In the event that all other options are exhausted and negative interest rates or simply creating Dai out of thin air or backed by MKR as collateral will not suffice as they break the MakerDao social contract to not inflate Dai (granted this can still be done instead of global settlement it just isn’t what MakerDao will likely want). MakerDao will solve this by reducing the collateral requirement ratios to their lowest safe levels while also lowering the liquidation penalty to as low as it can (for the sake of example lets say 5%).  It can then set one last PSM at the highest price it is willing to let Dai go before global settlement and simply use the proceeds to buy collateral from the market and generate Dai with that collateral indefinitely because the proceeds of the Dai being generated and sold through the PSM are so high that the system can afford to keep buying assets.  I am not certain that this last part holds true however, so please have a think on it.  We are very far from hitting this point and by then MakerDao need to have a well crafted solution in place. Now What? In the meantime MakerDao is FAR from having those type problems and the PSM is a good choice right now to continue to allow MakerDao and Dai to develop and grow. TLDR: Peg Stabilization Modules have many pros and only a few relatively easy to mitigate cons.  They should be discussed in detail and put in place to help support the MakerDao Ecosystem as it grows. At least, this is my perspective. ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-poll-deciding-the-peg-stabilization-modules-implementation-timeline/3090",
                        "https://forum.makerdao.com/t/maker-can-have-a-monopoly-power-over-stablecoins-lending/3142",
                        "https://forum.makerdao.com/t/poll-creation-of-a-makerdao-strategic-reserves-solving-the-peg/3638",
                        "https://forum.makerdao.com/t/know-your-mip-kym-01-pilot-peg-stability-module-friday-november-20-17-30-utc/5219",
                        "https://forum.makerdao.com/t/discussion-cdai-adai-ydai-collaterals-as-a-peg-enabler-tool/3470",
                        "https://forum.makerdao.com/t/maker-relay-ep-6/3517",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-101-thursday-july-16-9am-pst-4-00-pm-utc/3145/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-101-thursday-july-16-9am-pst-4-00-pm-utc/3145/4"
                    ],
                    "GPT-summary": "The author proposes implementing a Peg Stabilization Module (PSM) to balance demand and increase confidence and liquidity in the MakerDao system. The author discusses potential cons of the PSM and suggests ways to mitigate them. The post also includes a proposal for a solution in the event of all other options being exhausted. The post explains the benefits of the PSM and invites discussion and collaboration on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.486195832786742
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#2",
                    "likes": "1",
                    "time": "10/07/2020-01:11:48",
                    "content": "I agree.  We need the PSM now and there are lots of solutions for how to make use of the excess USDC so that it does not become a systemic risk.  I personally favor using it to purchase MKR and use the MKR as collateral to mint more Dai. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#3",
                    "likes": "3",
                    "time": "10/07/2020-01:19:50",
                    "content": "It’s time to speed up the implementation of PSM. The exchange rate is now out of control. If the market plunges, DAI will be out of control. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#4",
                    "likes": "0",
                    "time": "10/07/2020-01:38:51",
                    "content": "I doubt the DAI will plunge, since other Crypto are backing up right now, and many is leading the footprint, we will see more private structure and instance, than build on top of ETH 2.0 for example. Also it’s limited now for 14 transaction i think. It will not scale that much when Credly, Libra, will do their burn power trip (lol) DAI should stay stable, while Bitcoin will Plunge, Bitcoin is the Absorber, we can trick the value on the rest, easily. Speculatively, DAI is stable, backed, while 90% of other crypto, aren’t ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.317099567099566
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#5",
                    "likes": "2",
                    "time": "10/07/2020-02:30:32",
                    "content": "The argument is not that dai will plunge, but that if the rest of the market plunges, dai will become even more valuable and off peg than it is now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#6",
                    "likes": "0",
                    "time": "10/07/2020-02:35:55",
                    "content": "I really doubt about this, Dai was made to be a stable coin, ETH and other, or most, not. I mean there is many but DAI is one of the major figure, what can happen on the other side is, if the figure goes away or in any way, other will want to follow up but they will not make it, because they are fictive value. The ETH and other crypto will have huge gain on this side I presume instead. This will still come again to play with the Peg and to lower it again, in around a month. Keep in mind BMW just to mention this one, have adopted the IoT, Blockchain and Multiconnection services… The DAI is just not there, it will stay where he are. With the Loans and fixed rates ",
                    "links": [
                        "https://forum.makerdao.com/t/proposal-use-excess-usdc-from-the-psm-to-buy-and-burn-mkr/3161/16",
                        "https://forum.makerdao.com/t/makerdao-should-consider-open-market-operations-to-regain-control-of-the-peg/3150/8"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.644886363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#7",
                    "likes": "0",
                    "time": "10/07/2020-16:29:17",
                    "content": "Someone please check and see if this would work or not as I am not entirely sure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#8",
                    "likes": "1",
                    "time": "10/07/2020-18:14:00",
                    "content": "I say this as someone with a pretty decent-sized vault. I have already migrated 1/3 of my vault collateral to Compound as they are paying me to borrow Dai there. This meant paying down my vault balance and destroying Dai. As I feel more comfortable with the stability of the Compound smart contracts, I will migrate more / all of my vault balance to Compound. This is the 100% rational decision for me to make, assuming Compound doesn’t blow up. This destroys Dai and makes the Dai price go up and will eventually force global settlement when enough people do it. The only solution for this entirely rational decision by Vault holders, is for Maker to decide to pay for deposits as Compound does with governance tokens, that is MKR. There is literally nothing else that can be done, because right now the economically rational decision is to borrow from Compound and not from Maker. No PSM or anything else will matter until the incentives for people to deposit collateral into Maker are fixed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.783730158730158
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#9",
                    "likes": "3",
                    "time": "10/07/2020-18:18:25",
                    "content": "The interest rates are variable.  Be careful not to get too sucked in over there and please do not leverage the Dai borrowed for your own safety.  A lot of people are eventually going to get Rekt by COMP as the token depreciates massively over the next month.  Their rates to borrow will rise and you will get trapped.  Just be careful, what they are doing is not good. Do you honestly think people are going to pay you to borrow money at 30% a year like they have been?  Be honest with yourself. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#10",
                    "likes": "0",
                    "time": "10/07/2020-18:41:30",
                    "content": "The issue isn’t “long-term” as any borrower can switch to any of these protocols in a few minutes. The issue right now is Dai has been off its peg since March. Getting Dai back on the peg is easy, we simply need to get people to generate Dai. You incentivize that by paying people to do it, with MKR tokens. The Maker governance holders can fix the peg in a few hours by doing this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.265873015873016
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#11",
                    "likes": "1",
                    "time": "10/07/2020-18:51:54",
                    "content": "And how would you suggest we sustain such behavior?  Simply keep giving out MakerDao tokens like candy while the system loses money day after day keeping the peg intact? How do you see this playing out?  Somehow you have the idea that it is going to lead to massive MKR value as you stated in the other post.  How? There are sustainable and profitable ways to defend the Peg.  I do not feel like subsidizing with MKR is one of them but if you provide enough evidence I am happy to come around to your point of view. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.267857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#12",
                    "likes": "0",
                    "time": "10/07/2020-19:10:58",
                    "content": "Why will MKR will gain value? Because it will be demonstrating that it intends to compete with Compound, Aave and other protocols that are using tokenomics to drive growth and market share. It isn’t necessary to give MKR out like candy. A very small amount of token issuance would restore the Dai peg which is, after all, the raison d’être of Maker. After the peg is restored a debate can be had over the appropriate amount of MKR to continue to distribute to borrowers to keep Maker’s competitive position intact. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#13",
                    "likes": "4",
                    "time": "14/07/2020-01:06:26",
                    "content": "I had posted elsewhere about an idea for how to implement negative rates by paying vault holders extra DAI (I was thinking a token that could be redeemed against future SF interest).   In principle doing this with DAI this means running a negative surplus and breaking the $1:1DAI ES.   Think of what one is doing by paying people MKR.   Some of these people will take MKR and basically swap for DAI.   This MKR does nothing to create more DAI and in effect will have people taking MKR to possibly purchase DAI which then removes DAI liquidity from markets. There is also an issue of real rate of return here.   Who thinks that Maker can match the $150M or so per year of comp rewards or that this is actually sustainable.  No-one imo.  The only reason this is working is because the people at compound who thought this up decided not to airdrop any of this comp on their long time users based on any model.   If they had airdropped even 1/2 the forward drip at once for previous usage this whole comp thing would have been done right out of the gate. The point here is that while we can reward DAI borrowers not just with 0 SF but with some kind of reward IF we still want to maintain the 1:1 USD:DAI value ratio with all the risk parameters intact where does the extra collateral come from to increase the DAI supply?   A pittance of a reward even in MKR isn’t going to do that.   Now if we paid them in DAI and decided to run a negative surplus breaking the 1:1 USD:DAI ES value then I think rather quickly we could find the PEG restored to a $1 value. Remember the point here is that the PEG is > 1 and while everyone can dream up how much liquidity is required to drive this back to $1 there is a much simpler way to see if markets are even paying attention and that is to break the $1USD:1DAI collateralization requirement by allowing the system to run with a negative surplus.   We did this for 7 days and the markets didn’t even flinch when we had backing value of like …93USD to 1 DAI when we ran with a negative surplus and PEG stayed at 1.02.  Mostly because markets believed MKR would flop to make up the difference which actually had a negative effect on the PEG because making up the difference meant selling MKR to buy DAI removing DAI from the markets and driving the PEG up. While I think we can try to grow our way out of this I am rapidly coming to the conclusion the best tool is direct backing value management via running either a negative or positive surplus both within the system but also using a secondary reserve that sits outside of the system for governance to manage DAI liquidity generally. While there are countries in the world that directly manage currency prices by direct intervention in markets (hong kong, china, japan, etc.) and so the PSM I think has some validity - they do it unexpectedly and not in a way that can be directly gamed or anticipated by markets (usually). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.260764010764011
                },
                {
                    "author_link": "https://forum.makerdao.com/u/consciousentity",
                    "index": "#14",
                    "likes": "1",
                    "time": "14/07/2020-02:14:05",
                    "content": "You have good points here as a vault owner. I ask the following question in a curious, abstract and professional way: What do you think the end game would be if the Maker foundation approved MKR as a collateral type, then minted MKR and used that new MKR to mint new DAI from vaults to meet the rising demand for DAI? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.409090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#15",
                    "likes": "1",
                    "time": "14/07/2020-02:31:01",
                    "content": "In such a scenario if the Dai price were to continue to rise due to demand and all of the MKR available was used as collateral and yet Dai still was increasing what would the next course of action be? Would you suggest allowing more Dai to be created from the MKR vaults lowering collateral ratios for these?  OR, MakerDao creating more Dai to provide liquidity that is not backed by collateral? OR MakerDao creating Dai and having the system sell it to provide some kind of collateral backing? If collateral prices fall after any of those ideas are put in action the whole system is at risk of buckling. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.1375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#16",
                    "likes": "3",
                    "time": "14/07/2020-23:31:54",
                    "content": "I think printing unbacked DAI (either to give to Vault holders or sell on the open market) is the simplest and most efficient method to bring the peg back down. However, I haven’t seen anyone from within Maker comment on whether this idea would be considered or not. There may be a good reason (or even just a strong preference) why this idea is out of consideration. On the topic of Emergency Shutdown (ES), as I understand it, ES would only be triggered in a situation where the peg broke drastically up or broke drastically down. I don’t believe printing of unbacked DAI would be enough to cause the peg to overshoot down. And it’s certainly not going to cause it to shoot up. So I see the risk of ES as very low. Anyone please correct me if I am misunderstanding the ES process. Edit: spelling ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.441468253968253
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ryanberckmans",
                    "index": "#17",
                    "likes": "1",
                    "time": "31/07/2020-00:16:27",
                    "content": "Is it not possible to maintain the peg without a fancy new module that may introduce new layers of risk that are difficult to quantify? In my opinion, Maker under-invests in non-technical, non-numerical methods of increasing consumer confidence. If the DeFi public had high confidence, they’d borrow DAI, sell it, and restore the peg to $1. Why don’t we focus on the abstract notion of boosting consumer confidence, instead of habitually reaching for technical solutions? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.951948051948052
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#18",
                    "likes": "0",
                    "time": "31/07/2020-00:28:59",
                    "content": "What do you recommend to do that? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ryanberckmans",
                    "index": "#19",
                    "likes": "7",
                    "time": "31/07/2020-01:14:20",
                    "content": "I recommend that the Maker Foundation hire a VP of Consumer Confidence, and empower them with a budget and seat at the governance table. Consumer confidence needs an owner. More tactically, the Foundation might embark on a short-term program to boost consumer confidence via a series of announcements, partner announcements, and community initiatives. For example, one announcement might describe what has been done to prepare for the next Black Thursday. A lot, I bet. But, this can be difficult to understand for those who don’t extensively lurk the Maker forums. For this short-term program, the Foundation could partner with community members or entities that have sizable platforms. Bankless, for instance. Forbes, Bloomberg. The message here is simple and is best delivered simply (over a series of announcements)  Recap of Black Thursday disaster + cleanup, which subsystems broke, which parts of Maker’s response to the disaster were good or not, high-level lessons learned Reaffirm Maker’s commitment to having MKR holders eat all system-related losses, including Keeper system failures causing loss of funds for individual vault holders. Hopefully, this is true. (Did MKR holders ever make whole those Vault holders who personally lost funds?) Reaffirm that DAI is worth $1. Not $1.01 or $1.03. Saying this out loud matters Explain the mechanisms that have been created to prepare for the next crash. For example, USDC-B gives $30M of buffer during a crash. Why is $30M enough, which partners are prepared to use this facility during a crash, etc. What’s been done to bolster Keeper network health (I remember during the crash – ETH node network issues, too few Keepers, too low gas prices in Keeper scripts, too low capital reserves for Keepers – a layer cake of Keeper issues) Provide playbooks for average DeFi citizens to help restore the peg. “Go here and open a Vault. Mint DAI. Sell DAI on matcha at this link. Wait a week or two. Repurchase DAI. Close Vault” These playbooks should include example profit and a realistic estimation of gas / minimum assets to make profit Many of these announcements could or should bear Rune’s name personally. (There is a reason that the President or Fed Chair are the ones that give the speech)  Sometimes, leaning into the memes can go a long way. DeFi users are liquidity farming to make “that money”. Yet, many of them will lose money after fees, token dumps, misunderstanding the products they are using, etc. One of the announcements could position peg arbing as a type of liquidity farming, “Why risk crazy token dumps when you can make 2% in two weeks, with low risk, and be a kind person helping to restore the DAI peg?” We need some good 'ol peg propaganda. Friends don’t let friends believe that DAI is worth other than $1. Rosy the Peg-viter. Etc. This program could foster a human side of peg stabilization that may be missing from the Maker ecosystem today. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.49436936936937
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#20",
                    "likes": "0",
                    "time": "31/07/2020-07:47:24",
                    "content": "I agree You want people to restore the peg, you need to give them the tool (base rate @ -4% and unlimited DC) and let them know exactly how to do that and profit from it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ryanberckmans",
                    "index": "#21",
                    "likes": "2",
                    "time": "31/07/2020-20:32:43",
                    "content": " If the DeFi public had high confidence, they’d borrow DAI, sell it, and restore the peg to $1. Why don’t we focus on the abstract notion of boosting consumer confidence, instead of habitually reaching for technical solutions?  If the public sells $20M DAI to help restore the peg, they must later buy $20M of DAI to close their Vaults. Would the buys then destabilize the peg, making this tactic net ineffective? I don’t think so. I think this tactic is effective because of the time window between the sells and buys. This time window boosts confidence and, on average, the size of the DAI market. Every month the peg is at $1 further boosts confidence in DAI and the Foundation and, on average, the number of participants and liquidity in the DAI markets. When the public buys $20M of DAI to close their Vaults, they are buying it from a “different” and, on average, bigger market. The initial sells of DAI moves the DAI price more than the later buys of DAI, on average. The net effect of the public selling $20M of DAI, waiting awhile, and then buying $20M of DAI, will be to improve consumer confidence and stabilize the peg. Another potentially important factor is that each member of the public that participates in this process is signaling and building cultural support for the idea that DAI is worth $1, not $1.01 or $1.03. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.317391304347826
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#22",
                    "likes": "0",
                    "time": "31/07/2020-20:54:35",
                    "content": "I don’t agree with your approach although I suggested something like that a year or so ago when DAI was single collateral and the circumstances were different. The truth is that nobody here (including the devs) has confidence that the peg will return any time soon. They have no confidence because DAI was not designed to work in a situation like this one so the best thing we can do is raise the DC and add collateral. Those measures are not designed to influence the peg directly - they could help but so far they didn’t. We also cannot say that the Black Thursday issue is fixed. The liquidation code was not updated AFAIK - we just added some delays and UI improvements. In other words - zero bid auctions can win again. There is actually one topic for which we could use propaganda and that is “ETH is undervalued/store of value”. People should be encouraged to deposit ETH and mint DAI because ETH will appreciate in price significantly and probably more than BTC. If you own a cryptocurrency and you need money to spend - why not convert it to ETH, open a vault and mint DAI? It is not only my wishful thinking that the ETH price will rise. There are many ways to come to that conclusion (80% certainty?) considering all ETH/token usage and gas spending. We can also use propaganda to spread awareness that backing 1 DAI with $1 at all times prevents DAI from reaching the peg. Oh, wait - we don’t believe in that. We believe that DAI will get tired of being always above $1 and come back to $1 where it naturally belongs. If it doesn’t we will make it come down by adding more collateral and raising the DC for whichever collateral it likes best. I would listen to voters who were right so far (voted NO for most executive votes) instead of ones who voted YES and resulted in 4.5 months of no peg. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.971797052154195
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ryanberckmans",
                    "index": "#23",
                    "likes": "0",
                    "time": "31/07/2020-22:26:56",
                    "content": "    bit:  The truth is that nobody here (including the devs) has confidence that the peg will return any time soon.   If the community of Maker experts doesn’t have confidence that the peg will return anytime soon, we will struggle to lead the community towards confidence in the peg. It’s been 4.5 months of techno-financial attempts to restore the peg. Perhaps it is time to augment these efforts with a new approach (as I wrote about above). If we can align the community of Maker experts around a new approach, that may begin the process of increasing our confidence in the peg, which is a prerequisite to increasing public confidence in the peg. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#24",
                    "likes": "2",
                    "time": "01/08/2020-00:57:45",
                    "content": "I’ve not been in the community so long, but would like to know if -4% of Base Rate, taking to 0% most of the DC and 110% LR for USDC have been tested before in similar market conditions? If the answer is no, then I think that from those 4.5 months Maker experts are testing the strongest tool that we have and we can control right now, the meta-parameters, to ensure the PEG is restored. IMO, experimenting is a very important part of the progress (that’s why we humans have gone so far, since the establishment of the scientific methodology as cornerstone of our technological society). I’m confident that many of us want to see how this configuration goes. Respect to other tools, if you have run at least simulations with results which demonstrate that they are real solutions, then I’m sure that you could align the community around it… But if those other tools have not been tested, and are only being measured for what some of us believe is the correct way to do the thing, sadly believes don’t define the reality. IMO, we should see firstly what happens on next week with BR -4%, and stability fees down to 0%, and we should support the current effort to restore the PEG. No question that if it doesn’t work, we should investigate then really strongly other methods, but afaik this is the first time that we’re throwing such combination of meta-parameters in similar to current market conditions: that’s a test that even if in the worst case scenario, will teach us all  lot for the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.078733098177542
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#25",
                    "likes": "1",
                    "time": "03/08/2020-10:27:52",
                    "content": "    bit:  The truth is that nobody here (including the devs) has confidence that the peg will return any time soon.   @bit please try to avoid speaking for others when you make posts like this. You do not speak for everyone else here, and you definitely don’t speak for the devs. What you mean is that you have lost confidence that DAI will return to the peg soon. The most you can say about others is something along the lines of ‘I don’t think I’m alone in this viewpoint.’     smaugho:  IMO, we should see firstly what happens on next week with BR -4%, and stability fees down to 0%   I’m also interested to see what (if any) affect this has on the peg. With USDC at 0% the  short position starts looking more attractive. As a next step, we could further reduce the CR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.763310185185185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#26",
                    "likes": "0",
                    "time": "03/08/2020-13:02:40",
                    "content": "    LongForWisdom:  @bit please try to avoid speaking for others when you make posts like this. You do not speak for everyone else here, and you definitely don’t speak for the devs.   OK, I forget sometimes to use more polite language - sorry but what if that statement is truth? You didn’t say: “I believe that DAI will be $1.00 within 1 month”. No other dev objected and said a similar thing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#27",
                    "likes": "3",
                    "time": "03/08/2020-13:14:48",
                    "content": "Yep, I don’t think you do it on purpose, but it is important to try to remember. For me it helps to turn it around. Maybe ask yourself if you’d be happy for someone else to say ‘@bit believes that DAI with be $1.00 in one month.’ Lots of people don’t say lots of things, you shouldn’t ascribe beliefs to people based on statements that they haven’t made without some other evidence. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.791666666666667
                }
            ]
        }
    ]
}