{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - IPCL (India Power Green Bonds) - May 2, 2022",
            "index": "14485",
            "option": "No (Defer)",
            "supporting_mkr": "49,104",
            "highest_fraction": 0.45
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip6-collateral-onboarding-india-power-green-bonds/14485",
            "title": "MIP6 Collateral Onboarding: India Power Green Bonds ",
            "index": 14485,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/OasisProTeam",
                    "index": "#1",
                    "likes": "8",
                    "time": "06/04/2022-19:13:58",
                    "content": " MIP6 Collateral Onboarding Application: India Power Green Bonds  Who is the interested party for this collateral application?  Issuer: India Power Corporation Limited, with its registered office in Kolkata, India (IPCL, the Company or India Power). Advisor to IPCL: Oasis Pro Markets LLC (together with its affiliates, Oasis Pro)  Provide a brief high-level overview of the project, with a focus on the applying collateral token.  Real World Asset Proposed: One or more senior secured fixed rate bonds or other indebtedness (Bonds) secured by collateral with full recourse to IPCL, ranking pari passu with other senior secured debt of IPCL. Description of Collateral: Subject to further review and discussion among credit and legal, IPCL and Oasis Pro.  Provide a brief history of the project.  This MIP6 is submitted by Oasis Pro, as advisor to IPCL. IPCL has its registered office in Kolkata, India. The Company was granted a license to distribute electricity across 771 sq. kms. in Asansol - Ranigunj areas of West Bengal in 1932 and since then the Company has been a dedicated power supplier to the region, driving economic and social growth by supplying quality power to government utilities, hospitals, industries, mines, commercial and domestic consumers. As of financial year 2020-21, the Company distributes electricity over a license area of 771 sq. kms.   The Company has transformed itself through modern technology such as SCADA, IoT enabled Distribution Transformer health monitoring, AMR / Prepaid enabled meters, 24x7 call centre and data analytics, online prepaid recharge facilities for almost all the customers. IPCL has also interest into generation of electricity primarily through renewable energy sources. Current Portfolio includes total generation capacity of around 39 MW comprising 24.8 MW from wind asset in Gujarat, 2 MW from solar assets in West Bengal and 12 MW from thermal power plant at Asansol, West Bengal. The Company’s wholly-owned subsidiary MP Smart Grid Private Limited is engaged in executing a first-of-its-kind public-private partnership that involves installation and operation & maintenance of 350,000 smart meters across five towns of Madhya Pradesh under a contract awarded by one of the Madhya Pradesh state owned Discom. In addition to the end- to-end installation of smart meters in consumer residences, the project also requires establishment of sophisticated technology infrastructure with an operation and maintenance mandate for a period of five years. According to Indian Renewable Energy Industry Report by IBEF (India Brand Equity Foundation), the Indian renewable energy sector is the fourth most attractive renewable energy market in the world according to Renewable Energy Country Attractiveness index 2018 by EY. India was ranked fifth in wind power, fifth in solar power and fourth in renewable power installed capacity, as of 2019. Installed renewable power generation capacity has been climbing steadily over the past few years, growing at a CAGR of 17.33% between financial years 2016-20. The primary objective for deploying renewable energy in India is to advance economic development, improve energy security, improve access to energy, and mitigate climate change. Strong government support and the increasingly opportune economic situation have pushed India to be one of the top leaders in the world’s most attractive renewable energy markets. Despite Covid-19 pandemic, more than 260 GW (gigawatts) of renewable energy capacity was added globally in 2020, beating previous record by almost 50%. More than 80% of all new electricity capacity added last year was renewable, with solar and wind accounting for 91% of new renewables. Nearly everywhere in the world, producing electricity from new renewables is more cost effective than producing it from new coal-fired power plants. Renewables also are outcompeting new natural gas-fired power plants on cost in many locations, and are the cheapest sources of new electricity generation in countries across all continents (excluding Antarctica). Through technology innovations and economies of scale, the global wind power market has nearly quadrupled in size over the past decade and established itself as one of the most cost-competitive and resilient power sources across the world. Covid-19 has reinforced the need for a greener and cleaner environment with more emphasis on quality of life. India Power is committed to fulfilling the growing energy requirements of a developing India in a sustainable and smart manner. The Company is committed to accelerate its investment in renewable energy over the coming years and presently projects a green energy mix to around 70% by financial year 2024. Sustainability is at the core of IPCL’s mission to improve the quality of life and the environment. The Company has also crafted various sustainable and smart business models for the rollout of AMI projects in the country. IPCL envisages delivering on the ambitious vision planned by the Government of India of having installed over 250 million smart meters in the next five years. Out of the total proposed implementation of 250 million smart meters by Govt. of India, IPCL targets to secure contracts for implementation of about 5 million smart meters in phased manner over next 3-5 years under the various on-going/ upcoming PPP based bids for the distribution companies across India. IPCL is evaluating the various tenders floated by the Discoms across the India that are under process and under pipeline, and targeting to secure contracts which are available as immediate opportunity in near to medium term. It is also focusing on development of renewable energy portfolio of ~ 300 MW over a period of 3 years. IPCL is advanced stage of land acquisition and execution of binding agreements with potential procurers. India Power aspires to be committed towards powering the future with sustainable energy. A few of the Company’s recent achievements to generate renewable energy sources and reduce carbon emissions from existing fossil fuels and generate renewable energy sources are: •\tOne of the first private power utility to sign a Power Purchase Agreement with Solar Energy Corporation of India for purchase of 100 MW renewable hybrid power. Partial supply under this Power Purchase Agreement has already been commenced. •\tSign a Power Purchase Agreement with Solar Energy Corporation for purchase of 100 MW Round-the-clock (RTC) renewable energy. •\tAdvanced Metering Infrastructure, pre-paid metering and SAP system implemented. •\tImplemented SCADA, Gas Insulated Substation, 24x7 Online Distribution Transformer health monitoring through IoT. •\tEnergy efficiency through well distributed transformers and capacitor banks. •\tLong Term Power Sale Agreement of 40.5 MW Power from its upcoming Solar PV Project. Wind power The Company has over a decade of experience in operating wind energy projects. The renewable portfolio of the Company is as follows:     State District Project Capacity Commercial Operation Date PPA Term and Authority Tariff ₹/kWh     Gujarat Rajkot, Jamnagar and Kutch 24.8 MW March 2007 20 Years – executed with Gujarat Urja Vikas Nigam Limited 3.37    •\tThe Company operates the wind project on an asset-light model, wherein, it exclusively administers the wind farms for a fixed lease payment. •\tProject has secured long term PPA. •\tThe Company ensures energy availability of above 90% and a Plant Load Factor of over 18%. Solar power  West Bengal Green Energy Development Corporation Limited in association with the Company set up a 2 MW Photo Voltaic solar power plants in Jamuria, West Bengal. Power generated from this solar plant is directly fed into the Company’s Distribution License area at Asansol. The solar plant has helped to reduce 0.7 metric tons of CO2 emission per day. India Power was the first to cross the Megawatt threshold in solar and connect a solar power plant to a power grid. India’s energy landscape is changing quickly on many fronts and the pace of these changes is likely to only accelerate over the coming years. As India looks to meet its energy demand on its own, which is expected to reach 15,820 TWh by 2040, renewable energy is set to play an important role. The government is aiming to achieve 227 GW of renewable energy capacity (including 114 GW of solar capacity addition and 67 GW of wind power capacity) by 2022, more than its 175 GW target as per the Paris Agreement. India’s renewable energy sector is expected to attract investment worth US$ 80 billion in the next four years.  Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  India Power’s business responsibility, codes of contacts, corporate social responsibility, related party transaction policies, among others, can be found using the link below: https://www.indiapower.com/investor-relation/?financial India Power’s Environment Social Governance compliance can be found using the link below:    esg.churchgatepartners.com    ChurchGate Partners Churchgate Partners is an international investor relations advisor founded in 2009. We work closely with our corporate clients in designing and implementing investor relations programs to meet their specific requirements.       Link any available audits of the project. Both procedural and smart contract focused audits.  Below is a link to IPCL’s 2020 annual financial extracts:   indiapower.com    Annual-Return-2019-20_.pdf 363.16 KB      Additional financial information and analysis is included in India Power’s annual report:   indiapower.com    IPCL-Annual-Report-2020-21.pdf 12.67 MB       Link to any active communities relating to your project.  The case for Clean Money  How is the applying collateral type currently used?  [To Come.]  Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in?  [Subject to valuation, credit and legal analysis, collateral may include: [a first ranking pari passu mortgage over all immovable property of India Power [specific projects, property plant or equipment], (2) a first ranking pari passu charge over all movable (tangible and intangible) assets and current assets, receivables, book-debts, cash flows and related account of the India Power in relation to [specific projects, property plant or equipment], and (3) a first ranking pari passu charge over the rights and benefits of India Power and its specified subsidiaries under certain project documents (including, power purchase agreements, engineering, procurement and construction contracts, operation and maintenance contracts, clearances and authorizations, insurance contracts, letters of credit and performance bonds).] The location of the collateral is in India. The Company will be required to (or in the case of certain assets, take all commercially reasonable steps to) create, perfect and register the security interest over any collateral securing the Bonds within the respective time periods agreed to in final agreements. The Company will take all actions to facilitate the creation, perfection and registration of security interests, and obtain necessary consents, approvals and authorizations from governmental authorities, counterparties and existing lenders within the time period specified in any final documentation. India Power operates in a heavily regulated industry in India. The power sector is governed by the central and state regulatory authorities. Also, certain transactions may need Reserve Bank of India and Securities Exchange Board of India review and/or consent.  Where does exchange for the asset occur?  India.  (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review.  No legal opinion or memoranda has been requested yet, but we would be open to discussing what legal support would be required if this MIP6 is approved. Present fund raising is proposed in form of Bond under Master Direction - External Commercial Borrowings, Trade Credits and Structured Obligations available at below link: https://rbidocs.rbi.org.in/rdocs/notification/PDFs/5MD2603201979CA1390E9E546869B2A9A92614DEDBF.PDF  (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable.  India Power operates in a heavily regulated industry in India. The power sector is governed by the central and state regulatory authorities. Also, certain transactions may need Reserve Bank of India and Securities Exchange Board of India review and/or consent. Present fund raising is proposed in form of Bond under Master Direction - External Commercial Borrowings, Trade Credits and Structured Obligations available at below link: https://rbidocs.rbi.org.in/rdocs/notification/PDFs/5MD2603201979CA1390E9E546869B2A9A92614DEDBF.PDF  (Optional) List any possible oracle data sources for the proposed Collateral type.  TBD.  (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type.  TBD.  Provide (a) proposed legal structure for transaction, including: type of legal entities, (offshore/onshore, form (trust, corporate, other)) and jurisdiction(s) of legal entities, and (b) likely funds flow (DAI => Fiat => DAI).  Legal documentation and the set up any new ADGM or other legal entity to invest in the Bonds, will be handled by Latham & Watkins, as counsel to Oasis Pro, who is an advisor to India Power in connection with this financing. MakerDAO’s legal counsel, North Lakes Legal PLLC, would review such documentation and perform any legal assessments deemed necessary. India Power will be responsible for the legal fees incurred in executing this transaction. Note, while this MIP6 contemplates an ADGM entity as the investor of record for the Bonds, after further assessment of tax, regulatory and other legal issues, it may be determined that the investor of record should be domiciled in another jurisdiction. Latham & Watkins has represented issuers in several public green bond issuances and will be used to structure the Bonds. In particular, it has represented several Indian power and energy companies with their public secured and unsecured green bond issuances. The Bonds will constitute direct, unconditional and unsubordinated obligations of Indian Power. The payment obligations of India Power under the Bonds shall, save for such exceptions as may be provided by applicable law and subject to the covenants and undertakings set out in the final agreements governing the Bonds, rank (i) at least equally with all other senior secured obligations of the Company, present and future, and (ii) senior in respect of all other unsecured or subordinated obligations of the Company, present and future. The Company will be required to (or in the case of certain assets, take all commercially reasonable steps to) create, perfect and register the security interest over any collateral securing the Bonds within the respective time periods agreed to in final agreements. The Company will take all actions to facilitate the creation, perfection and registration of security interests, and obtain necessary consents, approvals and authorizations from governmental authorities, counterparties and existing lenders within the time period specified in any final documentation. India Power operates in a heavily regulated industry in India. The power sector is governed by the central and state regulatory authorities. Also, certain transactions may need Reserve Bank of India and Securities Exchange Board of India review and/or consent. It is anticipated that North Lakes Legal will perform the necessary assessments for this MIP, including, but not limited to: (1) reviewing and negotiating any legal documentation evidencing the Bonds, any guarantee and any collateral granted to secure the Bonds obligations, as well as any ancillary or supplemental documentation, (2) reviewing security interest documents and advice relating to perfection thereof in India and (3) reviewing any regulatory advice obtained in connection with this transaction. Internationally-recognized legal counsel may be engaged to advise for the benefit of MakerDao.  Provide details on the organizational structure of the interested party, beneficial ownership, governance/control, key personnel, capital/funding resources and past financial performance.  Below is a link to IPCL’s 2020 annual financial extracts:   indiapower.com    Annual-Return-2019-20_.pdf 363.16 KB      Additional financial information and analysis is included in India Power’s annual report:   indiapower.com    IPCL-Annual-Report-2020-21.pdf 12.67 MB       Provide detailed summary of the proposed economic terms of the transaction, including, without limitation: commitment term, principal amount, interest rate, frequency of principal and interest payments, disbursement schedule, equity amount, funding ratios (equity/debt pro rata, equity first, etc.), collateral security, coverage ratios, currency (if not DAI) and other material terms. The quality of the proposed economic terms will be a consideration for the prioritization process.  Description of Collateral: Subject to further review and discussion among MakerDAO credit and legal, IPCL and Oasis Pro. Investor in Bonds for the benefit of MakerDAO: a legal entity organized in Abu Dhabi Global Markets, or such other legal entity specified by MakerDAO’s legal representative (Maker entity). Principal: $120mm. Stated Maturity: 5 years. Coupon: [2-2.5]% annualized. Other terms are forthcoming.  Identify in reasonable detail the risks associated with this collateral application and the underlying asset(s) and proposed mitigants (if any). The risk summary should address, without limitation and to the extent relevant: market risks, commercial risks (e.g., diversification, credit, etc.), interest rate risks, legal and regulatory risks, general industry risks, competition, etc.  A third-party valuation agent acceptable to the credit representatives will be appointed to provide values for the collateral (as may be negotiated in the final terms and conditions of the transaction). Similarly, if the credit representatives would like a credit evaluation of India Power, a third-party firm can be engaged that is acceptable to them. Any third-party valuations or credit analysis will be paid by India Power. Below is a link to 2020 annual financial extracts:   indiapower.com    Annual-Return-2019-20_.pdf 363.16 KB      Additional financial information and analysis is included in India Power’s annual report   indiapower.com    IPCL-Annual-Report-2020-21.pdf 12.67 MB      Below is a link to a Brickwork Ratings report on India Power’s for certain bank loan facilities:   brickworkratings.com    India-Power-Corporation-18April2022%20.pdf 385.71 KB      India Power operates in a heavily regulated industry in India. The power sector is governed by the central and state regulatory authorities. Also, certain transactions may need Reserve Bank of India and Securities Exchange Board of India review and/or consent. See note 53 to IPCL’s consolidated financials (beginning on page 126 of the annual report (2020-2021) for a discussion of the risks that IPCL faces and its management thereof.  Outline the applicant’s underwriting guidelines/policies, origination strategy (marketing, sales, channels), servicing strategy (charge-offs, collections), and historical asset performance.  India Power is a publicly traded company. All financial reports can be found at the following site: https://www.indiapower.com/investor-relation/?financial India Power Corporate governance & Policies India Power’s business responsibility, codes of contacts, corporate social responsibility, related party transaction policies, among others, can be found using the link below: https://www.indiapower.com/investor-relation/?financial India Power Environment Social Governance India Power’s Environment Social Governance compliance can be found using the link below:    esg.churchgatepartners.com    ChurchGate Partners Churchgate Partners is an international investor relations advisor founded in 2009. We work closely with our corporate clients in designing and implementing investor relations programs to meet their specific requirements.       Outline the applicant’s risk monitoring and operations guidelines/policies (e.g., charge-offs, collection, recovery provisions, data collection and technology, etc).  Below is a link to India Power’s corporate codes and policies: https://www.indiapower.com/investor-relation/?financial Digitization and technology reports are included in India Power’s annual report:   indiapower.com    IPCL-Annual-Report-2020-21.pdf 12.67 MB      See note 53 to IPCL’s consolidated financials (beginning on page 126 of the annual report (2020-2021)) for a discussion of the risks that IPCL faces and its management thereof and note 12 (beginning on page 157 of the annual report (2020-2021)) for a discussion of risks relating to trade receivables.  Describe the regulatory regime applicable to the underlying asset (if any) and the applicant’s legal and compliance program relating thereto.  India Power operates in a heavily regulated industry in India. The power sector is governed by the central and state regulatory authorities. Also, certain transactions may need Reserve Bank of India and Securities Exchange Board of India review and/or consent.  Identify any 3rd party persons likely to be relied upon by applicant to implement the transaction (legal, accounting, servicers, trustees, etc.).  A third-party valuation agent acceptable to the credit representatives will be appointed to provide values for the collateral (as may be negotiated among the parties). Similarly, if the credit representatives would like assistance to evaluate the creditworthiness of India Power, a reputable third-party firm can be engaged. Any third-party valuations or credit analysis fees will be paid by India Power. Latham & Watkins, as counsel to Oasis Pro (in its capacity as advisor to IPCL for this MIP6), will be engaged to provide transactional advice, set-up the investor entity and deliver any regulatory advice (ex. India). Local Indian counsel may be engaged as well to review any issues relating to local regulations and collateral enforceability/perfection issues. A collateral agent appointed in India may be required for the security interest in the collateral supporting the Bonds. The content of this communication is for informational purposes only. You should not construe any information contained herein as legal, tax, investment, financial, or other advice. You should not rely on the information contained herein as a basis for making any business, legal or other decisions. Oasis Pro, as advisor, India Power and each of its members, affiliates, officers, directors, owners, employees, agents, representatives, suppliers and service providers cannot be held liable for any of the information contained in this communication. Nothing contained herein constitutes a solicitation, recommendation, endorsement, or offer by any of OPM or India Power or any third-party service provider to buy or sell any securities or other financial instruments in any jurisdiction. None of OPM and India Power makes any representation or warranty as to the completeness or accuracy of any information contained herein or that is sufficient for any purpose. ",
                    "links": [
                        "https://esg.churchgatepartners.com/login/companyprofile?id=350033003500240024004100530048004F004B0041004E0041004E00590041004100560041004E004900410053004800570049004E00490024002400",
                        "https://esg.churchgatepartners.com/login/companyprofile?id=350033003500240024004100530048004F004B0041004E0041004E00590041004100560041004E004900410053004800570049004E00490024002400",
                        "https://www.indiapower.com/wp-content/uploads/2020/09/Annual-Return-2019-20_.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2020/09/Annual-Return-2019-20_.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2020/09/Annual-Return-2019-20_.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2021/08/IPCL-Annual-Report-2020-21.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2021/08/IPCL-Annual-Report-2020-21.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2021/08/IPCL-Annual-Report-2020-21.pdf",
                        "https://forum.makerdao.com/t/the-case-for-clean-money/10684",
                        "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/5MD2603201979CA1390E9E546869B2A9A92614DEDBF.PDF",
                        "https://rbidocs.rbi.org.in/rdocs/notification/PDFs/5MD2603201979CA1390E9E546869B2A9A92614DEDBF.PDF",
                        "https://www.indiapower.com/wp-content/uploads/2020/09/Annual-Return-2019-20_.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2020/09/Annual-Return-2019-20_.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2020/09/Annual-Return-2019-20_.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2021/08/IPCL-Annual-Report-2020-21.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2021/08/IPCL-Annual-Report-2020-21.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2021/08/IPCL-Annual-Report-2020-21.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2020/09/Annual-Return-2019-20_.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2020/09/Annual-Return-2019-20_.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2020/09/Annual-Return-2019-20_.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2021/08/IPCL-Annual-Report-2020-21.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2021/08/IPCL-Annual-Report-2020-21.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2021/08/IPCL-Annual-Report-2020-21.pdf",
                        "https://www.brickworkratings.com/Admin/PressRelease/India-Power-Corporation-18April2022%20.pdf",
                        "https://www.brickworkratings.com/Admin/PressRelease/India-Power-Corporation-18April2022%20.pdf",
                        "https://www.brickworkratings.com/Admin/PressRelease/India-Power-Corporation-18April2022%20.pdf",
                        "https://www.indiapower.com/investor-relation/?financial",
                        "https://www.indiapower.com/investor-relation/?financial",
                        "https://esg.churchgatepartners.com/login/companyprofile?id=350033003500240024004100530048004F004B0041004E0041004E00590041004100560041004E004900410053004800570049004E00490024002400",
                        "https://esg.churchgatepartners.com/login/companyprofile?id=350033003500240024004100530048004F004B0041004E0041004E00590041004100560041004E004900410053004800570049004E00490024002400",
                        "https://www.indiapower.com/investor-relation/?financial",
                        "https://www.indiapower.com/wp-content/uploads/2021/08/IPCL-Annual-Report-2020-21.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2021/08/IPCL-Annual-Report-2020-21.pdf",
                        "https://www.indiapower.com/wp-content/uploads/2021/08/IPCL-Annual-Report-2020-21.pdf",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-2-de-mayo-de-2022/14923",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/70",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/39",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-41-oasis-pro-markets-mip6s-ama/14767",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/19",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/74",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/62"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.41617360161768
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#2",
                    "likes": "7",
                    "time": "08/04/2022-14:44:27",
                    "content": "1.5% annualized is below US treasury yields. Why would we invest in this over US treasuries? If we have to sell this, why would someone pay Maker full price when they could get US treasuries instead? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tylermeanswell",
                    "index": "#3",
                    "likes": "1",
                    "time": "09/04/2022-21:25:28",
                    "content": "I think of all the opportunities out there, we should definitely consider fostering assets & relationships in the Indian market as a priority. It’s both a place that can benefit enormously from the capital/liquidity that a relationship with Maker could offer, but Maker can benefit from a partner with huge latent economic potential to help push forward MakerDAOs RWA goals. It also has a tech-savvy population that is more comfortable with non-traditional forms of credit. Further, it moves Maker towards having a collection of non-crypto assets that aren’t so highly dependent on the US market. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9222222222222225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/numair",
                    "index": "#4",
                    "likes": "6",
                    "time": "10/04/2022-17:00:49",
                    "content": "I would be interested to understand how the terms on offer to MakerDAO stand in relation to those that are expected by the Government of India’s Indian Renewable Energy Development Agency, which can be seen here:    ireda.in   IREDA Indian Renewable Energy Development Agency Limited. A Government Of India Enterprise      Is there a reason why IREDA’s rates are not relevant for this discussion? Does the risk profile somehow differ from what IREDA is financing? ",
                    "links": [
                        "https://www.ireda.in/interest-rate-matrix"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.848214285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#5",
                    "likes": "9",
                    "time": "13/04/2022-13:52:48",
                    "content": "@OasisProTeam thanks for your MIP6. Blitzing the forums at the moment—love to see it. I am going to combine some thoughts in one long post to get everybody thinking. Really excited both by the prospect of doing business in India and in enabling greening there. Please excuse any and all misconstruals.  Drafting off of @numair’s point about comparable transactions, see below for a side-by-side of the Brickworks and IREDA ratings scales. The equivalent IREDA rating for a Brickwork BRW A- would be A- (for State Gencos/Transcos), suggesting an annual coupon of 8.20%. Please provide some detail as to why the 8.20% rate is not applicable to IPCL.  Brickworks Rating Scale  1586×878 240 KB  IREDA Ratings (2022 data)  1390×458 66 KB  Brickworks IPCL Rating: Long-term debt rated BWR A-, NCD rated BWR A-  Screen Shot 2022-04-13 at 9.27.31 AM1206×772 188 KB   Continuing along a similar line of inquiry, on page 5 of the Brickworks rating report on IPCL, a debt instrument with shelf NCD-II is outstanding to IPCL. See the subject instrument screen-shotted below. NCD-II, which presumably refers to the second issuance by IPCL of non-convertible debentures (NCD) has two international securities identification numbers (similar to CUSIPS), suggesting private or public issuance.   One of these issuances has 8 Crores ($86MM) in principal outsanding and a September 19, 2022 maturity.This appears to be the debt the MakerDAO is refinancing with its potential $120MM origination. Is this in fact the case? These notes are clipping 12% coupons. What is the rationale behind why MakerDAO’s notes will yield 8-12x lower? Especially in the case we that are literally refinancing 12% debt? Who (broadly: PPE, private debt fund, etc.) refinanced the note (INE360C07096) maturing as of September 19, 2021 and at what rate?  We do recognize that rates have changed since September of 2012, both in India and elsewhere. Short End: It seems that the Reserve Bank of India has dropped its benchmark from about 8% in September 2012 to 4% in December 2021. Long End: The Indian 10-year bond was clipping 6.71% in September 2012 and is clipping 7.22% as of April 4th. Neither movements in the short-end or long-end seem to support the lower yields being offered to Maker. I am of course missing information on spreads. BrickWorks Rating on IPCL NCD-II  1268×282 85.2 KB       The Company was granted a license to distribute electricity across 618 sq. kms. in Asansol - Ranigunj areas of West Bengal in 1932”.  As a lender, we need not only consider the likelihood that our debt is serviced adequately (by IPCL’s rights to distribute over the term of the loan) but the likelihood that our loan can be refinanced. The “take-out” lender will want a similar guarantee that his or her loan will be serviced by distribution rights extending into the future. When does this license to distribute expire?  Some questions about the nature of the collateral and potential agreements between creditors:   Based on the wording, our collateral could be any number of things (four options). Does this mean that IPCL has given OPM the remit to negotiate with MakerDAO as to what its security interests entail? It seems, based on the inclusion of “pari passu”, that most of these assets are already encumbered. Does the lender who refinanced the NCD-II note expiring in 2021 have first liens in place against ALL of the collateral options (sans the 4th)? If not, who will Maker be pari with? Do IPCL’s current long and short-term bank lines have security interests in the same assets that MakerDAO would? If not an existing lender, is the $120MM being offered to MakerDAO part of a broader shelf of bonds being offered to the market? Is the rate being offered to MakerDAO equivalent to the rate on pari party’s (whether existing or future) debt?       [To further its green and renewable energy efforts, the proceeds of the Bonds will be used to (a) fund smart metering broadly that results in the reduction of fossil fuel usage, (b) increase the use of renewable energy sources and (c) refinance existing debt.] [additional detail to come].”   Looking forward to additional details. Though admirable directionally, the specifics of the implementation will be helpful to understand. Putting the proceeds used to refinance existing debt aside, should MakerDAO think about this as an opportunity to provide IPCL with general working capital for achieving 40% renewable energy by 2024? Or are there specific and verifiable initiatives (such as smart meter deployment) that MakerDAO credit will go towards?   I dug up another ratings report, done by Care Edge ratings, on IPCL from October 2020. It differs a bit from the report done by Brickworks in March 2021, six months later. See below: https://www.careratings.com/upload/CompanyFiles/PR/India%20Power%20Corporation%20Limited-10-13-2020.pdf    Screen Shot 2022-04-13 at 9.41.22 AM1584×864 99.5 KB  On every facility type, “Long Term Bank Facilities”, “Short Term Bank Facilities”, and “Non-Convertible Debentures”, Care is more critical of IPCL than Brickworks. See comparison below:  Long Term Bank Facility: Brickworks BWR A- (low credit risk), CARE BBB (credit watch with negative implications, moderate credit risk) Short Term Bank Facility: BWR A2 (low credit risk), CARE A3 (credit watch with negative implications, moderate credit risk) Non-Convertible Debentures: Brickworks BWR A- (low credit risk), CARE BBB (credit watch with negative implications, moderate credit risk)  I don’t know enough about the ratings landscape in India to comment. But thought folks should get a credit viewpoint independent from that which was provided with the application. ",
                    "links": [
                        "https://tradingeconomics.com/india/government-bond-yield",
                        "https://www.careratings.com/upload/CompanyFiles/PR/India%20Power%20Corporation%20Limited-10-13-2020.pdf"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.067477422003284
                },
                {
                    "author_link": "https://forum.makerdao.com/u/beedubs",
                    "index": "#6",
                    "likes": "7",
                    "time": "13/04/2022-15:17:26",
                    "content": "OPM Team, To follow up on Teej’s note, in a follow up report from CARE, they indicate that the ratings have fallen to BB+, and that IPCL is not cooperating with the repeated requests to provide a No Default Statement. Can you please provide more background about this situation and if it has been resolved with CARE Ratings? Can IPCL confirm it is not in default of any of its obligations? For more info:   careratings.com    17082021061644_India_Power_Corporation_Limited.pdf 772.82 KB      ",
                    "links": [
                        "https://www.careratings.com/upload/CompanyFiles/PR/17082021061644_India_Power_Corporation_Limited.pdf",
                        "https://www.careratings.com/upload/CompanyFiles/PR/17082021061644_India_Power_Corporation_Limited.pdf"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/numair",
                    "index": "#7",
                    "likes": "2",
                    "time": "14/04/2022-08:58:45",
                    "content": "@teej @beedubs It would be interesting if you could get clarification regarding the following passages of the proposal:  All projects have secured long term PPAs.  When my colleagues have looked at putting together energy deals backed by PPAs,  the creditworthiness of the counterparty has been a critical factor. MakerDAO will also want to see the actual PPAs to determine when these entities can back out of paying the agreed-upon rate, what their credit ratings look like, and so on. There is a big difference between the unconditional PPAs signed by companies such as Google, and those you get from a local factory.  Latham & Watkins has represented issuers in several public green bond issuances and will be used to structure the Bonds. In particular, it has represented several Indian power and energy companies with their public secured and unsecured green bond issuances.  Can Latham provide deal docs for these past transactions? The team would learn a lot about what has worked in the Indian market, regarding terms, rates and so on. It’d also be super-helpful to have permission to reference / cite those materials. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.990196078431373
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#8",
                    "likes": "4",
                    "time": "15/04/2022-14:47:00",
                    "content": "The incubating Legal and Transactional Services core unit is pleased to provide the following questions/observations to this MIP6. Please note that these are preliminary high level questions/observations based on the information provided to date. A more comprehensive diligence and analysis of the overall transaction, contracts, cash-flow, etc. is required to form a complete picture and form an educated opinion. In addition to the more specific comments below, a brief summary of the incubating LTS core unit’s high level observations:   OPM and IPCL will need to provide more detail on the mechanics of the debt repayment. Understanding the Reserve Bank of India approval process, as noted by OPM, will be critical (presumably this will be an “external commercial borrowing” for purposes of the Reserve Bank of India).   A better understanding of Indian withholding tax on interest payments made offshore is required.   Will the lending entity (the ADGM entity) require registration in India?   We will need to undertake a more extensive due diligence of the overall collateral package and understand the lender’s rights and remedies upon enforcement against the collateral. While India has recently improved in respect of enforcement of contracts and recovery rates, its historical record compared to other jurisdictions is weak.    Screen Shot 2022-04-15 at 10.34.36 AM1920×871 73.2 KB   Screen Shot 2022-04-15 at 10.36.39 AM1688×696 196 KB  Both graphs from E&Y, “Evolution of Private Credit in India”. How private credit is evolving in India   OPM and IPCL will need to propose a security/collateral agent in India to act for the lender for the assets to be collaterally pledged.   Will this proposed loan share collateral with other IPCL senior secured indebtedness? If so, we will need to understand if there will be a common collateral security agreement, the terms, and constraints on unilateral action in the event of a default.   IPCL to confirm that its equity is not owned by the Government of India such that it would subject IPCL to the World Bank negative pledge covenant.   This deal may take time to close because of some of the issues described above and below.       OasisProTeam:  Description of Collateral: Subject to further review and discussion among MakerDAO credit and legal, IPCL and Oasis Pro.    Additional information on the collateral to secure the bonds is required.      OasisProTeam:  MakerDAO’s legal counsel, North Lakes Legal PLLC, would review such documentation and set up any new ADGM or other legal entity to invest in the Bonds, with assistance from Latham & Watkins (or other external counsel) if necessary.    It would be helpful if OPM (or Latham) could do the actual work to establish the ADGM entity. I am happy to provide guidance, suggestions, support, etc., but this should not be a direct activity of North Lakes Legal.      OasisProTeam:  Note, while this MIP6 contemplates an ADGM entity as the investor of record for the Bonds, after further assessment of tax, regulatory and other legal issues, it may be determined that the investor of record should be domiciled in another jurisdiction.    Agree that the jurisdiction for the investor of record will be an important factor to determine in the 1st instance. Any analysis will need to account for the flexibility afforded by the particular jurisdiction, governing law, and an analysis of the tax consequences of payments from India to this jurisdiction (assuming some level of withholding tax and need for gross-up).      OasisProTeam:  The payment obligations of India Power under the Bonds shall, save for such exceptions as may be provided by applicable law and subject to the covenants and undertakings set out in the final agreements governing the Bonds    We will need to understand and review the covenants and undertakings. Also, what is the anticipated “applicable law”? Will the bonds be English law governed?      OasisProTeam:  Also, certain currency transactions and payments may need Reserve Bank of India review and/or consent.    It is very helpful that OPM is flagging this point. Reserve Bank of India review and/or consent may be a gating issue for this transaction. We will need to fully understand this process. OPM’s selection of Latham & Watkins as external counsel will be very helpful in this regard. I have direct experience with Latham & Watkins on dealing with similar issues in my prior roles and Latham and Watkins is well versed on this topic.      OasisProTeam:  It is anticipated that North Lakes Legal will perform the necessary assessments for this MIP,    North Lakes Legal (acting for the incubating LTS) can only prepare a legal risk assessment. The other core units will prepare their respective risk assessments.      OasisProTeam:  taking all actions deemed necessary to perfect any security interest (by way of security transfer or title transfer)    I would expect the borrower to complete the steps necessary to perfect the security interest. Of course, the incubating LTS will make assessments from the Maker perspective.      OasisProTeam:  taking any and all other actions deemed reasonable and necessary to complete the transaction described herein    The incubating LTS is not a party to the transaction, so this is a bit broad.      OasisProTeam:  including the engagement of internationally-recognized legal counsel to advise for the benefit of MakerDao.    Yes, subject to external firm due diligence requirements. This remains an on-going challenge, but I continue to push firms forward on this issue.      OasisProTeam:  collateral may include: [a first ranking pari passu mortgage over all immovable property of India Power [specific projects, property plant or equipment], (2) a first ranking pari passu charge over all movable (tangible and intangible) assets and current assets, receivables, book-debts, cash flows and related account of the India Power in relation to [specific projects, property plant or equipment], (3) a first ranking pari passu charge over the rights and benefits of India Power and its subsidiaries under [certain project documents] (including, power purchase agreements, engineering, procurement and construction contracts, operation and maintenance contracts, clearances and authorizations, insurance contracts, letters of credit and performance bonds) and (4) a first ranking pledge by India Power over certain equity shares of [its controlled subsidiaries/specific subsidiaries]].    Subject to more comprehensive due diligence. However, a security interest in India-based assets will require the presence of a security/collateral agent in India. Has OPM considered potential security/collateral agents in India and such agents willingness to engage in a transaction indirectly involving the Maker protocol?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.392455382667647
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "8",
                    "time": "18/04/2022-15:40:48",
                    "content": "So this doesn’t currently fit the top-level MIP process because:  It’s in the wrong forum category. It is not correctly using the component structure.  It also doesn’t fit the MIP6 application process, because:  It has a preamble, and is marked as MIPXX. I haven’t checked, but I’m unsure if it covers all the questions as laid out in the MIP6, and definitely doesn’t follow the template.  This won’t progress until this has been written in such a way that it falls into one of these processes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#10",
                    "likes": "0",
                    "time": "18/04/2022-20:54:04",
                    "content": "Thank you for this @LongForWisdom. As described in this post about prioritisation, Real-World Financing (RWF-001), Legal and Transaction Services (incubating LTS) and Lending Oversight (incubating LOVE) were planning to provide an initial reaction on content and process of the proposed MIP. LTS’ review can be seen above, posted by @christiancdpetersen. Following @GovAlpha-Core-Unit guidance, I would suggest @Real-World-Finance to wait for this proposal to be “unlocked” by GovAlpha before submitting a review. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OasisProTeam",
                    "index": "#11",
                    "likes": "1",
                    "time": "20/04/2022-13:30:48",
                    "content": "@LongForWisdom Thank you for your comment. We’ve updated the proposal to be in line with MIP6. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#12",
                    "likes": "3",
                    "time": "20/04/2022-14:38:25",
                    "content": "@luca_pro, this is now fine from a governance PoV. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#13",
                    "likes": "0",
                    "time": "20/04/2022-14:39:34",
                    "content": "Thank you for the update @LongForWisdom, cc’ing @Real-World-Finance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OasisProTeam",
                    "index": "#14",
                    "likes": "0",
                    "time": "25/04/2022-22:15:56",
                    "content": "Thank you for the thoughtful questions and comments. We appreciate the enthusiasm for this project. A.\tRefinancing of existing Term Loan –  IPCL debt profile as on March 31, 2022 along with security package is as under –  (Amount $ mn)     Sl. No. Type of Facility Sanction Limit Outstanding Limit Security Refinancing from proposed ECB raising     1 Term Loan 12.47 7.31 1st charge on specific PPE 7.31   2 Working Capital Loan 11.35 9.78 1st pari-passu charge on Current Assets -   3 GECL^ 7.54 5.59 2nd charge on all assets -   4 NCD – II 2.67 0.53 Specific landed properties 0.53    Total 34.03 23.21  7.84    ^Guaranteed Emergency Credit Lines (provided during COVID-19 by Govt. of India).   Proposed fund raising to be utilized for refinancing of existing term loan to the tune of $ 7.84 mn.   This would vacate the 1st charge on PPE of the Company which would be available for ECB (external commercial borrowing) lender along with the future lenders on pari-passu basis (considering the next round of fund raising with the acceptable assets coverage ratio from domestic/ offshore market).   B.\tExpansion of existing Distribution Network –   Part of the balance ECB proceeds to the tune of $ 35 mn. be used for expansion & augmentation of its distribution network for larger renewable energy offtake.   IPCL is one of the first private Power utility to sign long term Power Purchase Agreements (PPAs) with Solar Energy Corporation of India (SECI) to procure energy from renewable sources. IPCL has executed –   a.\t100 MW renewable hybrid power. Partial supply under this Power Purchase Agreement has already been commenced. b.\t100 MW Round-the-clock (RTC) renewable energy. Supply under this PPA is to be commenced in next calender year.   The Company has been surpassing the Renewable Energy Obligations (RPO) recommended by state electricity regulator i.e. West Bengal Electricity Regulation Commission (WBERC) and is further committed to accelerate its investment in renewable energy and enabling necessary infrastructure over the coming years and projects a green energy mix in its overall energy procurement by around 70% by financial year 2024.   The assets proposed to be developed under its distribution network would be available ECB lender for 1st charge on pari-passu basis.   C.\tDevelopment of Smart Metering and Renewable Energy Portfolio –  The balance amount of ~ $ 77 mn. To be used for development/ acquisition of renewable energy projects and smart metering projects.  a.\tSmart Metering – i.\tIPCL envisages delivering on the ambitious vision planned by the Government of India of having installed over 250 million smart meters in the next five years. ii.\tOut of the total proposed implementation of 250 million smart meters by Govt. of India, IPCL targets to secure contracts for implementation of about 5 million smart meters in phased manner over next 3-5 years under the various on-going/ upcoming PPP based bids for the distribution companies across India. iii.\tIPCL is evaluating the various tenders floated by the Discoms across the India that are under process and under pipeline, and targeting to secure contracts which are available as immediate opportunity in near to medium term. iv.\tIPCL’s wholly-owned subsidiary MP Smart Grid Private Limited is engaged in executing a first-of-its-kind public-private partnership that involves installation and operation & maintenance of 350,000 smart meters across five towns of Madhya Pradesh under a contract awarded by one of the Madhya Pradesh state owned Discom. v.\tIn addition to the end- to-end installation of smart meters in consumer residences, the project also requires establishment of sophisticated technology infrastructure with an operation and maintenance mandate for a period of five years. b.\tRenewable Energy Portfolio – i.\tCurrent renewable energy portfolio of IPCL includes total generation capacity of 26.8 MW comprising 24.8 MW from wind asset in the state of Gujarat and 2 MW from solar assets in the West Bengal. ii.\tIPCL is focusing on development of renewable energy portfolio of ~ 300 MW over a period of 3 years. iii.\tIt is at advanced stage of land acquisition and execution of binding agreements with potential procurers. iv.\tIt has executed Long Term Power Sale Agreement for sale of 40.5 MW power from one of its upcoming Solar PV Project.   The investment of $ 77 mn. is to be used for part financing of envisaged smart metering portfolio of and renewable energy portfolio of 5 mn and 300 MW respectively.   ECB lender would have first ranking pari passu charge over the fixed assets, rights and benefits of subsidiaries developing smart metering and renewable energy projects.   D.\tIPCL latest credit rating is attached.   brickworkratings.com    India-Power-Corporation-18April2022%20.pdf 385.71 KB      ",
                    "links": [
                        "https://www.brickworkratings.com/Admin/PressRelease/India-Power-Corporation-18April2022%20.pdf",
                        "https://www.brickworkratings.com/Admin/PressRelease/India-Power-Corporation-18April2022%20.pdf"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.596246973365617
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OasisProTeam",
                    "index": "#15",
                    "likes": "0",
                    "time": "25/04/2022-22:35:17",
                    "content": "Again, thank you for the thoughtful questions and comments @christiancdpetersen. We appreciate the enthusiasm for this project.     OasisProTeam:  MakerDAO’s legal counsel, North Lakes Legal PLLC, would review such documentation and set up any new ADGM or other legal entity to invest in the Bonds, with assistance from Latham & Watkins (or other external counsel) if necessary.       christiancdpetersen:   It would be helpful if OPM (or Latham) could do the actual work to establish the ADGM entity. I am happy to provide guidance, suggestions, support, etc., but this should not be a direct activity of North Lakes Legal.    We have revised this in the MIP6 to reflect this comment and we will ask Latham to set up the legal entity.     OasisProTeam:  taking all actions deemed necessary to perfect any security interest (by way of security transfer or title transfer)       christiancdpetersen:   I would expect the borrower to complete the steps necessary to perfect the security interest. Of course, the incubating LTS will make assessments from the Maker perspective.    Yes, that is what we anticipate as well. OPM and ATDC would request advice from Latham and India local counsel. We meant that North Lakes Legal could review and comment on the process, legal issues and advice provided by counsel.     OasisProTeam:  taking any and all other actions deemed reasonable and necessary to complete the transaction described herein       christiancdpetersen:   The incubating LTS is not a party to the transaction, so this is a bit broad.    We have removed this from the MIP6.     OasisProTeam:  including the engagement of internationally-recognized legal counsel to advise for the benefit of MakerDao.       christiancdpetersen:   Yes, subject to external firm due diligence requirements. This remains an on-going challenge, but I continue to push firms forward on this issue.    As long as there is no conflict of interest, OPM can use Latham to look into regulatory and legal issues for Christian. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.664194023569023
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OasisProTeam",
                    "index": "#16",
                    "likes": "1",
                    "time": "26/04/2022-15:57:49",
                    "content": "We appreciate the attention and support that our first two MIP6 proposals have received in the forum. We have truly enjoyed working with the Maker Core Units these proposals. Please join a call with Oasis Pro today for a presentation of our MIP6 proposals followed by a Q&A session.     Collateral Onboarding Call #41: Oasis Pro Markets MIP6s AMA Collateral Meetings   Collateral Onboarding Call #41: Oasis Pro Markets MIP6s AMA  India Power Green Bonds + Financing for ATD Combustors’ Egyptian Power Plant Efficiency Projects  Intro For the 41st Collateral Onboarding Call, we will have a collateral double feature🍿.  Oasis Pro Markets will host a community AMA on their two MIP6 applications for Real-world Assets.   MIP6: Financing for ATD Combustor’s Egyptian Power Plant Efficiency Projects MIP6: India Power Green Bonds  Join us 2022-04-26T18:00:00Z (UTC) as we …     ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-application-emerging-markets-green-opportunity-financing-for-atd-combustors-egyptian-power-plant-efficiency-projects/14489",
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-india-power-green-bonds/14485"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3500000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OasisProTeam",
                    "index": "#17",
                    "likes": "1",
                    "time": "28/04/2022-20:55:31",
                    "content": "@beedubs and @teej please see below for our response on the Care questions:   Care Ratings (CARE) is one the credit rating agencies engaged by India Power Corporation Limited (IPCL) in 2009 for regular credit ratings of its various credit facilities as stipulated under its financing agreements. Since then rating exercises have been conducted by CARE.   While their process states that, publishing of rating outcome can be done only after providing the Borrower a reasonable opportunity to examine the draft of the same so that any factually incorrect information is not published, CARE went ahead with publishing of rating outcome despite the non-acceptance communicated to CARE which was in clear violation and breach of the terms of the rating agreements entered into with the Company.   Accordingly, the Company has ceased any communication/ correspondence with CARE.   Citing the violation of rating agreement, the Company approached the Civil Court, Kolkata praying for removal of CARE’s publication showing incorrect/false information. The Company obtained a favourable interim order from the Civil Court which restrained CARE from further publishing of rating outcome by CARE. However, CARE continued publishing the rating outcome which constitutes contempt of court.   Currently, the Company is working towards exiting from rating agreement with CARE which requires approval from lenders group. NOC in this regard has already been obtained from 3 out of 6 lenders. Balance approvals are under process.   In view of the above, ratings from CARE should not be relied upon or given due consideration as they do not reflect the correct and present picture of the Company’s financial strength.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.039835164835164
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#18",
                    "likes": "0",
                    "time": "29/04/2022-16:30:46",
                    "content": "    OasisProTeam:  While their process states that, publishing of rating outcome can be done only after providing the Borrower a reasonable opportunity to examine the draft of the same so that any factually incorrect information is not published, CARE went ahead with publishing of rating outcome despite the non-acceptance communicated to CARE which was in clear violation and breach of the terms of the rating agreements entered into with the Company.   This refers to the October 2020 ratings report? So in 2020, on the basis that CARE mischaracterized fundamentals of its business, IPCL sought to terminate its agreement with the credit agency? Or does IPCL regard the ratings agreement as having been breached earlier than October 2020?     OasisProTeam:  Currently, the Company is working towards exiting from rating agreement with CARE which requires approval from lenders group. NOC in this regard has already been obtained from 3 out of 6 lenders. Balance approvals are under process.   So half of the company’s creditors have not approved exit from an agreement that IPCL believes was violated 18 months ago? Any logic for why creditors would drag their feet if, in fact, the agency had unduly dinged IPCL’s fundamentals?     OasisProTeam:  Currently, the Company is working towards exiting from rating agreement with CARE which requires approval from lenders group. NOC in this regard has already been obtained from 3 out of 6 lenders. Balance approvals are under process.       OasisProTeam:  In view of the above, ratings from CARE should not be relied upon or given due consideration as they do not reflect the correct and present picture of the Company’s financial strength.   Which specific aspects of the report are incorrect? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.967261904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#19",
                    "likes": "5",
                    "time": "30/04/2022-13:11:07",
                    "content": "Thank you for the presentation and conversation this week. My high level take away is that your team is looking to MakerDAO for education and to determine for you key commercial terms of both deals. This is not our role. I am not enthusiastic about diverting the precious time and resources of our CUs to comb through all of this information without there being a pre-diligenced and comprehensive term sheet, structure, etc. etc. proposed for us to react to. I am not in favor of either MIP6s progressing. Given the jurisdictions, legal, political and sanctions risk involved, I cannot see a scenario where the collateral and credit support proposed provide any security whatsoever for MakerDAO in the event of a default. Further, the significant use of proceeds to refinance exciting debt is not attractive. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-application-emerging-markets-green-opportunity-financing-for-atd-combustors-egyptian-power-plant-efficiency-projects/14489/26"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.379545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#20",
                    "likes": "0",
                    "time": "03/05/2022-14:38:41",
                    "content": "This proposed collateral has now entered the greenlight poll. Over the next several days, you can expect a recommendation of a form similar to the one we issued for Huntingdon Valley Bank. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#21",
                    "likes": "0",
                    "time": "03/05/2022-22:02:37",
                    "content": "this is a excellent summary. Can OPM also share its investor list with the Community?  Given that some Community members are investors in OPM, including Maker workers, the Community should know of such potential conflicts of interest when voting. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#22",
                    "likes": "0",
                    "time": "04/05/2022-12:52:59",
                    "content": "@OasisProTeam I intend to issue a greenlight recommendation for the benefit of token holders but would like to give you the opportunity to respond to my above questions regarding the CARE ratings report prior to publishing. Given that the greenlight poll is live, I’d ask that you do so in a timely manner. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.227272727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#23",
                    "likes": "4",
                    "time": "04/05/2022-15:13:07",
                    "content": "I have multiple issues with this one. Not pointed out is the negative stance India generally has taken on cryptocurrencies.  I believe a critical consideration of whether to even spend time on a proposal in a jurisdiction is whether such jurisdiction is pro or con crypto by legislation/regulation.    the Guardian – 24 Nov 21    India to ban private cryptocurrencies and launch official digital currency Proposed legislation follows warning from Narendra Modi and crackdown in China      For this reason as well as the sheer amount of RWF bandwidth required to even process this is the reason I am turning this down.   I don’t even want to get into debates on credit spreads etc.  I am not even convinced we could get close to a market deal here and the structure of this deal look problematic. ",
                    "links": [
                        "https://www.theguardian.com/world/2021/nov/24/india-to-ban-private-cryptocurrencies-and-launch-official-digital-currency"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.7746913580246915
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#24",
                    "likes": "1",
                    "time": "04/05/2022-23:14:31",
                    "content": "    MakerMan:  I believe a critical consideration of whether to even spend time on a proposal in a jurisdiction is whether such jurisdiction is pro or con crypto by legislation/regulation.   This is a great point, yes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#25",
                    "likes": "1",
                    "time": "05/05/2022-09:04:08",
                    "content": "    MakerMan:  I believe a critical consideration of whether to even spend time on a proposal in a jurisdiction is whether such jurisdiction is pro or con crypto by legislation/regulation.   Thank you for pointing this out. Regulatory risk + significantly below market rates, seem like a bad combination. What am I missing here? I love the project in general and green energy in emerging markets is surely a great spot for MakerDAO to be in. But beyond ticking some boxes, projects have to have a strong economic rationale. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.571969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#26",
                    "likes": "4",
                    "time": "05/05/2022-12:34:51",
                    "content": "Because voting activity on the greenlight poll has already been significant, I’ll go ahead and issue a recommendation. I would’ve preferred to give @OasisProTeam the opportunity to respond to my ratings-related question but token holders deserve a timely and (hopefully) qualified opinion. Recommendation: No greenlight As structured, this opportunity appears to provide poor risk-adjusted return to the protocol. The proposed interest rate is below the risk-free rate (US treasuries) of similar duration. An on-market rate might be in the ballpark of 6.5-9%, but we’d need more time to comp it out precisely . Because OPM has made it clear that the proposed terms were not indicative, but rather a “jumping off point” for discussions between MakerDAO and IPCL, I encourage readers to consider the remainder of this recommendation with more weight. Given that the debtor is a large Indian utility and the creditors with which MakerDAO will have pari passu interests in collateral are presumably Indian, the likelihood of recovery upon credit erosion is low. Any recoveries will likely require recourse to the Indian courts. This will be time consuming and there is not any assuredness of recovery. Further, while OPM is aware of the issue, a potential execution risk for IPCL may be the Reserve Bank of India’s material requirements for “External Commercial Borrowings”. This will be an issue that OPM and IPCL will have to work through and may delay timely implementation. Finally and in my opinion, most critically, deals of this nature, whether green or EM or strategic or anything else, will require a large up-front cost from MakerDAO core units with limited opportunity to scale. Rather than a wholesale lending relationship where we underwrite the underwriter and deploy more liquidity as he/she performs, this opportunity is more of a one-off. Even if this is the first in a deep bench of opportunities to finance greening with IPCL or even to kick-start the renewables revolution in India, we are not financing an underwriter, but rather forced to underwrite each asset ourselves. To me, such an arrangement is antithetical to success for MakerDAO as a lean protocol that builds financial primitives with infrastructural leverage. Again, I’d like to repeat: it seems to me the mismatch between the subject transaction and MakerDAO is more a testament to MakerDAO’s peculiarities than it is any intrinsic weaknesses of the deal. OPM has been sensitive to the zeitgeist in the forums and proposed an interesting green-related deal with a fairly strong counter-party in a critical and appealing emerging market. I commend their efforts.   Opportunities:     India: Opportunity to create a financing bridge with India, a key demographic, entrepreneurial, and economic engine of the world.      Greening: Focus on smart-metering and renewables offtake.      Infrastructure: Establish a lending practice in Asia.      Platform: Opportunity to partner with a new arranger, Oasis Pro Markets. OPM may offer an appealing tokenization solution for real world assets and is one of a few entities to obtain an Alternative Trading System (ATS) license. This allows its subscribers to trade blockchain securities.      Threats:     Sharpe Ratio: The return on the proposed five-year note is below that of a two-year US treasury.      Recovery Difficulty: Likelihood of recovery upon non-performance is uniquely low.      Credit Hairiness: Recent credit reports have indicated an erosion of IPCL creditworthiness as of 2020. IPCL holds that the rating agency, CARE, violated its credit ratings agreement and mischaracterized key facts. I note this not because I know exactly what has or hasn’t transpired but rather as muck that exists and should be illuminated.      Limited Scaleability: This is a one-off opportunity rather than a programmatic one with an underwriter.      I believe OPM could turn out to be a great partner for MakerDAO, but I don’t believe this formulation is the most productive version of that partnership. ",
                    "links": [
                        "https://m.rbi.org.in/Scripts/BS_ViewMasDirections.aspx?id=11510",
                        "https://forum.makerdao.com/t/rwf-001-monthly-update-april-2022/15024"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.821374458874459
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#28",
                    "likes": "0",
                    "time": "14/08/2022-15:23:28",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "923"
}