{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/central-banks-will-not-be-able-to-stop-inflation/17249",
            "title": "Central banks will not be able to stop inflation ",
            "index": 17249,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "dai",
                "defi",
                "inflation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#1",
                    "likes": "5",
                    "time": "15/08/2022-01:58:17",
                    "content": "Central banks won’t be able to preserve the value of fiat money for three reasons: The high level of private debt, the high level of public debt and the precariousness of central bank’s balance sheet. The last time there was an inflationary cycle in the United States was after Nixon closed the gold window in 1971. After 10 years of rampant inflation, Fed Chairman Paul Volcker was forced to raise the interest rate to 20% in order to stabilize the dollar’s purchasing power.  1024×395 44.9 KB  The belief that the Fed can preserve the value of the dollar in the event of rising inflation is unwarranted for three reasons: Firstly, the high debt and leverage in the private sector would make it impossible to raise interest rates without unleashing a depression and a financial crisis. Secondly, balancing the budget in light of the high deficits and public sector debt would require austerity which would lead to social and inter-generational conflicts. Thirdly, the act of raising rates would render the Fed insolvent due to its high leverage and iliquidity.  724×482 95.5 KB  Before the Great Recession, governments around the world had relatively low debt/GDP ratios which enabled them to recapitalize the banking sector by issuing new debt. Today public debt is at its highest point in history, thus, the government’s ability to bail-out private banks is limited. This would be specially the case in an environment of higher interest rates; since the Fed wouldn’t be buying bonds in the open market, the treasury would have to pay higher interest rates in order to attract bond buyers, making it difficult to issue additional debt to bail-out private corporations. In conclusion, higher interest rates are unlikely to be pursued by the Central Bank since they would lead to mass insolvencies, a deep depression and a financial crisis.  776×434 114 KB  During the 1980’s, government debt only amounted to 35% of GDP compared with an expected all-time high of 140% of GDP post covid-19 crisis. An alternative strategy could be allowing inflation to run high for a prolonged period of time in an effort to reduce the real value of the debt as prices go up in nominal terms the real value of the debt falls , and raise interest rates once debt levels as a percentage of GDP have fallen. This would lead to a total loss of faith and repudiation of fiat money. There is a third reason why I believe the central bank would be unwilling to control inflation; doing so would make the central bank insolvent. Looking at the Fed’s balance sheet, two things stand out: Maturity mismatching and extreme leverage.  1091×400 106 KB  The long duration of the bonds in its portfolio make it impossible for the Fed to raise interest rates by allowing its assets to matures. Hence, if the central bank wanted to raise interest rates, it would need to either sell some of its holdings or increase the interest it pays on excess reserves (IOER). The low yield on its assets and its over-leverage makes it very difficult for the Fed to implement either of these measures effectively. The Fed is extremely leveraged with assets just under 151 times capital, ironically, it fails spectacularly to meet the capital requirements it imposes on commercial banks. Furthermore, the average return on its assets has continuously diminished as each round of quantitative easing has pushed bond yields lower: The interest payments it receives on its holdings has dropped from 3% in 2010 to roughly 1,4% in 2019.    If it raised rates by selling some of its treasuries, the market would front run its selling resulting in loses which — due to its high leverage — would rapidly lead to negative equity. This already happened during the last unwinding of quantitative easing, when the FED piled billions in paper losses.   If it chose to raise rates by increasing the interest paid on excess reserves (IOER), it would quickly find itself paying more for its liabilities than the interest payments it earns on its portfolio. Not all of the Fed’s liabilities generate expenses, for example currency in circulation doesn’t pay any interest. Of the total 6 Trillion $ liabilities, 3.9 Trillion (63.4%) are in the form of reserves that the FED would have to pay interest on. The average return on the FED’s assets is circa 1,4%, which leaves them enough room to raise IOER to roughly 2,2 % before their expenditures are higher than their revenues. In today’s ultra low rates environment, 2,2 % interest rates might seem quite high but in a potential scenario of 5 or 7 % inflation — which in light of the financial history of the U.S. doesn’t appear at all outlandish — would lead to massive losses on its holdings.   Of course, the Fed already realizes that any “exit strategy” leads them down the road to insolvency, but what exactly does this mean for this unusual institution? At the end of the day, the Fed’s liabilities (fiat currency) are non-interesting-bearing and irredeemable — having a $10 Federal Reserve note provides a claim on the Fed for $10 worth of Federal Reserve notes, possibly in different denominations, but nothing else. Thus, balance sheet insolvency (assets<liabilities) is a sign of incompetence and mismanagement but the central bank need not worry about a bank run. Equitable insolvency (failure to pay obligations as they fall due) is more worrisome since the central bank would fail to pay its expenses such as rents, salaries, entertainment services etc. The Fed must rely on the interest it receives on its holdings to fund its operations, but in an environment of higher rates, it would have negative equity. Since the Fed cannot create reserves that are unbaked by assets, it would need to be recapitalized by the Treasury with real tax dollars or new debt issuance in order to pay for its expenses. This would be extremely ironic given that the Fed is currently engaged in Quantitative Easing in order to finance the government’s deficit. It would also be politically unpalatable since the taxpayer would suffer additional austerity in order to recapitalize a central bank that has been used to bail out private corporations.  Centrals banks were created for the benefit of the financial services industry and the State, hence, it is unlikely that they will chose a policy path that is directly opposed to the interests of their main constituents. Instead, they will likely allow inflation to run rampant, hoping to reduce the real value of public and private debt before they can safely raise rates again  since most debts are fixed nominally, when the currency devalues significantly and prices/assets/wages go up in nominal terms, debts vs GDP goes down. This strategy is nothing new, the Fed already inflated away the debt after World War II and is openly proposing the same approach today  NBER working paper and Cleveland Fed.  800×398 31.4 KB  We can think of fiat money today as somewhat of a Ponzi scheme, it only holds value for two reasons: Firstly, there is an expectation that in the event of inflation central banks will preserve its purchasing power via contractionary monetary policy and secondly, new buyers will demand it in the future. As the market realizes these two conditions won’t be met, one should expect a repudiation of State liabilities  government bonds and fiat currency. This outcome should come as no surprise as Austrian Economists have been warning about it for decades. This is not an argument against the U.S. dollar per se but against the sustainability of the fiat system as a whole. Major central banks around the world are going down the same road as the Fed and the analysis is aplicable to most jurisdictions . Moreover, given that the Dollar is the reserve currency, its demise would most likely breach the trust in the fiat system worldwide.  907×1132 151 KB   What does this mean for Defi ? The total marketcap of all crypto categories in general is $1.161.264.814.095, the marketcap of the stables in general is $153.430.855.495 including those anchored to the Euro, the Pound, Gold, and others, to be more precise the 10 stables with the highest marketcap anchored to the USD make 98% (or $150. 237,444,755) of the marketcap of all types of stables, i.e. the dominance or influence of the stables on all crypto is 13%, if we talk only about Defi is 50% (Defi marketcap $300,790,057,419), the value of the stables anchored to the USD is reduced by 8.5% currently -$12,770,182. 804 annually, assuming inflation reaches Volcker-era levels, i.e., a 15% annual reduction would be -$22,535,616,713, which represents -7. 4% for Defi, but taking into consideration that the expansion of the monetary base has been much greater than the 1940s, adding the US sanction to much of the East, removing them from the system of payments with USD to transact imports and exports, will cause that many USD will stay in circulation with many fewer people using it, so the inflation of the USD has high probabilities of going much further than we think.  So what will happen to Dai’s precious ?   Answer 1, when hyperinflation starts users will be highly incentivized to short Dai using WBTC, ETH, etc, and even more so if Maker’s interest rates are still at the same percentage level as now, so Maker will probably raise interest rates for Dai to keep its peg.   Answer 2, many people will stop using Dai because if inflation is 50% and returns with Dai in protocols are no more than 20%, then users will have no incentive to keep it other than for short-term transactions.   My question is this, will Maker be able to maintain the same growth rate of its 5 years of life in an extremely inflationary decade?.. I hope that Maker will be able to keep it up and that all your work will go far.  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.282463835336506
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#2",
                    "likes": "2",
                    "time": "15/08/2022-12:33:04",
                    "content": "It has a lot, but if this happens, it is likely that it will detract from the conventional or traditional form of money and the economy, before the powerful let this happen, it is most likely that they will create more money without support and inflation will not skyrocket and endure another 5 years in a fictitious economy, in which case it happens, it is necessary to increase the costs of the necessary loans, I have always believed that the strong point of maker is to encourage medium and small investors to request loans and eventually indicate a high rate for minimize the low opening of Vaults, and in short accounts without vaults there are no incentives, in Latin America the opening of loans by banks at the moment is much more difficult, lack of funds, poorly used structures, corruption, there are many reasons. Going only by recent history and geopolitics, the dollar has never wanted to lose against inflation and only expands its lifespan, so it will continue for the rest of our lives (or probably until China gets ahead but there is still a long way to go). that), and with the arrival of CBDC, manipulation is much easier, so before there is 50% inflation, I see more likely an impression of unsupported “incentives”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.450095238095239
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#3",
                    "likes": "1",
                    "time": "16/08/2022-18:07:38",
                    "content": "If, again, the U.S. has no other option to save its economy by paying its public debt than at the expense of its middle and lower class with long term debt, fiat in the bank, and every person, institution, economic system that has dollars involved in its economy in the form of store of value, it will be a robbery on an intercontinental scale, adding the increase in the U.S. war budget which further shortens the budget allocated to the payment of the debt ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.177083333333333
                }
            ]
        }
    ]
}