{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/thoughts-on-compensation/293",
            "title": "Thoughts on Compensation ",
            "index": 293,
            "category": [
                "Governance"
            ],
            "tags": [
                "payroll",
                "idea"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#1",
                    "likes": "7",
                    "time": "22/08/2019-17:23:08",
                    "content": "I wrote about this topic in the past when things were less fleshed out. Here I’m putting some thoughts down on how to consider compensation from MakerDAO. By NO means is this a proposal or even a robust encapsulating of the problem, just my thoughts which usually take form as questions. Sorry for poorly organized post. Quickly some variables for guiding proposals for compensation:  Amount of data used Quality, reputability of data Openness of data/method/regular engagement Reported hours per task Credentials Depth of talent pool for the different skills we need  Personally I would want to see statements from prospective risk teams around their understandings and visions for MakerDAO? Helpful to see how they qualitatively view their role/work. Possible merits for prospective teams with a strong historical commitment to the cohesion of the community? Could risk teams themselves propose compensation as part of the application process? Not every team will do the same “amount” of work, how do we value some work over others? Actual transparency around the foundations risk team may set an example for rate/fair compensation standard. This wont help the technical aspect of compensation from a DAO, but at least a start for numbers. Some might want to weigh the value added by risk teams to determine compensation. The issue here is that different teams focus on different parts of the risk process. Weighing compensation based on perceived value to the network could bring us to some murky waters. As for timing of payments I see monthly/quarterly pay period with various medium-longer term stipulations. Others have suggested some pay in mkr to promote commitment. There could be contractual punishments for contributing for a shorter than expected time period. I think we need some developer input on the best way to form smart contracts promoting time commitment as well as fair compensation. Maybe we need to fund a whole interface for risk/facilitator functions to be compensated. Sometimes exogenous forces don’t allow a team to carry our their end of the contract. How do we reconcile this. Can teams “quit” at any point? What about geo-political instability reducing the ability of individuals to continue their work? On a side note dispute resolution mechanism seem important, I’m having a harder time conceptualizing how disputes play out through a DAO construct. However I’m sure conflicts will arise. It’s easy to say MKR holders can fork out malicious actors or employ other “hard” solutions to problems of disharmony, yet to strive for long term growth I see “soft” conflict resolution mechanism as essential. Examples: https://journals.sagepub.com/doi/abs/10.1177/0002764298041006003 https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.926.6633&rep=rep1&type=pdf <3 <3 <3 ",
                    "links": [
                        "https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.926.6633&rep=rep1&type=pdf",
                        "https://forum.makerdao.com/t/mandate-interim-governance-facilitators/264/33"
                    ],
                    "GPT-summary": "The author of the post is sharing their thoughts on how to consider compensation from MakerDAO. They provide variables for guiding proposals for compensation and suggest possible merits for prospective teams. The author also raises questions about how to value different types of work and how to promote time commitment as well as fair compensation. They also mention the importance of dispute resolution mechanisms.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.625053625053625
                }
            ]
        }
    ]
}