{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/real-world-assets-ctl-document-roadmap-getting-started-v1/3716",
            "title": "Real World Assets - CTL Document Roadmap - Getting started v1 ",
            "index": 3716,
            "category": [
                "Governance"
            ],
            "tags": [
                "alignment",
                "collateral",
                "collateral-onboard",
                "real-world-finance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "12",
                    "time": "18/08/2020-13:57:35",
                    "content": "Getting Real World Assets on Maker is an essential path to stabilize the DAI peg. Doing so is not trivial, not for the faint of heart, but completely achievable. After some of my recent posts related to my initiative and contemplated structure and objectives, I have had several chat sessions and several calls with folks that want to understand the structure and have me address their “gaps”. Timing: We could implement the below ** next week ** subject to MKR approval less the Trustee (a regulated Trust company) which is a critical component. Further, the legal enforceability opinion of the Trust Agreement to which the Trustee will rely upon takes time and money. Knowing that this structure will be duplicated by those that come after me, I want to do this right. Bulletproof. Skipping the Trust company is the shortcut and is 100% NOT recommended. After-all, they are guarding the rights of all MKR holders if LendCo (mine or any other participant that uses the same structure after me) goes into liquidation. They hold those rights literally “in trust”. It needs to be bulletproof. We should ALL demand an exceptional HIGH standard for any participant that wants to deploy DAI off-chain. While throttled with a debt ceiling, that participant becomes a trusted conduit to the real world. How does LendCo earn and maintain that trust? Reoccurring compliance reporting to start. Reporting Requirements AKA, the analog oracle. Fundamentally a reoccurring compliance check to ensure no nefarious activities and doing what you said you would. So, quarterly reporting to a MKR approved arresting party to confirm compliance of the Revolving Credit Facility Agreement in a translucent way. Most notably is the requirement to get LendCo an annual audit. NOTE: This audit has / will have the same scrutiny as every publicly traded company. If you have never done one, they want to know EVERYthing. They are attesting to the quality of the books and being in accordance with GAAP. It is a complete “red-flag” if a LendCo cannot get a clean annual audit or worse, just doesn’t volunteer even doing one at the beginning. As an MKR holder (personally), ** we MUST set the bar for all Real World Asset LendCos very high to start **. If we are going to do it, we must get it right to start with. For me, this is just how I operate and “do” business. I want to grow LendCo into a capital sink with credit backed principal preservation thesis with significant assets. An annual audit is just simply mandatory. Below is the practical guide for all of the documents needed for off chain commercial real-estate.   722×402 41.5 KB   Intention: To replicate a bankrupt-remote legal structure similar to those used in asset-backed financing, but with the Maker Protocol instead of a bank or private debt capital. Setup (entities):  Borrow Co.  Delaware LLC, desires to borrow money from Lend Co. for specifically approved uses as outlined in Loan Agreement   Lend Co.  Delaware Series LLC, raises its equity capital from Private Investors and its debt capital from Credit Facility Participants [Maker Vault] There will be an acceptable ratio of debt to equity.   Trust  Delaware Statutory Trust, a trust formed for the benefit of the Credit Facility Participants [Maker Vault] to hold assets to be loaned to Lend Co. which are secured by real estate collateral pledged by Lend Co. All of the rights of the Maker Protocol against Lend Co. and to the collateral are held in the Trust for the benefit of the Credit Facility Participants [Maker Vault].   Trustee  The trustee acts for the Trust. It will be a regulated Trust Company (likely under Delaware law), acts as a reputable independent party who will execute its duties as set forth in the Trust Agreement between the Trustee and the Maker Representative.   Maker Representative Entity (elected and authorized by governance to carry out specific duties)  This entity (or individuals) is the contact person between the Credit Facility Participants [Maker Vault] and the Trustee and signs paperwork    Setup (agreements): Borrow Co. <> Lend Co.  Loan Agreement  The agreement between the Borrow Co. and Lend Co. in which Lend Co. agees to loan money to Borrow Co, under specific conditions payment terms, limitations, use of proceeds, and other general covenants   Promissory Note  This is the document that evidences a loan was made. It outlines the explicit payment terms, amount to be repaid, and the interest rate   Deed of Trust (or) Mortgage (or) Security Agreement  First position lien against Borrow Co.’s specific assets being pledged as collateral in compliance with Uniform Commercial Code-1 [UCC-1]   Assignment of Rent and Profits  Allows Lend Co. to directly capture the income coming from the tenant that has signed the lease with Borrow Co. and represents the income stream being relied on for the loan   Equity Pledge  Pledges the equity of Borrow Co. to Lend Co. in addition to the specific assets being pledged and allows Lend Co. to take control of Borrow Co. in an event of default   Environmental Indemnity  Borrow Co. agrees to indemnify Lend Co. against any environmental contamination of the property if need be   Engineering Consent  Allows for Lend Co. to step into Borrow Co.’s position in directing engineering work on the project if need be   Architecture Consent  Allows for Lend Co. to step into Borrow Co.’s position in directing architectural work on the project if need be   General Contractor Consent  Allows for Lend Co. to step into Borrow Co.’s position in directing general contracting work on the project if need be   Subordination Nondisturbance Attornment Agreement [SNDA]  Agreement between tenant, Lend Co., and Borrow Co. that allows the tenant to continue to operate in the event of a foreclosure   Completion Guarantees  Assurances provided by Borrow Co. and Borrow Co.’s Principals in favor of Lend Co. (there is personal recourse against the Principals should the project go unfinished)   Bank Account Control Agreement  Allows Lend Co. to confiscate any capital in Borrow Co.’s bank account in the event of foreclosure   Misc. Closing Documents  Closing legal opinions Closing certificates Title policy    Lend Co. <> Trust   Revolving Credit Facility Agreement between the Trust as lender and the Lend Co. as borrower  Similar to a Master loan agreement in that its details terms and conditions loans, such as representations, covenants, borrowing limits, types of collateral, payment terms, documentation and reporting requirements in exchange for the capital provided by the Credit Facility Participants (in this case the Maker Vault) The full loan amount could be drawn at one time or in separate draws.    Loan Supplement between the Trust as lender and the Lend Co. as borrower  Used for multiple loan draws Supplements the Revolving Credit Facility Agreement for a specific loan advances and contains specific loan details    Promissory Note  This is the document that evidences a loan was made.    Security Agreement  Unconditional and irrevocable assignment of all assets of Lend Co. in favor of the Trust as collateral for the loan according to the Trust Agreement    Misc. Closing Documents  Closing legal opinions Closing certificates    Post-closing covenants of Lend Co., as borrower  Reporting Ratios    Trust <> Maker Representative Entity (elected and authorized by governance)  Trust formed by filing in Delaware Trust Agreement  Governs the operations of the Trust Holds the rights of the MKR holders in the event of a Vault liquidation Exercises such rights as directed by the Maker Representative Entity in accordance with the Trust Agreement    Trustee <> Maker Representative Entity (elected by governance)  Appoints Trustee as trustee of the Trust in the Trust Agreement  The Trustee acts for the benefit of the Trust beneficiaries    Process (for Ground Lease / Build-to-Suit): Lend Co. pursues Maker Governance to have an executive vote which approves the collateral type and designates the Maker Representative Entity  All documents are shown and approved substantially in the form submitted Reporting requirements are agreed to (this is a term included in the credit facility agreement) Tentative Debt Ceiling set (temporarily 0) Initial Risk Premium set Portfolio of Approved Tenants Equity requirement of Borrow Co. The term of the credit facility (3 years)  Set up structure and execute documents, and create an arbitrary ERC20 token [RWA1] for Lend Co.  RWA1 has a whitelist with one address (the Trust) or there are no liquidations and Dai is sent to the buffer in the event of a “triggering event” Assumes that agreed equity has been raised in Lend Co. and there is a Letter of Intent with Borrow Co. Lend Co. will use equity capital to fund the project initially and intends to source the remainder from the Maker Vault  Lend Co. requests that its Debt Ceiling is raised to the agreed upon amount and once it is, the Dai is minted and withdrawn to Lend Co.  Dai is converted to fiat currency  Borrow Co. executes its operations  Lend Co. funds these operations as needed with the fiat currency (approx. 6-12 months passes…)  Borrow Co. decides to sell the asset and requests a payoff letter  Interest is calculated between Borrow Co. and Lend Co. Lend Co. releases the lien once the money is delivered to the Title company  Lend Co. acquires Dai with the capital paid by Borrow Co. and repays its Vault balance or revolves the loan to a new borrower Then Repeat (and do with multiple BorrowCos in parallel) ! Quality Report for revolving new assets into Lend Co.:   Tenant selection must be pre-approved   New Tenants must be approved by Maker Governance (likely a domain team) for any increase beyond 15% of the asset portfolio. LendCo has discretion over tenant selection for no more than 15% of the portfolio (on a capital basis).    As LendCo plans to expand into different sectors over time, an updated practical guide per sector will be provided. In addition to the bi-weekly collateral call and governance call, I am planning to set up a zoom Ask-Me-Anything to go over any aspect of this structure and its implications. We can do them at whatever frequency and length deeded appropriate.  MKR Community… This will require significant capital outlay (on my end) to get this started and maintained. I would like to gauge if this is something the Community wants. Real-World Assets (general) first; then the above structure second. Signal request coming! Stay tuned. Until then, ask questions. (Ping me privately if you want.) Making things public helps everyone !! ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp4-declaration-of-intent-commercial-points-off-chain-asset-backed-lender-to-onboard-real-world-assets-as-collateral-for-a-dai-loan/3914",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-106-thursday-august-20-4-00-pm-utc/3657/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-09/3793"
                    ],
                    "GPT-summary": "The author of the post explains a proposal to bring real-world assets onto the Maker platform to stabilize the DAI peg. The proposal involves a legal structure similar to asset-backed financing, with a Trust holding assets to be loaned to Lend Co. which are secured by real estate collateral pledged by Lend Co. The post includes a practical guide for all the documents needed for off-chain commercial real estate and outlines the reporting requirements for Lend Co. to maintain trust. The author also seeks feedback and collaboration from the community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.398169737239504
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "3",
                    "time": "19/08/2020-07:07:28",
                    "content": "Hello @mrabino1, I am most impressed by your proposal. A big job indeed and with great potential for both Maker and Lend Co. In addition to the quarterly audits I assume it is possible to use software for a near continuous visibility into Trust and Lend Co key accounts? What are the limits of the proposed setup? I assume the setup is limited to certain types of real estate in a limited number of US states? Is this correct? Is there an upper limit to how much a Lend Co of this type can lend out? Can Lend Co lend to companies that in turn will lend to Borrow Co? Or does it have to go directly to Borrow Co? I am thinking how this can scale. Can the setup handle investment in infrastructure? Let’s say buy bonds for the construction of a new subway station? The job of setting up this legal construct looks substantial but I assume most of it is fairly standard for a corporate legal firm. As I see it it is the legal framework of the Trust, Trustee as well as Maker’s Representative Entity that will require Maker attention. Correct? As for your capital outlay I suggest you research how much you need and we could try to have that financed by Maker through a MIP12 in exchange for being able to use the setup as a copy-paste for other Lend Cos in the future. May I ask just why the Delaware jurisdiction? Over here in Europe Luxembourg seems to be the go-to place for setting up real estate funds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8540700371057515
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#3",
                    "likes": "2",
                    "time": "19/08/2020-13:38:01",
                    "content": "Thank you for the questions / comments!  In addition to the quarterly audits I assume it is possible to use software for a near continuous visibility into Trust and Lend Co key accounts?  There is a healthy balance between oversight (which is needed) and strategy / privacy. Clearly there is confidential information that LendCo will hold that must remain confidential. Also, while not today, there may be strategic avenues that LendCo may not want to disclose how it sources deals… etc… However, in general, technology is the key to that oversight role, and we look forward to implementing that in 2021.  What are the limits of the proposed setup? I assume the setup is limited to certain types of real estate in a limited number of US states? Is this correct? Is there an upper limit to how much a Lend Co of this type can lend out? Can Lend Co lend to companies that in turn will lend to Borrow Co? Or does it have to go directly to Borrow Co? I am thinking how this can scale.  Presently, there is no planned restriction on which States, rather the credit quality behind the tenant justifies the deployment of the capital. If they want a location in Alaska, as long as the senior lien is secured, it is the same credit quality as Virginia. What is essential is that LendCo (which will have already given an irrevocable unconditional assignment in favor of the Trust), must without exception get as a function of any capital deployed a senior lien in the underlying real-estate and the assignment of rents and profits (along with the others). Without that lien or the assignment (and others), LendCo is speculating (which would be a breach). LendCo could technically lend to a borrower than turned around and deployed the capital; however, there is plenty of scale just going LendCo to BorrowCo. When in doubt, we can just do larger deals! The only limit on how much we can lend out is constrained by being a good fiduciary (clearly) to have it make sense, the equity requirements the community approves in place, and then the debt ceiling.  Can the setup handle investment in infrastructure? Let’s say buy bonds for the construction of a new subway station?  Nuanced… (and I will skip of the technicalities for moment), but in general, LendCo is an Operating company… not an investment company. As an Operating company in the business of lending money, it deploys capital looking for its money back (w/ a return). If LendCo were to start buying securities, it would be deemed an investment company be subject to further scrutiny by the SEC and almost certainly need to file as an RIA (or be under one). We might consider this in the future, but for today, there is plenty of deals to be done without that.  The job of setting up this legal construct looks substantial but I assume most of it is fairly standard for a corporate legal firm. As I see it it is the legal framework of the Trust, Trustee as well as Maker’s Representative Entity that will require Maker attention. Correct?  The two fundamental documents that truly govern “everything” will be the revolving credit facility agreement (basically the loan agreement between LendCo and the Trust) … and the Trust agreement. (which holds the rights of the MKR holders and when the Trust can liquidate LendCo). The Maker Rep. basically is a personal / entity that causes the Trust Company to execute the above.  May I ask just why the Delaware jurisdiction? Over here in Europe Luxembourg seems to be the go-to place for setting up real estate funds.  Delaware as it is the most advanced legal structuring law, and a bankruptcy remote statutory trust structure (virtually all ABS / CMBS / MBS use some combination of Delaware Trusts).  As for Luxembourg, I will have to deep dive when we expand to Europe.  Important, LendCo is not a fund; it is an operating company. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.459735842388904
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#4",
                    "likes": "0",
                    "time": "19/08/2020-14:09:49",
                    "content": "I did not really read your post carefully and I won’t pretend i understand much, still: what are the typical time delays in case of defaults/foreclosures or any other legal “stuff”. I assume legal system should be quite predictable for majority of the potential issues (hence all the agreements), but still, are there any scenarios where you could imagine things could get “stopped/paused” for many months/years? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.204166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#5",
                    "likes": "1",
                    "time": "19/08/2020-14:59:12",
                    "content": "Wouldn’t this mean that in the case of emergency shutdown, Dai holders would have to wait many months to claim their share of assets due to this being illiquid? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.104166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#6",
                    "likes": "0",
                    "time": "19/08/2020-15:09:01",
                    "content": "Thank you for the question.  are there any scenarios where you could imagine things could get “stopped/paused” for many months/years?  If the question is related to a liquidation, no. I dont see that. The Trust company is obligated to perform pursuant to the Trust agreement. They would have legal exposure if they don’t follow it. LendCo cannot stop the Trust as it will have already given an irrevocable unconditional assignment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#7",
                    "likes": "0",
                    "time": "19/08/2020-15:10:34",
                    "content": "The ES is an edge case. No doubt. There will be a customary wind-down window if LendCo is not in default under the agreement. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}