{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/aggressive-growth-strategy/13958",
            "title": "Aggressive Growth Strategy ",
            "index": 13958,
            "category": [
                "Governance"
            ],
            "tags": [
                "strategy",
                "growth",
                "business",
                "longform",
                "growth-strategy-series"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "64",
                    "time": "16/03/2022-13:38:48",
                    "content": "Authors: @hexonaut @Nadia @krzkaczor Contributors: @luca_pro @williamr Please note this is the views of each individual as community members and does not represent the views of their respective core units.  Background With the bull market cooling off we are facing the issue of decreased vault demand, and an ever-increasing demand for DAI. To keep the peg balanced we are needing to onboard more and more non-interest-bearing USDC. This has the double negative effect of reducing revenues for the protocol and increasing counter-party risk vs. Circle as a centralized counter-party. Additionally, this increases the regulatory risk for Maker as centralized stablecoins become a key focus for prudential authorities.  There are crypto levers we can lean on such as institutional vaults or borrowing incentives, but inevitably we will need to rely on Real World Assets (RWAs) or other complex and more innovative use cases to scale to the next order of magnitude and beyond.  sc2460×1046 116 KB  We believe the time is right to kick the RWA effort into overdrive. Along with our own efforts to improve and scale the pool of borrowers we already collaborate with, there are a number of off-chain counter-parties and on-chain protocols that have emerged over the last year spearheading the effort to connect RWAs into crypto. This is where we believe we should focus. We are proposing a 2-step plan:  Step 1: Capital Raise Following up from Kris Kaczor’s post we propose this first step to stop the burn and focus on building a massive system surplus. By refocusing all profits into the surplus buffer this will allow us to risk-on for the protocol without causing existential threats like flop auctions. The system surplus is currently at 65M which is peanuts compared to the total DAI supply of 9.7B (0.7%). To protect ourselves from flop auctions we have used this surplus buffer amount to give us padding against tail-risk losses. As a comparison, a traditional regulated financial institution would retain 15-20% of high-quality capital to back unknown risks. Additionally, these institutions have regulatory capital and liquidity requirements which would place Maker below the riskiest institutions at this point. We want to be better than traditional lending institutions, we know, but there is something we can learn from institutions that have been around for tens or sometimes hundreds of years. A larger buffer means we can take on larger debt ceilings for individual loans for which we consider losses more likely, and test other avenues that might be critically risky without such a safety cushion. We propose turning off the burner indefinitely and raising the system surplus by about a half-order of magnitude (~5x) at current DAI supply levels to facilitate new opportunities. We have multiple mechanisms to achieve this, but can focus on two specifically:  Issue Debt Equity is the most expensive source of funding for any project, and also due to the relatively low price of MKR relative to revenues, it makes sense to have debt as the number one source of financing in our pecking order. A module can be built which will act as an insurance fund to protect us from large individual loss events.  debt-fund1709×1400 165 KB  The example above is a module which accepts DAI from anyone, inserts it into the Surplus Buffer and allows them to withdraw at any time with a time-lock of maybe a few months. What users get for inserting their DAI is a preferential payout from revenues. IE we can direct 20m / year into the fund to give 10% APY for a 200m loan. If there is some large loss event it will eat into the insurance buffer and users will no longer be able to withdraw their full amount. They can always wait for the buffer to refill. They get the senior-most position. This revenue sink can be offset by new revenues from the riskier loans. Using a market-driven interest rate curve we can tune this module to provide us with most of the loan we need for the best price. Interestingly enough this can also be used as an indicator for how the market views the protocol risk overall. This could be used to either step on the gas or pull back in the future. The details of this module will need to be worked out, but this is the general idea. In addition, we believe that issuing a fixed-rate financial instrument from the protocol could act, especially during those uncertain times, as a great marketing tool to expand and improve Maker’s perception throughout DeFi.  Sell / Issue Equity We have about 84k MKR sitting in the treasury. We could sell a portion of this under a multi-year vest. @Nadia is confident they will be able to find buyers. Despite uncertainty in the markets there are still VCs interested in making large investments, especially in a protocol as central as Maker to the ecosystem. Terra for example has closed multiple deals in the past few months for 1B USD. Some combination of these two approaches is probably ideal, and if the market changes from here we will probably want to adjust between the two. Instead of committing up-front to a particular plan we can form a working group amongst relevant DAO members to negotiate the best deals possible.  Step 2: Risk-On (Although Conservatively) Maker so far has been fairly risk averse - perhaps scarred by the events of Black Thursday. Almost all of our exposure has effectively no risk of losses, but this is not how lending normally works. We should instead expect losses on individual loans and offset that with overall interest rates. We believe this conservative attitude needs to improve for us to thrive. As stated above there are a number of protocols which are focused entirely on bridging RWAs, and they need cheap credit. Something which we have in spades. One of the main issues we’ve run into is legal blockers and structuring frameworks that work cross jurisdictions. That is MKR holders are concerned about being “rugged” without a legal agreement in place. While we should strive for legal guarantees in the long-term, it should not be a blocker in the short term if we ensure the presence of the right on-chain guarantees and a conservative debt ceiling. Many protocols operate entirely by not wanting to damage their reputation in such a new market. It’s clear that the tail-risk of a rugging for many projects can be over-exaggerated. In any case this should not be something that blocks us entirely, but instead is just factored into the cost of doing business. This is not to say that we should just start extending credit lines to everyone. There are scams out there, as well as sub-par counter-parties we don’t want to engage with, but there are also a lot of projects wanting to push the boundaries. With a much larger system surplus we are free to experiment and assist these teams that are dedicated to solving the problem of on-chain sophisticated credit. The idea is that when one or two projects achieve scale, it will allow us to more than compensate those that lose money and break free of this crypto-only impasse. Beyond RWAs, having a larger system surplus will allow us to do other activities which were previously deemed too risky. These are things such as deploying MCD to Polygon PoS, loaning DAI to a centralized market maker or even just simply lowering the collateralization ratio requirements. The risk of losses in all these scenarios is definitely higher than our current state, but they are individually still relatively small. We just need to be okay with a few of these loss events occurring on occasion. To protect ourselves from draining the surplus buffer we need to expect one or two of these events to occur, possibly in rapid succession. With the current system surplus size we cannot exceed around ~30M per independent loss event (~half of system surplus). This is nowhere near enough to clear the 6B+ in stablecoin backing we have. By increasing the system surplus to the 250m range we can 5x this amount to something more like ~150M per independent loss event. If we can onboard 10+ of these then we are starting to see numbers approaching the 6B. This gives us protection in a worst-case scenario where all the DAI is stolen, but in reality this sort of complete loss event is unlikely to happen. We’ve even seen hacks in the past rescued by off-chain efforts in order to preserve the company’s reputation. Protocols that prove themselves reliable and build a reasonable track record can receive larger debt ceilings.  The General Direction of Maker As I outlined in a personal post, I believe to scale to the numbers we need we have to be more reliant on delegating to protocols that are focused on specific efforts. We should be going wider and giving the opportunity for success to a large number of protocols. In addition to individual deals we should be connecting to lenders that have existed in TradFi for hundreds of years. These people are experts in assessing risk and who to extend credit to. There is no need to reinvent the wheel here. They need cheap credit and we need expertise. Maker needs to focus on being a competitive and innovative credit wholesaler rather than assessing individual loans. We need to onboard protocols like Maple, TrueFi and others which are solely focused on connecting RWA borrowers to on-chain lenders. This is their whole business and by delegating minting rights (within reason) we can grow the workforce indirectly. Let’s use the DeFi legos to grow exponentially.  risk-on2113×2009 417 KB  As you can see in the image above, a larger system surplus is a multiplier on all the high risk pools. Individually they can all be pretty small compared to the total DAI supply, but if we go wide we can meet the 6B number we need. It is important to note that these risks need to be independent from each other in order to diversify enough to survive individual loss events. Due to the under-collateralized nature of these loans they are inherently riskier than what we’ve dealt with before, but that also means they sometimes carry higher interest rates, and that they expand the accessible use cases for the protocol. If we can go wide with these loans, and the average return is higher than the average losses, we can scale. We start small, build confidence, approach the system surplus size and eventually exceed it. Some of these pools are yielding around 10-20%. That’s 20-40m / year in additional revenue at 200m in loans. Granted we need to expect losses, but over time we can create a forward-looking model of how big we expect these losses to be. This will allow us to smooth over individual losses. Again, we want to stress the importance of maintaining a rigorous understanding of the losses potentially involved, and we are not advocating to become the last option for low quality borrowers. We need to balance both sides of the equation. We make it clear to any protocol that can execute this strategy at scale in a safe way will be getting several billion in DAI loans at a reasonable rate.  Beyond the Immediate Problem Once we have overcome the DAI supply problem we do not have to stop there. Currently the value proposition for DAI over USDC is not terribly strong. If we re-enter the excess DAI supply territory we will be able to drive DAI demand by doing things such as re-activating the Dai Savings Rate (DSR) or coming out with cashback programs. This will create a positive feedback cycle which will allow us to scale to the next order of magnitude and out-compete USDC as the DeFi currency of choice. Another opportunity on the horizon is rising interest rates. Central banks in most countries have indicated that they will be raising interest rates over the next few years to curb inflation. This will allow us to undercut the traditional banks and provide cheaper credit to those that need it. In summary, we have reached a critical point where we need to grow into new markets or risk losing out to a competitor. Crypto-native lending has more or less worked so far due to the bull market, but we need uncorrelated assets at scale and we need them now. We already have a massive advantage with DAI being one of the most trusted stablecoins available. Let’s not squander this first-mover advantage with decision paralysis. Instead let’s lean into the future and embrace crypto’s merge with the real world. We are sure to find partners in this journey, both as investors and as potential counter-parties.  Next Steps The aim of this post was to start the high level discussion on this pivot. @Growth-Core-Unit will be releasing a more detailed post soon with a concrete plan of action. Let’s make 2022 the year of Maker. ",
                    "links": [
                        "https://twitter.com/terra_money/status/1496162889085902856",
                        "https://www.bloomberg.com/news/articles/2022-02-02/blockchain-bridge-wormhole-hit-with-potential-315-million-hack",
                        "https://hexonaut.medium.com/maker-past-present-and-future-9fd67da4f229",
                        "https://forum.makerdao.com/t/a-rwa-defi-ecosystem-more-than-just-onboarding-collateral/14079",
                        "https://forum.makerdao.com/t/stkmkr-maker-staking-and-tokenomics-revision/13890/45",
                        "https://forum.makerdao.com/t/a16z-makerdao-tokenomics-proposal-one-adding-utility-functionality-to-the-mkr-token/14135/6",
                        "https://forum.makerdao.com/t/mip40c3-sp61-modify-core-unit-budget-real-world-finance-rwf-001/13152/45",
                        "https://forum.makerdao.com/t/a16z-makerdao-tokenomics-proposal-three-increasing-financial-resiliency-and-fostering-growth/14138",
                        "https://forum.makerdao.com/t/maker-growth-strategy-we-must-act-now-part-1/14501",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-truefi/14563",
                        "https://forum.makerdao.com/t/maker-growth-strategy-we-must-act-now/14501/2",
                        "https://forum.makerdao.com/t/ust-update-terra/14230/37",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-2/14201",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/29",
                        "https://forum.makerdao.com/t/governance-and-risk-182-thursday-march-17-17-00-utc/13965/2",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-10-16-2022/13977",
                        "https://forum.makerdao.com/t/against-the-burn/13412/37",
                        "https://forum.makerdao.com/t/weekly-relay-april-5-11-2022/14590",
                        "https://forum.makerdao.com/t/mip84c10-sp1-modify-emulated-surplus-buffer-upper-limit/18315",
                        "https://forum.makerdao.com/t/una-estrella-del-norte-dai-como-un-destino-traduccion/16326",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-16-22-de-junio-del-2022/16204",
                        "https://forum.makerdao.com/t/kickoff-governance-from-first-principles-building-a-resilient-decentralized-and-uncensorable-stablecoin/15978",
                        "https://forum.makerdao.com/t/embedding-legal-analysis-on-new-governance-proposals/15581",
                        "https://forum.makerdao.com/t/should-maker-manage-sustainability-what-topics-will-be-most-relevant-to-future-proof-the-dao/15504",
                        "https://forum.makerdao.com/t/makerdao-long-term-growth-strategy-for-the-future-of-defi/15457",
                        "https://forum.makerdao.com/t/discussion-capital-raise/15448/21",
                        "https://forum.makerdao.com/t/monthly-governance-review-april-2022/14986",
                        "https://forum.makerdao.com/t/signal-request-restart-the-burn/14903/8",
                        "https://forum.makerdao.com/t/relay-semanal-19-25-de-abril-de-2022/14841",
                        "https://forum.makerdao.com/t/a-north-star-dai-as-the-destination/14838",
                        "https://forum.makerdao.com/t/weekly-relay-april-19-25-2022/14815",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-14-20-2022/14727",
                        "https://forum.makerdao.com/t/relay-semanal-12-18-de-abril-de-2022/14724",
                        "https://forum.makerdao.com/t/weekly-relay-april-12-18-2022/14691",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-7-13-2022/14624",
                        "https://forum.makerdao.com/t/relay-semanal-5-11-de-abril-de-2022/14616"
                    ],
                    "GPT-summary": "The post proposes a 2-step plan to address the issue of decreased vault demand and an increasing demand for DAI. The first step involves raising the system surplus by about a half-order of magnitude and issuing debt equity or selling/issuing equity. The second step involves taking on more risk, particularly with Real World Assets (RWAs), to scale to the next order of magnitude and beyond. The post emphasizes the importance of maintaining a rigorous understanding of the potential losses involved and balancing both sides of the equation. The post concludes by calling for a high-level discussion on this pivot and a concrete plan of action.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.5545985264735265
                },
                {
                    "author_link": "https://forum.makerdao.com/u/calchulus",
                    "index": "#2",
                    "likes": "8",
                    "time": "16/03/2022-14:02:54",
                    "content": "Regarding the capital raise discussion - I do think that there are some pros and cons of capital raises by decentralized protocols that are cornerstones of the defi ecosystem. I would love to actually also at least concurrently consider a vested MKR sale to individuals who have held DAI. (both numbers below underreport given the number of depositors in other smart contracts and lending protocols, but give a sense of relative size) Current DAI token holders: 461,137 https://etherscan.io/token/0x6b175474e89094c44da98b954eedeac495271d0f Current MKR token holders: 82,972 https://etherscan.io/token/0x9f8f72aa9304c8b593d555f12ef6589cc3a579a2 so definitely having something that helps increase the number of active participants in the governance process that matches the growth of the dai holdership. Otherwise, as we saw with the Sushi phantom troupe discussion, there can be a low of pushback from the community of not whether or not funds can be raised, but rather who can participate.   SushiSwap – 8 Jul 21    [Withdrawn] Sushi Phantom Troupe - Strategic Raise Rationale:  As part of the broader Treasury Diversification plan, we propose that a portion of the ~51m SUSHI that is currently being held by the Sushiwap Treasury be used to onboard institutional investors. SushiSwap has been a DeFi Community...  Reading time: 156 mins 🕑 Likes: 1826 ❤       I think a very important step should be that the treasury raise should be specifically conducted in DAI, and somehow have a cap relative to in the past holding DAI. Why let any funds invest in MKR if they don’t actively utilize DAI? Would love to hear what the rest of the community thinks (full disclosure, I work at Impossible.finance, a decentralized platform that helps projects do fundraising to a wider audience for fairer, accessible token rounds.) ",
                    "links": [
                        "https://etherscan.io/token/0x9f8f72aa9304c8b593d555f12ef6589cc3a579a2",
                        "https://forum.sushi.com/t/withdrawn-sushi-phantom-troupe-strategic-raise/4554",
                        "https://forum.sushi.com/t/withdrawn-sushi-phantom-troupe-strategic-raise/4554"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3993734335839605
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#3",
                    "likes": "11",
                    "time": "16/03/2022-14:08:35",
                    "content": "This is an interesting discussion @calchulus. Ultimately, I think this is a capital structure discussion. There are several pros and cons of debt vs equity vs other forms of stakeholder financing we could consider at a later stage. Happy to have your and the community’s views on this. Based on my years in investment banking for financial institutions, I like the debt idea because:  Debt is obviously cheaper and less dilutive than equity/ token financing Debt in fixed rates is something that the DeFi (institutional) market is truly interested in and peer-to-peer or peer-to-protocol money markets haven’t yet been able to meet - due to their competitive disadvantage vs a protocol that is sovereign with its own stable Debt can be tweaked up / down based on needs and market - to do this with token/ equity is much more difficult  Having said that, probably the sweet spot is a combination of various financing sources, also considering the amounts we are talking about. I also agree with you that we should try to “use” capital raising as a tool to increase engagement and create a virtuous effect that benefits the ecosystem as a whole. But this can be done through several levers. The divide and conquer approach could be the right one. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.68488455988456
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#4",
                    "likes": "8",
                    "time": "16/03/2022-14:38:43",
                    "content": "From your personal post, this last point is incredibly important:  Eventually DAI will de-peg from the USD as it becomes competitive as one of the global reserve currencies. This is the end state of Maker I see — a rock solid, credibly neutral foundation to for the world to transact on. Let’s get building.  The greatest centralized counterparty asset risk we face right now is not Circle’s USDC, it’s the United States Federal Reserve Bank’s USD. What are the views of the proposers on this Declaration of Intent to in(directly) hold US Treasuries? How would this effort square with your Agressive Growth Strategy or would it? MIP13c3-SP12: Declaration of Intent - Invest in short-term bonds ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.303571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#5",
                    "likes": "9",
                    "time": "16/03/2022-14:47:33",
                    "content": "This end state for DAI de-pegging from USD is a ways away. If we reach that state we will likely need to do a whole bunch of things differently, and I have no idea what that looks like at this stage. Short term I completely agree with holding US Treasuries as some portion of the portfolio. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/calchulus",
                    "index": "#6",
                    "likes": "4",
                    "time": "16/03/2022-15:05:58",
                    "content": "agreed on your thoughts around a sweet spot of combo  Actually on the point of debt - I’d also bring up a defi integration we saw that was interesting: Perpetual protocol recently did a convertible debt offering powered by Solv Protocol so that the team could raise some convertible debt on chain to its users.  Medium – 14 Feb 22    Announcing the PERP Convertible Voucher Offering Become an investor in Perpetual Protocol by participating in an innovative fundraising method (Initial Voucher Offering) on February 17th.  Reading time: 4 min read       This might be something else to look into as well if you guys think debt may be interesting ",
                    "links": [
                        "https://blog.perp.fi/announcing-the-perp-convertible-voucher-offering-5587715fa03c"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving suggestion for proposal",
                        "3rd party giving information related to proposal"
                    ],
                    "Sentiment": 6.321428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#7",
                    "likes": "5",
                    "time": "16/03/2022-16:29:00",
                    "content": "This is great and thanks to everyone involved in this. One question, if we are going after the Capital Raise route, isn’t it better to discuss and implement tokenomics change first? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#8",
                    "likes": "10",
                    "time": "16/03/2022-16:44:23",
                    "content": "    MarianoDP:  One question, if we are going after the Capital Raise route, isn’t it better to discuss and implement tokenomics change first?   I’m in favour of a tokenomics change, but I don’t think it’s the highest priority. Especially if we are not issuing any profit for the foreseeable future. We should devote all energy to growing the fundamentals. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#9",
                    "likes": "7",
                    "time": "16/03/2022-17:56:31",
                    "content": "I love the idea of raising the surplus buffer by selling bond-style investments. I actually brought this up on Discord two days ago. However, I like your model better than a traditional bond structure. Does your proposed debt structure raise any legal concerns? Would this kind of deposit account be regarded as something that needs SEC regulation? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#10",
                    "likes": "5",
                    "time": "16/03/2022-19:44:03",
                    "content": "I, too, am a fan of the overall proposal (with the debt issuance/MKR sale and the focus on onboarding “real world lenders” like Maple and TruFi with initial/reasonable DCs). My first thought though is that Nadia and her team should return their sights to market makers for MKR, like Wintermute. MKR is a thin market and to the extent the DAO is selling into it,  we would be better placed to have several desks supporting liquidity on strategic dexes and potentially with strategic buyers. Alternatively,  the DAO should consider contributing to an MKR reactor on Tokemak,  the decentralized MM protocol, and purchasing TOKE to distribute liquidity as needed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#11",
                    "likes": "4",
                    "time": "16/03/2022-20:29:06",
                    "content": "    Tosh9.0:  My first thought though is that Nadia and her team should return their sights to market makers for MKR, like Wintermute.   Initial pools on Maple and TrueFi are actually mostly directed at Market Makers specifically even Wintermute. A special pool could be set up to lend DAI via the D3Ms at a low interest rate with the specific instruction to market make DAI on other chains where the liquidity is low until we deploy MCD. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.6138392857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#12",
                    "likes": "1",
                    "time": "16/03/2022-21:26:40",
                    "content": "    hexonaut:  @Nadia is confident they will be able to find buyers.   Why can’t we make this permissionless? Quarterly do Gnosis auctions of blocks of MKR with 1, 2, 3, 4 year vesting periods? Do we necessarily get a better deal by charging the Growth CU with negotiation? Or are we wasting Growth’s resources on price discovery better conducted by Gnosis? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#13",
                    "likes": "8",
                    "time": "16/03/2022-22:10:13",
                    "content": "Gnosis Auctions seems like a possibility. Really it should be whatever gets us the best deal. Be that funds, resources, etc. More details will be released in Growth’s followup post. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 7.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/f-87",
                    "index": "#14",
                    "likes": "4",
                    "time": "16/03/2022-22:36:01",
                    "content": "@hexonaut Thanks for showing us the potential road ahead.  Anything a Maker newcomer (a dev who got a lot of heart to learn) can help? For growth, how about new currencies (EUR) or asset types (Gold) to peg to?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#15",
                    "likes": "10",
                    "time": "16/03/2022-22:49:59",
                    "content": "we could, the objective of this post is to receive community feedback, improve this initial proposal and work on an execution plan. One of the advantages of negotiating is that we can have add hoc clauses depending on the investor. For example that they have to commit to delegating their votes…although probably we could achieve the same on a permissionless auction, not sure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#16",
                    "likes": "10",
                    "time": "17/03/2022-00:15:27",
                    "content": "I also think, as good practice, that we could run parallel tracks: I.e. work on token / debt conversations with investors / permissionless, and probably we will end up with a combination. This isn’t new. When a bank issues new rights / equity, usually retail take up is very healthy, and in parallel there are blocks placed with institutional investors. In the same way, we could optimise our cost of capital by trying to maximise debt issuance but also issue tokens that are not as easily redeemable but more dilutive. Again, in trad banking, this would be similar to issuing Common Equity Tier 1 capital, Alternative Tier 1 capital (like convertible hybrids), Tier 2 capital (some form of redeemable senior debt). And we are DeFi, so we can learn from the mistakes, do things better, and leverage permissionless technology. Many details to iron out, but the future is bright  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.1581439393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#17",
                    "likes": "5",
                    "time": "17/03/2022-03:45:08",
                    "content": "Regarding the Debt component, I think we can have two or more tranches to cater to different risk appetites. First loss would be to the surplus buffer. Once that runs out then backstop 1. Once that runs out then backstop 2. That is, there could be a junior and senior backstop after the surplus buffer runs out. Another fun idea is to put a Deco floating-to-fixed layer on top each backstop buffer. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.550000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xKZ",
                    "index": "#19",
                    "likes": "1",
                    "time": "17/03/2022-06:41:06",
                    "content": "    hexonaut:  This is nowhere near enough to clear the 6B+ in stablecoin backing we have. By increasing the system surplus to the 250m range we can 5x this amount to something more like ~150M per independent loss event. If we can onboard 10+ of these then we are starting to see numbers approaching the 6B   Hello, I don’t get the meaning of  “This is nowhere near enough to clear the 6B+ in stablecoin backing we have” and “If we can onboard 10+ of these then we are starting to see numbers approaching the 6B”,is there any connection? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#20",
                    "likes": "13",
                    "time": "17/03/2022-12:38:19",
                    "content": "We have around 6B in stablecoins backing DAI. This is way too much of an asset that has no interest return. We need to issue loans at the scale of several hundred million to replace this and even then we need a bunch of those. For example if we can issue an average loan of 150m to one of these RWA pools, and we find 10 independent pool operators then we can replace around 1.5B of stablecoins with these higher risk loans. The comment is about focusing on large loans as opposed to say onboarding some token that gets us 50m in loans total - it’s just not enough to have an impact. We are in the big leagues now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.285714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Naren_Ramachandran",
                    "index": "#21",
                    "likes": "10",
                    "time": "17/03/2022-13:31:02",
                    "content": "Hi Luca, How’s it going? Interesting and important proposals. Some observations from a beginner in this DeFi world:  As you have rightly pointed out in your articles before, which this capital raising initiative is aiming to solve for, the current loss absorbing capital base of MKR is thin However, if the collateralisation level and the quality (mainly liquidity and volatility) of the collateral are calibrated appropriately, the capital base should not cause a concern Seems to me that even with the current collateral definitions there is a need to re-inforce the loss absorbing capacity of MKR In my humble view, you might want to ensure that the aim of this capital raise is clearer? Is it to increase leverage (thereby increasing the risk profile of the equity base) or for the new capital to provide (in addition to leverage) additional loss absorbing capacity? I do not see why someone would be willing to provide pure leverage (senior) with a wafer thin loss absorbing buffer at the equity level. Upside is capped but downside could be large. Providing some warrants type features (MKR linked) would be required in my view (to also align incentives) Furthermore, rapid expansion into illiquid / higher volatility collaterals and RWAs (reg risk) could potentially increase the risk profile multi-fold all at once. Sometimes, one or two steps better than leaping too far…  All the best, ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.363463203463203
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#22",
                    "likes": "6",
                    "time": "17/03/2022-13:56:44",
                    "content": "    Naren_Ramachandran:   In my humble view, you might want to ensure that the aim of this capital raise is clearer? Is it to increase leverage (thereby increasing the risk profile of the equity base) or for the new capital to provide (in addition to leverage) additional loss absorbing capacity? I do not see why someone would be willing to provide pure leverage (senior) with a wafer thin loss absorbing buffer at the equity level. Upside is capped but downside could be large. Providing some warrants type features (MKR linked) would be required in my view (to also align incentives) Furthermore, rapid expansion into illiquid / higher volatility collaterals and RWAs (reg risk) could potentially increase the risk profile multi-fold all at once. Sometimes, one or two steps better than leaping too far…    EXCELLENT POINTS! I will repeat two key key points:  I do not see why someone would be willing to provide pure leverage (senior) with a wafer thin loss absorbing buffer at the equity level. Upside is capped but downside could be large. Providing some warrants type features (MKR linked) would be required in my view (to also align incentives) Furthermore, rapid expansion into illiquid / higher volatility collaterals and RWAs (reg risk) could potentially increase the risk profile multi-fold all at once. Sometimes, one or two steps better than leaping too far…  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.607284020327499
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#23",
                    "likes": "8",
                    "time": "17/03/2022-17:18:35",
                    "content": "Thanks for this @Naren_Ramachandran, great to see you here. As you mentioned, nothing truly new under the sun: the protocol aims at strengthening its capital position in the most efficient way in order to do more business. Looking at a lending institution’s balance sheet through the lens of a lender is useful up to a certain point. I guess the key point here, is the intention to improve Maker’s solvency position. I think ‘first loss’ definition isn’t truly applicable in a financial balance sheet, and it would be more useful to talk about “permanence” and “remuneration discretion” of loss absorbing capital. Obviously, as an institution we would like to have the most permanent / discretionary type of capital possible. That type of capital, typically, is expensive - or dilutive. I believe that @hexonaut’s point over a debt issuance shouldn’t be seen as prescriptive. The main point is that we believe there is a market for a cheaper/ less dilutive type of capital that is not a straight token. But that retains the same type of permanence and remuneration discretion. Most probably we will reach a mix of capital sources, at a mix of costs for the protocol. I find fascinating that we are having those conversations in the first place. To @Naren_Ramachandran’s points.     Naren_Ramachandran:  Seems to me that even with the current collateral definitions there is a need to re-inforce the loss absorbing capacity of MKR   I fully agree. The stop to MKR burning has gone in this direction, but we will always be behind if we wait for endogenous profit generation. Also, and I know this is difficult to master for old FIG warriors like us, there are a bunch of operational risks in a protocol such as Maker, mainly related to collateral liquidation mechanisms, that need to be protected by the buffer. In addition, Maker is still a very young venture, and although we should aim at consistent profitability we cannot rely on profit reserves to finance operations if, like it happens today, our revenues are still extremely volatile.     Naren_Ramachandran:  In my humble view, you might want to ensure that the aim of this capital raise is clearer? Is it to increase leverage (thereby increasing the risk profile of the equity base) or for the new capital to provide (in addition to leverage) additional loss absorbing capacity?   I think on this @hexonaut and @Nadia have shown the path. As of today, we have no loss reserves to absorb any loss even in the most conservative off-chain / illiquid collateral exposure. Aim of a healthier surplus buffer would be to offer more confidence in doing business. Even if an off-chain exposure is activated with an effective 1% expected loss (investment grade level), at 1b of this exposures (which is a conservative ambition) we could see fluctuations of 10s of MM (pre recovery) and probably more with portfolios ramping up to maturity. And this is only for the known unknowns, that we should aim at protecting through over-collateralisation and excess spreads in the structures. Still, I have been advocating with Growth and others that we shouldn’t forget the need to remain conservative and loyal to Maker’s mantra of prudent innovation.     Naren_Ramachandran:  I do not see why someone would be willing to provide pure leverage (senior) with a wafer thin loss absorbing buffer at the equity level. Upside is capped but downside could be large. Providing some warrants type features (MKR linked) would be required in my view (to also align incentives)   As I was mentioning before, I believe this will be a negotiation with investors. Ultimately we aim at minimising cost of capital of a surplus buffer while also innovating beyond a straight token issuance. We will learn about appetite while exploring. You are suggesting warrants, I think a hybrid / contigent convertible structure is plausible. It would be great to have senior financial professionals chip in the conversations here on the post or through other channels to structure this in the best possible way.     Naren_Ramachandran:  Furthermore, rapid expansion into illiquid / higher volatility collaterals and RWAs (reg risk) could potentially increase the risk profile multi-fold all at once. Sometimes, one or two steps better than leaping too far…   You are preaching to the preachers. As @Eumenes and the rest of the RWF CU knowns, we have done enormous work in trying to share our views with the community that we should increase the quality of the collateral, the quality of the structures, the solidity of the legal contracts, while we prudently ramp up our exposure. We know that Maker is hungry for growth, but we are ultimately running a currency and we shouldn’t forget that currency holders’ trust is our most precious asset. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.856070596070596
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#24",
                    "likes": "4",
                    "time": "17/03/2022-17:45:21",
                    "content": "Excellent post, this is exciting  As a quick aside, and despite supporting an indefinite halt to burning, I just want to note that while black thursday was very painful for Maker, its aftermath also showed that there was significant appetite for acquiring some control of the protocol (albeit at reduced prices). In that timeframe DAI only ever deviated upwards. I am glad to see additional layers of protection, but even without loss absorption mechanism beyond  dilution, history so far shows that trust in DAI is extremely strong. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.006818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Naren_Ramachandran",
                    "index": "#25",
                    "likes": "5",
                    "time": "18/03/2022-10:19:18",
                    "content": "What does not kill you, makes you stronger. Crises cannot be avoided, surely many more will come. The actions taken to date (halt to burning) and further actions (collateral review and additional loss absorption capacity) would take the system to the next level and lay the foundation for scaling up. Keep the system resilient (loss absorption and cost efficient) - scale and profitability will come naturally. Simplicity is the key foundation for building resilient large scale systems, particularly in the initial stages of development. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.822751322751323
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Heidi",
                    "index": "#26",
                    "likes": "7",
                    "time": "18/03/2022-11:25:50",
                    "content": "Proposing to converge with all the traditional banking constructs including tiered capital and real world lending. It’s just not clear to me how this escapes regulation for very much longer. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#27",
                    "likes": "7",
                    "time": "19/03/2022-17:34:46",
                    "content": "Arrrgh, me mateys! Will there be a community call about that thar plan to pile up plunder?!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#28",
                    "likes": "3",
                    "time": "20/03/2022-01:37:49",
                    "content": "It’s not clear to me either though I think the ultimate answer is pretty straightforward: it doesn’t. That said, I am in favor of the steps described above to hypercharge growth if done prudently. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#29",
                    "likes": "1",
                    "time": "21/03/2022-17:02:38",
                    "content": "Thank you for working on this and posting this vision for growth.  It’s something I’ve looked forward to seeing.  In general, I love ideas for growth and think they should be explored.  I also think understanding how the surplus buffer can be used will make it easier to swallow the costs of building it.  At the same time, this proposal does come at a cost and I think what’s important is for the details to be fleshed out and made more comprehensible.  It seems the key to much of this are these protocols that would do risk/reward analysis for us. Some questions in my mind - How much overhead/intermediary costs will connecting with these protocols add?  How do we go about determining the worthiness of the protocols themselves? What’s the timeline for all this to happen? Do we have to wait for the surplus buffer to contain 250m to start looking into any of these ventures?  Will you want to continue building the SB even after you have 250m in there?  I suppose this goes back to the question about the protocols’ worthiness and will be dependent on risk analyses of these new activities. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.084710743801653
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#30",
                    "likes": "8",
                    "time": "21/03/2022-17:33:55",
                    "content": "    Traster_Tray:  How much overhead/intermediary costs will connecting with these protocols add?   The Protocol Engineering team is working on standardizing the D3M design such that adding new protocol to protocol connections takes way less time. Depending on the protocol (and if they use standards such as ERC-4626) the turn-around time for new protocols can be quite low. Intermediary costs totally depend on the protocol.     Traster_Tray:  How do we go about determining the worthiness of the protocols themselves?   Relevant Core Units will still be doing due diligence on everything being onboarded. This will include technical analysis, liquidity constraints, legal risk, counter-party risk, etc. Seeing protocols working properly for some period of time is very helpful as well.     Traster_Tray:  What’s the timeline for all this to happen?   All of this is being worked on that has already been signalled from the technical side (Maple D3M, Compound D3M, Rari D3M, multi-chain). It’s just until we grow the surplus buffer we cannot issue large loans to some of these protocols. Growth will be publishing a concrete plan to do the capital raise in parallel.     Traster_Tray:  Do we have to wait for the surplus buffer to contain 250m to start looking into any of these ventures?   No, we should be onboarding this stuff at small debt ceilings to get the ball rolling imo. As the money comes in for the Surplus Buffer we grow the ceilings to match. For example, we’ve already received a signal request to prioritize onboarding Maple. We can proceed to do that, but we can’t give them large loans until we have the other piece     Traster_Tray:  Will you want to continue building the SB even after you have 250m in there?   Yes, although we will need to re-assess whether further capital raises are warranted or if we have reached escape velocity with recurring revenues. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.269234553325463
                },
                {
                    "author_link": "https://forum.makerdao.com/u/superTricycle",
                    "index": "#31",
                    "likes": "2",
                    "time": "22/03/2022-15:19:53",
                    "content": "Hypergrowth mindset. Love to see it.     hexonaut:  There are crypto levers we can lean on such as institutional vaults or borrowing incentives, but inevitably we will need to rely on Real World Assets (RWAs) or other complex and more innovative use cases to scale to the next order of magnitude and beyond.   I’d like to see the crypto levers explored further, but maybe that warrants a separate post. Where does crypto innovation fit into Maker’s aggressive growth strategy? I get the focus here is RWA and no doubt it’s important for hypergrowth, but we need new crypto growth. RWA moves slow and the RWF thread shows there’s still a lot to be figured out. What are we gonna do about revenue while RWA slowly gets sorted out? Meanwhile, we have competitors like Aave that are ahead on multichain and new offerings, while already supporting RWA themselves. I agree with the FUD from the Defiant article about this thread. Seems like a disconnect to be “the most trusted stablecoin” in crypto but pivoting away from crypto. Not saying we shouldn’t pursue RWA, but there needs to be a dual path to growth. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.6938131313131315
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#32",
                    "likes": "9",
                    "time": "22/03/2022-15:23:40",
                    "content": "Would it make sense to issue various “dai bonds\"? We could use similar technology as DssVest to tokenize e.g. a 100 M dai as bonds with a fixed yield, e.g. a 1 year maturity at 1 % apr. Anyone could then purchase this bond at at price of 1 Dai per 1 “dai bond”, that at maturity (1 year) can be redeemed for 1.01 Dai. This would increase the surplus buffer upfront by 100 M. The module would then over 1 year suck 101 M dai from the surplus buffer to the bond module similarly to the budget streams. Maker would then need to make a 1 % yield on the raised capital to be net neutral. Furthermore, we could allow dai-bond holders to borrow Dai against the bond as collateral. This would lower the net cost for Maker if a small stability fee is charged, while allowing users upfront liquidity. This could maybe help lower the amount of USDC in the system in the short term while increasing the SB/opportunity for growth. I’m no economist so I’m not sure if this is some unstable house of cards. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.777777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#33",
                    "likes": "0",
                    "time": "22/03/2022-15:27:12",
                    "content": "its an interesting idea similar to having folks deposit their DAI with Maker for a set period of time and get a fixed interest rate on it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#34",
                    "likes": "5",
                    "time": "22/03/2022-15:45:36",
                    "content": "To hit the numbers we need there really aren’t any crypto-native solutions other than waiting for a bull market or paying people to mint DAI. RWAs making up most of the collateral portfolio was always going to be the end stage. The TAM of crypto is just not large enough to support a stablecoin of this size and beyond. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.467857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#35",
                    "likes": "4",
                    "time": "22/03/2022-15:46:33",
                    "content": "Using some fixed maturity product is definitely also a possibility. Whatever tool will work best really. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#36",
                    "likes": "1",
                    "time": "22/03/2022-17:03:46",
                    "content": "The approach proposed here in the original post is simpler, from a smart contracts point of view, than mimicking the traditional bond structure. However, I’m in favor of whatever debt instrument is chosen. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.982142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#37",
                    "likes": "13",
                    "time": "22/03/2022-21:25:22",
                    "content": "    superTricycle:  Where does crypto innovation fit into Maker’s aggressive growth strategy?   I think what Super-T is asking here, what are some of the crypto-related strategies and innovative solutions that this proposal is advocating for? And I can answer him by specifying some of the ideas in the works. Such as the development of Maker Wormhole to feed CanonicalDAI into other realms, deployment of StarkNet, the possibilities of launching MCD Vaults on a Layer 2, D3M deployments, etc., etc. But what Super-T wants to hear is what will MakerDAO do today? Specially when you hear that AAVE is launching v3 on EVMOS, and they will receive 50% of every smart contract transaction that gets executed on AAVE v3. That’s extra free revenue that usually goes to Validators on PoS Chains. So, I get it that the stars are not currently aligned, the market is off a step, or two. But things are happening. And they will continue to happen, as this community continues to debate in what direction this DAO should go. Folks, it’s time to start making things happen.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.771103896103896
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#38",
                    "likes": "4",
                    "time": "22/03/2022-23:48:37",
                    "content": "Yes didn’t mean to imply nothing was being done in the crypto-native land. @flipflopflapdelegate covered all the stuff we are focused on besides RWAs. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#39",
                    "likes": "1",
                    "time": "25/03/2022-01:42:04",
                    "content": "After having put this idea into operation correctly, giving the expected results, it should also diversify risk further by analyzing the possibility of lending to reputable centralized institutions, as you have already mentioned “more competitive loans than those of the central banks themselves” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#40",
                    "likes": "7",
                    "time": "25/03/2022-07:26:09",
                    "content": "@hexonaut I was going to answer @flipflopflapdelegate but then saw your post. You guys (CUs) are objectively doing great work. However I think what @flipflopflapdelegate is trying to say (@flipflopflapdelegate please correct me if I am wrong) is that, beside this well organised (CUs) work,  there is seemingly also the need of also having more organic growth in terms of spontaneous contributions (as in FOSS projects), which should naturally lead with connections with other crypto projects, etc. In my opinion you (@hexonaut) are the greatest example of this so far. You independently came out with the Smart-contract code for swapping DAI with USDC at the time. This was a relatively small piece of code, but a huge contribution to Maker. For this I have advocated a few times that we should promote Hackatons, ‘courses’ and whatever kind of activities that are required to boost this movement. In short: beside a well-organised and well-executed plan (by CUs) we perhaps also need some more agile development and experimentation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1838235294117645
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#41",
                    "likes": "5",
                    "time": "25/03/2022-13:06:46",
                    "content": "    iammeeoh:  For this I have advocated a few times that we should promote Hackatons, ‘courses’ and whatever kind of activities that are required to boost this movement.   Completely agree with this. I would like to expand the Events Core Unit to take care of this stuff on an ongoing basis. There are hackathons at most conference events. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#42",
                    "likes": "2",
                    "time": "25/03/2022-19:44:38",
                    "content": "    hexonaut:  In summary, we have reached a critical point where we need to grow into new markets or risk losing out to a competitor. Crypto-native lending has more or less worked so far due to the bull market, but we need uncorrelated assets at scale and we need them now. We already have a massive advantage with DAI being one of the most trusted stablecoins available. Let’s not squander this first-mover advantage with decision paralysis. Instead let’s lean into the future and embrace crypto’s merge with the real world. We are sure to find partners in this journey, both as investors and as potential counter-parties.   I really like this paragraph.  Given that there are significant networks effects for stable coins, a stable coin needs to scale rapidly…  or die on the vine. As long as Maker doesnt blow up due to DAI instability, I think rapid growth is the smartest (and lowest risk) path forward. As such I fully support taking smart risks in learning & building organic DAI demand! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 5.713830029619503
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#43",
                    "likes": "7",
                    "time": "27/03/2022-20:16:43",
                    "content": " Let me also give a plug here for the ReFi movement (Regenerative Finance) and tokenization of natural capital. We are going to see the market cap and adoption grow exponentially for these and social tokens/tokenized communities (track the leaders here: Market | Forefront). While #ReFi and social tokens are somewhat of a separate phenomenon, there’s a converging of modes taking place. IMO we need a stronger dose of “Fi” to power the “Re” (need more de-finance expertise to add to the regenerative economy disciplines leading in that space). To date there’s a lot of experimentation with NFTs for crowdfunding and bootstrapping communities, but what’s brewing under the surface is the conversion of “values” and social clout into pure money with no RWA ties what-so-ever. Also this, just in from coindesk Crypto Carbon: Can Blockchain Networks Fix Carbon Offsets? These new trends in crypto represent a blue ocean of crypto-native strategies to run with on parallel tracks. This is a space I’m active in and will be core to what I’d like to contribute in the Resilience Improvement Strategic Initiative discussions cc @wouter @psychonaut @juan Governance and Risk #182 - Thursday, March 17 17:00 UTC - #2 by Artem_Gordon ",
                    "links": [
                        "https://www.coindesk.com/layer2/miningweek/2022/03/27/crypto-carbon-can-blockchain-networks-fix-carbon-offsets/",
                        "https://forum.makerdao.com/t/governance-and-risk-182-thursday-march-17-17-00-utc/13965/2#resilience-improvement-20",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/11"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.458658008658008
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#44",
                    "likes": "0",
                    "time": "27/06/2022-02:16:49",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}