{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-delegate-debate-burning-mkr-off-boarding-govcomms-and-the-defense-fund-on-drinks-w-makerdao-delegates/19414",
            "title": "MakerDAO Delegate Debate:  Burning MKR, Off-boarding GovComms, and the Defense Fund on Drinks w/MakerDAO Delegates ",
            "index": 19414,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegate-platform",
                "community-delegate-vlog",
                "drinks-maker-delegates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "7",
                    "time": "13/01/2023-22:26:36",
                    "content": " To Burn, or Not to Burn? That is the Question. On this episode of MakerTube.lens,  MakerDAO Recognized Delegates Flipside Crypto, FlipFlopFlap Delegate LLC, ColdIron.eth, and FeedBlack Loops LLC debate the latest Governance Polls for the DssKiln, the off-boarding of the GovComms Core Unit, and the proposal for a Defense Fund. We had a good debate and conversation about some of the recent  pending DAO Governance Polls that will impact the future landscape of MakerDAO.  We really enjoyed having a healthy conversation and hope that you do as well.  NOT FINANCIAL ADVICE This Content is for entertainment and informational purposes only, you should not construe any such information or other material as legal, tax, investment, financial, or other advice. Nothing contained on the Drinks With MakerDAO Delegates YouTube Channel, and/or MakerTube.lens Channel constitutes a solicitation, recommendation, endorsement, or offer by @twblack88  of FeedBlack Loops, @ultraschuppi  of ColdIron.eth, @ElProgreso of Flip Flop Flap Delegate LLC, and @rspa of Flipside Crypto, or any third party service provider to buy or sell any cryptocurrencies, securities, or other financial instruments. Nothing in this YouTube Video constitutes professional and/or financial advice.  The Tastings: UpOnly! ColdIron: Milk from Germany    Germany  4 Stars     Raph of Flipside: Café Pino Lupin Coffee from Kornkreis, Bavaria. Germany  4 Stars     FeedBlack Loops: Tap Water from Tahoe  5 Stars      FlipFlopFlap: Trader Joe’s Smoothie  4.5 Stars      MakerTube Decentralized Episode: Lenstube   ",
                    "links": [
                        "https://lenstube.xyz/watch/0x01a2c6-0x05"
                    ],
                    "GPT-summary": "The post is a video discussing the latest Governance Polls for the DssKiln, the off-boarding of the GovComms Core Unit, and the proposal for a Defense Fund in MakerDAO. The recognized delegates of MakerDAO, Flipside Crypto, FlipFlopFlap Delegate LLC, ColdIron.eth, and FeedBlack Loops LLC, debate and discuss the pending DAO Governance Polls. The post also includes a disclaimer that the content is for entertainment and informational purposes only and should not be construed as legal, tax, investment, financial, or other advice.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.590277777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/layerzero",
                    "index": "#2",
                    "likes": "4",
                    "time": "16/01/2023-13:40:21",
                    "content": "Thank you for sharing your debate @flipflopflapdelegate , @twblack88 ,@ultraschuppi ,@rspa . A few comments on the defense fund I would like to add: Self insurance is fully customizable and can be tailor made to meet specific requirements of a decentralized organization like MakerDAO. Hence, it is a suitable risk management instrument for DAOs. This means, anon contributors will be covered by the fund. There will be no KYC requirements for signing up. Self-insurance is compatible with a pseudonymous workforce. Additionally, we will classify beneficiaries in different risk layers. If there is a specific subset of persons with higher risk exposure (i.e. delegates, devs, etc), they will have higher coverage limits. If this proposal is approved, we will talk with all interested parties to understand the risk requirements and clearly define beneficiaries, risk layers and exclusions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/layerzero",
                    "index": "#3",
                    "likes": "1",
                    "time": "16/01/2023-14:10:49",
                    "content": "In the Endgame paradigm, we see the defense fund evolving to a Protector SubDAO or an Ecosystem Actor that can absorb risk and provide protection to other players of the Maker Ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.375
                }
            ]
        }
    ]
}