{
    "poll_list": [
        {
            "title": "Adopt the Debt Ceiling Instant Access Module (DC-IAM) for use with current and future vault-types - January 18, 2021",
            "index": "6008",
            "option": "Yes",
            "supporting_mkr": "38,829",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-rolling-out-the-debt-ceiling-instant-access-module-dc-iam/6008",
            "title": "[Signal Request] Rolling out the Debt Ceiling Instant Access Module (DC-IAM) ",
            "index": 6008,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "rates",
                "sig-status-accepted",
                "dc-iam"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "3",
                    "time": "11/01/2021-15:21:07",
                    "content": " Introduction At the end of November, we saw MIP27 (The Debt Ceiling Instant Access Module) pass successfully through the monthly governance cycle. Since then it has been implemented and activated for the ETH-B vault-type, and has worked as expected as part of the Maker Protocol. This signal request seeks to gain a mandate for rolling out the DC-IAM to new and existing collateral types where the mandated actors feel that it makes sense to do so. Smart Contracts feel that the benefits outweigh the risks, and this opinion is shared by Risk and the other mandated actors. While the previously mentioned griefing exploit is possible, we feel that it is low liklihood, low severity, and easily mitigated should it occur.  Benefits Details on the benefits of the DC-IAM can be found in MIP27, but briefly, it allows:  Automatic management of Debt Ceilings such that governance can spend less time manually adjusting ceilings to keep the available debt low. Protection outside of the GSM-Delay in the event of a severe market downturn.   Important Note @Risk-Core-Unit wishes to make it clear that more widely using the DC-IAM does not mean that we should just ‘yolo’ all the debt ceilings up by very large amounts given the new functionality. Risk still needs to be managed actively, and in general increases as the amount of collateral locked in the Maker Protocol increases. This may lead to @Risk-Core-Unit proposing higher Stability Fee values for vault-types that balloon in size.  Next Steps Should this signal request be successful, an on-chain poll will be had to confirm that MKR Token Holders support the wider roll-out. From that point, risk evaluations will also include risk parameters for the ttl and gap parameters within the DC-IAM. Implementations for the existing collateral types will be added over the next few months, according to the Risk team’s availability, with on-chain polls to confirm the new risk parameters on a per-collateral basis. An initial set of parameters was provided here, but these may change before implementation.  Signed The MakerDAO Mandated Actors     Should we roll out DC-IAM Implementation to current and future vault-types?  Yes No Abstain     0 voters     This poll will be open for at least 5 days, until Friday 15th January. It may be extended until Thursday 21st January if I don’t feel there has been enough participation or if the outcome is contentious after 5 days. ",
                    "links": [
                        "https://vote.makerdao.com/executive/5fbb7ab169fd97001ae7442b?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/mip27-debt-ceiling-instant-access-module/4625/22",
                        "https://forum.makerdao.com/t/mip27-debt-ceiling-instant-access-module/4625",
                        "https://forum.makerdao.com/t/eth-b-dc-iam-initial-parameters/5512",
                        "https://forum.makerdao.com/t/gobernanza-de-un-vistazo-14-01-2021-autor-original-prose11/6073",
                        "https://forum.makerdao.com/t/governance-at-a-glance-2021-01-14/6048",
                        "https://forum.makerdao.com/t/maker-relay-ep-27-en-espanol-feliz-2021/6035",
                        "https://forum.makerdao.com/t/maker-relay-ep-27-happy-2021/6016",
                        "https://forum.makerdao.com/t/signal-request-adjust-eth-a-debt-ceiling-2021-02/5993",
                        "https://forum.makerdao.com/t/signal-request-adjust-eth-a-debt-ceiling-2021-02/5993/16",
                        "https://forum.makerdao.com/t/maker-relay-ep-28-en-espanol/6124",
                        "https://forum.makerdao.com/t/maker-relay-ep-28/6118",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-124-thursday-january-14-17-00-utc/5967/2"
                    ],
                    "GPT-summary": "The post is an explanation of the Debt Ceiling Instant Access Module (DC-IAM) proposal, which has already been implemented for the ETH-B vault-type in the Maker Protocol. The proposal seeks to gain a mandate for rolling out the DC-IAM to new and existing collateral types. The post provides details on the benefits of the DC-IAM and notes that risk still needs to be managed actively. The author also outlines the next steps, including an on-chain poll to confirm MKR Token Holders' support for the wider roll-out and risk evaluations. The post also includes a poll for readers to vote on whether to roll out the DC-IAM implementation to current and future vault-types.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.323154233977405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#2",
                    "likes": "1",
                    "time": "11/01/2021-15:32:52",
                    "content": "I really wish there was an option here for a rolled out approach… (with ETH-A being last) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "2",
                    "time": "11/01/2021-15:38:29",
                    "content": "The signal is proposing a rolled out approach.     LongForWisdom:  Implementations for the existing collateral types will be added over the next few months, according to the Risk team’s availability, with on-chain polls to confirm the new risk parameters on a per-collateral basis.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.893939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#4",
                    "likes": "0",
                    "time": "11/01/2021-15:39:11",
                    "content": "gotcha… any clarity RE the sequence? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#5",
                    "likes": "0",
                    "time": "11/01/2021-15:40:31",
                    "content": "in my eyes, starting at the smallest amount of debt outstanding and working our way larger and larger each week makes sense. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "1",
                    "time": "11/01/2021-15:45:12",
                    "content": "    LongForWisdom:  @Risk-Core-Unit wishes to make it clear that more widely using the DC-IAM does not mean that we should just ‘yolo’   Ain’t that  the truth. Lately it feels as we all think ETH & MKR will go straight up to 10,000 without any downside risk. Stay focus Y’all. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.463541666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#7",
                    "likes": "2",
                    "time": "11/01/2021-19:38:03",
                    "content": "Thanks for the writeup. I have a few questions before voting.     LongForWisdom:  While the previously mentioned griefing exploit is possible, we feel that it is low liklihood, low severity, and easily mitigated should it occur.   (1) Do you know if it’s possible for a borrower, assuming the DC is at maximum and ttl is met, to raise the DC and borrow Dai in the same transaction? Wouldn’t this mitigate the griefing attack? (2) This is more of a general question, but does the DC-IAM offer us significant protection against OSM delay attacks? Is it safe to say that if ttl is at least 1hr, it would offer total protection against OSM delay attacks? (3) Would it make sense to avoid deploying this feature on short-term stablecoin facilities like USDC-B in order to mitigate the potential impact of a griefing exploit? EDIT: I believe that the ability to decrease the debt ceiling with no ttl offers some protection against OSM delay attacks, but I could use an explanation to understand if it offers total or partial protection (or none at all). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.372916666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "1",
                    "time": "12/01/2021-00:52:37",
                    "content": "I think @cmooney and / or @Primoz are probably better suited to answering these than me, but I’ll have a go:  I don’t think there is anything stopping a flashloan in which someone raises and mints in the same transaction. I think it offers us some (in that the severity is limited.) But I don’t think it’s anywhere near total. The DC-IAM only changes the ceiling to the defined gap. So you’re exposed up to a maximum of gap in terms of the OSM delay attack. Not sure.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.236607142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "0",
                    "time": "13/01/2021-18:24:30",
                    "content": "I’d like to get some more participation here before wrapping this up. Please consider voting if you haven’t already, otherwise I’ll extend this to end on the 21st. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "3",
                    "time": "15/01/2021-05:11:25",
                    "content": "Given the outcome so heavily favouring ‘Yes’ I’m happy to end this today and put it up for vote on-chain on Monday. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "2",
                    "time": "27/01/2021-21:49:46",
                    "content": "The on-chain poll for this signal ended successfully. The DC-IAM will be rolled out to additional collateral types in the coming months. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#12",
                    "likes": "0",
                    "time": "03/02/2021-21:49:48",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "3146"
}