{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/additional-representations-risks-and-mitigations-related-to-6s-capital/9590",
            "title": "Additional Representations, Risks and Mitigations Related to 6s Capital ",
            "index": 9590,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "collateral-app",
                "real-world-finance",
                "rwf",
                "sixs",
                "rwf-001",
                "rwa-co"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#1",
                    "likes": "6",
                    "time": "29/07/2021-18:25:32",
                    "content": "DISCLAIMER The content of this communication is for informational purposes only. You should not construe any information contained herein as legal, tax, investment, financial, or other advice. You should not rely on the information contained herein as a basis for making any business, legal or other decisions. RWA Company LLC and its members, officers, directors, owners, employees, agents, representatives, suppliers and service providers cannot be held liable for any of the information contained in this communication. Nothing contained herein constitutes a solicitation, recommendation, endorsement, or offer by RWA Company LLC or any third party service provider to buy or sell any securities or other financial instruments in any jurisdiction. THIS INFORMATION IS PRESENTED “AS IS” FROM 6S CAPITAL; RWA COMPANY LLC TAKES NO RESPONSIBILITY FOR ITS ACCURACY.   This originator is being represented by RWA Company LLC via the designated appointee Gregory Di Prisco (@g_dip), all questions and concerns from the community may be addressed to Greg.  RWA Company LLC representations: Background check (on management):  Credit check (on primary entity):  The scope of our background checks (currently run through Kroll) can be found here. Entity credit checks are performed by Experian. No personal credit checks were performed as all loans are intended to be non-recourse.  Risk: Assuming that the debt ceiling is set to 0 and the trust account is filled with the entirety of funds recovered from outstanding loans, there exists the possibility (although exceptionally unlikely) that communication could break down between all parties involved and the Trustee would lack the direction it requires to take any action at all. Crestbridge, as a regulated Service provider in the Cayman Islands and as directors of the Trust Sponsor, has a fiduciary obligation to conduct themselves in the best interests of the Trust Sponsor and its interests, including the Delaware Trust, thus they have the obligation to cause the transfer of DAI back to MarkerDAO. The trust sponsor has authorized one individual as the authorized signatory with specific authority. Should this individual fail to carry out his duty of instructing the trustee to return the DAI, the directors can remove this individual and appoint another authorized party. Further, the directors can also take action directly. As an additional safeguard for this, 6s Capital was inserted as another party that can cause the transfer in this extreme edge case that Crestbridge fails to act. However, the extreme edge case of the edge case is that the authorized representative, Crestbridge, and 6s Capital, are all unresponsive. This would result in the cash remaining “stuck” in the trust account. If the Trustee receives no direction, it has the right to interplead this money into a Delaware Court and permit the Court to decide who is entitled to it. MakerDAO (or an agent on its behalf) would have to file a claim with the Court to recover the money. This doesn’t mean the money is lost, as it should be fully recoverable with due process (as the beneficiary of the Trust is MakerDAO). To avoid that situation, the below are solutions for both the short-term (already in place) and medium term (will be the first amendment to the Trust Agreement). Mitigation (short term): Gregory Di Prisco at RWA Co. has been given a limited power of attorney of Matthew Rabinowitz of 6s Capital (provided below) exclusively for the sole purpose to direct the Trustee to send the DAI back to MakerDAO in the event that every other path breaks down. In addition, 6s Capital will be contractually bound (pending the execution of an additional agreement which I will confirm here when signed) to pay RWA Company a fee of $100,000 if it revokes this power of attorney while any amounts are due to MakerDAO. We believe that this solution is adequate in the short term as 6s Capital has no incentive to leave the money sitting in the trust account (they cannot use it) and would incur an economic cost, in addition to the threat of litigation, if they do not take action. This would-be “stick” should be more than sufficient to cause 6s Capital to notify the Trustee to send funds back should the trust sponsor fail to do so. Mitigation (medium term): Unrelated (potentially regulated) counterparties that the community believes will ultimately represent Maker’s best interest could be added to the Trust Agreement (assuming successful KYC/AML with WSFS Bank and other transaction participants) and explicitly given the power to direct the funds back to MakerDAO in the event communication between the Trust Sponsor and 6s Capital break down. Any amendment to this ability would require the affirmative vote of MKR holders to amend the Trust Agreement. Some names being contemplated at this time include the DAI Foundation, among others.The community should deliberate on who would be the ideal party that will stand the test of time. This could go in the “first amendment” to the structure in ~6 months which would require the community to vote on and pass that amendment. Risk: Money in the escrow account may at times exceed FDIC insurance limits. Should WSFS Bank fail, could Maker experience uninsured losses? Mitigation: WSFS is a Trust company which means the assets are held in trust and are not assets of WSFS under the U.S. bankruptcy code. That means that creditors of WSFS cannot reach the trust assets. FDIC insures deposits that are liabilities of a bank. WSFS is not serving as a bank in this structure so FDIC limits are irrelevant. As Trustee, pursuant to Delaware Trust Law, WSFS is permitted to invest cash of the Trust in overnight US government securities. The Trust Sponsor does not direct the Trustee in overnight investing. This would be part of WSFS standard trust treasury management. Risk: If slippage is incurred at the broker-dealer, the amount of Dai could be different from what’s in the Vault. There will also be another accounting discrepancy which arises from “phantom stability fees” as the Vault cannot tell when money has been paid back to the Trust. Mitigation: The broker-dealer will utilize a TWAP when trading Dai to USD and vice versa. This could cause minor delays in repayment to the Vault but should reduce slippage. For the accounting discrepancies caused by the Vault constantly incurring stability fees while the Trust does charge interest on idle cash, MKR holders will need to be aware of the difference and make adjustments to the system accounting periodically.  Executed Power of Attorney Document  658×847 90.2 KB  656×847 25.3 KB  ",
                    "links": [
                        "https://www.rwa.company/backgroundchecks",
                        "https://forum.makerdao.com/t/mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14482",
                        "https://forum.makerdao.com/t/6s-capital-rwac-monthly-report-march-2022/14532/4",
                        "https://forum.makerdao.com/t/6s-capital-state-of-the-business/4420/44"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.245960884353742
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "0",
                    "time": "29/07/2021-18:48:44",
                    "content": "    g_dip:  For the accounting discrepancies caused by the Vault constantly incurring stability fees while the Trust does charge interest on idle cash, MKR holders will need to be aware of the difference and make adjustments to the system accounting periodically.   Attn: @Aes, as this will probably fall to you to figure out the best method to monitor and reconcile ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#3",
                    "likes": "0",
                    "time": "29/07/2021-19:00:06",
                    "content": "Just FYI we did bring this to the PE Team’s attention. There’s a couple of ways to handle it. Happy to have a 1-on-1 to dive deeper if you’d like @Aes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/07/2021-20:54:20",
                    "content": "    g_dip:  Some names being contemplated at this time include the DAI Foundation, among others.The community should deliberate on who would be the ideal party that will stand the test of time.   I totally support the DAI Foundation as the added choice to the Trust Agreement. Great choice IMO.     g_dip:  Risk: Money in the escrow account may at times exceed FDIC insurance limits. Should WSFS Bank fail, could Maker experience uninsured losses?   Is there any way to Insure excess deposits? Perhaps via Lloyds TSB? And ya–more than likely most of the time they’ll exceed FDIC limits  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#5",
                    "likes": "1",
                    "time": "29/07/2021-21:08:40",
                    "content": "    flipflopflapdelegate:  Is there any way to Insure excess deposits?   I think this is typically done by splitting it amongst multiple banks to receive the FDIC insurance. If they don’t already offer this, though, then it’s likely an onerous request ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.722222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#6",
                    "likes": "4",
                    "time": "30/07/2021-00:59:59",
                    "content": "    flipflopflapdelegate:  Is there any way to Insure excess deposits? Perhaps via Lloyds TSB? And ya–more than likely most of the time they’ll exceed FDIC limits        PaperImperium:  I think this is typically done by splitting it amongst multiple banks to receive the FDIC insurance. If they don’t already offer this, though, then it’s likely an onerous request   Sorry if I wasn’t clear but this isn’t actually an issue, I just wanted to highlight why it isn’t (because I initially thought it would be). This is the important sentence:  FDIC insures deposits that are liabilities of a bank. WSFS is not serving as a bank in this structure so FDIC limits are irrelevant. As Trustee, pursuant to Delaware Trust Law, WSFS is permitted to invest cash of the Trust in overnight US government securities.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.924242424242424
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#7",
                    "likes": "7",
                    "time": "11/08/2021-17:26:07",
                    "content": "DISCLAIMER The content of this communication is for informational purposes only. You should not construe any information contained herein as legal, tax, investment, financial, or other advice. You should not rely on the information contained herein as a basis for making any business, legal or other decisions. RWA Company LLC and its members, officers, directors, owners, employees, agents, representatives, suppliers and service providers cannot be held liable for any of the information contained in this communication. Nothing contained herein constitutes a solicitation, recommendation, endorsement, or offer by RWA Company LLC or any third party service provider to buy or sell any securities or other financial instruments in any jurisdiction. THIS INFORMATION IS PRESENTED “AS IS” FROM 6S CAPITAL; RWA COMPANY LLC TAKES NO RESPONSIBILITY FOR ITS ACCURACY.  RWA Company LLC would like to further represent the following:  It has uploaded copies of the Trust Agreement, Credit Agreement, Security Agreement and Escrow Agreement to the RWA Co. website - they can be found at this link. It confirms that the execution copies of these documents perfectly match the conformed copies provided here, with the exception of the labeling of each document as “execution” or “conformed” and that the “execution” documents are in fact executed by all Parties. It is in possession of a set of legal opinion letters which outline that these documents are legally enforceable in Delaware. The legal opinion letters are signed by Delaware attorneys specializing in Delaware trust law. It is in possession of the executed copy of the transfer instructions for the broker-dealer.  While 6s Capital has made documents public whenever possible, some counterparties such as the broker-dealer and the Delaware attorneys have insisted on maintaining their confidentiality clauses in their agreements. While we always strive for transparency, there are scenarios like this where public posting simply will not be possible. We will continue to strive and work with @mrabino1 to ultimately make the contents of the agreements public, we are however able to convey the substance of the agreements and represent to their existence and execution by the relevant parties. ",
                    "links": [
                        "https://forum.makerdao.com/u/mrabino1"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.466346153846153
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "2",
                    "time": "12/08/2021-10:32:31",
                    "content": "    g_dip:  It is in possession of a set of legal opinion letters which outline that these documents are legally enforceable in Delaware. The legal opinion letters are signed by Delaware attorneys specializing in Delaware trust law.   Can this be confirmed by additional members of the community in a similar way to the broker-dealer stuff? I’m asking because I expected these to be public, and @mrabino1 has made it pretty clear to me in conversation that these are the ‘key’ part that makes all this stuff valid (at least to my still limited understanding.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.366071428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#9",
                    "likes": "5",
                    "time": "12/08/2021-13:47:12",
                    "content": "    LongForWisdom:  Can this be confirmed by additional members of the community in a similar way to the broker-dealer stuff?   Yes it will. I am in the process of starting that now.     LongForWisdom:  I expected these to be public   Me too. I am not however the author of the opinions and it is quite clear we are not allowed to make the contents public without authorization.     LongForWisdom:  made it pretty clear to me in conversation that these are the ‘key’ part that makes all this stuff valid   It is an absolute requirement for the Trustee as they must know the documents are enforceable under Law. The transaction is closed. We have all of the opinions in hand. ",
                    "links": [
                        "https://forum.makerdao.com/t/addendum-for-mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14481"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.354166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#10",
                    "likes": "4",
                    "time": "12/08/2021-16:23:01",
                    "content": "    LongForWisdom:  Can this be confirmed by additional members of the community in a similar way to the broker-dealer stuff?   Confirming here. I have seen the three legal opinions. Two opinions from Richard Layton & Finger with regards to the Security Agreement, Credit Agreement, and Trust agreement. The third opinion is from the Delaware Counsel Group for the ability for 6s Capital Partner LLC, Series A, to enter into the Security Agreement and Credit Agreement. The document outlines how the agreement is enforceable subject to conditions listed. I expect more community members to also confirm once they have view the three legal opinions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.80952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#11",
                    "likes": "5",
                    "time": "12/08/2021-20:49:50",
                    "content": "    LongForWisdom:  Can this be confirmed by additional members of the community in a similar way to the broker-dealer stuff?   I can attest to the existence of:   Two enforceability opinions from Richards Layton & Finger (https://www.rlf.com/), the first covering the Trust agreement, and the second jointly covering the Security and Credit agreements. These opinions positively confirmed enforceability of the agreements, and were both signed by the issuing firm.   An opinion from Delaware Counsel Group (https://delawarecounselgroup.com/) confirming that 6s Capital could enter into these agreements and various details that pertained to them, again signed by the issuing firm.   There are qualifications to these opinions; in particular, they are limited in scope to validity under Delaware law. To the best of my judgment, I believe these documents to be legitimate. ",
                    "links": [
                        "https://delawarecounselgroup.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.793290043290043
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#12",
                    "likes": "6",
                    "time": "12/08/2021-21:41:14",
                    "content": "    LongForWisdom:  Can this be confirmed by additional members of the community in a similar way to the broker-dealer stuff?   So, I have also seen the documents as described.  I can attest to seeing the same thing that @flipflopflapdelegate and @Kurt_Barry saw, and while I’m unqualified to comment on legal matters, the documents appeared to be legitimate and in order. My hopes for the future is that we have a more clear path for either broker-dealers or trustees to validate addresses, documents, or enforceability opinions directly on the forums (publicly) for MakerDAO.  This probably will not occur until all parties have worked with each other enough to understands the differences in paradigms.  There is bound to be some middle ground between private documents backed by reputation and trust, and what can be publicly stated for transparency.  For now, we build that relationship. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.419642857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#13",
                    "likes": "5",
                    "time": "13/08/2021-12:43:49",
                    "content": "I’ve now seen these documents as well. I can’t really attest to their origin or to the importance of the contents. But Matt showed me a set of documents that appeared to be:     g_dip:  a set of legal opinion letters which outline that these documents are legally enforceable in Delaware.   I’m encouraged that Matt is willing to share these widely. I’m hoping that @williamr and @christiancdpetersen can provide a better attestation as to the legitimacy and importance of the contents of these letters. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#14",
                    "likes": "3",
                    "time": "13/08/2021-15:21:34",
                    "content": "I saw the legal opinions this morning.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#15",
                    "likes": "3",
                    "time": "13/08/2021-15:39:24",
                    "content": "Confirming from my side literaly to this     flipflopflapdelegate:  Confirming here. I have seen the three legal opinions. Two opinions from Richard Layton & Finger with regards to the Security Agreement, Credit Agreement, and Trust agreement. The third opinion is from the Delaware Counsel Group for the ability for 6s Capital Partner LLC, Series A, to enter into the Security Agreement and Credit Agreement. The document outlines how the agreement is enforceable subject to conditions listed. I expect more community members to also confirm once they have view the three legal opinions.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.733333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maarten",
                    "index": "#16",
                    "likes": "2",
                    "time": "14/08/2021-16:00:17",
                    "content": "I confirm that I have seen the following legal opinions, signed with the name of the law firms issuing them:   a legal opinion from Richards Layton & Finger confirming enforceability of the Trust Agreement   a legal opinion from Richards Layton & Finger confirming enforceability of the Credit Agreement and the Security Agreement   a legal opinion from Delaware Counsel Group confirming corporate existence of the Borrower and valid execution of the transaction documents   Each of these opinions contains assumptions and qualifications that I consider customary for this type of legal opinions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7142857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#17",
                    "likes": "3",
                    "time": "15/08/2021-21:37:28",
                    "content": "I attest to the existence of the following legal opinions. Each of the them signed in the name of the lawfirms that issued them:  a legal opinion from Richards Layton & Finger confirming enforceability of the Trust Agreement a legal opinion from Richards Layton & Finger confirming enforceability of the Credit Agreement and the Security Agreement a legal opinion from Delaware Counsel Group confirming corporate existence of the Borrower (6s Capital LLC) and valid execution of the transaction documents  Each document contains assumptions, limitations and qualifications on the aforementioned legal opinions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#18",
                    "likes": "4",
                    "time": "15/08/2021-22:08:40",
                    "content": "I reviewed each of the opinions. I am fully satisfied as to the substance of each of the opinions. The fact that the law firm (not an individual) signed the opinion is market practice and fully acceptable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#19",
                    "likes": "4",
                    "time": "17/08/2021-01:33:13",
                    "content": "    g_dip:  In addition, 6s Capital will be contractually bound (pending the execution of an additional agreement which I will confirm here when signed) to pay RWA Company a fee of $100,000 if it revokes this power of attorney while any amounts are due to MakerDAO.   This agreement is now in place and the $100k penalty, from the perspective of RWA Co., is enforceable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#20",
                    "likes": "0",
                    "time": "18/08/2021-21:56:01",
                    "content": "Edited to remove post. I’ll post as a new topic. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                }
            ]
        }
    ]
}