{
    "poll_list": [
        {
            "title": "Should we add LEND to the Maker Protocol? - June 22, 2020",
            "index": "2529",
            "option": "No",
            "supporting_mkr": "35,509",
            "highest_fraction": 0.9
        },
        {
            "title": "Add AAVE (Aave) as a Collateral Type - December 7, 2020",
            "index": "2529",
            "option": "Yes",
            "supporting_mkr": "48,592",
            "highest_fraction": 0.93
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/lend-mip6-collateral-onboarding-aave/2529",
            "title": "[LEND] MIP6 Collateral Onboarding - AAVE ",
            "index": 2529,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "aave"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/marczeller",
                    "index": "#1",
                    "likes": "10",
                    "time": "15/05/2020-16:09:23",
                    "content": "Building Bridges with Aave Hello MakerDAO community, I’m Marc Zeller, Integration Lead at Aave long time lurker on the rocket chat under the handle @domyos and MakerDAO swag collector. I’m really glad to fill this MIP6 application for our native asset LEND on behalf of the Aave Team Aave is the upgraded rebrand of ETHLend, our main Money Market is live since Jan 2020 and we’re the second actor of our industry with total market size of more than 66M+$ at the time of writing. The LEND is fairly distributed among 163k+ addresses and our market cap is at 87M$ Our community of Holders already demonstrated their appetite for Lending services on the Aave Platform with almost 20% of our supply currently deposited on the protocol to borrow funds. Adding the LEND inside the MCD might create interesting synergies opportunities such as leveraging on a potential Stability Fee lower than DAI Borrow rate on Aave to incentivize DAI minting on over-peg periods. DAI minting from LEND in periods of low-rate DSR can also still be incentivized by the DAI deposit rates on Aave and thus contributing to stabilizing the DAI around his peg. Maker and Aave have a long history together. Our first Lending platform EthLend was one of the first integrators of the DAI and besides collaborating on many events in the past, our team are also heavy users of MakerDAO’s vaults, MKR holders, and regular users of DAI. On our protocol, DAI is a popular asset for our users, providing another way for DAI holders to earn interest on their holdings and leverage their positions. 1. Who is the interested party for this collateral application? Marc Zeller, Integration Lead at Aave on behalf of the whole Aave team. 2. Provide a brief high-level overview of the project, with a focus on the applying collateral token. Aave is a decentralized non-custodial money market protocol where users can participate as depositors or borrowers. Depositors provide liquidity to the market to earn a passive income, while borrowers are able to borrow in an overcollateralized (perpetually) or undercollateralized (Flash Loans) fashion. The LEND token is a governance token, we will shortly release our governance platform and Tokens holders will be invited to decide on protocol directions such as fees, token listing, new markets… The LEND tokenomics will be upgraded in the next few weeks to incorporate several lines of defenses to increase our protocol resilience with the concept of a Staking/insurance pool for the LEND token holders and a stablecoins backstop. 3. Provide a brief history of the project. Aave is the Upgraded revamp of the fixed-term lending platform ETHLend launched in 2017. Aave deployed a decentralized Money Market based on pooled liquidity and open-end variable and stable rates loans. Aave democratized the concept of single-transaction loans (Flash Loans) leveraging on transaction atomicity enabled by the EVM. Aave launched in early Jan 2020 and reached the 4th position of the DeFi ecosystem at a 66M$ market size. Aave vision is to be the protocol of Money Markets, the Main Market was the initial release and Aave will now launch new Markets regularly starting in the next few days with the Uniswap Market allowing the usage as collateral for loans of UNI V1 Liquidity Provider Tokens on the Uniswap Automated Market Maker protocol. 4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  Our Whitepaper Our Technical Documentation Our source Code on Github LendingPool Contract used to interact with Aave LendingPool Core, storing the protocol Available Liquidity, our “Vat” Our Risk Framework  Additionally, a map of our protocol architecture highlighting our ecosystem of contracts can be found here 5. Link any available audits of the project. Both procedural and smart contract focused audits.  Audit By Trail Of Bits Audit by Open Zeppelin  Please note that a third audit is currently ongoing with Consensys Diligence and should be released shortly. 6. Link to any active communities relating to your project. Our main Community is the Ethereum and Decentralized Finance community, we do not believe in walled gardens but in synergies with the protocols of our community, the current application being one of the many examples of this ethos. you’re invited to join our Discord server, our Telegram Channel and our Blog is a good fit to follow our protocol announcements. 7. How is the applying collateral type currently used? The LEND token is bought with the protocol fees generated by our protocol and removed from the supply by being transferred to a void address (0x0…) The LEND is also used as collateral on the AAVE protocol to borrow assets. With the upcoming release of our Aaveconomics and governance will allow LEND holders to stake the LEND tokens as one of the protocol lines of defense for the opportunity to collect protocol fees. Alongside this release, we will open our Gouvernance with a DAO model and the LEND Holders will govern the Aave protocol decisions such as New listing, Protocol fees… 8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? If my understanding of the question is correct no organization bears responsibility for the collateral on a Vault. Users bear the responsibility for their own collateral management. The company that initiated the LEND token resides in Estonia. 9. Where does exchange for the asset occur? The LEND Token is listed on the main decentralized exchanges with a quite decent volume and is also present in the Centralized exchange Binance. 10. (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. Legal Review of LEND 12. (Optional) List any possible oracle data sources for the proposed Collateral type. The Aave protocol is powered by Chainlink Oracles that proved their resilience during the Black Thursday event of march 2020 by maintaining a highly reliable service in these difficult times. 13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type. The Aave protocol has a community of third-party Liquiditators and our protocol had a nominal amount of liquidation events since the launch. I’m confident that having LEND inside the MCD will attract them to join the MakerDAO Keepers as an additional activity. ",
                    "links": [
                        "https://github.com/aave/aave-protocol/blob/master/docs/Aave_Protocol_Whitepaper_v1_0.pdf",
                        "https://docs.aave.com/developers/",
                        "https://github.com/aave/aave-protocol",
                        "https://etherscan.io/address/0x398eC7346DcD622eDc5ae82352F02bE94C62d119#code",
                        "https://etherscan.io/address/0x3dfd23A6c5E8BbcFc9581d2E864a68feb6a076d3",
                        "https://docs.aave.com/risk/",
                        "https://docs.aave.com/developers/developing-on-aave/the-protocol",
                        "https://github.com/aave/aave-protocol/blob/master/docs/ToB_aave_protocol_final_report.pdf",
                        "https://blog.openzeppelin.com/aave-protocol-audit/",
                        "https://discordapp.com/invite/AnSqnvV",
                        "https://t.me/Aavesome",
                        "https://medium.com/aave",
                        "https://gitlab.com/aave-tech/events/uploads/be4c782d5d7107dc78404562e3fdd8b8/LEND_Token_Analysis_18.05.2018_-_Aave.pdf",
                        "https://feeds.chain.link/lend-eth",
                        "https://forum.makerdao.com/t/collateral-calls-calling-all-projects/3715/8",
                        "https://forum.makerdao.com/t/maker-relay-ep-24/5534",
                        "https://forum.makerdao.com/t/weekly-mips-update-15/4243",
                        "https://forum.makerdao.com/t/agenda-discussion-collateral-onboarding-call-9-wednesday-september-23-17-00-utc/4227/2",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-9-aave-gemini-wednesday-september-23-17-00-utc/4227",
                        "https://forum.makerdao.com/t/maker-relay-ep-24-en-espanol/5574",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/17"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Interoperability and Scaleability",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.652234702234702
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#2",
                    "likes": "1",
                    "time": "17/05/2020-18:14:21",
                    "content": "Thanks @marczeller for submitting the application! I’m a big fan of Aave. One potential issue with adding this as a collateral asset, it doesn’t seem like there are many reputable exchanges offering trading pairs in LEND. I took a quick look on CMC/CoinGecko and the only CEX I recognized was Binance. Do you know of any other reputable trading venues where Maker could source price data? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.087962962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/marczeller",
                    "index": "#3",
                    "likes": "0",
                    "time": "18/05/2020-12:05:30",
                    "content": "Thanks a lot for your support @monet-supply! Our current main partner is Binance, we have a long-lasting successful relationship with them and we’re supporting the BUSD centralized stablecoin based on Paxos architecture. Our current main focus is to develop and grow Decentralized finance, we believe that with increased arbitrage opportunities powered by flashloans, new actors in the Automated Market Maker industry such as Balancer and dex aggregators such as 1inch and paraswap it’ll be increasingly seamless to swaps assets with minimal friction and slippage onchain. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.716540404040405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/marczeller",
                    "index": "#4",
                    "likes": "1",
                    "time": "11/06/2020-09:50:17",
                    "content": "well @monet-supply seems that having LEND on Coinbase might become an option soon    Medium – 11 Jun 20    Coinbase continues to explore support for new digital assets We are continuing to explore the addition of new assets for customers around the world. Reading time: 2 min read       ",
                    "links": [
                        "https://blog.coinbase.com/coinbase-continues-to-explore-support-for-new-digital-assets-2c5b84813fcf",
                        "https://forum.makerdao.com/t/weekly-mips-update-6/2914",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-june-18-9am-pst-4-00-pm-utc/2814/6"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.454545454545454
                },
                {
                    "author_link": "https://forum.makerdao.com/u/marczeller",
                    "index": "#5",
                    "likes": "7",
                    "time": "21/07/2020-16:15:18",
                    "content": "Hello Maker community, It seems that MakerDAO is currently considering LEND as a collateral on MCD. We have to inform the community that LEND will do a token migration to become AAVE in near future. We kindly ask the community to postpone consideration to a later MIP batch and consider AAVE instead at the End of summer/Sep. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.699999999999999
                }
            ]
        }
    ],
    "group_index": "2353"
}