{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/are-we-trying-to-peg-dai-to-usd-or-to-usdc/3276",
            "title": "Are we trying to peg DAI to USD or to USDC? ",
            "index": 3276,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rileyjt",
                    "index": "#1",
                    "likes": "1",
                    "time": "20/07/2020-18:08:37",
                    "content": "And a follow up question - in your mind, is there any difference in value between USD and USDC? Same question can be extended to other stable coins of course, but we seem to be focused on Circles’ as the standard right now. Some food for thought - most of the solutions to restore the peg involve weakening DAI in some way. Increasing the amount of custodial risk Maker is taking on, lowering collateral requirements, weakening liquidation processes, etc. I think these are all the wrong approach and will end up hurting DAI in the long run by making it less appealing. The biggest issue we face IMO is that a decentralized, fungible USD bearer asset is more valuable than a centralized, custodial, censurable USD asset. And to make matters “worse”, I truly believe that as the cryto ecosystem grows and is used more widely and by entities outside the US jurisdiction, this gap in value will get larger. While this is a great problem to have, it is fundamentally at odds with the goal of trying to make DAI == USDC. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.545014880952381
                }
            ]
        }
    ]
}