{
    "poll_list": [
        {
            "title": "Ratify the Interim Risk Team Mandate",
            "index": "282",
            "option": "Yes",
            "supporting_mkr": "40,109",
            "highest_fraction": 1.0
        },
        {
            "title": "Ratify the Interim Oracle Team Mandate",
            "index": "443",
            "option": "Yes",
            "supporting_mkr": "35,845",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mandate-oracle-teams/443",
            "title": "Mandate: Oracle Teams ",
            "index": 443,
            "category": [
                "Governance"
            ],
            "tags": [
                "oracles",
                "interim-structure",
                "dao-structure"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#1",
                    "likes": "8",
                    "time": "12/09/2019-21:25:03",
                    "content": "Oracle Team Mandate Introduction The Maker Foundation is proposing a new role, the Oracle Team, which is responsible for the technical development and administration of the Oracles infrastructure. This role will follow the same ‘interim’ model shared by other foundation teams and is designed to, eventually, be entirely community-driven. As this document represents a formalization of the role he already occupies on behalf of the community, the Foundation is proposing that Niklas Kunkel, Head of Backend Services, occupy the Oracle Team role in an interim capacity. After a period of two weeks (set aside for debate and iteration on this framework) the community will have the opportunity to formally choose to accept or reject the proposal in a governance poll. Acceptance of the proposal will signal the ratification of the new role and the outlined responsibilities, as well as the person chosen to exercise its mandate. The Need for an Oracle Team Oracles are a critical component of the Maker Protocol. They provide pricing data that determines the amount of Dai that can be drawn against a collateral asset, as well as when an outstanding position is in need of liquidation. Oracles are a live, dynamic infrastructure that presents a unique set of challenges. The Oracle infrastructure needs to be constantly maintained and updated to fix security vulnerabilities. Additional work needs to be done to optimize inefficiencies, support new asset types, support new price sources, incorporate emerging technologies, improve monitoring tools, increase decentralization, increase resilience, and decrease costs. Due to the broad scope of MKR governance’s other responsibilities and the constant attention required by Oracles, the MKR governance community needs a delegated party to handle these responsibilities on their behalf. A subject matter expert in a facilitator-like role is needed to aid the MKR governance community in their decision-making with respect to Oracles and to then implement those solutions. Defining the Role & Responsibilities Like the other major governance-related roles, such as the Interim Risk Team and the Interim Governance Facilitator, the Oracle Team is empowered by the community to perform tasks on behalf of the community. However, the Oracle Team does not have the power to make unilateral decisions. Ultimately, major decisions are crafted into proposals requiring ratification by MKR Governance. Oracle Liaison to MKR Governance The Oracle Team serves as the intermediary between the MKR governance community and the Oracle ecosystem. The Oracle Team must attend the Governance calls and give regular updates with respect to Oracles as well as bring up relevant items for discussion to the community. Oracle Liaison to Partners & Customers The Oracle Team is authorized to act as a point of contact for partners and customers to coordinate initial discussions and programs. This allows the MKR governance community to leverage the networks and relationships of the Oracle Team. The Oracle Team must have the deep technical knowledge of the Oracle stack required to guide partners and customers through the services offered and assist with integration planning. The Oracle Team is permitted to discuss sensitive topics with partners that are not appropriate in the public domain such as when a partner requires an NDA or is pursuing a private pilot. An example of this is the Oracle Team approaching and creating a preliminary agreement with the first wave of DeFi Feed partners (Set, dYdX, Gnosis, and 0x), prior to the proposal being released to the community for endorsement. The intention here is not to sidestep MKR governance, but rather to have it act as a backstop through the proposal process. A good analogy of this is the United State where the executive branch has the ability to negotiate treaties, but they must be approved by the Senate. Ultimately, any substantive changes to the Oracle infrastructure or agreement to offer Oracle price services must be crafted into a proposal and presented to the MKR governance community for subsequent review and ratification. Iterate and improve upon the Oracle Governance Framework The Oracle Governance Framework (“OGF”) serves as the blueprint for the governance processes surrounding the administration of Oracles. As governance is still in its infancy, the OGF will be iterated and improved upon over time. Processes that are found to be lacking should be revamped. New processes to deal with unforeseen circumstances should be appended. All changes must be approved by the MKR governance community. It is the responsibility of the Oracle Team to work with the community to nurture this evolution. Iterate and improve upon the Oracle Team Mandate Much like the OGF, the Oracle Team Mandate (“OTM”) is a live document meant to be iterated on over time. New circumstances may arise that require the Oracle Team to take on new responsibilities not described in the OTM. Existing responsibilities may be removed or delegated to newly created roles. In such cases, changes to the OTM must be crafted into a proposal and ratified by the MKR governance community. Research and Development The Oracle infrastructure will need to be continuously updated and maintained to keep up with emerging technologies, security best-practices, new data types, new asset types, and general improvements to the protocol. It is the responsibility of the Oracle Team to conduct research, plan features, and implement deliverables. Communicate and Schedule the Roadmap A roadmap detailing technical development and product development goals needs to be presented to the community by the Oracle Team and approved by MKR governance. Approval of the roadmap indirectly signals approval for all items contained within the roadmap. Progress of items on the roadmap will be presented by the Oracle Team on the governance calls. Administrate Oracle Infrastructure One of the major responsibilities of the Oracle Team is to manage the Oracle operations and infrastructure. These administrative duties include but are not limited to:  deploy Oracle smart contracts when upgrades are necessary deploy Oracle smart contracts when new assets are added assist Feeds to deploy their clients assist Feeds to upgrade their clients notify Feeds to upgrade their clients notify Feeds when they go offline notify Feeds if they appear to be compromised distribute the Feed Stipend (temporary until governance takes over paying Feeds) create best practices for security, fail-over mechanisms, monitoring.  Coordinate with other Ratified Teams The Oracle Team will need to work closely with other ratified teams to coordinate cross-disciplinary collaboration. For example, the Oracle Team will have to work closely with Risk Teams for evaluating asset price sources, asset price models, and coming up with an appropriate oracle risk-compensation model. Integrate New Asset Price Sources As new prices sources emerge, they will need to be evaluated by the Risk Team(s) and integrated into the Oracle infrastructure. This could be from new exchanges entering the ecosystem, an asset getting listed on an exchange, or from new exotic asset classes having unique methods for polling their price. It is the responsibility of the Oracle Team to implement the solutions recommended by the Risk Team(s). This could range from new exchanges entering the ecosystem, assets getting listed on new exchanges, to new asset classes having unique avenues for sourcing their prices. Create Asset Price Model The Oracle Team will work closely with the Risk Team(s) to research and develop models to consume sourced pricing data to calculate canonical asset prices. This might include filtering out outliers, weighting sources by volume, weighting Feeds by reputation, time-segmentation, and other methods not listed here. These models would need to be approved by MKR governance before being instantiated. Create and Maintain a Sustainable Feed Incentives Model It is imperative that the Oracles are fundamentally decentralized as they are a core module of the Maker Protocol. This ultimately means they are controlled through distributed governance and architected with a balanced incentive system to make them resilient and self-sustainable. Currently, the set of incentives is skewed. Feeds are compensated for the valuable service they provide, to cover their infrastructure costs, and to discourage malicious behavior. As the Maker Protocol scales the incentives for bad behavior will continue to grow, and it will be necessary to increase compensation on a risk-adjusted basis. Technology improvements such as Feed staking, optimized price models, and the Oracle Security Module can help keep costs in check but are only one piece of the puzzle. The second piece of the puzzle is to monetize the Oracle service by selling it to external customers through a whitelisting mechanism. In this manner, MKR governance can recoup Feed compensation costs or, at the very least, subsidize those costs. It is the responsibility of the Oracle Team to develop technology and monetization models which help reduce net expenditures for MKR token holders. Create a Product Strategy With Oracles becoming monetized, there needs to be a clear product strategy on how best to scale the system to reduce risk, reduce costs, and acquire customers. Management of the Official Oracle Communications Channels The Oracle Team is responsible for acting as the intermediary between the Feeds and governance. This includes the administration of a private pseudonymous chat containing only Feeds. Communication on this chat by the Oracle Team is multi-faceted encompassing many of the responsibilities listed in the “Administrate Oracle Infrastructure” section including:  assist Feeds to deploy their clients assist Feeds to upgrade their clients notify Feeds to upgrade their clients notify Feeds when they go offline notify Feeds if they appear to be compromised notify Feeds of an emergency situation facilitate knowledge sharing of best-practices  Create Emergency Processes Establish processes to follow during an emergency. Example of emergency processes include what to do during an Oracle attack. Another is the proper procedure to follow if a token forks or is upgraded. The Oracle Team is responsible for working closely with other MKR governance teams to come up with formal synergistic emergency plans, but their scope is limited to the Oracles themselves. Onboarding/Offboarding Oracle Teams This will be specified in the Oracle Governance Framework. Compensation As Niklas Kunkel is already being compensated by the Maker Foundation, there is currently no formal compensation tied to the Oracle Team role. In the future governance may want to revise this mandate to append compensation in order to attract and incentivize external Oracle Teams. Conclusion If this mandate is accepted by the community, it will signal its support for the new Oracle Team Role and Niklas Kunkel as the first Oracle Team. This mandate should be considered a living document and will be updated based on community feedback. ",
                    "links": [
                        "https://forum.makerdao.com/t/x-post-oracle-team-mandate/444",
                        "https://forum.makerdao.com/t/proposal-btcusd-oracle-set-protocol-dydx/2011",
                        "https://forum.makerdao.com/t/proposal-ethbtc-oracle-tbtc/2010",
                        "https://forum.makerdao.com/t/mip7-onboarding-and-offboarding-domain-teams-for-collateral-onboarding/1909",
                        "https://forum.makerdao.com/t/proposal-whitelist-set-protocol-on-ethusd-oracle/2013",
                        "https://forum.makerdao.com/t/the-maker-foundation-s-vision-of-a-self-sustaining-makerdao-initiation-of-maker-improvement-proposals-mips-framework/1882",
                        "https://forum.makerdao.com/t/mip7-en-espanol/4772"
                    ],
                    "GPT-summary": "The Maker Foundation is proposing a new role, the Oracle Team, which is responsible for the technical development and administration of the Oracles infrastructure. The proposal outlines the responsibilities of the Oracle Team, including managing the Oracle operations and infrastructure, coordinating with other ratified teams, and creating and maintaining a sustainable Feed Incentives Model. The proposal also emphasizes the need for an Oracle Team due to the critical role Oracles play in the Maker Protocol. The community will have the opportunity to formally choose to accept or reject the proposal in a governance poll after a period of two weeks.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Change to proposal pipeline"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.436241341991343
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kwadrax",
                    "index": "#2",
                    "likes": "2",
                    "time": "13/09/2019-11:33:59",
                    "content": "It’s great to hear from you Niklas and the role was very well layed out by you during the Governance and Risk call Ep. 51. I’m wondering what ratifying this mandate means when it comes to specific people. @Mariano_Conti has been the public “oracle guy” from Maker until now and so my question is, does this team include Mariano and/or other people? In short, do we ratify you as “head” of the first Oracle team and do you then manage who is part of that team specifically or how do we need to interpret this mandate? I guess you could broaden this question to the Risk team mandate also really. Do we mandate the “heads” of teams and do we have any say in who actually becomes/remains part of these teams. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.736111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#3",
                    "likes": "1",
                    "time": "13/09/2019-18:25:21",
                    "content": "Great question @kwadrax @Mariano_Conti is very much still involved in Oracles. I mentioned on the governance call yesterday that he built the smart contracts for Oracles V2 and we continue to confer with each other on technical and  product strategy. My team (the Backend Services Team) also has a number of other individuals who will be working on Oracles as one of their responsibilities. The way I think about this is that governance delegates me as the “head” of an Oracle Team in that I’ll be the representative to governance and to partners. I then get together all the people I need to execute on the responsibilities in the mandate pulling on the resources that I have available. You can imagine in the future when we have external Oracle Teams that they would approach the governance community with a roadmap and a budget proposal and then go out and construct their team to fit within that budget. For my particular case, the budget part doesn’t really apply to me as my team and I get compensated by the Foundation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party giving information about team structure",
                        "3rd party giving positive feedback on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.912896825396825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kwadrax",
                    "index": "#4",
                    "likes": "0",
                    "time": "13/09/2019-19:25:16",
                    "content": "OK, thanks for clarifying. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#5",
                    "likes": "4",
                    "time": "14/09/2019-12:41:58",
                    "content": "I think for the interim teams, we can be a little more loose in terms of having the governance community strictly defining who’s on the team, their roles and things like potential conflict of interest etc. since the Foundation provides the funding, and thus also helps with the oversight during the interim stage. So defining a DAO team only based on the representative of that team makes sense (Rich for Facilitation, Cyrus for Risk, Nik for Oracles etc). But once we start to elect the first real, long term, DAO teams where Maker is compensating them directly, there needs to be rigorous transparency in terms of exactly who’s involved, their roles, responsibilites and background. This way it can be properly vetted that the output and work the DAO team provides is commensurate with the funding that Maker is providing, and most importantly to minimize the risk of corruption and collusion related to DAO teams. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.945192307692308
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#6",
                    "likes": "0",
                    "time": "16/09/2019-23:16:16",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#7",
                    "likes": "1",
                    "time": "30/09/2019-20:37:55",
                    "content": "The Oracle Team Mandate proposal has been submitted to the Governance Portal for a Polling Vote. Please vote for the proposal here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#8",
                    "likes": "0",
                    "time": "24/12/2019-23:04:48",
                    "content": "    NikKunkel:  The Oracle Team Mandate proposal has been submitted to the Governance Portal for a Polling Vote. Please vote for the proposal here .   Dead link. Page not found . ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#9",
                    "likes": "2",
                    "time": "12/01/2020-03:55:35",
                    "content": "Link looks fine to me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#10",
                    "likes": "0",
                    "time": "12/01/2020-22:41:44",
                    "content": "Yes @NikKunkel , It’s back… Maybe i needed an update. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mandate-risk-teams/282",
            "title": "Mandate: Risk Teams ",
            "index": 282,
            "category": [
                "Governance"
            ],
            "tags": [
                "proposal",
                "interim-structure",
                "dao-structure"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#1",
                    "likes": "10",
                    "time": "20/08/2019-15:40:35",
                    "content": "Mandate: Risk Team Introduction Risk teams are ecosystem participants responsible for managing the various risks in the Dai Credit System. They are tasked with managing the collateral portfolio and recommending appropriate monetary policy while adhering to the principles of scientific governance. Due to the decentralized nature of MakerDAO, there are a number of considerations the community should discuss surrounding the onboarding and management of risk teams. The Maker Foundation is proposing an operational framework intended to guide both MKR token holders and risk teams through the governance process. After a period of one week, (set aside for debate and iteration), the community will have the opportunity to formally choose to accept or reject this proposition in a governance poll. Acceptance of the proposal will signal the ratification of this mandate and the associated processes and procedures. Examining the Landscape The need for risk teams is best understood following an analysis of the core components of the Dai Credit System. We begin with a brief recap and the risks contained within. MakerDAO is an Ethereum-based DAO that operates the Dai Credit System, a permissionless loan facility. The Dai Credit System issues the cryptocurrency Dai, a stablecoin designed to track $1 USD with low volatility. The core function allows users to self-issue Dai-denominated loans against collateral deposited into smart contract-based escrow. Collateral can be retrieved upon repayment of the outstanding Dai amount plus an associated Stability Fee. This architecture poses two pressing concerns. Where does Dai source its value, and what compels it to remain pegged to USD? The answers to these two questions are the focal points of most risk analysis surrounding Dai. To better understand these risks we briefly explore Maker’s internal mechanics. Dai stability is dependent on a system of carefully crafted incentives. At the core is the collateral portfolio, a pool of on-chain digital assets that back the Dai supply. While the collateral presents a source of value, additional heuristics are required to maintain a soft peg of $1. In particular, the Dai Credit System incentivizes arbitrageurs to buy and sell Dai in the open marketplace. This arbitrage is supported by monetary policy adjustments that influence the supply and demand for Dai recursively until Dai has returned back to its target price. Market makers have come to rely on these Stability Fee changes, and as a result supply the necessary liquidity to minimize outsized deviations. In extreme events, 1 Dai can be redeemed for $1 worth of collateral through a process known as Emergency Shutdown. However, collateral values can sometimes fluctuate dramatically. If they were to suffer a sharp decline in value, the settlement feature enabled by Emergency Shutdown may not allow for full redemption. As a last line of defense against volatile asset prices, a buffer in the form of MKR tokens exists to soak up undercollateralized Dai. The distributed set of MKR token holders (“MTH”) are ultimately the group motivated to ensure the successful operation of the Dai Credit System. MKR token holders coordinate themselves using a decentralized governance process through which they evaluate and select appropriate collateral assets. The success of this endeavor is strongly correlated to a proficient risk evaluation of the collateral set. A failure in due diligence or coordination will result in severe losses for both end users of the protocol (in the form of declining Dai price) as well as MTH (in the form of MKR dilution). While the incentives for MTH are clear, executing the plan requires additional work. The Need for Risk Teams There is considerable overhead with respect to quantifying risk in the Dai Credit System and managing it appropriately. It is not practical (nor necessarily advisable) for MTH to directly analyze it themselves. A simple and intuitive solution is to outsource risk specialists who are tasked with evaluation of the risks. While the traditional model of a centralized risk function could operate as a bootstrapping mechanism, we also propose a more robust and decentralized blueprint. The primary idea is to create the Decentralized Risk Function, a process by which distributed teams of independent risk specialists are incentivized to exercise due diligence on the collateral portfolio and create models for appropriate monetary policy. The decentralized model affords us a near limitless talent pool, blanket coverage, and uninterrupted operation. Additionally, decentralized risk teams are designed to be resistant to capture from biased ecosystem actors; risk teams operate solely for the benefit of MTH. Through the governance process, the MTH are responsible for managing the operational aspects of Maker risk teams. Here we propose a set of guidelines for MTH through which they may oversee risk teams. Immediately, there are several operational details that need to be addressed:  What are the types of risk that need to be managed? Are there different types of risk teams? How does one ‘become’ a risk team? How do they create and submit risk models? How are they compensated?  Types of Risk There are three broad classifications of risk in the Dai Credit System: collateral risk, monetary policy risk, and exogenous risks. Collateral Risk Collateral risk refers to the likelihood of an event where a sudden asset price decline triggers the liquidation of a Collateralized Debt Position (CDP). As mentioned above, the primary assurance for Dai holders is the collateral portfolio. Naturally, a comprehensive understanding of all collateral assets is a prerequisite for proper risk management. Qualitative factors, market liquidity, and recourse methodologies are all in scope and must be carefully analyzed. As a simple example, because illiquid or fundamentally risky assets have a higher predisposition to sudden crashes, a proportionately higher risk premium must be assessed. Monetary Policy Risk Monetary policy presents the second major risk classification, refers to managing the supply and demand for Dai. In spite of the quality of the collateral evaluation, the Dai price is still subject to the whims of the market as CDP creators (generators of Dai supply) may not perfectly align with Dai holders (representing Dai demand). Risk levers such as the Stability Fee and Dai Savings Rate can be used to influence both CDP and Dai holder behavior in order to facilitate a market equilibrium at $1. Because the supply and demand for Dai fluctuates based on a variety of market factors, creating an accurate model requires a sound understanding of economics, statistics, market psychology, and more. For example, in Single-Collateral Dai there is clearly a relationship between the ether price and the Dai price. Analyzing this correlation in order to make optimal policy recommendations is an important function of decentralized governance. Exogenous Risks Finally, exogenous risk refers to a spate of additional risks, among them oracles, governance, and more. Oracle attacks, or the presumed susceptibility of the collateral price feeds, must be well understood. For example, to what extent can an attacker siphon value from the system if they were to subvert the price feeds? What would the appropriate countermeasures be in such a scenario? Another type of exogenous risk is threats to the governance process. Social attacks or improper procedures might necessitate an Emergency Shutdown to preserve the legitimacy of MakerDAO. Types of Risk Teams Not all risk teams will undertake the same duties and job functions. Because different analysts will have distinct specialties and skills, it is helpful to categorize them accordingly. However, it is our assumption that a rich ecosystem of specialized risk teams will develop over time and when needed. For now, we define the broadest types of risk teams that will work for the DAO. Over time, as the needs for risk assessment become more specialized, we can expect to see additional roles. Submitting Risk Teams Submitting risk teams are the most fundamental class of risk teams. They are in charge of computing and submitting risk parameters to the governance process. The most basic responsibility is to evaluate specific assets or sectors. For example, experts in the cryptocurrency space will examine coins such as bitcoin or ether, whereas traditional risk analysts might find the Security Tokens space more suitable. The goal is to provide an examination of the risks for including a collateral asset into the portfolio. A sub-class of risk teams might be generalists who are in charge of tying together the various collateral types in a cohesive portfolio. One of the primary responsibilities is to factor in proper correlation coefficients, a task they will likely collaborate on with the other teams. A second critical role is to factor in the appropriate monetary policy. Submitting risk teams will be in charge of suggesting appropriate DSR values, as well as any collateral-specific adjustments that might be required. After construction of the collateral portfolio with the appropriate monetary policy parameters, they can then submit the final package to the governance cycle. Oracle Teams Oracle Teams are in charge of developing and distributing oracle backend software, as well as emergency oracle programs. For example, when new collateral assets are added, they must be accompanied with a corresponding price oracle. An Oracle Team is in charge of facilitating the inclusion of that oracle. Lastly, an Oracle Team may oversee the productization of any oracle services. Looking Ahead In the future, we can expect to see several other classes of risk teams. Supporting risk teams may just work on research or data science, without seeing a model through to the calculation of risk parameters. Blockchain Development Teams might work on upgrading MakerDAO infrastructure. Technical specialists are also likely to find a niche in the ecosystem. The community should slowly increase the scope of risk teams as the Dai Credit System matures. Risk Constructs When a risk team is ready to begin work on a risk model, we expect that they adhere to a standardized set of rules. By following strict guidelines in terms of how a risk assessment is conducted, MTH can more easily vet the legitimacy of the process. In this section we propose some principles that every risk model should abide by, along with a description of a sample model. Collectively, this package is known as a risk construct. Scientific Governance The guiding principle for all risk constructs is the notion of scientific risk governance, a process by which all risk parameter suggestions are supported by appropriate financial models and data analytics. We propose a set of principles or qualities that scientific risk constructs should comprise.  Comprehensive A risk construct should be exhaustive such that all relevant classifications of risk are considered and reviewed. A risk team must delve into the fundamentals of the organization, consider the value proposition of the collateral, and evaluate any potential risks. In the context of monetary policy, appropriate models must be applied that harmonize the exogenous factors impacting the Dai price. Scientific A risk team must be rigorous and scientific in its methodologies. While subjective reasoning can often be an unavoidable part of a risk evaluation, general models should be designed to guide a risk team towards being as objective as possible. Standardization A standardized template adhered to by all risk teams allows MTH to review a diverse set of due diligence reports that can easily be compared with one another. The goal is to eliminate any potential oversights or unintentional biases by individual risk teams such that the MTH are left with only an objective evaluation of the collateral. Reproducible Critically, a model must be reproducible in nature. This entails making data and code publicly available. Third party auditors should be able to independently run the model on a publicly-sourced data set and arrive at the same conclusions as the risk team. A scenario in which MTH cannot verify the legitimacy of a particular risk team’s risk parameters jeopardizes the integrity of the Dai Credit System.  With the scientific governance principles squarely in place, a risk team may continue on towards an operational risk assessment of the proposed collateral type or monetary policy. The composition of a risk construct should contain at a minimum the following: data set, general model, and applied model. Data Set Risk teams should use a transparent and auditable data set for the purposes of risk models. The source of the data should be clear. The data set should also be hosted somewhere that it can be downloaded by independent risk analysts. For example, trading data used for liquidity analysis should be included as part of the risk construct. Additionally, any transformations made to the data (such as wash trade filtering or any other types of averages) should be specified. General Model The general model is a representation of how a risk team intends to evaluate an asset or other part of the risk function. For example, proposed valuation models, heuristics, and fundamental analysis should be described in detail. Cryptoasset evaluations would require generalized frameworks on how to value various classes of tokens. DSR formulas should be accompanied with detailed and annotated statistical models. The general model at the core should contain three parts:  A framework for fundamental analysis or due diligence. How does one go about evaluating a cryptoasset’s fundamentals? How does one think about DSR changes? The ideas and models behind a risk team’s line of thinking should be described. A scoring framework for collateral assets that enables a standardized approach for converting qualitative analysis into numerical outputs. This is achieved through a ratings-based methodology. A quantitative model that describes the process for computing risk parameters such as the Stability Fee, Liquidation Ratio, DSR, etc. What types of financial models are used? What are their tradeoffs?  MTH are limited in the number of collateral types they may process in a given time period. The general model can help determine which assets should be given priority as approved assets make their way into the collateral pool. The general model acts as a natural filtration mechanism where collateral types are ranked against one another for prioritization purposes. Applied Model The applied model should be a specific implementation of the general model. For example, if a risk team wishes to evaluate ether they would apply the principles and evaluation framework presented in their general model. The final risk model should, in some regards, operate on rails. A valid data set in conjunction with a risk analysis framework presented in the general model should result in a deterministic set of risk parameters. One key consequence of this process is that governance would debate only the validity and strength of the underlying general model (and associated data set), but not the output. If a particular model results in risk parameters that are deemed undesirable after the fact, they cannot be changed arbitrarily. Instead, governance must revisit the general model and debate whether or not it is of sufficient quality, and discuss why it was allowed to be ratified in the first place. It is imperative that general models not be changed after being voted in. Deliberately ignoring key aspects of the general model would result in a failure of the governance process. It is important to stress that the role of a risk team is to merely provide suggestions for risk parameters. Ultimately, MTH are the ones who vote in parameters that constitute the Dai Credit System. They are the group solely responsible for governing the Dai Credit System. Onboarding Risk Teams The final section of this document surrounds the onboarding and management of risk teams themselves, along with the process by which they submit risk constructs. Due to the decentralized nature of MakerDAO, it can be surprisingly difficult to foster an efficient process for handling risk teams. A number of edge cases must be considered before pushing forward. Therefore we suggest a number of operational constraints designed to protect against potential governance attacks on the ecosystem. Application Qualified risk analysts who wish to contribute to the Decentralized Risk Function should follow an application process in order to become an official risk team. A candidate risk team would begin by publicly posting credentials to the MakerDAO Forum, resembling a formal engagement process. For example, prior experience, team members, and other qualifications should be surfaced here. In conjunction with the credentials, a candidate risk team should provide a detailed proposal outlining the type of risk work they would like to do. This General Proposal (GP) might outline a risk construct for ether or a new methodology for calculating the DSR. It is expected that the GP would include a desired compensation amount, similar to a contractor agreement. Bootstrapping the Application Review Due to potential overhead and friction involved with a candidate risk team negotiating terms with a decentralized organization, the Maker Foundation will help bootstrap the process by dealing directly with risk teams. The Maker Foundation will review General Proposals and also compensate these teams directly. This bootstrapping phase is intended to facilitate the growth of risk teams until a robust decentralized framework for proposal review and Stability Fee compensation can be put into place. We strongly recommend the community begin exploring operational frameworks for how they might like to see this process evolve. Long Term Vision We can also opine on what the longer term vision might look like. Upon submission of a General Proposal, MTH, in their governance capacity, will then have the opportunity to review them as part of its regular governance cycle. If a GP is approved, a risk team may then begin work on the risk construct. One of the edge cases to keep in mind is a risk team trying to immediately push through new risk parameters that have not undergone sufficient review by the community. To this end, we propose a concept of ‘lead times.’ Lead times are essentially delay functions that should be respected before a risk team may progress through the governance cycle. After a GP has been approved, we suggest that a minimum of one month to pass before a candidate risk team submits their general model to the community. At this point, the community should review and give feedback on the general model. We recommend an additional one month of discussion (and iteration) on the general model prior to submitting the final risk construct into the governance cycle. The length of the lead time need not be a fully rigid framework. The community can decide if special circumstances allow for standard convention to be suspended. However, the risk that a proposal hasn’t had enough time for consideration needs to always be taken into account. It is not difficult to envision potential governance attacks from malicious attackers trying to rapidly push through risk constructs. Approval When a risk construct is approved by MTH, it can be said that the risk team has also been approved. Additional risk constructs submitted by the risk team may potentially flow through the governance cycle faster, especially if they fall under the same general model. Risk constructs based on an entirely new general model should begin the approval process from the start. At the inception of Multi-Collateral Dai, the Interim Risk Team will post a risk construct for the initial collateral set. Approval of this risk construct will officially ratify the Interim Risk Team. Conclusion Many details for this coordination process will likely emerge organically over time as the governance process improves. As the risk community expands, a number of questions should be explored as we iterate this framework:  Performance review is an important aspect of risk team management. How can the community facilitate this process? A risk team will likely build up a reputation based on their performance, and stronger risk teams will naturally have greater influence in the parameter selection process. Should this be a formalized process with rating points? What privileges do highly ranked risk teams have? How can we design decentralized review and compensation framework for candidate risk teams?  If this mandate is accepted by the community, it will signal its support for the general scope of the initiatives outlined. This mandate should be considered a living document and will be updated based on community feedback. ",
                    "links": [
                        "https://forum.makerdao.com/t/soft-locks-and-future-guidance-a-pre-mip-discussion/2875/11",
                        "https://forum.makerdao.com/t/short-take-exciting-news-and-opportunity-for-rwa-teams/16849",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-september-5-9am-pst-4-00-pm-utc/371/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-august-29-9am-pst-4-00-pm-utc/323/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-august-22-9am-pst-4-00-pm-utc/292/2",
                        "https://forum.makerdao.com/t/the-maker-foundation-s-vision-of-a-self-sustaining-makerdao-initiation-of-maker-improvement-proposals-mips-framework/1882",
                        "https://forum.makerdao.com/t/mip40c3-sp61-modify-core-unit-budget-real-world-finance-rwf-001/13152",
                        "https://forum.makerdao.com/t/mip41c4-spx-facilitator-onboarding-rwf-001/11308/3"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.503807991418611
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#2",
                    "likes": "0",
                    "time": "20/08/2019-16:00:53",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "1",
                    "time": "20/08/2019-19:01:44",
                    "content": "Most qualified people that can provide Risk Management are experience in analyzing centralized drivers of risk, how do we attract talent that has not been involved with the community/MTH, or is not familiar/experience with the cryptocurrency space? What are the methods we can use to attract outside talent–will the driver be based on compensation? Will any of the Risk Teams involve/cover scenario-based strategic planning? In other words, measuring risk/exposure and the planning in case of a black swan event–or is that irrelevant since we have the Emergency Shutdown in place? Otherwise, great work–fantastic write up, thank you for taking time-out to do such. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.363095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#4",
                    "likes": "1",
                    "time": "20/08/2019-21:31:25",
                    "content": "    cyrus:  Due to potential overhead and friction involved with a candidate risk team negotiating terms with a decentralized organization, the Maker Foundation will help bootstrap the process by dealing directly with risk teams. The Maker Foundation will review General Proposals and also compensate these teams directly.   Just want to make sure the foundation adheres to transparency. Having the clearest possible view of how the foundation goes about this will be super helpful for the DAO going foreword. I’m down with everything else. I would of liked stronger statements concerning the social components of risk and governance, but its fine for now. That discussion is just starting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.712606837606837
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "3",
                    "time": "22/08/2019-10:15:40",
                    "content": "Tl;dr - This is a great document, I have only minor comments and quibbles. I still strongly disagree with the presentation of these proposals and the timeline.  Actual Document Feedback @ cyrus     cyrus:  Instead, governance must revisit the general model and debate whether or not it is of sufficient quality, and discuss why it was allowed to be ratified in the first place. It is imperative that general models not be changed after being voted in.   These two sentences would seem to contradict each other. We can revisit and debate the general model, but we can’t change it? There doesn’t seem to be much benefit to debating its quality if it can’t be changed. I don’t feel there is enough explanation here as to why it is imperative the general model remain unchanged. I feel like I’m missing something. We can’t selectively ignore/modify the output for specific collateral types: fine, all good, makes sense. But if there is an output we dislike and we can’t change it specifically and we can’t change the generalised risk construct, what is the process for going from a output we are not willing to vote into the system to an output we are willing to vote into the system? Is it that we can’t change a general model, but we can replace it?      cyrus:  It is important to stress that the role of a risk team is to merely provide suggestions for risk parameters. Ultimately, MTH are the ones who vote in parameters that constitute the Dai Credit System. They are the group solely responsible for governing the Dai Credit System.   I disagree that there is no responsibility on the Risk Teams here. They are the experts in the area, whereas MTH are the generalists that need to judge provided arguments and models as best as they can. The Risk Teams are providing suggestions that the MTH’s will not understand as fully as the Risk Teams do. Responsibility is shared. If a general model provides outputs that eventually lead to MKR dilution, it don’t think it’s valid to put the responsibility for that entirely on MTH.      cyrus:  This bootstrapping phase is intended to facilitate the growth of risk teams until a robust decentralised framework for proposal review and Stability Fee compensation can be put into place. We strongly recommend the community begin exploring operational frameworks for how they might like to see this process evolve.   Ahhh! There are so many things for us to figure out.   Bitching about the timeline (again) @ anyone who will listen     cyrus:  After a period of one week, (set aside for debate and iteration), the community will have the opportunity to formally choose to accept or reject this proposition in a governance poll.   Formally protesting this timeline (again.) This is an excellent document, and bar a few minor questions and quibbles, I support it. I honestly don’t think it will take more than a week to debate it. But what if it wasn’t this good? One week is not enough time to turn something unacceptable into something acceptable. If you are willing to answer, Cyrus, I’m curious to know how long it took you to put this together and get consensus within the Foundation on the contents (not for any nefarious reason, it just feels like more than a weeks effort has gone into this document, either that or you have god-tier document generation skillz.) I would be happier about this if the Foundation just came out and said: ‘We’ve spent ‘x’ time working on this, we think it’s great. We don’t think it requires a lot of debate but we’re open to minor changes and we’re willing to delay if there are major objections. We’d like you to ratify it in one week.’ That would feel more honest. My dissatisfaction about the process comes from the implication that the community has time to agree on material changes to this document in one week. I would bet that most interested parties are going to have time to look at it once, and maybe put forward one round of feedback. That process needs to be iterative to actually get results and that takes time.     cyrus:  This mandate should be considered a living document and will be updated based on community feedback.   It’s alive for a week. What if you get conflicting feedback, do you implement it or do you ignore it? Ultimately it is still you (the Foundation) that is making that decision (implement/ignore). I don’t disagree that you should be doing this, we aren’t ready to take the responsibility yet. Just please don’t imply that it is more than what it is. If the timeline is not as fixed as it appears, could you make that clear? Something like ‘Barring significant objection by the community, we will be ratifying this in one weeks time.’     cyrus:  After a GP has been approved, we suggest that a minimum of one month to pass before a candidate risk team submits their general model to the community. At this point, the community should review and give feedback on the general model. We recommend an additional one month of discussion (and iteration) on the general model prior to submitting the final risk construct into the governance cycle. … However, the risk that a proposal hasn’t had enough time for consideration needs to always be taken into account. It is not difficult to envision potential governance attacks from malicious attackers trying to rapidly push through risk constructs.   These statements feel particularly ironic considering the current timeline for these proposals. Risk Constructs and General Models are important enough to get one month lead time for discussion and iteration, but this proposal (which is a meta-level above and arguably more important, only gets a lead time of a week.)  I get it, I honestly, truly do: we want and need to launch MCD asap. We need to get all these proposals ratified. It just feels dishonest, like the Foundation’s words are saying one thing (we listen to the community and MKR Token Holders, we want the community to gradually take over the responsibilities of the Foundation) and their actions are saying another (We need this to go through quickly, so we’re going to make a show of listening, but not actually leave time for the community to make more than a token effort). (Also, I hope it doesn’t need clarifying, I’m not putting this on you, Cyrus. This document is great.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.976371951219512
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#6",
                    "likes": "2",
                    "time": "22/08/2019-11:12:58",
                    "content": "The document is good, but I agree with the sentiment expressed above by LongForWisdom and his concerns. I expressed more or less the same already in other threads. I am answering here, however, to advance a possible idea to the issue of “Responsibility” raised by LongForWisdom. At the end, in blockchain, what ultimately matters are only (algorithmic) game-theoretic balances. So, to give/impose responsibility to the Risk teams I propose the following: PROPOSAL: The risk teams (but in general, I think, this could apply to all roles/jobs in the DAO) will be paid in MKR (collected using the SF) and such MKR are time-locked for a specific period (e.g., 12/24 months) before they can be redeemed. So that the risk teams would better do a good job and suggest good measures, or they also risk their salary as MKR-holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.893229166666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#7",
                    "likes": "4",
                    "time": "22/08/2019-11:28:20",
                    "content": " i think we should open new topic(s) regarding payments. first we should discuss the mechanics of payment (excluding foundation wallets which is finite source) by default EVERY role should be payed, even IGF (rich can choose not to collect his payment)  In my opinion this should be very high on priority list. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.969363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "2",
                    "time": "22/08/2019-11:37:16",
                    "content": "    iammeeoh:  PROPOSAL: The risk teams (but in general, I think, this could apply to all roles/jobs in the DAO) will be paid in MKR (collected using the SF) and such MKR are time-locked for a specific period (e.g., 12/24 months) before they can be redeemed. So that the risk teams would better do a good job and suggest good measures, or they also risk their salary as MKR-holders.   Cool idea. Asking employees to wait 12/24 months on their salary seems harsh though. Perhaps we can split it between Dai and MKR? Some agreed minimum living wage in Dai monthly, and then the remainder in MKR and locked for a certain time? This would help to align incentives and would build stake in the system for employees.     jernejml:  i think we should open new topic(s) regarding payments.   Agree 100%, feel free to start a topic and get some discussion going  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.187770562770563
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#9",
                    "likes": "0",
                    "time": "22/08/2019-16:32:43",
                    "content": "    LongForWisdom:  These statements feel particularly ironic considering the current timeline for these proposals. Risk Constructs and General Models are important enough to get one month lead time for discussion and iteration, but this proposal (which is a meta-level above and arguably more important, only gets a lead time of a week.)   I got nothing to add, just supporting your points on timeline ridiculousness. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kwadrax",
                    "index": "#10",
                    "likes": "1",
                    "time": "24/08/2019-12:33:26",
                    "content": "I don’t see much to actually disagree with but I can’t help but feel like the question “How does one ‘become’ a risk team?” is being discussed like a year late. The Foundation, with Steven, Cyrus, … have been talking about Risk Teams over the past year making it appear, to me at least, like there were  already several different teams working on risk or at least being onboarded and I find it really strange to see this question pop up just now at this stage of the entire project. How many different people are actually working on risk right now to get to MCD? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.84065934065934
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#11",
                    "likes": "1",
                    "time": "26/08/2019-08:36:11",
                    "content": "No, there aren’t any secret risk teams in the pipeline, but you bring up some interesting points. In general, there hasn’t been a ton of serious interest in becoming risk teams, although we receive lots of questions and passive inquiries. I suppose it’s difficult given the lack of clarity (which this doc was supposed to somewhat help with), but to be honest there likely aren’t that many people qualified for the current iteration for MakerDAO. The broader point, however, is that this should be a community initiative, just like other aspects of MakerDAO. While we at the Foundation are helping put some infrastructure in place (creating the incumbent risk constructs, setting the stage, putting out this doc), there are natural limits to our ability to bootstrap. In general, I think it will work out fine and MCD launch will attract natural talent, but I certainly hope the community finds ways to be proactive about this as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5070684523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ginworkflow",
                    "index": "#12",
                    "likes": "3",
                    "time": "28/08/2019-21:53:35",
                    "content": "    LongForWisdom:  It just feels dishonest, like the Foundation’s words are saying one thing (we listen to the community and MKR Token Holders, we want the community to gradually take over the responsibilities of the Foundation) and their actions are saying another (We need this to go through quickly, so we’re going to make a show of listening, but not actually leave time for the community to make more than a token effort).   Agree with your points but imo “we need this to go through quickly” so Dai and MakerDAO does not become irrelevant because of hundreds of competing stablecoins taking market share in the near future… also MCD needs to go live asap imo so that the code can prove itself by standing the test of time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3768939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#13",
                    "likes": "1",
                    "time": "29/08/2019-00:39:49",
                    "content": "Summary As in the Governance Facilitator Mandate thread, the primary concerns here seem to be around the packaging of processes, calendars, and mandates into one proposal. In the future, Foundation initiated proposals will be unbundled into multiple sections. Poll Should the  Interim Risk Team Mandate  be added to the governance portal for formal ratification by MKR holders beginning Monday Sept 2nd 2019 at 4 PM UTC, ending on Monday Sept 9th 2019 at 4 PM UTC?     Yes No Abstain     0 voters     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kwadrax",
                    "index": "#14",
                    "likes": "1",
                    "time": "29/08/2019-22:31:14",
                    "content": " No, there aren’t any secret risk teams in the pipeline, but you bring up some interesting points. In general, there hasn’t been a ton of  serious  interest in becoming risk teams, although we receive lots of questions and passive inquiries. I suppose it’s difficult given the lack of clarity (which this doc was supposed to somewhat help with), but to be honest there likely aren’t  that  many people qualified for the current iteration for MakerDAO.  I get that this is a small space with a limited amount of qualified people for but I just feel like there may have been more focus on publicly calling for risk teams. I’ve had the feeling over the past year that “risk teams” were covered only to find out now there are only a handful of people, which I highly appreciate and respect to be clear, working on this.  The broader point, however, is that this should be a community initiative, just like other aspects of MakerDAO. While we at the Foundation are helping put some infrastructure in place (creating the incumbent risk constructs, setting the stage, putting out this doc), there are natural limits to our ability to bootstrap. In general, I think it will work out fine and MCD launch will attract natural talent, but I certainly hope the community finds ways to be proactive about this as well.  We as community do have a role to play but it’s hard to come up with an actual plan if we don’t know the needs or things that could use extra community support. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.271343537414967
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#15",
                    "likes": "2",
                    "time": "30/08/2019-09:24:10",
                    "content": "Yeah, no disagreement from me here. I also wish things would move a bit faster. Maybe that’s my fault. But in any case, I think now is when we have reached the point where “there is a plan.” The next step is to go out and find risk teams. I think part of the reason for having dragged our feet can be attributed to lack of quality collateral even available. Hard to get quality risk analysts to leave their current jobs to come work on a highly risky pilot program that may or may not pan out, or for STOs that are nowhere to be seen, etc etc. I think it’s a bit of a chicken and egg problem. Once there are highly desirable collateral in the pipeline, then it should be easy to incentivize (and compensate) risk analysts to come do the work. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.163541666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#16",
                    "likes": "1",
                    "time": "03/09/2019-02:57:26",
                    "content": "The formal governance poll is now live: https://vote.makerdao.com/polling-proposal/qmpvhtcjxpm6wxs1cnq4bjc31d5egbyyd2k4ejotbtmhmt ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#17",
                    "likes": "0",
                    "time": "20/04/2020-14:15:42",
                    "content": "    flipflopflapdelegate:  Most qualified people that can provide Risk Management are experience in analyzing centralized drivers of risk, how do we attract talent that has not been involved with the community/MTH, or is not familiar/experience with the cryptocurrency space? What are the methods we can use to attract outside talent–will the driver be based on compensation?   I think we can create a pool and ask members specialization and skills, then have a database with some good informations and then we can easily find the right people to make this happen. This could be done in 2-3 days. People who are actively looking to work or contribute will be here pooling. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.488095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adrianhacker-pdx",
                    "index": "#18",
                    "likes": "2",
                    "time": "20/04/2020-14:54:14",
                    "content": "I had this idea, and I sent Vishesh a message in the chat asking about it, but I was also thinking that a curated list of coursera courses might do the trick as well.  Here is a free course that starts today, and is online    Coursera    Portfolio Selection and Risk Management | Coursera Learn Portfolio Selection and Risk Management from Rice University. When an investor is faced with a portfolio choice problem, the number of possible assets and the various combinations and proportions in which each can be held can seem ...       ",
                    "links": [
                        "https://www.coursera.org/learn/portfolio-selection-risk-management?specialization=investment-portolio-management"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                }
            ]
        }
    ],
    "group_index": "2422"
}