{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/tusd-adding-as-collateral-to-mcd/435",
            "title": "[TUSD] - Adding as collateral to MCD ",
            "index": 435,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "collateral-app-old"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#1",
                    "likes": "4",
                    "time": "11/09/2019-18:10:39",
                    "content": "Hi! This is Ryan from TrustToken. We are excited to be making a submission to include TUSD in MCD. We’ve been speaking with people on the Maker team about this for a while now and we are glad to finally have a chance for our projects to work together. In addition to TUSD, we’ve launched additional fiat-backed stablecoins including TGBP, TCAD, TAUD, THKD, with more coming. Once we begin getting circulation on those tokens, we’d love to see them included in MCD, as well. It would make for an easy way to on-board multiple fiats into the MCD ecosystem with TrustToken handling the KYC/AML, bank relationships, etc. If you have any questions or feel that our answers lack necessary detail, please feel free to comment below and I will do my best to address all of them in a timely manner. Please see our TUSD application below!   Technical Specifications  What is the token contract address?   0x0000000000085d4780B73119b644AE5ecd22b376 https://etherscan.io/token/0x0000000000085d4780B73119b644AE5ecd22b376   Where can the source code be viewed? Please provide links to the source code for all contracts providing the functionality to the token, including, but not limited to, transfers, freezes, whitelists, blacklists, transaction approvals/rejections, authorizations, upgradability, etc.   https://github.com/trusttoken/true-currencies   Which token standard does your token comply with?    ERC20 (Ethereum)  BEP2 (Binance Chain)   Does the token have any special mechanics for handling forks? This may include forks in the token app or in the underlying blockchain.   We can disable the contract on unsupported forks   My token fits with the following Dai Credit System adapter:   Our token fits with GemJoin   Has the token passed formal verification?   No   Technical audit    Link to technical audit from Level K    Financial Specifications  Overview Questions  Please provide a short summary of your project.   TUSD is a USD-backed stablecoin that is fully-collateralized (1:1 backed) with USD held by banks and trust companies.   Please list the founding members.   Jai An (LinkedIn) Rafael Cosman (LinkedIn) Stephen Kade (LinkedIn) Tory Reiss (LinkedIn)   What type of crypto asset is it (utility, work, governance, etc)?   TrueUSD is a USD-backed stablecoin.   If a native crypto asset, which category (utility, work, governance, etc)?   TrueUSD is a USD-backed stablecoin.   What is the token’s usage in the project? How is the token utilized?   TrueUSD is a USD-backed stablecoin.   Issuance - Bearer Assets  What was the date of the ICO?   TrueCoin, LLC, the issuer of TUSD, is a wholly-owned subsidiary of TrustLabs, Inc. Neither of these companies has completed an ICO   What was the initial price and valuation?   N/A   How much capital was raised (in USD and crypto terms)?   N/A   What was the token distribution breakdown?   N/A   Are any tokens on a vesting schedule? If so, what is that schedule? Describe any related vestiture limitations.   N/A   What are the circulating and total supply of the token?   N/A   What is the wallet address of the treasury?   N/A   How much of the ICO raise was converted into fiat (described in both terms of that fiat currency and the number of tokens?   N/A   Were there any pre-ICO seed investors? Who and what were their respective allocations?   N/A   Fundamentals  Please link to the whitepaper and/or pitch deck related to the token.   TrueUSD does not have a formal white paper or pitch deck   Please link to the most updated roadmap for your project.   TrueUSD does not have a public roadmap   How many employees and contractors does your project have?   22 FTE   What is the monthly burn rate?   Not disclosed   What is the strategy for treasury management?   Company funds are held in fiat USD or TrueUSD   Markets  Which exchanges is your token listed on?   TrueUSD is listed on ~75 exchanges with Coinmarketcap providing a pretty accurate overview of the most liquid markets. For an overview of the less liquid markets please view this sheet. In addition to this, TUSD is supported by all major OTC desks and wallets.   Are you aware of any paid market makers for your asset?   We are not aware of any paid market makers for our asset. We are connected with dozens of market makers who have direct creation and redemption access via our web portal. This is the primary mechanism for TUSD stability. Given that sophisticated traders understand that they can freely and quickly create and redeem TUSD, it allows them to easily buy TUSD in the market when it trades for <$1 and then sell back to us for $1, and vice-versa, when TUSD is trading >$1, they will buy TUSD from us for $1 and then sell it into the market until the price heads back to $1.   Does your token have custodial support? Where/with whom? Please provide a copy of the custodial agreement if available.   Yes, TrueUSD is supported by BitGo and all major custodians. No agreements are available to show, however, TUSD is displayed on the Bitgo website.   Community  Please link your email, Telegram, subreddit, Discord, Twitter, Medium.   Telegram Reddit Twitter Medium/Blog   What is the website of your project?   https://trusttoken.com https://www.trusttoken.com/trueusd/   Legal Specifications  Who is the token issuer (if any)?   TrueCoin, LLC   Do you have legal representation related (1) to the issuance of the token, (2) regulatory requirements regarding the token, or (3) otherwise? If so, whom?   WilmerHale (securities counsel for the issuance of TrueUSD), Orrick (corporate counsel) Katten, Muchin, Rosenman (securities & regulatory counsel for the issuance of the token).   What is the regulatory status of the token? Please provide relevant documentation (e.g., legal opinions, prospectuses, public disclosures, filing documents, etc.).   Non-securities. For parties who have signed an NDA, we can share legal memos from outside counsel supporting this conclusion.   Are there any rights associated with the token that does not follow from its technical implementation or technical ramifications of the system in which the token is used? If so, what are they? How are they enforced? Please provide documentation memorializing these rights.   Yes. Each TrueUSD token represents a claim to one US dollar held for the holder’s benefit in escrow accounts at independent financial institutions. A summary of the terms of our escrow agreements and our Terms of Use are attached. For parties who have signed an NDA, we can share a redacted version of the escrow agreements.   In what jurisdiction(s) was the token issued?? Please provide all filings and public documents related to the token’s issuance.   TrueUSD tokens are issued from California, United States. No public filings or public documents are associated with their issuance. TrueCoin, LLC is a registered MSB in the United States.   Was the token issued as part of a regulatory process (e.g., securities offering)? If so, under which law, rule and/or regulation was the token issued? Please provide all documents related to this regulatory issuance process (to the extent not already provided in response to the above).   No.   Was the token issued as part of the fundraising process for your project? If yes, who are the investors and how much equity do they respectively hold?   No.   Please describe the corporate and legal structure of the project/system/product in which the token is used.   TrueUSD tokens are administered by TrueCoin, LLC, a wholly-owned subsidiary of TrustLabs, Inc. As mentioned above, each TrueUSD token represents a claim on one US Dollar held in escrow accounts for the benefit of the token holder. The escrow accounts are managed by regulated trust companies in the US and internationally. TrueCoin, LLC pioneered this escrow model for fiat-backed stablecoins. Each TrueUSD holder that passes a KYC/AML check becomes a legal beneficiary of a certain amount of USD held in the escrow accounts that correspond to the amount of TrueUSD tokens they hold.  ",
                    "links": [
                        "https://docs.google.com/document/d/1p69v1_r0s7VufVdYTw5cwd4eM7-zKu8CMejIDepOoJI/edit",
                        "https://etherscan.io/token/0x0000000000085d4780B73119b644AE5ecd22b376",
                        "https://github.com/trusttoken/true-currencies",
                        "https://etherscan.io/token/0x0000000000085d4780B73119b644AE5ecd22b376",
                        "https://explorer.binance.org/asset/TUSDB-888",
                        "https://drive.google.com/file/d/1cnIdBHmqW54zvBZ_O-Tc7OtuL-dBNunt/view?usp=sharing",
                        "https://www.levelk.io",
                        "https://www.linkedin.com/in/djan92/",
                        "https://www.linkedin.com/in/rafaelcosman/",
                        "https://www.linkedin.com/in/stephenkade/",
                        "https://www.linkedin.com/in/toryreiss/",
                        "https://coinmarketcap.com/currencies/trueusd/",
                        "https://docs.google.com/spreadsheets/d/1wr2e6I8UjSC9BSLumkvqD7yuwXA8gatpcYyRjmjsygc/edit#gid=0",
                        "https://app.trusttoken.com",
                        "https://www.bitgo.com/resources/multi-currency",
                        "https://t.me/joinchat/HihkMkTja1gIyBRM1J1_vg",
                        "https://www.reddit.com/r/TrustToken/",
                        "https://twitter.com/TrustToken",
                        "https://blog.trusttoken.com",
                        "https://trusttoken.com",
                        "https://www.trusttoken.com/trueusd/",
                        "https://drive.google.com/file/d/1BINmS_dXf4mm3Hbdt8_dq-GgVvSP5ZJf/view?usp=sharing",
                        "https://drive.google.com/file/d/1wfPvsNwfXg6y-zY1UQ8UYYCdDv_YG9JT/view?usp=sharing",
                        "https://forum.makerdao.com/t/proposal-for-collateral-onboarding-of-usdc/1588/9",
                        "https://forum.makerdao.com/t/tusd-adding-as-collateral-to-mcd-second-application/2277",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-september-12-9am-pst-4-00-pm-utc/439/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.787202380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#2",
                    "likes": "0",
                    "time": "12/09/2019-00:13:55",
                    "content": "This inst about the submission really, but I don’t quite understand the use case for stablecoins CDPs. Like how do you make money? I’d love help in understanding. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#3",
                    "likes": "0",
                    "time": "12/09/2019-04:46:11",
                    "content": "I’ve taken a look on implementation and it is mockery of Ethereum. Sorry for harsh words but i find no other. TrueUSD is an upgradableProxy which might be changed at will by owner, and owner is A “multisig” with a single signer 0xF5235A0390e355CE0f133936f713C7Dc37bf28e2 (also behind upgradableProxy ) which is just some EOA If anyone see any good argument for considering TUSD as collateral second longer, please enlight me. EDIT: I’ve made mistake during analysis, Multisig is controlled by 3 EOA. I believe that doues not change my point much https://etherscan.io/tx/0x85563e14e7677e872d0dac9183b7ee02749b24564608bc82dc51ea4b4abf4e29 In general everything in a system is UpgradableProxy owned by some other UpgradableProxy Owner of all this mess can replace anything anytime. As far as I’ve analysed It is just handful of EOA, but designer of a contract make good job to make analysing calls as hard as possible by internalyzing them ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.016468253968254
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "4",
                    "time": "12/09/2019-13:45:04",
                    "content": "Thanks for this, and congrats, you’re the first token to submit this document to the forum! In general, I think I’d like to see more detail on some of these answers. Taking a more proactive approach would also have been appreciated. Presumably you are broadly aware of how the Dai Credit System works, and you are aware of how your token works. What risks do you see to MKR Holders as a result of us including TUSD (or others) in the system? While we’ll be doing due diligence, it would be great to get your opinion on the risks as well as more detail on the benefits. Here are some immediate questions that jump out at me. I’m unsure how many of these you can answer freely, if there are some you are unsure about, feel free to come back to those when you have the appropriate information.  Can TUSD be blacklisted and burned when it is within a CDP in the Dai Credit System? If it can, and such a blacklist+burn becomes necessary, how will your company handle this situation? As @Adam_Skrodzki mentioned, you are currently using OwnerUpgradableProxy, do you plan to add or modify the functionality of your implementation within the next ten years? You have provided a link to the latest of four audits from Level K, can you provide links to the previous three audits? You say that ‘Company funds are held in fiat USD or TrueUSD’ in terms of treasury management. Can you elaborate? How does your company make money? Do you collect interest on the deposited USD? Does this remain as USD in the escrow accounts or is it held in another form? Is your company currently profitable? Your website says ‘Transparent: Real-time proof of funds in an escrowed bank account.’ Is this viewable online, if so, where? Your website also says: ‘Ethical: We’ve published a code of ethics demonstrating our commitment to always being fully backed, redeemable, stable, and compliant’ Where can we find this code of ethics? How does your implementation on Binance chain effect the security and value of this token? I am not an expert, but in general dPos is viewed as less secure than PoW. How much TUSD is currently active on the Binance Chain versus the Eth Chain? If the TUSD on the Binance chain is compromised, how will that effect the stability of TUSD on the Eth chain? If your company were to go bankrupt, or to cease operating for any reason, how can TUSD be redeemed? You mention in your legal docs that holders of TUSD have a claim on the USD in the escrowed bank accounts. How is this recovered and what does this process look like? Are lawyers involved? In your best estimate, how much USD would be recovered for each outstanding TUSD token in this situation?  Looking forward to seeing the responses. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.218171296296297
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#5",
                    "likes": "0",
                    "time": "12/09/2019-17:55:59",
                    "content": "Hi Mitote! AFAIK TrueUSD makes money by not paying interest on the USD collateral. Using TUSD as collateral in CDPs will however allow issuers of TUSD to earn from the Dai Savings Rate. The flow is something like USD->TUSD (this step allows for KYC)->CDP into DAI->lockup DAI to get interest. Or they could just buy DAI outright and then lock it up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#6",
                    "likes": "0",
                    "time": "12/09/2019-18:04:03",
                    "content": "Hi Ryan, It is really cool to see TUSD go for this. I have some questions:  How will it work with regards to oracles? How can the Maker community check how much USD you have as collateral for the TUSD you have printed? When can we expect the formal verification to be completed? I assume that is your goal. I actually think I would like a explanation of how your governance works? How does the multisig work? Within what timeframes?  regards ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#7",
                    "likes": "0",
                    "time": "12/09/2019-19:48:21",
                    "content": "So the only way they could make money with a TUSD CDP is if the stability fee is less than the DSR? Isnt that one of the main issues with low volatile collateral in MCD? We need to figure out where that extra dai for the DSR comes from, since TUSD CDP users wouldnt pay enough interest to support a DSR above the SF… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#8",
                    "likes": "0",
                    "time": "13/09/2019-22:48:33",
                    "content": "Our company makes money by retaining the interest generated from holding the USD that collateralizes TUSD. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#9",
                    "likes": "0",
                    "time": "13/09/2019-22:49:18",
                    "content": "Our company makes money by retaining the interest generated from holding the USD that collateralizes TUSD ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#10",
                    "likes": "0",
                    "time": "13/09/2019-22:51:00",
                    "content": "Hi Adam, The multisig owner of TrueUSD is 0x285D362E41CcC116192A17D21a87f41Fc26d32F9, which is also its own proxy owner, so upgrading the multisig requires 2 of 3. Yes, they can replace the implementation any time, and have in the past to upgrade to audited implementations to pull new optimizations. Every upgrade we have done and will do is to fully-audited implementations that do not break functionality. Several other projects in DeFi are controlled by a multisig. There is no single point of failure. (This response comes from one of our lead engineers. I will ask him to create an account so that, moving forward he can address future concerns of this nature directly) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.100228475228476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#11",
                    "likes": "2",
                    "time": "13/09/2019-23:56:24",
                    "content": "Thanks for taking so much time to write out these questions, LongForWisdom. I also caught your remarks on today’s governance call. Please let me know how we can continue to address the community skepticism. FWIW, I haven’t seen any of the remarks on this thread as skepticism. These comments are about the kind of thoughtful questioning I would expect from the Maker community.     LongForWisdom:   Can TUSD be blacklisted and burned when it is within a CDP in the Dai Credit System? If it can, and such a blacklist+burn becomes necessary, how will your company handle this situation?     Please review our Terms of Use for our AML-CTF standards and our prohibited uses.      LongForWisdom:  As @Adam_Skrodzki mentioned, you are currently using OwnerUpgradableProxy, do you plan to add or modify the functionality of your implementation within the next ten years?    Not currently, but we would consider it if, for example, there was a critical bug found in the implementation contract. We have upgraded in the past in order to optimize our gas consumption. Each of our upgrades was to an audited implementation.      LongForWisdom:   You have provided a link to the latest of four audits from Level K, can you provide links to the previous three audits?     Certik Audit Slow Mist Audit I have a note to not share the 4th (scrolled through and there is nothing critical in it, but let me circle back with you on that next week). I am not sure why.      LongForWisdom:   You say that ‘Company funds are held in fiat USD or TrueUSD’ in terms of treasury management. Can you elaborate? How does your company make money? Do you collect interest on the deposited USD? Does this remain as USD in the escrow accounts or is it held in another form? Is your company currently profitable?     Meaning that corporate funds are held in USD bank account (as would be the case for any company) along with some balance held in TUSD that we use for e.g., contractor payments, a 1-off OTC deal, etc. Our company makes money by retaining the interest generated from holding the USD that collateralizes TUSD. The interest generated is transferred directly to a company account and does not touch the escrow account. re profitability: we do not have capital concerns      LongForWisdom:   Your website says ‘Transparent: Real-time proof of funds in an escrowed bank account.’ Is this viewable online, if so, where?     Yes. Right now, we perform two types of confirmations on the USD supporting TUSD. We work with Armanino, which provides a live confirmation of the funds behind TUSD. You can view that here. We’ve been working with them since the summer of 2019. Our original accounting relationship has been with Cohen & Co., and you can view the entire history of our TUSD attestations here.      LongForWisdom:   Your website also says: ‘Ethical: We’ve published a code of ethics demonstrating our commitment to always being fully backed, redeemable, stable, and compliant’ Where can we find this code of ethics?     You can find that here.      LongForWisdom:   How does your implementation on Binance chain effect the security and value of this token? I am not an expert, but in general dPos is viewed as less secure than PoW. How much TUSD is currently active on the Binance Chain versus the Eth Chain? If the TUSD on the Binance chain is compromised, how will that effect the stability of TUSD on the Eth chain?     Approximately $303k TUSD is currently circulating on Binance Chain. Binance Chain uses Tendermint for consensus. Both consensus protocols are subject to the Byzantine Generals Problem. Some could argue that, in some ways, Tendermint is superior to PoW; for example, Tendermint has no block reorganizations. We plan to support atomic peg between the two blockchains after securing the supply on Binance Chain using rolling time locks. The amount of TUSD that could be compromised on Ethereum would be limited by the amount in the peg contract. The WIP peg contract code being developed by Binance is here.      LongForWisdom:   If your company were to go bankrupt, or to cease operating for any reason, how can TUSD be redeemed? You mention in your legal docs that holders of TUSD have a claim on the USD in the escrowed bank accounts. How is this recovered and what does this process look like? Are lawyers involved? In your best estimate, how much USD would be recovered for each outstanding TUSD token in this situation?     The escrowed USD is held by each escrow agent solely for the benefit of each TUSD Holder. Neither the Company nor any of the escrow agents are entitled to any of the escrowed USD. The escrowed USD is not subject to any debts, liens or encumbrances of any kind of the Company or the escrow agents. Therefore, if the Company dissolves the escrowed USD would not be available to any Company creditors.  If the Company dissolves for any reason, each escrow agent is legally obligated to process all redemptions for TUSD holders that have either already created an account with the Company and, therefore, passed our KYC procedures, or for new Holders of TUSD that pass an escrow agent’s KYC procedures. On the corporate side, a wind-down agent would be appointed to assist the escrow agents’ process redemptions and protect the property rights of the Holders. If 100% of the TUSD tokens are held by persons who have either (1) already passed the Company’s KYC procedures, or (2) who pass an escrow agent’s KYC procedures after the company dissolves, then 100% of the TUSD tokens would be available for redemption.    ",
                    "links": [
                        "https://drive.google.com/file/d/1fwC9BQZcesDYmevK_85AREJWH0uQW8_t/view?usp=sharing",
                        "https://github.com/slowmist/Knowledge-Base/blob/master/open-report/TrueUSD-Smart-Contract-Security-Audit-Report.md",
                        "https://www.trustexplorer.armaninollp.com/TrueUSD",
                        "https://blog.trusttoken.com/trueusd-attestation-reports-86f693b90a4",
                        "https://blog.trusttoken.com/the-stablecoin-code-of-ethics-93a7a5e198dd",
                        "https://tendermint.com/docs/introduction/what-is-tendermint.html#consensus-overview",
                        "https://github.com/binance-chain/BEPs/blob/master/BEP9.md",
                        "https://en.bitcoin.it/wiki/Hash_Time_Locked_Contracts",
                        "https://github.com/binance-chain/bep3-smartcontracts/tree/develop",
                        "https://forum.makerdao.com/t/tusd-proposal-for-collateral-onboarding/2402/3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.63577047952048
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#12",
                    "likes": "5",
                    "time": "14/09/2019-17:03:32",
                    "content": "Other stablecoins are important collateral (IMO) for a couple of reasons:   From a Dai (and thus MKR) holder’s perspective, they decrease the volatility of the overall collateral portfolio by being theoretically 100% correlated with Dai itself. This makes Dai more stable.   The borrowers of Dai against other stablecoins are most likely going to be market makers. When a market maker mints Dai and sells it above $1, their assumption is that they will be able to repurchase it at $1 to pay off their CDP before the stability fees eliminate their profit (i.e. arbitrage). This much is obvious, but only represents half of the calculus. The other consideration a market maker must take into account is the price performance of the underlying asset which they used to mint the Dai in the first place. If using ETH, for example, they now must either hedge out ETH’s price volatility (which will be costly itself) or hope that it does not decrease in price to the point where it wipes out their arbitrage profits. By being able to lock a non-directional asset into the CDP, their calculus is simplified to price above $1 - stability fees.   Hope that helps. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.620098039215686
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "1",
                    "time": "16/09/2019-11:42:35",
                    "content": "    RyanRodenbaugh:  FWIW, I haven’t seen any of the remarks on this thread as skepticism. These comments are about the kind of thoughtful questioning I would expect from the Maker community.   Fair enough, skepticism may have been too strong a word. Caution may have been a more appropriate choice.     RyanRodenbaugh:  Please review our Terms of Use  for our AML-CTF standards and our prohibited uses.   I have skimmed these prohibited uses. My question is more related to your response. It would be great to get a clear answer of what your response would be. Would you be forced to blacklist and burn tokens that were locked in a CDP? (Note: I realise that any answer to this is akin to shooting yourself in the foot in front of either us or the U.S government. Sorry for that, but it’s important information. My assumption is that yes, you would be forced to do this.) In my view it’s critically important that we understand what happens here, if you are forced to blacklist and burn then that makes the DCS a pathway for non-compliant individuals to convert their ‘burnable’ money into ‘non-burnable’ Dai without a counter party and in such a way that it negatively affects MKR Holders when you are forced to blacklist and burn ‘their’ tokens.     RyanRodenbaugh:  I have a note to not share the 4th (scrolled through and there is nothing critical in it, but let me circle back with you on that next week). I am not sure why.   Also curious, let us know.      RyanRodenbaugh:  Yes. Right now, we perform two types of confirmations on the USD supporting TUSD. We work with Armanino, which provides a live confirmation of the funds behind TUSD. You can view that here . We’ve been working with them since the summer of 2019. Our original accounting relationship has been with Cohen & Co., and you can view the entire history of our TUSD attestations here.   This is fairly impressive! I recognise that you are not armanino, but if possible could you pass along the suggestion that historical data is also recorded and displayed? It would be great to verify that TUSD (or any other stablecoins they support) have always been backed 1-1. I’ll also note that without doing a lot of cross-checking it’s difficult to ensure that the attestations match the amount of TUSD in circulation on the blockchain. I’m they always match, but the information could be presented more effectively.     RyanRodenbaugh:  You can find that here. (Ethics blogpost)   All looks very sensible, thanks for the point in the right direction.     RyanRodenbaugh:   Approximately $303k TUSD is currently circulating on Binance Chain. Binance Chain uses Tendermint for consensus. Both consensus protocols are subject to the Byzantine Generals Problem. Some could argue that, in some ways, Tendermint is superior to PoW; for example, Tendermint has no block reorganizations. We plan to support atomic peg between the two blockchains after securing the supply on Binance Chain using rolling time locks. The amount of TUSD that could be compromised on Ethereum would be limited by the amount in the peg contract. The WIP peg contract code being developed by Binance is here.    Thanks for this, probably a little over my head, but if someone else wants to dig into this, that might be good?     RyanRodenbaugh:  The escrowed USD is held by each escrow agent solely for the benefit of each TUSD Holder. Neither the Company nor any of the escrow agents are entitled to any of the escrowed USD…   Fantastic answer, thanks for clarifying this process in more detail and glad to hear that in theory 100% of the funds can be recovered. Just one follow up question: You mentioned a wind-down agent would be appointed, how is this funded? ",
                    "links": [
                        "https://www.trustexplorer.armaninollp.com/TrueUSD",
                        "https://blog.trusttoken.com/trueusd-attestation-reports-86f693b90a4",
                        "https://blog.trusttoken.com/the-stablecoin-code-of-ethics-93a7a5e198dd",
                        "https://tendermint.com/docs/introduction/what-is-tendermint.html#consensus-overview",
                        "https://github.com/binance-chain/BEPs/blob/master/BEP9.md",
                        "https://en.bitcoin.it/wiki/Hash_Time_Locked_Contracts",
                        "https://github.com/binance-chain/bep3-smartcontracts/tree/develop"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.827279491341991
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#15",
                    "likes": "0",
                    "time": "18/09/2019-14:40:12",
                    "content": "    g_dip:  Hope that helps.   Absolutely! Thanks @g_dip! For anyone interested in learning more about the value of adding other stablecoins into the MCD system, Rune has a pretty epic thread with a lot of back and forth. He explains this better than I could. You can view that thread here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.078125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#16",
                    "likes": "1",
                    "time": "19/09/2019-06:00:04",
                    "content": "    LongForWisdom:  In my view it’s critically important that we understand what happens here, if you are forced to blacklist and burn then that makes the DCS a pathway for non-compliant individuals to convert their ‘burnable’ money into ‘non-burnable’ Dai without a counter party and in such a way that it negatively affects MKR Holders when you are forced to blacklist and burn ‘their’ tokens.   Thanks for pointing out where the weakness is so clearly. Also I would add to this that since TUSD is upgradable and do not use separate contracts for logic and state storage it is prone to humans errors in any future upgrades. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#17",
                    "likes": "0",
                    "time": "19/09/2019-06:53:43",
                    "content": "@LongForWisdom this thread is getting rather long with diverse topics being discussed. Is it sort of your job to gather all the pieces into a todo list?  Or is that up to @rich.brown? Keeping all these fragments together is actually a rather substantial undertaking. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#18",
                    "likes": "4",
                    "time": "19/09/2019-13:43:18",
                    "content": "    Planet_X:  Keeping all these fragments together is actually a rather substantial undertaking.   Heh, no kidding. Keeping track of this forum feels like juggling plates lately.  I actually don’t think there’s a need to start organising things on this thread yet. It’s a discussion of the application submitted by Ryan and thus far the majority of responses have been on-topic as I’d judge it. In terms of a todo list, what do you feel needs doing here? Are you referring to due diligence generally, looking into contract code, checking attestations and such? I’m a little reluctant to start pushing people into action on the subject yet as there is a whole stack of assets that are further up the priority list (at least as MKR Token Holders voted it.) There is also the question as to which responsibilities fall under the community generally, and which responsibilities are delegated to the risk teams. I believe Cyrus will be making this more clear in the future.      RyanRodenbaugh:  Please let me know how we can continue to address the community skepticism.   I kind of blanked over this on my last read-through, and I had some thoughts when I read over it again just now. My suggestions would be the following:  Be proactively transparent. Tell us the ways in which including TUSD (or your other tokens) could screw over the Dai Credit System and/or MKR Token Holders. Point us to anything we should look out for or worry about. Share any doubts you have about your system. Tell us what the difficult questions are and answer them as best you can. Continue to monitor the thread and answer any questions that arise as openly as possible. If you are unable to answer openly state why you can’t and try to find a way to resolve the issue. Maintain the level of politeness and respect you have so far (and try not to take to heart our somewhat pointed responses.)  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1722756410256405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#19",
                    "likes": "4",
                    "time": "04/10/2019-21:27:17",
                    "content": "Hello, I am a security engineer at TrustToken. I want to add some context for how TUSD is minted, which I think would help ease some concerns. I designed the current system to minimize our risks, and I work to mitigate our risks over time. Our “mint key” is secured within a hardware security module (HSM) in the cloud, so it is not physically located on our premises. We interact with the device through PKCS11, and it can only be accessed from a subset of our servers (the “signing service”), none of which face the public internet. No employees have ever had access to this key, nor would they be able to extract it. While the HSM is in control of engineering, it takes two engineers to update the signing service. Additionally, as explained below, there are limits and restrictions on this key. On-chain, TrueUSD minting is controlled by a multisig “token controller”. We have an Instant Mint Pool from which this key can mint. There are limits on this pool on a per-mint basis, but also in aggregate. Refilling this pool requires a signature from one of several select employees outside engineering, called “mint security officers”. These individuals have read access to our bank accounts and verify the integrity of the supply before refilling. They cannot initiate mints; they can only ratify or pause them. Mint security officers take on-call in shifts and respond to escalations from our monitoring system. Instant Mint Pool refills come from a “Ratifier Pool” which itself must be refilled from a larger “Multiratifier Pool” by signatures from 3 mint security officers. It is possible to mint from the ratifier pool directly with a signature from the mint key and a ratifier. Similarly, it is possible to mint from the multiratifier pool using the mint key and 3 mint security officer signatures. These “mint requests” allow larger, but less-instant, mints. The Multiratifier Pool is refilled and configured by the owner multisig. Keyholders for this multisig are significant stakeholders, and we have guidelines that limit risky tweaking. Reconfigurations are not arbitrary; limit increases typically follow improvements to our security. Contract implementation upgrades require strong justification and a third-party audit. Our most recent set of upgrades was audited by LevelK.  TokenController code MultisigOwner code  Of course, there is room to improve. I’m interested in your ideas. I hope this has helped assuage fears about our mint security. Working with the prior banking system is challenging, but it means you can send money directly to your bank account, or move your money onto the blockchain. ",
                    "links": [
                        "https://github.com/trusttoken/true-currencies/blob/master/contracts/Admin/MultisigOwner.sol"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.426075268817204
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#20",
                    "likes": "0",
                    "time": "07/10/2019-14:00:35",
                    "content": "This is really interesting, thank you very much for sharing! Not that I’m doubting your identity in the slightest, but it might be sensible to set a precedent of verifying people claiming to speak on behalf of company. Ryan provided his linkedin above. Is there any non-invasive proof of employment you can share? I did look at the TrustToken website, but they only list their leadership team. By the looks you contributed to the TrustToken blog back in 2018, and I think that’s enough to satisfy me personally. As someone whose job it is to minimise and mitigate risks, can you identify any additional risks to the DCS that could be caused by the introduction of TUSD? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.589285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#21",
                    "likes": "1",
                    "time": "07/10/2019-18:44:55",
                    "content": "I can confirm that Will is with us. https://www.linkedin.com/in/william-morriss-b0bb9464/    GitHub    wjmelements - Overview wjmelements has 96 repositories available. Follow their code on GitHub.       ",
                    "links": [
                        "https://github.com/wjmelements",
                        "https://github.com/wjmelements"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#22",
                    "likes": "2",
                    "time": "08/10/2019-01:04:31",
                    "content": "    LongForWisdom:  As someone whose job it is to minimise and mitigate risks, can you identify any additional risks to the DCS that could be caused by the introduction of TUSD?    We work with real-world assets that can be seized by thieving socialists. We must take action to protect our token holders from the forces of evil, but there are limitations to we can do within the old banking system if the government turned hostile to property. We have a strong legal team working to ensure we are in compliance, but laws and regulations can change suddenly and drastically. For example, earlier this year it looked like they were going to say non-custodial decentralized exchanges were illegal money laundering schemes, but now it looks like they are exempt from standard BSA/AML requirements. We have obtained the licenses we need to operate, but some jealous government agency might think we need their license as well, whether we do or not. Or, a new agency may spring up and demand we shut down operations until we have their license. We have invested in building a scalable compliance infrastructure, but if our compliance program or legal guidance were insufficient, we could be fined a large sum, which could threaten us existentially. For any reason, third parties could block our payments, which would prevent market makers from being able to protect our peg.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.076142376142377
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#23",
                    "likes": "0",
                    "time": "23/10/2019-00:34:27",
                    "content": "Here is an old blogpost about our security practices. We have made some improvements since then. The prior post in this thread about mint security is more up-to-date than what is described in the blogpost, and includes commentary about our HSM. We have moved authentication in-house, which reduces third-party risk. We also have switched to a microservice architecture, which reduces the scope of potential breeches. Our intrusion detection system protects against categories of attacks and also notifies us about security updates to our dependencies, so we can easily keep them up to date. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.033333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/weird_things",
                    "index": "#24",
                    "likes": "0",
                    "time": "23/10/2019-09:32:50",
                    "content": "Hey folks, Very interesting project. Nice to see stablecoins outside common speculative usecases. However, what is your action plan in case this happens: Stablecoins to become securities ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.05
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#25",
                    "likes": "0",
                    "time": "23/10/2019-13:24:33",
                    "content": "@weird_things, one day Crypto will be regulated in some form or another. The above proposal is more of a knee-jerk reaction to Facebook’s Libra than anything else so I would not regard that proposal as something that will actually materialize.  However, I assume that the community will treat this as a risk that must be taken into account. In general - the more risky the asset the lower the debt ceiling for that asset class. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.05
                },
                {
                    "author_link": "https://forum.makerdao.com/u/weird_things",
                    "index": "#26",
                    "likes": "0",
                    "time": "23/10/2019-13:50:00",
                    "content": "Good one. But if stablecoins get recognized as securities then what TUSD can do about it? Does MakerDAO need such risk with USD-denominated stablecoins? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#27",
                    "likes": "0",
                    "time": "10/12/2019-22:33:27",
                    "content": "While we don’t think the US government would do that, in the worst case we could stop serving US customers, and the token would still hold the peg because non-US customers would be able to operate. There really only needs to be one or two remaining customers for TUSD to maintain its peg. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/secneu",
                    "index": "#28",
                    "likes": "4",
                    "time": "17/03/2020-12:18:23",
                    "content": "Time to add TUSD as DAI collateral to reduce the risk of having only USDC. I would also include Pax ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#29",
                    "likes": "3",
                    "time": "20/03/2020-22:46:03",
                    "content": "PAX has no presence in DeFi, no liquidity in Uniswap, and no volume on DEXs. It would be an odd choice. Tether would be better than PAX, and would provide more risk diversity than only using US-regulated coins. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BlueSky",
                    "index": "#30",
                    "likes": "0",
                    "time": "23/03/2020-11:37:29",
                    "content": "We add usdt，It’s more influential. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#31",
                    "likes": "0",
                    "time": "13/04/2020-17:44:09",
                    "content": "@RyanRodenbaugh My understanding is that we now have a collateral onboarding process that is ready for action, MIP6: Collateral Onboarding Form/Forum Template . Can we get TUSD rolling again? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#32",
                    "likes": "0",
                    "time": "04/05/2020-10:14:38",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}