{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/fortunafi-update-pipe-technologies/18950",
            "title": "Fortunafi Update - Pipe Technologies ",
            "index": 18950,
            "category": [
                "Core Units",
                "Strategic Finance"
            ],
            "tags": [
                "fortunafi",
                "fft1-drop",
                "rwf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Fortunafi",
                    "index": "#1",
                    "likes": "8",
                    "time": "28/11/2022-15:10:48",
                    "content": "We wanted to address the recent news regarding Pipe Technologies. Last week, the founders of Pipe announced they will be stepping back from running the company day-to-day. Current CEO Harry Hurst will move into a Vice-Chairman role, while his Co-CEO Josh Mangel will remain as CEO during the transition. The founders will not be stepping away until a new CEO is in place and the transition to new leadership is completed. In addition to this transition, there have been rumors circulating around Pipe’s exposure to crypto miners. We’re aware that Pipe had a small test program to provide financing to miners, which never got past the pilot stage. Furthermore, rumors of test financings failing or involving personal loans to the founders have been denied by Harry Hurst. Fortunafi has approximately $1.6mm in Pipe originated assets, all of which are performing. More importantly, Fortunafi has no exposure to crypto miners whatsoever. We have been in contact with management since the announcement and Pipe’s team continues to operate normally. In the meantime, we wanted to clarify that Fortunafi’s exposure and related cash flows are not at risk (we have account control agreements in place), such assets continue to perform and none involve any exposure to crypto miner loans. We will continue to monitor these developments closely and continue to provide any relevant updates. Best Fortunafi Team ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/34"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.575757575757576
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "26/02/2023-15:11:14",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}