{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-burn-the-84k-foundation-mkr/8338",
            "title": "[Signal Request] Burn the 84k Foundation MKR ",
            "index": 8338,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-rejected"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#1",
                    "likes": "8",
                    "time": "26/05/2021-02:48:15",
                    "content": "Hi Everyone, As most of you know, we had an informal poll to have a cool off period before we decided what to do with the 84k MKR received from the Foundation. While months have not passed, I think enough time has gone by that we can make certain decisions about these funds. I would personally like to propose that we send these funds to the burner. Pros  Removes the cognitive overhead of deciding what to do with these funds. Trying to find a “purpose” for these funds will ultimately lead to potential wasteful spending. Potential positive PR implications  Cons  Potential legal ramifications with regards to securities law when minting future MKR to replace burned ones Could be used in the future for fundraising or any unforseen capital costs. Counter-argument is minting would achieve the same goal (loop back to possible legal ramifications)  Should we burn the 84,000 MKR sent to us from the Foundation?     Yes No Abstain     0 voters     Next Steps Polling will end on 2021-06-10T16:00:00Z. If “Yes” wins with a majority, I will create an on-chain poll for MKR holders to vote on the following Monday. If “Yes” then passes the on-chain poll, an executive in the future will be created that includes a spell that will burn this MKR. As always, I look forward to hearing your feedback and discussion. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-protocol-treasury-meme/8339",
                        "https://forum.makerdao.com/t/mip-54-dssvest/8025/23",
                        "https://forum.makerdao.com/t/mip-54-dssvest/8025/21",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-144-thursday-june-3-17-00-utc/8459/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-48-en-espanol/8636",
                        "https://forum.makerdao.com/t/maker-relay-ep-48/8609",
                        "https://forum.makerdao.com/t/maker-relay-ep-47-en-espanol/8547",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-28-june-3/8525",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-143-thursday-may-27-17-00-utc/8228/3",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-may-30th-2021/8495",
                        "https://forum.makerdao.com/t/maker-relay-ep-47/8491",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-21-27/8379",
                        "https://forum.makerdao.com/t/signal-request-should-we-mint-new-mkr-for-protocol-expenses-or-fund-them-with-mkr-from-the-makerdao-treasury/11629",
                        "https://forum.makerdao.com/t/signal-request-burn-baby-burn-burn-the-mkr-treasury/11617/5"
                    ],
                    "GPT-summary": "The author of the post proposes to burn the 84k MKR received from the Foundation, and lists pros and cons of this proposal. The author also provides a poll for the community to vote on the proposal, and invites feedback and discussion. Some possible legal ramifications are mentioned. The post also invites auditing and reviewing of the proposal, and asks for feedback and questions.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.282172373081464
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#2",
                    "likes": "6",
                    "time": "26/05/2021-03:10:25",
                    "content": "From what I understand, it’s a net-neutral action to burn the MKR or not, as we can re-mint them at any time later to fund x y z. I’m torn on burning them though, as those MKR are not the same as burning by revenue. We’re not taking MKR off the market, and pushing the price up. I suppose by burning them, we reduce the likelihood/temptation of having them find their way into the market, diluting the price. I’m not sure how it looks though to burn a little under 10% of our supply. We’d basically just chop our market cap by that much. Is that bad? Good?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.9140625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#3",
                    "likes": "5",
                    "time": "26/05/2021-03:13:21",
                    "content": "Coingecko already doesn’t account for that amount plus the Foundation leftovers in the circulating supply so I don’t think it would make a big difference. If anything it would make MKR look cheaper marketcap-wise which I think would be a good thing. Like you said and I mentioned in the “pros” section, the main reason to do this would be to remove the cognitive overhead of trying to figure out what to do with these funds. We should act like they don’t exist, so lets make them not exist. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.444444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#4",
                    "likes": "12",
                    "time": "26/05/2021-03:18:45",
                    "content": "I voted yes for the symbolism … but I want to echo Burban in saying that the DAO can’t even logically “hold” MKR tokens given that it has the power to mint them at will. These tokens shouldn’t even be counted in the circulating supply IMO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BigPapa",
                    "index": "#5",
                    "likes": "3",
                    "time": "26/05/2021-03:22:50",
                    "content": "I’d rather see it earmarked solely for MKR vesting compensation for employee salaries, according to each approved core unit budget. I do agree with the cognitive overheard factor and we should go for  a simple, single purpose use. PR implications sound like price appreciation which I’m not sure we know will happen; the market hasn’t seemed to care about us burning MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.098214285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/freiza",
                    "index": "#6",
                    "likes": "6",
                    "time": "26/05/2021-04:02:20",
                    "content": "I voted no because I think there are more meaningful ways to spend the Foundations MKR.  Instead of burning, a better symbolic act would be set aside a portion or the whole set to reward supporters and bootstrappers of the Sai & Dai Credit System with MKR.  The same way Uniswap airdropped their UNI token to LP’s and users, it would be great to widen the circle of MKR governance community and a show of goodwill to anyone who has interacted with/created a vault, OasisDEX, voted, or any other Maker property, because without these users the system wouldn’t have been possible.  Since the MKR token preceded even Sai, it was impossible to reward these early participants with MKR (such as through yield farming schemes which exist today–which I’m not recommending btw).  I think it could potentially be a big event in DeFi. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.753472222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#7",
                    "likes": "5",
                    "time": "26/05/2021-04:23:31",
                    "content": "Many thanks for starting this signal request. I voted no. Burning it does make for a great PR moment but I think it’s too short lived to make it worth it. I don’t think a single move like that will affect the price in a substantial long term way.  Regarding the cognitive overhead, I think it’s one of those “good-to-have” problems so that doesn’t worry me too much - I am confident our governance is able to handle such issues. My recommendation is that we keep it as an emergency reserve or strategic reserve fund. We only do something with it when the protocol has an issue that is beyond the scope of the surplus buffer. That kind of satisfies this requirement to a large extent     Aaron_Bartsch:  We should act like they don’t exist.   As for this point     Aaron_Bartsch:  Counter-argument is minting would achieve the same goal (loop back to possible legal ramifications)   You’re right that it’s the same thing but the optics of burning now and minting later vs the optics of “using our insurance fund” to cover protocol losses are quite different. Personally, I think the latter looks a lot better, even if it’s exactly the same net outcome. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.844387755102041
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#8",
                    "likes": "1",
                    "time": "26/05/2021-04:56:08",
                    "content": "I switched my vote to yes for now… but I’d really like to be convinced that this will be a good look for us. Also, funding CU’s and other expenses… but particularly vesting CUs, would ideally be coming out of this 84k surplus. It may arguably be a good look to burn this MKR for now… but it’s less clear that it will remain a good look if we start minting some of it back at our whims when we feel we need to fund certain things. To echo my ~hard stance of “no mint”… I was particularly anti-mint after this 84k is depleted. So, we can burn this 84k, and then mint at our leisure up til the 84k… minting later, beyond this 84k, I would be back to anti-minter. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.088095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#9",
                    "likes": "5",
                    "time": "26/05/2021-05:03:14",
                    "content": "I voted yes, but i would prefer burning only something like 60k and keep the rest. Partial burn does not remove the cognitive overhead though. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#10",
                    "likes": "2",
                    "time": "26/05/2021-06:46:55",
                    "content": "I also voted yes, but I would prefer to brun the majority and left some MKR to do something “useful”. Provide liquidity on dexes we have as a collateral; Uniswap v3 MKR/Dai MKR/ETH and Sushiswap, Balancer etc. or are we doing this right now? (I scoured the forum for this but didnt find anything) Maybe i didnt thought this throught and it raises conflict of interests?!? Better liquidity policy means we are not dependent on others to provide liquidity! On wednesday and sunday a lot of liquidity was removed, it was also a part of the death spiral. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.636904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#11",
                    "likes": "27",
                    "time": "26/05/2021-06:59:02",
                    "content": "I want to echo the sentiment that the PR damage of minting anytime soon would potentially be much more negative than the one time positive effect of burning. Burning seems a somewhat shortsighted attempt to pump the MKR price that really isn’t necessary. We already have a very solid reputation when it comes to low token supply, and trying to make a big PR stunt about a manual burn event could very easily attract regulators’ attention. It’s one thing to have it as a protocol mechanic (with already a very high burn ratio!), it’s another to explicitly decide to burn for PR effects. Minting then creates again legal risk, and breaks the rule that MKR is only minted to save the protocol from insolvency. The latter could be very bad PR. With the 84k otoh, it will be a long time before we need to mint anything. You can have an “X days since MKR was minted” counter for a milder PR meme if you want one. I’m pretty convinced that it would be better to keep the MKR to pay out retention bonuses and avoid minting for as long as possible. ",
                    "links": [
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-may-30th-2021/8495"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3659489633173845
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#12",
                    "likes": "4",
                    "time": "26/05/2021-07:13:37",
                    "content": "    wouter:  want to echo the sentiment that the PR damage of minting anytime soon would potentially be much more negative than the one time positive effect of burning.   Agree.     wouter:  Burning seems a somewhat shortsighted attempt to pump the MKR price that really isn’t necessary.   This is not my motivation. I am against having so much capital. It creates incentive to spend it inefficiently.     wouter:  We already have a very solid reputation when it comes to low token supply, and trying to make a big PR stunt about a manual burn event could very easily attract regulators’ attention. It’s one thing to have it as a protocol mechanic (with already a very high burn ratio!), it’s another to explicitly decide to burn for PR effects.   I am against any PR stunts.     wouter:  Minting then creates again legal risk, and breaks the rule that MKR is only minted to save the protocol from insolvency.   Yes, legal risk is very good con argument. Maybe exploring this further would be wise.     wouter:  I’m pretty convinced that it would be better to keep the MKR to pay out retention bonuses and avoid minting for as long as possible.   That’s the reason i suggested partial burn. I feel 84k is too much. I am changing my vote to abstain. Would like to hear more arguments. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.033459595959596
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#13",
                    "likes": "7",
                    "time": "26/05/2021-07:20:59",
                    "content": "    jernejml:  [A PR stunt] is not my motivation.   I believe you. But what matters in this case is not our motives or even the logical argument that it’s “mathematically equivalent”. For the public and initially for the regulators too. What matters is perception. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#14",
                    "likes": "4",
                    "time": "26/05/2021-08:10:55",
                    "content": "Haven’t voted yet. Still considering the arguments for and against. However: our primary goal surely has to be the long-term sustainability of MakerDAO/stability of Dai. I’m not sure whether burning meaningfully serves this, though I agree that minting (a related question) would be a very bad look. Is there a priority in the Surplus Buffer? I.e. are we happy that it’s filling fast enough for where we’re at right now and could be in the near future. While I’m very impressed with how Liq2.0 performed, I think the severity of the recent crash and the strain on the system surprised most of us. Had Liq2.0 been rolled out a month later, or even conditions on the day been a little different (e.g. a slower bounce) things could have gone VERY differently for MakerDAO and, by extension, much of DeFi. It’s probably not an overstatement to say it could have ended it or set it back years. So I’d say that if there’s any question the SB isn’t adequately funded, let’s get our house in order. Sell e.g. 15k MKR, fill the SB to 100 million Dai, and burn the remaining 69k. I’d hope and expect the market would recognise we’ve got our priorities right, taking care of immediate risk but proving that it won’t be something we do again by burning the rest. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.803596230158731
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#15",
                    "likes": "0",
                    "time": "26/05/2021-08:31:04",
                    "content": "I don’t know if I want any burn to take place but following your argument, it sounds like we could burn 60k tokens and still have 24k tokens available for rewards. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#16",
                    "likes": "13",
                    "time": "26/05/2021-09:41:31",
                    "content": "I voted no because I believe future mints will have a much more negative PR impact. The funds were already taken out of circulating supply when they were sent to the PauseProxy. We’ve seen how the market does not care at all about FDV, so I believe the potential positive PR impact of a large burn of funds outside the circulating supply is minimal at this point – especially if we instead introduce a meme of uncertainty about future mints on an ongoing basis, which we know will happen instead as Core Units start to vest MKR. Having what can be perceived as a treasury I’d argue makes Maker seem less risky, and that has its positive PR implications as well. Furthermore, the community already has to make tough decisions regarding spending of surplus, so saying that there’s a risk of inefficient spending or cognitive overhead is not a risk that applies only to the MKR in the PauseProxy, but to the project in general. MKR can be minted and inefficiently spent by the community as well, so I’m not sure I follow the argument here. Another point is that these funds actually provide flexibility as we can potentially avoid future ideological debates and contentious gridlocks around MKR minting in the community by keeping this stack of funds around. I do not think minting MKR for rewards or other opportunities in general is a topic that has been fully debated yet, so burning these funds without a proper understanding of the community sentiment regarding minting-at-will (which would be the direct consequence of burning the funds) might just put us on a path of future problems. Therefore I argue that we should keep the MKR for now so we can at least cover the costs we know are coming, which are the CU incentives, and trust that the governance processes are strong enough to properly handle the remaining funds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.012346370104991
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#17",
                    "likes": "2",
                    "time": "26/05/2021-10:28:44",
                    "content": "Oh man–this Signal Request reminds me why I am in Crypto–to align my own pockets, and not because this amazing technology can “bank the unbanked.” I still voted “no” because I have to stick to my moral principals. I guess, now I know why some MKR token holders lend out their tokens on AAVE and Balancer and don’t participate in Governance. It’s free market capitalist world–and you have to look out for yourself, first. I guess what I am saying is–that burning the 84K will make feel “greedy” Like why not use that 84K for the possibility that we might need to do a round of funding one day–or, why not buy “insurance” from Barclay’s PLC, or why not buy a Skyscraper and lease out to Barclays for 30-years. Why not incentivize the future Maker people that we will onboard to this community–the people of South & North America, Africa, East & West Europe, the Middle East, North & South Asia, and Australia/New Zealand. I think about what Kain of SNX said about EIP-1559, that he’s not excited because it will make the price of ETH go higher (since ETH will be burned) and the young people that get into Ethereum will not be motivated to buy 0.0001% of the outstanding ETH. Do we honestly think that if Maker goes to the MOooon a 14-year old from Argentina is going to one to join in 2026 and own 0.0001% of MKR… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.204166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#18",
                    "likes": "1",
                    "time": "26/05/2021-11:13:24",
                    "content": "Question: I think it probably should but would dispersing the 84k require an on-chain vote if there were some dire emergency or other urgent use? Whereas minting more outside of an empty SB does require on-chain voting, yes? If there’s extra flexibility for governance, that could be a pro or con, but seems like the only major difference between burning and not to me. (As for PR, who exactly would even know about it? Even the crypto press doesn’t know we exist) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.3671875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#19",
                    "likes": "2",
                    "time": "26/05/2021-11:24:25",
                    "content": "    PaperImperium:  Question: I think it probably should but would dispersing the 84k require an on-chain vote if there were some dire emergency or other urgent use? Whereas minting more outside of an empty SB does require on-chain voting, yes?   Yes, it requires an onchain vote to send any of the MKR from the PauseProxy. In this regard it is from a technical POV similar to minting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.229166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#20",
                    "likes": "1",
                    "time": "26/05/2021-11:26:33",
                    "content": "    PaperImperium:  (As for PR, who exactly would even know about it? Even the crypto press doesn’t know we exist)    actually when Maker received the 84K – it was one of the few times I’ve seen Maker get   from the Crypto Community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 4.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#21",
                    "likes": "10",
                    "time": "26/05/2021-11:45:11",
                    "content": "Well this is very contentious! Good conversation so far everyone!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#22",
                    "likes": "0",
                    "time": "26/05/2021-12:01:50",
                    "content": "    lollike:  Yes, it requires an onchain vote to send any of the MKR from the PauseProxy. In this regard it is from a technical POV similar to minting.   Thanks. This sounds like a distinction without a difference, then. To those who want it to burn, if this is for PR, tie it to some goal that’s measurable like “for every mention of Maker on social media, we’ll burn 1 MKR” or “for every purchase with DAI at partners X, Y, Z on days A, B, C, we’ll burn 1 MKR.” If this is really for PR, structure it to get press ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.433333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#23",
                    "likes": "8",
                    "time": "26/05/2021-13:27:43",
                    "content": "Agree with all of what @wouter and @AstronautThis said. The MKR is essentially burnt anyways as its not a part of the circulating supply. I don’t really agree that there is cognitive overhead to spending these funds - I haven’t seen one formal proposal on spending any of it. The only time I hear people talking about these 84K MKR is in the context of wanting to burn it. Even if there were proposals to spend it, I trust the MKR community to come together and evaluate any proposals on their own merits. The optics of burning it for short term PR benefits are not very good especially when we would have to turn around and mint MKR for CU retention. IMO we shouldn’t touch the MKR until our Surplus Buffer / CET1 ratio are at the level the Risk CU recommends - we are FAR below that at the moment. Let’s not forget that we have to pay CUs out of the Surplus Buffer as well. With markets as volatile as they have been, I’d prefer to not touch the Foundation MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.394230769230769
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#24",
                    "likes": "7",
                    "time": "26/05/2021-13:59:45",
                    "content": "I voted no, leaning most towards Wouter and Lolike’s views. Key points from my view:     wouter:  the PR damage of minting anytime soon would potentially be much more negative than the one time positive effect of burning.       wouter:  Minting then creates again legal risk, and breaks the rule that MKR is only minted to save the protocol from insolvency. The latter could be very bad PR.       wouter:  I’m pretty convinced that it would be better to keep the MKR to pay out retention bonuses and avoid minting for as long as possible.       lollike:  Another point is that these funds actually provide flexibility as we can potentially avoid future ideological debates and contentious gridlocks around MKR minting in the community by keeping this stack of funds around. I do not think minting MKR for rewards or other opportunities in general is a topic that has been fully debated yet, so burning these funds without a proper understanding of the community sentiment regarding minting-at-will (which would be the direct consequence of burning the funds) might just put us on a path of future problems.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.22435064935065
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#25",
                    "likes": "1",
                    "time": "26/05/2021-14:01:34",
                    "content": "    Aes:  IMO we shouldn’t touch the MKR until our Surplus Buffer / CET1 ratio are at the level the Risk CU recommends - we are FAR below that at the moment.   This is what I wanted to raise:     Cassius:  So I’d say that if there’s any question the SB isn’t adequately funded, let’s get our house in order. Sell e.g. 15k MKR, fill the SB to 100 million Dai   If we are below recommended levels, then isn’t there a strong case for getting the job done asap? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.444444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#26",
                    "likes": "2",
                    "time": "26/05/2021-14:21:09",
                    "content": "    Cassius:  This is what I wanted to raise:     Cassius:  So I’d say that if there’s any question the SB isn’t adequately funded, let’s get our house in order. Sell e.g. 15k MKR, fill the SB to 100 million Dai   If we are below recommended levels, then isn’t there a strong case for getting the job done asap?   Selling 15k MKR is not easy, due to the low liquidity. It could suppress the price a great deal because you would need to offload the amount over a period time. In the worst case, if the selling is not handled properly, it could crash the price, increasing the risk of a governance attack. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.140625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#27",
                    "likes": "2",
                    "time": "26/05/2021-14:26:48",
                    "content": "    lollike:  Selling 15k MKR is not easy, due to the low liquidity.   If liquidity depth is an issue, then why not use MKR to provide liquidity to the market and generate passive income at the same time? It would be a win-win scenario for Maker and for investors. Also, it is better than done nothing at all with the MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.158333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#28",
                    "likes": "1",
                    "time": "26/05/2021-14:27:30",
                    "content": "Fair point, but I’m not suggesting market dumping. Ideally this would be one or more OTC placements to large investors/funds, with associated PR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.892857142857144
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#29",
                    "likes": "1",
                    "time": "26/05/2021-14:36:51",
                    "content": "Given the community’s desire to take more risk and burn (see last vote on raising the SB) I just don’t think it’s realistic that any MKR is minted. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.111111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#30",
                    "likes": "3",
                    "time": "26/05/2021-15:16:44",
                    "content": "    Aes:  Given the community’s desire to take more risk and burn   I think this deserves its own discussion. We really are not watching very closely how much risk we hold except when evaluating liquidation walls and some due diligence on new collateral applications. This isn’t the thread for it, but I would like to see a serious discussion about different systemic risks Maker holds, and a demonstrated understanding by the DAO just how lightly capitalized we are, how concentrated our counterparty risks are, and how reliant we are on future growth to pay the expenses we’ve already taken on. We barely have descriptive statistics about our own business, and I think there’s a real lack of understanding by many members just how risky Maker still is at this stage. I nominate someone who’s not me to get the ball rolling on that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.042676767676768
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#31",
                    "likes": "2",
                    "time": "26/05/2021-15:26:31",
                    "content": "Heads up folks, [Signal Request] Protocol Treasury Meme ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#32",
                    "likes": "0",
                    "time": "26/05/2021-15:31:55",
                    "content": "The diffusion of responsibility is real.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#33",
                    "likes": "0",
                    "time": "26/05/2021-17:02:37",
                    "content": "I am pretty sure that for most people here, MKR is part of the “barbell” portion of their investment portfolio. Maker is exposed to enormous levels of idiosyncratic risk just by virtue of being built on crypto. You can hedge against volatility in your book to some extent, but that lowers your capital efficiency and can only cover some (arguably small) part of the tail risks the system can encounter. From that perspective, it makes sense that many in the community would index towards taking on more risk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#34",
                    "likes": "11",
                    "time": "26/05/2021-19:37:22",
                    "content": "I voted yes, not to pump the price (I agree I don’t think it will have an effect), but because it is technically equivalent holding vs burning. If investors don’t understand that then frankly they are low quality investors, so do we really want them governing the protocol? In the interest of “scientific governance” or whatever we are calling it now, I think we should just burn it and be done with it. It’s a distraction, but honestly I don’t care that much as they are equivalent after all. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#35",
                    "likes": "3",
                    "time": "26/05/2021-19:39:32",
                    "content": "Agree with this sentiment. At the end I don’t think it really matters but I really don’t want to see new proposals coming up in the future trying to decide what to do with these funds when we can just mint ad hoc. Let us remove the temptation from our feeble human minds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.03030303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#36",
                    "likes": "0",
                    "time": "26/05/2021-22:34:26",
                    "content": "    Aaron_Bartsch:  Potential legal ramifications with regards to securities law when minting future MKR to replace burned ones   @layerzero Can you weigh in here? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#37",
                    "likes": "6",
                    "time": "27/05/2021-06:09:16",
                    "content": "Took me some time, a related signal request, and reading a lot of feedback to form an opinion on this. MakerDAO should not burn the MKR owned by PauseProxy. First, it is work, it costs gas, it takes time, it entails (very small) risk, and it achieves nothing useful. There is no reason for MakerDAO to alter how much MKR exists in this fashion. At best it is completely useless. In reality it is worse. Original MKR supply was arbitrary but simple. No need to muddy it. MakerDAO has protocol level mint and burn mechanisms. There is no need to complicate that. This entire conversation is a distraction.  There is an illusion of massive funds generating thoughts on “what to do with it”.  Burn that idea, not any MKR. I urge those voted to burn or Abstained to change their vote.  If you do not, I may feel compelled to post a [Campaigning] topic and ask you a second time. 1 Million MKR were minted. Period. The protocol flops (mints) and flaps (burns). Period. It is simple. It is elegant. It is complete. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.411764705882352
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TheoRochaix",
                    "index": "#38",
                    "likes": "1",
                    "time": "27/05/2021-12:19:09",
                    "content": "Is there somewhere I can read learn about this “mint on demand” politics ? I am interested in understanding where this treasury management paradigm comes from ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#39",
                    "likes": "0",
                    "time": "27/05/2021-15:28:53",
                    "content": "A slightly unrelated question about the display on the poll. Here’s what I see right now  Screenshot 2021-05-27 at 11.26.27 PM1458×738 112 KB  If you count the number of avatars under each option, that’s 25 voters each for “Yes” and “No” each and 11 for “Abstain”. Yet the total is 68 voters, not 61. Also “Yes” has a larger percentage of the vote. Are some votes hidden or is there something else going on? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.9523809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#40",
                    "likes": "1",
                    "time": "27/05/2021-15:34:17",
                    "content": "Click the blue down arrows for it to update. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#41",
                    "likes": "1",
                    "time": "27/05/2021-15:34:41",
                    "content": " ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#42",
                    "likes": "0",
                    "time": "27/05/2021-15:37:48",
                    "content": "Hmm might be something wrong on my end but clicking on the arrow doesn’t change anything. My screenshot matches up with that of @LongForWisdom for the “Yes” voters. Anyway, doesn’t matter too much as long as others are seeing it correctly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 3.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mr.dorf",
                    "index": "#43",
                    "likes": "3",
                    "time": "27/05/2021-16:04:29",
                    "content": "This is a tough one. Both sides have merit. I voted no as we are already blind to the risks to the protocol. I cannot in good conscience burn 84,000 MKR knowing that we are in the early days of a digital financial experiment. That being said, I do think it is a waste to just hold the MKR. We will continue to re-hash the possible uses as it is the easiest solution to any future problem. Pro Burn: Positive PR, eliminate distraction and avoid unnecessary proposals on allocation, future minting available, possible price effects Pro Keep: Rainy day fund, better allocation of resources, legal consequences, minting is a PR disaster Is there room for a middle approach? Keep enough for one CU budget cycle, accelerate stability buffer so we can say that we tried our best to avoid the black swan event (#noregrets), and then burn the rest as a PR token. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.367929292929293
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#44",
                    "likes": "2",
                    "time": "27/05/2021-16:17:59",
                    "content": "Takes two clicks for me. Dunno, try a refresh, occasionally it’s buggy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nyophight",
                    "index": "#45",
                    "likes": "0",
                    "time": "27/05/2021-21:39:21",
                    "content": "I voted no. I think this provides an extremely useful opportunity to circumvent clunky regulation on ICOs in the event Maker were to attract Ripple-like regulatory attention for minting. That said, this is tempered by the fact that holding 84K of Maker could make the network a higher priority for regulatory scrutiny of other kinds. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#46",
                    "likes": "4",
                    "time": "28/05/2021-02:02:47",
                    "content": "I voted no. As someone with more than a decade of experience in financial journalism, and years in PR and communications, no positive PR would come out from this. And the cost of burning to get any PR does not make any sense. It isn’t the same thing but as an example from the financial world. Traditional companies buy back their shares because they deem the shares cheap or can’t figure out a better way to spend their cash. So two questions to answer here:   Is the process of building the MakerDAO ecosystem complete with massive Dai adoption that no funding at present or future is needed? (Minting new MKRs would undoubtedly be bad for MKR prices if we decide to burn what we have.)   In the future, will MKRs eventually be liquid enough for large institutional investors, even pension funds, seeking a stable return to come in? If you think the answer is yes, then the focus should be on gradually getting MKRs in the hands of more people.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.404477101845523
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#47",
                    "likes": "5",
                    "time": "28/05/2021-16:24:18",
                    "content": "I voted NO, we should not burn MKR. We should fund companies that help us set up and develop an only Dai ecosystem ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#48",
                    "likes": "0",
                    "time": "01/06/2021-01:25:04",
                    "content": "So it did occur to me that while this functionally doesn’t make a huge difference, it does have some minor accounting implications. If these are not burned, it does mean that from an accounting standpoint, total equity is reduced to account for the fact these tokens no longer circulate but are still outstanding. This should not come as a surprise as price*total MKR tokens = market cap is clearly not the actual equity of MKR holders until you subtract the 84,000 tokens held in treasury. Whereas, if they are burned – and actually all of the burning Maker has done to date – needs to be accounted for in one of several different methods. I suspect this is a massive headache for whomever has the unenviable task of trying to make a guesstimate balance sheet for Maker, since some of the methods require knowing what the original paid-in capital was (the original sale price of the tokens). I suspect we have not been tracking this (I’m not sure how you could without access to the Foundation’s books), so were I the person in charge of that, I’d probably prefer that the 84,000 not be burned, simply because it represents a significant amount of the tokens outstanding, and the number already burned are small enough to (with a footnote or other disclosure) ignore until we can really try to sit down with the Foundation and get all the information they have on their books to figure out what the paid-in capital was on original and BT token issuance to be. It’s pretty simple to deduct the 84,000 from equity, but likely a bit of an information hunt to coordinate with the Foundation (or maybe we don’t, since I’m not sure what happens when transferring contra equity to a successor entity?) how these would affect retained earnings or paid-in capital. That Maker is a bit of an accounting frontier and the unusual transition from Foundation to DAO of liabilities like debt guarantees (DAI outstanding are probably guaranteed debts for which we accept a premium to be the guarantor?) coupled with whatever basis the Foundation’s MKR are really makes this a nightmare. I think that @SebVentures is stuck with trying to hold together the rough draft financial statements until we can actually get them done in a more detailed manner, so I would suggest anyone voting on this defer to him as to his preference. The distinction between burned and not burned is not functionally different, but one or the other may save some grief in trying to get our books in order. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.352887426900584
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#49",
                    "likes": "3",
                    "time": "01/06/2021-05:00:30",
                    "content": "I can’t see how accounting issues are relevant. If there would be no accounting problems, there would be no accounting jobs. That’s the whole point of the profession. Activity ideally should have 0 dependency on the accounting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#51",
                    "likes": "2",
                    "time": "01/06/2021-17:58:48",
                    "content": "He means if he were in charge of the decision, he’d choose not burn it. It’s a hypothetical. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#52",
                    "likes": "1",
                    "time": "01/06/2021-19:00:23",
                    "content": "Hey when was the last time Maker Raised Money?? Everybody and their Uncle is raising money for their DeFi project–maybe use some of that 84 to strengthen/nourish Maker??? Easiest thing to do is to burn. The hardest is being woke enough to know the  difference between product-market fit and complete failure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.183333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#53",
                    "likes": "4",
                    "time": "02/06/2021-02:18:01",
                    "content": "I voted Yes because this was really a random unplanned transfer from the Foundation and the DAO trying to treat it in any special way will be a source of confusion forever. I think burning this MKR will put the DAO back on its original path. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.290178571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#54",
                    "likes": "1",
                    "time": "03/06/2021-17:03:10",
                    "content": "Could someone explain to me why there are 784.9 MKR valued at 2.859 million dollars sitting in the MKR contract? Are these tokens for all intents and purposes burned or are these tokens also in ownership of the DAO as it owns the address? https://etherscan.io/address/0x9f8F72aA9304c8B593d555F12eF6589cC3A579A2 I understand there is a transfer function within the smart contract however I am not knowledgeable enough to know that functions limitations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/James_Curtis",
                    "index": "#55",
                    "likes": "0",
                    "time": "03/06/2021-19:31:30",
                    "content": "You’d want to always burn available MKR or never burn available MKR.  The only way I’d never burn it is if it creates a new token distributed to MKR owners.  An inflation-beating dollar-max coin tied perpetually to a basket of commodity contracts which generates more coins with inflation or is allowed to go lower than a dollar if deflation occurs and always distribute to this new coin thereafter instead of burning future MKR.  And you can sell billions on the open market for a fee to anyone, funds instantly buy more commodities, fees buy more coins for MKR holders.  It would be just as desirable to buy it under a dollar if it dips. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.051136363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#56",
                    "likes": "0",
                    "time": "03/06/2021-19:47:14",
                    "content": "Just a side idea, it can be used as collateral with AAVE to withdraw dai. That will give us more room to boost our RWA as we would have more dai room in case of default. Therefore the SB or the flop won’t be the only way to source dai incase of default. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#57",
                    "likes": "0",
                    "time": "04/06/2021-05:28:04",
                    "content": "I think people are already worried that there’s too much MKR available on Aave and can lead to a governance attack. If we deposit this MKR there, it might be too much of a governance risk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#58",
                    "likes": "0",
                    "time": "04/06/2021-06:50:45",
                    "content": "    AstronautThis:  I think people are already worried that there’s too much MKR available on Aave and can lead to a governance attack. If we deposit this MKR there, it might be too much of a governance risk.   Fair enough it is probably a bad idea, but as a general idea it is equity. They can also disable lending on collateral. But yes I was one of them  to worry about aave and since the last vote the amount decrease and voter increase, I think we should thank people to have done it. And I am also way less worry since I realized nexos was the biggest one into AAVE. So I am sure it will move away if their found are at risk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.591666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/KriptoHayat",
                    "index": "#59",
                    "likes": "0",
                    "time": "04/06/2021-17:16:28",
                    "content": "If we burn this fund, we will have a fair share. But we can support Lobby activities instead! Kripto, Kripto Hayat ",
                    "links": [
                        "https://kriptohayat.com/kripto-hayat"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kwadrax",
                    "index": "#60",
                    "likes": "3",
                    "time": "05/06/2021-10:14:55",
                    "content": "My 2 cents, I abstained, not because I’m against a burn but I would prefer to see that MKR (at least partially) distributed among executive voters, proportional to their vote count over the years and irregardless of the amount of MKR they voted with. It would bring extra MKR into circulation which would add downward pressure on the price for a while but also increase peoples voting weight for those who actually participated in and supported governing the system over the years at the benefit of the entire Ethereum ecosystem and versus those just holding MKR surfing on the actions of others. I’m also pro air-dropping some MKR to vault owners to increase distribution some more. In short, partial burn, partial reward for voters, partial airdrop to vault owners. All numbers to be discussed of-course if this has support from others. anecdotal but still …  twitter.com    찌 G 跻 じ MBA, CFA, FRM, CFP, NGMI, HFSP, HENTAI (DegenSpartan)  the best part about my $MKR strategy is that i do fuckall and the hardworking community pumps my bags while i scream autistically at them that its a piece of shit twitter.com/DegenSpartan/s… 찌 G 跻 じ MBA, CFA, FRM, CFP, NGMI, HFSP, HENTAI @DegenSpartanscenario 1 (default scenario): $MKR goes to $0 and my bags go to zero, but im right - always have been  scenario 2: MKR holders are pissed off and pump it, im rich  checkmate losers https://t.co/0EYHoycrWk https://t.co/pYFVHmRIQJ    2:44 AM - 31 May 2021     120          2            ",
                    "links": [
                        "https://twitter.com/DegenSpartan/status/1399195068024573952",
                        "https://twitter.com/DegenSpartan/status/1339041244849139712",
                        "https://twitter.com/DegenSpartan/status/1339041244849139712",
                        "https://twitter.com/DegenSpartan/status/1399195068024573952"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.353571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#61",
                    "likes": "2",
                    "time": "09/06/2021-22:16:48",
                    "content": "Amazing turnout! Talk about controversial! Polling ends tomorrow so get your votes in ASAP! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0234375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#62",
                    "likes": "1",
                    "time": "10/06/2021-07:03:25",
                    "content": "    Aaron_Bartsch:  Polling ends tomorrow so get your votes in ASAP!   voted! thanks for the reminder! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#63",
                    "likes": "2",
                    "time": "10/06/2021-23:16:20",
                    "content": "It was a heated battle but in the end the \"No\"s take it away. Thank you everyone for participating! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#64",
                    "likes": "0",
                    "time": "11/07/2021-09:17:15",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}