{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/thank-you-rich-brown/3379",
            "title": "Thank you Rich Brown  ",
            "index": 3379,
            "category": [
                "Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Jeffshaw",
                    "index": "#1",
                    "likes": "29",
                    "time": "26/07/2020-19:30:58",
                    "content": "@rich.brown We appreciate and thank you for your leadership in moderating the governance calls and hope you continue to be an active member of the community. On the governance calls, your dry humor was never wasted, your strategic direction was spot on, your ability to build healthy constructive dialog has been uncanny, all while being extremely modest on the impact your contributions have had to the success of the Project. Let’s share a few of our favorite moments on this thread in tribute/roast fashion… For me, a couple:  Rambling introductory preamble to the weekly governance calls Making awkward silences just a bit more awkward by calling them out  ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-5/3406",
                        "https://forum.makerdao.com/t/mip0c13-sp1-subproposal-for-core-personnel-offboarding/3508"
                    ],
                    "GPT-summary": "",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "None"
                    ],
                    "Sentiment": 5.322916666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#2",
                    "likes": "6",
                    "time": "27/07/2020-03:55:22",
                    "content": "    Jeffshaw:  Making awkward silences just a bit more awkward by calling them out   Haha, this might be the greatest awkward silence of all, 8 hours before I cracked…  Thanks for the thanks @Jeffshaw. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "6",
                    "time": "27/07/2020-17:12:23",
                    "content": "@rich.brown I still remember that as a Pleb I reached out to you via Twitter and ask if I could participate in Maker Governance with less than 1 MKR token – and you wrote back, “every vote counts” and since then–I’ve never looked back–you gave me the confidence to build and participate. Thank you Rich Brown–thank you for putting up with my sh*t posting, my Wu-Tang tendencies, etc., you are inspiring and you will be miss. Cheers! All the best, -El Pro ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.833333333333334
                }
            ]
        }
    ]
}