{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/psm-gusd-a-collateral-onboarding-risk-evaluation/11559",
            "title": "[PSM-GUSD-A] Collateral Onboarding Risk Evaluation ",
            "index": 11559,
            "category": [
                "Collateral Onboarding",
                "Domain Work"
            ],
            "tags": [
                "risk-domain-work",
                "gusd",
                "psm-gusd-a"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Sean",
                    "index": "#1",
                    "likes": "4",
                    "time": "10/11/2021-16:20:04",
                    "content": "Legal Disclaimer: This communication is provided for information purposes only. This communication has been prepared based upon information, including market prices, data and other information, from sources believed to be reliable, but Maker has not independently verified such information and makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only, and should not be relied upon as legal, business, investment, or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only, and do not constitute any recommendation for any action or an offer to provide investment advisory services. This content is not directed at nor intended for use by the MakerDAO community (“MakerDAO”), and may not under any circumstances be relied upon when making a decision to purchase any other digital asset referenced herein. The digital assets referenced herein currently face an uncertain regulatory landscape in not only the United States but also in many foreign jurisdictions, including but not limited to the UK, European Union, Singapore, Korea, Japan and China. The legal and regulatory risks inherent in referenced digital assets are not the subject of this content. For guidance regarding the possibility of said risks, one should consult with his or her own appropriate legal and/or regulatory counsel. Charts and graphs provided within are for informational purposes solely and should not be relied upon when making any decision. The content speaks only as of the date indicated. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in these materials are subject to change without notice and may differ or be contrary to opinions expressed by others.  Summary Proposed Risk Parameters Overview Metrics and Analysis Risk Parameters   Summary Proposed Risk Parameters Debt ceiling: 100m DC-IAM gap: 10m DC-IAM ttl: 24h Fee in (tin): 0% Fee out (tout): 0%  Overview The first GUSD risk assessment by the @Risk-Core-Unit, “[GUSD] Collateral Onboarding Risk Evaluation”, was published in October, 2020. The following risk evaluation addresses a possible Gemini Dollar (GUSD) Peg Stability Module (PSM). This is in response to the GUSD-PSM proposal posted on the Maker Forum on October 22, 2021. This report presents updated GUSD data that will serve as a benchmark to evaluate GUSD specific risks and to set appropriate risk parameters for the PSM-GUSD-A vault.  Project Summary GUSD is a stablecoin issued on Ethereum, backed 1:1 by the US dollar. The GUSD stablecoin was first introduced in September, 2018. For each GUSD issued, Gemini receives one corresponding US dollar from its users. The primary channel to buy and sell GUSD is the Gemini Exchange, where the largest and most liquid trading pair is GUSD/USD. Gemini offers zero fees for buying and selling GUSD through the Gemini Exchange. According to a GUSD independent audit by BPM, the underlying USD is held across: (i) one or more omnibus bank accounts at depository institutions insured by the Federal Deposit Insurance Corporation (FDIC), and/or (ii) one or more money market accounts, collectively referred to as “Gemini dollar Accounts”.  Metrics and Analysis  Supply and Market Share One year ago, when the first GUSD risk assessment was carried out, the circulating supply of GUSD was circa 14 million GUSD. At the time of writing, the circulating supply is one order of magnitude higher, approximately 150 million GUSD. During this period, GUSD experienced a new all-time high, reaching 327 million in July, 2021.  Chart1358×742 28.3 KB  Source: Coinmetrics The cryptoasset ecosystem in general, and other stablecoin projects in particular, have also experienced significant growth. The chart below illustrates the GUSD market share versus the top 10 stablecoins by market capitalization. GUSD is currently number 16 in terms of market capitalization and holds circa 0.1% of the stablecoin market share compared to the top 10 stablecoin projects. GUSD has not captured any significant market share compared to one year ago.  Chart1200×742 27.9 KB  Source: CoinGecko  DeFi Presence The number of unique addresses holding GUSD has increased by 157% since October, 2020.  1058×658 87.1 KB  Source: Nansen GUSD has been onboarded to several DeFi platforms, such as: Curve, Balancer, Uniswap, Maker, Aave, Yearn, and 1Inch. However, the holder distribution is currently skewed towards the Gemini Exchange. As illustrated in the pie chart below, the wallet “Gemini 4” holds circa 54% of all GUSD supply. According to jg_gemini, these funds represent holdings by Gemini exchange clients. The low presence of GUSD, despite the availability on several DeFi platforms, suggests that DeFi is not currently the primary use case for most GUSD holders.  1600×541 303 KB  Source: Etherscan Earlier this year, however, a large portion of GUSD was allocated to Curve. The chart below shows that GUSD utilisation on Curve reached an all-time high on April 7, 2021 of 108 million GUSD. The total GUSD supply on April 7, 2021 was approximately 132 million GUSD. In other words, on this date circa 81% of all GUSD was locked in Curve. After this date, however, Curve and Gemini experienced a seemingly inverse relationship in terms of GUSD holdings. Today, Gemini holds 54% of all GUSD, while circa 6.7% of all GUSD is locked in Curve. According to Etherscan, Curve is still the DeFi protocol with the largest GUSD holdings. One reason for the increased supply volatility, according to jp_gemini, could have been the rising cryptoassets prices, leading to less demand for GUSD exposure.  1600×523 122 KB  Source: Nansen  Price Volatility One key concern in the previous risk assessment was the high volatility of GUSD compared to other stablecoins. GUSD is still more volatile than most stablecoins on the market. The chart below compares the daily volatility of GUSD with USDT, DAI, USDC, BUSD, TUSD, and USDP for 30d and 180d time periods.  Chart1600×989 183 KB  Source: Coinmetrics  Daily Volume Traded As illustrated in the chart below, the vast majority of GUSD volume is on the Gemini Exchange. Other centralised exchanges that support GUSD include OKEX, Bitfinex, Cexio and Bitstamp. CEX Volume - GUSD  883×450 46.8 KB  Source: Cryptocompare However, these exchanges account for less than $200k trading volume per day on average. CEX Volume - GUSD (Excluding Gemini Exchange)  883×450 41 KB  Source: Cryptocompare  On-chain transactions and median transaction value The average daily transaction count in 2020 was 125. In 2021, the average daily transaction count increased to 609.  Chart1292×742 36.9 KB  Source: Coinmetrics In 2020, the average daily median transaction value was 880. In 2021, it was 1916.  Chart1200×742 38.1 KB  Source: Coinmetrics  Risk Parameters The GUSD PSM proposal suggested setting the DC for PSM-GUSD-A at 500m, with a starting value of 50m, and then to be fully increased after launch. We believe, however, that 500m may be too high. There are several reasons for this. First, at the time of writing, the GUSD supply is approximately 150 million. Generally speaking, it is always risky for Maker to hold the majority of the supply of a specific cryptoasset. Second, despite GUSD being available on several DeFi platforms, GUSD utilisation has been very low in general in the DeFi ecosystem. Third, GUSD, compared to other stablecoins, is relatively volatile. This is probably due to the lack of secondary markets, and hence active market makers. For the reasons mentioned above, the Risk Core Unit believes that a more reasonable debt ceiling would initially be 100m. This would most likely result in Maker holding a bit less than 50% of all GUSD supply after utilisation. We may be able to increase the debt ceiling once we witness more organic growth of GUSD. The GUSD PSM proposal suggested setting fee in (tin) and fee out (tout) to 0.1% and 0% respectively. However, since a signal setting tin/tout for PSMs to 0% passed in a recent executive vote, we have set the proposed tin and tout parameters to 0% for GUSD as well. Debt ceiling: 100m DC-IAM gap: 10m DC-IAM ttl: 24h Fee in (tin): 0% Fee out (tout): 0% Sources:  MakerDAO; Proposal: GUSD PSM ; November, 2021 MakerDAO; [GUSD] Collateral Onboarding Risk Evaluation ; November, 2021 BPM; Gemini Dollar and Cash Balances As of September 30th, 2021 ; November, 2021 Coinmetrics; https://coinmetrics.io/ ; November, 2021 CoinGecko; Cryptocurrency Prices, Charts, and Crypto Market Cap | CoinGecko ; November, 2021 Nansen; https://www.nansen.ai/ ; November, 2021 Etherscan; https://etherscan.io/ ; November, 2021  ",
                    "links": [
                        "https://forum.makerdao.com/t/proposal-gusd-psm/11148",
                        "https://assets.ctfassets.net/jg6lo9a2ukvr/1WR6Rpk77nanILlKSZ4uE1/96d0134b3f1f64413a63238ee60bc69a/Gemini_Dollar_Examination_Report_09-30-21__1_.pdf",
                        "https://coinmetrics.io/",
                        "https://www.coingecko.com/en/categories/stablecoins",
                        "https://www.nansen.ai/",
                        "https://www.gemini.com/blog/gemini-dollar-surpasses-usd100m-market-cap-as-defi-soars",
                        "https://forum.makerdao.com/t/proposal-gusd-psm/11148/7",
                        "https://etherscan.io/token/tokenholderchart/0x056fd409e1d7a124bd7017459dfea2f387b6d5cd",
                        "https://forum.makerdao.com/t/proposal-gusd-psm/11148/7",
                        "https://www.nansen.ai/",
                        "https://coinmetrics.io/",
                        "https://www.cryptocompare.com/",
                        "https://www.cryptocompare.com/",
                        "https://coinmetrics.io/",
                        "https://coinmetrics.io/",
                        "https://forum.makerdao.com/t/proposal-gusd-psm/11148",
                        "https://forum.makerdao.com/t/proposal-gusd-psm/11148",
                        "https://forum.makerdao.com/t/signal-request-set-psm-fees-to-0/10894",
                        "https://vote.makerdao.com/executive/template-executive-vote-parameter-changes-core-unit-budget-distribution-november-5-2021?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/proposal-gusd-psm/11148",
                        "https://forum.makerdao.com/t/gusd-collateral-onbording-risk-evaluation/4791",
                        "https://assets.ctfassets.net/jg6lo9a2ukvr/1WR6Rpk77nanILlKSZ4uE1/96d0134b3f1f64413a63238ee60bc69a/Gemini_Dollar_Examination_Report_09-30-21__1_.pdf",
                        "https://coinmetrics.io/",
                        "https://www.coingecko.com/en",
                        "https://www.nansen.ai/",
                        "https://etherscan.io/",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-november-2021/11914",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/7",
                        "https://forum.makerdao.com/t/under-construction/12274/12",
                        "https://forum.makerdao.com/t/executive-vote-notice-3f-delegate-cannot-support-an-increase-of-the-gusd-psm-debt-ceiling/13461",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-4th-november-11th/11591",
                        "https://forum.makerdao.com/t/informal-poll-curve-basepool-composition/15347"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.504570707070707
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/02/2022-16:20:08",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/curvelp-steth-eth-collateral-onboarding-risk-evaluation/11224",
            "title": "[CurveLP-stETH-ETH] Collateral Onboarding Risk Evaluation ",
            "index": 11224,
            "category": [
                "Collateral Onboarding",
                "Domain Work"
            ],
            "tags": [
                "risk-domain-work",
                "curve",
                "curvelp-steth-eth"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Sean",
                    "index": "#1",
                    "likes": "14",
                    "time": "27/10/2021-12:44:32",
                    "content": "Legal Disclaimer: This communication is provided for information purposes only. This communication has been prepared based upon information, including market prices, data and other information, from sources believed to be reliable, but Maker has not independently verified such information and makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only, and should not be relied upon as legal, business, investment, or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only, and do not constitute any recommendation for any action or an offer to provide investment advisory services. This content is not directed at nor intended for use by the MakerDAO community (“MakerDAO”), and may not under any circumstances be relied upon when making a decision to purchase any other digital asset referenced herein. The digital assets referenced herein currently face an uncertain regulatory landscape in not only the United States but also in many foreign jurisdictions, including but not limited to the UK, European Union, Singapore, Korea, Japan and China. The legal and regulatory risks inherent in referenced digital assets are not the subject of this content. For guidance regarding the possibility of said risks, one should consult with his or her own appropriate legal and/or regulatory counsel. Charts and graphs provided within are for informational purposes solely and should not be relied upon when making any decision. The content speaks only as of the date indicated. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in these materials are subject to change without notice and may differ or be contrary to opinions expressed by others.  Summary Proposed Risk Parameters Overview Metrics and Analysis Risk Parameters   Summary Proposed Risk Parameters Stability Fee: 4.5% Liquidation Ratio: 155% Debt Ceiling: 5m DC-IAM gap: 3m DC-IAM ttl: 8h Cut: 0.99 Step: 90 seconds Buf: 1.30 Cusp: 0.4 Tail: 140 minutes Chip: 0.1% Tip: 300 DAI Ilk.chop: 13% Tolerance: 0.5 Ilk.hole: 3m DAI Dust: 10.000 DAI  Overview This assessment examines the Curve ETH/stETH LP token (steCRV) as potential Maker Vault collateral. It focuses on the Curve platform and the ETH/stETH liquidity pool. It should be noted that this assessment is not related to the onboarding of stETH as its own collateral. The @Risk-Core-Unit has already released a separate collateral onboarding risk evaluation specifically for stETH, which can be found here. The WSTETH-A vault type passed in an executive on October 26, and will be available for execution on October 28. Hence, this assessment will exclude a number, but not all, topics and metrics that were assessed in the stETH report.  Protocol Summary Curve is a decentralized exchange (DEX) that mainly offers liquidity pools between token pairs with similar characteristics and that peg to the same value. The benefit of the Curve AMM design, compared to other AMMs that offer liquidity pools with non-pegged tokens, is more efficient token trading, with lower slippage and better capital efficiency. One example is the 3pool, which contains DAI+USDC+USDT. It should also be noted that Curve has recently introduced an additional AMM design for non-pegged tokens that offer a different set of trade-offs. The first iteration of Curve was conceptualised in the whitepaper “StableSwap - Efficient Mechanism for Stablecoin Liquidity”, published on November 10, 2019, by Michael Egorov. The project was later launched in January 2020 as Curve Finance. In August 2020, an anonymous developer, with the handle @0xc4ad front run and deployed smart contracts for the CRV token and Curve DAO, without the knowledge of the Curve team. After initial scepticism and caution, the team and community finally acknowledged the traction and adopted the governance token, CRV, and the DAO. In January 2021, soon after the introduction of the Lido project, the ETH/stETH liquidity pool was launched on Curve. stETH is a derivative token that represents staked ETH on the Beacon Chain. When users stake ETH through Lido, they receive newly minted stETH. The token rebases to reflect the amount of ETH staked through Lido, plus staking rewards, less penalties. stETH is a liquid alternative to staked ETH. It can be transferred, traded, and used within other DeFi protocols and applications. Once staking withdrawals are available on Ethereum, users will be able to burn their stETH, and subsequently redeem their ETH from Lido. The ETH/stETH liquidity pool on Curve enables secondary market liquidity between stETH and ETH. By allowing ETH/stETH swaps, Curve essentially offers users a solution to unstake their ETH from Lido, before staking withdrawals are enabled on Ethereum.  Tokenomics Users who provide liquidity to Curve pools receive liquidity provider (LP) tokens in return. LP tokens signify a user has provided liquidity to a pool and attract trading fee rewards. Curve uses the notion of a “liquidity gauge” to measure the amount of liquidity provided by a particular user. Users can stake their LP tokens in a gauge, and in return receive CRV tokens, and sometimes other incentivised rewards, depending on which gauge is being used. The number of tokens received depend on the CRV inflation rate and the liquidity gauge weighting for a specific pool, which is voted on by the Curve DAO. The rewards can be boosted by a factor of up to 2.5x if a user decides to vote-lock their CRV tokens for a period of up to 4 years. A longer vote-lock period results in more veCRV (voting escrow CRV). veCRV allows users to participate in Curve governance. The process of providing liquidity, receiving LP tokens, and staking the LP tokens into a gauge can be executed automatically on the Curve front-end. For the ETH/stETH pool specifically, liquidity providers collectively earn 0.02% from each trade in the pool. The fees earned are then split proportionally to the LP’s share of the pool. Liquidity providers are also able to earn both CRV tokens and LDO tokens as incentivised rewards when they stake steCRV in the ETH/stETH gauge. In addition, the stETH token earns staking rewards as per Lido staking APR. From a user experience perspective, the steCRV adapter works like any other Maker Vault. Instead of staking steCRV in the ETH/stETH gauge, users deposit steCRV as collateral. The steCRV tokens are then automatically inserted into the LDO rewards contract, rather than staked in the ETH/stETH gauge. As a result, users will not receive CRV rewards, but will still enjoy the trading fee and LDO incentivised rewards. steCRV vault owners receive the rewards when they interact and initiate a transaction with the CropJoin adapter.  Metrics and Analysis  Total Value Locked (TVL) on Curve, Lido, and the ETH/stETH pool At the time of writing, Curve’s total value locked (TVL) in USD terms is approximately $15.15 billion. Circa 1.418 million ETH ($5.94 billion) is being staked through Lido, which means that approximately 1.418 million stETH is currently in circulation. The ETH/stETH liquidity pool is the largest on Curve, with $5.16 billion locked in currency reserves. The composition of the pool is currently 737,842 stETH (57.8%) and 538,668 ETH (42.2%). The share of total stETH in the ETH/stETH pool is illustrated in the chart below. Currently, circa 52.1% of all stETH liquidity is locked in the pool. More recently, the wstETH/WETH Stable Pool on Balancer has increased in stETH liquidity. At the time of writing, the pool contains 57,624 wstETH (56.9%) and 43,593 WETH (43.1%). stETH on Exchanges  1600×345 164 KB  Source: @KIV Dune Analytics  ETH/stETH Curve pool balance ETH and stETH deposits have increased rapidly in tandem. The intended balance in the pool is 50% stETH and 50% ETH. As shown in the chart below, the amount of stETH deposits have on some occasions decoupled from the amount of ETH deposits. Recently, the amount of ETH in the pool decreased, while users continued to add more stETH. This led to the most unbalanced proportions in the ETH/stETH pool history, reaching 725,801 stETH (68%) and 341,837 ETH (32%) on September 11, 2021. Curve ETH/stETH Balance  1600×344 204 KB  Source: @KIV Dune Analytics According to Lido’s analysis, there were two reasons for the imbalance: (i) Cyclical abuse of the Lido referral programme: The referral programme was exploited by a number of users, effectively receiving stETH referral rewards and thereafter selling it to the ETH/stETH pool. After this, Lido changed to a whitelisted approach, where only approved users were eligible to receive rewards. (ii) Arbitrum yield farming leading to relatively more attractive ETH yields: Shortly after the public release of Arbitrum, some projects offered ETH yield farming opportunities with higher APY than the ETH/stETH incentivised rewards. This resulted in liquidity providers withdrawing ETH from the ETH/stETH pool, to allocate in other farms. It is worth noting that before staking withdrawals are enabled on Ethereum, stETH will tend to trade at a discount to ETH in the ETH/stETH pool. By staking with Lido, you can always receive 1 stETH for 1 ETH. As a result, the higher bound of the stETH price is relatively fixed. Meanwhile, there may be ETH specific yield farming opportunities offering higher rates elsewhere. This implies that there may be a risk of stETH selling pressure within the Curve pool. As the date of the staking withdrawal implementation approaches, the potential for a stETH discount is likely to decrease. There is one key reason for this: when stETH is trading at a discount, a time-based arbitrage opportunity emerges. Arbitrageurs can buy stETH at a discount, and then after the staking withdrawal implementation, they can withdraw ETH from Lido at a 1:1 relationship, hence profiting in ETH terms. A higher stETH discount will likely lead to increased arbitrage demand until stETH trades at parity with ETH.  Token Distribution Liquidity providers of the ETH/stETH pool can choose to either hold steCRV tokens or stake the steCRV tokens in the ETH/stETH gauge. Hence, it is worth including two separate charts to get a more holistic picture of the token distribution.  steCRV token holders As illustrated by the pie chart below, the vast majority of steCRV tokens (98.7%) are deposited in the liquidity farming reward contract (steCRV Gauge Deposit). This may change if steCRV is accepted as vault collateral and users decide to use steCRV in Maker instead.  1600×797 86.8 KB  Source: Etherscan  steCRV + steCRV gauge holders The pie chart below shows the distribution of the top liquidity providers of the steCRV gauge. The largest steCRV + steCRV gauge holder contract is from Convex Finance. Staking through Convex is achieved by providing liquidity to the ETH/stETH Curve pool (without staking directly into the gauge), and then staking the steCRV LP tokens through Convex. Liquidity providers are incentivized to stake through Convex as they earn additional CRV tokens on top of the native rewards from the ETH/stETH liquidity gauge.  1600×713 158 KB  Source: Etherscan  Historical Returns - Fees and Incentivised Rewards Currently, the daily base vAPY (variable APY from trading fee rewards) for the ETH/stETH pool is 2.9%. Meanwhile, the annualized tAPY (token APY) is 0.07% from CRV tokens (0.17% with max boost) + 2.94% in LDO tokens. In addition, the stETH APR is currently 4.9%. However, if a user decides to only deposit stETH, the pool will reallocate the balance into both ETH and stETH, effectively reducing the stETH balance and hence the original stETH APR. It is also worth noting that the tAPY is based on the current price of the reward tokens and the reward rates. This means that the tAPY may change over time since the underlying reward tokens are subject to high volatility. The chart below illustrates the LDO incentive reward scheme from the inception of the ETH/stETH liquidity pool up until October 2021. Lido has recently decided to diversify its LDO rewards to other protocols, such as Balancer and Sushi. At the time of writing, 43.45 million LDO tokens have been allocated to Curve. Lido has publicly stated that they are committed to incentivise the pool at least until the merge and staking withdrawals are enabled.  1600×414 220 KB  Source: @LidoAnalytical Dune Analytics We believe that it is justifiable to set a higher stability fee of 4.5% initially. This is because the APY from the steCRV adapter will on average be higher than 4.5%. Lido’s commitment to incentivise liquidity until the withdrawal implementation will likely maintain rates for the foreseeable future. We also believe that other factors such as optimistic market outlook and the lack of competitive alternatives will likely maintain sufficient vault demand. However, when/if Lido decides to disable LDO incentivised rewards, the APY will likely decrease considerably.  CEX and DEX Volumes  steCRV Trading Activity steCRV is an LP token with essentially no direct trading activity. One way to understand the liquidity of steCRV is by assessing the liquidity of stETH and ETH. Keepers can liquidate steCRV positions by withdrawing the underlying assets from the pool and selling them. stETH got listed on FTX on October 26 2021, which marks the beginning of stETH trading on large centralised exchanges. The majority of DEX stETH liquidity is currently on Curve. The chart below shows the trading volume for stETH. To get base numbers, toggle off DEX aggregators in the legend within Dune Analytics.  1600×424 65.8 KB  Source: @KIV DuneAnalytics  Downside Risk The ETH/stETH pool works with the same pricing model as Curve stablecoin pools, where the assumption is that the two assets are roughly equal in value. Hence, the downside risk of steCRV should theoretically be the same as for ETH, with the added price discrepancies that stETH and ETH may experience. stETH has been able to accurately hold the value of ETH, with the lowest drop in price being on March 24 (95.8% of ETH). At the time of writing, the stETH:ETH peg is 99.3%.  1600×714 120 KB  Source: @KIV Dune Analytics The ETH/stETH pair is currently very liquid. The chart below shows the slippage curve for the stETH-ETH trading pair on the 1Inch DEX aggregator. Selling $1 billion worth of stETH through 1Inch would incur a -1% slippage on price. On-chain Price Slippage - Pair: stETH-ETH  1326×792 52.7 KB  Source: Blockanalitica  DeFi Presence Since the inception of the ETH/stETH liquidity pool on Curve in January 2021, both Curve and Lido have grown rapidly in users, liquidity, and market share. Lido has been able to capture a considerable market share in the ETH staking provider market - currently, circa 8 million ETH is being staked, and approximately 1.418 million ETH is staked with Lido. Curve was one of the first DeFi protocols to join forces with Lido. As a result, Curve has been able to attract the majority of stETH liquidity (52.1%) to the ETH/stETH liquidity pool. This essentially means that circa 9.2% of all staked ETH is locked in the ETH/stETH liquidity pool on Curve. Curve and Lido have created a symbiotic relationship, providing users with a liquid staked ETH alternative in an otherwise illiquid environment. As long as the demand for liquid staked ETH continues to rise, both Lido and Curve may continue to capture market share in the staking provider market. However, it is not clear if the ETH/stETH Curve pool will be able to protect its market share once staking withdrawals are enabled on Ethereum. The pool might continue to exist as a staking derivative, however, one of the main use cases of the pool is to unstake ETH. If users can unstake directly on Ethereum through staking providers (including Lido), or through other exchanges, liquidity in the ETH/stETH pool may decline. For example, in January 2021, circa 88.1% of all stETH liquidity was in the ETH/stETH pool. Today, it is 52.1%. The market share may further decrease if pool incentive rewards are reduced or discontinued altogether. Nevertheless, the merge and ETH staking withdrawals will most likely not happen until Q1/Q2 2022. The subsequent effects in regards to the ETH/stETH pool can only be accurately quantified once relevant data is available, after the implementation of staking withdrawals.  Summary of Notable Risks or Red Flags   Market Risk: Recent events revealed that the ETH/stETH pool risks becoming unbalanced due to several market dynamics. However, the pool has rebalanced relatively well. The potential stETH discount in the ETH/stETH pool may remain or reappear on occasions until staking withdrawals are enabled on Ethereum. This is due to the relatively fixed upper bound on stETH price and the possibility of other more attractive ETH yield farms that can incentivise liquidity providers to allocate ETH elsewhere.   Execution risk of the Ethereum 2.0 roadmap: There is currently only an approximate planned date for the merge and staking withdrawal implementation (Q1/Q2, 2022). This date risks being delayed if some unexpected hurdle appears. If the plan is delayed, this may have implications on the stETH discount. Furthermore, in case there is a crucial bug in the withdrawal implementation that restricts or disables ETH withdrawals on the Ethereum protocol level, the ETH/stETH pool may experience a long squeeze event. Users may then decide to withdraw ETH, which would lead to significant sell pressure on stETH in the pool. This would trigger a highly unbalanced liquidity pool and drop in stETH price.   Competition risk: The ETH/stETH Curve pool risks losing its competitive advantage of being able to unstake ETH as more exchanges onboard stETH/ETH or stETH/USD pairs. In addition, when staking withdrawals are enabled on Ethereum, staking providers will be able to unstake themselves.   Smart Contract Risk on Curve and Lido: Onboarding steCRV as collateral implies an increased smart contract risk from both Curve and Lido. Both platforms have been audited. However, security vulnerabilities or errors may have unintended consequences on the steCRV-CROP adapter.    Proposed Risk Parameters Stability Fee: 4.5% Liquidation Ratio: 155% Debt Ceiling: 5m DC-IAM gap: 3m DC-IAM ttl: 8h Cut: 0.99 Step: 90 seconds Buf: 1.30 Cusp: 0.4 Tail: 140 minutes Chip: 0.1% Tip: 300 DAI Ilk.chop: 13% Tolerance: 0.5 Ilk.hole: 3m DAI Dust: 10.000 DAI  1600×706 103 KB  A link to our model specification with inputs and outputs can be found here. Lead Researcher: @Sean Sources:  MakerDAO; [stETH] Collateral Onboarding Risk Evaluation; October 2021 Messari; https://messari.io/ ; October 2021 Etherscan; https://etherscan.io/ ; October 2021 Block Analitica; https://maker.blockanalitica.com/ ; October 2021 DeFi Pulse; https://defipulse.com/ ; October 2021 CoinGecko; https://www.coingecko.com/en ; October 2021 Dune Analytics; https://dune.xyz/ ; October 2021 Lido Blog; How To: Providing stETH liquidity via Curve; October 2021 Curve DAO token whitepaper; Curve DAO; October 2021 StableSwap Whitepaper; StableSwap - efficient mechanism for Stablecoin liquidity; October 2021 Curve Finance; https://curve.fi/ ; October 2021 Beacon Chain Explorer; https://beaconcha.in/ ; October 2021  ",
                    "links": [
                        "https://vote.makerdao.com/executive/template-executive-vote-parameter-changes-wsteth-a-onboarding-october-22-2021?network=mainnet#proposal-detail",
                        "https://curve.fi/3pool",
                        "https://resources.curve.fi/base-features/understanding-crypto-pools",
                        "https://curve.fi/files/stableswap-paper.pdf",
                        "https://twitter.com/0xc4ad",
                        "https://twitter.com/0xc4ad/status/1293977012550467584",
                        "https://lido.fi/",
                        "https://lido.fi/faq",
                        "https://whitepaper.io/document/621/curve-dao-token-whitepaper",
                        "https://defipulse.com/curve-finance",
                        "https://lido.fi/ethereum",
                        "https://etherscan.io/token/tokenholderchart/0xae7ab96520de3a18e5e111b5eaab095312d7fe84",
                        "https://curve.fi/steth",
                        "https://app.balancer.fi/?utm_source=medium&utm_medium=blog&utm_campaign=metastablepools#/pool/0x32296969ef14eb0c6d29669c550d4a0449130230000200000000000000000080",
                        "https://dune.xyz/queries/55711/110345",
                        "https://dune.xyz/queries/36557/72603",
                        "https://twitter.com/LidoFinance/status/1437124279057977344",
                        "https://www.delphidigital.io/reports/yield-strats-27-farms-on-arbitrum-airdrops-and-redeemable-nft-rewards/",
                        "https://blog.lido.fi/concerning-steth-liquidity/",
                        "https://etherscan.io/token/tokenholderchart/0x06325440d014e39736583c165c2963ba99faf14e",
                        "https://etherscan.io/token/tokenholderchart/0x182b723a58739a9c974cfdb385ceadb237453c28",
                        "https://curve.fi/steth/stats",
                        "https://blog.lido.fi/concerning-steth-liquidity/",
                        "https://dune.xyz/queries/125408/249418",
                        "https://dune.xyz/embeds/56368/111911/db47ec88-9304-464a-a69d-5ff98a70ef94",
                        "https://dune.xyz/embeds/55803/110638/dcccf191-28a2-4060-b5cb-163d883d5f23",
                        "https://app.1inch.io/#/1/swap/stETH/ETH",
                        "https://maker.blockanalitica.com/assets/STETH/",
                        "https://beaconcha.in/",
                        "https://lido.fi/ethereum",
                        "https://ethereum.org/en/eth2/merge/",
                        "https://www.investopedia.com/terms/l/longsqueeze.asp#:~:text=A%20long%20squeeze%20occurs%20when,protect%20against%20a%20dramatic%20loss.",
                        "https://maker.blockanalitica.com/vaults/onboarding/stETH/",
                        "https://forum.makerdao.com/t/steth-collateral-onboarding-risk-evaluation/9061",
                        "https://messari.io/",
                        "https://etherscan.io/",
                        "https://maker.blockanalitica.com/",
                        "https://defipulse.com/",
                        "https://www.coingecko.com/en",
                        "https://dune.xyz/",
                        "https://blog.lido.fi/providing-steth-liquidity-via-curve-to-receive-rewards/",
                        "https://whitepaper.io/document/621/curve-dao-token-whitepaper",
                        "https://curve.fi/files/stableswap-paper.pdf",
                        "https://curve.fi/",
                        "https://beaconcha.in/",
                        "https://forum.makerdao.com/t/curvelp-steth-eth-parameters-adjustment/13767",
                        "https://forum.makerdao.com/t/maker-relay-ep-69-en-espanol/11439",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-october-2021/11352",
                        "https://forum.makerdao.com/t/maker-relay-ep-69/11345",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/propuesta-de-cambios-de-parametros-inmediatos-y-de-corto-plazo-para-crvv1ethsteth-a-incremento-de-dc-y-gap/14618",
                        "https://forum.makerdao.com/t/reth-collateral-onboarding-risk-evaluation/15286",
                        "https://forum.makerdao.com/t/immediate-short-term-parameter-changes-proposal-for-crvv1ethsteth-a-dc-and-gap-increase/14476",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-21st-october-28th/11262"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.541207564365459
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "25/01/2022-12:45:26",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/untangled-finance-collateral-onboarding-risk-evaluation/12006",
            "title": "Untangled Finance - Collateral Onboarding Risk Evaluation ",
            "index": 12006,
            "category": [
                "Collateral Onboarding",
                "Domain Work"
            ],
            "tags": [
                "risk-domain-work",
                "real-world-finance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#1",
                    "likes": "8",
                    "time": "05/12/2021-13:11:20",
                    "content": "RWA collateral onboarding risk evaluation template Legal Disclaimer: This communication is provided for information purposes only. This communication has been prepared based upon information, including market prices, data and other information, from sources believed to be reliable, but such information has not independently been verified and this communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only, and should not be relied upon as legal, business, investment, financial or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only , and do not constitute any recommendation for any action or an offer to provide investment, financial or other advisory services. This content is not directed at nor intended for use by the MakerDAO community (“MakerDAO”), and may not under any circumstances be relied upon when making a decision to purchase any other digital asset referenced herein. The digital assets referenced herein currently face an uncertain regulatory landscape in not only the United States but also in many foreign jurisdictions, including but not limited to the UK, European Union, Singapore, Korea, Japan and China. The legal and regulatory risks inherent in referenced digital assets are not the subject of this content. For guidance regarding the possibility of said risks, one should consult with his or her own appropriate legal and/or regulatory counsel. Charts and graphs provided within are for informational purposes solely and should not be relied upon when making any decision. The content speaks only as of the date indicated. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in these materials are subject to change without notice and may differ or be contrary to opinions expressed by others.  Executive summary Debt Ceiling: 20MM DAI Stability Fee: S+4.0%* Advance Rate: 95% Asset SPV Credit Enhancement: 5% Minimum Maker Vault On-Chain Credit Enhancement: 5% Term: 2-year vault/credit line Liquidation Process: Contingent on legal structure Maker Vault Maximum All-In LTV: 85.74% Check the RWA Documentation 8 for more information. For Untangled’s MIP-6 and Collateral Onboarding Call, see the below links: MIP-6 Collateral Onboarding Call Preface The below assessment represents a credit assessment, not an exhaustive feasibility study. Ultimately, the launch of a Maker Vault will require a subsequent A) legal review and B) a technical/smart contract review. As per a recent poll, the community has expressed discontent with deals that utilize “old” legal structures. Accordingly, the transition of a “yay” vote on this risk assessment to an active vault will be contingent upon the DAO’s approval of a new and acceptable legal structure. The specific parameters of what constitutes an “acceptable” structure have not yet been established. In the case of this collateral application, a bespoke structure will be installed and paid for by the arranger (Untangled). The novel legal structure will most certainly affect the liquidation mechanism associated with the collateral that secures the Maker vault. Untangled has proposed a legal structure which will be submitted to the community for approval if and only if this risk assessment is approved. Please focus your evaluation of the below report solely on the innate credit characteristics of the opportunity. To exercise judgement independent of the ambient uncertainty in the DAO is to demonstrate a commitment to the onboarding of high-quality, diverse assets.  Highlights UP Series LLC is a digital credit fund operated by Untangled Finance, a digital asset securitization platform regulated by the Financial Conduct Authority in the UK. If approved, Untangled will serve as an arranger who sits between MakerDAO and the originators of trade finance assets (TFAs), particularly those that enable the international trade of tangible goods and commodities. We can regard this structure as an early opportunity to utilize the Arranger Model. Quan Le and Manrui Tang will head Untangled. The fund will participate, via deployment of credit lines/revolvers, in assets originated by underlying asset originators who provide liquidity solutions and trade credit to SMEs. The purpose of this short-term credit is to improve cash conversion cycles and solve working capital needs. Untangled will focus on the origination of self-liquidating, short-term (30-120 day) assets backed by invoices, inventory, or revenue. Prior to Untangled, the founders launched (2017) and operated Binkabi, an agricultural supply chain FinTech company. This structure will implement a proprietary (to Untangled) technical solution that supports the tokenization of underlying trade finance assets. Untangled Finance has structured UP Series LLC as an SPV that will source trade finance cash flows from the underlying asset SPVs. Trade finance assets are tokenized at the asset SPV level (where promissory notes are issued) to support transparency, alignment, and the avoidance of cross-collateralization. As of now, the platform intends to onboard an initial cohort of four asset originators. For resources/refreshers on trade finance, see the below links: Trade Finance Basics Commodity/Inventory Finance How Blockchains Can Improve Trade Finance  What is the essence of this opportunity? The risks intrinsic to the Untangled proposition should be weighed against its opportunities. Primary Risks:   Execution Risk: Untangled is functionally a start-up without a history of credit performance. While both principals have expertise applicable to the task at hand, neither comes strictly from a credit background. These realities cast doubt on the fund’s capacity to deploy prudent capital at scale and monitor outstanding exposure rigorously.  Industry Risk: Because Untangled is focused on international trade finance, it necessarily inherits the complications that cross-border trade entails. A non-exhaustive list includes supply chain delays, regulatory drift/surprise, country-specific or political risk, and the risk that physical commodities degrade (see below for dilution risk).  Complexity Risk: “Abstraction” is both a strength and a risk of opportunities which fall under the Arranger model. When applied to a complicated space like cross-border trade, the arranger model may limit visibility into the essence of the risks being incurred. In Untangled’s case, it retains a fairly broad mandate to originate trade finance assets of many ilks. Different geographies, different industries, different risk profiles, different maturities, different default/recovery proceedings, different security guarantees etc. The assets are heterogeneous, ranging from invoices to repos to inventory, making the breadth of the exposure difficult to visualize. Finally, given the long chain of dependencies (Maker → Untangled → Asset Originators → SMEs around the world), assets are located “far away” from MakerDAO.  Primary Opportunities:   On-Chain Securitization: From the outset, Manrui and Quan have built their business with RWA tracking and securitization via blockchain as a core pillar. Untangled is committed to exploring the frontier of how supply chains are refined via tokenization. As a mitigant to the aforementioned ‘complexity risk’, Untangled’s digital securitization platform should provide MakerDAO with a degree of transparency beyond that of prior onboardings, unlocking more granular and actionable performance data.  Geographical Diversity: Untangled represents an opportunity to achieve exposure to Africa, the Nordics, Western and Eastern Europe, the Middle East, and APAC, the latter of which will be the economic engine of the world for the next ten years. Given the >85% exposure of committed debt ceilings to US-based credits, exposure to other countries will diversify credit risk and help expand DAIs footprint internationally.  Impact Exposure: Untangled’s roadmap has long since included green bonds as part of the phased roll-out. The principals have expertise in agricultural feasibility and finance in Africa and Vietnam. Further, Quan/Manrui have been receptive to the MakerDAO community’s interest in impact investing and have tailored their asset originator pipeline accordingly. By working intimately with Untangled, MakerDAO will have the opportunity to guide Untangled’s scaling toward asset originators making a dent (as opposed to funding greenwashing).  Scale: Untangled operates in the nitty-gritty supply chain space. Though traditional trade finance is fairly well-supplied, Untangled targets international trade finance which is more focused on cross-border shipments and commodity-heavy industry. The principals’ agricultural and supply-chain centric backgrounds provide an edge in underwriting these credits. With a competitive cost of capital, Untangled has the potential to scale to ~$175MM in two years time. Its onboarding pipeline suggests ongoing negotiations with >8 originators (beyond the initial four) are in motion.  Consider the following:  Does the opportunity add robustness, yield, or strategic exposure to the current collateral base? Or does it represent a downgrade along these dimensions? Does the collateral play a strategic role in generating the scaled, diverse, and impact-oriented collateral base for DAI’s future? In other words, is the opportunity sufficiently attractive to incur the risks associated with it?   Outline 1. Industry Analysis 2. Arranger Analysis 3. Key Risks 4. Issuance Platform 5. Implementation Details 6. Structure and Proposed Covenants  Industry analysis International Trade Finance refers to the issuance of credit, typically via factoring or supply chain finance, to enable cross-border trade. At the core of factoring is a mismatch between a supplier’s working capital needs (i.e. today’s needs) and delayed payment from its buyers. A supplier will sell an accounts receivable to a lender for a discount (a factor) in exchange for immediate liquidity. Alternatively, a buyer may seek to deliver payment for goods or services early to achieve a discount. In supply chain finance, the lender delivers discounted payment to the supplier in exchange for credit exposure to the buyer. Usually the counterparty that faces an international trade finance lender is either an importer (buyer) or an exporter (seller), who will either sell or pledge underlying assets to said lender. In trade finance, the most common form of collateral is an accounts receivable, of which an invoice is a component. Lenders like Untangled may also lend against physical collateral such as an inventory of commodity stock. Trade Finance is expected to reach a market size of $11 Trillion as of 2026. Roughly 80-90% of global trade is reliant on trade finance solutions. Traditionally, a gap has existed between the supply of credit and the demand for trade finance solutions. In 2018, this figure was $1.5 Trillion. Though large commercial banks do supply the space, an underbelly of SMEs remain underfunded, especially in the wake of the pandemic. In 2020, the global trade finance gap ballooned to an all time high of $1.7 Trillion, a 15% increase on two years prior. The contraction of trade credit disproportionately affected SMEs, accounting for 40% of rejected trade finance requests, as per the 2021 Trade Finance Gaps, Growth, and Jobs Survey. More recently, nimbler and more opportunistic credit funds and specialty finance firms are entering the space as credit becomes more accessible and trade activity becomes more complicated. These players typically have a more intimate knowledge of particular sectors within the broad TFA space. However, unlike large banks, credit funds do not have the benefits that come with retail deposits, namely a continuous line of liquidity. Instead, debt funds rely on discrete infusions of capital via equity and debt. Securitization of underlying trade finance assets, particularly if catalyzed by blockchains, can bring ample liquidity and transparency to these processes. For United States-based trade finance, SMEs can typically access 10-12% financing to meet their working capital needs. However, for companies overseas, particularly those involved in cross-border trade, these rates jump to above 15% (usually closer to 20%). This financing gap presents an opportunity for lenders familiar with the intricacies of international and cross border trade. How do the assets respond in the event of a particular major negative economic event? Like with any financial asset, a macroeconomic downturn or general contraction in economic activity will increase the likelihood of losses on trade finance loans. Because such loans are secured by promises to pay at some point in the future, defaults anywhere along the chain of credit contingencies can reverberate through to the obligor. Interestingly, as traditional institutions seek to trim exposure to trade finance assets during downturns, specialty lenders and debt funds may see an uptick in new business that may help offset charge-offs on the outstanding book. Further, when crises take hold, self-preserving obligors are loath to renege on the invoices that keep their businesses operational: a business owner will probably explore alternative avenues when implementing an austerity program. What remedial measures might be undertaken? In trade finance, lenders typically either buy outright (true sale) or hold a security interest in an invoice, purchase order, receivable, payable, or inventory set. In the case of the latter collateral form, a collateral agent will be appointed by the lender to secure, manage, and verify the pledged collateral. Credit insurance may be pursued by asset originators to hedge against the impact of a default by a borrower. Further, in the case that explicit credit insurance is not purchased, guarantees (often from the parent company) offer security. If a default does occur, an asset originator/arranger may opportunistically sell off the impaired note to a third party. What are the historical default rates in this industry? Trade finance assets have experienced relatively low levels of default. Historically, the industry-wide default rate at the obligor level has been .75% for import/export loans and .47% for supply chain finance. At the facility level, these rates improve to .26% and .17% respectively.  Arranger Analysis Untangled Finance is an asset manager. In this case, we mean a fund that faces asset originators, as opposed to facing the underlying borrowers/obligors directly. Untangled was incorporated in 2020 by Manrui Tang and Quan Le. Prior to founding Untangled, both Manrui (COO) and Quan (CEO) founded and operated Binkabi, a blockchain-based commodity trading and financing platform. Quan and Manrui are both Chartered Accountants and have a combined 10+ years auditing and performing due diligence on financial institutions. Binkabi’s supply chain finance solutions were constructed in partnership with a bank and commodity exchange. The platform has rolled out integrations with three banks and two collateral managers. Though demand has been muted due to COVID and the concomitant supply chain issues, the platform has processed 500K metric tons since July 2020. Binkabi launched a supply chain finance (SCF) pilot program with the biggest commodity exchange in South Africa just prior to COVID. Finally, a listed Nigerian Bank has invested $500K in Binkabi via an equity infusion. The Untangled Finance digital credit fund is a separate vehicle that builds on the learnings/technical know-how achieved during the roll-out of Binkabi. Up Series LLC is an Untangled-operated SPV which faces the originator-operated Asset SPV directly. It will enter Master Note Purchase Agreements with the Asset SPVs created by asset originators. Untangled Finance will execute an engagement letter with the asset originator parent company itself. Please refer to the funding structure in the ‘Implementation Details’ section below for elaboration. What is the background of the Arranger’s managers? Manrui Tang: After graduating from both Imperial College London and the London School of Economics, Manrui started her career in financial services, doing Mergers & Acquisitions work first for PriceWaterhouseCoopers and then for National Grid, a utility company. Whilst at National Grid, Manrui was involved in the company’s ‘green’ energy transition through investment in smart grid and smart meters. After ten years in M&A, she founded Binkabi in 2017 with Quan. Quan Le: Quan also began his career at PWC, where he spent 17 years on strategy, M&A, and audit. In 2011, Quan founded growmoreX , where he architected and set up rice farms in Africa based on long-standing Vietnamese know-how. Quan pioneered drone technology in terrain mapping and water engineering in Africa. He worked with large, commercial clients such as Unilever, Diageo, Olam, Stallion, Leventis, IFAD, AfDB, and private equity firms SCPE and Advantage partners. With the help of Manrui, the duo founded Binkabi in 2017. Has the Arranger implemented a technical solution to support the onboarding and securitization of assets? As a successor to Binkabi, Untangled has funded and built a blockchain securitization platform. The platform is similar to the technical solutions for RWA tokenization that MakerDAO has utilized in the past. A key difference is that Untangled tokenizes trade finance assets (e.g. invoices) at the asset level. The Untangled platform represents a nexus and single source of truth for all financing participants (originators + investors) to utilize. Asset originators will upload asset pools directly to the platform. APIs specific to the originators will help feed live performance/collections data directly to the platform. The platform accommodates the representation of batches of financings as NFTs. The Untangled digital credit platform translates cash flows into SOT and JOT, the senior obligation token and junior obligation token, respectively. Underlying Asset Originators - What is the profile of the credit in the initial pool? Untangled has identified four initial asset originators to serve as the pilot cohort for the digital credit fund: Fig. 1  P11248×188 42.2 KB  A: The first is a Singapore-based global invoice exchange. Via this exchange, companies can raise funds by selling discounted invoices to investors. This originator was founded in 2016 and has financed roughly $400MM in trade receivables. Over the 2020-2021 period, this originator secured a combined $27MM in funding from Sequoia Capital and an investment firm associated with the Singaporean government. The back-tested default rate of this originator is ~0.2% which is in line with the industry average. The primary business line is invoice finance and all exposures are credit insured. B: The second is a Dubai-based supply chain finance (SCF) and receivables finance platform assisting GCC SMEs with working capital solutions. The company was formed in 2016 although it debuted its ecommerce SCF business in 2019. Since inception, the platform has executed $16MM of transactions. This originator was acquired in 2021 by a NASDAQ-listed fintech company and has no history of defaults. Though without credit insurance, the platforms upon which its obligors transact, such as Talabat, Zomato, and Amazon preferentially direct proceeds from merchant sales to the lender first. Exposures will be covered through a performance guarantee from the public parent company, which has a $350MM market cap. C: The third, a commodity markets alternative lender, was founded in 2013. It is entering its fifth year of active lending and boasts large pension funds as investors. The firm focuses on three asset types: trade finance, receivables, and repos. Many exposures are without credit insurance but have guarantees from the parent companies. D: The fourth is a Switzerland-based commodities trading group with a large Turkish subsidiary that is one of the largest wheat importers in the region. Importing wheat primarily from Russia and Ukraine and supplying it to Turkish millers, the subsidiary was formed in 2016 and turned over 590MM USD in commodities in 2020. All transactions are denominated and settled in USD. The subsidiary has recently been audited (Beau HLB Audit) and is in sound financial standing. Scaling: What detail has the Issuer provided on its scaling roadmap? Elaborate on the progress the Arranger has made in onboarding asset originators. Untangled has provided a roadmap that details its intentions for onboarding underlying asset originators. It estimates the potential for asset participation at $175MM in two years. Untangled has either an NDA or data room executed with each of these prospective counter-parties. The composition of prospective asset originators represents geographic diversity across Ireland, the UK, Canada, Eastern Europe, the Nordics, APAC, Africa, and the Middle East. As per discussions thus far, the average potential participation for these asset originators is ~$15MM. With a smaller exposure per originator, as the arranger scales, so does the extent of diversification. If the DAO were to approve Untangled under the Arranger Model for an initial vault, upon satisfaction of/performance on the obligations laid forth under the initial vault, it could “toggle-on” this diversified scaling map. What is the due diligence the Arranger applies to asset originators and their assets? The Untangled opportunity is an example of the Arranger Model. By this token, Untangled will front load due diligence and monitor collateral exposures on an ongoing basis. This due diligence process incorporates country, counter-party, and collateral when conceptualizing risk. Country: Untangled applies a risk score to the jurisdictions from which it may source participations. Certain geographies will simply be excluded due to unpredictable geopolitical environments or harmful regulatory regimes. Exposures to countries in the acceptable risk band will be attenuated as per the geographical concentration covenants (see below for detail). Counter-party: Untangled scrutinizes the asset originator and its industry. The process verifies that the asset originator’s policies, procedures, and historical performance are strong before providing criteria for eligible participations. With specific regard to the originator analysis:  Experience and background Underwriting/scoring Origination strategy Bad debt experience Regulatory licensing Auditors, accountants, and lawyers Risk monitoring Systems and data Credit insurance Servicing strategy Performance reporting Collections policies Growth strategy Financial standing/quality of performance guarantees Current funding structure  Collateral: The portfolio will target TFA assets with an average exposure of $250K. Untangled requires a complete data room of all loans that have ever been originated on an originator-by-originator basis. It will investigate the nature and quantity of historical bad debt, the drivers of those write offs, and how the originator intends to mitigate such occurrences in the future. What is the valuation model used by the Arranger? Trade finance assets are valued via a fair value discounted cash flow (DCF). The present values of all assets in a pool, derived by discounting the future expected cash flows of individual TFAs, e.g. receivables, are aggregated to calculate the Net Asset Value, or NAV. This is standard practice in both trade finance and more broadly in the valuation of risk assets with associated cash flows and limited secondary market liquidity. Untangled’s DCF approach:   Expected Cash Flows: ECF is calculated based on the A) expected timing of repayments and B) expected payment amounts. This exercise is a simple mapping of the underlying obligors’ contractual obligations.  Risk-Adjusted Expected Cash Flows: Adjust the expected cash flows with an Expected Loss variable as informed by the obligor’s credit risk. Untangled assigns each exposure a risk class. This exercise tags a probability of default (PD) and loss given default (LGD). Expected Loss = (ECF) * (PD) * (LGD)  Incorporation of Expected Loss: Losses are subtracted from projected contractual inflows  Discounting: Discount risk-adjusted cash flows by the opportunity cost of capital. This incorporates the time value of money—what an investor may expect to receive on an alternative investment of equivalent risk, scale, and maturity. Each individual asset in a pool will be assigned its own discount rate. Present values on a per-asset basis are calculated. See below graphics for detail:  Fig. 2  P21024×452 47.6 KB    Calculate NAV: Add up the present values to calculate the value, at time = 0, of the entire pool of assets. See notes below for additional adjustments to NAV.  Note: Write-Offs: If an expected payment does not land as per contractual obligations, the required payment may be partially extinguished by a predefined percentage after a predetermined number of days. Note: NAV will be updated regularly and visible on Untangled’s credit platform (See Fig. 6 for more detail) What is Arranger’s risk methodology? Untangled uses real-time NAV calculation to ensure that the junior tranche is above the minimum proportion of total asset exposure (in this case 10%). Because the underlying securities do not have a liquid secondary market, NAV is calculated via the aforementioned fair value calculation. Trade finance assets will be tiered into six categories of risk: A-F. These risk tiering is driven by the expected losses/write offs (i.e. Probability of Default x Loss Given Default). The riskier the participation, the lower the advance rate, the higher the interest rate, and the lower the financing amount. The aggregate risk scorecard of the portfolio of TFAs also drives the Net Asset Value (see previous section for valuation methodology and Fig. 3 for risk tiering) Fig. 3  P31280×656 78.1 KB  For default probabilities (PD) and loss given default (LGD), Untangled’s projections fall within industry-wide data from Scope Rating and Altradius over a (4 year) credit cycle. Fig. 4  P41112×732 111 KB  Fig. 5  P5972×756 55.8 KB  Untangled Base Case: a probability of default for assets that are 90 days past due of 3 - 5% and loss given default of 50% over the cycle. This maps to an expected loss of 1.5%-2.5% before the application of credit insurance or parent company performance guarantees. Bear Case: Untangled applies a number of stress tests to the portfolio to ensure that the capital stack can endure a series of unlikely events and the associated expected losses:   Stress #1: Maximize probability of default   Base case: 3 - 5%, Bear Case: 8%   Stress #2: Maximize loss given default   Base case: 50%, Bear Case: 90%   In a stressed portfolio scenario, Untangled expects a maximum annual loss of 7.2% (8% PD x 90% LGD) on its total TFA asset base. This expected loss calculation is considered independent of credit insurance and performance guarantees What is the nature of asset defaults for the Arranger, and the possible solutions? The issuer, Untangled, may default on its obligations to MakerDAO in the case that a series of exposures take losses simultaneously. This could occur as a result of either a single asset originator becoming insolvent or macroeconomic headwinds causing a wave of defaults at the asset level. Aforementioned risk factors, namely supply chain risk, could aggravate these events. Upon the occurrence of an Event of Default, the Trustee shall demand that the liabilities become immediately due and payable at their default redemption amount. Events of Default include  A payment event of default A non-compliance event of default A bankruptcy event of default  The structure of the participation between Untangled and the underlying Asset Originators is one of True Sale. Non-true sale assets will not be considered eligible for financing via Maker DAO. A True Sale means that the asset originator transfers, sells, and conveys to Untangled 100% ownership in the recourse rights to the underlying assets. In a scenario where the underlying collateral is inventory, a dedicated collateral agent will facilitate foreclosure of the physical assets (usually commodities) in question. Despite the assumption that international finance is messier from a transit perspective (which it is), from a security and collateral interest (and thus post-default recovery) perspective, it can actually be preferable for a lender. Most goods bound for international transit are represented by a Bill of Lading, or ‘bladings’, a title deed for (mainly) sea-faring goods. Protected by international and maritime law, bladings confer a more robust entitlement to the underlying cargo than airway bills, railway bills, and truck receipts. As mitigants, covenants are structured such that exposure to any one country, one asset originator, or one asset is pared down. More importantly, 70% of the underlying exposures will be hedged with some sort of insurance. How does MakerDAO monitor the portfolio composition? Can the valuation and risk methodologies be verified? Untangled intends for its digital credit platform to be an end-to-end on-chain financing solution. Fig. 6  P61248×592 106 KB  The Net Asset Value of the portfolio is updated regularly and visible to MakerDAO within the Untangled platform. MakerDAO can actively monitor the credit enhancement represented by the junior obligation token. This transparency permits Maker to ensure that both asset originators and Untangled are in fact retaining first loss pieces of the capital stack. Collections and asset performance are monitored on chain. Assets are short term relative to other Maker vaults so deterioration in the portfolio’s performance can be seen early. Should collections drop significantly, Maker can preemptively cut funding for new participations.  Key Risks   Execution Risk: Untangled Finance was launched in August of 2020 and thus does not have a rich history of performance. The principals do not have significant experience in credit underwriting. In conjunction, these factors make it difficult to gauge how successfully the asset manager will either A) Be able to deploy capital at scale and attract reputable credits and B) Monitor the ongoing performance of an asset base spread across geographies, credit qualities, and verticals. The former concern (A) has affected the velocity of MakerDAO vaults in the past.  Alignment Risk: For non-institutional asset managers/originators, the expectation is for the counter-party to retain at least 5% of the total asset exposure—typically a first-loss piece. Untangled will commit to retaining ½ of the first-loss tranche, or 5% of the total asset exposure on-chain. Untangled will help fund this retention via an equity raise, or LP interests. Limited Partners refer to the passive Untangled investors to whom Untangled has fiduciary and reputational obligations. A non-institutional asset manager just starting out might elect to commit to a larger portion (>5%) of risk-retention to bring comfort to its senior lender.  Complexity: As proposed, MakerDAO would lend to an asset manager (Untangled) who would source international trade assets, from many originators, of different risk profiles and maturities, across many different geographies/jurisdictions. Some of the collateral would be simpler (e.g. accounts receivables) and some would be messier (e.g. inventory), requiring physical collateral managers and the associated agreements. The proposed structure would necessitate a few layers of SPVs and a dual-ERC 20 token structure. The modularity, heterogeneity, and complexity of such an arrangement will be costly to accommodate, mainly from a legal perspective. Further, the longer the chain of dependencies, the more uncertain the collections in the case of defaults. This uncertainty poses a tail risk for MakerDAO’s balance sheet.  Supply Chain Risk: Because Untangled is focused on international trade finance, it necessarily has exposure to the complications that cross-border trade entails. Supply chains continue to grow physically longer and to add dependencies along the way. These changes, both the length and segmentation of chains, have been adopted for the sake of efficiency. But as the pandemic made evident, efficiency can come at the cost of resilience. Many of the asset originators to whom Untangled has exposure will utilize credit insurance to mitigate these concerns.  Commodity Transformation/Dilution Risk: Dilution refers to any non-cash reduction in a receivable balance that is not attributable to default or write-off. Dilution may occur when the end product or service has somehow deteriorated in quality or quantity. In trade finance, a buyer who receives a product that is different from the one that was conveyed will seek discounting on payment. Typically, in a case where this type of dilution is present, it is the exporter who bears the risk of partial payment. However, in the case of trade finance, this risk is transferred to the asset originator advancing funds today for payment in the future. Dilution may materially impact the collections of the asset originator who advanced dollars. This risk is particularly prevalent in the shipment of non-durable or perishable goods. A commodity may, for a variety of reasons, degrade en route. Upon delivery of a divergent good to the end buyer, the buyer will elect to pay a discount to the seller’s stated accounts receivable or invoiced amount. Often insurance for the goods can mitigate this risk.  Commodity Price Risk: Both FX risk and commodity price risk are present. The former refers to the risk that the currency an invoice is denominated in loses value over the course of repayment. The latter refers to volatility in commodity prices. Falling commodity prices may undermine the value of inventory-based collateral or constrain a commodity-based business’ ability to perform loan obligations. Rising commodity prices may inflate corporate cost structures, constrain working capital, or cause buyers to renege on unhedged contracts. Some of the asset originators to whom Untangled has exposure will utilize short positions in futures to hedge out price/commodity risk.  Country Risk: To the extent that a shipment passes through or is destined for a country with a domineering or volatile administration, goods may be seized or delivery delayed.  Mitigants/Protections - What hedges against the various risks to trade finance will be utilized? Non-Performance Risk: 70% of the exposures sourced via asset originators will be hedged, either via credit insurance or performance guarantees. Guarantees will only be considered as viable alternatives to de jure credit insurance if the parent company/guarantor has robust financial standing. Untangled always has access to the audited accounts of potential originators. MakerDAO and thus Untangled will regard performance guarantees as legitimate protections in the case that:  (Parent Co. Balance Sheet/Debt Service Coverage) is sufficient. For example, in the case of Asset Originator D, the ratio of the parent company’s assets to the debt ceiling allocated to the originator is 20x. (See ‘Proposed Covenants’ for more details) Parent company is listed Parent company is rated as part of a public issuance  Commodity Transformation Risk: Cargo, inventory, and warehouse insurance. Commodity Price Risk: By virtue of the short durations of TFAs, price risk is only so relevant. Adverse price movement of underlying commodities can be hedged with futures. This is especially germane to asset originators C and D who traffic in commodities/physical inventory.  Issuance platform analysis This opportunity will utilize the Untangled digital credit platform to tokenize TFAs and to track collections/performance. Asset Origination and Monitoring Visualization Fig. 7  P71152×536 90 KB   Implementation details Funding/Organizational Structure Fig. 8  P81248×580 100 KB  The Untangled securitization and marketplace platform will be used exclusively to facilitate the onboarding and monitoring of the TFAs submitted by various Asset Originators.  Asset Originators, upon acceptance of a term sheet, will upload asset pools and connect data APIs to the Untangled platform. These assets will be subject to a standard trade finance asset master participation agreement. The standard BAFT template for English law utilizes a “true sale” of the underlying assets. The platform will enable the automation of or at least standardization of legal contracts and will transmute promissory notes to NFTs. This supports the tokenization of the underlying cash flows. Once pools are operational, the securitization platform allows MakerDAO and other investors to granularly “look through” to the asset behavior. This increased transparency supports monitoring and early triggers that augur degradation of the underlying.  Fig. 9  P91236×708 90.9 KB  The above diagram outlines the structure for implementation with Untangled. The on-chain risk retention by Untangled will be 5% of the total debt exposure in the form of JOT ownership. This retention will be visible on-chain. Asset originators will retain a minimum of 5% of the exposure at the asset SPV level—also via JOT ownership.  Structure and Proposed Covenants Such covenants are soft covenants and do not automatically trigger liquidation proceedings.   Untangled’s credit facilities to asset originators will advance a maximum of 95% against the purchase price of the underlying TFAs.   Outstanding exposure to any single asset originator’s asset base will not exceed ⅓ of the total debt ceiling, either today or in the future (barring signal requests).   The net outstanding loan dollars to obligors in any one non-USMCA, non-EU nation will not exceed ⅓ of the total debt ceiling   Outstanding exposure to any single TFA asset will not exceed 5% of the total debt ceiling.   Outstanding exposure will be 70% insured against non-performance. This coverage will be achieved by either credit insurance or performance guarantees (should the parent entity qualify).   For performance guarantees from parent entities to be considered legitimate, parent entities must either:  A) Be publicly listed B) Be rated as part of a public issuance C) Have an asset/allocated DC ratio of > 10X     Allowed investments List the kind of investment that the SPV can make. Try to be as specific as possible.  Trade finance assets backed by either invoices, inventory, or revenue. Trade finance assets that have been conveyed to Untangled under a True Sale Agreement Maximum maturity of 120 days Asset Originators with a minimum of three years of operating history Asset Originators with T-12 annual volume in excess of $50MM AND at least two years of profitable operating history Untangled is requesting a debt ceiling of 20MM DAI for its first pool. Because the managers will need flexibility to launch effectively and onboard low-risk credits, MakerDAO is not requesting any express allocation towards green or impact investments for this first pool. The Maker community will likely elect to make debt ceiling increases contingent upon allocation towards impact credits.  Maximum Advance Rate: what % can Untangled advance against the value of the underlying trade finance assets? (Loan Amount Per Asset/Purchase Price Per Asset) = 95% Detail: In factoring, for example, the Asset Originator will purchase an Invoice/Accounts Receivable with a 30-day term from a seller for a discounted price. A maximum advance rate of 95% allows Untangled to participate in $95 of each $100 of underlying TFAs. Asset SPV Credit Enhancement 5% Detail: Asset Originators will retain a minimum of 5% of the asset exposure at the asset SPV level. See Figure 5 above for visualization. The first-loss tranche, or equity tranche, of the Asset SPV (or the vehicle operated by the asset originator), will be 5% of the NAV of the TFA assets purchased. This 5% buffer will protect the exposure of the Maker vault. Asset SPV Credit Enhancement = (Asset Originator Retained First-Loss Exposure/NAV of Participations Held in Asset SPV) Minimum Maker Vault On-Chain Credit Enhancement 5% Detail: Untangled will retain a minimum of 5% of the exposure to the NAV of UP Series LLC SPV participations. This will be achieved through retention of a first-loss tranche that is junior to on-chain senior positions, both those of Maker and other senior co-investors. Untangled will demonstrate this alignment by holding JOT. Minimum Maker Vault Collateralization Ratio 100% Maker Vault All-In Maximum LTV To visualize the protection for the Maker Vault, consider the following cushions:  Advance Ratio: 95%, 5% cushion Asset SPV Credit Enhancement: 5% cushion Maker Vault On-Chain Credit Enhancement: 5% Maker Vault SOT Overcollateralization Cushion: 0%  Maker Vault All-In Maximum LTV = (Advance Ratio) * (1 - Asset SPV Credit Enhancement) * (1- Maker Vault On-Chain Credit Enhancement) * (1 - Maker Vault Overcollateralization Cushion) Maker Vault All-In Maximum LTV = (95%) * (100% - 5%) * (100 - 5%) * (100% - 0%) = 85.74% Reframing, the Maker Vault All-In Overcollateralization = (1/.8574) = 116.63% If each asset that Untangled participated in represented the maximum 5% of the total debt ceiling, this LTV would permit the concurrent default AND 100% Loss Given Default (LGD)/complete write-off of ~3 assets without incurring a loss. The likelihood of such an occurrence is very low:  The industry-wide default rate at the obligor level has been .75% for import/export loans and .47% for supply chain finance. Untangled and each Asset Originator hold 5% first loss positions in the assets. Untangled is thus incentivized to fund assets in a more diversified, granular way. If it were to fund a single asset at the maximum concentrations (5% of total debt ceiling) and this asset were to be completely unrecoverable, Untangled would eat the loss.  In order to monitor the real-time collateralization, the Untangled platform provides MakerDAO with daily valuation updates on the assets in which it has participations. Untangled will also provide a projected and active non-performing loan (NPL) report on a monthly basis. The active portion will detail delinquencies, expected loss amounts per asset, write-offs, and remedial/collections strategies. This section will include detail on participations/notes that are opportunistically sold off to external investors at discounted rates. The projected portion will be informed by a series of leading risk indicators. The NPL report will track actively delinquent exposures and how cash flow recovery is progressing. In order to monitor real-time collateralization and concentration risk. Untangled will provide to MakerDAO:  Daily NAV calculations: risk-adjusted DCF + write-offs Concentration matrices monthly  Geography Asset type (i.e. inventory, invoice, repos) Asset originator    MakerDAO further expects complete documentation on participations (e.g. Master Agreement), proof of insurance/parents company guarantees, and true sale execution.  Concentration risks  Exposure to any single asset originator’s asset base will not exceed ⅓ of the total debt ceiling, either today or in the future (barring signal requests). Exposure to obligors in any one non-USMCA, non-EU nation will not exceed ¼ of the total debt ceiling. Exposure to any single TFA asset will not exceed 5% of the total debt ceiling.   Stakeholders rules The risk team has not been provided with access to the counter-party’s financials. Without this visibility, it is difficult to make a determination on the likelihood of solvency/continued operation on a 12 month time scale. The ultimate term sheet and vault will, of course, be contingent upon satisfactory evidence of financial health. Please see the below attestation from Untangled’s founders: “As you know we are a start up and our pool is not live. We have however invested heavily in technology and business development with founders’ and angels’ equity. We are in the process of venture fundraising so it is fine to include the financial as a condition precedent for vault disbursement. We are confident that by the time our [risk assessment] is approved we will be able to provide the required proof for the junior tranche. We have every interest to make this partnership a success.” The proposed structure in regards to alignment is as follows:  All first-loss and junior exposure will be visible and verifiable on-chain Asset Originators (one level beyond Untangled) will retain 5% of the exposure to underlying obligors at the Asset SPV level. Untangled will retain at least 5% of the total debt exposure. This 5% will be raised via solely LP commitments. Untangled and the underlying asset originators will realize losses and cash flows to the junior tranche on a pari passu basis. In other words, within the junior tranche, neither party is junior to the other. Losses and gains are distributed to both parties on equal footing.  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-application-untangled-finance-drop-u-drop-diversified-trade-finance-fund/9167",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-34-untangled-friday-july-30-4pm-utc/9527",
                        "https://forum.makerdao.com/t/consultation-poll-centrifuge-global-debt-ceiling-cap/11619",
                        "https://forum.makerdao.com/t/the-arranger-model-a-highly-scalable-rwa-framework/11298",
                        "https://www.youtube.com/watch?v=OHvOyUGcC5Y",
                        "https://www.youtube.com/watch?v=idh6F3KveFY",
                        "https://www.youtube.com/watch?v=nhozN3YGMb4",
                        "https://medium.com/untangledfin?_branch_referrer=H4sIAAAAAAAAA8soKSkottLXz8nMy9bLTU3JLM3VS87P1TfIS3GsKLOICM1KAgB2h5KMIwAAAA%3D%3D",
                        "https://docs.google.com/spreadsheets/d/1WFeLP6BS6RtJb2SkjmETELI6exnOdwNypsCmu_HrtYU/edit#gid=0",
                        "https://www.globenewswire.com/news-release/2021/05/26/2236093/0/en/Global-trade-finance-market-anticipating-a-high-boost-at-a-CAGR-of-5-4-during-2021-2026.html",
                        "https://www.adb.org/publications/2021-trade-finance-gaps-growth-jobs-survey",
                        "https://iccwbo.org/publication/icc-trade-register-report/#1550486691378-3a223d05-6e5e",
                        "https://thebreakthrough.org/articles/revolution-in-africa",
                        "https://www.lexisnexis.co.uk/legal/guidance/commodity-repo-transactions-true-sale-considerations",
                        "https://docs.google.com/spreadsheets/d/1WFeLP6BS6RtJb2SkjmETELI6exnOdwNypsCmu_HrtYU/edit#gid=0",
                        "https://forum.makerdao.com/t/the-arranger-model-a-highly-scalable-rwa-framework/11298",
                        "https://docs.google.com/document/d/1e0yiXC3X75FyyIG0IKg0hFP_4M-1UgvV50pBC8Wn-Qg/edit",
                        "https://iccwbo.org/publication/icc-trade-register-report/#1550486691378-3a223d05-6e5e",
                        "https://forum.makerdao.com/t/maker-relay-ep-74/12035",
                        "https://forum.makerdao.com/t/forum-at-a-glance-december-2-9-2021/12119",
                        "https://forum.makerdao.com/t/mip6-application-untangled-finance-drop-u-drop-diversified-trade-finance-fund/9167/6",
                        "https://forum.makerdao.com/t/delegate-pre-vote-notice-why-flip-flop-flap-delegate-will-vote-yes-to-the-community-greenlight-poll-for-robinland/12668/3",
                        "https://forum.makerdao.com/t/request-for-proposals-for-a-on-chain-rwa-monitoring-solution/19535/21",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/maker-relay-ep-74-en-espanol/12071",
                        "https://forum.makerdao.com/t/mip6-application-untangled-finance-drop-u-drop-diversified-trade-finance-fund/9167/8"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.193786129916962
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "16/12/2021-04:54:31",
                    "content": "    teej:  Untangled Finance is an asset manager. In this case, we mean a fund that faces asset originators, as opposed to facing the underlying borrowers/obligors directly.   Hello T! Thank you for putting this evaluation together. Is it fair to say that Untangled can also be referred to as the securitization sponsor? If yes, can we expect them to perform external assessments for current and future AOs?     teej:  The Untangled platform represents a nexus and single source of truth for all financing participants (originators + investors) to utilize. Asset originators will upload asset pools directly to the platform. APIs specific to the originators will help feed live performance/collections data directly to the platform. The platform accommodates the representation of batches of financings as NFTs. The Untangled digital credit platform translates cash flows into SOT and JOT, the senior obligation token and junior obligation token, respectively.   I might have missed this–but with regards to “skin in the game” will they fully own the junior obligation token?     teej:  Fig. 1    Will a request for an assessment on each AO listed above be required for phase 1? Assessments such as liquidity reserves, operational risk, tranches (if applicable), triggers, etc. ( again sorry if it was mentioned already–long day for me  ) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.132620851370851
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#3",
                    "likes": "2",
                    "time": "17/12/2021-13:33:09",
                    "content": " Hello T! Thank you for putting this evaluation together. Is it fair to say that Untangled can also be referred to as the securitization sponsor? If yes, can we expect them to perform external assessments for current and future AOs?  Untangled can be considered the securitization sponsor. In this capacity, they will source/assemble trade finance assets, demonstrate a retention of some of the pool’s risk, and sell-off the senior exposure(see below for clarity). Untangled will perform full assessments for all AOs, whether part of the initial cohort or part of future cohorts. As laid out in the ‘What is the due diligence the Arranger applies to asset originators and their assets?’ section, the DD focus is on policies, procedures, and historical performance. In order to ascertain a potential AOs financial standing and to verify the legitimacy of the borrowing entity, Untangled will require access to any potential AO’s audited accounts and Articles of Incorporation. Finally, Untangled will procure lien searches for the assets being participated in. This will ensure that MakerDAO’s security interests are in fact senior and that the AO is not double-dipping (sign of distress). Ad Hoc ‘External Assessments’ (e.g. audits) are not widely available (even in the US) for trade finance transactions. I’m not sure why—maybe just unit economics. Untangled will thus not require ad hoc ‘external assessments’ for AOs being onboarded. AOs are bounded by eligibility criteria:  Asset Originators with a minimum of three years of operating history Asset Originators with T-12 annual volume in excess of $50MM AND at least two years of profitable operating history  Further, 70% of the outstanding exposure to AOs will be guaranteed, either via credit insurance or performance guarantees from the parent company.  I might have missed this–but with regards to “skin in the game” will they fully own the junior obligation token?  They will not wholly own the junior obligation token (JOT). Untangled will retain ½ of JOT while the underlying asset originators of the trade finance assets retain the other ½. This structure A) mitigates against the moral hazard of AOs selling participations in their worst assets and B) ensures that Untangled is judicious with its allocation strategy. Together Untangled and the AOs will hold the entirety of JOT, which will represent 10% of the total cap stack. In regards to Untangled’s retention of risk, this retention represents 5% of the entire capital stack. This junior piece will be funded via Untangled’s VCs.  Will a request for an assessment on each AO listed above be required for phase 1? Assessments such as liquidity reserves, operational risk, tranches (if applicable), triggers, etc. ( again sorry if it was mentioned already–long day for me  )  All AOs will be assessed by Untangled on the basis of financial strength, performance and operating history, and other counterparty-specific qualities. Each will also be evaluated along country-specific and collateral-specific dimensions. This collateral onboarding seeks to utilize the arranger model and set the stage for scale. This means front-loading the due diligence on the Untangled process and principals and establishing rigorous eligibility criteria for operation at the outset. As per this design, Untangled has identified and proposed for inclusion in the pool the four strongest asset originators in their pipeline. As the relationship between Untangled and the AOs that are part of the pilot cohort progresses, Untangled will be supplying MakerDAO with in-depth reporting that defends their inclusion in the pool. As the pool goes live, Untangled will provide monthly performance reporting on the underlying participations. Further, because assets are tokenized at the AO SPV level, real-time reporting and the addition of performance triggers will be trivial. Please let me know if I answered your questions. Happy to provide clarity anywhere and everywhere. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.072481572481572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "1",
                    "time": "17/12/2021-15:47:27",
                    "content": "Thank you @teej for providing thorough answers to my questions. Your input and analysis is very much appreciated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "17/03/2022-15:48:12",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "255"
}