{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2022-05-06/15004",
            "title": "Intangible Asset Agreed Modification of Management - 2022-05-06 ",
            "index": 15004,
            "category": [
                "Core Units",
                "Sidestream Auction Services"
            ],
            "tags": [
                "sas-001",
                "intangible-asset"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/lukass",
                    "index": "#1",
                    "likes": "3",
                    "time": "06/05/2022-12:32:11",
                    "content": " Intangible Asset Agreed Modification of Management - 2022-05-06  Action Date - 2022-05-13  Asset  Subdomain: liquidations.makerdao.com   Asset Type: Subdomain Asset Owner: DAI Foundation Platform Manager: TechOps Core Unit Content Manager: Sidestream Auction Services Core Unit - [email protected] Purpose: Unify the cluttered landscape of auction related UIs. Last Modification: -   Supporters  @0xdeniz @juan @LongForWisdom   Reason for Modification Improving accessibility to auction related UIs & tools is a key element of the mission, vision & strategy of the Sidestream Auction Services Core Unit (SAS). Up until recently, users had two entry points to participate in collateral auctions. The old liquidation portal accessible under the domain liquidation.makerdao.com and the newer Unified Auctions UI under unified-auctions.makerdao.com. The latter in the meantime has reached feature parity with the old liquidation portal. It offers the possibility to participate in a collateral auction via flash lending of the collateral and to bid on the auction with DAI funds. Since feature parity is reached, the old UI is going to be deprecated. However, it will be kept accessible by @DUX CU under a new subdomain. There is already a redirect in place that forwards users trying to access the liquidation.makerdao.com to unfied-auctions.makerdao.com. Per this Agreed Modification of Management step, SAS is requesting management access to the mentioned asset. Our efforts will be bundled under unified-auctions.makerdao.com but with the aforementioned redirect in place it is the logical consequence to also formally take over content ownership for liquidations.makerdao.com. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.511363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#2",
                    "likes": "1",
                    "time": "06/05/2022-13:58:26",
                    "content": "I confirm my involvement in this. Happy to see SAS team work towards their mandate through ownership of the auction UIs! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "04/08/2022-13:59:25",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2022-08-17/17255",
            "title": "Intangible Asset Agreed Modification of Management - 2022-08-17 ",
            "index": 17255,
            "category": [
                "Core Units",
                "Dai Foundation"
            ],
            "tags": [
                "core-unit",
                "daif-001",
                "intangible-asset"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#1",
                    "likes": "2",
                    "time": "15/08/2022-13:39:05",
                    "content": " Intangible Asset Agreed Modification of Management - 2022-08-17  Action Date - 2022-08-24 (post date + 1 week)  Asset(s)  The assets are email configurations for a set of subdomains of the makerdao.com and makerdao.network domains This modification of management pre-approves core units as content managers (to have their own email provider specified) for a subdomain that identifies the core unit. To illustrate this with an example: the Collateral Engineering Services core unit will be able to have its own email service and provide its members with email addresses at a subdomain named ces.makerdao.com and/or operate functional mailboxes like [email protected]  Incubating core units are pre-approved for a period up to 4 months before being approved by Maker Governance provided they have the support of an existing core unit facilitator. If a core unit is offboarded, then any subdomain email configurations for this core unit will be revoked   asset name  Asset Type:  Asset Owner:  Platform Manager:  (https://change.daifoundation.org) Content Manager:  (<contact info will be added in GitHub - makerdao/asset-registry>) Purpose: <The purpose is to enable core units to have email subdomains under the makerdao.com domain and/or the makerdao.network domain> Last Modification: <2022-07-DD>   Supporters @prose11 @Davidutro @juan  Reason for Modification  This change pre-approves all Maker Governance approved core units - as well as incubating core units for a period up to 4 months - to have contact email adddresses at a subdomain under the *.makerdao.com and *.makerdao.network domains. The core units can request to have DNS records configured for their email provider by posting a request via https://change.daifoundation.org   ",
                    "links": [
                        "https://change.daifoundation.org",
                        "https://github.com/makerdao/asset-registry",
                        "http://makerdao.com",
                        "https://change.daifoundation.org",
                        "https://forum.makerdao.com/t/daif-cu-update-q3-2022/18211",
                        "https://forum.makerdao.com/t/makerdao-network-has-now-been-transferred-to-dai-foundation/17257",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-11-17-de-agosto-del-2022/17376",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/11"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/11/2022-13:39:34",
                    "content": "This topic was automatically closed after 90 days. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09090909090909
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2022-07-06/16384",
            "title": "Intangible Asset Agreed Modification of Management - 2022-07-06 ",
            "index": 16384,
            "category": [
                "Governance"
            ],
            "tags": [
                "pe-001",
                "intangible-asset"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "6",
                    "time": "06/07/2022-17:44:30",
                    "content": " Intangible Asset Agreed Modification of Management - 2022-07-06 Action Date: 2022-07-06  Asset(s) List the modified assets and managers using the following template: Asset Name: security.makerdao.com Asset Type: Subdomain Asset Owner: DAI Foundation Platform Manager: makerdao.com domain Content Manager: Protocol Engineering Core Unit specifically @Derek Purpose: Update and management of the security subdomain hosting smart contract audits   Supporters @Derek @Psychonaut @Prose11 @Nadia  Reason for Modification The Protocol Engineering Core Unit requests to update and manage the subdomain security.makerdao.com in order to host all audit documentation in a single location. The existing site has not been updated since the dissolution of the foundation and is missing critical audit content.  Objectives  Maintain an updated site for all external audits Update links to external bug bounty initiatives and coverage Update Formal Verification coverage  ",
                    "links": [
                        "https://forum.makerdao.com/t/pecu-month-in-review-july-2022/16989"
                    ],
                    "GPT-summary": "The post is an explanation of a proposal to modify the management of an intangible asset, specifically the security subdomain hosting smart contract audits for makerdao.com. The proposal is being made by the Protocol Engineering Core Unit, with the objective of maintaining an updated site for all external audits, updating links to external bug bounty initiatives and coverage, and updating Formal Verification coverage. The post also includes a list of modified assets and managers, as well as the reason for the modification and the supporters of the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.026785714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "2",
                    "time": "07/07/2022-14:22:30",
                    "content": "    Derek:  Supporters   Pretty sure this is just an oversight, but these need to be 3x facilitators in order for this to be valid (one can be you, @Derek). They don’t need to support the change exactly, just confirm that it’s a reasonable request. The reasoning there is to provide a lightweight but reasonably effective spam filter, and encouraging authors to seek feedback from related CU’s before posting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#3",
                    "likes": "2",
                    "time": "07/07/2022-14:40:18",
                    "content": "Ahh indeed my oversight, thank you for flagging. I’ll work with CU’s to support, cheers! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#4",
                    "likes": "1",
                    "time": "05/08/2022-10:53:38",
                    "content": "    Derek:  Action Date: 2022-07-06   A nitpick is that the Action Date shall be 7+ days after publishing the modification or management request. Anyway, we are well beyond that date with no opposition now. However, there is no contact info for the content manager. Please provide an email, or a Forum handle @Derek ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#5",
                    "likes": "0",
                    "time": "05/08/2022-13:39:47",
                    "content": "Thanks Soren, updated accordingly with myself as the content manager. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "03/11/2022-13:39:48",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2022-08-23-makerdao-com/17400",
            "title": "Intangible Asset Agreed Modification of Management 2022-08-23 - makerdao.com ",
            "index": 17400,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001",
                "intangible-asset"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#1",
                    "likes": "12",
                    "time": "23/08/2022-11:24:01",
                    "content": " Action Date: 2022-08-30  Assets Asset Type: website and content Asset Owner: DAI Foundation Platform Manager: www.makerdao.com (IP: 76.76.21.241), makerdao.com (IP: 76.76.21.21) Content Manager: Growth CU, [email protected] Purpose: Revamp the makerdao.com website Last Modification: -   Supporters @Nadia @Derek @tadeo @prose11  Reasoning The Growth CU requests to carry out a full restructure of makerdao.com Maker has gone through tremendous changes over the past years, however, the website currently does not reflect these changes and updates. Moreover, the website currently does not have a clear purpose beyond having a website. It is paramount that the website reflects information that is up to date. It is best practice to keep website content updated on a regular basis, and where possible and needed, revamp websites to reflect the current design which meets user expectations. This should be done in conjunction with a proper analysis of the traffic to the site that shows which contents are being consumed, and when and why people leave the website. Without proper measurement, we miss out on valuable information that will give us actionable insights. A brand’s website has to support the organization’s strategy. Our motivation is to ensure the website and all Maker-related content are designed to reflect and support the current state of the protocol. In order to drive increased visibility, keep all information updated and up to date, provide clear communication, and give a home to important case studies (eg. HVB, SocGen, Mastercard, and ConsolFreight) and current initiatives which will help motivate potential partners, we believe makerdao.com needs a complete restructure from the ground up. Above all, it is crucial that we provide clear, concise and easy to understand explanations and visual identity for all of the moving parts of the Maker protocol (PSM, D3M, Maker Teleport), as well as how the protocol interacts with other DeFi solutions. Whilst there’s a lot of information about the protocol out there, we have to provide first hand explanations.  Why we believe the Growth CU should do it Over the past months, the growth team has been proactively working on growing Maker’s brand presence.  The brand team has been managing the Maker Twitter account which has generated much-needed engagement for Maker.  The Twitter account gained over 24,000 new followers, surpassing the 200,000 follower mark Overall engagement rate has increased by 104% We have hired a PR agency specializing in crypto, through this partnership the Maker brand team has published and promoted the recent newsworthy and noteworthy events at MakerDAO (Starknet integration, HVB, Govt. bond). For more details on the recent updates, please see this forum post  Growth CU BDs have worked on several partnerships to help onboard promote DAI    However, the value driven from all the activities the Maker brand team has worked on and converted to future business opportunities is not being fully utilized, as we don’t have a well-maintained website where we can send people and have a strong call-to-action after they interact with the Maker brand. The brand team will be able to restructure the website and make sure that the website is set up to maximize the current efforts and engagements. As proposed in the recent Growth Core Unit budget, we have hired a new CMO to help Maker growth develop a much-needed communication and marketing strategy, a big part of this is to start by getting the brilliant basics right, and restructuring the website is an important step toward it. The Growth CU has the tools, agency relationships, and internal expertise needed to lead the website restructure initiative.  What will restructuring the website delivers to Maker Restructuring the website will deliver the following benefits and beyond,  First impression is everything, Maker is the original stablecoin and the number one DeFi protocol, people who know Maker needs to introduction, but for those new to the space, we want to make a lasting positive impression It will bring the website to match the current state of MakerDAO. This is important because we don’t want out-of-date information that can make us look lagging behind the industry Provide valuable information through proper measurement and analytics implementation (eg. Google analytics) that can be used to improve our strategy on an ongoing basis. This is important because we must measure everything and try to understand as much as we can from the information we will generate Better SERPs (search engine results pages) presence for the right keywords. This is crucial for any website, showing up for the right keywords (eg. “crypto lending”), the presence for the right keyword brings highly relevant traffic Website design and trends are constantly evolving, a fresh redesign/restructure will allow Maker to deliver a user-centric experience Restructuring the website will implement easy-to-use processes for updating and uploading content as and when needed A cohesive brand identity that internally matches all Maker external exposure. Use visual cues to help users navigate the Maker ecosystem, we use visual cues all the time to determine where to go and what to do, think road signs. The color, images, logos, visual identities, and layout of content will have an impact decision making for visitors and users By Adding functionalities such as AI chatbots we can make it easy for people to find out how to get in touch with Maker. It is important because, while BDs are actively reaching out to potential partners, we don’t know how many potential users who could bring us business opportunities visit the website without getting in touch.   What will be our next steps We will start the process with the following systematic steps,  Create a full map of all of the Maker website properties and prioritize which areas to focus on Benchmark current performance to measure before and after the restructure Hire a design agency that will propose the redesigned map that includes  Wireframe for the entire website Map content plan to the relevant topics Advice on and implementing SEO for better SERPs Analytics implementation (Google Analytics) Visual design for the new website (logos, visual cues, landing page)    We will initiate the process by consultation with the Dai Foundation who is currently in charge of the website and work out how to proceed (ie. accessing the server content, admin access to current analytics technology in use). Following this consultation, we will create a project management roadmap which we will aim to accomplish before the end of the year. Below is an initial ideation of the sitemap Growth CU envisions that the website will be restructured to. Please note, further details of what should and shouldn’t be in the website will come out of the research (content mapping, determine high demand relevant content broken down by informational and commercial intent, UX design and more) and development phase of the project. The idea behind this sitemap is to include commercial, product and DAO related content which represents the Maker brand fully.  |771.0625x4001600×775 110 KB  Here’s a brief overview of what will be contained under the main sections,   Inside Maker Protocol Information related to the overall protocol design, showcasing how each of the moving parts work together to deliver DAI benefits. We will produce mind maps and infographic assets that will aim to deliver a succinct picture of the protocol design. We will also include information related to the protocol health by drawing some of the key metrics from makerburn. All relevant marketing and PR content related to the protocol will be housed in this section.   Inside MakerDAO This section will contain detailed information of how the DAO functions, internal processes, public facing description explaining important votes and changes and what they mean for the protocol and the DAO. We will also create a platform to conduct interviews with CU facilitators and delegates to promote their views on the protocol, the DAO and what is happening in the DeFi space.All relevant marketing and PR content related to the DAO will be housed in this section   Products Detailed description with illustration that will explain how each of the current products (D3M, PSM, Maker Teleport) function independently, and in unison. We will create logos and visual design for each product, this will be developed in conjunction with CUs and any other community parts.   Use cases This will be one of the most active sections which we will aim to keep updated frequently with use cases such as Mastercard, HVB, SoCGen, as well as integration with other protocols, dex etc. Our aim for this section is to encourage people by showcasing use cases that will generate commercial interest and consideration for Maker, and provide means of getting in touch with Maker easily without having to go via the many channels such as discord and the forum.   Maker For you We will keep and or reuse a lot of what information is currently on the website. During the restructuring process we will incorporate more practical information to further enhance the current content’s usability.   Our initiatives Growth CU has recently created the Nature POAP campaign. As the brand team continues to work on new initiatives, it is important to have a place within the Maker domain where we can permanently showcase these work. In this section we will include such future initiatives.   Meet Your Maker Here visitors to the website will find information related to events, upcoming maker participations, ways of getting involved in the community.   The website’s main aim is to promote Maker impartially. In order to achieve impartiality, there will be processes put in place using the Notion platform for CU’s collaboration on the website project, this will include validating and reviewing the information developed for web pages to ensure all information is accurate and impartial.   Questions for Core Units about intangible assets - for review and comment As per our initial discussion with @sorenpeter (DAI Foundation facilitator), we answered DAI Foundation questions below,  Have you acquainted yourself with the Dai & Maker Trademark Policy, so you are aware of how to utilize the Dai, Maker, and MakerDAO names and logos?  Answer: Yes  Which types of tangible and intangible assets will you be producing with the funding received from MakerDAO?  Answer: we will produce visual identities such as logos and page designs and an overall visual identity that will be consistent across maker websites, press releases, and social media platforms.  Will the assets produced using MakerDAO funding be made available as public goods for the whole DAO?   Specifically:   Will appropriate Open Source Software/Creative Commons licenses be applied to the assets produced?     Answer: Yes.  Will Copyright for those assets be assigned to the Dai Foundation that has as its mandate to safeguard MakerDAO intangible assets?  Answer: All logos, visual designs and everything referrable and usable will be made available for the whole DAO  Will you integrate the Dai Foundation Contributor License Agreement Assistant in your Github repositories?  Answer: Content and assets that can be made available for public access will be integrated  Will the source code/material for the assets be made publicly available? How?  Answer: The website contents will be publicly available to view and access, and the content source code is also viewable by the public through web-browser developer options.  Besides the MakerDAO Forum and MakerDAO Discord, which communication channels do your core unit plan to use to communicate on behalf of MakerDAO according to your mandate?  Answer: the primary method of communication will remain Discord and the Forum. Communication regarding the restructure will not require continuous publication. We will publish the restructuring plan and milestones on Notion.  Will you ensure that relevant publishing/community websites, email and SoMe accounts and associated DNS and ENS domains used for official MakerDAO communication for which you hold Content Management rights are under ownership of Dai Foundation to ensure ultimate Maker Governance control of who is using these channels?  Answer: Yes. We will also transfer root access to Lens Maker account to the DAI Foundation.  If you register any trademarks to represent MakerDAO funded solutions will you transfer those trademarks to Dai Foundation for safe keeping?  Answer: Yes ",
                    "links": [
                        "http://makerdao.com",
                        "https://forum.makerdao.com/t/maker-brand-pr-updates/15582",
                        "https://forum.makerdao.com/t/maker-brand-update-june-july-2022/16858",
                        "https://nature.makerdao.com/",
                        "https://forum.makerdao.com/t/questions-for-core-units-about-intangible-assets-for-review-and-comment/16334",
                        "https://daifoundation.org/trademarkpolicy",
                        "https://cla.daifoundation.org/",
                        "https://www.lensfrens.xyz/makerdao.lens",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/22",
                        "https://forum.makerdao.com/t/intangible-assets-as-public-goods-questions-for-growth-core-unit/18138",
                        "https://forum.makerdao.com/t/growth-cu-monthly-update-august-2022/17947",
                        "https://forum.makerdao.com/t/activo-intangible-acordado-modificacion-de-la-gestion-2022-08-23-makerdao-com-traduccion/17449",
                        "https://forum.makerdao.com/t/novedades-para-la-comunidad-programa-embajador/18544",
                        "https://forum.makerdao.com/t/growth-cu-end-of-2022-review/19194",
                        "https://forum.makerdao.com/t/recopilacion-de-noticias-sobre-makerdao-dai-y-mkr/14694/212",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-21-28-de-septiembre-de-2022/18259",
                        "https://forum.makerdao.com/t/daif-cu-update-q3-2022/18211",
                        "https://forum.makerdao.com/t/maker-brand-update-august-2022/18158"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666004626833115
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "3",
                    "time": "23/08/2022-15:09:10",
                    "content": "Glad to see someone taking a look at this. I get tired of looking for now 3-4 year old forum posts but I remember commenting in the past about some general concerns regarding Maker information websites.  There were many of them and virtually all of them designed in such a way that as you drilled down into links/pages there was no navigation ‘back up’ There was no single definitive, authoritative Maker website as a starting point that each resource also pointed to. No integration between website designs, much less menu items to reflect the ‘constellation’ of Maker resources much less navigate between them.  What the above led to was a general difficulty of deciding what was authoritative Maker information vs. 3rd parties, a difficulty navigating and/or searching for information.   This made learning about not just the complicated Maker smart contracts difficult, but also about Maker the DAO generally.    When we couple in the not so intuitive smart contract routine names, and the Maker vault, DAI lexicon what was presented to the general public there were significant hurdles/barriers to entry. To be sure there were a number of self contained sites that had pretty good information (particularly with respect to SCD/SAI and MCD/DAI smart contracts) but much less (or more scattered) info when it came to topic discussions/debates (both in forums or in G&R calls) as well as general Maker performance info.  example DAI PEG over time, capture of Market share (in terms of % available vs $$) of not just ETH, but wBTC or other assets, profitability from a net DAI revenue perspective and many other important measures. To be sure I have worked at many places and organizations, consistency and coherent presentation of enterprise information tends to always be scattered, lacking consistency and coherence.   Too often this is due to people’s preferences (to use word and excel vs. say Libre Office or Unix vs MS-Win and take your pick of off the shelf www implementations of workflow process and associated project data).   The concept always has been - do the work now - and save/organize/document later almost always leads to the above results so I am more surprised by an organization that has the above well in hand than by those that don’t. If I had a suggestion here it follows my general principles.  Clearly define the problem to be addressed Apply a measurement metric of some kind that can determine if the problem can be measured as this is going to be a requirement for measuring how much it cost to get improvement (or whether the expenditure made the issue worst) Clearly define what the expected result to (1) using (2) should be.  (i.e. have an expectation of a result that can be measured) Clearly define time frames to the above. Clearly define whose authority and responsibility domains the above falls under Clearly lay out action plan. Clearly lay out resources/costs.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4991811539430575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#3",
                    "likes": "2",
                    "time": "24/08/2022-09:24:54",
                    "content": "Thank you so much for your valuable insight and suggestions. These are exactly the challenge we have to address and hence the need to redo the website and content. As your suggestions outlines, those steps we will unpack in detail in the project development phase, currently there’s work underway to really hone in on the specifics of the problems to be solved. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#4",
                    "likes": "0",
                    "time": "25/08/2022-21:28:42",
                    "content": "The page must be updated because the common user at first glance will think that Maker is abandoned or something similar, these are excellent measures for the growth of Maker, I have experience with Javascript, HTML, and CCS, and I would love to help in the development of the website, I also have a lot of experience in design and I would like to help in that field too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "23/11/2022-21:29:06",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2022-08-23-makerdao-linkedin-page/17401",
            "title": "Intangible Asset Agreed Modification of Management 2022-08-23 - MakerDAO Linkedin Page ",
            "index": 17401,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001",
                "intangible-asset"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#1",
                    "likes": "9",
                    "time": "23/08/2022-11:53:14",
                    "content": " Action Date: 2022-08-30  Assets Asset Type: Social media account Asset Owner: DAI Foundation Platform Manager: linkedin.com Content Manager: Growth CU, [email protected] Purpose: share information and start conversations with the Maker ecosystem Last Modification: -   Supporters @Nadia @Derek @tadeo @prose11  Reasoning Maker Growth is making a formal request that management of the LinkedIn account is given to the Maker Brand team. Following the recent MIP60 which requested maker growth to manage the Twitter engagement, we believe that managing the Maker LinkedIn account alongside twitter under the Growth CU, will also be hugely beneficial. Since the Growth CU started looking after Maker’s Twitter account, we have been able to drive tremendous growth in the account activity and brand exposure.     We believe by using the learnings we have gathered from Twitter and applying them to the LinkedIn profile, additional engagement can be driven for the Maker brand and provide further exposure.  Why are we convinced that managing the LinkedIn account will strongly benefit the protocol? Maker’s LinkedIn account is inactive. LinkedIn in nature is different from Twitter, it is where all the institutions and academia are, the nature of conversation is also different from that of Twitter. There is a real appetite within MakerDAO to create a more mainstream appeal for the Maker brand. Being active on LinkedIn will allow us to become a lot more visible to a wider range of institutions. Twitter is an important platform for engaging with the crypto industry in general, however, LinkedIn will provide us access to a more professional platform. Twitter crypto space can sometimes be insular and very much focused on “crypto-only” engagement, however on LinkedIn, discussions, and views are more detailed and of professional nature, which involves participants from outside of a purely crypto-focused audience into broader financially oriented. On Twitter we can broadcast activities and initiatives currently taking place within MakerDAO in short form, LinkedIn will allow us to write in detail in long-form and generate more engagement of a professional nature. If Maker wants to create a more mainstream appeal, we need to have more engagement with the mainstream professional community beyond just crypto enthusiasts. Additionally, a lot of Twitter user accounts are anonymous, whereas, on LinkedIn, user accounts are identifiable by industry, geo-location, and profession, this will give us highly valuable information in further developing our communication strategy. As well as the above we believe it is good practice to keep MakerDAO’s presence updated and professional on all available platforms where people can engage, it promotes our proactivity and liveliness. We will develop an engagement strategy for LinkedIn, we will use the missions outlined for the Twitter account in the Twitter MIP60, and apply them and modify them accordingly (where needed) for LinkedIn  learn more about Maker (i.e., DAO and its Core Units, ecosystem, DeFi services, Dai use cases) and the broader crypto industry benefit from Maker’s DeFi services and/ or Dai advantages in various verticals stay informed of critical developments/ achievements and major events (e.g., product development, key partnerships) interact with other community members around Maker-related topics give feedback/ share opinions on the protocol  In addition to the above, we will add the following missions for the LinkedIn account,  build more professional network reach for Maker stay informed on relevant/related financial industry developments where Maker can play a part connect with institutions and open more opportunities for discussions and partnerships generate more panel discussion opportunities help with recruitment  To succeed in the above missions, we need to create a coherent narrative across all comms channels… Managing activities from the same place will allow us to tell our stories and keep a synched narrative.  Growth’s Mandate Growth CU’s mandate is to help the protocol increase Dai liquidity globally by increasing the supply and demand of the stablecoin across geographies. And we believe increasing LinkedIn activity management will be another hugely beneficial addition in delivering on Maker’s ambition.  What are our next steps if we start managing the MakerDAO LinkedIn account? We will carry out the following tasks to promote MakerDAO on LinkedIn.  health check: fill out all important details with links to the important MakerDAO website sections encourage MakerDAO community members, and CU members to include their MakerDAO affiliation in their bio launches: including protocol announcements, partnerships, and activation campaigns. governance: including most relevant polls, results of the votes, and forum at a glance. Information coming from the GovComms CU. DAO news: including news from CUs and the public call’s agenda. We will retweet tweets from CUs accounts, delegates, and community members to help them to increase visibility. alerts: Critical information that needs immediate attention. We’ll get this information from any CU with this need.  In addition to tweet suggestions, we will also receive LinkedIn-specific requests via discord. Here you will see the planning of activities, announcements.makergrowth.com. These plans will be extended to LinkedIn activation also. We will use any assets created for MakerDAO and Maker Growth tweets for LinkedIn posts, thus providing better value for the resources we currently use. Alongside Twitter, we will publish/share all media and PR coverage on LinkedIn, this is beneficial as the popular media outlets have a large follower base and generate additional exposure and education opportunities for MakerDAO. We will add the measurement of LinkedIn activities alongside the twitter activities, which include,  Follower metrics:  Number of followers New followers   Engagement metrics:  Number of mentions Likes, comments Reach   Value:  Number of institutional engagements Number of influential followers    You can see below some of the key growth figures and marketing and communications initiatives since we started managing Twitter activities  Growth CU - Brand and Communications Update Growth CU Monthly update, July 2022 Maker Brand Update - June + July 2022 Maker Brand Team Monthly Update, May 2022 Maker Brand: PR Updates  Management of the LinkedIn account will be done via admin access, you can find out more on LinkedIn. We request that the Maker Brand team is given Super admin access, which will allow us to carry out all of the tasks outlined above   Questions for Core Units about intangible assets - for review and comment As per @sorenpeter’s post, we answered DAI Foundation questions below,  Have you acquainted yourself with the Dai & Maker Trademark Policy, so you are aware of how to utilize the Dai, Maker, and MakerDAO names and logos?  Answer: Yes  Which types of tangible and intangible assets will you be producing with the funding received from MakerDAO?  Answer: we will be producing banners to accompany any posts and updates on LinkedIn.  Will the assets produced using MakerDAO funding be made available as public goods for the whole DAO?   Specifically:   Will appropriate Open Source Software/Creative Commons licenses be applied to the assets produced?     Answer: Yes.  Will Copyright for those assets be assigned to the Dai Foundation that has as its mandate to safeguard MakerDAO intangible assets?  Answer: All logos, visual designs, and everything referrable and usable will be made available for the whole DAO  Will you integrate the Dai Foundation Contributor License Agreement Assistant in your Github repositories?  Answer: Content and assets that can be made available for public access will be integrated  Will the source code/material for the assets be made publicly available? How?  Answer: Yes, we will create a publicly accessible repository where all assets will be stored.  Besides the MakerDAO Forum and MakerDAO Discord, which communication channels do your core unit plan to use to communicate on behalf of MakerDAO according to your mandate?  Answer: the primary method of communication will remain Discord and the Forum.  Will you ensure that relevant publishing/community websites, email and SoMe accounts and associated DNS and ENS domains used for official MakerDAO communication for which you hold Content Management rights are under ownership of Dai Foundation to ensure ultimate Maker Governance control of who is using these channels?  Answer: Yes. As per this MIP, LinkedIn account access remains with the DAI Foundation, Maker Growth will be given admin access for publication  If you register any trademarks to represent MakerDAO funded solutions will you transfer those trademarks to Dai Foundation for safe keeping?  Answer: Yes ",
                    "links": [
                        "https://makergrowth.notion.site/MakerDAO-Announcement-Table-d0b985e511f34b0392741e4f3d1cd406",
                        "https://forum.makerdao.com/t/growth-cu-brand-and-communications-update/17347",
                        "https://forum.makerdao.com/t/growth-cu-monthly-update-july-2022/16974",
                        "https://forum.makerdao.com/t/maker-brand-update-june-july-2022/16858",
                        "https://forum.makerdao.com/t/maker-brand-team-monthly-update-may-2022/15980",
                        "https://forum.makerdao.com/t/maker-brand-pr-updates/15582",
                        "https://www.linkedin.com/help/linkedin/topic/a3110",
                        "https://forum.makerdao.com/t/questions-for-core-units-about-intangible-assets-for-review-and-comment/16334",
                        "https://daifoundation.org/trademarkpolicy",
                        "https://cla.daifoundation.org/",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/22",
                        "https://forum.makerdao.com/t/intangible-assets-as-public-goods-questions-for-growth-core-unit/18138",
                        "https://forum.makerdao.com/t/growth-cu-monthly-update-august-2022/17947",
                        "https://forum.makerdao.com/t/daif-cu-update-q3-2022/18211",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-21-28-de-septiembre-de-2022/18259"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.030481380864034
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "21/11/2022-11:54:12",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2022-06-30a/16240",
            "title": "Intangible Asset Agreed Modification of Management - 2022-06-30a ",
            "index": 16240,
            "category": [
                "Core Units",
                "Dai Foundation"
            ],
            "tags": [
                "daif-001",
                "intangible-asset"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#1",
                    "likes": "2",
                    "time": "30/06/2022-13:25:57",
                    "content": " Intangible Asset Agreed Modification of Management - 2022-06-30a  Action Date - 2022-07-07 (post date + 1 week)  Asset(s)  subdomain: cla.makerdao.com   Asset Type: subdomain Asset Owner: DAI Foundation Platform Manager: Techops core-unit (discord channel) Content Manager: Dai Foundation ([email protected]) Purpose: Host frontend for the Dai Foundation operated Contributor License Agreement Assistant Last Modification: -   Supporters @dumitru @Davidutro @sorenpeter  Reason for Modification When the Contributor License Agreement Asssitant is integrated with a Github repo the assistant prompt contributors doing a PR to accept the Contributor License Agreement. Once done the acceptance will be saved and the contributor will not be prompted again. Dai Foundation is forking the solution hosted at https://cla-assistant.io/ and will host it at https://cla.makerdao.com/ in order to ensure that the database with contributor signatures aren’t under 3rd party control. ",
                    "links": [
                        "https://discord.com/channels/893112320329396265/935222937785597992",
                        "https://cla-assistant.io/",
                        "https://cla.makerdao.com/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/09/2022-13:26:26",
                    "content": "This topic was automatically closed after 90 days. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09090909090909
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2022-06-30b/16241",
            "title": "Intangible Asset Agreed Modification of Management - 2022-06-30b ",
            "index": 16241,
            "category": [
                "Core Units",
                "Dai Foundation"
            ],
            "tags": [
                "daif-001",
                "intangible-asset"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#1",
                    "likes": "3",
                    "time": "30/06/2022-13:29:09",
                    "content": " Intangible Asset Agreed Modification of Management - 2022-06-30b  Action Date - 2022-07-07 (post date + 1 week)  Asset(s)  email: [email protected]   Asset Type: Email Asset Owner: DAI Foundation Platform Manager: Techops core-unit (discord channel) Content Manager: Dai Foundation ([email protected]) Purpose: Email address to report scammers etc that infringes on the MakerDAO trademarks Last Modification: -   Supporters @dumitru @Davidutro @sorenpeter  Reason for Modification To establish a single point of contact to report abuses of the Maker Brand and associated trademarks. The email will be monitored by @daif-core-unit with assistance from @techops-core-unit ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.098214285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/09/2022-13:29:23",
                    "content": "This topic was automatically closed after 90 days. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09090909090909
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2022-05-24/15348",
            "title": "Intangible Asset Agreed Modification of Management - 2022-05-24 ",
            "index": 15348,
            "category": [
                "Governance"
            ],
            "tags": [
                "gro-001",
                "intangible-asset"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "13",
                    "time": "24/05/2022-16:59:38",
                    "content": " Intangible Asset Agreed Modification of Management - 2022-05-24  Action Date - 2022-05-31  Asset(s)  List the modified assets and managers using the following template:   asset name Asset Type: Subdomain Asset Owner: DAI Foundation Platform Manager: makerdao.com domain Content Manager: Growth Core Unit [email protected] Purpose: Subdomain launching the website of the MakerDAO Nature Campaign Last Modification: 2022-05-24   Supporters @prose11 @0xdeniz @juan  Reason for Modification The Growth Core Unit requests to activate the subdomain nature.makerdao.com and connect it to the website hosted in https://maker-poap-test.web.app/ in order to launch the campaign named Nature through the appropriate MakerDAO domain.  What is Nature? Nature is a loyalty program designed by the Maker Brand Team for Maker Vault users and the planet. The objective of Nature is to cover the carbon footprint generated by each Maker Vault opened, and then each Dai minted, by planting trees. This is possible because of an upcoming partnership between MakerDAO, One Tree Planted, and Proof of Attendance Protocol (POAP).  How Nature works The act of opening a Maker Vault carries with it some amount of computing power and digital storage space on the Ethereum blockchain. At the same time, and due to these necessary resources, this new Maker Vault has an impact on the environment, measurable through its carbon footprint. Nature aims to cover this carbon footprint of each new Maker Vault by planting an equivalent number of trees that can neutralize it. First of all, we need to understand that each Maker Vault user is represented by one address on the Ethereum blockchain. Then, we can identify each Maker Vault user by the address attached to the creation of a new Maker Vault. After identifying it, the address will be sent to POAP, to then be enabled to claim a unique POAP themed with the purpose of Nature. The POAP will be claimable by the user through nature.makerdao.com and will work as irrefutable proof that the new Maker Vault user has covered their carbon footprint. After a specific number of new Maker Vaults have been created, an order will be sent to One Tree Planted systems in order to trigger the action of planting 10 trees for each new Maker Vault. Why do we need the subdomain nature.makerdao.com? Nature is the name of this campaign. The domain makerdao.com is our official name on the internet. Therefore, we’re requesting the subdomain nature.makerdao.com to properly identify the Nature campaign and the official owner of this campaign for our users. The website will allow Maker Vault users to understand the Nature initiative and interact with an interface that will provide them with the respective POAP and will allow us to understand how many trees One Tree Planted has to plant, according to the number of POAPs that have been claimed in a weekly basis. The POAPs will be only claimable by Maker Vault owners. ",
                    "links": [
                        "https://maker-poap-test.web.app/",
                        "https://onetreeplanted.org/",
                        "https://poap.xyz/",
                        "http://nature.maker.com",
                        "http://nature.makerdao.com",
                        "http://makerdao.com",
                        "http://nature.makerdao.com",
                        "https://forum.makerdao.com/t/governance-and-risk-194-thursday-june-09-at-17-00-utc/15664/2",
                        "https://forum.makerdao.com/t/daif-cu-update-q2-2022/16403",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-19-25-2022/15397"
                    ],
                    "GPT-summary": "The post explains the modification of management of an intangible asset, which is a subdomain launching the website of the MakerDAO Nature Campaign. The Growth Core Unit requests to activate the subdomain nature.makerdao.com and connect it to the website hosted in https://maker-poap-test.web.app/ in order to launch the campaign named Nature through the appropriate MakerDAO domain. The post also explains the Nature campaign, how it works, and why the subdomain nature.makerdao.com is needed. The post does not contain entirely positive or negative feedback on the proposal, nor does it contain any request for collaboration or auditing.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.524621212121213
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "8",
                    "time": "24/05/2022-17:37:53",
                    "content": "This is a nice idea, but risks being seen as cynical greenwashing. I mean, it’s not just opening a vault that has a carbon footprint. Every interaction with the vault that involves mining transactions has a carbon footprint. I think it would be important to explain why Maker is in favor of The Merge and how The Merge will drastically reduce Maker’s carbon footprint. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.109375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#3",
                    "likes": "5",
                    "time": "24/05/2022-19:49:00",
                    "content": "Good point, we will also modify the message so instead of talking about carbon footprint, we can say something similar to “we are doing our part” in this matter. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#4",
                    "likes": "2",
                    "time": "24/05/2022-23:04:38",
                    "content": "This sounds really interesting. Just off the top there are two things I like, namely:  Trying to reduce the carbon footprint; and POAP  Looking forward to reading more about it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#5",
                    "likes": "1",
                    "time": "24/05/2022-23:30:55",
                    "content": "If we want to donate some of the platforms revenue to planting trees, then we should just do that as simply and directly as possible. No need to tie it to something like vaults opening. That just adds unneeded complexity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#6",
                    "likes": "0",
                    "time": "25/05/2022-16:22:28",
                    "content": "I don’t know if these practices are common within the general crypto-ecosystem. I’m pretty new to it, so my reasoning could be wrong. Maybe, with proper advertisement, this could work as an incentive for some people to decide to open a Maker Vault instead of going to any other lender? Of course, Maker could choose to straightforwardly simply donate. But it seems to me that this could give clients the feeling that it’s them doing something and contributing to the cause by recurring to Maker. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author is advertising proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.728535353535354
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#7",
                    "likes": "0",
                    "time": "25/05/2022-16:40:59",
                    "content": "Yes, you can treat it as a marketing tactic, but it feels very gimmicky and I doubt it would move the needle much. Most dai comes from 100k+ vaults, and people aren’t making such big financial decisions based on how many trees get planted. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.616666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#8",
                    "likes": "0",
                    "time": "25/05/2022-16:47:38",
                    "content": "    CodeKnight:  people aren’t making such big financial decisions based on how many trees get planted.   Call me naïve, but let me say: maybe that’s what’s wrong with Humanity. Nevertheless, fair enough. () ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#9",
                    "likes": "2",
                    "time": "27/05/2022-01:50:41",
                    "content": "Dear Community, Do not think that an action like this will move “any needle”.  It is a nice and altruistic initiative to keep the conversation about MakerDAO going on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#10",
                    "likes": "6",
                    "time": "27/05/2022-02:34:12",
                    "content": "This is a great initiative with very little downside, in my view. I agree with @psychonaut that it’s important to signal broader alignment with climate-friendly practices (most obviously, The Merge) but that’s not incompatible with this kind of program. It doesn’t seem from Nadia’s post that anyone will be forced into the Nature program - it seems like it will work on an opt-in basis. So anyone predisposed to think this is cynical greenwashing just won’t participate, which is fine, and those who feel more positively have a cool option to offset part of their Maker footprint. More generally, Maker seems likely to eventually develop in alignment with the Case For Clean Money set out by Rune. Low-hanging fruit like developing the Nature subdomain makes sense in the context of this broader protocol discussion. Finally, and at the risk of deviating slightly off-topic, it’s worth remembering that carbon emissions are one of the leading arguments used to discredit and delegitimise the whole industry. In the last month or so, mainstream institutions and groups are relentlessly citing these concerns as justification for disengaging or for greater regulation (see: Wikipedia no longer accepting crypto donations, the European Commission discussing a proof-of-work ban, etc). There is strategic value in positioning Maker as a planet-friendly protocol, and in taking incremental steps towards that ideal. ",
                    "links": [
                        "https://www.theverge.com/2022/5/1/23052309/wikimedia-foundation-stops-cryptocurrency-donations-wikipedia?fbclid=IwAR2shuHgCbt9vYNhPjJHZHt9-Od5vgTCh3OBC4FyJAfED3iwV32NS_ZYDIo",
                        "https://finance.yahoo.com/news/sweden-eu-discussed-bitcoin-proof-112915425.html"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.104206123737374
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#11",
                    "likes": "1",
                    "time": "05/06/2022-12:24:27",
                    "content": "Love it! The ocean is made up of tiny drops of water. Even if we do the smallest bit we can, it’s still worth it for the sake of the tiny rock we live on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.061363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#12",
                    "likes": "0",
                    "time": "04/09/2022-18:24:45",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1047"
}