{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/urgent-flash-loans-and-securing-the-maker-protocol/4901",
            "title": "[Urgent] Flash Loans and securing the Maker Protocol ",
            "index": 4901,
            "category": [
                "Updates"
            ],
            "tags": [
                "meta-governance",
                "voting",
                "govsec-module",
                "flash-loans"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "38",
                    "time": "28/10/2020-16:37:00",
                    "content": "On the 26th October, the Smart Contracts Domain Team detected voting behaviour irregularities with respect to: Increase the Surplus Buffer, Oracle Whitelisting - October 23, 2020 proposal. It has since been confirmed that a flash loan was used to pass the October 23rd proposal in the following manner:  Oct 26, 2020, 17:37:17 UTC a single transaction was executed a. WETH was borrowed from dYdX with a $20m flash loan (50k ETH) b. This was deposited on AAVE, and used to borrow $7m MKR (13k MKR) c. The MKR was locked in governance, chief.lock() d. Voted on the proposal with chief.vote() e. Made the hat with called chief.lift() f. Then freed with chief.free() g. The spell with the hat was scheduled with spell.schedule() h. The MKR was unlocked and returned to AAVE and dYdX Finally, after the GSM delay of 12 hours (Oct 27, 2020, 05:37 UTC), the spell was then executed with spell.cast()   The Maker Foundation has been in contact with the BProtocol team, and are aware that they were responsible for the flash loan. BProtocol has been fully transparent in communicating their actions once the Foundation became aware of the voting irregularities. Their actions are a practical example for the community that flash loans can and may impact system governance and highlight that MKR market liquidity needs to be actively monitored. The DAO also needs to assess its ability to react in the event a more contentious vote is pushed through. The fact that the proposal in question was directly related to BProtocol being whitelisted on the ETHUSD Medianizer and OSM oracles raises some concerns as to how/if flash loans should be accepted in such circumstances.  In addition to this issue, last week was the first time in which a malicious governance attack using flash-loans has been theoretically possible (the available MKR liquidity exceeded the value of MKR on the hat.) While the GSM pause delay does allow governance 12 hours (currently) to react to a malicious proposal, it is still an open question as to whether MKR Holders would be able to react in time. Additionally, the Liquidation Circuit Breaker (FlipperMom) and the Oracle Freeze Module (OsmMom) are both modifiable outside of the GSM Pause Delay. In light of both the flash loan on the 23rd and the reduced amount of MKR on the hat, both the Smart Contracts Domain Team and the Governance Facilitator feel that the risk of malicious governance action has become unacceptably high. There are two primary issues that have been identified: 1. The risk of malicious governance action using flash loans has become unacceptably high. 2. Flash loans can be used to pass controversial governance proposals. The rest of this post will deal solely with the first issue, with the second to be addressed once the Maker Protocol has been further secured against malicious governance proposals. At time of writing, there is MKR liquidity available on multiple platforms that can be used by flash loan attacks:   42,649 MKR in Balancer  15,170 MKR in AAVE  5,626 MKR in Uniswap  This comes to a total of 63,445 MKR that is accessible using flash loans. Given that the current hat proposal has ~79k MKR, there is no immediate risk of governance attack. However, there is risk when new executive proposals are submitted. In light of this issue the Governance Facilitator and the MakerDAO Smart Contracts Domain team will take the following actions. Actions Prepare executive spell to minimize risk The MakerDAO Smart Contracts Domain Team will prepare an executive spell that if ratified will take the following actions:  The GSM pause delay will be increased to 72 hours. The Oracle Freeze Module (OsmMom) will be deauthorized. The Liquidations Circuit Breaker (FlipperMom) will be deauthorized.  We are aware that disabling the Oracle Freeze Module and the Liquidations Circuit Breaker increases risk in other areas. We feel that the Oracle and Liquidation risks are less than that of governance attack especially given the additional lightfeeds and box parameter. 72 hours was chosen given that it stretches across at least one working day, regardless of the timing on the governance attack. This gives Governance more time to secure the hat, and domain teams time to prepare an action to cancel the plotted spells. This executive spell will not immediately be put on-chain. Gather more MKR on the hat proposal We feel that additional MKR is required on the hat in order to ensure safety while MKR transitions from one proposal to another. The Governance Facilitator will provide additional updates and next steps once either of the following conditions has been met.  The MKR on the hat exceeds 100,000 MKR One week has passed.  100k MKR was chosen because it exceeds the 63k currently available liquidity, and the new governance portal has a feature that allows voting on multiple proposals at once which should mitigate the risk of the hat proposal decreasing below 63k during the transition. Signalling around Governance Attack Response The Governance Facilitator will post a signal request that will aim to confirm the following sentiment to all MKR Holders: “In the event of a malicious governance attack that leads to redeployment of the Maker Protocol prior to the introduction of flash loan guards into the governance process, the community and domain teams should do everything possible to burn the MKR involved in the attack, regardless of whether the owner was directly involved in the attack.” Edit: [Signal Request] Should the Maker Community burn attacking borrowed MKR in the event of a governance attack leading to protocol redeployment? Reaching out to large MKR Holders The Smart Contracts Domain Team, and the Governance Facilitator will attempt to contact large MKR Holders with MKR on Aave, Balancer and Uniswap with the aim of convincing them to remove MKR from these platforms until flash loan guards are in place and to add their MKR to the current hat and vote in the coming executive. The executive containing YFI and BAL collateral onboarding will be delayed The Smart Contracts domain team was aiming to have these complete this week, however the flash loan issue has taken priority for the time being. The Smart Contracts Domain Team will explore options to mitigate the flash loan risk prior to the DssGov upgrade Given the potential severity of flash loan related attacks, the Smart Contracts Domain Team feels that it is wiser to resolve the vulnerability from flash loans sooner than would be possible if they waited for DssGov. ",
                    "links": [
                        "https://forum.makerdao.com/t/should-the-maker-community-burn-attacking-borrowed-mkr-in-the-event-of-a-governance-attack-leading-to-protocol-redeployment/4903",
                        "https://forum.makerdao.com/t/updates-flash-loans-and-securing-the-maker-protocol/4923",
                        "https://forum.makerdao.com/t/reacting-to-the-october-23rd-executive/4961",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-116-thursday-october-29-16-00-utc/4835/4",
                        "https://forum.makerdao.com/t/dschief-1-2-proteccion-contra-los-flash-loans-para-la-gobernanza-maker/5270",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/3",
                        "https://forum.makerdao.com/t/week-22-dai-distributions-sourcecred-funding-mip13c3-sp6/4988",
                        "https://forum.makerdao.com/t/maker-relay-ep-19-en-espanol/4981",
                        "https://forum.makerdao.com/t/dschief-1-2-flash-loan-protection-for-maker-governance/5115",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-117-thursday-november-5-16-00-utc/4929/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-19/4975"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.659740259740259
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "7",
                    "time": "28/10/2020-16:39:30",
                    "content": "I’d like to take this opportunity to encourage all MKR Holders to vote on the current hat to help secure the protocol. I’d also love to hear feedback on the above response. This is the current plan, but it isn’t set in stone and can be modified if the community presents solid arguments for why this is unsuitable. Thanks all. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7857142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#4",
                    "likes": "6",
                    "time": "28/10/2020-17:01:39",
                    "content": "Curious. Might it also be possible to introduce a delay from the time MKR is deposited into the Executive voting construct until when the owner could vote. I would think that if that delay was 24 hours (or even a week, if needed), the risks associated with flash loans would be hedged. Thoughts? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#5",
                    "likes": "1",
                    "time": "28/10/2020-17:02:36",
                    "content": "Interesting, flash loans enables people to push through executives without the capital needed (with current model). Though one thing to note, Balancer costs slightly more than a normal flash loan attack at a 2% fee. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#6",
                    "likes": "15",
                    "time": "28/10/2020-17:05:32",
                    "content": "Even just a single block delay between locking and freeing MKR in the Chief would be sufficient. This is one of the solutions we’re researching (already have the code under review, in fact). The downside is that you have to migrate from the old Chief to the new Chief. We’d add an activation threshold to the new Chief to avoid being vulnerable to voting by small amounts of MKR during the transition, but then there would also be a period of time during which no governance actions could be taken (an unpredictable one, determined by how long it takes MKR holders to migrate in sufficient token quantity). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.584145021645022
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "2",
                    "time": "28/10/2020-17:11:05",
                    "content": "Signal Request is now live and can be found here: Should the Maker Community burn attacking borrowed MKR in the event of a governance attack leading to protocol redeployment? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#8",
                    "likes": "3",
                    "time": "28/10/2020-17:11:35",
                    "content": "    Kurt_Barry:  Even just a single block delay between locking and freeing MKR in the Chief would be sufficient.   Personally speaking, we might as well make sure we are making MKR borrowing for executives “expensive” by making the time longer than one block… On the extreme minimum, one day (in my eyes) all the way to a week or longer. Anyone that would be borrowing MKR to make a decision wouldnt want to take pricing risk of MKR. By being force to hold in executive voting construct for a period of time, we make it less economically attractive to have an attack vector to use borrowed MKR.     Kurt_Barry:  there would also be a period of time during which no governance actions could be taken   Let’s get started earlier than later! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.242724867724869
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "5",
                    "time": "28/10/2020-17:13:46",
                    "content": "I’d like to highlight this thread regarding DssGov again: MIP26: DssGov - Governance Contract Redesign Many of the solutions people are suggesting have either been covered in that MIP, or in the responses. Please do give it a read and express your support for the functionality you want to see in the next major upgrade. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#10",
                    "likes": "4",
                    "time": "28/10/2020-17:23:08",
                    "content": "    LongForWisdom:   The Oracle Freeze Module (OsmMom) will be deauthorized. The Liquidations Circuit Breaker (FlipperMom) will be deauthorized.    What does this mean, practically speaking, for Vault owners? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#11",
                    "likes": "2",
                    "time": "28/10/2020-17:23:35",
                    "content": "Right, you could make the locking period longer to discourage the use of ordinary borrowed MKR; we’ve discussed that as well. You walk a fine line there between securing the system and making voting less attractive due to illiquidity risk, which might decrease participation. From a practical perspective, it’s not clear how long that locking period would need to be to be effective, or at what point you’d actually discourage voting. Right now we’re focused on addressing the highest-priority issue, flash lending. With the DssGov upgrade coming in a couple months, it may make sense to limit the scope of what we’re trying to solve here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.793831168831169
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#12",
                    "likes": "1",
                    "time": "28/10/2020-17:25:37",
                    "content": "    Kurt_Barry:  Right now we’re focused on addressing the highest-priority issue, flash lending.   100% agreed. The rest is an optimization. I do however believe that most folks that vote leave their MKR in the executive voting contract, with a small minority moving in and out.     Kurt_Barry:  With the DssGov upgrade coming in a couple months, it may make sense to limit the scope of what we’re trying to solve here.   From that lens, I tend to agree. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.892857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#13",
                    "likes": "3",
                    "time": "28/10/2020-17:28:36",
                    "content": "It means that Maker Governance will not be able to prevent liquidations in the event of significant downward market movement, and it means that Maker Governance will not be able to freeze the oracle prices in the event of an oracle attack. On the flip side, someone performing a flash loan governance attack will not be able to:  Freeze the oracles. Prevent Liquidations.  I’m not sure that it really means much different for vault holders, they weren’t able to rely on governance using these systems anyway. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.453125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#14",
                    "likes": "5",
                    "time": "28/10/2020-17:34:38",
                    "content": "I’ll add on to LFW’s points that with the box parameter that limits the amount of DAI needed to cover debt+fees of active auctions by preventing liquidations after a certain point, the system has additional resilience to price crashes/oracles attacks that was not present when the instant access modules were originally conceived. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4559523809523816
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#15",
                    "likes": "6",
                    "time": "28/10/2020-18:16:21",
                    "content": "There is a relatively large amount of MKR on Balancer. I believe on primary reason for this is the ability to earn BAL rewards for providing liquidity. According to pools.vision, the largest MKR pool is earning roughly ~17% APR in BAL rewards. Balancer uses a mechanism called capFactor to limit the total dollar value of liquidity for any one token that is eligible for rewards (this was introduced to guard against manipulation of the distribution). We could potentially ask Balancer community to reduce MKR to a lower capFactor for the time being until we have guards in place against flash loans. This will reduce incentives to provide MKR liquidity. If this sounds like a good idea to pursue in the short term, I’m happy to reach out to Balancer forum and team to see how this can be accomplished. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.23015873015873
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#16",
                    "likes": "1",
                    "time": "28/10/2020-18:20:56",
                    "content": "    monet-supply:  If this sounds like a good idea to pursue in the short term, I’m happy to reach out to Balancer forum and team to see how this can be accomplished.   great idea… and wonderful initiative! please !! It cannot hurt … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.916666666666668
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#17",
                    "likes": "3",
                    "time": "28/10/2020-18:35:35",
                    "content": "Are we increasing the OSM GSM delay to 72 hours? It should be the responsibility of ALL MKR holders that a malicious proposal that passes doesn’t get executed. Flash loan attacks to pass a proposal have a cost. In this case, they even took steps to avoid paying the 0.09% AAVE flash loan fee. Balancer would have a 2% flash loan fee. Well, some people might love to reduce the capFactor, you also might have trouble raising the capFactor back again. (Last capFactor raise for MKR was quite contentious and passed with 55.45%) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#18",
                    "likes": "0",
                    "time": "28/10/2020-18:44:15",
                    "content": "    Jiecut:  Are we increasing the OSM delay to 72 hours?   I don’t think so. 72 hour delayed price data seems not great. Perhaps I’m misunderstanding you.     Jiecut:  Flash loan attacks to pass a proposal have a cost. In this case, they even took steps to avoid paying the 0.09% AAVE flash loan fee. Balancer would have a 2% flash loan fee.   The 2% there comes from trading fees on the balancer pools? As I mentioned in one of my replies, this isn’t necessarily a fixed plan. Do you feel that we should be taking a different response, or that we’re overestimating the risk? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HysMagus",
                    "index": "#19",
                    "likes": "1",
                    "time": "28/10/2020-20:47:18",
                    "content": "After the immediate remediation is taken care of (the freezes and such), I would propose a simple way to prevent future governance manipulation using flash loans would be to change the requirements on chief.vote() to check the MKR locked in the preceding block in chief.lock(). That way someone can’t borrow, lock and vote in the same block. If I’m not mistaken that’s how Aragon safeguards as well Edit: Grammer ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#20",
                    "likes": "5",
                    "time": "28/10/2020-21:40:45",
                    "content": "This is one path of exploration.  We’ve made this change in the upcoming DssGov (MIP26: DssGov - Governance Contract Redesign) and are considering pulling this feature into a 1.1 upgrade on the current DsChief design.  There are, however, other possible remediations up for consideration and we are carefully weighing all the risks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chonghe",
                    "index": "#21",
                    "likes": "3",
                    "time": "29/10/2020-02:13:32",
                    "content": "Newbie trying to understand what is going on.  The Maker Foundation has been in contact with the BProtocol team, and are aware that they were responsible for the flash loan.  Is it true to say that B.Protocal team is the one using flash loan to pass the executive vote, hence whitelisted their price oracle? If so, why would they do that? Given that an executive vote will usually pass sooner or later? That sounds a bit of aggressiveness involved, and a compromise in credibility that someone will do everything to achieve the goal I also have a question, to pass an executive vote, isn’t that MKR needs to be locked and in support to the vote. How can it be done using flash loan? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.550000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#22",
                    "likes": "2",
                    "time": "29/10/2020-02:20:05",
                    "content": "    chonghe:  If so, why would they do that? Given that an executive vote will usually pass sooner or later? That sounds a bit of aggressiveness involved, and a compromise in credibility that someone will do everything to achieve the goal   @chonghe There was also some time pressure for last Friday’s executive. Needed to be passed by Monday, before the Monthly MIPs bundles executive. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#23",
                    "likes": "8",
                    "time": "29/10/2020-08:58:13",
                    "content": "This is Yaron, the founder of B.Protocol. Idk how much our side is relevant to the discussion, but let me put it here to have some context for future generations… We meant no harm, and no harm was made. Our view is that MakerDAO was never under real threat, and flashloans are only a future (theoretical) threat. B.Protocol is built on top of Maker, and makes it stabler by bringing committed Keepers, who share proceeds with users. Showcasing the potential vote vulnerability was aimed to trigger an internal technical discussion on ways to improve it, and we did not anticipate the community will view it as an immediate threat. MakerDAO were very helpful to us during our integration process, and in retrospect we regret not disclosing this issue to them in a more responsible manner, which would have eliminated the sense of urgency. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7857142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#24",
                    "likes": "2",
                    "time": "29/10/2020-12:49:05",
                    "content": "A technical comment, the more votes in the current hat makes it more secure, but on the other hand makes it harder to mitigate a flash loan vote attack, as it will be harder to vote for an undo hat, in a 12 hour period. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.671875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#25",
                    "likes": "10",
                    "time": "29/10/2020-13:03:58",
                    "content": "Thanks @LongForWisdom and domain temas, for reacting quickly to the danger. I have voted in the other poll. This said, I would like to complain about the use of “URGENT” and “EMERGENCY” decisions. In this specific case, the issue was far from unpredictable. It was always there and pointed by many people. I myself (with all my limits) have mentioned it here:     Question about \"Buying votes\" - Danger? Governance       One ‘solution’ I can imagine (but I am sure it’s a bit naive, and other possibilities exist) is to require the MKR to be locked for a certain amount of time (in the voting contract) before allowing them to express a vote.  This ‘lock’ could be activated only on certain critical situations, when we think that the risk of ‘buying votes’ is a concern.  Other ideas? In general the notion that borrowing MKR to attack the system using voting is well–known. So this must have been discussed already.  Bu…     more than 2 months ago. Why are we waiting the attack to happen (fortunately it was the BProtocol team) to start taking counter-measures? I understand that the attack has become theoretically viable only very recently, but it was clear months ago that this would happen at a certain point. Similarly, it is easy to predict that MKR-borrowing will become an issue eventually, even without recurring to flash loans. Flash loans just make it cheap and easy, today. We should now start discussing deeply about how to reorganise the tokenomics of MKR to incentivise virtuous behaviour (voting, participation, etc).     LongForWisdom:  Given that the current hat proposal has ~79k MKR,   It’s not acceptable that only ~8% of existing MKR are used for voting, given that MKR is a Governance Token. ",
                    "links": [
                        "https://forum.makerdao.com/t/week-22-dai-distributions-sourcecred-funding-mip13c3-sp6/4988"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.64675697865353
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#26",
                    "likes": "4",
                    "time": "29/10/2020-13:31:54",
                    "content": "Hi @iammeeoh def agree with you about predicability, however we still have muscle constrains and the prioritization was/is on the peg & collateral onboarding, as this there are other contigent risks but we can´t solve them all at the same time, this was a contigent risk and has taken priority after it happened. Definitely agree we should review the token economics complementary to the proposed course of action (on which I also do agree and thank for the flash quick response from everyone involved). People should be free to use maker however they please and we should work on allinging the incentives in order to have the desired outcome. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.590277777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TheoRochaix",
                    "index": "#27",
                    "likes": "0",
                    "time": "29/10/2020-15:42:29",
                    "content": "Agree, this should have been fixed before. Nonetheless, if “governance attack” risk is bigger than “oracle and liquidation risks” than, this lesson was highly less expensive than $30M black thursday ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.266666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#28",
                    "likes": "5",
                    "time": "29/10/2020-19:30:46",
                    "content": "Can’t we also use flash loans to defend an attack too? Flash loans seem a bit stronger for veto’s since there’s no GSM delay for them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#29",
                    "likes": "2",
                    "time": "29/10/2020-21:17:08",
                    "content": "This is an interesting idea. A defensive bot which will cancel any spell it can with all available flash loan liquidity. This should protect against us getting caught off guard. One cool thing about this strategy is that anyone can run it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#30",
                    "likes": "11",
                    "time": "30/10/2020-18:17:34",
                    "content": "    LongForWisdom:  There are two primary issues that have been identified: 1. The risk of malicious governance action using flash loans has become unacceptably high. 2. Flash loans can be used to pass controversial governance proposals. The rest of this post will deal solely with the first issue, with the second to be addressed once the Maker Protocol has been further secured against malicious governance proposals.       yaronvel:  We meant no harm, and no harm was made.   @yaronvel just to be clear. The first issue mentioned takes priority due to its severity. I’ll start getting to the second on Monday. I strongly disagree with your statement that no harm was done. A fundamental assumption within the Maker Protocol is that ‘If you do not own MKR, you are not supposed to be able to influence governance decisions.’ You do not own 13,000 MKR and you were not supposed to influence this governance decision. Just because the governance contract makes it possible to do something doesn’t mean that you should do it. I believe that the claim that this was done to showcase a vulnerability is a rationalization of a decision that you made for entirely different reasons. The flash loan was not executed until the point at which it seemed like the vote was going to ‘fail’ (be replaced by the monthly MIPs vote). Showcasing a vulnerability was possible on any other governance vote, there has been 13k MKR available on Aave for months. Choosing to showcase it on your own proposal is a terrible idea, for this exact reason (it throws doubt on the outcome and leads to beliefs like this one.) I believe the most likely explanation for why you waited until the last minute is that you knew what you were doing was sketchy, but you felt that the Maker Governance process was less important than you getting access to the Maker Oracles and launching your platform. Ultimately it will be up to the community and actual MKR Holders to decide what (if any) response there should be, but that discussion will take place. Playing this off as no big deal is not helping your case (at least when it comes to me.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.259436274509804
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#31",
                    "likes": "0",
                    "time": "31/10/2020-01:24:17",
                    "content": "If MKR tokens are placed on the Maker platform, will it cause less damage than AAVE? Should we compare the advantages and disadvantages of each. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#32",
                    "likes": "4",
                    "time": "31/10/2020-21:41:51",
                    "content": "    iammeeoh:  We should now start discussing deeply about how to reorganise the tokenomics of MKR to incentivise virtuous behaviour (voting, participation, etc).   I think this is very importante, it’s needed some way to incentivise voting, if not there will always be the same votes or less than today, of course we know that there are MKR whales, but incentivise for sure will bring more new and unique voters, and that’s what we want. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.965435606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#33",
                    "likes": "0",
                    "time": "01/11/2020-01:37:51",
                    "content": "I agree that there should be some mechanism to attract more value-added ideation and engagement in the voting process. We do not have governance by the majority, we have governance by the majority that participates. As such, we should be marketing to people what our vision is and how they too can shape the direction of the protocol. People need to know that their financial capital and human capital are valuable or else they will simply go elsewhere. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#34",
                    "likes": "1",
                    "time": "01/11/2020-09:44:04",
                    "content": "    ejbarraza:  We do not have governance by the majority, we have governance by the majority that participates.   completely mimics public corporate voting and  political voting… In general, i agree with you. The goal is to incentivize participation in a system. Ownership is one way though passive. Shy of allocating value to those that vote the alternative is to penalize those that don’t. Neither of those is good options in my mind. From my lens, a combination of vote delegation (possibly compensated delegation) and L2 /  roll ups should help minimize all friction. as for the rest that don’t vote, the parallel is corporate board voting. Last time i checked if an owner controls 5% of the equity (in a large publicly traded company, eg Coca Cola) he / she has basically a majority on any vote given the average turnout on voting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1479591836734695
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#35",
                    "likes": "1",
                    "time": "01/11/2020-12:40:33",
                    "content": "As this is not the main topic of this thread, I will give a quick response, and look forward to elaborate more on a dedicated thread. First things first, I am aware that my actions were not the textbook definition of a responsible disclosure, and I do regret that as a result an urgent response was needed. Beside the ethical considerations, i also failed to see that the MKR in balancer is also part of the threat (and without it, the threat was very minor). Some factual details:   The smart contract that voted with the flash loan was deployed to mainnet more than 24 hours before it was executed. Prior to this proposal I never dived into the MakerDAO governance process.   Nothing was done in a rush, and I deliberately did not try to hide my tracks, despite having sufficient time to use tornado-cash or other means prior to the execution.   The timing of the actual flash loan was dictated by the earliest possible time that would make the vote count.   On a more personal note, B.Protocol brings new Keepers to MakerDAO, and tries to help make it more stable. Looking forward to elaborate on the above next week. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.80974025974026
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#36",
                    "likes": "1",
                    "time": "01/11/2020-14:23:15",
                    "content": "    mrabino1:  From my lens, a combination of vote delegation (possibly compensated delegation) and L2 / roll ups should help minimize all friction.   Vote delegation is an amazing idea, giving the trust to someone or some people that we think is gonna vote in a good way will give more vote power to the people that can’t own to much MKR but want to participate in some way. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#37",
                    "likes": "0",
                    "time": "01/11/2020-14:38:44",
                    "content": "key point also being the MKR holder can also withdraw that delegation … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#38",
                    "likes": "0",
                    "time": "01/11/2020-20:24:16",
                    "content": "And what about redirecting part of the dai to be sold to the MKR stacked. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#39",
                    "likes": "4",
                    "time": "01/11/2020-20:46:17",
                    "content": "    LongForWisdom:  You do not own 13,000 MKR and you were not supposed to influence this governance decision.   In the real world, there would be no questions that he owned those tokens, even for just a transaction, and was fully legit to vote. I live in country (France) where the government borrows corporate shares to vote on shareholders meetings and force a vote (interestingly it was to award long term shareholders, mainly himself, with double weighted votes). Obviously, we should find a fix for that and I am glad that we are already quite advanced. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.705922865013774
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#40",
                    "likes": "0",
                    "time": "02/11/2020-11:17:34",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Guy",
                    "index": "#42",
                    "likes": "0",
                    "time": "11/11/2020-13:59:02",
                    "content": "    LongForWisdom:  “In the event of a malicious governance attack that leads to redeployment of the Maker Protocol prior to the introduction of flash loan guards into the governance process, the community and domain teams should do everything possible to burn the MKR involved in the attack, regardless of whether the owner was directly involved in the attack.”   What does ‘burn’ mean in practice here? It feels like a nuclear deterrent: “Anyone who lends out their MKR risks losing it.” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.734375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#43",
                    "likes": "2",
                    "time": "11/11/2020-22:53:50",
                    "content": "I think it means exactly that. “You can lend them, but be careful because you will pay the consequences.” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#44",
                    "likes": "0",
                    "time": "18/11/2020-22:53:52",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/updates-flash-loans-and-securing-the-maker-protocol/4923",
            "title": "Updates - Flash Loans and securing the Maker Protocol ",
            "index": 4923,
            "category": [
                "Updates"
            ],
            "tags": [
                "meta-governance",
                "voting",
                "govsec-module",
                "flash-loans"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "13",
                    "time": "29/10/2020-14:44:29",
                    "content": "Edit: Executive is now live. Please vote now! See previous post if this is news to you: [Urgent] Flash Loans and securing the Maker Protocol As promised, I’m providing an update now the current hat exceeded 100k MKR. The next steps are now as follows: Post Executive Spell on Friday at 16:00 UTC (usual time) As mentioned previously, the contents of this spell are as follows:  A GSM pause delay increase from 12 hours to 72 hours. The Oracle Freeze Module (OsmMom) will be deauthorized. The Liquidations Freeze Module / Circuit Breaker (FlipperMom) will be deauthorized.  We are aware that disabling the Oracle Freeze Module and the Liquidations Freeze Module increases risk in other areas. We feel that the Oracle and Liquidation risks are less than that of governance attack especially given the additional lightfeeds and box parameter. 72 hours was chosen given that it stretches across at least one working day, regardless of the timing on the governance attack. This gives Governance more time to secure the hat, and domain teams time to prepare an action to cancel the plotted spells.  Give that the amount of MKR on that hat has meaningfully increased, the Smart Contracts Domain Team and the Governance Facilitator are comfortable deploying an additional executive vote. Friday was chosen as it matches the usual schedule and should mean that more MKR Holders are prepared to move their MKR in a short time after the spell is deployed. Please note that the new governance portal contains functionality to vote for both the current hat and a new proposal (screenshot below.) Making use of this functionality will help to ensure security while both executives are active. Thank you to everyone that has helped to secure the hat. image1662×871 155 KB ",
                    "links": [
                        "https://forum.makerdao.com/t/urgent-flash-loans-and-securing-the-maker-protocol/4901",
                        "https://forum.makerdao.com/t/week-22-dai-distributions-sourcecred-funding-mip13c3-sp6/4988"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.201228555395222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#3",
                    "likes": "5",
                    "time": "29/10/2020-17:21:10",
                    "content": "A quick note about supporting old and new proposals… As LFW stated, the “Keep my MKR on old proposal to secure the Maker protocol” checkbox allows MKR holders to support both the new proposal and the current hat, thereby helping to prevent the amount of MKR in support of the hat from falling dangerously low as a new proposal gains support. Assuming comprehension of this concept, let’s expand upon the rules for when the checkbox does or does not appear: The checkbox “Keep my MKR on old proposal to secure the Maker protocol” is checked by default and appears if:  The old proposal a user is voting on is the hat, and The new proposal a user wants to vote on is below the current hat in MKR weight  The checkbox changes to a “concentrate all my MKR on this proposal” button if:  The proposal a user is looking at has not yet passed, and The user is currently voting on a slate with multiple proposals  The checkbox changes to “Add MKR to secure the protocol” button, if:  The user is looking at the current hat and has not voted on it yet  This small enhancement should make it easier to retain your support on the existing hat while adding support to a new proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.639807162534435
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#4",
                    "likes": "0",
                    "time": "30/10/2020-16:13:30",
                    "content": "question… with MIP25: Flash Mint Module also not having a maximum constraint (as I understand it), if implemented couldn’t this tool almost be used against MKR Governance by being able to mint almost unlimited DAI to acquire MKR via flash loan and attack the system? I would think we definitely would want to constrain the maximum DAI minted with MIP25. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#5",
                    "likes": "0",
                    "time": "30/10/2020-16:16:12",
                    "content": "The limiting factor for Maker governance is the amount of MKR liquidity in the market, not the source loan size. Also, there is a debt ceiling limit we can artificially impose if we want. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#6",
                    "likes": "0",
                    "time": "30/10/2020-16:18:30",
                    "content": "    hexonaut:  The limiting factor for Maker governance is the amount of MKR liquidity in the market   correct…     hexonaut:  Also, there is a debt ceiling limit we can artificially impose if we want.   I would think for this exact scenario we need to ensure Maker cant be used to game Maker… In my eyes, we must have a debt ceiling on it… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#7",
                    "likes": "1",
                    "time": "30/10/2020-16:21:14",
                    "content": "To clarify, the risk from MKR being available is already present regardless of the availability of MIP25 (at any debt ceiling). Currently the amount you can flash loan yourself is higher than all MKR liquidity I believe, so adding in MIP25 won’t increase the danger for this specific type of attack. That being said, I agree with putting in a reasonable debt ceiling at least to start. Things may get weird when you can print more money than exists in all DeFi. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.305555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#8",
                    "likes": "0",
                    "time": "30/10/2020-16:23:54",
                    "content": "agreed… I get that… but MIP25 would allow for anyone to use all of the global liquidity of MKR to do a flash loan… most flash loans now have a collateral somewhere that allowed the loan to start… as I understand MIP25, it is a flash loan on acid … as the amount of DAI avail doesnt have a limit… so in theory, an attacker could use ALL MKR instead of only some. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#9",
                    "likes": "0",
                    "time": "30/10/2020-16:29:18",
                    "content": "    mrabino1:  most flash loans now have a collateral somewhere that allowed the loan to start   This is not the case. Flash loans by their nature require no collateral. In fact if you start at dydx as a flash loan provider, you don’t have to pay anything but the transaction fee. To get access to all MKR liquidity you will need to pay the fees / slippage on Uniswap and Balancer, but currently all 15k MKR on Aave is free to use. This is what B protocol did and they paid nothing.     mrabino1:  as I understand MIP25, it is a flash loan on acid   This is correct, but only in that their is no counter-party required to lend the money. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#10",
                    "likes": "0",
                    "time": "30/10/2020-16:31:34",
                    "content": "As I understand it with dydx, you still have to have some collateral to start… the more collateral the bigger the flash loan. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#11",
                    "likes": "1",
                    "time": "30/10/2020-16:31:59",
                    "content": "Nope. It’s completely free. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#12",
                    "likes": "0",
                    "time": "30/10/2020-16:39:27",
                    "content": "interesting…  but dydx is still constrained by its own max supply of DAI… no? point still being that when / if we unleash unlimited DAI to do a flash loan on the market… insane thing might happen. as a user could buy all {insert name of token} and vote / sell / whatever…  a reasonable debt ceiling should be imposed (with specific emphasis to ensure that DAI from maker is never enough to be used against MKR governance). My sense of it… at least… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#13",
                    "likes": "0",
                    "time": "30/10/2020-16:44:47",
                    "content": "Yes dydx is constrained by it’s own supply, but it’s currently enough to borrow all MKR on Aave. There is around 20M worth of ETH available and 7M DAI, and only 22M worth of MKR on Aave. For the other platforms you would have to start paying for fees anyways. You may be able to save a bit of money with MIP25 initiated with 0% fees, but it doesn’t make a large difference from the current situation is all I’m saying. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.094642857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#14",
                    "likes": "1",
                    "time": "30/10/2020-16:51:33",
                    "content": "    hexonaut:  it doesn’t make a large difference from the current situation is all I’m saying.   excellent point … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.023809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#15",
                    "likes": "7",
                    "time": "30/10/2020-18:42:53",
                    "content": "I think 72 hours is too long. If everyone recalls, on Black Thursday even a 24 hr delay was brutal when we needed to make changes to the system. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.1805555555555554
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#16",
                    "likes": "1",
                    "time": "31/10/2020-01:19:52",
                    "content": "If MKR tokens are placed on the Maker platform, will it cause less damage than AAVE? Should we compare the advantages and disadvantages of each. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#17",
                    "likes": "0",
                    "time": "04/11/2020-11:50:25",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#18",
                    "likes": "0",
                    "time": "11/11/2020-11:50:27",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2881"
}