{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rocking-the-defi-chasm-will-og-defi-applications-look-to-reinvent-themselves-in-2022/12173",
            "title": "[Rocking the DeFi Chasm] Will OG DeFi Applications Look to Reinvent Themselves in 2022? ",
            "index": 12173,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "defi",
                "op-ed"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "17",
                    "time": "13/12/2021-15:38:10",
                    "content": " The Two Tales of DeFi The second half of 2021 has brought a cooling down of the once sizzling sector know as Decentralized Finance (DeFi). The DeFi Pulse Index, which tracks tokens such as Maker, Aave, Uniswap, Compound, Yearn, and Sushi has dropped over 60%++ in the past seven months. Compared to the performance of layer 1 protocols such as Ethereum, Avalanche, Solana, and NEAR,  it is a lagging sector. While the recent sharp drops in the Crypto markets have also hurt DeFi 2.0 applications and the floor price of non-fungible tokens (NFTs), value of OG DeFi applications continue to stay depressed, although Total Value-Locked has increased over 100%++ since June 1, 2021 per DeFi Llama. This is probably affected by investors favoring NFTs (digital art), and DeFi 2.0 applications like OHM. This comparison of the price of Maker’s Governance token MKR to OHM’s Market Cap and TVL is at first sight very compelling to the human eye, but more than likely misleading:  image1830×504 24.1 KB  When we flip the script to the market cap/TVL of MakerDAO–It can be misleading and send the noobs over to OHM:  image1818×524 22.1 KB  Now, as Maker Community members we will argue to our death-beds that MKR is undervalued and trading with a Price to Earnings of less than 20 with Annual Profits currently estimated to be $130M plus. But to the DeFi 2.0 and NFT fanatics MKR facts are irrelevant, as the ponzinomics and Up-Only meme is more relevant.  Compound Liquidity Miners, Pudgy Penguins, and the Sushi Proposal To some early adapters of DeFi, Compound will forever be remembered as “the first Mohican” of Governance Token Liquidity Mining. Alex Kroger recently wrote an article about the impact that the Compound Liquidity Mining program has provided for the usage of the COMP token. He reminds us that the original intention of the COMP token liquidity mining program was “to distribute governance tokens to users who would then become active participants in protocol governance.” In the article Alex describes that: “top 100 accounts have accrued 809K COMP (roughly $271M at current prices), representing 69% of all COMP mined. Yet very few of these accounts are COMP hodlers. Only 19% have kept greater than 1% of the COMP they claimed; only 7% have kept greater than 50%. Do recipients of liquidity mining rewards retain an economic interest in Compound protocol? No.” So, what has gone wrong? What can we learn from this experience? Well, Alex references the write-up by Jacob Phillips, “Governance Mining — liquidity mining for human capital” – which leads me to the story of the Pudgy Penguins. Over the weekend of December 10th, a Community Member and Moderator of Pudgy Penguins named 0xDarth took to Twitter Spaces and announced his discontent and the unprofessional leadership of the project’s founders. The main takeaway from this drama was the lack of compensation for human capital. Apparently 0xDarth was being compensated 0.10 to 0.25 ETH for his hard work and dedication to the Pudgy Penguins community. As Jacob stated in his article: \" no one is stepping up to lead teams and contribute because the incentives are weak or nonexistent. As a result, products move slowly, teams don’t grow, and existing DAOs risk being replaced by new teams that move faster.\" Speaking of stepping-up, Frog Nation and Abracadabra community member Daniele Sesta has proposed to reinvent Sushi. An application that once held over $8B in TVL across many blockchains, has now finds itself with multiple-products that I can’t even understand what each one of them provides. Sushi also finds itself in a whirlwind of inner-obstructions that has recently led to the write-up by their former CTO called \" My Failures in Leadership at Sushi \" But with the community still in tacked, Daniele is proposing that Sushi goes back to it’s Old School ways of being a DEX: Proposed Changes to the Project:  Full focus on DEX Change of Tokenomics Change in parts of Team Deprecating Legal Entity  “we propose that Frog Nation retain and grant a lead over a new service team to extend its vision.”  Aave Community Christmas Wishes for AAVE Token Burns As DeFi Governance Tokens will more than likely continue to lag in popularity, let’s be thankful as MKR hodlers that we do have a Token Burning mechanism in place. The recent discussion by the Aave Community to incentivize utility for AAVE tokens reminds me that things could be worse. So the next time you think the Maker Community is behind the “Curve”, just remember that MakerDAO is light years ahead of the competition. Let’s keep that way.  The Next Frontier? Cross-Domain Maximal Extractable Value Ladies and Germs. Like-it-or-not, the multi-blockchain future is here. Thankfully the people who inspire us to think beyond our own intellectual boundaries are here to teach us and help us understand the next frontier. This excellent research paper by the likes of the Ethereum Foundation, Flashbots Research, Movr, and Gauntlet is this Week’s Must Read: Unity is Strength: A Formalization of Cross-Domain Maximal Extractable Value  image970×888 95.7 KB  Have a profitable and happy healthy week everybody! ",
                    "links": [
                        "https://makerburn.com/#/",
                        "https://medium.com/compound-finance/expanding-compound-governance-ce13fcd4fe36",
                        "https://mirror.xyz/0x7B542178633f16940a131F8F6d670ffdbBe6b2Ab/HoTLzeiTUBn7c-uZoVcZ6PO9AlGrVQI_4WYDSeJFTiA",
                        "https://mirror.xyz/0x6507C1693c70Ebab813BCeBD8Bcd9152Cfffa91b/WDKGKpfLy-9nX_reyecjdGDA8CRsZ9sy3jk-JjliFnc",
                        "https://twitter.com/0xDarth/status/1469705680366055437",
                        "https://forum.sushi.com/t/frog-nation-3-sushi/6494",
                        "https://forum.sushi.com/t/frog-nation-3-sushi/6494",
                        "https://governance.aave.com/t/can-we-introduce-some-incentives-utility-for-holding-aave-token/6455",
                        "https://arxiv.org/pdf/2112.01472.pdf",
                        "https://forum.makerdao.com/t/forum-at-a-glance-december-9-16-2021/12240",
                        "https://forum.makerdao.com/t/forum-at-a-glance-dec-16-2021-jan-6-2022/12507"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.470560078395899
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "8",
                    "time": "22/12/2021-15:30:15",
                    "content": " Rocking the DeFi Chasm #2  In the winter of 1981 the Talking Heads released a song titled, “Once In a Lifetime” that includes the lyrics: “Letting the days go by, let the water hold me down Letting the days go by, water flowing underground Into the blue again after the money’s gone Once in a lifetime, water flowing underground” Scottish-American songwriter David Byrne said the song was about the unconscious: \"We operate half-awake or on autopilot and end up, whatever, with a house and family and job and everything else, and we haven’t really stopped to ask ourselves, ‘How did I get here?’ \"  Complacency is an Intrinsic Flaw We can All agree that too much complacency will prevent a DAO from pushing beyond the status quo to achieve exceptional successes. The recent merger between Gnosis and xDAI showcased a strategic entry point into one of the leading sidechains on Ethereum. As we know, xDai currently hosts several unique dApps, including Perpetual Finance, SushiSwap, HoneySwap, Curve Finance, and my personal favorite, POAPs. One of the early and now former xDAI Validators was the Maker Foundation TechOps Team. Since then, the Foundation has terminated and validating on xDAI has switched hands outside of the control of the DAO. A recent Discord comment by a Community Member speaks volume and can arguably be viewed as just “letting the days go by” while others seize the day:  image1242×162 72.3 KB   There Once Was a DAI Rainbow Bridge If I recall correctly, in 2020 NEAR Protocol decided to build its own Ethereum-compatible scaling solution and a bridge intended to showcase DAI as it’s priority asset. Today that bridge is know as Aurora and it highlights many erc-20’s beyond DAI. The recent announcement by TERRA LUNA of the integration of UST into Aurora (NEAR) reminds me that opportunities are positive factors that are within the control of a Community. But perhaps the market size, revenue streams, etc., were not there. Time will tell, as UST currently rivals DAI as the largest decentralize stablecoin by market cap.  Conquering Layer 2s with M&A? I’m super excited about the Maker Wormhole and hope that it will help the DAO conquer Layer 2s. With such a large Treasury, the Community should look into the upcoming trend of consolidation via M&A. I reckon that 2022 will be the year of Layer 2s and mergers and acquisitions. Structure products like DeFi options vaults (DOVs) should start to gain traction. Many will be cross-chain, as the crypto option market is currently dominated by BTC and ETH, and Alts are non-existent (excluding Ribbon & ThetaNuts). Why not start offering Alts beyond BTC and ETH, with everything including Alts paired with DAI? If not DOVs, how about acquiring a derivatives exchange, like dYdX?  Okay, okay, I get it–its good to dream. But it’s also not good to let the opportunities, or days go by. ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Unconscious_mind",
                        "https://forum.makerdao.com/t/transparency-makerdao-validator-of-xdai-blockchain/4659/4",
                        "https://forum.makerdao.com/t/introducing-maker-wormhole/11550",
                        "https://forum.makerdao.com/t/forum-at-a-glance-dec-16-2021-jan-6-2022/12507"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.966562950937951
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "14",
                    "time": "22/12/2021-17:41:30",
                    "content": "It’s clear that the Maker governance and community should understand that the greatest threat to Dai’s fall will be Dai itself. Countless many pioneers have faded away due to being satisfied of their own “success.” The Maker protocol should continue to innovate and expand. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.796875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#4",
                    "likes": "2",
                    "time": "24/12/2021-21:32:59",
                    "content": "    Doo_StableLab:  Countless many pioneers have faded away due to being satisfied of their own “success.”   Absolutely true. If anyone wants some examples from the past, this is worth a read: https://www.goodreads.com/book/show/2854392-billion-dollar-lessons ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MightyOx",
                    "index": "#5",
                    "likes": "2",
                    "time": "28/12/2021-19:09:17",
                    "content": "“Same as it ever was, same as it ever was…” Love the reference and love the ideas even more. We can’t get too comfortable. Reminds me of this blog that talks about death by complacency and how Sequoia’s longevity as a market leader is due to staying hungry and humble. 2022 is a prime opportunity for us to focus on a similar mindset of staying competitive by adding new pairs instead of continuously offboarding assets, working with new partners to expand our ecosystem, and much more great ideas that I’m sure will come up. Happy Holidays  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.482575757575757
                }
            ]
        }
    ]
}