{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/poll-should-we-subsidize-governance-polls-executives-with-system-surplus/3693",
            "title": "Poll: Should we subsidize governance polls/executives with system surplus? ",
            "index": 3693,
            "category": [
                "Governance"
            ],
            "tags": [
                "informal-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#1",
                    "likes": "1",
                    "time": "16/08/2020-17:45:35",
                    "content": "Governance participation has been low lately and part of this has to do with high gas fees. I would like to gauge to communities interest in subsidizing governance participation (on-chain MKR votes) through the system surplus. This would involve creating a MIP I believe so before work begins on that I wanted to start a discussion with polling to see if this is something people think would promote more participation and whether its even worth it (especially with Governance Module v2 coming sometime down the pike/pipe). The details of how this would be achieved have not been fleshed out yet so this is more of a general question as opposed to the how (which can be discussed here!) Receiving input from Foundation members would be helpful to know what future gas prices might be expected to look like. I’m sure executives will always require on-chain voting though so subsidizing that would still be on the table I presume. Should we subsidize governance polls/executives with system surplus?     Yes No Abstain     0 voters     This Poll will run until 2020-08-30T04:00:00Z ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing to subsidize governance participation through the system surplus due to low participation caused by high gas fees. The author is asking for feedback on whether this proposal would promote more participation and whether it's worth it. The post also includes a poll to gauge the community's interest in the proposal. The author is also asking for input from Foundation members on future gas prices.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.6112268518518515
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "6",
                    "time": "16/08/2020-19:13:43",
                    "content": "One thing I would say is that I see SourceCred as one of the solutions to this issue. While it doesn’t directly subsidize voting, it rewards useful contribution to governance. We’re hoping to have some more news on the SourceCred front soon. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#3",
                    "likes": "0",
                    "time": "16/08/2020-20:46:37",
                    "content": "I do agree with @LongForWisdom; the SourceCred option seems extremely positive/productive, to me. I think the idea of (essentially) paying for voting absolutely enforces the idea that only the rich vote matters. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 5.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#4",
                    "likes": "0",
                    "time": "16/08/2020-21:11:19",
                    "content": "Explain? You’d be subsidizing gas fees so all voters pay no gas to vote which proportionally favours smaller voters. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#5",
                    "likes": "0",
                    "time": "16/08/2020-21:16:03",
                    "content": "I was agreeing. I was just stating my opinion on charging gas fees for voters. Subsidizing makes sense, to me, the actual method of subsidization I suppose is not something I feel as strongly about (aside from ^^as stated). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tbone",
                    "index": "#6",
                    "likes": "3",
                    "time": "16/08/2020-21:27:33",
                    "content": "I would guess there is still a strong DAO bias (aka. institutional bias) against rewarding vote participation. All the old arguments about incentives causing people to just vote for any option just to get a reward still apply. However a functioning delegation system would go a long way towards mitigating this. BUT it should be free to vote, its trivial to work out how much gas has been spent to vote and refund this amount in Dai from the System Surplus. NFT’s for participation in governance may be hip but can not be used to pay for gov transactions. Low participation in the LRC vote et.el. can probably be attributed to 200Gwei + gas prices and YAM/CRV mania. Of the roughly 200 polls over the past 12 months, how many would have had a different outcome if more voters had participated? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.820512820512819
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#7",
                    "likes": "2",
                    "time": "16/08/2020-21:41:41",
                    "content": "+1 for delegation fixing some/most of this. It seems like most of my qualms with the current system have solutions in future upgrades. I do think there is still merit in discussing executive gas subsidies though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#8",
                    "likes": "0",
                    "time": "17/08/2020-03:27:39",
                    "content": "Wow, I was just scrolling through the forums and saw that @flipflopflapdelegate made a post about this 4 days ago…     Should the Maker Community Reimburse MKR Voters for the ETH Transaction Fees Incurred when Polling and Executive voting? Governance       As one of the top 20 Active Voters in Maker Governance ( per mkrgov.science)  voting has become an unenjoyable duty. As soon as I get excited about polling about a certain MIP, Collateral, helping get an Executive Vote executed, or even using my small number of Tokens to help protect the overall protocol—I get this painful feeling in my  when I am told by MM it will cost 0.01 ETH to vote.  And YES—I know, and thank God the Maker Foundation is looking into ZK-rollups as an option for a les…     I wouldn’t have created this if I had known that but good to have official polling I guess. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.447751322751323
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#9",
                    "likes": "1",
                    "time": "17/08/2020-07:28:43",
                    "content": "I voted no:  involved community members are (potentially, if they opt-in) already compensated via sourcecred afaik, cost of voting can be reduced by tech (batch poll votes)  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#10",
                    "likes": "0",
                    "time": "17/08/2020-12:19:05",
                    "content": "Good rebuttal points. I agree that those will (and do) definitely contribute to a better voting experience. There are of course voters that wish not to participate in the forums that I think should still be incentivized to vote through executive subsidies. I am definitely looking forward to an overall reduction in voting fees/friction once Gov2 comes out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#11",
                    "likes": "1",
                    "time": "17/08/2020-16:18:50",
                    "content": "So yes there’s vote delegation. But, gasless governance polls is another option that might increase participation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#12",
                    "likes": "0",
                    "time": "30/08/2020-21:19:45",
                    "content": "Hey guys, Just ending this poll as it has expired. Looks like the majority of participants would be in favour of subsidizing votes through the system surplus. Definitely some food for thought in case we want to go in that direction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rileyjt",
                    "index": "#13",
                    "likes": "1",
                    "time": "30/08/2020-22:54:55",
                    "content": "You would need some kind of non-trivial minimum vote amount or the mechanism would become an attack vector. Should be able to find a decent balance though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.111111111111112
                }
            ]
        }
    ]
}