{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/core-unit-mandate-overlap/7210",
            "title": "Core Unit Mandate Overlap ",
            "index": 7210,
            "category": [
                "Core Units"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#1",
                    "likes": "12",
                    "time": "26/03/2021-09:33:49",
                    "content": "In the transition from Foundation to Community there is apparently some overlap in the mandate between the proposed Core Units. The reason why it is necessary to bring this to light is the nature of online communication which in many cases makes it problematic to discuss certain topics and to make changes once the mandate has been ratified. Please think about the difficulty of online consensus forming on the following topics: Core Unit Mandate - difficult Core Unit Compensation - hard Core Unit MKR incentives - outright problematic Core Unit forced restructuring - not tried yet but probably harrowing This difficulty getting to consensus is precisely why it is so important to tune mandates to avoid the worst overlaps. Some overlap might be just fine, others are better avoided. Below is a chart of mandate overlap between the proposed Core Units of Content Production, Strategic Marcomms, Growth Core and Governance Communication. GOV001 and Shop have been left out on purpose.  Mandate overlap960×540 75.8 KB  The following potential overlaps are identified: (1) DAI evangelizing (2) Core Unit involvement in (1) (3) Social media channels (4) Official communication Again - some overlap might be just fine, but if the mandates are not adjusted the Maker Community is in some cases paying tripple or more with no apparent coordination and limited specialization between Core Units. With regards to the forming of the Core Units - stepping over from the Foundation to the Community doing more or less exactly what you have been doing since 2018 sounds like the path of least resistance, but there are differences between the two.  Foundation Community745×305 34.3 KB  The largest difference between the Foundation and the Community is the huge increase in transparency. There is more as well but that will have to wait. Let me stress that this is in no way criticism towards the proposed facilitators of the Core Units involved, what we are seeing is the result of going from an opaque organization to a transparent one - that is all. That being said, it is possibly beneficial if the facilitators of the proposed Core Units are able to sit down, maybe with the assistance of GOV, and maybe to some degree reduce mandate overlap. Feedback appreciated and please do not hesitate to point out my errors. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-strategic-marcomms-core-unit/7189",
                        "https://forum.makerdao.com/t/mip39c2-sp4-growth-core-unit-gro-001/6715",
                        "https://forum.makerdao.com/t/mip39c2-sp8-governance-communications-core-unit-com-001/7009",
                        "https://forum.makerdao.com/t/planet-x-delegate-platform/9422",
                        "https://forum.makerdao.com/t/reporting-and-transparency/7233",
                        "https://forum.makerdao.com/t/governance-at-a-glance-march-26-april-1-2021-now-forum-at-a-glance/7276",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-march-28th-2021/7280",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-135-thursday-april-1-17-00-utc/7206/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.397065897065897
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "6",
                    "time": "26/03/2021-16:11:02",
                    "content": "I think a lot of the “overlap” is a visualization of how these Core Units are related and work together. In practice nobody will end up doing the same work twice unless there is some lack of communication. Communications are multi-faceted, and different teams will be focused on different aspects. It is a coordinated effort to execute on all of these important goals and I think the way these have all been pitched make them sound complementary to eachother. I think it’s sensible to expect that these mandates will evolve to better operate with one another as they get kicked off and learn to work together in this new model. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.897727272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "10",
                    "time": "26/03/2021-16:12:33",
                    "content": "If we formalize one step above, those core units are about how to grow the business. There is a part about housekeeping (like MakerDAO on twitter currently), but this isn’t something important. It’s just working. We can probably outsource it for a low cost anyway. Or not doing it at all. Most of the communication/marketing expenses from startups is wasted because it’s not focussed. You add one person to handle Facebook, you get some likes and nothing really change. Then you create a blog to generate some SEO but no one follows the analytics and no one think about adding a call to action anyway. You end up with an army that do stuff that doesn’t bring value to the business. Things are either Core Competencies of MakerDAO or they are not. In a Core Competency, you want to be the best, for the rest, well you don’t care. We might want to delegate all those tasks to a dedicated Core Unit (some might call it Operation Support  ). How do those core units move the needle for MakerDAO business-wise? And what did they achieve already (as a foundation employee or by themselves)? Why is @NikKunkel handling Clubhouse sessions and going to Bankless? Why are my tweets on Tally newsletter? Why is @Primoz writing for Spencer Noon (okay no longer)? I want to see something. ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Core_competency"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "5",
                    "time": "26/03/2021-16:53:14",
                    "content": "    Planet_X:  The following potential overlaps are identified: (1) DAI evangelizing (2) Core Unit involvement in (1) (3) Social media channels (4) Official communication   I think it’s important to distinguish tasks and focuses that benefit from overlap and those that don’t.  Multiple units trying to handle official communications seems like a recipe for confusion. Multiple units evangelizing DAI seems like an unequivocal win.  I’m also not sure overlap even in areas like official communications is necessarily bad idea on balance. It’s important to consider that the DAO has no contracts with any of these individuals or Core Units. There is no legal obligation for Core Units to continue operations. In this light, I don’t hate the idea of overlap. Part of the Core Unit Framework covers selecting interim facilitators to handle responsibilities if we have this issue. However, we do need people available who can take that role and feel reasonably comfortable that they can keep things ticking. Overlap helps with this as it builds facilitator and contributor competency in multiple domains. In GovAlpha’s case I’ve attempted to cover this redundancy within the Core Unit (aiming for multiple facilitators.) However, this seems to be the exception rather than the rule thus far. Some level of overlap is perhaps a valid way of mitigating this scenario. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.087719298245615
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#5",
                    "likes": "9",
                    "time": "26/03/2021-22:20:05",
                    "content": "I want to push back on some of the labeling. At least in regards to the growth CU, I think there’s some misunderstanding. The BD team today, and the proposed core unit, seek to do one thing: Expand the distribution channels of MakerDAO. Distribution channels have nothing to do with social media, it’s a way of describing how Dai reaches the end user, and can more specifically be described as “third party integrations.” In order to achieve these integrations, the team has to evangelize and educate the potential integrators and sketch out the terms of a mutually beneficial deal. This is very different than what content/marcomms would do as it’s targeted to a specific company or individual with the explicit goal of distributing Dai or Vaults through an integration with their platform. Content and marcomms seek to educate the end user, BD (growth) seeks to structure deals that increase the number of integrations of Dai and Vaults. The overlap between the teams is in (a) creating joint initiatives so that the content created by marcomms/content teams matches the desired integrations of the BD (growth) team, and (b) supporting integrations with follow-up marketing to the Maker community. I should also add that there’s a technical component of what the BD (growth) team does, in that the integrators generally require hands-on assistance. We have traditionally leaned on the integrations team for this task. Now there’s also overlap between BD and Integrations, but again they have very different mandates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.190476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "7",
                    "time": "27/03/2021-15:45:56",
                    "content": "    SebVentures:  Why is @NikKunkel handling Clubhouse sessions and going to Bankless? Why are my tweets on Tally newsletter? Why is @Primoz writing for Spencer Noon (okay no longer)?   I brought up the idea of creating a MakerDAO/DAI “Club” on Clubhouse—even offered some invitations to some community members, since you need an “invitation” to access CH—but got no traction. Maybe we are a shy group. Not sure. @Planet_X this is nice work and fair points—thanks again for your focus and dedication to the community. Like I think many community members don’t know what accomplishments have been made by Foundation employees, or community freelancers. So, when you see a Core Unit ask for a budget—Community members reactions will be like, “what have you done for me lately?”   and the truth is — most community members don’t know, because it’s A. Hard to keep up B. Some foundation teams were restricted C. We only focus on numbers have to go up Another thing that I noticed is that we get a lot of Talented people that stop by and become apart of the movement for a couple of months. They make a proposal/idea in this forum—gets no traction—and then they disappear and join another community. And some of these folks have talent. But have been turned off by just how hard it is to get “an idea” to actually be put in motion. Anyhow—a lot good talented people here/ I just hope we don’t push them away. We have already push many away… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.177083333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#7",
                    "likes": "4",
                    "time": "27/03/2021-16:10:25",
                    "content": "    flipflopflapdelegate:  Maybe we are a shy group.   I think that is part of being an early adopter of tech, being a little out side the box thinker and kind of reserved. I do think that talented people are going to leave when they see that the barriers to getting an idea implemented are very high. Having said that, it does take a lot of coordination and labor to be able to get things done like PSM, RWA, TLM, and so on. I personally have been trying to get my coworkers to get on the DeFi/MakerDAO bandwagon, but most people have no background in finance. It is a steep learning curve for most people to learn TradFi let alone DeFi. Some people have told me that they thought they needed to be in New York to buy a stock. So it is an even bigger hurdle to get them to contribute to the governance of a DAO. Educating/evangelizing is crucial at this stage to get people to wake up to what is happening every day in DeFi. Maybe it should be presupposed that all Core Units are trying to educate a particular audience. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.972689393939393
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#8",
                    "likes": "4",
                    "time": "27/03/2021-17:46:37",
                    "content": "Hey @Planet_X , Thank you for your posts. What you mentioned is something I have been thinking about lately:  coordination and execution will be a massive challenge between core units. I don’t believe overlapping is a bad thing. Actually, I would like to see other “growth (or any other of the proposed ones) core units” proposing different strategies. I think that’s the advantage of a DAO over other types of organizations… Although, It is essential to coordinate and pursue the same goal,  not just between the mentioned core units, but with everyone. Taking the GRO CU as an example, with our partners from all around the world, we generate a market for Dai, developing channels to cover different use cases and allow the partner’s users to (1) borrow (and generate) Dai with their assets, (2) buy and sell Dai, and (3) perform a useful activity with Dai. Yes, there’s an overlap with other core units’ mandate, and that’s because the core units that have to interact with the outside have to evangelize, educate and drive adoption. The difference (at least from the GRO CU perspective) is the actors we reach and the strategy we follow to achieve our mandate. The difference is we look for our partners’ success through the Maker protocol. We are proposing the GRO cu because we think the protocol needs it. In the beginning, as we stated in our proposal, we will be focused on developing B2B relationships around the offer and demand of Dai. Usually, when we communicate those integrations, we use our partners’ brand, working with their marketing and comms team. That’s because we want Dai inside everything! -even the marketing team of our partners-. With that as input, the Marcomms team has created a story about Dai and positioned a brand. As a core unit, we want to listen to you, if the community and governance decide that pump Maker is the best thing to do (we all want to pump it, but is that the right path? Isn’t putting Dai everywhere, the long term plan to increase the value of the protocol?), we will start talking with our partners to create alphas, farming, liquidity mining opportunities, trading contest, and all that sort of things we love. To be honest, this continuous conversation with the community is what excites us the most at the GRO cu  And that’s why coordination and communication with everyone are so necessary. We shouldn’t decide by ourselves to pump MKR. We should take that decision together and synch with everyone with this objective in mind.     SebVentures:  How do those core units move the needle for MakerDAO business-wise? And what did they achieve already (as a foundation employee or by themselves)?   Ufff, Seb, as individuals, you can google the name of any of the GRO cu members, and you’ll find an endless list of podcasts, interviews, videos, presentations, etc., in different languages to different audiences (not just crypto). But what we are proud of the most is when we see Dai in the right place (our names are not there, but each one in the team knows what it took to have Dai there). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4490207373271895
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#9",
                    "likes": "0",
                    "time": "27/03/2021-20:16:28",
                    "content": "    Nadia:  Ufff, Seb, as individuals, you can google the name of any of the GRO cu members, and you’ll find an endless list of podcasts, interviews, videos, presentations, etc., in different languages to different audiences (not just crypto).   Could you please simplify our life and share them directly here (in the forum? another post is fine). I mean, I spend quite a bit of time reading stuff around here and the chat, and I haven’t seen many of these:     Nadia:  podcasts, interviews, videos, presentations, etc.,   Perhaps I missed them. Thanks. Similarly,     Nadia:  But what we are proud of the most is when we see Dai in the right place   What are these places?     Nadia:  but each one in the team knows what it took to have Dai there   yes but I honestly do not. EDIT: re-reading my post, I see it might be read as a bit harsh. It is not. I just want to appreciate more what you do. As a (small, but still…) MKR holder who will have to vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6609002976190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#10",
                    "likes": "5",
                    "time": "27/03/2021-20:38:38",
                    "content": "Lenka might be able to help source the full catalogue as she has managed these appearances, but here are some: https://www.youtube.com/results?search_query=gregory+di+prisco+maker https://www.youtube.com/results?search_query=nadia+alvarez+maker https://www.youtube.com/results?search_query=gustav+arentoft+maker https://www.youtube.com/results?search_query=남두완+메이커 https://www.youtube.com/results?search_query=mariano+di+pietrantonio+maker https://www.youtube.com/results?search_query=jennifer+senhaji+makerdao ",
                    "links": [
                        "https://www.youtube.com/results?search_query=nadia+alvarez+maker",
                        "https://www.youtube.com/results?search_query=gustav+arentoft+maker",
                        "https://www.youtube.com/results?search_query=%EB%82%A8%EB%91%90%EC%99%84+%EB%A9%94%EC%9D%B4%EC%BB%A4",
                        "https://www.youtube.com/results?search_query=mariano+di+pietrantonio+maker",
                        "https://www.youtube.com/results?search_query=jennifer+senhaji+makerdao"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#11",
                    "likes": "2",
                    "time": "27/03/2021-20:45:57",
                    "content": "    g_dip:  but here are some:   thanks this helps a lot! I was aware of some video of Greg di Prisco and I think he’s very good indeed. I didn’t know the others. Edit: i feel dumb, I just realised that @g_dip = Greg di Prisco! LOL! I never realised this earlier because you are “greg.diprisco” in the chat. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.617708333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#12",
                    "likes": "1",
                    "time": "27/03/2021-20:47:57",
                    "content": "heh he is me  … thanks for the compliment I think you’ll find that everyone on the team is an excellent presenter and representative for what we’re building. It was one of the core requirements I had for hiring them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#13",
                    "likes": "2",
                    "time": "27/03/2021-20:54:09",
                    "content": "Ok you inspired me to use an actual picture of myself ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#14",
                    "likes": "2",
                    "time": "30/03/2021-21:50:45",
                    "content": "Thanks for bringing this up @Planet_X. There has been some conversation about this between the proposed Core Units but not all of the wrinkles have been fully ironed out yet. The lines between GovComms, Growth, and Content Production are relatively clear to me. Content has been discussing how to avoid overlap with GovComms during their weekly calls and the topic of supporting Growth with content came up during our Core Unit Pod Session, which we’re happy to do. @JerryAG plans to continue being involved in GovComms to help with Maker Relay, GovComms is proposing to own the moderation of MakerDAO’s subreddit, and the communication is there for us to collaborate or hand things off as necessary. I’ve briefly spoken with MarComms and there is some overlap there with regard to the proposed ownership of our social channels and web properties. The conversation about how those should be managed is ongoing but I believe the event management, PR, and localization aspects of that proposal are free from overlap. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.324074074074074
                }
            ]
        }
    ]
}