{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/has-there-been-a-shift-in-regulatory-risk-informal-poll/18035",
            "title": "Has there been a shift in regulatory risk? [Informal Poll] ",
            "index": 18035,
            "category": [
                "Governance"
            ],
            "tags": [
                "informal-poll",
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "2",
                    "time": "21/09/2022-22:33:22",
                    "content": "Regardless of the eventual form the EndGame takes, among the initial EndGame MIP Set, MIP84 is probably the most disruptive to the status quo:  Surplus buffer above 20M DAI transferred to POVE Hence, no MKR burn for the foreseeable future POVE uses these funds to buy Lido Staked ETH Lido Staked ETH is purchased with 1.8x leverage Liquidation of the leveraged position is conceivable  Even though this would be a massive change to the DAO’s financial management, this is still considered Pigeon Stance, where there is no limit to RWA exposure and Dai remains pegged 1:1 with USD. Doesn’t this have the feel of a hail mary, a last-ditch effort with little chance of success? That is, we plan to take on more RWA risk, but the buffer for absorbing losses is much higher variance. If I understand correctly, one of the underlying assumptions to justify MIP84 is regulatory risk:    MIP84: Activate Protocol-Owned Vault Emulation   we do not have the ability to be comply with financial regulation in the same way centralized stablecoins can, and the Endgame Plan consciously chooses to optimize for resilience against authoritarian attack rather than financial risk.   That is, we need to start preparing for Eagle/Phoenix Stance now, while we still can. But do we really? Now that some time has elapsed since the OFAC Tornado Cash sanctions and people have had time to digest what happened and calm down (see Jake Chervinsky, Katie Haun, and Michael Mosier), I would like to reexamine whether regulatory risk for Maker has actually changed. I tried to analyze this question. In summary, I’m not sure whether I fully understand others’ concerns. DAI does not have an on-chain DenyList (a.k.a. blacklist) and such is likely to be demanded by regulators?  In contrast to Tornado Cash, vanilla DAI transfers are public. Although USDC and Tether have on-chain DenyLists, DAI could be regulated with an off-chain DenyList at the edges where there are fiat off-ramps.  Whether the DenyList is on-chain or off-chain, why does it matter? It is already possible to transfer value on Ethereum via a token that is not encumbered by an on-chain DenyList, that is, using ETH. So DAI doesn’t seem very novel in this regard.    Did OFAC’s Tornado Cash sanctions change the regulatory environment for Maker?  Yes No Abstain     0 voters     If you vote Yes please explain your reasoning below in a reply. As this is an informal poll, the results will prompt no particular action. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip84-activate-protocol-owned-vault-emulation/17713#mip84c9-protocol-surplus-and-the-emulated-surplus-buffer-upper-limit-16",
                        "https://forum.makerdao.com/t/mip84-activate-protocol-owned-vault-emulation/17713#mip84c7-daily-collateral-purchase-rate-14",
                        "https://forum.makerdao.com/t/mip84-activate-protocol-owned-vault-emulation/17713#mip84c5-the-collateralization-ratio-of-the-protocol-owned-vault-emulation-12",
                        "https://forum.makerdao.com/t/mip84-activate-protocol-owned-vault-emulation/17713/12",
                        "https://forum.makerdao.com/t/mip84-activate-protocol-owned-vault-emulation/17713/12",
                        "https://forum.makerdao.com/t/just-in-tornado-cash-sanctions-faqs-u-s-department-of-treasury-sept-13-2022/17879",
                        "https://shows.banklesshq.com/p/the-death-of-crypto-privacy-with#details",
                        "https://mirror.xyz/haunventures.eth/E-iD-jqgD-WmqrZOjCnGjv6U-R_N5tUk8xPzxUHhQGc",
                        "https://zeroknowledge.fm/245-2/",
                        "https://forum.makerdao.com/t/mip84-activate-protocol-owned-vault-emulation/17713/19",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/18",
                        "https://forum.makerdao.com/t/mip85-ldo-to-mkr-otc-swap/17714/37"
                    ],
                    "GPT-summary": "The post discusses the potential regulatory risks associated with MIP84, which proposes a shift in the MakerDAO's financial management. The author questions whether the assumptions underlying the proposal are still valid and asks whether regulatory risks for Maker have actually changed. The post includes an informal poll asking whether OFAC's Tornado Cash sanctions have changed the regulatory environment for Maker. The post also explains the proposal and invites feedback and constructive criticism.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.3702876984126995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "21/09/2022-22:42:22",
                    "content": "    psychonaut:  I tried to analyze this question. In summary, I’m not sure whether I fully understand others’ concerns. DAI doesn’t have an on-chain DenyList (a.k.a. blacklist) and such is likely to be demanded by regulators?   Even if you want to place it, the DAI that we have today is not technically possible, DAI should be bifurcated to achieve that and if it is achieved and carried out, what value would DAI have? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "0",
                    "time": "21/09/2022-22:47:00",
                    "content": "    Saludiego_201:  DAI should be bifurcated to achieve that   Yes, it would require a new DAI deployment and migration. But is anybody asking us to do that? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "0",
                    "time": "21/09/2022-22:51:49",
                    "content": "The scenario that you suggest give me to understand that we could receive pressure from the U.S. government (I personally do not see it as possible, although not impossible). I would prefer to be cautious, but not careless. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.729166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#5",
                    "likes": "9",
                    "time": "21/09/2022-22:57:42",
                    "content": "Abstained out of neutrality, but feel a duty to note that regardless of how you answer this question, it is a fact that people here are feeling the crunch of increased regulatory pressure. I’ll let developers speak for themselves, but personally this action by the US government gives me much more anxiety about my safety working for the protocol, and I have been asked to take measures for several members of this community to make them feel safer. Would love to hear some more direct responses to this poll, just wanted to put in a voice for the palpable emotional shift that occurred in the community after these public actions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.85
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#6",
                    "likes": "4",
                    "time": "22/09/2022-08:03:20",
                    "content": "The Tornado Cash sanctions don’t change the regulatory risk for Maker - it is just a symptom of how the game has already changed. It is the Terra collapse, the Celsius collapse, and other catastrophic failures that have significantly changed the regulatory risk for all crypto. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#7",
                    "likes": "3",
                    "time": "22/09/2022-15:47:24",
                    "content": "    prose11:  people here are feeling the crunch of increased regulatory pressure […snip…] I have been asked to take measures for several members of this community to make them feel safer.       rune:  other catastrophic failures that have significantly changed the regulatory risk   What I’m hearing is that many of us are feeling a drop in self-esteem as the blockchain space receives increased regulatory scrutiny. Some blockchain projects act unethically or are outright frauds; they are getting flushed out. But are we in this category? I would like to remind you that Maker is more transparent than most TradFi banks/financial institutions. Moreover, the project has been incredibly profitable for two years and will likely return to massive profitability within 3-6 months. We have a lot to be proud of. It is not the moment to prepare to scuttle under furniture like a cockroach. No, we should be making decisions from a sound state of mind: courage, confidence, clarity, creativity, and calm. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.729166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#8",
                    "likes": "3",
                    "time": "22/09/2022-17:43:52",
                    "content": "It would be great if regulators and politicians took the time to really understand and deeply involve themselves in the nuances that exist in crypto rather than just react to headlines, and when it comes to crypto, there are a few good ones that do act that way. But unfortunately in aggregate that is not how the world works. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#9",
                    "likes": "1",
                    "time": "22/09/2022-21:08:51",
                    "content": "Sad to read this P, and wanted to respond. Voted abstain precisely because of what you wrote here. And I won’t miss the opportunity to beat a dead horse and point out that the way Endgame is being rammed through this community is more a direct regulatory risk than any external actions. If we can demonstrate that the governance and decision making of MakerDAO is “TRULY” decentralized, we have a lot of wiggle room to navigate and stay the course. I’m afraid pretty much everything about the Endgame MIP set – and the way it is being covertly implemented over the past several months consuming DAO resources and competing with mandates that HAVE been approved by MKR votes – is a nuclear bomb for this project and unleashes untenable regulatory risk for everyone associated. As I mentioned in the chat on the G&R call discussion re: this post, the BRAND NEW regulatory risk of the token issuance and tokenomics proposed are especially glaring. The fact that there is no provision for a regulatory and legal risk review of any aspects of this radical plan is truly unserious. ~ Kianga ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.084415584415584
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#10",
                    "likes": "4",
                    "time": "22/09/2022-23:12:05",
                    "content": "    ACREinvest:  As I mentioned in the chat on the G&R call discussion re: this post, the BRAND NEW regulatory risk of the token issuance and tokenomics proposed are especially glaring. The fact that there is no provision for a regulatory and legal risk review of any aspects of this radical plan is truly unserious. ~ Kianga   And scene:   twitter.com    Miller @millercwl  🚨 The CFTC has filed a complaint against a DAO for violating the Commodity Exchange Act 🚨  \"Defendant Ooki DAO... is an unincorporated association comprised of holders of Ooki Tokens... who have voted those tokens to govern... the Ooki Protocol.\"   cftc.gov/PressRoom/Pres…   10:17 PM - 22 Sep 2022           63                25            ",
                    "links": [
                        "https://twitter.com/millercwl/status/1573073944277843968?s=20&t=_dpxJZaAjK_ipgxmsi1IJQ",
                        "https://twitter.com/millercwl/status/1573073944277843968?s=20&t=_dpxJZaAjK_ipgxmsi1IJQ",
                        "https://www.cftc.gov/PressRoom/PressReleases/8590-22",
                        "https://twitter.com/millercwl/status/1573073944277843968?s=20&t=_dpxJZaAjK_ipgxmsi1IJQ"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.045454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#11",
                    "likes": "1",
                    "time": "23/09/2022-00:17:04",
                    "content": "I just saw this. They basically said the DAO was an unincorporated association and therefore the individuals are responsible. This space is moving fast. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#12",
                    "likes": "1",
                    "time": "23/09/2022-01:08:41",
                    "content": "Of course, but until they said it and confirmed how their jurisdiction specifically applies to our space - which is easy to anticipate really - there’s plausible deniability of knowing what is required/expected when dealing other than in spot buy/sells of (virtual) commodities. Now anyone can go right ahead and say their wrong - have fun with that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.933779761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#13",
                    "likes": "0",
                    "time": "23/09/2022-01:24:39",
                    "content": "It sounds like only two individuals were sanctioned. Any idea how many people were involved in the DAO? Surely more than two? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xbocaJ",
                    "index": "#14",
                    "likes": "1",
                    "time": "23/09/2022-07:31:17",
                    "content": "    psychonaut:  It sounds like only two individuals were sanctioned. Any idea how many people were involved in the DAO? Surely more than two?   There are two legal actions at issue. The Order is a consent order under the jurisdiction of the CFTC, agreed to by the bZx LLC and two individuals. The complaint is a civil action under the jurisdiction of the district court targeting the DAO. It defines the bZx DAO as “an unincorporated association comprised of holders of Ooki Tokens (or of BZRX Tokens, when the Ooki DAO was doing business as the bZx DAO) who have voted those tokens to govern (e.g., to modify, operate, market, and take other actions with respect to) the Ooki Protocol (formerly named the bZx Protocol) during the DAO Relevant Period.” I’ll also flag this post I made a while ago again: The Real Legal Risks - #17 by 0xbocaJ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#15",
                    "likes": "0",
                    "time": "22/12/2022-07:31:55",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}