{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/hate-to-rain-on-the-parade-but-we-should-acknowledge-that-the-current-system-surplus-is-largely-a-mirage/4661",
            "title": "Hate to rain on the parade, but we should acknowledge that the current system surplus is largely a mirage ",
            "index": 4661,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#1",
                    "likes": "0",
                    "time": "08/10/2020-20:41:44",
                    "content": "Its great to see FLAP auctions about to start again and MKR burn be reinitiated.  There are also lots of important activities that we may want to fund with the growing system surplus. There is one problem though:  the largest source of the stability fees come from stablecoin vaults like USDC.  Right now, even though they add a lot of DAI to the system surplus, there is no assurance that any profit will be realized from them, and if they were liquidated today most of these vaults would require minting new MKR to pay them off. The problem is that unless the Dai price goes below the minimum LR for USDC CDPs, most people will abandon them once they fall below the minimum LR.  Even if we enabled liquidations on them, as long as the Dai price is > than the vault LR at time of liquidation, the auction will result in a loss, and new MKR will need to be minted to cover the deficit. As long as the system surplus is used for burning MKR, the net impact should be neutral, but we shouldn’t kid ourselves that we have a huge surplus of fees that we can spend on other activities without the need to mint new MKR.   I generally support minting new MKR to pay for critical activities, but we shouldn’t pretend that spending the surplus today is a true surplus that can be spent without a risk of MKR inflation.  If we can fix the peg through RWA, we will be in better shape- but for now we are mostly treading water with regard to system profit. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.126542207792207
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "4",
                    "time": "08/10/2020-21:29:30",
                    "content": "Hey @latetot not sure if you attended the Gov & Risk call today – this was discuss by the Community – good stuff – you should check it out when you get a minute or two https://www.youtube.com/watch?v=M-oHe86l1f0&feature=youtu.be&t=3424 Also, Primoz made a post on the Surplus Buffer – somewhere–can’t find it right now… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.226190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/01/2021-03:29:33",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}