{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/quality-of-maker-s-risk-management/19269",
            "title": "Quality of Maker\\xe2\\x80\\x99s Risk Management ",
            "index": 19269,
            "category": [
                "Governance"
            ],
            "tags": [
                "rwa",
                "endgame",
                "framework"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#1",
                    "likes": "1",
                    "time": "28/12/2022-16:25:43",
                    "content": "The Gemini/GUSD will provide folks a real time view on how Maker manages risk on its balance sheet … Given Rune’s supermajority control of active MKR votes, he is the person most responsible for the quality and success/failure of Maker’s risk management.  That is the nature of centralization ",
                    "links": [
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/137"
                    ],
                    "GPT-summary": "The post discusses the quality of Maker's risk management and how it is managed by Rune, who has a supermajority control of active MKR votes. The author explains how the Gemini/GUSD will provide real-time information on Maker's risk management. The post also offers constructive criticism on the centralization of control in Maker's risk management.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#2",
                    "likes": "4",
                    "time": "28/12/2022-20:56:24",
                    "content": "    Eumenes:  Given Rune’s supermajority control of active MKR votes, he is the person most responsible for the quality and success/failure of Maker’s risk management.   Isn’t this the equivalent of blaming the part of the population that did vote (in a democracy) instead of the apathetic voters? As much as we enjoy the pitchforking and pointing fingers, I am yet to see any Maker contributor bring forward a robust open framework that we can use.  Did anyone say Framework? During the last several months, we have seen a strong focus on deal-making and deal-criticizing in the RWA arms.  Someone on the deal-criticizing side could have a hidden agenda to prioritize their own deals, which is why Governance (this is especially true for the non-experts like me) has a hard time separating the drama from the facts. I’ve mentioned the need for a RWA Framework over a year and a half ago, and in spite of Maker having spent a lot (millions?) on several experts with very prestigious backgrounds, I don’t feel we have advanced a lot. Maybe Luca’s LOVE came close? PS: I’m not even close to being an expert on RWA, and I do not intend to become one; hence my passiveness and “please, someone, come up with a framework” instead of doing it myself.  Did anyone say Endgame? But wait, there’s more! Some good news: Endgame is aiming to work on frameworks through scopes. We’ll start facilitating this framework (and others) to ensure that the risk is assessed and managed openly. You (and anyone willing to participate) will be invited to join and contribute. Hopefully, the expertise of all the RWA experts we have around will bring Maker’s game to the next level. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.885416666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#3",
                    "likes": "2",
                    "time": "28/12/2022-22:52:36",
                    "content": "    juan:  Isn’t this the equivalent of blaming the part of the population that did vote (in a democracy) instead of the apathetic voters?   The key difference is that MakerDAO is a plutocracy, not a democracy. Incentives to vote scale quadratically with the amount of MKR someone holds(big holders both have more impact on MKR price and are more impacted by MKR price). If a system structurally favors certain people, then those people do bear more responsibility. As for a RWA framework: target 70% of RWAs into short term US treasuries, with the remaining 30% in stablecoins. That would give us quite a bit of revenue in a very safe, easy to understand way. Minimal room for hidden agendas. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.26547619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#4",
                    "likes": "2",
                    "time": "29/12/2022-01:09:26",
                    "content": "    CodeKnight:  The key difference is that MakerDAO is a plutocracy, not a democracy.   Yes. Hence the “equivalent” part. I don’t want us to confound the “silent majority” (or voter apathy) with the plutocracy’s advantages or disadvantages. There are several whales (and big shrimps) that would benefit from voting (because plutocracy). But we don’t see that happening (for various reasons). Your framework seems as reasonable as the next to the untrained eye. But I’m looking forward to hearing you, @Eumenes, and the other experts discuss this topic. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.053571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#5",
                    "likes": "2",
                    "time": "29/12/2022-03:23:11",
                    "content": "If voter incentives scale quadratically with voting weight(as I argued earlier), a whale with 1/5th the voting power has 1/25th the voting incentives. That is a very large gap to cross. At best, smaller whales are in a prisoners dilemma where it is only in their best interest to vote if other whales coordinate votes with them. Also, voting whales are making themselves easier targets for lawsuits. So they need to be pretty confident they can achieve something before they vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.451785714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#6",
                    "likes": "5",
                    "time": "29/12/2022-12:54:52",
                    "content": "    CodeKnight:  So they need to be pretty confident they can achieve something before they vote.   I think we’re agreeing. My points:  A plutocracy is not a democracy (for better and worse) voter apathy is real (in both situations) going after the people actually voting, delegating, or caring, doesn’t seem to solve the apathy (if anything, the opposite: if Rune stopped delegating, voting, or showing up, who’s the next whale? Should we say that they have a supermajority and blame them because of the “nature of centralization”?) After spending millions we still don’t have a solid framework for implementing RWA we should definitely work towards fixing these problems (ideally bringing forward proposals instead of finger-pointing)  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.886363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#7",
                    "likes": "0",
                    "time": "17/01/2023-17:11:04",
                    "content": "    juan:  During the last several months, we have seen a strong focus on deal-making and deal-criticizing in the RWA arms.    Shamelessly plugging the MIP13c3 application we have put forward. We’re especially curious to see which kind of collateral applicants can support. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                }
            ]
        }
    ]
}