{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/content-production-quarterly-update-aug-oct-2021/11618",
            "title": "Content Production Quarterly Update: Aug - Oct 2021 ",
            "index": 11618,
            "category": [
                "Core Units"
            ],
            "tags": [
                "update",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#1",
                    "likes": "4",
                    "time": "12/11/2021-23:11:29",
                    "content": "Greetings from the Content Production Core Unit! In addition to our usual update (10/29 - 11/11), we’re also providing details on what we’ve been up to this quarter and what we’re looking forward to in Q1 2023.  Administrative Updates  Attended ETHPortland and NFT.NYC    twitter.com    MakerMegaphone @MakerMegaphone    Big thanks to @themyntlab for hosting ART 3.0 @ NFT NYC!  So cool to see team members from @MakerDAO, @StableNode, @creaticles, @UpshotHQ, and @Chromia under the same roof. 🥰 https://t.co/PkCA9GJT7i   3:55 PM - 4 Nov 2021           24                5            ETHPortland and NFT.NYC turned out to be a nice reintroduction to crypto conferences: we got to reconnect with the crypto community, meet most of each other for the first time in real life, and meet members of GovComms and Growth as well. We saw a lot of interest in MakerDAO’s operations and DAOops in general and enthusiasm toward the developments in Real-World Finance and the reduction of Dai’s reliance on USDC and the team had good discussions about our direction and upcoming opportunities.   Obtained business insurance   Obtained legal counsel   We’ve started working with an attorney to help us understand what regulations we may or may not need to worry about with regard to content production. Unfortunately, it took longer than anticipated to get onboarded due to a mix-up with our payment processor but we got things ironed out and had our first meeting this past week. It sounds like the regulations we need to worry about shouldn’t have much of an impact on our existing efforts but we will be asking him to review some of our work on the Community Portal and Explainer Videos to ensure there aren’t any red flags prior to publication.  Content Production Bi-Weekly Update 10/29 - 11/11 Video  Published  [Maker Relay] Monthly Governance Review: October [Maker Relay] The State of Dai (10/26 - 11/1) & (11/2 - 11/8) Post-production, posted Forum at a Glance. Organized [AMA] Risk Management with MakerDAO’s Risk Core Unit | AMA Ep. 11, hosted by @Prose11.    Writing Want to read Maker Relay and Dai on Different Networks in your email? Sign up on Substack: https://makerdaoupdates.substack.com/.   Forum  Maker Relay Ep 69 and Ep 70 in collaboration with GovComms. Multi-chain DAI-lights - Nov 4 and Nov 11  Monthly Governance Review: October in collaboration with GovComms.    Substack  Maker Relay Ep 69 and Ep 70  The State of Dai Ep 11 and Ep 12     Audio  Created 11 intro songs for various video/audio productions (including future projects) Created 5 background songs to give our educational content a more professional tone. Started working with ElPro on podcast idea “Meet the Makers”  Other  Started discussions on organizing content collection and a side event at ETHDenver. Distributed a commemorative NFT for Rocket.chat - please DM us if you haven’t received one yet! Released and updated the Dai-Curious Dashboard, which details a wide range of high-level MakerDAO financials.   Looking Ahead In the coming weeks, we’ll be:  Posting a promo video for Maker Wormhole. Hosting an AMA on Maker Wormhole featuring Sam and Kris from Protocol Engineering. Hosting a meeting with multiple Core Unit contributors/facilitators to discuss plans for ETH Denver. Building a Keeper to better understand and document the process from an inexperienced users perspective.   Quarterly Update  Community Portal Community Portal v2.0 will be ready for launch following a review by our attorney. We’ve rebuilt the existing Portal with a new CMS that’s more scalable and less expensive, removed outdated content in the Learn section and reorganized the remaining content for accessibility, and updated the Resources section to better reflect the current state of MakerDAO.  Explainer Videos Our first explainer video, “How to Vote in Governance” is also awaiting legal review and is otherwise ready for publication. It’s taken longer than anticipated to get the first video out due to the extra work involved in setting up our scriptwriting, design, and animation processes but getting these in place helps streamline the production of the rest of the explainer videos. We have scripts we’re working on in collaboration with GovAlpha (linked here) at varying stages of completion and several topical scripts covering things like liquidations.  Regular Publications To increase the accessibility our work on Maker Relay (in collaboration with GovComms) and Multi-chain Dai-lights (formerly Dai on Different Networks), we’ve made these updates available via email using Substack; once Community Portal v2.0 launches, we’ll publish these updates on the blog and allow readers to subscribe to as many or few updates as they would like to receive.  Looking Ahead In Q1 2022, we’ll be focusing on:   Collecting content at ETHDenver and organizing a MakerDAO side event. Jerry’s based in Denver and plugged into the local music scene, which means he   Launching the pilot of our Ambassador Program, which will pay contributors from different regions to translate content to and from different languages, manage localized social media channels, and host meetups. The pilot will target Latin America.   Updating content in the Learn section of the Community Portal, adding more Resources as they become available, and testing for usability.   Publishing Explainer Videos, starting with several we’re collaborating on with GovAlpha and moving on to important topics like Liquidations and Collateral Onboarding.    Budget Update After reviewing our accounting for October, it appears we’re more underbudget on salaries than we reported in our most recent budget proposal by about 9000 Dai and our Community Portal fund has been largely unused since the new CMS doesn’t require input from a React dev. We’re currently assessing the cost of the content production efforts we’re proposing for ETHDenver and plan to put up a Signal Request to see whether or not we have the community’s support in reallocating these funds to cover those expenses. Received: (in a multi-sig controlled by Governance)     Category Funds     Total since Aug 31 (last budget passed) 98,067 DAI   Total in streaming contract 103,134 DAI   Total in Gnosis multi-sig (where DAI went prior to streaming) 17,359.73    Spent since October 1st:     Category Funds     Salaries 48,637.00 DAI   Community Management 400 DAI   Contingency 8089.29   Other 886.93   Total 58,013.22   Leftover Budget 120,493.73   - Contingency leftovers 8652.71 DAI   - Continuity 46,500 DAI   New Leftover Total 65,341.02    We’ve also rolled 51,056 DAI over to our new budget proposal:  Office Hours As always, please join us for our weekly Office Hours on Wednesdays at 16:30 UTC or reach out in the #content-production-public channel on Discord if there’s anything you’d like to discuss with the team! ",
                    "links": [
                        "https://twitter.com/MakerMegaphone/status/1456288880353693700",
                        "https://twitter.com/MakerMegaphone/status/1456288880353693700",
                        "https://twitter.com/themyntlab",
                        "https://twitter.com/MakerDAO",
                        "https://twitter.com/StableNode",
                        "https://twitter.com/creaticles",
                        "https://twitter.com/UpshotHQ",
                        "https://twitter.com/Chromia",
                        "https://t.co/PkCA9GJT7i",
                        "https://twitter.com/MakerMegaphone/status/1456288880353693700",
                        "https://www.youtube.com/watch?v=qhV388sL6Bs",
                        "https://www.youtube.com/watch?v=FeinfHe75so",
                        "https://www.youtube.com/watch?v=rbOYdEmZp_I",
                        "https://www.youtube.com/watch?v=vk7F6ejxyQA&list=PLLzkWCj8ywWPolnUhRn_HWeZJX35PuT53&index=48",
                        "https://www.youtube.com/watch?v=0ilts--wRXw",
                        "https://makerdaoupdates.substack.com/",
                        "https://forum.makerdao.com/t/maker-relay-ep-69/11345",
                        "https://forum.makerdao.com/t/maker-relay-ep-70/11528",
                        "https://forum.makerdao.com/t/multi-chain-dai-lights-november-4-2021/11454",
                        "https://forum.makerdao.com/t/maker-governance-review-october-2021/11517",
                        "https://makerdaoupdates.substack.com/",
                        "https://makerdaoupdates.substack.com/p/maker-relay-69",
                        "https://makerdaoupdates.substack.com/p/maker-relay-70",
                        "https://makerdaoupdates.substack.com/p/the-state-of-dai-11",
                        "https://makerdaoupdates.substack.com/p/the-state-of-dai-12",
                        "https://app.poap.xyz/admin/events/the-great-migration-from-rocketchat-2021",
                        "https://dune.xyz/alec/Where-is-my-Dai",
                        "https://forum.makerdao.com/t/ask-makerdao-12-ama-learn-about-maker-wormhole-with-protocol-engineering/11610",
                        "https://discord.com/channels/893112320329396265/899667556418351194/908485334252281857",
                        "https://www.makerdao.world/",
                        "https://docs.google.com/spreadsheets/d/1XuS4vIewPbdipLw6iHnG6UCYsZ5UzOg8Zv88lG829i8/edit#gid=0",
                        "https://makerdaoupdates.substack.com/",
                        "https://forum.makerdao.com/t/mip40c3-sp33-modify-core-unit-budget-mkt-001/10150",
                        "https://content.makerdao.network/Office-Hours-3c03ea25fec7455f960da297eca113b9",
                        "https://discord.gg/82vfc4myZu",
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/under-construction/12274/3"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.435447397252952
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "6",
                    "time": "12/11/2021-23:58:34",
                    "content": "    seth:  Released and updated the Dai-Curious Dashboard, which details a wide range of high-level MakerDAO financials.   Really killer dashboard, wanted to highlight it to make sure people see      seth:  Started discussions on organizing content collection and a side event at ETHDenver.    This will be my first Crypto Conference and I am very much looking forward to collabing for an awesome side event  .  Just wanted to say thanks for the update here! Hoping the Maker Operational Manual will give us another chance to collaborate for the new portal as well. Am hoping I can make it to your office hours next week to ask a few more granular questions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.271074380165289
                }
            ]
        }
    ]
}