{
    "poll_list": [
        {
            "title": "Adopt the Debt Ceiling Instant Access Module (DC-IAM) for PSM-PAX-A - September 13, 2021",
            "index": "10199",
            "option": "Yes",
            "supporting_mkr": "70,574",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-activate-dc-iam-for-psm-pax-a-and-adjust-dc-iam-gap-parameter-for-psm-usdc-a/10199",
            "title": "[Signal Request] activate DC-IAM for PSM-PAX-A and adjust DC-IAM gap parameter for PSM-USDC-A ",
            "index": 10199,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "risk",
                "sig-status-accepted",
                "dc-iam",
                "psm"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#1",
                    "likes": "5",
                    "time": "07/09/2021-14:24:09",
                    "content": "Summary PSM-PAX debt ceiling was recently increased to 500M, but currently does not have Debt Ceiling Instant Access Module (DC-IAM) activated. In order to maintain a healthy DC-IAM gap which also includes PSM-PAX, we propose the following;  Activate DC-IAM for PSM-PAX with following parameters Set line to 500M Set gap to 50M Set ttl to 24h Reduce the PSM-USDC DC-IAM gap to 950M  Pros:  Slower and more controlled increase of PSM-PAX debt ceiling Maintaining the aggregated DC buffer across PSMs  Cons:  Potentially slowing down the diversification process of stablecoin exposure  Main Text Peg Stabilization Module (PSM) is an important mechanism for maintaining the dai peg. Due to general excess demand, dai tends to trade with a premium which is arbitraged away via PSM-USDC and therefore the USDC exposure is increasing rapidly. In order to diversify the exposure to USDC, the community decided to add additional stablecoin PSMs, of which PAX is the first one. In order to incentivize the diversification process of stablecoins used in PSMs, the tin parameter of PSM-USDC was increased from 0.1% to 0.2% and PAX-PSM was introduced with a tin of 0.1%. Another important aspect of PSM is to prevent dai premium diverging further from the peg during dai liquidity crunch events commonly associated with larger market drowndows (such as during Black Thursday), when vault owners need to acquire dai on open market and other market participants are also purchasing dai in order to hedge their positions. In such instances, PSM plays a critical role as other means of increasing dai supply are limited and therefore it is important that we maintain a healthy DC buffer across PSMs. While diversification of stablecoin exposure is important, their liquidity aspects should not be neglected either. The supply and the growth rate of USDC is magnitudes higher than PAX, especially considering that almost half of its supply is in the hands of Paxos treasury. The on-chain liquidity of PAX is poor, especially the PAX-DAI liquidity, which is the most important for the dai premium arbitrage. Therefore the slower growth of PSM-PAX debt ceiling is preferred over the fast uncontrolled increase and this is the main reason why this proposal equates DC-IAM line with current available debt ceiling. Lastly, we preferably do not want to be exposed to a substantial share of the total supply of any collateral asset, especially not to centralized assets. With the currently available 500M PSM-PAX debt ceiling and additional 67.3M PAX which we already hold from PAX-A vault, we would be exposed to 58% of total PAX supply or 109% of supply that excludes emission held in Paxos treasury.    Do you agree with proposed changes stated above?  Yes No Other (write in the comments) Abstain     0 voters     Next Steps Poll will run until September 12th and depending on the outcome will move to an on-chain poll assuming the outcome is yes or will be reintroduced with changed parameters if the outcome is other. ",
                    "links": [
                        "https://makerdao.world/en/learn/governance/module-psm",
                        "https://forum.makerdao.com/t/signal-request-should-we-add-new-psms/8337",
                        "https://forum.makerdao.com/t/signal-request-tin-tout-parameters-for-new-psms/8789",
                        "https://etherscan.io/address/0x03ef33e66162ec503ae75dc192ae3760f1ac361e",
                        "https://forum.makerdao.com/t/maker-relay-ep-62/10311",
                        "https://forum.makerdao.com/t/maker-relay-ep-62-en-espanol/10399",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-september-2021/10659",
                        "https://forum.makerdao.com/t/maker-relay-ep-61/10214",
                        "https://forum.makerdao.com/t/maker-relay-ep-61-en-espanol/10376"
                    ],
                    "GPT-summary": "The post proposes activating DC-IAM for PSM-PAX-A and adjusting DC-IAM gap parameter for PSM-USDC-A. The proposal aims to maintain a healthy DC-IAM gap and diversify the exposure to stablecoins used in PSMs. The post explains the importance of PSM in maintaining the dai peg and preventing dai premium from diverging further from the peg during dai liquidity crunch events. The post also highlights the importance of maintaining a healthy DC buffer across PSMs and the need to avoid being exposed to a substantial share of the total supply of any collateral asset. The post ends with a poll to gather feedback on the proposed changes.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.343551587301587
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "3",
                    "time": "07/09/2021-14:29:49",
                    "content": "Adding DC-IAM is a great idea, however I would go with slightly different parameters. The whole point of DC-IAM is to have a lot more liberal settings, so we should allow more growth here.   line could be higher - but don’t mind keeping it at the current debt-ceiling  gap this should be higher as adding DC-IAM for the PSM will lower the amount of DAI compared to the current setup.  otherwise /lgtm, thanks @rema for initiating this  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 6.35
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "1",
                    "time": "08/09/2021-12:54:37",
                    "content": "Would love to see some more votes here if we’re going to close this out on Sunday. We’ll make sure this Signal gets highlighted on the G&R tomorrow, but ideally we’d have some move votes before heading into the weekend. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#4",
                    "likes": "1",
                    "time": "13/09/2021-12:56:36",
                    "content": "After talking with @Primoz I decided to add this to today’s polls despite the low participation. Given the one-sided response and the Risk-related reasoning for pushing forward, it seems best to have this at least polled rather than bundled in an executive. In the future, it might make more sense for these types of proposals (ones with potentially large Risk impacts and low downsides) to be presented to the community as recommendations that will appear on-chain, rather than signal requests. With that said I appreciate the effort in asking for community feedback and encourage the Signal Request route to be taken when the result does not represent something that the Core Unity Facilitators would be using for their urgent executive listing powers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0102040816326525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#5",
                    "likes": "2",
                    "time": "23/09/2021-13:01:58",
                    "content": "The executive containing these changes passed and was executed on Tuesday, September 21. Thanks to all that participated in votes and discussion! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "23/10/2021-23:02:30",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "68"
}