{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140",
            "title": "GUSD & MakerDAO Partnership Announcement ",
            "index": 18140,
            "category": [
                "Updates",
                "Integrations"
            ],
            "tags": [
                "gusd"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/tylerwinklevoss",
                    "index": "#1",
                    "likes": "44",
                    "time": "29/09/2022-15:26:37",
                    "content": "Hi to all the members of the Maker community! In order to deepen our partnership with Maker, we have been working closely with the Strategic Finance Core Unit and the Growth Core Unit to understand how Gemini can contribute to strengthening the Maker ecosystem. We came up with the below proposal and look forward to hearing the community’s feedback! For more context and information on the support of Maker by Gemini our original GUSD PSM proposal can be found here: Proposal: GUSD PSM The Gemini team has always been excited about supporting Maker and Dai in our various products.  Custody: MKR has been supported on Gemini since August 2020, and Dai since April 2020. Trading: MKR trading was supported in September 2020, and Dai in May 2020. Earn: MKR is supported in the Gemini Earn product with 1.26% APY, and Dai with one of the highest rates at 5.31% APY to our users. Nifty Gateway: Nifty Gateway users can use their Gemini exchange account balances to make purchases on NG. This means a Gemini exchange user who has Dai in their wallet can use it to pay on Nifty Gateway, where a conversion from to ETH or USD takes place. Credit Card: Customers are able to select Dai and MKR as their reward to earn instant crypto rewards on the Gemini Credit Card.  Our exchange is also ranked as one of the top 50 Dai holders by balance. Gemini is a New York trust company regulated by the New York Department of Financial Services. There are no fees to mint or redeem GUSD 1:1 to USD through Gemini and Gemini covers all gas costs to withdraw on-chain. Gemini dollar (GUSD) USD reserve audits are published monthly by an independent registered accounting firm, BPM LLP, and the Ethereum smart contract was launched in September 2018 and has been audited by Trail of Bits. This information has also been mentioned in our previous Vault collateral application on this forum here, activated shortly after. GUSD-ETH and GUSD-BTC pairs are also available on Gemini.  MakerDAO <> Gemini Marketing Incentive We’d would like to encourage the use of GUSD in the MakerDAO ecosystem and we are excited to announce a marketing incentive:  Starting on 01-Oct-2022, for the next 3 months, Gemini will contribute to MakerDAO a fixed rate of 1.25% (annualized rate, calculated and paid on a monthly basis) for any GUSD present in the PSM, as long as the average monthly balance on the last day of the month is over $100m GUSD  There is a Dune query available that shows the current month-to-date balance for community members to check and do their own calculations:        The payments will be credited once per month in GUSD  As we’d like GUSD usage to increase on-chain, we propose that this marketing incentive only be credited if the average monthly balance of GUSD in the PSM is greater than or equal to $100m for the month Maker will have to onboard and KYC an entity to create an account with Gemini that can be credited, and that can then move the GUSD back to the protocol as instructed by Maker Governance   The GUSD in the PSM will not go into Gemini custody or move from the PSM  We recognize the importance of the PSM in securing Dai redemptions and we believe keeping it on-chain is the best way to fulfill that task   Before the end of December, when we review the results of this experiment, we might renew our commitment at this rate, a different rate altogether or not at all  We hope this proposal is as exciting to the community as it is to us, and we look forward to hearing any comments around this partnership. Useful Links Whitepaper: https://gemini.com/static/dollar/gemini-dollar-whitepaper.pdf 4 Website: Gemini dollar (GUSD) | Gemini Twitter: https://twitter.com/Gemini 1 Source code: GitHub - gemini/dollar: Gemini dollar contract source code 3 GUSD token contract: https://etherscan.io/token/0x056fd409e1d7a124bd7017459dfea2f387b6d5cd 1 Independent accountant’s reports: Gemini dollar (GUSD) | Gemini 2 Trail of bits contract audit: https://gemini.com/static/dollar/gemini-dollar-trailofbits-audit.pdf Onward and upward! -Tyler ",
                    "links": [
                        "https://etherscan.io/token/0x6b175474e89094c44da98b954eedeac495271d0f#balances",
                        "https://gemini.com/dollar",
                        "https://forum.makerdao.com/t/gusd-mip6-collateral-onboarding-application/3319/13",
                        "https://gemini.com/static/dollar/gemini-dollar-whitepaper.pdf",
                        "https://gemini.com/dollar",
                        "https://twitter.com/Gemini",
                        "https://github.com/gemini/dollar",
                        "https://etherscan.io/token/0x056fd409e1d7a124bd7017459dfea2f387b6d5cd",
                        "https://gemini.com/dollar#reports",
                        "https://gemini.com/static/dollar/gemini-dollar-trailofbits-audit.pdf",
                        "https://forum.makerdao.com/t/signal-request-change-psm-gusd-a-parameters/18142",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/123",
                        "https://forum.makerdao.com/t/anuncio-de-la-asociacion-entre-gusd-y-makerdao-traduccion/18159",
                        "https://forum.makerdao.com/t/growth-cu-end-of-2022-review/19194",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/125",
                        "https://forum.makerdao.com/t/governance-and-risk-211-thursday-october-06-at-17-00-utc/18244/2",
                        "https://forum.makerdao.com/t/financial-report-2022-09/18358",
                        "https://forum.makerdao.com/t/updating-the-short-term-bond-strategy/18302",
                        "https://forum.makerdao.com/t/governance-and-risk-210-thursday-september-29-at-17-00-utc/18115/3",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/23",
                        "https://forum.makerdao.com/t/mip87-ousd-decentralized-rewards/18216",
                        "https://forum.makerdao.com/t/thoughts-of-next-steps-for-alm-and-rwa/19899",
                        "https://forum.makerdao.com/t/3-boletin-de-noticias-enero-del-2023/19672",
                        "https://forum.makerdao.com/t/makerdao-2022-financial-results-and-retrospective/19636",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-update/19428/2",
                        "https://forum.makerdao.com/t/request-to-poll-psm-gusd-a-parameters/19416",
                        "https://forum.makerdao.com/t/2-boletin-de-noticias-diciembre-del-2022/19316",
                        "https://forum.makerdao.com/t/gusd-institutional-rewards-technical-solution-risk-assessment-and-deployment-details-for-receiving-payments-of-rewards/19055",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/24",
                        "https://forum.makerdao.com/t/growth-cu-update-north-america-nov-2022/18762",
                        "https://forum.makerdao.com/t/discussion-on-enabling-the-dsr/18759",
                        "https://forum.makerdao.com/t/governance-and-risk-214-november-03-at-17-00-utc/18637/8",
                        "https://forum.makerdao.com/t/actualizacion-mensual-de-la-cu-de-growth-septiembre-del-2022-traduccion/18691",
                        "https://forum.makerdao.com/t/growth-cu-monthly-update-september-2022/18686",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/127"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.821756094782411
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#2",
                    "likes": "20",
                    "time": "29/09/2022-15:28:12",
                    "content": "So thrilled to see this proposal hit the forums. Thank you to the Gemini team for their engagement and demonstrable track-record of whole-hearted commitment to the space. For the level of liquidity that a GUSD PSM leaves for Dai redemptions, Gemini is offering a very compelling incentive to hold as much of the PSM in GUSD as we can. The GUSD in effect do not leave the PSM at all, at any point, unless Dai holders want to redeem their Dai for them. This proposal is pushing the edge of the pareto optimal frontier for liquidity and yield at the moment. As governance decides on what Dai’s optimal asset allocation should be, we are starting to see the engagement of committed partners who value being closely integrated with MakerDAO and with DeFi as a whole. Governance should evaluate bids for allocation on the merits of the immediacy of the liquidity they offer against the yield provided. GUSD’s partnership offer more than meets the mark for Dai today. Going forward, we should favor PSM vaults with at least a corresponding level of commitment to the MakerDAO ecosystem, and strongly disfavor vaults that do not meet our objectives.  image2310×1148 369 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.264583333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#4",
                    "likes": "6",
                    "time": "29/09/2022-15:35:39",
                    "content": "    tylerwinklevoss:  Starting on 01-Oct-2022, for the next 3 months, Gemini will contribute to MakerDAO a fixed rate of 1.25% (annualized rate, calculated and paid on a monthly basis) for any GUSD present in the PSM, as long as the average monthly balance on the last day of the month is over $100m GUSD   Great proposal and excited to hear community opinions. This is the way that all PSM pairs should be onboarded going forward. The PSM benefits DAI by maintaining its peg close to $1.00 but it also greatly benefits the collateral (BUSD) by creating stability for them to continue to grow and earn revenue from their collateral, which we should be compensated for (i.e. 1.25% rewards). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#5",
                    "likes": "7",
                    "time": "29/09/2022-15:46:02",
                    "content": "It seems to me a great way to incentivize the use of DAI and GUSD, as well as not breaking with the basic principle of decentralization by giving the assets to a third party. I can see that it will be more work on Maker’s part to encourage more strongly the use of this pair. Thanks for your commitment to Maker @tylerwinklevoss     adcv:  Going forward, we should favor PSM vaults with at least a corresponding level of commitment to the MakerDAO ecosystem, and strongly disfavor vaults that do not meet our objectives.   I couldn’t agree with you more, but I think the vision should always be to respect decentralization a little more, as in this case it does. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.407986111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BlockEnthusiast",
                    "index": "#6",
                    "likes": "2",
                    "time": "29/09/2022-16:10:03",
                    "content": "    tylerwinklevoss:  Maker will have to onboard and KYC an entity to create an account with Gemini that can be credited, and that can then move the GUSD back to the protocol as instructed by Maker Governance   Why can’t you just send the funds to Maker? This whole proposal is quite good, but requiring Maker to make a legal entity to receive funds feels unnecessary. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#8",
                    "likes": "1",
                    "time": "29/09/2022-20:35:22",
                    "content": "Love this rewards program! Is there a way to track users selection of DAI or MKR     tylerwinklevoss:  Credit Card: Customers are able to select Dai and MKR as their reward to earn instant crypto rewards on the Gemini Credit Card.   Question regarding DAI being listed in Gemini. Would direct DAI trades executed in Gemini’s exchange be included in the DAI GUSD PSM?     tylerwinklevoss:  Trading: MKR trading was supported in September 2020, and Dai in May 2020.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.53125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#9",
                    "likes": "3",
                    "time": "29/09/2022-23:42:48",
                    "content": "Very nice that the GUSD stays in the PSM. I echo @BlockEnthusiast in that it would be really nice if Gemini would send the GUSD earned my Maker directly to either the PSM or the pause proxy. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/19"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.466666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#10",
                    "likes": "2",
                    "time": "30/09/2022-14:27:29",
                    "content": "Why does the world need DAI if it will forever rely on the good will of centralized stablecoin issuers, governments and regulators for its existence? MakerDAO needs to ask itself this question. DAI was not built to be a corporation. It was built to serve a purpose. It is currently not serving that purpose. Adding yet another centralized stablecoin to the PSM would take it even farther away from its stated goal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#11",
                    "likes": "2",
                    "time": "30/09/2022-14:49:18",
                    "content": "    ChrisBlec:  Adding yet another centralized stablecoin to the PSM would take it even farther away from its stated goal.   Chris, you might be a bit confused here. First, there are multiple PSMs, not just one. Second, this partnership announcement does not involve adding another centralized stablecoin Peg Stability Module The system already has a GUSD PSM. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#12",
                    "likes": "2",
                    "time": "30/09/2022-14:54:39",
                    "content": "No, I’m not confused, despite mis-use of jargon. Maker currently has an inconsequential amount ($30k?) of GUSD in PSM. So small that it is relatively meaningless. This proposal is designed to take it from that tiny amount to over $100m. In essence, adding an existential reliance on GUSD for the first time. This begs the question that I asked above. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.785714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#13",
                    "likes": "3",
                    "time": "30/09/2022-15:04:14",
                    "content": "    ChrisBlec:  adding an existential reliance on GUSD   This suggests you believe this proposal would increase overall centralized stablecoin deposits into PSMs.  Why would it? It doesn’t incentivize anyone in that direction. What it does do is incentivize MakerDAO to shift some centralized stablecoin exposure from USDC to GUSD, to earn income. That would have the effect of diversifying centralized stablecoin risk, which I presume you’d agree is not a step in the wrong direction. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#14",
                    "likes": "1",
                    "time": "30/09/2022-15:12:51",
                    "content": "    Spidomo:  That would have the effect of diversifying centralized stablecoin risk, which I presume you’d agree is not a step in the wrong direction.   We should be eliminating centralized stablecoin risk. Not pretending to spread it around. They’re all ruled by 1 regulatory body and 1 government. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#15",
                    "likes": "1",
                    "time": "30/09/2022-15:21:27",
                    "content": "I hope I understand what you would propose, although in the end they are regulated by the same body, this solution is better in terms of minimizing possible damage, unlike USDC which would be to hand them over to a third party. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#16",
                    "likes": "1",
                    "time": "30/09/2022-15:25:15",
                    "content": "MakerDAO is not choosing between giving custody to Coinbase vs. keeping custody and using Gemini. They are 2 separate decisions. If decentralization is the priority, then the correct answer for both decisions is no. MakerDAO needs to eliminate the existential risk posed by the centralized stablecoins in PSMs. Not shuffle it around. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#17",
                    "likes": "3",
                    "time": "30/09/2022-15:30:21",
                    "content": "    ChrisBlec:  We should be eliminating centralized stablecoin risk. Not pretending to spread it around.   Sounds like you would agree (or at least not dispute) that this proposal:  Doesn’t make the centralized stablecoin risk any worse Brings income to MakerDAO  And your main criticism is that it does not move in the direction of eliminating centralized stablecoin risk. In other words, a strict improvement over the current state of things (just not the one you’re looking for). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.341666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#18",
                    "likes": "1",
                    "time": "30/09/2022-15:35:04",
                    "content": "    Spidomo:   Doesn’t make the centralized stablecoin risk any worse Brings income to MakerDAO    This proposal increases the risk that the DAO will get even more addicted to the comfort created by centralized stablecoin collateral than it is today. The DAO needs to recognize that decentralization is more important than this centralized corporate comfort. It’s a clear “no” from the [minority] decentralization point-of-view. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#19",
                    "likes": "2",
                    "time": "30/09/2022-15:43:59",
                    "content": "Just for clarity, would you still vote no and prevent that from happening if you had majority voting power? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#20",
                    "likes": "20",
                    "time": "30/09/2022-15:52:42",
                    "content": "If Maker wants to pursue a fully decentralized approach to collateral (eg protocol owned vault, etc) we will need a lot more capital to do this safely. Mechanisms like this proposal can help Maker build up enough surplus to make fully decentralized backing sustainable. Don’t see any reason Maker should be turning away “free” money (not involving any additional credit/custody risk versus current state). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#21",
                    "likes": "7",
                    "time": "30/09/2022-16:10:35",
                    "content": "    monet-supply:  not involving any additional credit/custody risk versus current state   Risk is technically a little lower too as our centralized stablecoin backing would be more diversified ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#22",
                    "likes": "3",
                    "time": "30/09/2022-16:41:09",
                    "content": "OK, I think it’s utopically beautiful, but I don’t have a solution for that. How do we do it in the DAO? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#23",
                    "likes": "2",
                    "time": "30/09/2022-20:33:41",
                    "content": "    Spidomo:   Doesn’t make the centralized stablecoin risk any worse Brings income to MakerDAO    Both are true and equally important is that the income will help us achieve our long-term strategic goal:  Reduces timeframe to remove/reduce exposure (my preferred option) of centralized stablecoins as DAI collateral  If you want DAI to be resilient you should favor of revenue-generating initiatives that will be the capital needed to achieve that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#24",
                    "likes": "2",
                    "time": "30/09/2022-22:27:29",
                    "content": "    monet-supply:  Mechanisms like this proposal can help Maker build up enough surplus to make fully decentralized backing sustainable.   This, Maker still need to pay its workers, to get capital in order to pursue future plans. Right now crypto is facing lot of challenges and we need to survive no matter what. I think we all in MakerDAO benefit from deals like this with such huge partners like Gemini (I can see the same with Binance for example), even if you think just in a marketing perspective this is just awesome. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.204081632653061
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#25",
                    "likes": "1",
                    "time": "01/10/2022-00:40:42",
                    "content": "This is very cool! Wondering if there’s any idea of continuing this long term instead of just three months? That would probably be a consideration when it comes to rebalancing our stablecoin assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.296875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#26",
                    "likes": "2",
                    "time": "01/10/2022-21:02:58",
                    "content": "We should not waste time on small coins that will not be there in 5 years. GUSD is #106 by market cap and there is no way it will ever be relevant. I’m sorry but USDC succeeded and you failed. There’s nothing you can do about it - it’s the battle between $50B and $300M and the winner is always the one with more Bs. Is there any chance that MakerDAO splits in two with one unit working on a decentralized stablecoin like RAI? RAI is dead for the same reason as GUSD but what if RAI-like coin had MakerDAO infrastructure…? EDIT: deleted notes at the end. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#27",
                    "likes": "6",
                    "time": "02/10/2022-12:39:14",
                    "content": "    bit:  We should not waste time on small coins that will not be there in 5 years.   What “time”? This proposal is basically unilateral, in the spirit of DeFi. Gemini just announced that they are willing to give us money if the the GUSD PSM is big enough in the next 3 months. What we need to do is very minimal:  decide if we want to ‘accept’ this money if yes, create the offchain entity that will formally receive the money in the real-world and transfer it back to the Surplus buffer. increase the GUSD PSM ceiling to a desired level.  Not very much work, really. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.815034965034965
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#28",
                    "likes": "2",
                    "time": "02/10/2022-15:11:43",
                    "content": "What actions can Gemini and Maker take to support GUSD PSM growth? I understand (and support) this proposal would increase our incentives to promote and hold GUSD but currently GUSD is at 300M market cap, which means that we would need at least 30% of that to see any revenue. Unless I am missing something, I don’t see how this can reasonably be achieved in under 3 months. Shouldn’t we agree on a more achievable target? Maybe 15M to start, which would still be around 5%. For comparison the enormous USDC PSM represents only 10% of USDC’s market cap. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.142857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PatrickOD",
                    "index": "#29",
                    "likes": "2",
                    "time": "02/10/2022-18:21:27",
                    "content": "This proposal seems to be preferable to the Coinbase offer, mainly because the GUSD funds would remain in the PSM rather than needing to be custodied with Gemini.  It’s a lower rate, so it doesn’t provide the same level of income.  But in principle this seems to be far more decentralized.  I see there is a $100m minimum.  Is there a max?  (Current GUSD Mkt cap = $300m per latest attest report) Will this be newly minted GUSD issued by Gemini or will Maker be responsible for swapping USDC into GUSD on open market? Could Maker choose to take this offer and allocate $1.5b of collateral, assuming Gemini can/will mint that much new GUSD? How was the 1.25% rate chosen?  @tylerwinklevoss with 3m T-bills at 3.25% that seems a bit cheap…  Congrats and thank you to the StratFi and Growth units for their work on this, and Gemini team for the thoughtful proposal.  Great to see MakerDAO presented with multiple alternatives to choose from for this type of initiative. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.130536130536131
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#30",
                    "likes": "1",
                    "time": "03/10/2022-11:26:35",
                    "content": "This is a very good and timely proposal. Honest question: Leaving all concerns about redemption aside for a second, could Maker even swap $1.6bn of USDC to GUSD? How long would that take? Given that almost all of that GUSD would have to be newly minted or created, it seems the revenue share leaves a bit to be desired. I’m certain that any negotiation can not take place here on a public forum, but the respective CUs and Gemini could meet and discuss terms, it seems. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.131655844155844
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#31",
                    "likes": "1",
                    "time": "03/10/2022-14:22:25",
                    "content": "    rspa:  Given that almost all of that GUSD would have to be newly minted or created, it seems the revenue share leaves a bit to be desired   Why does this matter at all? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#32",
                    "likes": "1",
                    "time": "03/10/2022-14:39:27",
                    "content": "Let’s say you’re a business and a customer comes and orders 5x what you produced so far. Would you agree that this customer could ask for a special treatment ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.142857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#33",
                    "likes": "3",
                    "time": "03/10/2022-14:52:19",
                    "content": " sure, this is the best deal we have gotten so far. & will lead to more competitive pressures, more of a race to the top. Not really a good analogy anyway though because of how simple the “product” is. We are hopeful that with the slight tinkering of a few parameters, we can get this PSM filled (& others would do the work of swapping USDC for USD for GUSD). If this doesn’t work, there are other ways to get the simple job (USDC → USD → GUSD) done.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.022435897435897
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#34",
                    "likes": "4",
                    "time": "03/10/2022-14:54:30",
                    "content": "yeah, it’s crude. but not wrong. anyway, my biggest concern is liquidity. how long would it even take to scale GUSD to anything comparable to Coinbase? How would we liquidate or redeem in case we need to? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#35",
                    "likes": "1",
                    "time": "03/10/2022-18:07:32",
                    "content": "Simply: is MKR converting assets in the USDC PSM from USDC (>100M) to GUSD to meet the incentive? If so shouldnt the incentive be higher, at least match Coinbase proposal? Gemini will be making at least SOFR (~3%) from our 100M purchase…Dont get me wrong something is better than nothing but we are doing most of effort in this initiative and earning less than 50% of the rewards ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.989583333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ekryski",
                    "index": "#36",
                    "likes": "7",
                    "time": "04/10/2022-00:44:08",
                    "content": "Very interesting proposal @tylerwinklevoss!  Overall, I’m in favour and this is a superior proposal that aligns better with Maker and the End Game plan than nearly everything else to date. Since Paxos and Gemini are the two best regulated stablecoin issuers today due to their deposit taking trust structure (at least from the regulator’s and most lawyers/scholars perspective). Because a deposit taking trust is a regulated financial institution that is closer in structure and regulatory requirements to a bank or credit union, as compared to Circle only having a money transmitter designation, this makes GUSD more akin to an on-chain deposit receipt. The difference in legal structure of the issuer is not to be understated. Deposit receipts entitle holders to a different set of claims in the event of bankruptcy of the financial institution and are also more familiar to regulators and bankruptcy court for the kind of activity that stablecoin issuers undertake. This should reduce regulatory risk to DAI and Maker in comparison to USDC. Additionally, Gemini has one of the better insurance legal structures (not necessarily converage) with their captive set up in Bermuda (major re-insurance market). AFAIK they are the only crypto institution to successfully create a captive to date, and the captive registration and monitoring is regulated by the Bermuda Monetary Authority, which is the same regulator that oversees Circle’s USDC Yield product (but not Circle’s issuance). From a custody perspective, this is also much better structured since the GUSD is in Maker’s existing PSM.  Note: because Gemini is the issuer of GUSD, there is no need for them to custody the GUSD because they hold the backing USD fiat anyway. In effect, this reduces middlemen to Gemini and their banking partners as opposed to the Bank → Circle → Coinbase → Maker flow for the USDC that is proposed in MIP81.  On these merits, it is objectively a better proposal. An evaluation of the financial position of the major counterparties involved in these stablecoin deals may be prudent in having a better apples to apples comparison on bankruptcy/default risk.     BlockEnthusiast:  Why can’t you just send the funds to Maker? This whole proposal is quite good, but requiring Maker to make a legal entity to receive funds feels unnecessary.   Agreed. More on that below.     Spidomo:  This suggests you believe this proposal would increase overall centralized stablecoin deposits into PSMs. Why would it? It doesn’t incentivize anyone in that direction. What it does do is incentivize MakerDAO to shift some centralized stablecoin exposure from USDC to GUSD, to earn income. That would have the effect of diversifying centralized stablecoin risk, which I presume you’d agree is not a step in the wrong direction.   Agreed. There is a big de-risking win if the PSMs are better balanced between GUSD and USDC.     lyt:  Not really a good analogy anyway though because of how simple the “product” is. We are hopeful that with the slight tinkering of a few parameters , we can get this PSM filled (& others would do the work of swapping USDC for USD for GUSD). If this doesn’t work, there are other ways to get the simple job (USDC → USD → GUSD) done.   There are 2 options here:   Onboard an entity to represent Maker as currently proposed and have it swap USDC → USD via Circle and take the USD to Gemini to mint GUSD and put it in the GUSD PSM. No issues with slippage and minimal fees.   Maker creates a revenue sharing incentive structure such that it passes on a portion of the 1.2% marketing incentive rewards for PSM depositors and/or MKR holders. The market will likely naturally rebalance to acquire more GUSD and put it in the PSM. A little more difficult to be confident on this given the rev share might not be worth the effort to open market participants.    Further Questions @tylerwinklevoss it would be great if you could provide more clarity on:   What would happen to GUSD held by Maker in its PSM in the event that Gemini and/or its financial institutions became delinquent. Are the funds that back GUSD isolated and held in trust in FBO accounts based on named beneficiaries or are they pooled? ie. who would be the claimant on the USD backing the GUSD?   Is there any insurance coverage (FDIC or through your captive) on the USD backing GUSD? In your post here it says funds are FDIC insured, so I assume the legal entity representing Maker would qualify for $250k USD coverage. Can you confirm? If so, is the FDIC coverage on all minted GUSD (~$300MM today) or only the GUSD held by Maker? This goes along with #1, as the account structure matters. Something that FTX recently screwed up.      Proposal: GUSD PSM   Gemini dollar (GUSD)  bank reserves are eligible for FDIC insurance up to $250,000 per user while custodied with State Street Bank and Trust.    Is it possible for Gemini to send the marketing incentive directly to the PSM address without needing to onboard a representative company and have any manual intervention? Much like I described in MIP81 and what @BlockEnthusiast mentioned, this would reduce centralization and likely also reduce regulatory, legal and operational risk for both Maker and Gemini because you’d simply be paying or airdropping GUSD to a smart contract on a decentralized network and not explicitly paying any legal entity or individual.  Looking forward to seeing this develop!   ",
                    "links": [
                        "https://forum.makerdao.com/t/mip81-coinbase-usdc-institutional-rewards/17703/210",
                        "https://forum.makerdao.com/t/signal-request-change-psm-gusd-a-parameters/18142",
                        "https://forum.makerdao.com/t/proposal-gusd-psm/11148",
                        "https://forum.makerdao.com/t/proposal-gusd-psm/11148/1",
                        "https://gemini.com/dollar",
                        "https://forum.makerdao.com/t/mip81-coinbase-usdc-institutional-rewards/17703/199#an-on-chain-alternative-2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.859420928865373
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ropstenrich",
                    "index": "#37",
                    "likes": "2",
                    "time": "25/10/2022-18:21:06",
                    "content": "@ekryski I’m with the team at Gemini working on GUSD. These are great questions. I’ll take a stab at answering each, thanks for raising them and guiding the conversation.   What would happen to GUSD held by Maker in its PSM in the event that Gemini and/or its financial institutions became delinquent. Are the funds that back GUSD isolated and held in trust in FBO accounts based on named beneficiaries or are they pooled? ie. who would be the claimant on the USD backing the GUSD?   The reserves backing each GUSD are held in omnibus bank accounts at U.S. FDIC-insured banks, one or more money market accounts and/or one or more investment accounts holding U.S. Treasury obligations. Each account is in our name and under our control, separate from our business, operating, and reserve accounts, and established specifically for the benefit of Gemini customers.   Is there any insurance coverage (FDIC or through your captive) on the USD backing GUSD? In your post here it says funds are FDIC insured, so I assume the legal entity representing Maker would qualify for $250k USD coverage. Can you confirm? If so, is the FDIC coverage on all minted GUSD (~$300MM today) or only the GUSD held by Maker? This goes along with #1, as the account structure matters. Something that FTX recently screwed up.   The U.S. dollar cash portion of these GUSD reserves, which may be held at Silvergate Bank, State Street Bank and Trust Company or Signature Bank, may be eligible for FDIC “pass through” insurance for Gemini customers in the event that the bank holding such U.S. dollar cash deposits becomes subject to resolution or similar proceedings by the FDIC. For more information, see the “FDIC Insurance” section of our user agreement   Is it possible for Gemini to send the marketing incentive directly to the PSM address without needing to onboard a representative company and have any manual intervention? Much like I described in MIP81 and what @BlockEnthusiast mentioned, this would reduce centralization and likely also reduce regulatory, legal and operational risk for both Maker and Gemini because you’d simply be paying or airdropping GUSD to a smart contract on a decentralized network and not explicitly paying any legal entity or individual.   This is a great suggestion. Our goal is to establish a due diligence process for the allocation of these funds working with Maker and the PSM. We are open to working with Maker to find the best path towards achieving that diligence and are aligned in finding an approach that improves decentralization while staying compliant. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip81-coinbase-usdc-institutional-rewards/17703/240"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.985670194003527
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#38",
                    "likes": "0",
                    "time": "25/10/2022-18:57:36",
                    "content": " It seems that currently, 2 weeks before the vote on raising the debt ceiling is due to take place, the outcome does not appear to be positive. Maker needs to make this PSM even more attractive, time is short and the DAO’s execution times may work against it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1685606060606055
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#39",
                    "likes": "0",
                    "time": "25/10/2022-19:14:56",
                    "content": "    Saludiego_201:  2 weeks before the vote on raising the debt ceiling is due to take place   The increased debt ceiling (& other parameters) has already been voted for and implemented  vote.makerdao.com   Governance Portal The MakerDAO Governance Portal allows for anyone to view governance proposals, and also allows for MKR holders to vote.      ",
                    "links": [
                        "https://vote.makerdao.com/executive/template-executive-vote-enable-dc-iam-for-rwa-007-a-monetalis-clydesdale-gusd-psm-parameter-changes-october-13-2022#proposal-detail"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#43",
                    "likes": "6",
                    "time": "02/11/2022-16:33:08",
                    "content": " October 2022 Average monthly balance in October ~$30m Dune query At time of writing, average balance for November is $266m ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makerburn",
                    "index": "#44",
                    "likes": "7",
                    "time": "02/11/2022-17:05:17",
                    "content": "And ~41.4M for the past 30 days  image1107×754 72.6 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#45",
                    "likes": "1",
                    "time": "02/11/2022-18:07:01",
                    "content": "top stuff as always thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#46",
                    "likes": "4",
                    "time": "02/11/2022-19:50:09",
                    "content": "Keep in mind GUSD PSM parameters were updated only 10 days ago though. Balances before that update were very ephemeral, so really only the last 10 days should be taken as representative of expectations. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#47",
                    "likes": "0",
                    "time": "02/11/2022-22:19:50",
                    "content": "Wondering where the GUSD inflows came from? Did we convert USDC from our PSM assets to gain some income here? Or is this inflow driven by Gemini? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#48",
                    "likes": "3",
                    "time": "02/11/2022-23:47:06",
                    "content": "Effectively a market maker is moving USDC to GUSD by redeeming for the underlying USD. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/beardmars",
                    "index": "#49",
                    "likes": "22",
                    "time": "16/11/2022-17:10:43",
                    "content": "Dear Maker Community, Some recent questions have emerged following our announcement that we would be pausing withdrawals from the Gemini Earn program. We are disappointed that the Earn SLA will not be met, but wanted to reassure the Maker community that GUSD is unaffected and we will continue our commitment to our partnership with Maker as previously announced.  What is the extent of Gemini’s total exposure to the FTX fallout, or Genesis Lending pausing withdrawals?  Per our blog last week, Gemini has no exposure to FTT tokens or Alameda and no material exposure to FTX. Gemini Earn, which is the only Gemini product integrated with Genesis Lending, has paused withdrawals as a direct result of Genesis’ recent announcement.   Are Gemini user funds affected?  No, Gemini user funds outside of Gemini Earn are unaffected.   Are GUSD reserves affected?  No.   Are GUSD funds segregated from the rest of the business?  Yes. Each GUSD is backed by a U.S. dollar held by Gemini as one of the following types of assets: (1) deposits in U.S. Federal Deposit Insurance Corporation (FDIC)-insured banks, (2) money market funds, invested only in U.S. Treasury Obligations, or (3) U.S. Treasury Obligations. The accounts holding GUSD reserves are separate from our business, operating, and reserve accounts.   What banks or institutions do you deposit GUSD reserves in?  The U.S. dollar cash portion of these GUSD reserves may be held at Signature Bank, State Street Bank and Trust Company, or Silvergate Bank. The money market and investment accounts used to invest in U.S. Treasuries are established at Goldman Sachs Asset Management and Oppenheimer & Co. Inc.   Do you have plans to introduce a proof of reserves or on chain asset attestation?  We do attestations to validate that our total reserve account balances are sufficient to back the on-chain GUSD balance at least monthly. As a whole, it appears that the Gemini community likes the idea of introducing proof of reserves and we have been thinking about how to provide even more transparency. However, per our blog, Gemini is a full-reserve exchange and custodian. This means that all customer funds held by Gemini are held 1:1 and available for withdrawal at any time. Gemini holds customer fiat currency in accounts that are segregated from our business, operating, and reserve bank accounts established specifically for the benefit of Gemini customers. We do not do anything with customer fiat funds unless explicitly authorized and directed to do so. Gemini also holds customer digital assets in accounts that are segregated from Gemini’s company assets. We do not do anything with customer digital assets unless explicitly authorized and directed to do so. In addition to being a full-reserve platform, Gemini Trust Company, LLC is a fiduciary and qualified custodian under New York Banking Law and is licensed by the New York State Department of Financial Services (NYDFS). NYDFS imposes certain excess capital requirements and compliance standards for all assets held by Gemini. At any given time, Gemini is required to hold capital in excess of customer deposits and must report any material changes in meeting this capital requirement to its regulator.    We are huge supporters of Maker and this community, and look forward to continued partnership and growth of the ecosystem. Marshall Beard Chief Strategy Officer Gemini ",
                    "links": [
                        "https://www.gemini.com/blog/gemini-is-built-on-trust-safety-and-compliance",
                        "https://www.gemini.com/blog/an-important-message-regarding-gemini-earn",
                        "https://www.gemini.com/dollar",
                        "https://www.gemini.com/blog/gemini-is-built-on-trust-safety-and-compliance"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.003633271490414
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ihsotas",
                    "index": "#50",
                    "likes": "0",
                    "time": "16/11/2022-18:02:10",
                    "content": "Thanks for the update brother. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#51",
                    "likes": "0",
                    "time": "16/11/2022-19:03:17",
                    "content": "Thanks for the timely update. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#52",
                    "likes": "2",
                    "time": "17/11/2022-01:00:25",
                    "content": "Thanks for the information.  Several more key questions. What would happen to Maker’s assets/GUSD if Gemini entered bankruptcy? Would the collateral backing the GUSD would be subject to a bankruptcy stay and not be recovered until a bankruptcy judge approves its release? Would Maker (and other GUSD holders) be treated as an unsecured creditor to a Gemini bankruptcy? I am asking for a bankruptcy analysis for GUSD holders ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340277777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hannah_Pham",
                    "index": "#53",
                    "likes": "0",
                    "time": "17/11/2022-01:09:34",
                    "content": "GUSD Reserves Report showed $330.9mil as of  Sept 30 2022. MakerDAO holds $483m GUSD in the PSM. How does MakerDAO hold more GUSD than the total GUSD issued and in circulation? Can someone please explain it to me?  twitter.com    Omn₳th @LeviTheGiant  I will forever be grateful to @Gemini and $GUSD.   It's very hard for me to ever question that stablecoin. https://t.co/XH7wUoAgnw   3:53 PM - 13 Nov 2022           23                4             Thanks ",
                    "links": [
                        "https://twitter.com/LeviTheGiant/status/1591821544556224512",
                        "https://twitter.com/LeviTheGiant/status/1591821544556224512",
                        "https://twitter.com/Gemini",
                        "https://t.co/XH7wUoAgnw",
                        "https://twitter.com/LeviTheGiant/status/1591821544556224512"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.401041666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jenn",
                    "index": "#54",
                    "likes": "1",
                    "time": "17/11/2022-01:36:31",
                    "content": "The current circulating supply says 635M per Coingecko, their supply increased significantly since Sept so the report is outdated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.958333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hannah_Pham",
                    "index": "#55",
                    "likes": "1",
                    "time": "17/11/2022-02:57:49",
                    "content": "Thank you. Do we have the latest GUSD reserves report? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#56",
                    "likes": "0",
                    "time": "17/11/2022-03:15:07",
                    "content": "Wonder what would happen if GUSD experienced heavy withdrawals or swaps during a weekend or banking holiday and since their collateral is held at MMFs and deposits at banks, wouldn’t they not be able to meet the demand for 2-3 days? I guess this is true for any USD stablecoin that holds collateral with TradFi. Crypto operates on a 24 hour / 7 day instant settlement while TradFi operates on a 1 - 2 day settlement period. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#57",
                    "likes": "0",
                    "time": "17/11/2022-14:54:41",
                    "content": "Honestly, if Maker does not get a credible bankruptcy analysis impact from any of these potential issuers, Maker should probably pass… If Maker would some type creditor in the entity’s bankruptcy process, it will not be able to obtain its funds for months as the bankruptcy court works out the complex situation.  Which could potentially create a DAI run ending Maker These investments would potentially destroy Maker if any of the counterparty entities went bankrupt as Makers huge investments would be then tied up in a bankruptcy process for a long time… Maker is putting its survival in the hands of these counterparties.  Is this wise? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.025
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#58",
                    "likes": "2",
                    "time": "17/11/2022-15:13:55",
                    "content": "I’m not sure how “MakerDAO” can expect to recover anything. No attorney can represent “MakerDAO.” As an unincorporated organization it does not have legal personhood and cannot join any kind of legal proceeding. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#59",
                    "likes": "4",
                    "time": "17/11/2022-15:29:16",
                    "content": "    Hannah_Pham:  Thank you. Do we have the latest GUSD reserves report?   Also @Jenn shouldn’t we be able to see the issuance on-chain? Can’t we do independent analysis here to get some additional color regarding the new GUSD in the PSM and track it back to the origin of circulating supply since September? There seems to be a consistent attitude among CU members (and Delegates frankly) who are commenting publicly that “GUSD is fine” and “not worried about Gemini” which is a completely irresponsible tone to take at a time like this. We hope our impression that the workforce is passively waiting for dominoes to fall is incorrect and that many are instead digging deeper into all the enormous questions and risks now on the table. And, importantly, are on the phone to their contacts at all potentially impacted MakerDAO counterparties, providers and partners for appropriate detailed information and responses. Anyone feel free to please advise where this is the case. Would appreciate a response here too:    MIP81 - Coinbase Institutional Rewards - Community Summary   Who has reached out to @CB_Institutional to discuss and get specific assurances? Anyone? If not, why not? There should be some transparency and communication here on the public forum. With an MKR holder approval to transfer over $1billion in USDC PSM assets to their custody and control these statements need further comment and direct engagement ASAP.   ",
                    "links": [
                        "https://forum.makerdao.com/t/a-meditation-on-controversy-the-gusd-vote/19519"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.050757575757576
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xbocaJ",
                    "index": "#60",
                    "likes": "0",
                    "time": "17/11/2022-19:27:50",
                    "content": "Unincorporated associations can sue and be sued. See FRCP 17(b)(3)(A):  a partnership or other unincorporated association with no such capacity under that state’s law may sue or be sued in its common name to enforce a substantive right existing under the United States Constitution or laws.  I think the point of friction is that most users on this forum would reject the assertion that MakerDAO is an unincorporated association. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.360714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#61",
                    "likes": "3",
                    "time": "17/11/2022-19:59:52",
                    "content": "I believe I referred to MakerDAO as an unincorporated “organization” and the point isn’t about whether someone can sue MakerDAO. The question is whether MakerDAO can have standing to be a claimant in a bankruptcy proceeding. How can MakerDAO participate in any recovery when it is not a legal person and cannot open a bank account to get paid? Off the cuff I would assume all assets of a bankrupt estate in a U.S. proceeding would be converted to U.S. dollars and paid out accordingly to those creditors whose claims have been reviewed and approved by the court. MakerDAO the unincorporated organization likely cannot be represented in court without some specific and novel governance action that a judge would have to accept. So, the thing for everyone to understand as far as bankruptcy goes…if it happens to a counterparty holding MakerDAO assets it is quite possible that none of the assets subject to an automatic stay have a mechanism to come back to the organization. Contracts or agreements the community may have in place among various legal entities to affect RWA deals and agreements with CeFi may be UNENFORCEABLE by MakerDAO/MKR holders in the event a counterparty to any of those agreements files for bankruptcy. It would certainly be in the interest of the debtor estate to argue that is the case. For internal risk management and planning purposes (regardless of what contracts say), if assets are not in a smart contract that Maker governance controls, those assets should be considered a total loss at the time of the relevant party’s bankruptcy filing. This is not legal advice. I am not a restructuring attorney. This is just some common sense informed by 2 plus decades front row seat TradFi legal career including LTCM, ENRON, AMARANTH Amaranth Advisors - Wikipedia, LEHMAN (where I was in-house counsel in 2008). Too much push back here when wisdom and experience tries to speak about things to take seriously and plan for. But really, it is an issue of MakerDAO focusing on legal & compliance risk overall, providing resources and otherwise signaling via an on-chain vote to guide CUs in making these kind of preparations a priority. ~ Kianga ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.283068783068783
                },
                {
                    "author_link": "https://forum.makerdao.com/u/elidco",
                    "index": "#62",
                    "likes": "2",
                    "time": "18/11/2022-01:15:40",
                    "content": "    ACREinvest:  MakerDAO the unincorporated organization likely cannot be represented in court without some specific and novel governance action that a judge would have to accept.   This is exactly right. This is why the appointment of a trustee to enforce the interests of Maker prior to any insolvency is so critical to the risk analysis.     ACREinvest:  For internal risk management and planning purposes (regardless of what contracts say), if assets are not in a smart contract that Maker governance controls, those assets should be considered a total loss at the time of the relevant party’s bankruptcy filing.   This is also exactly right. So long as Maker holds its interests in an on-chain vault then it is protected. If it needs to rely on third parties to enforce its interests off-chain then there is always a risk that the recovery is 0. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4752747252747245
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hannah_Pham",
                    "index": "#63",
                    "likes": "0",
                    "time": "23/11/2022-12:07:36",
                    "content": "Hi all, this is just a theory question, what would happen if GUSD loses its peg? The liquidation ratio is 100% for PSM so does it set off the liquidation mechanism with GUSD auctions? Will MRKs be minted to cover the loss? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#64",
                    "likes": "0",
                    "time": "24/11/2022-08:11:02",
                    "content": "It does not make sense to me that Maker holds 500m out of ~610m of the gusd supply.  If demand outside of Maker dries up, doesn’t this just become a low interest loan of 500m to Gemini that they use to buy short term treasuries?  I believe with such little gusd demand from other parties, this gusd psm has actually become illiquid and dependent on Gemini liquidating their treasury positions, hopefully not at a loss.  I’d rather throw this pile of money in our own treasury operations where we have better visibility and control.  I think this debt ceiling should be slowly reduced.  Give Gemini time to come up with the money now…but don’t get caught in a scenario where you need these psm funds quickly or where they are tempted to use these funds to address other debt issues (I truly hope we can trust this won’t happen). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.289930555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hannah_Pham",
                    "index": "#65",
                    "likes": "1",
                    "time": "26/11/2022-12:56:27",
                    "content": "I totally agree that 500m out of $610m supply is way to much risk for Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#66",
                    "likes": "1",
                    "time": "26/11/2022-16:50:57",
                    "content": "500/610 is too much risk for GUSD. What matters for Maker is 500/(DAI mcap). Also, if Gemini is willing to work as a conduit to Treasuries for Maker and is reliable I don’t see how that’s not a net diversification benefit for Maker. Agreed that the low GUSD mcap is a bad sign adoption wise but I don’t see a direct link to their reliability. We know all too well that lack of trust in the convertibility of a stablecoin is not a hindrance to its market cap. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.392857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/beardmars",
                    "index": "#67",
                    "likes": "2",
                    "time": "29/11/2022-17:41:21",
                    "content": "We post the previous months attestations within 30 days of month close. We’re working to shorten the length of time to post them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#68",
                    "likes": "1",
                    "time": "29/11/2022-17:44:52",
                    "content": "Decentralize proof of reserves and win market share. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#69",
                    "likes": "1",
                    "time": "06/12/2022-20:07:23",
                    "content": "Onchain analysis of the GUSD deposits to the GUSD-PSM reveals some interesting movements. Just 1 wallet was responsible for adding 460M GUSD to the PSM. You can track it here: https://etherscan.io/address/0x66e96e3784343d07147ffbe13bba1a8371dde623 Their wallet transaction history shows the following:  460M GUSD was withdrawn from Gemini exchange, in average transactions sizes of $15M GUSD. The GUSD was added to the GUSD PSM, and DAI withdrawn. The DAI was split between 3 new wallets, but the majority of the funds ended up in the following wallet (https://etherscan.io/address/0xef17d42a553eac729f3ec71ad2ba1f3fd22943e2) -This wallet then redeemed the USDC with Circle for fiat USD.  My questions is: who is the owner of this wallet? There was a discussion between MakerDAO & Gemini over who would supply the GUSD. However, this decision doesn’t appear to have been finalized based on the discussion in the proposal thread:    GUSD & MakerDAO Partnership Announcement Integrations       Could you confirm if this statement is accurate?  I’ve reviewed the onchain activity, and it paints another picture. (Please correct me if I’ve misinterpreted your statement)  One wallet was responsible for adding 460M GUSD to the PSM. You can track it here: (https://etherscan.io/address/0x66e96e3784343d07147ffbe13bba1a8371dde623)  Their wallet transaction history shows the following:   460M GUSD was withdrawn from Gemini exchange, in average transactions sizes of $15M GUSD. The GUSD was added t…     ",
                    "links": [
                        "https://etherscan.io/address/0xef17d42a553eac729f3ec71ad2ba1f3fd22943e2",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/72",
                        "https://etherscan.io/address/0x66e96e3784343d07147ffbe13bba1a8371dde623"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.175619834710744
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#70",
                    "likes": "2",
                    "time": "07/12/2022-08:53:42",
                    "content": "My thinking was that with 500m / 610m being in the psm, the psm just served as artificial demand for gusd.  I would guess the wallet belongs to Gemini and it’s how they basically took a low interest 1.2% loan from the MKR usdc psm (which is better than the 0% we were getting there). Basically, they supply magically created gusd in exchange for DAI which can be exchanged into fiat.  Why do this?  Because they can get 4% on treasuries and pocket the difference in rates.  Which is why I suggest just throwing this into our Monetalis operations instead.  You might call this diversification, but with no demand, I don’t see how it can be considered anything other than an extremely expensive route for treasury yields through the Gemini asset management team. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#71",
                    "likes": "0",
                    "time": "07/12/2022-12:24:13",
                    "content": "We should unwind GUSD. There’s no market for another centralized stablecoin. Yes, we earn a few %, but that will be very short lived and there are risks and expenses associated with holding/manipulating GUSD. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#72",
                    "likes": "3",
                    "time": "07/12/2022-16:05:51",
                    "content": "Could you confirm if this statement is accurate? I’ve reviewed the onchain activity, and it paints another picture. (Please correct me if I’ve misinterpreted your statement) One wallet was responsible for adding 460M GUSD to the PSM. You can track it here: (https://etherscan.io/address/0x66e96e3784343d07147ffbe13bba1a8371dde623) Their wallet transaction history shows the following:  460M GUSD was withdrawn from Gemini exchange, in average transactions sizes of $15M GUSD. The GUSD was added to the GUSD PSM, and DAI withdrawn. The DAI was split between 3 new wallets, but the majority of the funds ended up in the following wallet (https://etherscan.io/address/0xef17d42a553eac729f3ec71ad2ba1f3fd22943e2)) -This wallet then redeemed the USDC with Circle for fiat USD.  Who is the market maker / wallet owner?? The reason I ask is that there was discussion about who should supply the GUSD, but no final decision was announced. Gemini stated: “Maker will have to onboard and KYC an entity to create an account with Gemini that can be credited, and that can then move the GUSD back to the protocol as instructed by Maker Governance” A suggestion was made: “Is it possible for Gemini to send the marketing incentive directly to the PSM address without needing to onboard a representative company and have any manual intervention?” Gemini representative responded: “This is a great suggestion. Our goal is to establish a due diligence process for the allocation of these funds working with Maker and the PSM. We are open to working with Maker to find the best path towards achieving that diligence and are aligned in finding an approach that improves decentralization while staying compliant.” Now an unknown market maker / wallet has supplied 460M GUSD to the PSM, withdrawn DAI, converted that to USDC, moved the USDC to 3 new wallets, and redeeemed the majority of USDC for fiat USD via circle. In light of the Gemini Earn freezing withdrawals, its imperative that MakerDAO understand the source of the GUSD in the PSM, as this now makes MakerDAO the largest holder of GUSDm with over 80% of the GUSD supply in the PSM. ",
                    "links": [
                        "https://etherscan.io/address/0xef17d42a553eac729f3ec71ad2ba1f3fd22943e2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5688131313131315
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hannah_Pham",
                    "index": "#73",
                    "likes": "2",
                    "time": "08/12/2022-02:25:36",
                    "content": "Totally agree. We should unwind the GUSD vault. Massive concentration risk from that much GUSD and the return is immaterial compared to the risk. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#74",
                    "likes": "1",
                    "time": "08/12/2022-13:51:30",
                    "content": "I put my question about the source of the GUSD to “Asset-Liability Management for MakerDAO”, who was promoting the recent revenue increase for MakerDAO, which included GUSD rewards. His response was: “Don’t Know, Don’t Care”. Not a response that inspires confidence :-/ (Source: https://twitter.com/SebVentures/status/1600594131276992523) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#75",
                    "likes": "8",
                    "time": "08/12/2022-14:04:05",
                    "content": "That’s because it really doesn’t matter who is putting the GUSD into the PSM. The risk is identical either way. The assumption was that Gemini would hire someone to do it, as it benefits them most for it to be full. I’m not Seb, but I strongly suspect ‘Don’t know, don’t care’ is because it’s exactly what we expected to happen when we increased the debt ceiling and the tout, and it doesn’t matter. Like it basically comes down to:  It appears highly likely that GUSD is fully backed and is unaffected by Gemini Earn. If it turns out that’s not true, then we’re probably screwed (depending on the details.)  (This shouldn’t really be news to anyone. The GUSD is backing DAI, if the GUSD is worthless then it impacts Maker and DAI Holders.) Like, you’re writing about this flow of funds:  USD - > GUSD - > DAI → USDC - > back to USD and repeat  As if it’s some smoking gun that proves something nefarious. Whereas it’s exactly what everyone expected to happen, as it’s the logical path for Gemini or their agents to fill the GUSD PSM. Which was the whole point of the deal in the first place. Maker gets yield on PSM DAI, Gemini gets the difference between Maker’s yield and whatever they can safely get from the traditional banking system. Is all this a good idea? Depends on whether GUSD is worthless or not. (And on the more general point as to whether centralized stables are safe for Maker to hold in general.) Edit: Ak, reading through that twitter thread, people have already told you this, you’re just not listening, and are confused on the details. So eh. TL;DR: PSM is 100% not 101% collateralized. The 101% you’re referencing is referring to GUSD-A, which is a separate (and now closed) vault. The only cost to filling the PSM are the transaction fees, but I consider it highly likely that Gemini are paying a market maker to do it, as there is no direct profit incentive. But again, this was more or less what we expected, and it really doesn’t matter either way how it gets full. The risk is the same. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.465277777777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#76",
                    "likes": "3",
                    "time": "08/12/2022-14:31:36",
                    "content": "You are missing the point that if Gemini is going to go to these lengths to use MakerDAO to essentially create +$400m USD out of thin air for their use, why is that? For such a “Regulated” firm, how DID they get comfortable without a centralized entity that could be cleared for AML/KYC purposes? @tylerwinklevoss “Don’t know, Don’t care.” Should NEVER be uttered by anyone in a position of trust and authority regarding this protocol @SebVentures. This is a brash and arrogant repudiation of responsibility. Let’s consider why we should care and why an entire industry may depend on the degree to which we do care and risk manage and anticipate and assess things that don’t make sense and serve as early warning signs that something may be amiss. @Growth-Core-Unit @strat-fin-core-unit @LongForWisdom you hypothesize that Gemini may be using the funds to buy treasuries and obtain a return on the spread they are paying Maker (paying in their own created currency, NOT an actual share of the USD they might be earning in such a scheme). If this is true, that should concern everyone as to why one of the most regulated and trusted centralized providers of market infrastructure comes to MakerDAO to finance their business operation OR to decide they are doing proprietary trading with magic money to generate income. Where have we SEEN this recently? Are there any downstream problems we might further be able to anticipate? If GUSD implodes, would that be a problem for MakerDAO and the holders of DAI? If so, is it appropriate or is it scandalous to say well, “we don’t care because we will be out of a job anyway” or “our bags will be worthless, so we don’t care”? So, we see the community saying with their explicit comments or their silence, that insiders here will take all kinds of risks and neglect responsibilities because same insiders win big if it all works out. If it doesn’t work out, others pay much more of a share of the costs. And that’s totes fine with all of us here. “Heads I win, Tails you loose.” Such a culture and attitude is what brought the world to its knees in 2008 at the hands of the cENtraliZEd instituoooosuns people rail against and thinking they are better. Thank you @Cryptohippo65 for your concern and persistence in asking probing questions. If we can have more of this from more people, maybe the true benefits of DeFi as a more accountable, transparent, resilient, accessible and anti-fragile financial system for the world can emerge. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.973534798534798
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#77",
                    "likes": "5",
                    "time": "08/12/2022-15:23:59",
                    "content": "    ACREinvest:  If so, is it appropriate or is it scandalous to say well, “we don’t care because we will be out of a job anyway” or “our bags will be worthless, so we don’t care”?   My read of that response is that it was to ‘who is the market maker supplying Maker with GUSD?’ and frankly, it would also be my response to that question (though likely I’d phrase it more specifically). I don’t know who the market maker is, and I don’t care who it is because it doesn’t matter. The identity of that entity and the incentives applied to that entity do not affect the risk Maker is taking with GUSD, the risk came with the increase of ceiling and implementation of tout, not with the entity filling the PSM.     ACREinvest:  Thank you @Cryptohippo65 for your concern and persistence in asking probing questions.   I don’t believe it is productive to thank an individual that has not taken the time to fully inform themselves of what is happening and that is repeatedly implying that foul play is involved. The individual thought the market maker was losing money because the CR of the PSM was 101%. They are not operating with correct information, and when pointed out that their information is incorrect, they double down rather than modifying their position. Further, thinking that a PSM operates with a 101% ratio represents a fundamental misunderstanding of what it is and what it’s for. This should bother good faith opponents to the GUSD PSM as well, because this user is arguing against it from a nonsensical position that is trivially refuted. Like the position good faith opponents should be taking is similar to what I’m saying ''It doesn’t matter who the market maker is.\" Then following it up with “But the actual problem with this is x, y and z.” I’m fully on board with asking whether the GUSD PSM represents a good deal for Maker. It’s totally fair to believe that it’s a risk that MakerDAO should not be taking. What I’m not on board with is people implying foul play based on their own misunderstandings. I’m not complaining or arguing against Bit or Hannah_Pham or Traster or you for thinking this is too much risk, it’s a legitimate position. You mentioned I’m missing the point. But @Cryptohippo65 isn’t making the point you’re making. They’re (repeatedly) implying bad faith from a logically inconsistent position. I’m answering that position.     ACREinvest:  If we can have more of this from more people, maybe the true benefits of DeFi as a more accountable, transparent, resilient, accessible and anti-fragile financial system for the world can emerge.   We don’t want bad faith accusations from badly informed positions, that’s more or less the definition of trolling. We want good faith arguments from well-informed positions or at the least, good faith arguments from badly informed positions.  There’s other points I kind of want to address in your post, but eh, this is already long and it’s arguably off-topic. If you want to have a more thorough debate about the more general responsibility of MKR Holders and core unit folks to DAI holders, it should maybe happen elsewhere. Though to be honest, we’ll probably find that we agree on a lot of it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.789021164021165
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#78",
                    "likes": "3",
                    "time": "08/12/2022-15:31:16",
                    "content": "When the facts change we change with them. Gemini was not working with an insolvent entity (i.e. Genesis) when this proposal was raised and now they are. So we should off-board them until such a time that we can be sure GUSD is worth 100 cents on the dollar. Maybe with a decentralized proof of reserves. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#79",
                    "likes": "0",
                    "time": "08/12/2022-15:55:38",
                    "content": "“I don’t believe it is productive to thank an individual that has not taken the time to fully inform themselves of what is happening and that is repeatedly implying that foul play is involved. The individual thought the market maker was losing money because the CR of the PSM was 101%. They are not operating with correct information, and when pointed out that their information is incorrect, they double down rather than modifying their position. Further, thinking that a PSM operates with a 101% ratio represents a fundamental misunderstanding of what it is and what it’s for.” Your statement is factually incorrect. You are focussing on only one point, that I made in error and have now corrected, in order to discredit my legitimate question. However, I’ll happily address that point so that we can continue with the actual conversation. I did indeed first think the collateralization rate for the PSM was 101%, but I was mistakeningly referring to the GUSD vault. Once I was made aware of this mistake, I edited from my original post, and I made the correction on Twitter. I did not, and am not, doubling down on that point. You are making a false statements about what I have done, in order to discredit a legitimate question that is being asked. \" What I’m not on board with is people implying foul play based on their own misunderstandings.\" I am not implying foul play on either MakerDAO’s or Gemini’s part. A deal was made, but one critical part of the deal, was never made public. There was a debate over who would supply the GUSD, Gemini or MakerDAO. The final decision was never disclosed. Again, please do not imply false intent, to a legitimate question. \" My read of that response is that it was to ‘who is the market maker supplying Maker with GUSD?’ and frankly, it would also be my response to that question (though likely I’d phrase it more specifically). I don’t know who the market maker is, and I don’t care who it is because it doesn’t matter. The identity of that entity and the incentives applied to that entity do not affect the risk Maker is taking with GUSD, the risk came with the increase of ceiling and implementation of tout, not with the entity filling the PSM.\" The identity of the unknown wallet who supplied over 90% of the GUSD to the PSM is important in the bigger picture, and its concerning you don’t recognize this. MakerDAO has become the largest holder of GUSD. Blackswan events happen in crypto. In the unlikely event that Gemini went bankrupt due to a blackswan event, MakerDAO could be left with bad debt. This point can be true, without implying any foul play. I didn’t think it would be this difficult to get an answer about a simple question. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0814814814814815
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#80",
                    "likes": "3",
                    "time": "08/12/2022-16:12:16",
                    "content": "    Cryptohippo65:  I am not implying foul play on either MakerDAO’s or Gemini’s part.   Respectfully, that is what it looks like when you start posts with  Could you confirm if this statement you made is accurate?  And then spend the entire post implying that the statement is inaccurate. And, continually repeat a question the answer of which has no bearing on what’s going on. But alright. I’ve misinterpreted you, and I apologize for those statements. I’ll try again to explain why the question is irrelevant, and why no one really seems able to give you a satisfying answer.     Cryptohippo65:  In the unlikely event that Gemini went bankrupt due to a blackswan event, MakerDAO could be left with bad debt.   This is absolutely correct, no arguments.     Cryptohippo65:  The identity of the unknown wallet who supplied over 90% of the GUSD to the PSM is important in the bigger picture   This is incorrect, at least from the perspective of the protocol and DAI users. The reason it’s unimportant is that this risk came into existence the moment (technically 48 hours after the moment) that MKR Holders voted to increase the maximum debt ceiling of the GUSD PSM, at that point, Maker was immediately exposed to GUSD insolvency even before any GUSD entered the PSM. The reason for this is that Maker has a 48 hour delay before it is able to set the debt ceiling to zero. If in a hypothetical, Maker held no GUSD in the PSM, and GUSD was declared insolvent, the PSM would fill over those 48 hours as users traded the insolvent GUSD for (initially) solvent DAI.     Cryptohippo65:  I didn’t think it would be this difficult to get an answer about a simple question.   Respectfully, I think you’ve got an answer, and don’t like it. I think multiple people have now essentially expressed the same answer to you: “We don’t know, and it doesn’t matter.” Additionally, when pushed people have added: “It’s more than likely Gemini, or one of their agents, because they have the largest incentive.” Maker-as-a-DAO had nothing to do with it, we would have had to transfer funds to a market maker via vote, which provably hasn’t occurred. Someone within Maker might have contracted a market maker privately to make the transactions, but they would have had to either:  Pay out of pocket (they wouldn’t directly receive any benefit. So seems unlikely.) Pay using a budget granted by the DAO (this one is possible, I’d like to think the CU in question would have mentioned it if that was the case, but eh, maybe not.)  Of the two entities that directly benefit from the PSM being full (Maker and Gemini):  Maker-as-a-DAO provably hasn’t done it (transfers of value out of the DAO are voted on and are visible onchain.) Leaving Gemini.  But again, and I can’t stress this enough. It really, really doesn’t matter to DAI holders who filled it up, or whether it’s even full. It only matters that it’s available to be filled. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.350609756097561
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#81",
                    "likes": "2",
                    "time": "08/12/2022-16:56:48",
                    "content": " “Respectfully, I think you’ve got an answer, and don’t like it. I think multiple people have now essentially expressed the same answer to you: “We don’t know, and it doesn’t matter.” Additionally, when pushed people have added: “It’s more than likely Gemini, or one of their agents, because they have the largest incentive.””  You first said you misinterprested me, and apologize for those statements. -Thank you, and I’ll gladly accept the apology! It’s hard to discern intent through messages, and I can understand you wanting to defend MakerDAO. Maybe just ask next time what my intent is. If I say “to take down MakerDAO!!” then yeah, I’d go after me too ha! However, after that, you go own to say that I have already been answered multiple times, and don’t like the answer. “We don’t know, and it doesn’t matter.” is not an answer, it’s a dismissal of the question. If you said something along the lines of “we honestly don’t know, here’s where you might go to find out” that would be a different story, as you’d actually be saying MakerDAO doesn’t know. Which by default, would confirm it wasn’t MakerDAO. You then said people have also answered “It’s more than likely Gemini, or one of their agents, because they have the largest incentive.” Again, that’s not an answer, that’s an educated guess. The movement of $500 million dollars deserves a legitimate answer. Now having addressed all of the above, I will also thank you for actually giving me an actual answer!!  Maker-as-a-DAO had nothing to do with it, we would have had to transfer funds to a market maker via vote, which provably hasn’t occurred.  That’s all I was looking for. MakerDAO didn’t deposit the GUSD (excluding the possibility that someone in MakerDAO acting privately as you stated).  My follow up question is was a contract signed between Gemini & MakerDAO, which include a section on who would supply the GUSD? If so, who was outlined as the party who would supply the GUSD?  I expect that you will not disclose that information, as is your right to do with a private contract. But I thought it relevant to at least ask to close out this discussion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.623190402704291
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#82",
                    "likes": "4",
                    "time": "08/12/2022-17:13:39",
                    "content": "    Cryptohippo65:  That’s all I was looking for. MakerDAO didn’t deposit the GUSD   My apologies. I assumed you’d already confirmed that yourself. That’s kind of why I was assuming bad faith, in order for funds to leave the protocol it has to pass an on-chain vote. I had assumed this was common knowledge.     Cryptohippo65:  My follow up question is was a contract signed between Gemini & MakerDAO, which include a section on who would supply the GUSD? If so, who was outlined as the party who would supply the GUSD?   This one’s easy. MakerDAO isn’t a legal entity (at least not a organized or structured one), it can’t sign contracts. The best it can do is vote to do some set of things. I don’t believe there was an explicit vote (they are public, I just can’t be bothered to go though them) on the Gemini deal, though indirectly the vote including the increase of the debt ceiling could be interpreted as implicit agreement to such. An entity or actor paid by the DAO in a general capacity could have made a contract with Gemini for this specific thing which included such clauses, but I’ve no idea if that happened. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.532051282051283
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#83",
                    "likes": "1",
                    "time": "08/12/2022-17:21:55",
                    "content": " My apologies. I assumed you’d already confirmed that yourself. That’s kind of why I was assuming bad faith, in order for funds to leave the protocol it has to pass an on-chain vote. I had assumed this was common knowledge.  No, I couldn’t find a definitive answer so I appreciate your resolving this for me!  This one’s easy. MakerDAO isn’t a legal entity (at least not a organized or structured one), it can’t sign contracts. The best it can do is vote to do some set of things. I don’t believe there was an explicit vote (they are public, I just can’t be bothered to go though them) on the Gemini deal, though indirectly the vote including the increase of the debt ceiling could be interpreted as implicit agreement to such.  “Can’t be bother to go through them” Haha, that’s fair enough! You’ve pointed me in the direction to look, which is what I was looking for. I’ll go look through the votes to see if they outlined it there. Thanks again for the help! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8601190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#84",
                    "likes": "3",
                    "time": "08/12/2022-19:18:18",
                    "content": "So there’s a lot of back and forth here but @Cryptohippo65 did do a lot of digging and I appreciate the attention and insight we get through these threads.  There’s no way to definitively know exactly what’s going on but at least there’s an understanding of what we suspect and thereby what that suspicion implies in terms of the risk we face. When this deal was announced, gusd’s supply was a bit north of 300 million.  It had been growing slowly and seemed to have an upward trajectory.  As the MKR gusd psm debt ceiling grew, you can see gusd’s supply growing accordingly until it reaches somewhere north of 800 million.  The correlation here is pretty evident.  On November 16, Gemini suspended withdrawals from its Gemini earn program.  Gusd supply drops about 200 million over the next few days leaving MKR’s psm holding a large percentage of what remains.  Obviously there was a huge reputational hit and loss in trust and many gusd holders traded in their gusd for something they trusted more. What bothers me is that MKR hasn’t repriced this deal after the Gemini earn suspension.  The debt ceiling hasn’t been reduced and the rate has not been renegotiated.  Granted, it hasn’t been that long.  But there just wasn’t much discussion (at least publicly).  I won’t argue for completely terminating the partnership but I think based on recent events, the debt ceiling should be significantly reduced and the rate renegotiated.  I truly hope Gemini can recover and rebuild their reputation.  I understand that would be better for everyone.  However, to me, the suspension of Gemini earn means they don’t have a big enough buffer of liquid assets to comfortably cover a large withdrawal event and that makes me extremely uncomfortable with how big the gusd psm is. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.463624338624339
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#85",
                    "likes": "4",
                    "time": "08/12/2022-19:33:03",
                    "content": "Gemini is now providing daily (non-audited) composition of the GUSD reserves.  We also made a GUSD monitoring dashboard. What suspicion that are increasing the risk are we discussing? And why is that not extended to USDC and USDP where any decrease in GUSD would lead. Decreasing the DC would probably not have any meaningful impact in itself. ",
                    "links": [
                        "https://dune.com/stratfi/makerdao-gusd"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#86",
                    "likes": "2",
                    "time": "08/12/2022-20:21:19",
                    "content": "Because at least there’s demand for those stablecoins outside of that which is created by MKR’s PSM.  If you tell me you want to draw down the USDC PSM’s debt ceiling at any point in time, I feel confident I can go and get a 1 dollar USDC value from others who are willing to hold USDC.  I feel confident because I know there’s 40 billion out there held by many others who trust Circle more than Paxos or Gemini.  You are right USDP is not much better but at least there’s some money out there backing it that doesn’t come from MKR.  At this point with GUSD, you’re basically dependent on going to Gemini directly for your money when you need or want it. At the end of the day, the question is how much you continue to trust Gemini.  But whether you do or not, you do have to acknowledge that 200 million out of the 300 million non MKR sourced backing behind GUSD disappeared after the Nov 16.  That happened because those who were behind that money decided there was a better place to put their money and it was seemingly triggered by this announcement.  To me, that’s the market telling you there is increased risk to this holding.  You are right that if Gemini is true to their word and those GUSD reserves held in treasuries and banks, are kept separate, everything should be fine.  The question is if other areas of Gemini are insolvent, would these reserves be needed to cover other liabilities.  Anyway, even if we decide to help them out and keep the debt ceiling high, shouldn’t we get a little bit more than 1.2% when treasury rates are so high?  Once Coinbase starts giving MKR yield on USDC, this question will become even more relevant. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7157480893592005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#87",
                    "likes": "18",
                    "time": "08/12/2022-21:54:50",
                    "content": "Commenting in a personal capacity: I believe GUSD does not face any significant insolvency risk, regardless of issues with Gemini Earn caused by collapse of Genesis. Some ppl have insinuated there is a link but there is no evidence to support this, and in fact it has always been made crystal clear in Gemini ToS that Earn program was linked to Genesis and faced risk related to their lending activities. People are understandably shook up after FTX turned out to be a fraud but I don’t think there is any evidence to suggest Gemini has similar operational lapses (vs ample evidence of impropriety from FTX, such as web offshore registrations, wire/bank transfers routing through Alameda, well established conflicts of interest between FTX exchange and Alameda market making service, SBF generally being an extremely sus character, etc). Who filled up GUSD PSM is a non-sequitur. We can safely assume it was someone related to Gemini because they have financial incentives to increase GUSD in circulation due to interest rate spread. But from a risk perspective I don’t think it matters. I think GUSD still provides significant benefits vs routing all of our capital into Monetalis tbill strategies. Gemini has a long history of honoring all requested USD redemptions promptly, whereas Monetalis has essentially no track record at all, having never faced redemption demands so they have never had opportunity to prove they can honor the same. Further, while a majority of GUSD is held currently by Maker’s PSM, there are significant and diverse coinvestors, which offers a high degree of protection versus centralization risk factors. And a final point, GUSD’s effective duration is very short (conceivably it should be possible to redeem 100s of millions of GUSD within days), where Monetalis redemptions could take considerably longer due to operational processes. If DAI faced a significant demand deficit, GUSD could help provide immediate support to the peg, while Monetalis allocations would probably only help after weeks or months. I’d like to see Gemini offer a higher revenue share over time, but I think at present the risk/reward for allocating to GUSD still makes sense given available alternatives. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.563970588235295
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#88",
                    "likes": "2",
                    "time": "09/12/2022-22:26:45",
                    "content": "Okay, appreciate the thorough response.  You address pretty much everything, make some good points and your position is clear.  I still think there’s a higher risk of insolvency than presented but judging by the amount of likes, it sounds like many who are involved also hold to the same position.  I actually very much appreciate anything that generates income like the GUSD psm so I sincerely hope you are right. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.611688311688312
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#89",
                    "likes": "3",
                    "time": "12/12/2022-00:29:40",
                    "content": "Monet-supply makes very good points, and I also agree with many of the points made! One point that I think that would be interesting to explore is the level of severity that is being given to the counterparty risk associated with Gemini. To begin with, this counterparty risk would apply to any business that provides funds to MakerDAO, and the points I’m about to make a solely to benefit MakerDAO, and is not a comment on Gemini’s reputation, which I have no reason to doubt. Counterparty Risk Counterparty risk is a legitimate risk in any business transaction. Members have stated that they trust Gemini, and therefore consider this risk low. Members also acknowledge that if Gemini weren’t able to meet their redemption obligations, then MakerDAO would stand to lose $500 million. Given the large sum of money involved, it would be massively beneficial if MakerDAO were able to quantify the level of counterparty risk. I would like to put forward, that MakerDAO is in a strong position to determine this. Actionable solutions Members consider the Gemini’s counterparty risk low, so for discussion sake, let’s say the risk of Gemini being unable to honour GUSD redemptions at 1%. Scenario 1: continue with the current GUSD PSM agreement, but ask for more interest. MakerDAO will receive more profit, but the counterparty risk remains the same. Outcome: A few percentage profit gains, with a 1% counterparty risk of losing 100% of the $500M. (were Gemini not be able to meet their redemptions, due to a blackswan event) Scenario 2: Redeem the 500M GUSD when the GUSD duration ends, and increase the GUSD PSM limit to 1 Billion if all redemptions are met. “Gemini has a long history of honoring all requested USD redemptions promptly”. This is true in relation to past redemptions for smaller smaller amounts, and at a much lower marketcap. The MakerDAO PSM contains over 80% of the GUSD supply, and this level or redemption has never been tested, which presents a new level of risk. Past redemptions are a good indication, but do not provide sufficient info to determine the risk of redemptions of such a large scale. Since this has never been tested, the counterparty risk is truly unknown. MakerDAO can actually benefit from this tremendously. MakerDAO could negiotate with Gemini to actually increase the amount of GUSD in the PSM, to earn even more interest. But before increasing the limit, MakerDAO would like to consolidate its position given the current liquidity crisis spreading throughout the crypto market. The contagion in the crypto market is still spreading, and with liquidity drying up, it is reasonable to reassess all partnerships and protect MakerDAO’s capital reserves. If Gemini can redeem all the GUSD, MakerDAO has just confirmed that Gemini can meet their redemption obligations at any level. Benefit 1: MakerDAO has now reduced their counterparty risk to negligible. Benefit 2: Increase the GUSD PSM to 1 billion, and earn even more interest. If Gemini can’t redeem the GUSD, MakerDAO will need to revise their risk management analysis for future projects. From a purely business standpoint, this is a win-win for MakerDAO. This confirms MakerDAO’s level of risk. If redemptions are met, MakerDAO can now safely increase its GUSD PSM, and earn even more interest. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.006653267367553
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ekryski",
                    "index": "#90",
                    "likes": "1",
                    "time": "17/12/2022-22:37:40",
                    "content": "    LongForWisdom:  I don’t know who the market maker is, and I don’t care who it is because it doesn’t matter.   Not to be pedantic but on the whole it does matter from an AML risk perspective. Especially at that size. If funds were frozen due to AML/CTF or BSA breach it’s a problem. In this particular case, since funds come from Gemini, which is highly reputable and has robust AML policies (I know because I went through them), I do not believe it to be a risk here. This comment is more to inform future discussions around risk.  My personal view is in alignment with most others that are pro-GUSD support here. While there are certainly redemption, concentration and bankruptcy risks here, all things considered, this is still by far the lowest risk RWA deal that Maker has, by a lot! At least GUSD is a proper NYFDS regulated Trust setup (unlike with USDC). It’s very fair to assume redemption of all the GUSD would be fine unless Gemini or the underlying fiat custody banks themselves went bankrupt. I’m glad people are discussing this! Hoping it will help the industry mature.  For the sake of clarity, while I’ve been critical of the Coinbase deal. I have no affiliation to any party, nor benefit from any of these deals success or failure.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9539880952380955
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ekryski",
                    "index": "#91",
                    "likes": "3",
                    "time": "17/12/2022-22:49:07",
                    "content": "Another reason to ask about source of funds would be to alleviate the risk that it’s resulting from credit. For example if the ~$500M USD to mint the GUSD was credit, if the underwriting process is no good and the loan is under water, that credit could potentially be clawed back under certain scenarios (ie. if it was FTX or Alameda, not saying it is). I assume that would just result in an unwinding in reverse order of DAI → GUSD PSM → Gemini → USD, but if the fiat was clawed back (which is what a creditor cares about) and the DAI isn’t burned (for whatever reason) then you end up with DAI being unbacked and since you can’t freeze DAI, that’s a problem. So, it would be good to verify that all the GUSD - USD numbers line up and get confirmation from Gemini that the source of funds for the USD backing the GUSD that went into the PSM is not from credit in any way. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.470238095238096
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#92",
                    "likes": "5",
                    "time": "19/12/2022-16:36:11",
                    "content": "I can acknowledge that “Don’t know, Don’t care” is an ethos with its origin in the cypherpunk values that made all of this possible. For a permissionless, anon, autonomous system to be effectively designed and scaled, it makes sense to hold as a kind of world view. The crux of the crossroad where we find ourselves today is nothing less than a clash of civilizations. Or, civilization vs barbarism. Or, order vs chaos. Or, Rule of Law vs Lawlessness. You pick which side is which. There will be a reckoning in the form of outcomes. In the meantime, it seems fair that everyone agrees the scale of this project and integration with the “Real World” introduces elements inconsistent with the tenants of DeFi iconoclasm. There seems to be a reluctance to admit this. Community members want all the benefits and all the inflows that Rule of Law and centralization provides them. But at the same time want to deny they have any responsibility to concern themselves with laws or real world information necessary to properly manage risks. Stewardship, integrity and honor are old fashioned values. They have done a lot for creating stability, prosperity, wealth and health for nations, societies and communities. Adopting an expansive sense of duty and responsibility also goes a long way to build and sustain trust. Ah, trust… ! For a community so hard-core about trustlessness, there is a bizarre almost pavlovian trust response regarding certain centralized players who are the exact model of what the same people are rebelling against. It’s weird and a recipe for disaster. When we need to uphold the ethos of “Don’t Trust, Verify” the most - which is now with respect to all the centralized counterparties and humans - some of our most crypto native OG people don’t want to do the work. ~ Kianga ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.983779761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#93",
                    "likes": "1",
                    "time": "19/12/2022-17:17:45",
                    "content": "    ACREinvest:  Community members want all the benefits and all the inflows that Rule of Law and centralization provides them.   Further to this point, it’s time to raise the level of respect for the United States of America and the people who were here and came here from all over the world during the last half a millennium - willingly and unwillingly. If you have any wealth or status tied to MakerDAO, at this point it rests very much so on the “full faith and credit of the United States” derived from the blood, sweat and tears of many countless millions. This is an empirical fact due in no small part to the controversial reliance of DAI and the project on USDC since 2020. Add to that the venture capital from United States firms that has flowed to this project since the earliest days. Add to that the other large U.S. based buyers of MKR who continue to sustain everything going on here by holding. What supports all this? At the end of the day is it not the every day people who work and suffer here? We are composed of newcomers and ancestors of the downtrodden and oppressed that many of us in “crypto” hope to serve by being in this industry. So while it is fashionable to bash the U.S., its law makers and agencies, we have what we have here because of a history that has its points of pride. And no matter our views on its ills and what should change in the future, it is appropriate to take a step back and acknowledge the shoulders we all are standing on. If I am wrong, this project should immediately cancel all partnerships, repurchase MKR tokens, cease cooperation and integration with Coinbase, Gemini, BlockTower, a16z, USDC just for starters. If no, you don’t want to do that? Then it’s time to raise our level of discourse and commitment to engage proactively and constructively with the structure in which we find ourselves. Thank you for coming to my TedTalk! ~ Kianga ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.607268170426066
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smartcontracts",
                    "index": "#94",
                    "likes": "1",
                    "time": "19/12/2022-17:45:04",
                    "content": "All valid points and nicely articulated.  Almost all of MakerDAO’s current efforts have been to exploit or arbitrage the “basis trade” you’re identifying. As an oversimplification, MakerDAO’s assets benefit from all of the legal and regulatory protections a TradFi firm enjoys, but at the same MakerDAO’s liabilities are limited to DeFi, allowing us to escape the costs and burdens of regulations, compliance, etc. - for sure a positive basis trade if it continues to work. We get the benefit of regulation and insurance at GUSD, but we can affirmatively escape the costs and obligations a typical holder would incur. Is this the crux of both the RWA expansion and the End Game? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.585989767807949
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#95",
                    "likes": "2",
                    "time": "19/12/2022-20:02:19",
                    "content": "No, this is part of setting up a system like Bretton-Woods, such that those holding any of these stablecoins can exchange for the other if a holder gets nervous, reducing nervousness in the first place and allowing for very precise tracking of valuation to the U.S. Dollar. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8062499999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#96",
                    "likes": "15",
                    "time": "21/12/2022-16:39:43",
                    "content": "Hello, This is to record that Gemini have made their first transaction for the month of November: https://etherscan.io/tx/0x4e34e0bd376d7c42ca1150156e7ae09fb4a0fc759504cd67078d6fb08d84ab55 https://etherscan.io/tx/0x1f2568459121627a7529392788b835bce91678eb9d3787f087ea7afb4af76c53 and 480,406 DAI have been added to the Surplus Buffer as a result. Thank you to @tylerwinklevoss and @beardmars for the ongoing marketing partnership! Look forward to more collaboration in the new year. Happy holidays everyone ",
                    "links": [
                        "https://etherscan.io/tx/0x1f2568459121627a7529392788b835bce91678eb9d3787f087ea7afb4af76c53"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.186079545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#97",
                    "likes": "1",
                    "time": "21/12/2022-19:35:01",
                    "content": "There is still time to protect MakerDAO’s capital. This forum seems devoted to validating an original investment decision (that made sense at the time), and protecting Gemini, rather than protecting MakerDAO. You can still reinvest GUSD into the MakerDAO PSM at a later point, but the market conditions have completely changed. We are in a bear market with unknown contagions spreading throughout the market. I urge you to reconsider and protect MakerDAO’s capital.  Gemini-Dollar-price-today-GUSD-to-USD-live-marketcap-and-chart-CoinMarketCap1097×1279 144 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#98",
                    "likes": "2",
                    "time": "21/12/2022-20:26:31",
                    "content": "The chart is very interesting. Last week Forbes shared a perspective on some of the issues we have been discussing here, and was able to get a response from Gemini on one of your questions: “Natalie Rix, head of communication for Gemini, said in an emailed statement to Forbes : “Gemini did not put $500m of GUSD into theMakerDAO protocol,” that “third-party market participants moved quickly” to reach the $500 million limit, and that all GUSD stablecoins are backed one-to-one with U.S. dollars. Gemini did not respond to questions about whether the wallet in question is controlled by the Winklevoss twins or by a third-party entity affiliated with Gemini.”    Forbes    Crypto Exchange Gemini Modifies Terms Of Service As Gemini Dollar, Its Own... The Winklevoss twins’ crypto exchange drew investors to its dollar-pegged stablecoin GUSD by promising tantalizing rates of return. Now those funds are frozen, and demand for Gemini Dollars is plunging.      ",
                    "links": [
                        "https://www.forbes.com/sites/johnhyatt/2022/12/16/crypto-exchange-gemini-modifies-terms-and-services-as-gemini-dollar-its-own-stablecoin-gets-caught-in-market-contagion/?sh=303cb3e71c58"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.902777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#99",
                    "likes": "0",
                    "time": "21/12/2022-21:20:49",
                    "content": "Terra/LUNA redux. The upside does not make sense given the downside. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#100",
                    "likes": "3",
                    "time": "21/12/2022-21:29:01",
                    "content": "Here is what Gemini says supports their GUSD: Its not clear that deposits held at Silvergate Bank are that safe… Each GUSD corresponds to a U.S. dollar that is held by Gemini as one of the following types of assets: (1) deposits in U.S. Federal Deposit Insurance Corporation (“FDIC”)-insured banks, (2) money market funds, invested only in U.S. Treasury Obligations, or (3) U.S. Treasury Obligations. The U.S. dollar cash portion of these GUSD reserves, which may be held at Silvergate Bank, State Street Bank and Trust Company or Signature Bank, may be eligible for FDIC “pass through” insurance for Gemini customers in the event that the bank holding such U.S. dollar cash deposits becomes subject to resolution or similar proceedings by the FDIC. Silvergate is rated BB - which is not investment grade. Here is Silvergate’s stock performance year to date:  image1108×702 49.2 KB  This is not a great look either: Dec 20, 2022 at 3:45 pm ET  Silvergate Reviewing FTX-Alameda Transactions By David Benoit  Alan Lane, Silvergate CEO, replied to three senatorsSANDY HUFFAKER FOR THE WALL STREET JOURNAL Silvergate Capital Corp. is reviewing transactions between Sam Bankman-Fried’s crypto exchange FTX and his investment firm Alameda Research, the bank told three U.S. senators. Transactions between those entities have become a focal point for investigators trying to figure out FTX’s collapse last month. Prosecutors and regulators charged Mr. Bankman-Fried with fraud, saying he used FTX customer funds to fuel Alameda trades and his own lavish lifestyle. Mr. Bankman-Fried has admitted that he directed FTX customers to deposit funds into Alameda bank accounts. He has denied he committed fraud. Republican Sens. John Kennedy of Louisiana and Roger Marshall of Kansas, along with Democratic Sen. Elizabeth Warren of Massachusetts, said an account at Silvergate “appears to be at the center” of the collapse. Monday, Silvergate defended its risk and monitoring systems. It suggested it hadn’t known that money going into Alameda was supposed to be for FTX. “At Silvergate, we understand and share the concerns being widely expressed that FTX apparently was directing its customers to wire money to Alameda’s accounts,” the bank’s CEO Alan Lane wrote. The letter added a review of the transactions involving accounts associated with FTX and/or Alameda is ongoing. The bank told the senators it couldn’t answer specifics about a single customer or whether it had flagged any regulators concerns about the transfers, citing laws about confidentiality and bank rules. “We didn’t get too much in the way of real answers,” Sen. Kennedy said in a statement. ",
                    "links": [
                        "https://www.wsj.com/articles/ftxs-sam-bankman-fried-charged-with-criminal-fraud-conspiracy-11670951131?mod=article_inline",
                        "https://www.wsj.com/articles/ftx-founder-sam-bankman-fried-says-he-cant-account-for-billions-sent-to-alameda-11670107659?mod=article_inline"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.768207282913165
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#101",
                    "likes": "0",
                    "time": "21/12/2022-21:32:46",
                    "content": "are you comfortable with Gemini putting sizable deposits into Silvergate Bank, a non-investment grade entity whose stock is down almost 90% year to date? Your post suggests that you may be but want to ask you directly ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5740740740740735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#102",
                    "likes": "1",
                    "time": "21/12/2022-22:11:00",
                    "content": "@Cryptohippo65 your chart seems to be off, you can look at any good place, GUSD is traded at par, ComarketCap is pushing some CeX that are unheard of. The PSM is not full neither (people were buying GUSD from the PSM those last few days). You can see the details of the market that CoinMarketCap uses to get a sense of the problem. If you like FUD, do note that CoinMarketCap is owned by … Binance. On CoinGecko it shows GUSD above peg (which again is only technical stuff, it’s says nothing about GUSD, just a lack of liquidity and our PSM fees).  image842×681 38.1 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.232142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#103",
                    "likes": "1",
                    "time": "21/12/2022-22:44:52",
                    "content": "Response: How can “my” chart be off, when it’s a screenshot taken from Coinmarketcap? Are you suggesting that Binance is manipulating the GUSD graph on coinmarketcap? I’d prefer focus on verifable facts rather than an unsubstantiated allegation, because that would derail the discussion  cmc gusd markets11074×1159 133 KB  Also, why would you make a claim that “coinmarketcap” is pushing some CeX that are unheard of, when anyone can easily check the list of markets, and see that Coinmarketcap & Coingecko both use all the same sources. Coingecko has 1 additional source called  “Tokpie”. Seb is the same individual who said “Don’t know, don’t care” when I asked him if he knew who provided the GUSD to the PSM. Main Topic First off, I am very glad to see that GUSD has restabilized, for the benefit of MakerDAO. This has spurred reasonable voices in this forum to highlight legitimate concerns. @ACREinvest and @Eumenes have both posted sourced concerns, that have been skipped over. Please take their concerns into consideration for the benefit of MakerDAO. There is nothing wrong with reassessing a business deal when new information has come to light. This is the definition of good risk management. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.015151515151516
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#104",
                    "likes": "0",
                    "time": "21/12/2022-23:11:03",
                    "content": "Even though Silvergate Bank’s credit rating is BB, it is still an FDIC-insured bank, meaning deposits up to $250,000 per depositor are insured. According to Gemini’s response, the PSM was filled by Gemini holders, not just a handful of investors. If that is the case, the majority of deposits would be insured. I am not saying the above risks should not be considered, but we should also be realistic about them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.944444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#105",
                    "likes": "0",
                    "time": "21/12/2022-23:18:59",
                    "content": "Though at least, we should ask for a higher rate due to the increased perceived risk, or match Coinbase’s new offer. It would not make sense to use USDC to earn 1% in the GUSD PSM when we can earn >2% with Coinbase ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.951704545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#106",
                    "likes": "1",
                    "time": "21/12/2022-23:40:47",
                    "content": "This seems like low effort FUD to me.  The PSM has had $5m of space in it all day. If GUSD really depegged that much, an arbitrage bot (or even a human arbitrageur) would take advantage by buying 5m GUSD tokens & swapping for DAI in the PSM 1:1 for ~$150k instant profit. You can look at the direct GUSD/USD feeds from major exchanges (coinbase, for instance) directly on tradingview and see none of them depegged today.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4140625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#107",
                    "likes": "2",
                    "time": "21/12/2022-23:50:57",
                    "content": "Maker should know the specifics here Otherwise its risk management based on hope ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#108",
                    "likes": "1",
                    "time": "22/12/2022-05:50:20",
                    "content": "FDIC insures per depositor. in this case Gemini > Silvergate, only Gemini is insured up to 250k unless Gemini is FDIC insured, which is not. So Gemini depositors are NOT covered. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#109",
                    "likes": "0",
                    "time": "22/12/2022-06:17:54",
                    "content": "Hellos, i did a simple comparative analysis. Coingecko excluded prices from CEX.io where CMC did not. that caused the difference. Do check out the asterisks on which sources are excluded for the aggregation of prices ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#110",
                    "likes": "3",
                    "time": "22/12/2022-08:28:37",
                    "content": "A bit late to this party but for my .02DAI. First to @tylerwinklevoss really nice to see a post from you on this.   Appreciate the personal time doing it and your team working with MakerDAO to help generate return to Maker via GUSD in the PSM. Now regarding the whole swath of comments regarding liquidity (Maker having almost 85% of all GUSD in the PSM) as of writing and significant questioning here regarding overall risk to Maker. Lets start with some basics. Since the risk assessment team reviewed the 500M GUSD DC raise, and governance approved this Maker was left earning nothing on the risk taken.   This proposal at least generates some revenue against that risk.  Which I think everyone agrees is existential to Maker.  GUSD implodes and Maker ends up with anything remotely close to a $500M hole in the balance sheet.   Going to leave a gaping hole no matter what.   This inherently leaves all remaining DAI ~90% backed by remaining assets btw.   Not great but 90% better than 0 or 10% I think. Debate whether or how here on this $500M could entirely implode but in the final analysis,  risk accepted this passed it on to governance which passed it.   Once that happened as @LongForWisdom writes:     LongForWisdom:  That’s because it really doesn’t matter who is putting the GUSD into the PSM. The risk is identical either way.   The statements in the above reply all absolutely correct.   Lets add the above generous proposal by Gemini at least starts to pay Maker for taking the above risk and that it doesn’t have to pay one $.01 to Maker. I really, REALLY want governance and all stakeholders to wrap their heads around this.   EVERY RWA that connects to DAI via Maker has some element of risk associated with it.   This risk centers on counter parties, and ability to lay claims in any toxic legal situation, not just on assets, but by recognizable plaintiffs, in jurisdictions. Frankly something I think RISK should undertake here given the growing number of RWA existential risks (USDC, Monetalis, GUSD, etc) is to create a chart of risk and return rankings 1-10 that include stuff like ‘size’, ‘counter party’, ‘return’, ‘backing’, ‘jurisdiction’, ‘etc’.   Honestly making some of this up but the point here is that I always saw risk management as part of @Risk-Core-Unit job and perhaps it is time to put them to work ranking the changing risks in Maker particularly around RWA and the evolving DCs. I appreciate people doing research, bringing up issues but from my seat unless someone thinks the PSMs are going to be eliminated (and how would you do this btw) people are crying over already spilt Milk on the PSM front. One thing I want to make clear here with the above deal and PSMs in general.   Maker doesn’t control the fee it gets on this except by tout/tin.  PSMs are simply a swapping mechanism.  Once tokens end up in these there is:  No way to auction the assets other than a spell and governance action and even then I am not sure what it would mean for the protocol No way to act in any reasonable time frame even if Maker needed to other than to shut off the PSM.  Which brings a question - what does emergency response look like on these?   I mean GUSD is basically at peak DC so it doesn’t get much worse here.  But i wonder about stuff with significantly available DC. Since there are no fees there basically is no way to force these assets to move.   The only reason Maker is getting fees is because of the good graces of Gemini.   These could be turned off at a moments notice.  So don’t think this deal is something that is signed, sealed and could be litigated .  It can be changed at a moments notice.    This is in stark contrast to deals with other RWA parties that have real fees in them (debate what this means in practice and how binding they are, but the above offer from Gemini as far as I can tell isn’t a valid contract, but simply a rebate offer retractable/modifiable at any time!  The above is a prime reason to have a fiduciary intermediary here (to establish and have a enforceable contract with real terms) and to head off @ChrisBlec here a bit.   As you and most of us here already know.  Maker has taken and eaten of the forbidden fruit with any RWA.   Sole reason here is that ALL RWA by definition is centralized.   I think @ACREinvest has good points regarding how DAOs by trying to stay ‘decentralized’ in effect hazard not just centralized/counterparty risks, but it also hazards jurisdictional, and party risks (party in the sense that the who that represents MakerDAO actually is able and willing to represent, and do so in ways aligned with Maker interests in a relevant jurisdiction). The time to fight for Maker/DAI and decentralization has long since passed imo, at this point the job of governance is to do its best job to generate returns for the DAO and to mitigate risk generally.   At this point given the schism not just cognitively but also politically in Maker there is only one party to appeal to generally at this point and that is @rune because for all practical purposes nothing happens on this protocol at this point without his approval. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.470628415300547
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#111",
                    "likes": "1",
                    "time": "22/12/2022-10:53:35",
                    "content": "    Cryptohippo65:  First off, I am very glad to see that GUSD has restabilized   As said, your point is misleading as the peg was never destabilized. Coinmakretcap is using mainly EXMO which have $0.13 spread between two GUSD pairs. This is as low quality data feeds as it gets. . Coingecko is using mainly Curve which is actually where real volume is. When both Coinbase, Curve, Uniswap and the PSM are saying GUSD price was $1, then price was $1. If community think Silvergate will default on his bank deposits, despite being rated Prime-2 by Moody’s and being regulated as a bank (which I’m not saying I have much confidence in CRAs or regulators), then it make sense to exit GUSD (if we assume they have exposure), and to a lower extend others stablecoins as well. FDIC insurance is indeed of little use for MakerDAO in my understanding due to our size (and practical implementation by being a DAO and not a person). Writing a MIP is the way. If someone is not happy with holding GUSD, just provide how and where we, as a community, should allocate and let’s discuss on an actionable plan, if any, and not just on some “concerns”. This would be good governance, this is how a open and decentralized protocol should work. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.623397435897436
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#112",
                    "likes": "0",
                    "time": "22/12/2022-13:18:47",
                    "content": "    fumoffuXx:  FDIC insures per depositor. in this case Gemini > Silvergate, only Gemini is insured up to 250k unless Gemini is FDIC insured, which is not. So Gemini depositors are NOT covered.   That is not how it works. Gemini’s accounts at FDIC-insured banks are called FBO accounts. This means that Gemini deposits funds For Benefit Of (FBO) its GUSD holders. In the case of a FDIC-insured bank going bankrupt, the FDIC would take over the bankrupt bank’s accounts and request Gemini to provide a list of the clients that make up the deposit of their account at the bankrupt bank in order to determine FDIC eligibility. Thus, Gemini depositors are insured by the FDIC up to a limit of $250,000. Gemini, being a centralized exchange, has completed KYC on all of its GUSD holders. Therefore, providing this data to the FDIC should not be difficult. It becomes more complex when GUSD has been traded and is now held in non-KYC wallets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#114",
                    "likes": "0",
                    "time": "22/12/2022-13:26:10",
                    "content": "can you back this up with supporting evidence? eg. Gemini Trust LLP is FDIC insured, not Silvergate. Screenshots and documentations filed with the FDIC This is important as Silvergate has only 1 customer that is Gemini Trust. And Gemini Trust has a liability to all GUSD holders. #### Regulated and Insured Gemini is a U.S. company regulated as a limited purpose trust company by the New York State Department of Financial Services. Each GUSD corresponds to a U.S. dollar that is held by Gemini as one of the following types of assets: (1) deposits in U.S. Federal Deposit Insurance Corporation (“FDIC”)-insured banks, (2) money market funds, invested only in U.S. Treasury Obligations, or (3) U.S. Treasury Obligations. The U.S. dollar cash portion of these GUSD reserves, which may be held at Silvergate Bank, State Street Bank and Trust Company or Signature Bank, may be eligible for FDIC “pass through” insurance for Gemini customers in the event that the bank holding such U.S. dollar cash deposits becomes subject to resolution or similar proceedings by the FDIC. Overall, Gemini Trust makes use of a centralized system that helps protect against security threats, giving the Gemini dollar key regulatory advantages over many of its competitors. Keyword, MAY BE ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.093208874458874
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HKUST_EPI_BLOCKCHAIN",
                    "index": "#115",
                    "likes": "1",
                    "time": "22/12/2022-13:41:00",
                    "content": "Hello all, Just sharing our thoughts to the matter. This is the screenshot taken from the Attestation of fiat backing GUSD from BPM LLP’s report for GUSD.  822×531 64 KB  Very odd to see an exact 1:1 match of assets to total GUSD on chain. We compared to Paxos, Tether and Circle, and noted all of them have surplus cushion from the interest earned from the Tbills or Funds invested. We find this rather concerning due to the recoverable value of the Money market funds and Tbills, as they will have to be liquidated at a discount if a massive bankrun of GUSD occurs and no cushion available to absorb the discount on liquidated assets. Cheers ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.256944444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#116",
                    "likes": "0",
                    "time": "22/12/2022-13:44:45",
                    "content": "A simple google search or search in the fdic website will show that Silvergate Bank is an FDIC insured bank… Silvergate Bank (FDIC Certificate  #27330)  Screenshot_20221222_0845511080×1106 105 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#117",
                    "likes": "0",
                    "time": "22/12/2022-13:46:37",
                    "content": "yes but Gemini Trust LLP is not ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#118",
                    "likes": "0",
                    "time": "22/12/2022-13:48:00",
                    "content": "Its in your comment. I dont understand your argument. Gemini has accounts at an fdic insured bank and the fdic provides pass through insurance to Gemini’s customers.     fumoffuXx:  The U.S. dollar cash portion of these GUSD reserves, which may be held at Silvergate Bank, State Street Bank and Trust Company or Signature Bank, may be eligible for FDIC “pass through” insurance for Gemini customers in the event that the bank holding such U.S. dollar cash deposits becomes subject to resolution or similar proceedings by the FDIC.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.722222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#119",
                    "likes": "1",
                    "time": "22/12/2022-13:49:54",
                    "content": "keyword: Maybe… in this volatile environment. May be is not good enough, the idea of sit and pray for the best is a horrible idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#120",
                    "likes": "0",
                    "time": "22/12/2022-13:50:24",
                    "content": "It says maybe because they only insure up to 250k per depositor. Stop changing your argument to spread FUD in an already volatile market ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#121",
                    "likes": "2",
                    "time": "22/12/2022-13:53:43",
                    "content": "my argument never changed, its not FUD what i listed is facts. and your ill interpretation of documentation is not helping anyone. Nonetheless, am not gonna continue this fruitless discussion with you. @tylerwinklevoss perhaps you can provide some form of clarity ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#122",
                    "likes": "0",
                    "time": "22/12/2022-14:48:09",
                    "content": "The interest is kept by Gemini, so it would go to a separate account to avoid cummingling of funds. Can you please explain how the below would happen? MMFs trade at Constant NAV (Government Funds), therefore even if Gemini is forced to sell all of its shares to cover withdrawals, they would receive 100% of the principal.     HKUST_EPI_BLOCKCHAIN:  We find this rather concerning due to the recoverable value of the Money market funds and Tbills, as they will have to be liquidated at a discount if a massive bankrun of GUSD occurs and no cushion available to absorb the discount on liquidated assets   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.975
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#123",
                    "likes": "1",
                    "time": "22/12/2022-14:57:13",
                    "content": "If Maker doesnt know the distribution/size of GUSD holders in the PSM, then it has no idea how much GUSD risk is potentially covered by FDIC insurance versus how much is uncovered. In TradFi this would be considered an unacceptable level risk that would have to be addressed quickly.  So much ‘trust’ in a non-investment grade rated  counterparty that is currently struggling, at least as indicated by its huge stock price decline (down almost 90% year to date). It sounds like Maker relying more on hope than sound risk management… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.722222222222221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#124",
                    "likes": "2",
                    "time": "22/12/2022-15:05:25",
                    "content": "Good to see you posting. Perhaps the biggest issue here is that the significant majority of active MKR voters and delegates lack the necessary experience in RWA investing and risk management to reasonable manage Maker, particularly from a financial risk perspective.  The Maker workforce has some very solid knowledgeable folks but they are clearly not empowered to make good decisions. One a separate note, Maker probably has lower risk by keeping most of its PSM stablecoins in the strongest counterparty which is arguably USDC.  Diversification only helps if the counterparty risk of a given stable coin isnt large enough to destroy Maker.  At this point a counterparty failure of either Circle or Gemini is existential so Maker has existential risk to BOTH Circle and Gemini which is higher existential risk than to  Circle alone… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.707633053221288
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#125",
                    "likes": "0",
                    "time": "22/12/2022-15:06:37",
                    "content": "    Eumenes:  If Maker doesnt know the distribution/size of GUSD holders in the PSM, then it has no idea how much GUSD risk is potentially covered by FDIC insurance versus how much is uncovered.   Yes, that is correct. Gemini has four participating banks, so they can split deposits into 250K chunks to receive up to one million in insurance per depositor. However, I agree that we should inquire about the insured/uninsured distribution of deposits as that is the main risk if any of those banks become insolvent. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#126",
                    "likes": "4",
                    "time": "22/12/2022-15:12:59",
                    "content": "In TradFi an institution would actively monitor counterparty risk, particularly large exposures and weaker credits.  At this point Maker should assume that their Silvergate exposure is large (existential) and work aggressively to better understand the exposure level and aggressively reduce the risk. Does Maker have a group tasked with monitoring counterparty risk such as this?  Seems like a big gap ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.662698412698413
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#127",
                    "likes": "1",
                    "time": "22/12/2022-15:14:09",
                    "content": "Agreed and there is no certainty the fdic insurance is able to pass through to depositors with gemini trust llp. I having a terrible time explaining tradfi stuff ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#128",
                    "likes": "3",
                    "time": "22/12/2022-16:25:04",
                    "content": "History has not been kind to highly levered financial entities that do not manage their balance sheet wisely ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HKUST_EPI_BLOCKCHAIN",
                    "index": "#129",
                    "likes": "2",
                    "time": "22/12/2022-16:40:38",
                    "content": "All Tbills and funds have a maturity period, to sell it to a secondary person is like passing on the liability of illiquidity. Example: You have a 24mths Tbill, which is not readily sellable on the secondary market. And you are in need of the cash for an urgent matter, the buyer in which you have found is not going to pay you face value of the Tbill. He has no obligation to, and will press the price down as him taking on the Tbill exposes him to liquidity risk. Hence, he will demand a discount. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.9305555555555554
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#130",
                    "likes": "1",
                    "time": "22/12/2022-17:07:01",
                    "content": "The Treasury bill market is highly liquid; investors can quickly convert bills to cash. The cash is held in as risk free investments as it gets… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.488888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#131",
                    "likes": "5",
                    "time": "22/12/2022-18:51:47",
                    "content": "Let’s also not loose sight of the likely fact that MakerDAO at this time does not have a mechanism, strategy or plan for how it as a non-recognized entity would assert and enforce ANY rights outlined in contracts or applicable laws. So, the first port of call is to be aggressively INFORMED about the following on a real time basis:     Eumenes:  actively monitor counterparty risk, particularly large exposures and weaker credits. At this point Maker should assume that their Silvergate exposure is large (existential) and work aggressively to better understand the exposure level and aggressively reduce the risk. Does Maker have a group tasked with monitoring counterparty risk such as this? Seems like a big gap   We should also expect that those involved with deals are: A) not shy about pushing counterparties for all the details to give comfort to the community; B) use the market power of MakerDAO to force disclosures and clarifications; C) treat participants on this Forum with respect and professionalism for raising concerns rather than gaslight them with FUD accusations; and D) encourage all concerns to be expressed, investigated and validate such efforts rather than deflect with retorts to “make a proposal.” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.589884474499859
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#132",
                    "likes": "2",
                    "time": "22/12/2022-20:42:37",
                    "content": "    SebVentures:  Writing a MIP is the way. If someone is not happy with holding GUSD, just provide how and where we, as a community, should allocate and let’s discuss on an actionable plan, if any, and not just on some “concerns”. This would be good governance, this is how a open and decentralized protocol should work.   If there is an insolvency issue(and I am not saying there is), then the 2 months a typical MIP would take make it a bad way to address the issue. Someone would need to convince the proper person to invoke urgency and get a vote up asap. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.527777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#133",
                    "likes": "7",
                    "time": "22/12/2022-21:05:11",
                    "content": "To the point about the MIP process being too slow and unsuitable for emergency situations like this: Something very useful would be for people who care about this to share their opinions on a detailed process for what you are describing. So something like 1) detecting that a bankruptcy is about to happen (how to detect this) 2) triage and determine next steps (what are the options - maybe given different levels of severity, and who is responsible for this and what protections do we have against collusion/corruption/negligence), and 3) how actual execution of the different options available is done, in as much detail as possible to prevent mistakes and corruption risk. These are the kinds of details that we will be spending Q1 working into the first drafts of the scope frameworks - in this case these elements related to emergency risk with collateral counterparties would be relevant for the RWA Collateral Scope Framework ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.692857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#134",
                    "likes": "4",
                    "time": "23/12/2022-01:02:06",
                    "content": "    Eumenes:  are you comfortable with Gemini putting sizable deposits into Silvergate Bank, a non-investment grade entity whose stock is down almost 90% year to date?   Don’t feel great knowing GUSD has indirect SI exposure. I personally don’t think FDIC insurance is likely to do much good for Maker in the event Silvergate (or another centralized stablecoin counterparty) defaults. However as a federal reserve member bank SI has access to a bunch of liquidity programs that reduce risk of a bank run situation taking them under. I would feel better if Gemini held a greater share of GUSD reserves in ultra-short treasuries, and then just maintained smallish bank balances to cover creation/redemption. That said, the Silvergate fear could be getting a bit overblown, as I haven’t seen any evidence they lost money in the recent turmoil.     Eumenes:  One a separate note, Maker probably has lower risk by keeping most of its PSM stablecoins in the strongest counterparty which is arguably USDC. Diversification only helps if the counterparty risk of a given stable coin isnt large enough to destroy Maker. At this point a counterparty failure of either Circle or Gemini is existential so Maker has existential risk to BOTH Circle and Gemini which is higher existential risk than to Circle alone…   I don’t completely agree. While having several high exposure counterparties gives more chances for Maker to face an existential hit, the losses to DAI holders from any individual counterparty defaulting could be lower. Also think there is strategic benefit to fostering an ecosystem of centralized stablecoins rather than entrenching a single issuer through exclusive use at Maker. Overall, I think Maker’s GUSD exposure still makes sense. We’ve seen Gemini follow through on sharing revenue, and their capacity to meet redemptions has been proven out over the past month. GUSD also offers immediate liquidity to respond to changes in DAI supply/demand, while other RWAs may take much longer to recall funds if needed. Rather than curtailing GUSD exposure, I’d prefer to put constructive pressure on Gemini to reduce their (possibly unsecured) exposure to crypto focused banks like Silvergate and Signature and shift more of their reserves into treasury bills, govt money funds or other government guaranteed assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6967724867724865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#135",
                    "likes": "3",
                    "time": "28/12/2022-14:07:05",
                    "content": "Link to Gemini class action law suit filed yesterday and sample of media coverage    docdroid.net    0001_12_27_2022_COMPLAINT_against_Gemini_Trust_Company_LLC_Cameron.pdf Case 1:22-cv-10922 Document 1 Filed 12/27/22 Page 1 of 48. UNITED STATES DISTRICT COURT SOUTHERN DISTRICT OF NEW YORK BRENDAN PICHA and MAX J. HASTINGS individually and on behalf of all others similarly situated, Plaintiffs,. Case No. 1:22-cv-10922....      https://www.bloomberg.com/news/articles/2022-12-28/gemini-winklevoss-twins-sued-for-fraud-over-interest-accounts    Forbes    Gemini Faces Class-Action Lawsuit Over Unregistered Interest-Bearing Accounts Gemini, the cryptocurrency exchange founded by Tyler and Cameron Winklevoss, is facing a class-action lawsuit over claims that it sold interest-bearing accounts without registering them as securities.         Decrypt – 28 Dec 22    Investors Sue Gemini, Winklevoss Twins Over High-Yield Earn Products - Decrypt A class-action lawsuit alleges Gemini sold interest-bearing accounts that it failed to register as securities.      ",
                    "links": [
                        "https://www.docdroid.net/nEL3Vhz/0001-12-27-2022-complaint-against-gemini-trust-company-llc-cameron-pdf",
                        "https://www.bloomberg.com/news/articles/2022-12-28/gemini-winklevoss-twins-sued-for-fraud-over-interest-accounts",
                        "https://www.forbes.com/sites/derickdavid/2022/12/28/gemini-faces-class-action-lawsuit-over-unregistered-interest-bearing-accounts/",
                        "https://www.forbes.com/sites/derickdavid/2022/12/28/gemini-faces-class-action-lawsuit-over-unregistered-interest-bearing-accounts/",
                        "https://decrypt.co/118046/investors-sue-gemini-winklevoss-twins-over-high-yield-earn-products",
                        "https://decrypt.co/118046/investors-sue-gemini-winklevoss-twins-over-high-yield-earn-products",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-update/19428/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.78030303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#136",
                    "likes": "2",
                    "time": "28/12/2022-16:22:51",
                    "content": "thanks for the thoughtful reply. from an equity holder perspective I tend to agree with you. but as Maker is a highly levered entity (50:1), these equity type risks you are comfortable are from my view a very bad deal for DAI holders who never get back more than par.  They have no equity upside. I think DAI holders have fundamentally mispriced their capital and should carefully evaluate the risk/return proposition that DAI offers them today. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666668
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#137",
                    "likes": "0",
                    "time": "28/12/2022-20:51:40",
                    "content": "A post was split to a new topic: Quality of Maker’s Risk Management ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/beardmars",
                    "index": "#138",
                    "likes": "9",
                    "time": "28/12/2022-21:11:46",
                    "content": "Hi all, I wanted to share an update on our original partnership post around the below item as we head into year end: “Before the end of December, when we review the results of this experiment, we might renew our commitment at this rate, a different rate altogether or not at all” Gemini is planning on keeping as well as increasing the marketing incentive for this partnership from the current 1.25% to 1.5% for Q1 2023 for any GUSD present in the PSM in accordance to the original terms. Also, it’s extremely encouraging to see the engagement in the forums and on this thread and I’m going to go through all the comments and reply with information around any of the top/open questions from the community soon. Also, I want to thank the Maker team and highlight how awesome it was/is to make our first payment for this partnership in a fully decentralized way and keeping it on-chain. I hope it shows our commitment to supporting defi and MakerDAO. Thank you, Marshall ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.180555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#139",
                    "likes": "4",
                    "time": "02/01/2023-23:45:29",
                    "content": "What is the purpose of answering the legitimate outstanding concerns, if you already decided to renew the deal? This implies you already know better than the community, and are simply explaining to the school children why they are mistaken. MakerDAO had the opportunity to close out a deal that made sense in the past, and now instead brings new risk, which includes both financial risk and now reputational damage. MakerDAO’s continued partnership with Gemini when they are facing class action lawsuit for unregistered interest bearing accounts is a really bad look. MakerDAO holds all the cards, and yet you accepted a paultry 0.25% for the new additional significant risk. You could literally have asked for any amount, and Gemini would have had zero options but to accept that amount.  Why? Because MakerDAO literally holds 86% of all the GUSD total supply.  An additional 30.5M GUSD should be subtracted, which have been lost to bankruptcies, but still held in wallets by Blockfi, Celsius & Voyager. This brings the real GUSD circulating supply to $540M.  MakerDAO’s PSM true ownership of GUSD is 90.5%.  If this partnership ends, GUSD will be reduced to just a circulating marketcap of 50M!!! It’s already one of the lowest volume coins per marketcap size, and is barely used outside of Gemini. Without MakerDAO, GUSD would likely fade into insignificance after freezing Gemini Earn withdrawals. For better, or for worse:  MakerDAO is now GUSD.  Gemini knows this, but for some reason certain parties on here are still playing dumb on this fact. The second an exchange freezes withdrawals for ANY product on their platform, the trust is gone with its customers. No exchange has ever been able to recover from this fact. My recommendation is to save MakerDAO from the reputational damage, and end this partnership. Alternatively, postpone the partnership until the lawsuits have been resolved. Again, it is a terrible look for MakerDAO to be profiting off a partnership with a business partner that is currently being sued by it’s customers for freezing their Gemini Earn withdrawals, which was being used by customers to earn interest on their GUSD. Is the reputational damage really worth the profit? Failing that, renegiotate the deal. Gemini is floating in the sea, and MakerDAO is holding the only floatation device. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.282808987887114
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#140",
                    "likes": "0",
                    "time": "11/01/2023-16:19:28",
                    "content": "How are those answers to the top questions on what has been highlighted as an urgent matter coming along?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#141",
                    "likes": "1",
                    "time": "12/01/2023-22:35:59",
                    "content": "Now the SEC has charged Gemini with selling unregistered securities. But hey, lets continue holding 85% of the GUSD in the MakerDAO PSM. No increased risks to be seen here!    CNBC – 12 Jan 23    Crypto firms Genesis and Gemini charged by SEC with selling unregistered... The SEC alleged on Thursday that crypto firm Gemini, founded by the Winklevoss twins, and Barry Silbert's Genesis offered and sold unregistered securities.      ",
                    "links": [
                        "https://www.cnbc.com/2023/01/12/sec-charges-genesis-and-gemini-with-selling-unregistered-securities.html"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaveringtonPLLC",
                    "index": "#142",
                    "likes": "3",
                    "time": "12/01/2023-23:28:29",
                    "content": "I think people are looking into it and taking the risk seriously, just not commenting yet. I attended the public Collateral Onboarding status update call on Monday this week and there was talk about some technical implementations being discussed to manage GUSD exposure. All of it went over my head, so I really can’t say much more than that and I am not part of those conversations. Here is a link to the SEC complaint for ease of reference:https://www.sec.gov/litigation/complaints/2023/comp-pr2023-7.pdf ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.976190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#143",
                    "likes": "1",
                    "time": "13/01/2023-14:29:25",
                    "content": "There had been an active discussion on here, until the lawsuits were launched. Also this thread has the most views for any thread with the GUSD tag, so the MakerDAO team is actively looking here, but have gone quiet.  Latest-gusd-topics-The-Maker-Forum (1)1362×518 80.5 KB  @beardmars even said he would be responding to all the top open questions from the community. That was 16 days ago. For a matter that is an urgent as this, I would think a response should have been released much sooner! But again, the decision to continue the partnership was already decided so it more seems like a statement to placate those with real concerns on here, rather than a good faith discussion to potentially take real risk mitigation action. With regards a technical implementation to manage GUSD exposure, you can’t code your way out of risk. There is $489 million worth of GUSD exposure in the PSM. The only way to reduce that risk, is to reduce MakerDAO’s exposure to GUSD and lower the amount in the PSM. There is no magical blockchain technical implementation that can manage GUSD exposure. You either reduce the GUSD limit in the PSM, or the risk remains the same. Unless members from that call that were discussing this, would like to share an alternative method? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.719298245614035
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#144",
                    "likes": "0",
                    "time": "14/01/2023-04:08:50",
                    "content": "The collateral for GUSD, are deposits of equal value at a few banks. Can you please explain how those are at risk? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/beardmars",
                    "index": "#145",
                    "likes": "4",
                    "time": "16/01/2023-21:55:22",
                    "content": "Hi all, I’d like to share a recent post from Gemini’s founders that aims to answer a lot of the open questions in this thread. GUSD & MakerDAO Partnership Update Also, I’d like to share the tx hash for this partnerships second payment, which was processed today, for the month of December 2022. The total incentive payment to Maker for December to $528,084. December 2022 payment - https://etherscan.io/tx/0xec1e3405bbde75d7cdd38017065ef1689b8d1bcff87e2f443a0c5ccac5d15a6f November 2022 payment - https://etherscan.io/tx/0x62680d6473d0aebbe0d30275a7947455f8f9eff968b54b7644c6813ce303b63c Thank you all, Marshall ",
                    "links": [
                        "https://etherscan.io/tx/0xec1e3405bbde75d7cdd38017065ef1689b8d1bcff87e2f443a0c5ccac5d15a6f",
                        "https://etherscan.io/tx/0x62680d6473d0aebbe0d30275a7947455f8f9eff968b54b7644c6813ce303b63c"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#146",
                    "likes": "0",
                    "time": "17/01/2023-03:00:59",
                    "content": "I deleted my post as I hadn’t clicked through the new thread which respond to the pressing questions. Gemini have gone in great detail explaining their position in very legal terms. MakerDAO should also do an in depth analysis with its own legal team to break down their statement, in order to outline in clear terms what risks have been addressed, and what risks are still outstanding. This will allow Maker participants to make an informed decision about the current status of GUSD in the PSM. There are a lot of \"should\"s in their statement that would need to be reviewed very carefully to ensure MakerDAO is aware of its own risks and doesn’t simply accept the statements Gemini releases. Proper due diligence requires this and Gemini would understand this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.011936026936027
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#147",
                    "likes": "0",
                    "time": "17/01/2023-04:34:45",
                    "content": "Gemini finally disclosed that they hired a third party to fill the GUSD PSM. Why all the pushback on such a simply question? Regardless, I’m glad to see transparency about this deal improving. I’ve commented over on the new thread, but I have found additional interesting connections to the market maker. I’ve discussed it in detail over there, but the main finding is that:  The GUSD PSM Market Maker wallet has transactions which connect it to Genesis Trading.  They’re the party with the insolvency issue, and the reason Gemini have stated for halting Gemini Earn withdrawals.  All connections to GUSD Market Maker Plus mystery BB110E wallet (1)1778×954 186 KB      GUSD & MakerDAO Partnership Update Governance       Thank you for confirming that Gemini was the one to hire a third party market participant to fill the PSM.  Although Gemini doesn’t comment publicly on the counterparty, I think it is important information for MakerDAO, given the very public pushback to such a simple question.  This pushback mainly and oddly came from MakerDAO team itself.  I did some analysis of the counterparty’s wallet, and I have found out some info that would be revelant to MakerDAO’s decision making.   [All connections to…   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.53219696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#148",
                    "likes": "1",
                    "time": "17/01/2023-14:10:29",
                    "content": "A half of a million dollar bribe to warehouse a half of a billion dollars worth of risk. Not great risk/reward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.458333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptohippo65",
                    "index": "#149",
                    "likes": "1",
                    "time": "27/01/2023-01:22:56",
                    "content": "A few things don’t sit right with me about the Gemini deal. The vote was conveniently scheduled so that it would end the EXACT same date that Genesis declared chapter 11 bankruptcy. This information would have had a significant impact on the vote IMO. Although I will respect the decision of the vote, I find this timing incredibly suspicious. It has also come to my attention that just a month before the updated GUSD proposal was suggested, on 15AUG2022 Gemini Earn requested $465M collateral from Genesis. Can you guess the exact amount of GUSD, the entity that Gemini refuses to disclose as the market maker moved through the Maker PSM? $465M!!! Then just 3 days after the $465M moved through Maker and is converted back to fiat, Gemini & Genesis come to a new arrangement to allow Genesis more time to pay back Gemini. These are some strikingly amazing coincidences regarding this deal. There is something incredibly fishy about the the GUSD deal and I will continue to provide information so that MakerDAO can continue to make informed decisions. Due diligence is not a set and forget process. It should be a continuing process to ensure the integrity of a business deal. TD:LR  The GUSD vote was scheduled to end the exact same date that Genesis declared chapter 11, which denied voters crucial information to make a fully informed vote. Gemini requested collateral from Genesis on 15Aug22, and Genesis provided 30.9M GBTC worth $465M at the time. $465M was moved through the GUSD Maker PSM by the market maker wallet that has txns linking it back to Genesis. Just 3 days after the $465M was moved through Maker, Gemini and Genesis come to an updated agreement to allow Genesis more time to pay. (10NOV22)  There is something incredibly fishy about this deal, and I’m very concerned that there are entities making decisions behind the scenes that are not in the best interest of MakerDAO. ",
                    "links": [
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-update/19428/21",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-update/19428/11"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4292414941829
                }
            ]
        }
    ]
}