{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/help-wanted-engagement-lead/9711",
            "title": "Help Wanted: Engagement Lead ",
            "index": 9711,
            "category": [
                "Core Units",
                "Governance Communications"
            ],
            "tags": [
                "help-wanted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "3",
                    "time": "05/08/2021-15:46:50",
                    "content": " Taken: Engagement Lead As part of our goal to reliably cover the responsibilities laid out in the GovComms mandate, we are looking to hire a full-time Engagement Lead. The role outlined below is subject to change and may shift with the priorities and needs of the team. We are looking for a proactive, wise, and competent professional who can work with our team to develop this role.  What is an Engagement Lead? The Engagement Lead at MakerDAO’s role is split between interacting and tracking the organization and its stakeholders. The purpose of this role is to continuously engage with the DAO for the purpose of improving informational availability, improving communication practices, maintaining a number of live resources, finding gaps in information we publish, and giving the community more access to engage and learn about current events.  Position Responsibilities   Stakeholder Research Each quarter should contain one to two research projects that result in actionable items to improve the communications and business processes at MakerDAO.   Hosting Issue Discussion Calls Coordinate and host a weekly or bi-weekly issue discussion calls.   Creating and managing a number of stakeholder registries. Privately collecting contact information for various stakeholder groups, for internal-use in stakeholder research, outreach, and emergency communications.   Mapping Maker Create and maintain a public organizational chart.   Press Relations Support Act as a point-person for a media inquiries email, as well as manage the forum’s Media section.   Community Moderator Management Work with community moderators to ensure coverage, best practices, and aid in dispute resolution.    Hard Requirements  Strong Project Management skills. Ability to synthesize information and display it in easy to understand visual format. Ability to moderate potentially complex conversations around DeFi, Web3 and TradFi. Prior experience with public speaking, hosting podcast or webinars. Prior experience with user research, interviewing, relationship management, or investor relations. Highly organized, able to filter through the noise in order to manage timelines and due dates. Comfortable with social interaction as well as building and fostering relationships. Excel skills. Data visualization skills.   Soft Requirements  Familiarity and adaptability when it comes to software tools (Miro, Figma, Content Planning, Video Conferencing tools) Interested in decentralized organizations and governance. Excellent written english skills. Familiarity with MakerDAO.   What will make someone stand out / Nice to haves  Good understanding of DAO’s or experience of working with a Web3 project Prior exposure with decentralized governance tools, understanding of Improvement Proposals and RFC Published content Hosted public calls Background knowledge in data security best practices. Proactive about having a vision for this arm of the team’s mandate.   Competency Level 3+  Competency Levels: Level 1- Entry Level: Learning to use professional concepts. Level 2- Developing: Developing professional expertise. Level 3- Career: A full understanding of own area expertise revolving around a wide range of issues Level 4-Advanced: Experience resolving complex issues in creative and effective ways. Provides leadership. Level 5 - Specialist: Has broad expertise across division or unique knowledge, senior management level Level 6 - Principal: Director Level   How to Apply? Send me an email with your CV and a brief introduction about yourself. [email protected] ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp33-modify-core-unit-budget-mkt-001/10150/16",
                        "https://forum.makerdao.com/t/maker-relay-ep-58-en-espanol/9949",
                        "https://forum.makerdao.com/t/maker-relay-ep-57-en-espanol/9948",
                        "https://forum.makerdao.com/t/maker-relay-ep-58/9892",
                        "https://forum.makerdao.com/t/maker-relay-ep-57/9760",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/47",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-153-thursday-august-5-17-00-utc/9671/5",
                        "https://forum.makerdao.com/t/mip40c3-sp33-modify-core-unit-budget-mkt-001/10150/13",
                        "https://forum.makerdao.com/t/forum-at-a-glance-july-30th-august-5th/9708"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.105614478114479
                },
                {
                    "author_link": "https://forum.makerdao.com/u/shibbol3th2023",
                    "index": "#2",
                    "likes": "3",
                    "time": "10/08/2021-12:30:35",
                    "content": "I have all of the skill required here and a wealth of insight and knowledge in the applicable fields. I hold MKR and have guided friends and family through the process of investing in UNIv2 pools and subsequently opening vaults and reinvesting DAI to maximize yields. I am highly organized, methodical, and am one of the rare people who can move between working as an engineer or customer-facing presenter/speaker, interpreting engineering lingo to executives and customers simultaneously, and/or being a customer-facing employee. All the while, I am able to do this  while maintaining specific organizational priorities in mind. I have spent most of the last 15 years working as a Sales Engineer (aka Solutions Architect) which does precisely that, but my personal crypto investments have allowed me to focus narrowly on the DeFi, TradFi, and economics fields relevant to success at this position. I am extremely good with Visio and Excel and can produce turnkey solutions individually or on a team because of my diverse range of computer-based and finance-based skills. I view teamwork as crucial to the success of all organizations. I have no problem meeting deadlines because of my ability to utilize high wpm typing skills and shortcuts to maximize efficiency in using any application while not increasing susceptibility to error. Project management, video conference, Figma/Miro (I have expertise in similar products such as Adobe Illustrator and Microsoft Whiteboard or Mural), Excel and Visio are absolutely in my wheel-house, too. I focused on data security and storage as a firewall/security engineer for the Aruba/HP wireless line now called HP Wireless, and am very familiar with RFCs and EIPs from my time as a solutions architect and my own time as an investor performing due diligence (DYOR). I have done University research before and I could do great work with my background in econometrics and statistics, as I am familiar with using R for regression analysis. If given access to the appropriate data, I will conduct stellar research, continuously, or delegate it appropriately, as the Principle/Director level team member. If you are interested, give me a shout at 562 666 6974 or email me at [email protected]. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.210887096774194
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "0",
                    "time": "11/10/2021-17:11:56",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}