{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/the-endgame-plan-parts-1-2/15456",
            "title": "The Endgame Plan parts 1&2 ",
            "index": 15456,
            "category": [
                "Governance"
            ],
            "tags": [
                "longform",
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "40",
                    "time": "30/05/2022-19:30:44",
                    "content": " image2768×378 18.2 KB  The Endgame Plan is an ambitious initiative that aims to create a finite roadmap for MakerDAO that step by step leads to a predetermined, immutable end state many years out in the future, while significantly improving governance dynamics and tapping into the raw power of modern DeFi innovation. I have been relatively inactive in Maker Governance since the dissolution of the Foundation, but have now returned to try to push through this ambitious plan and governance overhaul. A key objective for me is to deal with the major contradictions and challenges that I see, and to also ensure that the project gets on a path towards a truly decentralized equilibrium. Some highlights of Endgame Plan that will materialize in the short term, and are described in this post:  Quickly launch a Synthetic ETH product that allows Maker to tap into the Merge Incubate a fully fledged, economically sustainable DAO with significant synergy with Maker Yield farm the new DAO token to Dai, ETH vault and MKR holders that participate in governance The farming rewards means this will immediate drive governance participation and help deal with voter apathy and centralization of governance, and create utility for MKR holders Establish stronger norms and codes of conduct for governance participants, helping to provide a check on the power of Delegates and Core Units which will significantly grow once voter incentives via yield farming are in place   Contents This forum post is a shorter version of the full document, which will be released later once the community has had a chance to absorb this introduction (which is still very long). The post for now contains the two first parts of the full Endgame Plan document.  Part 1: Introduction Part 2: Endgame Plan Launch    image2496×1096 228 KB  Fundamentally, the Endgame Plan aims to transform Maker from an unclear structure towards a reality where all aspects of MakerDAO are well documented and understood, and operate based on defensible incentives and derisked processes  First lets spend a moment to look at the organizational chart of Alphabet, formerly google. Alphabet consists of Google, which is the core driving force of the organization and is given complete autonomy and full control over its key resources and products, such as search and ads. In the same holding company, but separate from Google, are the “Alpha Bets” which can best be described as various moonshots that operate as if they are startups, but are supercharged with the muscle and technology of Google and the rest of the Alphabet portfolio. This means that Alphabet is a one-size fits all strategy where the core of the company operates with a focus on steady growth and returns above all, while being supported by risky ventures that are fully autonomous, and are allowed to take major risks and to fail, but that also have the potential for outsized returns and even in theory, could match or even exceed the success of Google. Obviously, the Endgame Plan isn’t trying to turn Maker into Google, but it is useful context to understand the reasoning behind googles structure in order to better understand the Endgame Plan  image1920×874 121 KB  MetaDAOs are the primary tool proposed by the Endgame Plan, and are the key that unlocks the potential of MakerDAO by establishing dynamics that fit very well into a decentralized and transparent ecosystem. They allow Maker to measure the value and potential that currently exist in the ecosystem and the workforce by wrapping tokens around it, and then by seeding a community through distribution of the tokens, can supercharge the potential of all the value which exists, but is currently mostly hidden and deprioritized. The examples of the incredible amounts of hidden value in Maker include: A standalone fixed rates protocol, the worlds oldest decentralized oracle network and the best developed real world asset pipeline in the industry, and most importantly a massive and highly competent and motivated team that is unmatched in any other decentralized project. Example of RWA MetaDAO One of the most obvious examples of the power of MetaDAOs is the deadlock that is occuring with real world assets, where it turns out that the governance processes and political dynamics that have developed in Maker fundamentally aren’t compatible with the reality of effectively processing complicated real world financial deals and be able to compete with the worlds top financial institutions. MetaDAOs allow Maker to free itself from trying to directly manage and become specialized in the complexity of Real World Asset transactions, and instead simply incubate MetaDAOs that can then develop more specialized and better suited governance dynamics to allow them to overcome the barriers that Maker got stuck in. Maker can then use the already well tested and understood D3M construct to let these MetaDAOs carry out the RWA work on behalf of Maker, with much less overhead and complexity for Maker. The main question becomes comparing the performance of different MetaDAOs and deciding who to empower more. If useful innovation is rewarded and dead ends results in a loss of business, a very tight feedback loop is created where the MetaDAOs can continuously iterate on how to make RWAs work in DeFi, in a decentralized evolutionary process.  Part 1: Introduction This section focuses on background knowledge of the current state of Maker and DeFi  image1920×1000 83.2 KB  After the end of the crypto bull market conditions are emerging that are similar to those in the last crypto winter, which was very favorable to Maker and where Maker was essentially leading the entire industry. This includes Maker returning to the spot as the largest protocol in DeFi, the Merge coming up which will further solidify Ethereums lead and bolster all platforms that are already rooted on Ethereum - most of all Maker, and the effects of a bear market where suddenly fundamentals become the focus while hype stops being a factor.  image1920×1173 131 KB  After the 2021 crypto bubble, it is clear that the industry has moved forward significantly since the last bubble in 2017. But as the tide recedes it is clear that the top projects have not changed at all, it is the same names, such as Maker, Aave and Uniswap that are leading the industry, while all the newest additions have not even been able to survive, but have effectively been wiped out. This shows that we cannot expect radical innovation to continue in DeFi in particular. The main usecases and primitives have already been discovered, and furthermore, even those major usecases are struggling to generate sustainable growth that isn’t dependent on the bubble cycle, with stablecoins as perhaps the only significant outlier that is already being used globally. Ethereum is clearly dominant with the merge coming up, while all other blockchains have basically failed and rather than achieve organic network effects are all mostly dominated by just a single protocol with no clear path to how more will emerge. The main value that has been added to the table that can be considered a new generation of decentralized blockchain apps that have innovated beyond the original primitives is in the form of more intangible and social benefits, including NFTs and yield farming. However the potential of this new value has not really been utilized properly for anything else than powering ponzi schemes.  image2840×398 49.6 KB  This means that Maker has a unique opportunity to once again take the lead in the industry. Maker didn’t invent stablecoins, but was the first project to integrate the various elements together in a way that properly enabled mass adoption and a sound business case. Now, with MetaDAOs as the silver bullet, Maker can consolidate everything we’ve already started and get into position to tap into the new value creation possibilities that exist in the new generation of DeFi. But before we get started we must first understand the challenges we face. One thing to keep in mind as for this list, is that every item that’s listed will later be addressed again after MetaDAOs have been introduced, and then it is made clear exactly how MetaDAOs help solve these specific problems.  image2308×1252 452 KB  The most common complaint amongst MKR holders is, in my view, that it is not clear why MKR will have value. There is a sense of disconnect from the goal of growing the value of the token, compounded by the reality of critical data looking bad, such as total Dai supply. The protocol is generating significant income, but all of that income is perceived to disappear into Core Units that operate at levels too complex for community members to understand and see results from. The only value that is perceptible currently is the value provided by the core of the maker protocol, which is relatively limited, comprising the 6 most popular vault types and the PSM mechanism. Everything beyond has for the most part yet to generate value, but this is where the focus of most of the 115+ strong workforce is aimed. The workforce has now grown so big, that combined with the downturn in the markets and fading growth, it is not even possible for the core of Maker to sustain the workforce anymore, and the protocol has become unprofitable.  image2470×1112 198 KB  Meanwhile, it is very hard to see how the community can make a difference through the levers of governance because of how overwhelmingly complex and opaque Maker governance seems. The Complexity Spiral is the phenomenom that Maker often feels as if it’s taking one step forward and two steps back, because problems that exist in governance are often caused by complexity, but to solve those problems requires creating more complexity, which means overall the problems get worse. The relationship problem is the contradiction of Maker as a clunky, slow and single threaded decision making process where hundreds or even thousands of token holders from around the world have to coordinate and make decisions about hundreds of delicate relationships with individual humans, including core unit members and collateral counterparties who all have their own expectations. At scale this starts to become very problematic, and we have reached a point where it is basically impossible to try to make any kind of change or even discuss ideas without upsetting people that are entangled in this uncontrolled web of relationships and often have conflicting incentives. Finally Voter Apathy occurs because of these above problems, and is more generally just something that is inherent in organizations, since voting costs time (and in Maker even money) but gives no direct benefit in return.  image2046×1256 328 KB  Even with all of these issues Maker has an extremely valuable pool of talent driven by passion for the project, and while lots of problems exist they are mainly caused by the overarching dysfunctional structure rather than the people involved. This means that if we use MetaDAOs to deal with the problems and empower the value that exists, we can open a floodgate of value creation for MKR holders.  image2178×186 16.1 KB  But the most important thing is that MKR holders have to take the initiative to change things, because voting power ultimately determines all incentives in the system, and lack of clarity about what MKR holders actually want is the most confusing factor across the DAO.  image2520×1112 293 KB  The Endgame Plan proposes to first start by organizing the top layer of governance by creating an environment where MKR holders are set up for successful decision making, making voting feel as easy and impactful as possible. Step one is the creation of voter committees, where MKR holders come together openly to discuss direction and coordinate voting behaviour on upcoming proposals, as well as signal future voter support for an overall direction and individual proposals. Voter committees are aligned around a “direction” that informs how they vote for proposals and which delegates they support. Voter committees directly impact governance both by organizing votes on specific proposals, but also by rebalancing delegation votes to different delegates, creating a strong incentive for delegates to take initiative in support of the direction of the Voter Committee. Voter Committee participants are incentivized through a special compensation in the form of long term locked MKR tokens. This helps attract the right type of participants, and ensure they have clear incentive alignment with the outcomes of their decisions. Step two is to elevate the roles of delegates and recognize they serve a purpose as critical as Facilitators, by matching the compensation of top Facilitators for the top group of delegates that are designated as “Executive Delegates”, giving them a generous MKR bonus as well as “soft job security”, meaning they can’t just lose their compensation from one day to another. But in addition to these perks, more clearly defined requirements must be placed on delegates, including attending voter committees x hours per week as a part of the full time job and a strict requirement to follow best practice that enforces principles such as full disclosure and separation of powers. Step three is for the Voter committees and delegates to interface with Facilitators of the Core Units, in particular Supporting Core Units such as Sustainable Ecosystem Scaling and Strategic Finance, in order to generate a voter centric view of how the DAO is organized, and how it could be improved to better suit the objective making governance more accessible. Step four is to also include external consultants and experts in order to validate and challenge the internal perspectives in the community, to avoid an echo chamber situation. By drawing on experts in organizational innovation we can ensure that the cornerstone of Maker’s DAO structure is built on a solid theoretical foundation that the community can confidently put their trust in.  image2472×988 298 KB  The goal of the Decentralized Voter Committees is to make Maker governance more naturally decentralized, transparent and diverse. By having multiple redundant DVCs that are clustered based on common values, called “Direction”, the voter committees help encourage diversity of opinion and make sure there is a valid platform for all major opinions. This minimises the risk that some perspectives can be labeled “incorrect”, even if that is not in the interest of MKR holders, such as currently it is very difficult to discuss reducing budgets. A voter committee is controlled by an organizer, or a group of organizers, who can choose which MKR holders they invite to the voter committee. This allows them to exclude MKR holders if they don’t agree with the voter committee direction, instead forcing them to start their own voter committee with members that all align with the direction. This way, all directions can be discussed freely in constructive environments where participants in the discussion are collaboratively trying to further the agenda of the members.  image2462×1274 331 KB  To bootstrap the voter committees, we first need to develop the “World Map”, a complete global overview of how to subdivide the total scope of maker governance into logically consistent categories. This should be done collaboratively by including professional input from Core Units, and in particular from supporting core units such as Sustainable Ecosystem Scaling and Strategic Finance, whose job is to try to create overview and monitoring of the workforce.  image2500×1304 248 KB  Once there’s clarity about the World Map, MKR holders can begin to organize specialized Voter Committees that focus on individual Scope Maps. These specialized Voter Committees first focus on getting an overview of the field of specialization, and then on documenting the Scope Map. Using the Scope Map as the core framework they can then oversee progress within their area of specialization, and push for changes that better align with their direction.  image1920×914 98 KB  Focus Objectives are a powerful tool that allows MKR holders to align on an overall set of priorities that draw on resources from multiple Scope Maps. The Focus Objectives represent the overall most impactful developments that the Core Units prioritize, following a “waterfall” approach where thigns are prioritized at the top of the list and resources can only flow to objectives that are lower on the list if higher ranked objectives have all their needs fulfilled. This allows for flexible and parallel development to the extent resources are available, while providing guarantees that high impact outcomes aren’t neglected. Once Core Units have allocated all necessary resources to the Focus Objectives that are relevant to them, they can prioritize internally, and prepare for new focus objectives. Focus Objectives can quickly change as market conditions or other external factors forces them to change. The best example is in the case of hacks or other critical risks, in which case mitigating the risk immediately takes the top spot as focus objective. In order to allow Focus Objectives to rapidly change and be flexible enough to serve their intended purpose, they are created through offchain polling done at Voter Committees. A synthetic “global” list of Focus Objectives is created by adding together the MKR totals of different focus objective list from different voter committees, which enables minority MKR holders to also have an impact on the overall prioritization rather than being completely overruled by the MKR majority. Ultimately, Core Units have freedom to interpret and follow the Focus Objectives in the way that they think will be best benefit the DAO, but failure to follow it must be monitored and documented by the Supporting Core Units including the reasons for not following the Focus Objectives. MKR holders can then use the data to make adjustments to Core Units, such as adjusting budgets, based on which Core Units are delivering the results that MKR holders want. The current list on this slide represents the latest proposed “Genesis Focus Objectives list” that would come into effect at the Endgame Plan Launch and would then dynamically change from there. This list will be furthered altered based on input as the Endgame Plan Launch MIP is developed, and can already in this current stage be used as input by Core Units when planning and prioritizing. The line items marked as Endgame Plan will be further explained later in this document.  image1772×166 11.9 KB   Part 2: Endgame Plan Launch This section will focus on the near term features of the Endgame Plan and how it can be launched. All elements of the Endgame Plan launch are generally optimized to be low hanging fruit, requiring minimal effort but providing significant immediate value by tapping into value that already exists in the Maker Ecosystem, but is currently hidden. There are references in this section that introduce concepts that are only fully explained in the complete Endgame Plan document, so for now that detail is missing, but will come with the full version that will be released later this week.  image1920×965 116 KB  The Endgame Plan revolves around deploying the extremely powerful tool of MetaDAOs to improve and empower Maker. MetaDAOs build on top of the established concept of Pods/SubDAOs, that allow a DAO to gain a lot of desirable results that normally aren’t possible to get without making tradeoffs. MetaDAOs allow for deep specialization by workforce, community and governance process because each MetaDAO can focus on their desired specialization, allowing them to devote the necessary resources and focus to become properly specialized, and not be distracted by other responsibilities. This is a much better situation than the current expectation that Maker has be able to specialized in a large amount of completely disjoint categories. Right now Maker is significantly held back by it’s overwhelming and opaque complexity, but this complexity exists for good reason because complexity is necessary to take advantage of the best opportunities that exist in the market. MetaDAOs allow the Maker ecosystem to keep its complexity and even adopt orders of magnitudes greater complexity, but this would happen in isolated and derisked MetaDAOs, while the Maker Core could become a lot simpler than it is today, creating a best of both worlds situation. MetaDAOs also allow Maker to overcome the single threaded nature of the current governance process, and let many separate MetaDAOs prioritize and execute in parallel with almost unlimited potential for scale and autonomy. Each MetaDAO will operate with a fully self contained, tight feedback loop that ensures that all incentives are aligned between those who do the work and the results they create. Finally MetaDAOs build on top of these fundamental, operational advantages, and also allow Maker to tap into the new generation of advantages offered by DeFi, tokens and blockchain ecosystems, including using token communities for growth hacking and building intangible value through art, events and identity.  image2636×1314 300 KB  The key characteristic of Maker MetaDAOs that makes them so powerful is that they are extremely easy, cheap and simple to create because they are able to build on top of the fully mature governance infrastructure of Maker, and only require simple primitives that already exist and are widely used across modern DeFi. A MetaDAO is created when Maker deploys an ERC20 token that Maker Governance retains owernship of, and then generates some tokens to put in a treasury that’s also held by Maker Governance. Additional tokens are then generated and go towards community distribution, primarily towards Dai users, Maker Vault users and MKR governance participants. This creates a fully decentralized community with a full fair launch starting condition, and this decentralized community than has full autonomy to make fundamental decisions for the newly born DAO, including determining a name and identity, hiring Core Units, and pursuing various profit generating activities (the profit opportunities available to MetaDAOs will be covered below in this document) The MetaDAO token holders make their decisions through offchain polling, which makes it free and fast to do. Once the decisions are made, they are then included in the Maker Governance process and execution is bundled into a Maker executive vote. This way MetaDAOs can instantly have fully decentralized governance and a functional treasury, but have no risk of suffering governance attacks.  image2378×1224 208 KB  To help understand the basic value proposition of MetaDAOs and why they are useful to Maker, this is an overview of the 3 broad categories of MetaDAOs that the Endgame Plan proposes. The first category, which is meant to be the most numerous, are the CreatorDAOs. They are an archetypical, generalized MetaDAO that fundamentally focus on innovation and experimentation, and using this to drive growth. CreatorDAOs have no restrictions on what they can do or become, and this makes them very flexible and potentially very heterogenous and different from each other. CreatorDAOs also have particular potential to tap into intangible value and metaverse trends. The specialized MetaDAO categories exist to serve some specific needs that Maker has, that are complicated and challenging enough that it makes sense to have MetaDAOs specifically covering those categories. GovernorDAOs exist to both professionalize and gamify the core governance processes and bureaucracy of Maker. By ensuring that there are multiple, redundant MetaDAOs specializing in this it becomes possible to provide guarantees around decentralization and diversification of core processes and political dynamics, as well as some useful specific methods for significantly derisking many common governance decisions related to the Decentralized Workforce that are currently a challenge for Maker Governance (This will be covered in detail in the section on the Decentralized Workforce below) ReformerDAOs are specialized in dealing with the intense complexity of building the bridges between the decentralized world of DeFi, and the legal world of real world assets. It is right now proving to be the most challenging and disruptive problem for Maker governance that is harming the political dynamic, and it is clear that such an incredible complex challenge must be solved by streamlined organizations that have governance processes and cultural makeup specifically designed to deal with this challenge.  Launching the Endgame Plan and moving to a MetaDAO paradigm  image2466×1332 281 KB  The step by step process of ramping up the MetaDAOs begins by analyzing the risks that exist in the current organic structure. The biggest issue are all the hidden, complicated and often contradictory and conflicting relationships that exist across the DAO and between Maker Governance and hundreds of individual humans. The main objective of executing the Endgame Plan and bootstrapping the MetaDAO paradigm is to minimize the bridge burning and maintain as many high quality relationships as possible, while transitioning them to a form where they become realistically sustainable.  image2468×1352 421 KB  Before MetaDAOs are introduced, it is critical to first define what the Maker Core should be. The list above contains what’s currently proposed as the complete scope of the Maker Core, and the idea is that this Core definition should not change over time, but remain as static as possible in order to create certainty and clarity about what exactly Maker does and why it is secure and reliable. The only new addition to the Core is the ability to regularly incubate new MetaDAOs All additional innovation is instead pushed to the MetaDAOs.  A closer look at the core  image1920×964 86.9 KB  Lets take a closer look at the Core, but from the perspective of a hypothetical “Rai-like” strategy that takes the opposite approach of the Endgame Plan. Instead of reorganizing and empowering the complexity that already exists, the “Rai-like Core” approach tries to just strip down all complexity as much as possible and create a maximally simple and autonomous stablecoin system. This can be achieved by simply taking the functionality of the core, including ETH vaults, BTC vaults, aave and compound D3Ms, PSMs to the major centralized stablecoins, and then beyond this core add the ability to deploy collateral into US treasuries through a simple RWA setup. Once this structure was created, it would require a minimal standing workforce to maintain, except for occasional upgrades or parameter changes to vaults that could be handled by external consultants rather than a standing, full time workforce. Critical infrastructure like Oracles would be outsourced to providers like Chainlink with one or more redundant fallbacks. Only voter committees and delegates would be required to continuously monitor the protocol to discover risks that need to be mitigated, which would for the most part be a very simple and minimally consuming task done at regular intervals. All the value that is saved from not maintaining a massively complex workforce and peripheral products could then be used to just enhance efficiency of the system by setting a very high Dai Savings Rate, and it is likely that this hypothetical system would be very successful in the market due to its powerful core features, efficiency, simplicity and reliability. However, if we extend this design with one more dimension of complexity by also adding the the core function of incubating MetaDAOs, the Maker Community can get all the benefits of this powerful, stand alone core, while also tapping into the infinite possibilities of long term DeFi innovation.  image1868×1032 104 KB  The first step to launching the first MetaDAO is a process called clustering. It involves identifying people, relationships, business opportunities, communities and technologies that have a natural synergy that can benefit from having a distinct governance structure and community. Once these different elements have clustered together, which in practice is done through a Maker Governance Proposal, the MetaDAO is ready for launch.  image1878×1010 157 KB  The first MetaDAO is then launched. The very first MetaDAO has some special considerations that must guide its design, due to its unique role of being the first time ever the concept is tested. For that reason it must be done as a low risk, proof concept that essentially acts as test run that have very clear validation milestones. This is well suited for a CreatorDAO that must prove itself by creating viral growth and ecosystem increase. In the event that the first MetaDAO fails to deliver the expected results, the entire process can be reserved, and the plan can be aborted. This makes it a low risk bet that can be done step by step and easily walked back if the assumptions turn out to be mistaken. First the very first MetaDAO a major challenge will be to attract workforce talent that is willing to make the jump into a new unknown structure. For that reason, Maker must provide very attractive benefits for those who pioneer taking the risk on this transition. This can be done by both continuing existing budgets and MKR bonuses and committing them to the new MetaDAO for a long term duration, and then on top of these existing benefits, the MetaDAO can also provide a significant MetaDAO token budget to the pioneers, creating an attractive risk/reward opportunity.  image1934×1074 180 KB  If the first MetaDAO is successful, then one by one additional MetaDAOs can be created, and these can now be structurally important MetaDAOs that help improve Maker Governance, including launching GovernorDAOs and CreatorDAOs that adopt critical resources and functions to derisk and improve them.  image2410×1328 368 KB  Once enough MetaDAOs have been created, only the Maker Core and MetaDAOs will remain. This new MetaDAO paradigm is very powerful and provides the best of both world where the core is immutable and resilient, while the MetaDAOs are fast moving, innovative and contain highly specialized complexity. CreatorDAOs in particular can also begin to innovate and experiment in directions that are less directly tied to the Maker Core, unleashing the power of autonomous and innovate communities. Maker also will have no relationships other than a few predictable DAO2DAO relationships with the MetaDAOs and some key protocols such as D3M partners. All Core Units and other human relationships are intermediated by the MetaDAOs, ensuring Maker cannot fall into the relationship problem again.  image2466×1392 313 KB  M0 is the concept for the very first, low risk, proof of concept MetaDAO. It is a CreatorDAO that focuses on pursuing profit opportunties that are external to Maker, or that adopt complexity Maker wants to get rid of, such as small vault types. Deco Core Unit provides a well suited fundamental core value of M0 It is bootstrapped with the transition of the Deco Core Unit, receiving the budget currently allocated to Deco, and clustering with the Core Unit members. This can potentially also include resources and members of other Core Units that are aligned with the objectives of M0. Frontend with stability fee revenue share The Deco Core Unit already provides a perfect starting point for a strong and meaningful business model, as it both has frontend technology that the MetaDAO can use to provide a growth platform it can earn revenue share from stability fees it funnels to Maker - and this revenue share is affected by a very powerful feedback loop, since the vaults will have MetaDAO yield farming of M0 tokens, there will be a significant potential to earn cash, which will in turn make M0 tokens more valuable, further increasing the impact of the yield farming in a virtuous circle. Fixed rates bonus feature In addition to the baseline value proposition of providing a new frontend to Maker Vaults and earning revenue share from yield farming users, M0 can offer unique and advanced functionality by tapping into the primary product of the Deco Core Unit which is a tokenized fixed rate product, and this can be integrated directly into the M0 vault frontend, both creating opportunities for additional service fees and further increasing the potential for earning stability fee revenue share. Oracle profit opportunities Beyond the focus on a revenue share frontend with an integrated fixed rate product as a unique value proposition, M0 will focus on tapping into the other major hidden value proposition of the Maker ecosystem, which are the Maker oracle network. The most basic step will be that M0 “adopts” some of the existing Maker Oracle nodes. Adopting oracle nodes means to collateralize and take responsibility for the performance of the nodes, in return for a significant payment stream from Maker. This payment stream covers both budget that M0 can provide to the oracle nodes for them to upgrade their security processes and provide verification of their security, and also covers a “guarantee premium” that goes directly to M0 as profits. In return for this payment stream, Maker will now have a results claim against M0, and will be able to extract collateral from M0 in the event that there is outage, security issues, technical failure, oracle attacks etc caused by the oracle nodes adopted by M0. Additionally, M0 will be able to tap into a new token for the Maker Node Network, which is an evolution of the Oracle network. This token is meant to be yield farming to MetaDAO token holders, and M0 will be the first MetaDAO that can take advantage of this. The full details of the Maker Node Network and $MANO token are explained in the complete Endgame Plan document. D3M value generation through adopted vaults A key long term value proposition of all CreatorDAOs is that they will run their own “mini-versions” of the Maker Vault Engine that will act as a lending engine for the MetaDAOs, and will be specifically optimized for Maker to tap into through a D3M construct. This way CreatorDAOs can provide a simple and powerful way for Maker to outsource the onboarding of long tail collateral that is not suitable for Maker Core, but is still a good business opportunity. Such a MetaDAO Lending Engine will not be availabe for a long time, but before it becomes availabe it is still possible to simulate the same interaction through a MIP and governance regulated system whereby the MetaDAO adopts vaults in the main Maker Vault Engine. Maker Governance will specify all of the small scale vaults that fall below its minimum criteria for Maker Core vaults. M0 governance will then have the opportunity to adopt any of these vaults that it wants. When M0 adopts a Maker Vault, Maker will only earn a baseline, low stability fee on the vaults, while the MetaDAO earns all stability fees above this baseline (plus any frontend revenue share income, if applicable). However in return the MetaDAO will be collateralizing the risk of these adopted vaults, with maker extracting collateral from the MetaDAO to cover any losses it incurs from the adopted vaults. M0 will also be responsible for all oracle costs related to the adopted vaults. M0 will have complete freedom to adjust risk parameters (within some global bounds, including a maximum line of credit that is equivalent to the risk paramters of a D3M). M0 will also have the freedom to migrate the vaults to lower cost oracle providers such as chainlink, but assumes all risk of doing so and must do all the work itself, through it’s internal resources and governance process. Once the MetaDAO Lending Engine technology is ready, all adopted vaults are then transitioned to it. Develop unique metaverse identity M0 will be the first opportunity for a new, born-decentralized community to develop a completely unique, decentralized identity, that can potentially create additional intangible value for its community members, and also synergize with the frontend product by providing a unique brand that is optimized for attracting users. Once enough tokens have been distributed and the community has started to crystallize, the community can internally organize a process for picking a new name and token ticker. M0 will not operate any Maker Core Units and Maker will have no dependency on M0 Since M0 is the first MetaDAO, it is uniquely designed to be reversible, meaning that it can be relatively easily unwound if the concept turns out to not deliver the kind of growth and momentum expected. It is also important to note that any Core Unit members that join M0, including the Deco Core Unit members will not be “adopted” by M0 (meaning they will not continue to work as Maker Core Unit but managed and with results guarantee from M0, which is a functionality other MetaDAOs can have). Instead they will fully join the MetaDAO and become internal Core Units of the MetaDAO. This means they take more risk, but also get higher rewards in the form of more MetaDAO tokens and more direct exposure to the result of their own work. Additionally, as an incentive for them to take the pioneering risk, Maker will provide M0 with the resources that would otherwise have gone towards the Core Units that switch to becoming internal MetaDAO core units. So the MetaDAO will have plenty of cash and even MKR to make sure that anyone who makes the switch will get a significant raise as a result of the additional risk and leadership responsibility they take.  image2312×942 251 KB  The lowest hanging fruit of the Endgame Plan Launch is the acceleration of the existing roadmap milestone to quickly launch a simplified version of Synthetic ETH. Maker has always planned to eventually develop synthetic assets for other targets than just Dai, including both other currencies but also volatile assets like ETH. Synthetic ETH is a uniquely powerful product that synergizes especially well with the coming Merge, as synthetic ETH serves a usecase inbetween native ETH and Staked ETH tokens, by both offering very high liquidity but also exposure to ETH staking rates. It is possible to very quickly bootstrap a fully functional synthetic ETH simply by creating a simple wrapper around a liquid staking token, such as Lido Staked ETH (or possibly a smaller Staked ETH product if Lido starts to throttle its yield, even though that is less ideal) Maker Governance then retains full authority over this simple Staked ETH wrapper, and can later upgrade it to a fully fledged Synthetic Asset once the technology is available, the minting rights for the Staked ETH wrapper to the vault engine of the Synthetic Asset and transferring all the collateral from the wrapper into a PSM in the Synthetic Asset. MATH may be the first Endgame Product that should be released, since it can be a powerful standalone product even before M0 token yield farming begins, since it can be initially growth hacked by giving it a 0% stability fee, building up a user base in advance of the M0 farming.  image2344×1266 227 KB  M0 tokens, initially denoted $MZR until the community chooses a new name, will be distributed through fair launch yield farming with no insider allocations, in order to maximize benefit to the broader Maker Ecosystem and create a community that decentralized from scratch. This includes MZR farm for Dai holders, which provides Dai holders an alternative to earning DSR. This way distributing the free MZR tokens still provides Maker a benefit, since it will be cheaper for Maker to offer a high DSR since many users will not use it, and instead choose the MZR farm. The planned main target of MZR yield farming rewards are MATH vaults, specifically debt of MATH Vaults. This helps provide a massive incentive for Dai to be backed by more decentralized ETH as collateral, reducing the stablecoin ratio and increasing decentralization of the system. Maker also has the ability to earn cash in return for the free MZR token that are farmed out, because Maker can charge a stability fee on the MATH vault debt. The stability fee for vaults used for farming could be dynamically increased to capture some of the value of the free MZR tokens, by for instance setting it to its base rate + 20% of the APY provided by the MZR farm. This creates significant value preservation as Maker is able to turn tokens into cash, and this boosted cash flow allows Maker to easily fund many of the new expenses introduced by the Endgame Plan, such as Stability Fee revenue share and adoption guarantee premiums for oracle nodes. Finally an important role of the MZR farming plan is to provide a powerful incentive for MKR holders to delegate their votes. As soon as it becomes possible to earn free MZR tokens by delegating MKR, there will be a massive burst in active delegation. Many of these votes will be intelligent and thoughtful voters, but many of them will also be users that just pick a random delegate in order to farm the MZR tokens. This is why it is extremely important to first solidify Maker Governance and put proper checks and balances in place around delegates, so it will be safe to unleash delegation incentives at the launch of M0.  How MetaDAOs help solve the difficult problems  image2466×1350 310 KB   image2398×1216 321 KB   image2178×1246 243 KB   image2244×1324 335 KB   image2320×1198 234 KB   image2380×1336 244 KB  The Endgame Plan is designed to be a snowball that is released from a hilltop. As it starts to pick up speed and MetaDAOs are created, the incentives that drive the MetaDAOs will then lead them towards building out the pre-determined Endgame State where the Maker Core has clearly defined, powerful but simple features, and then has the ability to incubate MetaDAOs and let them be responsible for any further innovation.  Benefits of the Endgame Plan The complete Endgame Plan document contains all the details of what this end state looks like, and how the incentives that drive the workforce, the MetaDAOs and Maker Governance reliably towards that end state. This includes powerful product designs for things such as the Singularity Engine tokenomics and vault engine, the Elixir wars tokenomics synergy, the $MANO token for Maker’s oracle and staking network, the MetaShard Maker rollup, synthetic assets, and other powerful features. Below are some of the outcomes listed in TL;DR format to help summarize all the benefits the Endgame Plan provides to the project The complete Endgame Plan will be released later this week.  image1920×1041 130 KB   image1870×1228 157 KB   image1920×1042 158 KB   image1920×947 111 KB  ",
                    "links": [
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-7-traduccion/15632",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-26-june-01-2022/15569",
                        "https://forum.makerdao.com/t/recopilacion-de-noticias-sobre-makerdao-dai-y-mkr/14694/61",
                        "https://forum.makerdao.com/t/specialization-unlocks-complexity/15709",
                        "https://forum.makerdao.com/t/recopilacion-de-noticias-sobre-makerdao-dai-y-mkr/14694/67",
                        "https://forum.makerdao.com/t/relay-semanal-21-27-de-junio-del-2022/16272",
                        "https://forum.makerdao.com/t/embedding-legal-analysis-on-new-governance-proposals/15581",
                        "https://forum.makerdao.com/t/mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14482",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-7/15618",
                        "https://forum.makerdao.com/t/weekly-relay-june-21-27-2022/16158",
                        "https://forum.makerdao.com/t/endgame-index-list/16021",
                        "https://forum.makerdao.com/t/independent-review-of-alm-framework-for-makerdao-and-suggestions-for-balance-sheet-optimization/15730/6"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7658422735428685
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#2",
                    "likes": "6",
                    "time": "30/05/2022-19:58:45",
                    "content": "Thanks for this comprehensive post and proposal @rune - it’s safe to say it’ll take a little while for me to fully wrap my head around all the moving parts here (though I appreciate the pictures!) I do have a clarifying question based on an initial read-through, though. I completely agree that Maker’s complexity spiral is a problem and it is not good that the protocol is menacingly opaque to newcomers. However, the Endgame Plan seems to take this complexity and ratchet it up a hundred notches, preserving the protocol’s existing high barriers to entry and adding things like:     rune:  Singularity Engine tokenomics and vault engine, the Elixir wars tokenomics synergy, the $MANO token for Maker’s oracle and staking network, the MetaShard Maker rollup [etc]   This seems like an extremely complicated reform - that isn’t necessarily a bad thing, but it’s not clear to me how it makes governance easier for either MKR holders or DAI holders? Even if they don’t have to be across the detail of each MetaDAO, it seems like they probably will want to (or need to) understand the Singularity Engine, Elixir wars, $MANO etc. One thing I really liked about the case for Clean Money  was its simplicity and how it would be easy to see such a clear, strong narrative take hold (both in the DAO and in wider perceptions of Maker). That simplicity and clarity seems absent here - and I’m conscious that this isn’t even the complete plan! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.074725877192982
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#3",
                    "likes": "7",
                    "time": "30/05/2022-20:11:17",
                    "content": "Thx, and this is a good point. In some ways the Endgame Plan can be seen of as the “back end” of the Clean Money Initiative. Meaning, many of the things that are discussed in the Endgame Plan are things that are only necessary to understand completely by a larger group at the time they are implemented, and once implemented will simply run themselves without all parts being necessary to understand in detail by everyone. This kind of self organization is done by e.g. ensuring that governance properly categorizes and independently analyzes the different important parts (with mechanisms such Voter Committees and Scope Maps). There are also very strong derisking features that help significantly deal with the complexity, and this is all provided by the MetaDAOs. And MKR holders or Maker users specifically do not need to understand the MetaDAOs at all. From MKR governance perspective the MetaDAOs are like mini-Aave’s that receive a line of credit via D3M and then go off and take care of collateral onboarding. In addition to that, they also take care of other services, such as oracles and core unit management, but all these things basically stay the same, with the main difference that now Maker interacts with a collateralized middle-man rather than individual humans. And fundamentally, the Endgame Plan is not a complexity spiral because it provides a finite and immutable roadmap and scope that is designed to work holistically. This also necessitates a lot of complexity planned in the roadmap, far into the future, because Maker Governance will have to agree up front on the permanent features of the system, and once agreed, this is unlikely to ever change. The Singularity Engine is the central feature of the Endgame Plan that advanced users will get exposed to, it is basically the tokenomics and vault engine of Maker at the Endgame state. But most of its complexity is abstracted away from end users. For Vault users it means that you can farm tokens and that gas costs are cheap, especially for things like recursive leverage. For MKR holders the Singularity Engine allows you to lock up your tokens and then get basically every benefit that it’s possible to provide a token holder, including multiple types of yield and the ability to generate Dai. Things like Elixir Wars, Maker Node Network etc are MetaDAO features that aren’t necessary for even MKR holders to get into. This list from Part 2 actually provides the full scope of everything the core of Maker will do in the MetaDAO paradigm with a few bullets:  image1394×1820 245 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.638425925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#4",
                    "likes": "1",
                    "time": "30/05/2022-20:17:23",
                    "content": "There is a good chance farming metadao tokens with MKR will increase demand to borrow Maker too. It could become a lot more profitable to lend Maker out to people who want to speculate on the value of these tokens. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#5",
                    "likes": "5",
                    "time": "30/05/2022-20:30:47",
                    "content": "This is true, but the main issue that lending out MKR usually causes is that it is dangerous if there is also voter apathy. MetaDAO farming also solves voter apathy so in this scenario the ability to lend out MKR and get a good return just becomes another value proposition of MKR, rather than a risk to the system, IMO. Practically, the impact on governance of this behaviour will be that the top recognized delegates receive more “random, sticky” votes from the MKR borrow arbers. Random, sticky voting behaviour is generally the downside of voting incentives since it means that the status quo gets a lot of voter support with zero thought being put into it beyond going through the motion in order to get the reward. This is not a lot worse than voter apathy though, and also MKR holders that lend MKR to lending platforms would likely also just do random, sticky voting behaviour if they farmed the voting incentives directly. The random, sticky vote problem means the top recognized delegates will become more powerful in governance, since they are the default choice in the governance frontends and means that counterbalances like Voter Committees need to be built well enough to handle the powerful delegates (as well as other systems such as more sophisticated rules for what delegates show up at the top by default in the frontends). The later parts of the Endgame Plan also includes the Budget Allocator system which is a further check on the political power of top delegates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.44683908045977
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HospitableOryx",
                    "index": "#6",
                    "likes": "1",
                    "time": "31/05/2022-05:12:30",
                    "content": "Thank you for the detailed write-up. I will need some time to digest this as well.     rune:  A synthetic “global” list of Focus Objectives is created by adding together the MKR totals of different focus objective list from different voter committees, which enables minority MKR holders to also have an impact on the overall prioritization rather than being completely overruled by the MKR majority.   Can you provide an example of how this calculation works and how it provides more weight for a small MKR holder than the current system? Apologies if I missed it. Additionally, will the MetaDAOs have a capacity to raise funds outside of securing additional budget from the core? I’m trying to understand if this concept will eventually create a “market” of competing metadaos, some of which have similar purposes, and may want to raise their own funding if they’re exceptionally confident in their plan. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.660714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#7",
                    "likes": "0",
                    "time": "31/05/2022-08:06:58",
                    "content": "Good question, this is something that’s quite specific and while i can definitely come up with a suggestion I think in practice we’d need to experiment and see what actually makes sense, and revise it over time as we see the results. There probably isn’t a perfect algorithm that just makes it all work (or maybe there is and some voting nerd knows how to do it), but I think a decent compromise can be achieved through some sort of “hack” rule, such as reducing the effective vote for each priority below the first by 10%. So if you have 200 MKR signal for A > B > C > D And then you have 100 MKR signal for D > A Then you get A (200 + 90) > D (140 + 100) > B (180) > C (160) (I may have messed up the math here). So the outcome is that D is prioritized with resources above B and C, even though the MKR majority wants those prioritized first. Of course no matter what we choose we will immediately run into edge cases that will require Core Units to make judgement calls like they do today with things like greenlight polls, and in the end Core Units will always have autonomy to prioritize their resources according to their own incentives (that’s just the nature of DAOs), voters just have a clear framework to signal their preference and impact those incentives through an ability to monitor how well the focus objectives are followed, so a clear justification can be expected when Core Units deviate from the focus objectives in situations where they are unambiguous (such as in an emergency, or in rare cases because of some sort of low hanging fruit situation). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0964912280701755
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "0",
                    "time": "31/05/2022-11:04:10",
                    "content": "    rune:  Focus Objectives can quickly change as market conditions or other external factors forces them to change. The best example is in the case of hacks or other critical risks, in which case mitigating the risk immediately takes the top spot as focus objective. In order to allow Focus Objectives to rapidly change and be flexible enough to serve their intended purpose, they are created through offchain polling done at Voter Committees. A synthetic “global” list of Focus Objectives is created by adding together the MKR totals of different focus objective list from different voter committees, which enables minority MKR holders to also have an impact on the overall prioritization rather than being completely overruled by the MKR majority.   More of a commentary than a question here. Trying to digest it all—and like many in the community—I’ll digest it in multiple sit downs  So far, I believe this DAO has taken an agile approach versus a waterfall methodology and that’s probably one of the reasons why it has had its inefficiencies. But, as you say— crypto does change rather quickly and the agile methodology allows Core Units like CES and PECU to perform “sprints” and being “agile” works best when the scope is not known. Therefore, while a waterfall approach does make sense and I believe it is now a “must” — we still need to remain “agile” — as nothing in the changing scope of crypto should ever surprise MakerDAO.     rune:  Ultimately, Core Units have freedom to interpret and follow the Focus Objectives in the way that they think will be best benefit the DAO, but failure to follow it must be monitored and documented by the Supporting Core Units including the reasons for not following the Focus Objectives. MKR holders can then use the data to make adjustments to Core Units, such as adjusting budgets, based on which Core Units are delivering the results that MKR holders want.   I believe MKR token owners will also need to interpret that certain high-degree synchronization will hit roadblocks and delay deliverables. As an example, designing a new RWA module might need analysis, construction, testing—and sometimes the synchronization of such does not always run smoothly. Hence, it won’t be necessarily the fault of a CU failure to deliver on a timely manner. All in all I get your drift and how this proposal looks to aligned the focus of the DAO. For far too long we have been all over the place, without an aligned vision. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.965895215895216
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#9",
                    "likes": "0",
                    "time": "31/05/2022-12:12:19",
                    "content": "    rune:  A synthetic “global” list of Focus Objectives is created by adding together the MKR totals of different focus objective list from different voter committees, which enables minority MKR holders to also have an impact on the overall prioritization rather than being completely overruled by the MKR majority.   Can you please explain further: How are MKR assigned to focus objectives? Is this the result of the off-chain polls? (Snapshot vote like scenario?) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#10",
                    "likes": "2",
                    "time": "31/05/2022-12:59:10",
                    "content": "    flipflopflapdelegate:  I believe MKR token owners will also need to interpret that certain high-degree synchronization will hit roadblocks and delay deliverables. As an example, designing a new RWA module might need analysis, construction, testing—and sometimes the synchronization of such does not always run smoothly. Hence, it won’t be necessarily the fault of a CU failure to deliver on a timely manner.   Also keep in mind that in the Endgame Plan, anything related to RWA will be done by MetaDAOs. So they can start off with directly copying the governance structure of Maker if they have no better ideas, but then can freely adapt their governance structure based on their experience with how it works together with their area of specialization. So there will be many different opportunities for innovation in governance process, prioritization, decision making etc. However, at the maker level we want to maximize only for predictability, reliability, immutability and automation because that is what will make Dai a valuable product, which is our ultimate goal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.422850958565244
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#11",
                    "likes": "3",
                    "time": "31/05/2022-13:08:59",
                    "content": " Can you please explain further: How are MKR assigned to focus objectives? Is this the result of the off-chain polls? (Snapshot vote like scenario?)  My current thinking is that focus objective lists are decided on a voter committee basis. So basically a bunch of MKR holders and delegates get together. They all prove through off chain signing that they have x votes under their control. Then they invite core units to provide professional input about what opportunities exist. Then finally they discuss and the voter committee reaches a consensus about the focus objective list for their voter committee. This could also be formalized further by using a off chain voting platform to directly poll support for a particular focus objective list, but I think that in general prioritization doesn’t lend itself to something you ask random people about. It makes sense that only voters that are very deeply involved in governance, i.e. sitting on voter committees, should have anything to say about prioritization. So in the end focus objective lists are not as formal a structure as e.g. signal requests or governance polls. They can more be seen as an easily understood signal from active MKR holders to core units about what they think is important and that they as voters will hold them accountable to, so core units can get an idea of what the community actually wants and is paying them for, which is a feedback loop that’s currently lacking. Like I said earlier though, I think something like this needs to be approached very practically and we need to see what works and makes sense in the wild. I also think it’s likely that the whole concept of focus objectives will be less important over time, and eventually will disappear entirely as the DAO becomes decentralized and autonomous enough. In the short run though, it is a very powerful tool to align about what are our immediate next steps in this sea of opportunity, so that we can all act in unison to achieve amazing things and get things like the practical steps of the Endgame Plan done etc. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.491428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#12",
                    "likes": "2",
                    "time": "31/05/2022-13:15:51",
                    "content": "There was a good discussion on discord about the pros and cons of having a bounded, immutable scope like the Endgame Plan envisions. Will copy paste some of it here to share my view about this.  “…it must contain all innovation that will ever happen on the Maker core…” That is a massive requirement for the Endgame Plan and doesnt sound so realistic. DeFi is pretty new and governance is a work in progess. There will undoubtedly be experimentation with some things working and others failing, but both outcomes generating learning and progress.   An attempt to capture all needed future innovation now in one plan does not appear realistic. Where is the room for continuing innovation and sometimes failure? f you miss some key points, will they come in an Endgame 2.0 in twelve months?  And my response: We have reached the point where it is now possible to define the complete scope of the core and still make it extremely future proof. Of course, it would still be possible to make changes over the short run (a year ish) and minor changes over the longer term. Long term optimizations such as gas efficiency or horizontal expansion can also be done following a permanent process with bounded scope. And in theory, you can always change things, but the reality is that major change is never realistically possible in decentralized system. If you have a decentralized system and it goes through a huge pivot, that requires a leading force, and they will always have the option to use the period of change to consolidate power and potentially permanently centralize the system. This means that systems that are properly decentralized will always be able to resist this, and if your value proposition is a decentralized infrastructure layer it will never be worth it to put that the main value prop at risk for the sake of some new feature, when that can simply be built on top, e.g. through a metaDAO I was a bit surprised to find out that this is really the case, but basically innovation in core DeFi primitives has already ended. We just went through an entire bill cycle for defi much larger than anything seen before, yet no new primitives were invented and it’s still maker/aave/uni that’s relevant now that the dust has settled Of course there may still be more stuff in the long term but the risk/reward of accepting that it will be very hard - maybe even impossible - to include such primitives once we are properly decentralized is worth it when what we get in return is a path to irreversibly locking in strong decentralization. But basically the general feedback of “it’s too complex, make it simpler” + “this can’t possibly be the final design” is the reaction we got to the dai stablecoin back in the day. We did end up making a design change with how liquidations were approached but other than that the design was right, and that’s because it was created by copying and synthesizing existing concepts that had already been market tested I look forward to post the full design so everyone can look at all of the parameters and provide concrete feedback And with decentralization I mean Bitcoin-like, or maybe a better analogy is ethereum and ethereums endgame plan, which is its final spec. Dai can never become as decentralized as Bitcoin or eth, but we should strive to move maximally in that direction and the Endgame Plan is IMO the best possible answer to how to be as decentralized as possible while also supporting as much growth, scale and impact as possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.515007505934926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#13",
                    "likes": "8",
                    "time": "31/05/2022-15:48:47",
                    "content": "    rune:  The Focus Objectives represent the overall most impactful developments that the Core Units prioritize, following a “waterfall” approach where thigns are prioritized at the top of the list and resources can only flow to objectives that are lower on the list if higher ranked objectives have all their needs fulfilled.       flipflopflapdelegate:  an agile approach versus a waterfall methodology   Something got lost in translation here: the waterfall approach from @rune’s post is not the same as the project management methodology that’s typically indicated by the term. By waterfall, Rune means that, first, the highest priority gets all the needed resources to execute as fast as possible. Then, the resources that are left are utilized to execute the second-highest focus objective on the list. Unallocated resources after that go to the third focus objective, etc. A waterfall approach in project management (typically contrasted with agile) means something different. It is the opposite of an iterative approach on the planning and execution phases: instead of going through ideation > design > implementation > launch multiple times, iteratively building the solution, with a waterfall project management methodology there is 1 sweep wherein all ideation is done, then all design, and then the full implementation is built. Two different concepts that aren’t mutually exclusive. There is nothing that says the DAO can’t maintain an agile approach, even with “waterfall prioritization.” It’s actually a common misconception that agile means that there is no plan, or no analysis before implementation starts. All these are possible in agile, it’s just that they are iterated over so that the scope gets redefined over time, rather than done once with perfection as the immediate goal (with analysis paralysis etc. as a potential consequence.) Agile principles such as early user feedback etc. should definitely be preserved, and I don’t think the Endgame Plan argues against that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.684343434343434
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#14",
                    "likes": "2",
                    "time": "31/05/2022-17:23:50",
                    "content": "    wouter:  A waterfall approach in project management (typically contrasted with agile) means something different. It is the opposite of an iterative approach on the planning and execution phases: instead of going through ideation > design > implementation > launch multiple times, iteratively building the solution, with a waterfall project management methodology there is 1 sweep wherein all ideation is done, then all design, and then the full implementation is built.   Indeed—-I was using the analogy based on the statement that the crypto landscape changes rapidly, and  changing the scope of the waterfall approach might be in play at any given moment. As example, imagine (humor me for a moment) regulators ask that All decentralized stablecoins collect Vault User data (again, humor me) and such requirements need to be implemented within 90 days, before incurring daily monetary fines. The scope of the waterfall might change. But I get your drift, and you’re spot on with regards to such analogies used mostly for PM—it was probably not the best way to do a comparison. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.992424242424242
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#15",
                    "likes": "5",
                    "time": "31/05/2022-19:18:31",
                    "content": "Here is a interesting counter example. The US Constitution is considered one of the most profound achievements in governance and representative democracy.  When James Monroe, Thomas Jefferson and the other authors designed this new form of governance, they realized that though their new design was a tremendous innovation and improvement versus what else existed at the time, they also realized that their governance system may need to be updated to reflect later changes and innovations.  As such they build a process to amend the core Constitution when needed.  And there have been many amendments passed since them. Perhaps Maker is being a bit optimistic in believing it has include all needed future innovation in the Endgame Plan for MakerDAO?  Can Maker do better than James Madison, Thomas Jefferson, Alexander Hamilton, Benjamin Franklin et al. did? I see value in changes that significantly improve governance today but also allow for continued testing and improvements in the future.  I also firmly believe that Maker must to attract additional subject matter expertise into governance to succeed and am not sure the Endgame Plan focuses enough on this key dimension ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.611244019138756
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#16",
                    "likes": "1",
                    "time": "31/05/2022-19:53:26",
                    "content": "    rune:  Like I said earlier though, I think something like this needs to be approached very practically and we need to see what works and makes sense in the wild.   100%! And thanks for the deeper explanation. My point was simply referring to the original post were Focus Objectives didn’t have an MKR weight attached, and then they did. I’m currently trying to create a TL;DR version of your post that still has most of the meat in it. Will be posting questions that arise as I go through it. Please excuse the slow execution, currently on the go and don’t have as much time and attention to devote to it as I would like to have. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#17",
                    "likes": "4",
                    "time": "31/05/2022-20:10:55",
                    "content": "    Eumenes:  he US Constitution is considered one of the most profound achievements in governance and representative democracy. When James Monroe, Thomas Jefferson and the other authors designed this new form of governance, they realized that though their new design was a tremendous innovation and improvement versus what else existed at the time, they also realized that their governance system may need to be updated to reflect later changes and innovations. As such they build a process to amend the core Constitution when needed. And there have been many amendments passed since them. Perhaps Maker is being a bit optimistic in believing it has include all needed future innovation in the Endgame Plan for MakerDAO? Can Maker do better than James Madison, Thomas Jefferson, Alexander Hamilton, Benjamin Franklin et al. did? I see value in changes that significantly improve governance today but also allow for continued testing and improvements in the future. I also firmly believe that Maker must to attract additional subject matter expertise into governance to succeed and am not sure the Endgame Plan focuses enough on this key dimension   I think this is an interesting comparison, but IMO it proves my point, since you are comparing a decentralized stablecoin protocol to a sovereign state. A sovereign state has to regulate literally everything, physically and digitally, that humans do, and it has to run massive institutions with thousands of humans that can be tasked with doing any arbitrary thing, including, of course, a military. Meaning the governance model of a sovereign state needs to processes that can handle infinite complexity about literally any subject. All of these things are necessary for a sovereign state to be able to do what it needs to do. Decentralized stablecoin protocols can luckily choose to have a much, much simpler scope than this, and still be able to do what they need to do. IMO it is quite obvious that users of Dai would be happy knowing that Maker isn’t a country that could at any time decide it is pivoting its focus towards something random, or even worse, go to war. Best example is the reason why we are mistrustful of fiat currency in the first place, since such an infinite and random scope could soon enough result in whatever the new focus is being used as justification for inflating Dai, or even worse cause security negligence. So basically I think this is a good comparison in the sense that it frames the Endgame Plan as the choice that Maker should NOT be like a country or a government, and that we should take steps to permanently and provably prevent the possibility of such extreme scope creep from ever happening. Finally, I want to make clear that the Endgame Plan can never truly and completely with 100% certainty prevent changes to the scope. It can just make it so extremely hard that only improvements that are truly once-in-a-lifetime golden goose back to back amazing and have absolutely near-perfectly unanimous consensus, could ever pass through governance. And in reality this isn’t gonna happen with 99% certainty, but of course if it did happen it would just be a great thing, since everyone would be happy and everyone would win. Earlier on, as we move towards the Endgame State, the possibility of major changes will of course also be a lot higher. A governance lockdown doesn’t happen from one day to another, because it isn’t a technical switch that you just flip, it’s a political ossification that happens naturally once the right conditions are in place. Nobody planned for bitcoin becoming unupgradable, it just happened one day. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.705098878394333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#18",
                    "likes": "3",
                    "time": "31/05/2022-21:50:01",
                    "content": "I don’t see how the capital raise is necessarily mutually exclusive with the subDAO concept. I think both plans have merit. I would like to see a combination of both. For instance, use revenue-based financing to raise capital and use that to seed the subDAOs thereby accelerating growth, minimizing concentration risk, and increasing censorship resistance through decentralization. In the same way that Synthetix/Kain spun out Kwenta, Lyra, and Thales, MakerDAO/Rune should do a spin-off of RWA LendCos. Give them a couple of months’ worth of capital to get the employees needed to create methods to tokenize/onboard assets like home loans, car loans, life insurance loans, credit card loans, etc. This will be an iterative process that will take years, so we have to properly incentivize stakeholders to stick it out for the long-term vision of MakerDAO. Short-term the price of MKR will go up from people yield farming the airdrops that will be announced. Since they won’t know the snapshot date they will be forced to hold long-term. This creates a long runway for RWA LendCos to lure the best and brightest from boring 9 to 5 jobs to the frontier of financial innovation in MakerDAO. By giving employees RSUs using Fairmint, they will have a vested interest in maintaining the highest underwriting standards or else they run the risk of having the entire business venture go under and their stock becomes worthless. However, if they succeed they can provide equity upside for MKR by getting a percentage of the equity financing round as a kind of convertible bond for the seed capital. The benefit to the subDAO is a soulbond token that represents a seat at the table of Maker governance. This checks the power of both sides preventing anyone from becoming tyrannical. The revenue-based financing can be a percentage of every dollar earned like 15-25%. This way the more Maker earns the faster the bond investor gets paid. The lower the earnings, the longer before they have their principal returned. It aligns the long-term interest of equity and bond investors while protecting the bond investors from dilution since that’s a risk equity holders are being rewarded for whereas bond investors are not. This would be tantamount to a DeFi business development company. America loves tax-paying job creators. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#19",
                    "likes": "3",
                    "time": "31/05/2022-22:35:01",
                    "content": "@rune Thanks for putting this post together. There is a lot to unpick here, which will definitely take some time while the process is iterated. A couple of considerations to get started:  The move from single DAO to MetaDAO/subDAOs is as important an organisation shift as what happened in the shift from Foundation to CU framework. Probably even bigger given that that first decentralisation phase had a body (the Foundation & Amy + others) coordinating the transition. That “coordinating body” is no longer here, not formally at least. This decentralisation 2.0 will therefore likely have exponentiated challenges at multiple levels (tech, people, financial etc). They are not impossible to overcome though. The CU framework is only 1 year old and so far has survived…  How are you thinking about organising that “coordinating body” to enable this decentralisation 2.0?  With (1) in mind, I think the test with an “Experimentation MetaDAO” with Deco is probably a reasonable approach, rather than a full blown organisational shift all at once. In automated decisioning systems for Credit Risk Management, it is very common to implement Champion-Challenger strategies to obtain the best outcome (e.g. profit, revenue, reduced losses etc) by implementing competing strategies (challenger) at small scale but statistically significant enough to showcase a needed change. In the same spirit as an experimentation, these Champ-Challenger strategies are rarely done across whole portfolios. They’re targeted. Then, once the challenger gives a better output than the existing champion, that becomes the new Champion. The process is repeated multiple times over given time windows.I see this “experimentation DAO” as a similar approach but applied at an organisation level. A key characteristic of champ-challenger approaches however is to define clearly the expected output prior to experimenting, but also how to benchmark it against the existing Champion in a meaningful way, quantitatively and qualitatively.  How are you thinking about that “experimentation” benchmarking in the case of Deco? Second to that, is such a benchmarking scalable across different MetaDAOs? Or do you think each new MetaDAO Champ-Challenger will require its own benchmarking framework? (This is more relevant to the ones existing than to novel Growth subDAOs with no equivalent in the current CU framework)  With regards to the evolution of MetaDAOs beyond the first experiment, how do you see the interaction cross MetaDAOs working? To give an example, currently CUs that are more business or risk focused leverage the tech/expertise of CUs that are more engineering focused (PECU, CES etc).  Do you see replication of each of the tech functions within each MetaDAO or more a framework of “satellite MetaDAOs” that bridge across several purpose-focused SubDAOs (e.g. RWAs, D3Ms etc)? Just a few initial thoughts for consideration. Keen to hear your views on the above. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.678169746919747
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#20",
                    "likes": "2",
                    "time": "31/05/2022-23:08:57",
                    "content": "    ejbarraza:  In the same way that Synthetix/Kain spun out Kwenta, Lyra, and Thales, MakerDAO/Rune should do a spin-off of RWA LendCos. Give them a couple of months’ worth of capital to get the employees needed to create methods to tokenize/onboard assets like home loans, car loans, life insurance loans, credit card loans, etc. This will be an iterative process that will take years, so we have to properly incentivize stakeholders to stick it out for the long-term vision of MakerDAO.   This  right here! I don’t think folks understand what the Synthetix community has quietly built via Optimism, and now the SNX token holders are being rewarded. Was it painful? For sure! But as the saying goes, no pain no gain. Upwards and onwards! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.527423469387756
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#21",
                    "likes": "3",
                    "time": "01/06/2022-04:36:36",
                    "content": "    rune:  Maker can then use the already well tested and understood D3M construct to let these MetaDAOs carry out the RWA work on behalf of Maker, with much less overhead and complexity for Maker.   POC, the D3M is MIP50 and has been deployed with Aave and had specific goals around the lending rate. There was significant learning (e.g. risk) with that deployment that we hope to carry forward in other potential implementations of the D3M. This is a nascent collateral technology that could have future applications depending upon our risk appetite and conversations around the surplus. Currently, the second implementation is a refactor of the original D3M technology (MIP50) and is targeted towards Compound. We are still in development and smart contract audits are planned for July with a rollout shortly after. It has yet to be determined the additional applications of the D3M technology. IMO, with the current use cases, the D3Ms carry more risk and complexity due to the counter party protocol risk (we are only as safe as our partner’s code), manual ongoing maintenance (ensure the terms are enforced), and ongoing integration updates (changes to the partner’s protocol). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4836309523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#22",
                    "likes": "3",
                    "time": "01/06/2022-04:53:38",
                    "content": "    rune:  First the very first MetaDAO a major challenge will be to attract workforce talent that is willing to make the jump into a new unknown structure. For that reason, Maker must provide very attractive benefits for those who pioneer taking the risk on this transition. This can be done by both continuing existing budgets and MKR bonuses and committing them to the new MetaDAO for a long term duration, and then on top of these existing benefits, the MetaDAO can also provide a significant MetaDAO token budget to the pioneers, creating an attractive risk/reward opportunity.   You are suggesting that one function inside of the MakerDAO, with the least risk, to potentially have the greatest gain. For me, this is a function of an appetite for risk for each of the Core Units (CU). If this is a transparent and open process, where is the offer for all CUs an opportunity to participate as a pioneer? For me, I want to be clear, this is about mitigating MakerDAO risk. If this experiment doesn’t go as planned with a non-critical CU, all is good and we continue as “normal.” Remember, some CUs that would be interested in being a pioneer can’t move due to the obvious disruptions if it didn’t work out. So, they get a different deal?? If an offer is to be made, I would ask it stands for all CUs regardless of timing. If different CUs get different deals, we are no better than where we are today with the problem statements you’ve already mentioned. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.001966783216783
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#24",
                    "likes": "5",
                    "time": "01/06/2022-09:57:06",
                    "content": "As discussed with @Real-World-Finance, @monkey.irish and teams, The incubated LOVE-001 core unit (not yet ratified) is preparing a holistic forum post on the D3M describing, at a high level, the technological and strategic aspects of the technology, and what the core units are focusing on during the declination of such technology for each use case. D3Ms aren’t all created equal, and the risks and rewards of this protocol-to-protocol programmatic liquidity will depend heavily on the underlying tech of the target protocol. Personally, I am a strong believer of the D3M where Maker outsources heavy lifting to the best-in-class protocols that have naturally emerged in their respective fields by leveraging its competitive advantage (cheap liquidity in huge size). In this the D3Ms are IMO an organic realisation of @rune’s MetaDAO vision. The technology, however, is nascent and a lot of work needs to be put in to ensure that we deploy DAI in a safe way - given that we will ultimately lose control over the underwriting process when liquidity leaves our protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.66388888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#25",
                    "likes": "1",
                    "time": "01/06/2022-14:13:19",
                    "content": "    rune:  and this revenue share is affected by a very powerful feedback loop, since the vaults will have MetaDAO yield farming of M0 tokens, there will be a significant potential to earn cash, which will in turn make M0 tokens more valuable, further increasing the impact of the yield farming in a virtuous circle.   Sorry, but I don’t understand how this works? The MetaDAO shares profits with Maker. In which form? Where are the vaults? And how is there yield? Where does the yield come from? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.637499999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#26",
                    "likes": "0",
                    "time": "01/06/2022-14:18:16",
                    "content": "    rune:  Oracle profit opportunities Beyond the focus on a revenue share frontend with an integrated fixed rate product as a unique value proposition, M0 will focus on tapping into the other major hidden value proposition of the Maker ecosystem, which are the Maker oracle network.   Can you please explain why this is done by the same MetaDAO as the fixed-rate business? It seems a bit like mission bloat. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.204861111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#27",
                    "likes": "0",
                    "time": "01/06/2022-14:50:42",
                    "content": "    rune:  It is also important to note that any Core Unit members that join M0, including the Deco Core Unit members will not be “adopted” by M0 (meaning they will not continue to work as Maker Core Unit but managed and with results guarantee from M0, which is a functionality other MetaDAOs can have). Instead they will fully join the MetaDAO and become internal Core Units of the MetaDAO.   I guess this is a typo: The team members will be adopted by the MetaDAO and cease to work for MakerDAO, right? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.700892857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#28",
                    "likes": "5",
                    "time": "01/06/2022-15:13:10",
                    "content": "    luca_pro:  Maker outsources heavy lifting to the best-in-class protocols   I agree. To outsource and automate these processes is the goal. The current use case for the D3M is listed in MIP50: The Direct Deposit Module interfaces with third party lending protocols to enforce a maximum variable borrow rate for selected assets. Maker Governance is able to pick a target variable borrow rate, and the module will automatically deposit/remove liquidity to ensure that target rate is hit. The D3M is a collateral technology and it feels like “D3M” has morphed into a verb. When I see the community use this term, it represents something that does not exist today. It’s the evolution of this technology, based upon specific use cases, that will allow us to outsource and automate the functions supporting RWA collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.464285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#29",
                    "likes": "10",
                    "time": "01/06/2022-15:25:53",
                    "content": "    rune:  The Endgame Plan is designed to be a snowball that is released from a hilltop. As it starts to pick up speed and MetaDAOs are created, the incentives that drive the MetaDAOs will then lead them towards building out the pre-determined Endgame State where the Maker Core has clearly defined, powerful but simple features, and then has the ability to incubate MetaDAOs and let them be responsible for any further innovation.   I made an abbreviated version to help me understand this proposal. I’m really impressed by the amount of thinking and innovation here. Great push. My abbreviation is meant as a shorter, easier to read introduction and leaves out some details in the original proposal. Comments are warmly welcome, I hope this creates some value for others as it has for me.  docs.google.com    Maker Endgame Plan Abbreviated raphbaph The Endgame Plan parts 1&amp;2 TL;DR The Endgame Plan is an ambitious initiative to create a finite roadmap for MakerDAO. A step by step process to a predetermined, immutable end state that significantly improves governance dynamics and taps into the...      ",
                    "links": [
                        "https://docs.google.com/document/d/1BIKNmuKD2l3B8eT4_qRlr_1i5bXU6uAKMrGlOAMSL68/edit?usp=shari",
                        "https://docs.google.com/document/d/1BIKNmuKD2l3B8eT4_qRlr_1i5bXU6uAKMrGlOAMSL68/edit?usp=shari"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.909090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#30",
                    "likes": "1",
                    "time": "03/06/2022-18:08:37",
                    "content": "It is definitely a visionary plan, and I hope that the outcome will be positive for Maker; as you have said, maybe not everything will work the way it is planned, but testing what works and what does not work could be good for the long term.     rune:  The first step to launching the first MetaDAO is a process called clustering. It involves identifying people, relationships, business opportunities, communities and technologies that have a natural synergy that can benefit from having a distinct governance structure and community. Once these different elements have clustered together, which in practice is done through a Maker Governance Proposal, the MetaDAO is ready for launch.   A doubt regarding the clustering process, should there be any minimum or maximum limit of members, groups, or communities when conforming to these MetaDAOs? To be honest, the first time I read about it, I imagined that each Core Unit or group of Core Units would form a MetaDAO. Considering the amount of CUs, there are nowadays; I wonder what would be the best way to manage that aspect. I think you hit the nail on the head concerning the synergy because it’s a fact there are currently different workforces in Maker that have common or very similar goals. It would be great to make that these different forces could coordinate and work in an organized way. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.202020202020202
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#31",
                    "likes": "0",
                    "time": "04/06/2022-00:14:39",
                    "content": "Its a stretch to say that my example proves your Endgame plan. I will post more when I have time but your conclusions appear to be hasty and based on questionable logic and evidence. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HughMan",
                    "index": "#32",
                    "likes": "7",
                    "time": "04/06/2022-18:27:31",
                    "content": "It’s hard to find examples of successful endeavors managed by committees, or bureaucracy.   Someone has to lead, set the vision and then allow the rest to implement.  The challenge of decentralization is coordination, governance and leadership, IMHO.  Does the MetaDAO solve this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.145833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#33",
                    "likes": "4",
                    "time": "05/06/2022-13:14:01",
                    "content": "A vision has been set for product: MakerDAO - Long Term Growth Strategy for the Future of DeFi The next upgrade is to the decision-making apparatus—governance. As MakerDAO becomes more complex, it must adapt governance accordingly. All (successful) complex organisms embrace specialization and autonomy within clusters. Why would we be any different? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#34",
                    "likes": "8",
                    "time": "05/06/2022-18:07:52",
                    "content": "Thank you! It is super helpful to have as condensed a summary as possible to begin with in trying to digest and evaluate the Plan. I also appreciate having recordings of relevant meetings available, so those of us who could not attend can stay in the loop. Thank you @Davidutro for posting Open Decentralized Voter Committee | June 01, 2022 - YouTube in the comments at Decentralized Voter Committees: startup phase - Wednesdays 5pm CEST. All MKR holders welcome - #29 by Davidutro BULLISH ON METADAOs I’m extremely bullish on the MetaDAO/subDAO/pod architectural approach for scaling capacity and overcoming operational complexity in DAOs. In the case of MakerDAO, I lean toward an approach that might be better termed “satellite” DAOs. Consider: A satelliteDAO is not within any hierarchy or control mechanism established by the main DAO. Instead, it hovers above the gravitational forces applying constant pressure to the main DAO and is a constant source of valuable, always functioning, real-time information. MakerDAO can to some extent open-source governance by incentivizing decentralized groups to form who would design their own tokenomics and manage their own human capital resource needs in order to feed expertise, knowledge and information INTO MakerDAO governance. My hunch is that a successful incentive mechanism in this model would require a tiny fraction of the costs and time as any plan that would be internal to the current CU and Delegate operating structure. ENCOURAGING A COMPETITIVE FREE MARKET FOR GOVERNANCE INFORMATION MakerDAO can maintain the current newly decentralized operating framework and push complexity and cost OUT of the organization by encouraging a competitive market for governance services to form, thereby supplying MKR holders with an ever dynamic choice for who can best distill and communicate information needed to increase engagement by MKR holders overall and assist Delegates in voting effectively. NOTE: This approach in no way shares or delegates direct MKR voting POWER with or to a satellite DAO. FULL DISCLOSURE: ACREinvest will soon demonstrate our enthusiasm for this model via a Velodrome metaGovernance proposal that tests the satelliteDAO approach in collaboration with ACRE DAOs, a tokenized community we co-sponsor. The ACRE DAOs community is comprised of individuals, DAOs and project leaders interested in impact investing and Regenerative Finance (aka ReFi). ACREinvest is further using the power of tokenized community belonging and shared mission to recruit experienced TradFi lawyers and other professionals as contributors to MakerDAO and any other DeFi project that can help fulfill the vision of ReFi.     [Signal Request] Incoming Velodrome Airdrop on Optimism - $VELO veNFT Signal Requests       This is sooooo exciting! I am very interested in assisting with the active governance of this on behalf of MakerDAO so we do not have to rely on the Velodrome team. Would the community support a metaGovernance proposal from ACREinvest and anyone in particular have capacity to help me with a proposal?     Any iteration on the current MakerDAO structure should open up governance participation or rather, at least, governance influence to stakeholders who are not MKR token holders, CUs or Delegates. Engaging with governance satelliteDAOs as I have described above would be one way. An important conversation has started with the post below.  I love how it highlights that competition in Governance frameworks is alive and well. The evolution toward more inclusion in governance is just as significant as any technical product level implementation. MakerDAO accountability to a wider stakeholder group is now an imperative.     Governance Reflections: Optimism and Maker  Governance   What Can Maker Learn/Borrow From Optimism’s New Governance Model?   I am a technology lawyer and academic who has been in and around DeFi since 2020. My specific research interest is decentralised governance, and in that vein, Optimism’s announcement last week represents a pretty fascinating new experiment in how a decentralised protocol might be managed.  Optimism and MakerDAO are obviously very different kinds of projects, with different goals, but I think that the Optimism model …     ",
                    "links": [
                        "https://forum.makerdao.com/t/decentralized-voter-committees-startup-phase-wednesdays-5pm-cest-all-mkr-holders-welcome/15330/29",
                        "https://linktr.ee/acreinvest",
                        "https://forum.makerdao.com/t/signal-request-incoming-velodrome-airdrop-on-optimism-velo-venft/15371/6",
                        "https://forum.makerdao.com/t/governance-reflections-optimism-and-maker/14957",
                        "https://app.optimism.io/governance",
                        "https://forum.makerdao.com/t/lfws-endgame-commentary/17907/3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0266457680250785
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jstar",
                    "index": "#35",
                    "likes": "1",
                    "time": "06/06/2022-10:07:55",
                    "content": "I love the idea of Maker expanding its product suite, starting with a synthetic ETH. It would be great to see Maker explore alternatives than just Lido’s staked ETH for this too, maybe using a diversified set of staked ETH assets. We at StakeWise would be very keen to discuss how we can assist in getting this product off the ground! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#36",
                    "likes": "3",
                    "time": "10/06/2022-20:43:23",
                    "content": "I have finally finished part 3, which can be read here: The Endgame Plan part 3: The Endgame Decentralized Workforce Will try to get back in the conversation here and reply to the recent comments over the next couple of days, as always i really appreciate the feedback and discussion ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#37",
                    "likes": "3",
                    "time": "11/06/2022-20:15:23",
                    "content": "    ejbarraza:  I don’t see how the capital raise is necessarily mutually exclusive with the subDAO concept. I think both plans have merit. I would like to see a combination of both. For instance, use revenue-based financing to raise capital and use that to seed the subDAOs thereby accelerating growth, minimizing concentration risk, and increasing censorship resistance through decentralization.   I agree the two ideas are not mutually exclusive, however I think that it is a good example of complexity that can be pushed to MetaDAOs rather than be done in Maker Core, which is a huge strength of the Endgame Plan. The ReformerDAOs that focus on real world assets, and possibly some CreatorDAOs that focus on D3M models of decentralized assets, can then develop and administer a capital raise system, and Maker can use it to determine how much capital it lends to each via its D3Ms. Then the core of Maker can be kept simple, and refrain from using collateral that require large scale capital buffers in the first place, such as complex RWA. Instead, maker core should just focus on simple collateral that can be easily managed such as staked eth, stablecoins and government bonds, and then get exposure to more complex collateral through D3Ms, both to existing platforms like aave and compound, but in particular also to MetaDAOs and the ReformerDAOs that can implement the kind of more complex strategies we would like to see in Maker, but that just aren’t feasible due to the complexity required, including collateral that needs large amounts of capital raised through innovative systems. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.837732919254659
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#38",
                    "likes": "3",
                    "time": "11/06/2022-20:19:45",
                    "content": "    williamr:  The move from single DAO to MetaDAO/subDAOs is as important an organisation shift as what happened in the shift from Foundation to CU framework. Probably even bigger given that that first decentralisation phase had a body (the Foundation & Amy + others) coordinating the transition. That “coordinating body” is no longer here, not formally at least. This decentralisation 2.0 will therefore likely have exponentiated challenges at multiple levels (tech, people, financial etc). They are not impossible to overcome though. The CU framework is only 1 year old and so far has survived…   I will personally stay around for probably a year or two to bootstrap the DVCs and teach some of the key principles that will need to reach critical mass for the Endgame plan to become properly self sustainable. I agree that it is not possible to change or evolve a DAO. Once you have a decentralized system, it just stays the way it is, and that’s why Makers current status quo is unviable because Maker is stuck in a spiral of endlessly growing complexity. That’s why I decided to jump into the fray to try to push for specific and directed change that can break the cycle of complexity growth that doesn’t have a natural endpoint, and then I can finally leave again (from being deeply involved) when the mechanisms and frameworks I help put in place prove that they can handle all permutations of governance challenges without my own involvement. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.288938492063492
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#39",
                    "likes": "0",
                    "time": "11/06/2022-20:23:44",
                    "content": "    monkey.irish:  You are suggesting that one function inside of the MakerDAO, with the least risk, to potentially have the greatest gain. For me, this is a function of an appetite for risk for each of the Core Units (CU). If this is a transparent and open process, where is the offer for all CUs an opportunity to participate as a pioneer?   It should be available for all Core Units to migrate to MetaDAOs (assuming MKR and MetaDAO token holder approval), but it can happen in different forms. There’s both simply reforming to work under the management of a MetaDAOs Results Guarantee (where the core unit is still funded through makers budget and receives MKR bonuses plus additional MetaDAO tokens), but there is also the transition to an Internal MetaDAO Core Unit (which is funded and accountable to the MetaDAO governance). Part 3: The Endgame Decentralized Workforce should hopefully clarify the different opportunities. In the end the goal is that the entire workforce should transition to the MetaDAO paradigm because it is much more ultra-long run resilient. However in the short run there should be no rush, the Endgame Plan ultimately concerns itself mostly with very long timescales. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.678333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#40",
                    "likes": "2",
                    "time": "11/06/2022-20:34:16",
                    "content": " Sorry, but I don’t understand how this works? The MetaDAO shares profits with Maker. In which form? Where are the vaults? And how is there yield? Where does the yield come from?  I think you misunderstood, since it is Maker that shares revenue with MetaDAOs for value that the MetaDAOs have created that allows Maker to earn income. The way the frontend revenue share works for MetaDAOs is that they run a frontend that gives users access to Maker Vaults, like Oasis or Defisaver. The net revenue Maker earns from these vaults (after DSR costs) is then shared partially with the MetaDAO that owns the frontend. I’m not sure yet about what a good number would be, but 20% could be a reasonable starting point. So as an example, if a MetaDAO runs a frontend with vaults that have 200 million debt and pay 2.5% in stability fees, then the MetaDAO will earn 1 million Dai (20% of 2.5 million) per year in revenue share, paid out by Maker. MetaDAOs also share their own value and profits with Maker, but the details of how this works hasn’t been published yet and it is a very advanced system that I won’t try to explain now. The gist of it is that the tokenomics system of MetaDAOs fundamentally ties into the MKR token and ensures that all value a MetaDAO earns flows back to both Maker and MetaDAO token holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.585
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#41",
                    "likes": "2",
                    "time": "11/06/2022-20:49:54",
                    "content": "    rspa:  Can you please explain why this is done by the same MetaDAO as the fixed-rate business? It seems a bit like mission bloat.   MetaDAOs are specifically designed to handle complexity and “mission bloat”, and all of them are meant to run many business lines simultaneously, but only businesses that are low hanging fruit, meaning they have low upkeep, low risk and often are just something you just copy and then run. In particular CreatorDAOs take this approach the extreme, where they can do basically anything and often do many different unrelated things in parallel. GovernorDAOs and ReformerDAOs are meant to be more specialized within a single area (managing core units or handling RWAs). In the long run, a MetaDAO can then “Metamorphose” which means it will increasingly become focused on a single business line that achieves outlier exponential success out of the many different things it manages, and over time let this focus completely define the MetaDAO. However, this doesn’t necessarily mean that it will have to drop other business lines, if they are profitable and don’t distract from the main goal. The fundamental reason why MetaDAOs can do this, while MakerDAO has the opposite problem and must ruthlessly focus on a single goal, is because MetaDAOs are designed to take risk and be allowed to fail, and can always rely on Maker to be the last line of defense when dealing with difficult governance edge cases or similar. Maker, on the other hand, has nowhere to go if things fail, and more importantly is focused on providing a stablecoin, which is the most sensitive product possible that means it is irresponsible to allow Maker to grow its scope and dapple in other products and business lines that aren’t already clearly predetermined and guaranteed to not take the focus away from keeping Dai secure and stable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1482753357753355
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#42",
                    "likes": "2",
                    "time": "11/06/2022-21:04:03",
                    "content": "    rspa:  I guess this is a typo: The team members will be adopted by the MetaDAO and cease to work for MakerDAO, right?   I still need to get better at using consistent terminology, and hopefully part 3: the Endgame Decentralized Workforce helps provide more clarity on this, but basically there are two things that can happen to Core Units: One is that they get “hired” by a MetaDAO, which means they became an Internal MetaDAO Core Unit that is funded by the MetaDAO and accountable to the MetaDAO governance, doing internal work for the MetaDAO (which can still, however, involve doing work on the Maker protocol that is profitable for the MetaDAO, such as pursuing revenue share bounties). The other is they get “adopted” by a MetaDAO which means they continue to work as a Maker Core Unit, but are now also manageed by the MetaDAO with a Results Guarantee. This means the Core Unit is still funded by Maker Governance, and accountable to Maker Governance, but the MetaDAO earns an additional overhead from this funding, but is then also exposed to penalties through Guarantee Settlements when the Core Unit fail to meet expectations or breaches best practice. This makes it a lot safer for Maker to scale up the Core Units and the budget, especially in the long run, because the MetaDAOs help provide a tight feedback loop on individuals core units instead of Maker Governance having to micromanage everything with a single governance loop. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.575255102040816
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#43",
                    "likes": "1",
                    "time": "11/06/2022-21:06:08",
                    "content": "    HughMan:  It’s hard to find examples of successful endeavors managed by committees, or bureaucracy. Someone has to lead, set the vision and then allow the rest to implement. The challenge of decentralization is coordination, governance and leadership, IMHO. Does the MetaDAO solve this?   MetaDAOs definitely do not need to be as strictly decentralized as Maker, but at the same time I don’t think it is impossible that innovation can happen in a decentralized setting. One of the main things that is really, really difficult though, is to prioritize and to say no to things while saying yes to other things. In the MetaDAO paradigm, Maker becomes a DAO that is very strict and says no to basically everything, while MetaDAOs are very lenient and experimental, and are willing to say yes to lots of things. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#44",
                    "likes": "1",
                    "time": "11/06/2022-21:12:45",
                    "content": "    Jstar:  I love the idea of Maker expanding its product suite, starting with a synthetic ETH. It would be great to see Maker explore alternatives than just Lido’s staked ETH for this too, maybe using a diversified set of staked ETH assets. We at StakeWise would be very keen to discuss how we can assist in getting this product off the ground!   Having MATH be backed by a diversified basket of Staked ETH tokens is the long term plan - this would work identically to how dai is currently backed by stablecoins in multiple different PSMs, including USDC and USDP. Additionally, some MATH would also be backed by Dai, and this would open up for the possibility of using the Maker Vault engines to short ETH, making Maker able to cater much more to trader use cases rather than just long term holder use cases. Using Lido exclusively would be a short term growth hack to get it started easily as a simple wrapper, since it is the most liquid staked ETH token, making it more suitable for use as large scale collateral that is boosted with yield farming incentives. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.109022556390977
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jstar",
                    "index": "#45",
                    "likes": "0",
                    "time": "16/06/2022-09:29:17",
                    "content": "    rune:  Using Lido exclusively would be a short term growth hack to get it started easily as a simple wrapper, since it is the most liquid staked ETH token, making it more suitable for use as large scale collateral that is boosted with yield farming incentives.   The recent market downturn and consequent issues with peg stability across multiple staked ETH tokens highlights the importance of diversity, not just to diversify the native protocol risks, but also to spread the liquidity risk. I would encourage Maker to look to diversify as a first priority. It is always appealing to use short-term growth hacks, but the last weeks show this could have been a bad decision. It would be great to open a dialogue further on this - I have dropped you an add on Discord (Jstar#3989) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.871428571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#46",
                    "likes": "0",
                    "time": "24/06/2022-12:42:55",
                    "content": "    rune:  M0 will not operate any Maker Core Units and Maker will have no dependency on M0   I’m in the middle of writing a summary of this. I have no idea how to handle this section. It’s supposedly about how there is no dependency of Maker on M0, but actually just talks about risk/reward for M0 personnel. Like, if we’re actually moving Core Units from Maker to M0 something we currently view as important is moved and exposed to risk that warrants additional reward. Either:  Maker is risking something it is currently dependent on (DECO) Maker is not risking DECO, but DECO and co are being paid high rewards to compensate for a risk that isn’t there.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#47",
                    "likes": "1",
                    "time": "30/06/2022-18:18:00",
                    "content": "I believe the endgame is a great plan and it could help MakerDAO regain the lead in stablecoins. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jonathan_Erlich",
                    "index": "#48",
                    "likes": "1",
                    "time": "10/08/2022-22:47:20",
                    "content": "What does the annual cash burn rate refer to here?  Captura de Pantalla 2022-08-10 a la(s) 5.45.35 p.m.860×500 112 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#49",
                    "likes": "0",
                    "time": "10/11/2022-04:47:49",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/the-endgame-plan-parts-1-2-traduccion/15461",
            "title": "The Endgame Plan parts 1&2 (traducci\\xc3\\xb3n) ",
            "index": 15461,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "translate",
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#1",
                    "likes": "11",
                    "time": "31/05/2022-01:02:48",
                    "content": " image2768×378 18.2 KB  El Plan Endgame es una ambiciosa iniciativa que pretende crear una hoja de ruta finita para MakerDAO que paso a paso conduzca a un estado final predeterminado e inmutable dentro de muchos años, al tiempo que mejora significativamente la dinámica de la gobernanza y aprovecha la fuerza bruta de la innovación DeFi moderna. He estado relativamente inactivo en Maker Governance desde la disolución de la Fundación, pero ahora he vuelto para tratar de impulsar este ambicioso plan y la revisión de la gobernanza. Un objetivo clave para mí es hacer frente a las principales contradicciones y desafíos que veo, y también asegurar que el proyecto se encamina hacia un equilibrio verdaderamente descentralizado. Algunos puntos destacados del Plan Endgame que se materializarán a corto plazo, y que se describen en este post:   Lanzar rápidamente un producto ETH sintético que permita a Maker aprovechar la fusión   Incubar una DAO de pleno derecho, económicamente sostenible y con importantes sinergias con Maker   La granja de rendimiento el nuevo token DAO a los titulares de Dai, ETH bóveda y MKR que participan en la gobernanza   Las recompensas agrícolas significan que esto impulsará inmediatamente la participación en la gobernanza y ayudará a hacer frente a la apatía de los votantes y a la centralización de la gobernanza, y creará utilidad para los titulares de MKR   Establecer normas y códigos de conducta más estrictos para los participantes en la gobernanza, que ayuden a controlar el poder de los delegados y las unidades centrales, que aumentará significativamente una vez que se hayan establecido los incentivos a los votantes a través de la agricultura de rendimiento.    Contenido Este post del foro es una versión más corta del documento completo, que se publicará más adelante, una vez que la comunidad haya podido asimilar esta introducción (que sigue siendo muy larga). El post por ahora contiene las dos primeras partes del documento completo del Plan Final.  Parte 1: Introducción Parte 2: Lanzamiento del Plan Final   Fundamentalmente, el Plan Final pretende transformar Maker de una estructura poco clara a una realidad en la que todos los aspectos de MakerDAO estén bien documentados y se entiendan, y funcionen sobre la base de incentivos defendibles y procesos sin riesgos  Primero vamos a dedicar un momento a ver el organigrama de Alphabet, antes Google. Alphabet se compone de Google, que es la fuerza motriz de la organización y a la que se le da total autonomía y control sobre sus recursos y productos clave, como las búsquedas y los anuncios. En el mismo holding, pero separadas de Google, están las “Alpha Bets”, que pueden describirse mejor como varias moonshots que operan como si fueran startups, pero están sobrealimentadas con el músculo y la tecnología de Google y el resto de la cartera de Alphabet. Esto significa que Alphabet es una estrategia de talla única en la que el núcleo de la empresa opera con un enfoque en el crecimiento constante y los rendimientos por encima de todo, mientras que es apoyado por empresas de riesgo que son totalmente autónomas, y se les permite tomar grandes riesgos y fracasar, pero que también tienen el potencial de rendimientos descomunales e incluso en teoría, podría igualar o incluso superar el éxito de Google. Obviamente, el Plan Final no intenta convertir a Maker en Google, pero es un contexto útil para entender el razonamiento detrás de la estructura de Google para entender mejor el Plan Final  Los MetaDAO son la principal herramienta propuesta por el Plan Endgame, y son la llave que abre el potencial de MakerDAO al establecer dinámicas que encajan muy bien en un ecosistema descentralizado y transparente. Ellos permiten a Maker calcular el valor y el potencial que existe actualmente en el ecosistema y la fuerza de trabajo, envolviendo los tokens, y luego, al sembrar una comunidad a través de la distribución de los tokens, pueden sobrealimentar el potencial de todo el valor que existe, pero que actualmente está mayormente oculto y sin prioridad. Los ejemplos de las increíbles cantidades de valor oculto en Maker incluyen: Un protocolo independiente de tarifas fijas, la red de oráculos descentralizada más antigua del mundo y el pipeline de activos del mundo real mejor desarrollado de la industria, y lo más importante, un equipo masivo, altamente competente y motivado que no tiene parangón en ningún otro proyecto descentralizado. Ejemplo de RWA MetaDAO Uno de los ejemplos más evidentes del poder de las MetaDAOs es el estancamiento que se está produciendo con los activos del mundo real, donde resulta que los procesos de gobernanza y las dinámicas políticas que se han desarrollado en Maker no son fundamentalmente compatibles con la realidad de procesar eficazmente las complicadas transacciones financieras del mundo real y poder competir con las principales instituciones financieras del mundo. Los MetaDAOs permiten a Maker liberarse de intentar gestionar directamente y especializarse en la complejidad de las transacciones de activos del mundo real, y en su lugar simplemente incubar MetaDAOs que puedan desarrollar dinámicas de gobierno más especializadas y mejor adaptadas que les permitan superar las barreras en las que Maker se quedó atascado. Maker puede entonces utilizar la construcción D3M, ya bien probada y entendida, para dejar que estos MetaDAOs lleven a cabo el trabajo de RWA en nombre de Maker, con mucha menos sobrecarga y complejidad para Maker. La cuestión principal es comparar el rendimiento de los diferentes MetaDAOs y decidir a quién dar más poder. Si se recompensa la innovación útil y los callejones sin salida suponen una pérdida de negocio, se crea un bucle de retroalimentación muy estrecho en el que los MetaDAO pueden iterar continuamente sobre cómo hacer que los RWA funcionen en DeFi, en un proceso evolutivo descentralizado.  Parte 1: Introducción Esta sección se centra en el conocimiento del estado actual de Maker y DeFi  Tras el fin del mercado alcista de las criptomonedas, están surgiendo condiciones similares a las del último invierno de las criptomonedas, que fue muy favorable para Maker y en el que éste lideraba esencialmente toda la industria. Esto incluye el regreso de Maker como el mayor protocolo en DeFi, la fusión que se avecina, que consolidará aún más el liderazgo de Ethereum y reforzará todas las plataformas que ya están arraigadas en Ethereum, sobre todo Maker, y los efectos de un mercado bajista en el que, de repente, los fundamentos se convierten en el centro de atención, mientras que el bombo deja de ser un factor.  Después de la burbuja de criptomonedas de 2021, está claro que la industria ha avanzado significativamente desde la última burbuja de 2017. Pero a medida que la marea retrocede, queda claro que los proyectos más importantes no han cambiado en absoluto, son los mismos nombres, como Maker, Aave y Uniswap los que lideran la industria, mientras que todas las nuevas incorporaciones ni siquiera han podido sobrevivir, sino que han sido efectivamente eliminadas. Esto demuestra que no podemos esperar que la innovación radical continúe en DeFi en particular. Los principales casos de uso y primitivas ya han sido descubiertos, y además, incluso esos principales casos de uso están luchando por generar un crecimiento sostenible que no dependa del ciclo de burbuja, con las stablecoins como quizás el único valor atípico significativo que ya se está utilizando a nivel mundial. Ethereum es claramente dominante con la fusión que se avecina, mientras que todas las demás blockchains han fracasado básicamente y, en lugar de lograr efectos de red orgánicos, están todas dominadas en su mayoría por un solo protocolo sin un camino claro de cómo surgirán más. El principal valor que se ha añadido a la mesa y que puede considerarse una nueva generación de aplicaciones de blockchain descentralizadas que han innovado más allá de las primitivas originales es en forma de beneficios más intangibles y sociales, incluyendo NFTs y yield farming. Sin embargo, el potencial de este nuevo valor no se ha utilizado realmente para nada más que para alimentar esquemas ponzi.  Esto significa que Maker tiene una oportunidad única de volver a liderar el sector. Maker no inventó las stablecoins, pero fue el primer proyecto que integró los distintos elementos de forma que permitiera una adopción masiva y un argumento comercial sólido. Ahora, con los MetaDAO como bala de plata, Maker puede consolidar todo lo que ya hemos empezado y ponerse en posición de aprovechar las nuevas posibilidades de creación de valor que existen en la nueva generación de DeFi. Pero antes de empezar debemos entender los retos a los que nos enfrentamos. Una cosa que hay que tener en cuenta en cuanto a esta lista, es que cada elemento que se enumera se abordará de nuevo más adelante, después de que se hayan introducido los MetaDAO, y entonces se aclarará exactamente cómo los MetaDAO ayudan a resolver estos problemas específicos.  La queja más común entre los poseedores de MKR es en mi opinión, que no está claro por qué MKR tendrá valor. Hay una sensación de desconexión con el objetivo de aumentar el valor del token, agravada por la realidad de los datos críticos que se ven mal, como el suministro total de Dai. El protocolo está generando ingresos significativos, pero se percibe que todos esos ingresos desaparecen en Unidades Básicas que operan a niveles demasiado complejos para que los miembros de la comunidad los entiendan y vean los resultados. El único valor que se percibe actualmente, es el que aporta el núcleo del protocolo de los creadores, que es relativamente limitado, y que comprende los 6 tipos de bóveda más populares y el mecanismo PSM. Todo lo que hay más allá todavía tiene que generar valor, pero ahí es donde se centra la mayor parte de los más de 115 trabajadores. La plantilla ha crecido tanto que, combinada con la caída de los mercados y la disminución del crecimiento, ni siquiera es posible que el núcleo de Maker siga manteniendo la plantilla, y el protocolo ha dejado de ser rentable.  Mientras tanto, es muy difícil ver cómo la comunidad puede marcar la diferencia a través de los resortes de la gobernanza debido a lo abrumadoramente compleja y opaca que parece la gobernanza de Maker. La espiral de la complejidad es el fenómeno por el que Maker tiene a menudo la sensación de dar un paso adelante y dos hacia atrás, porque los problemas que existen en la gobernanza suelen estar causados por la complejidad, pero para resolver esos problemas hay que crear más complejidad, lo que significa que en general los problemas empeoran. El problema de las relaciones es la contradicción de Maker como un proceso de toma de decisiones torpe, lento y de un solo hilo en el que cientos o incluso miles de poseedores de fichas de todo el mundo tienen que coordinar y tomar decisiones sobre cientos de relaciones delicadas con seres humanos individuales, incluidos los miembros de la unidad central y las contrapartes colaterales que tienen todos sus propias expectativas. A escala, esto empieza a ser muy problemático, y hemos llegado a un punto en el que es básicamente imposible tratar de hacer cualquier tipo de cambio o incluso discutir ideas sin molestar a las personas que están enredadas en esta red incontrolada de relaciones y que a menudo tienen incentivos conflictivos. Por último, la apatía de los votantes se produce debido a estos problemas mencionados y, en general, es algo inherente a las organizaciones, ya que votar cuesta tiempo (y en Maker incluso dinero) pero no da ningún beneficio directo a cambio.  A pesar de todos estos problemas, Maker cuenta con una reserva de talento extremadamente valiosa, impulsada por la pasión por el proyecto, y aunque existen muchos problemas, éstos son causados principalmente por la estructura disfuncional general y no por las personas involucradas. Esto significa que si utilizamos MetaDAOs para tratar los problemas y potenciar el valor que existe, podemos abrir una compuerta de creación de valor para los titulares de MKR.  Pero lo más importante es que los titulares de MKR tienen que tomar la iniciativa para cambiar las cosas, porque el poder de voto determina en última instancia todos los incentivos del sistema, y la falta de claridad sobre lo que los titulares de MKR realmente quieren es el factor más confuso en todo el DAO.  El Plan Endgame propone empezar por organizar la capa superior de la gobernanza creando un entorno en el que los titulares de las MKR estén preparados para tomar decisiones con éxito, haciendo que la votación sea lo más fácil e impactante posible. El primer paso es la creación de comités de votantes, en los que los titulares de las MKR se reúnen abiertamente para debatir la dirección y coordinar el comportamiento de voto en las próximas propuestas, así como para señalar el futuro apoyo de los votantes a una dirección general y a propuestas individuales. Los comités de votantes se alinean en torno a una “dirección” que informa sobre cómo votan las propuestas y a qué delegados apoyan. Los comités de votantes influyen directamente en la gobernanza, no sólo organizando las votaciones sobre propuestas específicas, sino también reequilibrando los votos de las delegaciones entre los distintos delegados, lo que crea un fuerte incentivo para que los delegados tomen la iniciativa de apoyar la dirección del Comité de Votantes. Los participantes del Comité de Votantes son incentivados a través de una compensación especial en forma de tokens MKR bloqueados a largo plazo. Esto ayuda a atraer al tipo adecuado de participantes y a garantizar que tengan una clara alineación de incentivos con los resultados de sus decisiones. El segundo paso consiste en elevar las funciones de los delegados y reconocer que cumplen una función tan importante como la de los facilitadores, igualando la remuneración de los mejores facilitadores para el grupo de delegados más importantes que se designan como “delegados ejecutivos”, dándoles una generosa bonificación de MKR, así como una “seguridad laboral blanda”, lo que significa que no pueden perder su remuneración de un día para otro. Pero además de estas prebendas, hay que imponer a los delegados unos requisitos más claramente definidos, como la asistencia a los comités de votantes x horas a la semana como parte del trabajo a tiempo completo, y un requisito estricto de seguir las mejores prácticas que haga cumplir principios como la plena divulgación y la separación de poderes. El tercer paso consiste en que los comités de votantes y los delegados se pongan en contacto con los facilitadores de las unidades centrales, en particular con las unidades centrales de apoyo, como la ampliación del ecosistema sostenible y la financiación estratégica, para generar una visión centrada en los votantes de cómo está organizada la OAD y cómo podría mejorarse para que se adapte mejor al objetivo de hacer más accesible la gobernanza. El cuarto paso es incluir también a consultores y expertos externos para validar y cuestionar las perspectivas internas de la comunidad, para evitar una situación de cámara de eco. Al recurrir a expertos en innovación organizativa, podemos garantizar que la piedra angular de la estructura de la DAO de Maker se construya sobre una base teórica sólida en la que la comunidad pueda confiar.  El objetivo de los Comités de Electores Descentralizados es hacer que la gobernanza de Maker sea más naturalmente descentralizada, transparente y diversa. Al tener múltiples DVCs redundantes que se agrupan en base a valores comunes, denominados “Dirección”, los comités de votantes ayudan a fomentar la diversidad de opiniones y aseguran que haya una plataforma válida para todas las opiniones principales. Así se minimiza el riesgo de que algunas perspectivas puedan ser tachadas de “incorrectas”, aunque eso no interese a los titulares de las MKR, como ocurre actualmente, que es muy difícil debatir la reducción de los presupuestos. Un comité de votantes está controlado por un organizador, o un grupo de organizadores, que pueden elegir a qué titulares de MKR invitan al comité de votantes. Esto les permite excluir a los titulares de MKR si no están de acuerdo con la dirección del comité de votantes, obligándoles a crear su propio comité de votantes con miembros que estén de acuerdo con la dirección. De esta manera, todas las direcciones pueden ser discutidas libremente en entornos constructivos en los que los participantes en la discusión intentan colaborar para promover la agenda de los miembros.  Para poner en marcha los comités de votantes, primero tenemos que desarrollar el “mapa mundial”, una visión global completa de cómo subdividir el ámbito total de la gobernanza de los creadores en categorías lógicamente coherentes. Esto debería hacerse en colaboración, incluyendo las aportaciones profesionales de las unidades centrales, y en particular de las unidades centrales de apoyo, como la de Escalamiento del Ecosistema Sostenible y la de Finanzas Estratégicas, cuyo trabajo es intentar crear una visión general y un seguimiento de la fuerza de trabajo.  Una vez que el Mapa del Mundo esté claro, los titulares de las MKR pueden empezar a organizar comités de votantes especializados que se centren en mapas de alcance individuales. Estos comités de votantes especializados se centran primero en obtener una visión general del campo de especialización y luego en documentar el Mapa de Alcance. Utilizando el Mapa de Alcance como marco central, pueden supervisar el progreso dentro de su área de especialización y presionar para que se produzcan cambios que se ajusten mejor a su dirección.  Los Objetivos Focalizados son una poderosa herramienta que permite a los titulares de las MKR alinearse con un conjunto global de prioridades que se basan en los recursos de múltiples Mapas de Alcance. Los Objetivos Focalizados representan los desarrollos generales de mayor impacto que las Unidades Centrales priorizan, siguiendo un enfoque de “cascada” en el que los temas se priorizan en la parte superior de la lista y los recursos sólo pueden fluir hacia los objetivos que están más abajo en la lista si los objetivos de mayor rango tienen todas sus necesidades satisfechas. Esto permite un desarrollo flexible y paralelo en la medida en que se disponga de recursos, al tiempo que garantiza que no se descuiden los resultados de alto impacto. Una vez que las Unidades Centrales han asignado todos los recursos necesarios a los objetivos prioritarios que les corresponden, pueden priorizar internamente y preparar nuevos objetivos prioritarios. Los objetivos de enfoque pueden cambiar rápidamente cuando las condiciones del mercado u otros factores externos los obligan a cambiar. El mejor ejemplo es el caso de los hackeos u otros riesgos críticos, en cuyo caso la mitigación del riesgo ocupa inmediatamente el primer lugar como objetivo de enfoque. Para permitir que los objetivos prioritarios cambien rápidamente y sean lo suficientemente flexibles como para servir a su propósito, se crean a través de encuestas fuera de la cadena realizadas en los comités de votantes. Se crea una lista sintética “global” de objetivos prioritarios sumando los totales de MKR de las diferentes listas de objetivos prioritarios de los diferentes comités de votantes, lo que permite que los titulares de MKR minoritarios también tengan un impacto en la priorización general en lugar de ser completamente anulados por la mayoría de MKR. En última instancia, las Unidades Centrales tienen libertad para interpretar y seguir los Objetivos Focales de la manera que crean que será más beneficiosa para la DAO, pero su incumplimiento debe ser supervisado y documentado por las Unidades Centrales de Apoyo, incluyendo las razones para no seguir los Objetivos Focales. Los titulares de las MKR pueden entonces utilizar los datos para realizar ajustes en las Unidades Centrales, como por ejemplo ajustar los presupuestos, basándose en qué Unidades Centrales están obteniendo los resultados que los titulares de las MKR desean. La lista actual de esta diapositiva representa la última propuesta de “lista de Objetivos Focales de Génesis” que entraría en vigor en el lanzamiento del Plan de Fin de Juego y que cambiaría dinámicamente a partir de ahí. Esta lista se modificará en función de las aportaciones que se hagan a medida que se desarrolle el PIM de lanzamiento del Plan de Fin de Juego, y ya puede ser utilizada en esta fase por las Unidades Centrales a la hora de planificar y priorizar. Las partidas marcadas como Plan de Fin de Juego se explicarán más adelante en este documento.   Parte 2: Lanzamiento del Plan Final Esta sección se centrará en las características a corto plazo del Plan Endgame y en cómo se puede lanzar. Todos los elementos del lanzamiento del Plan Endgame están generalmente optimizados para ser fruta de poca monta, requiriendo un esfuerzo mínimo pero proporcionando un valor inmediato significativo al aprovechar el valor que ya existe en el Ecosistema Maker, pero que actualmente está oculto. Hay referencias en esta sección que introducen conceptos que sólo se explican completamente en el documento completo del Plan Fin de Juego, por lo que por ahora faltan esos detalles, pero vendrán con la versión completa que se publicará a finales de esta semana.  El Plan Endgame gira en torno al despliegue de la poderosísima herramienta de las MetaDAO para mejorar y potenciar a Maker. Los MetaDAOs se basan en el concepto establecido de Pods/SubDAOs, que permiten a un DAO obtener una gran cantidad de resultados deseables que normalmente no son posibles de conseguir sin hacer concesiones. Las MetaDAOs permiten una profunda especialización por fuerza de trabajo, comunidad y proceso de gobernanza porque cada MetaDAO puede centrarse en su especialización deseada, lo que les permite dedicar los recursos y el enfoque necesarios para especializarse adecuadamente, y no distraerse con otras responsabilidades. Esta es una situación mucho mejor que la actual expectativa de que Maker pueda especializarse en una gran cantidad de categorías completamente disjuntas. En este momento Maker está significativamente frenado por su abrumadora y opaca complejidad, pero esta complejidad existe por una buena razón porque la complejidad es necesaria para aprovechar las mejores oportunidades que existen en el mercado. Los MetaDAOs permiten al ecosistema Maker mantener su complejidad e incluso adoptar órdenes de magnitud de mayor complejidad, pero esto ocurriría en MetaDAOs aislados y desprovistos de riesgo, mientras que el núcleo Maker podría llegar a ser mucho más simple de lo que es hoy, creando una situación de lo mejor de ambos mundos. Las MetaDAOs también permiten a Maker superar la naturaleza monocorde del actual proceso de gobierno, y dejar que muchas MetaDAOs separadas prioricen y ejecuten en paralelo con un potencial casi ilimitado de escala y autonomía. Cada MetaDAO funcionará con un bucle de retroalimentación totalmente autónomo que garantice que todos los incentivos están alineados entre los que hacen el trabajo y los resultados que crean. Por último, los MetaDAO se basan en estas ventajas fundamentales y operativas, y también permiten a Maker aprovechar la nueva generación de ventajas que ofrecen los ecosistemas de DeFi, tokens y blockchain, incluido el uso de comunidades de tokens para el growth hacking y la creación de valor intangible a través del arte, los eventos y la identidad.  La característica clave de los MetaDAOs de Maker que los hace tan potentes es que son extremadamente fáciles, baratos y sencillos de crear porque son capaces de construir sobre la infraestructura de gobierno totalmente madura de Maker, y sólo requieren primitivas sencillas que ya existen y se utilizan ampliamente en la DeFi moderna. Una MetaDAO se crea cuando Maker despliega un token ERC20 del que Maker Governance conserva la propiedad, y luego genera algunos tokens para ponerlos en una tesorería que también está en manos de Maker Governance. A continuación se generan tokens adicionales que se destinan a la distribución a la comunidad, principalmente a los usuarios de Dai, los usuarios de Maker Vault y los participantes en el gobierno de MKR. Esto crea una comunidad totalmente descentralizada con una condición inicial de lanzamiento totalmente justa, y esta comunidad descentralizada tiene plena autonomía para tomar decisiones fundamentales para la recién nacida DAO, incluyendo la determinación de un nombre y una identidad, la contratación de Unidades Centrales, y la realización de diversas actividades generadoras de beneficios (las oportunidades de beneficio disponibles para las MetaDAOs se cubrirán más adelante en este documento) Los titulares de los tokens MetaDAO toman sus decisiones a través de un sondeo fuera de la cadena, lo que hace que sea gratuito y rápido de hacer. Una vez tomadas las decisiones, se incluyen en el proceso de gobernanza de Maker y la ejecución se agrupa en una votación ejecutiva de Maker. De este modo, los MetaDAO pueden tener instantáneamente una gobernanza totalmente descentralizada y una tesorería funcional, pero sin riesgo de sufrir ataques a la gobernanza.  Para ayudar a entender la propuesta de valor básica de los MetaDAO y por qué son útiles para Maker, esta es una visión general de las 3 grandes categorías de MetaDAO que propone el Plan Endgame. La primera categoría, que pretende ser la más numerosa, son las CreatorDAO. Son un arquetipo de MetaDAO generalizada que se centra fundamentalmente en la innovación y la experimentación, y en utilizarlas para impulsar el crecimiento. Las CreatorDAO no tienen restricciones en lo que pueden hacer o convertirse, y esto las hace muy flexibles y potencialmente muy heterogéneas y diferentes entre sí. Las CreatorDAO también tienen un potencial especial para aprovechar el valor intangible y las tendencias metaversas. Las categorías especializadas de MetaDAO existen para atender algunas necesidades específicas de Maker, que son lo suficientemente complicadas y desafiantes como para que tenga sentido tener MetaDAOs que cubran específicamente esas categorías. Las GovernorDAO existen para profesionalizar y gamificar los procesos centrales de gobernanza y la burocracia de Maker. Al asegurar que hay múltiples y redundantes MetaDAO especializadas en esto, se hace posible proporcionar garantías en torno a la descentralización y la diversificación de los procesos centrales y la dinámica política, así como algunos métodos específicos útiles para desproteger significativamente muchas decisiones de gobernanza comunes relacionadas con la Fuerza de Trabajo Descentralizada que actualmente son un desafío para la Gobernanza Maker (Esto será cubierto en detalle en la sección sobre la Fuerza de Trabajo Descentralizada más adelante) Las ReformerDAOs están especializadas en lidiar con la intensa complejidad de construir los puentes entre el mundo descentralizado de DeFi, y el mundo legal de los activos del mundo real. Ahora mismo está demostrando ser el problema más desafiante y disruptivo para la gobernanza de Maker que está dañando la dinámica política, y está claro que un desafío tan increíblemente complejo debe ser resuelto por organizaciones racionalizadas que tengan procesos de gobernanza y una composición cultural específicamente diseñada para tratar con este desafío.  Lanzamiento del Plan Final y paso a un paradigma MetaDAO  El proceso paso a paso de la puesta en marcha de las MetaDAO comienza con el análisis de los riesgos que existen en la estructura orgánica actual. El mayor problema son todas las relaciones ocultas, complicadas y a menudo contradictorias y conflictivas que existen en la DAO y entre el Gobierno de los creadores y cientos de humanos individuales. El objetivo principal de la ejecución del Plan de Fin de Juego y del arranque del paradigma de la MetaDAO es minimizar la quema de puentes y mantener tantas relaciones de alta calidad como sea posible, mientras se hace la transición a una forma en la que sean realísticamente sostenibles.  Antes de introducir los MetaDAO, es fundamental definir primero lo que debe ser el núcleo Maker. La lista anterior contiene lo que actualmente se propone como el alcance completo del Núcleo Maker, y la idea es que esta definición del Núcleo no cambie con el tiempo, sino que permanezca lo más estática posible para crear certeza y claridad sobre lo que hace exactamente Maker y por qué es seguro y fiable. La única adición nueva al núcleo es la capacidad de incubar regularmente nuevos MetaDAOs.  Una mirada más cercana al núcleo  Echemos un vistazo al Núcleo, pero desde la perspectiva de una hipotética estrategia “tipo Rai” que adopta el enfoque opuesto al del Plan Final. En lugar de reorganizar y potenciar la complejidad que ya existe, el enfoque “Rai-like Core” trata de eliminar toda la complejidad posible y crear un sistema de stablecoin lo más simple y autónomo posible. Esto puede lograrse simplemente tomando la funcionalidad del núcleo, incluyendo bóvedas de ETH, bóvedas de BTC, D3Ms de aave y compuestos, PSMs a las principales stablecoins centralizadas, y luego más allá de este núcleo añadir la capacidad de desplegar la garantía en los tesoros de los Estados Unidos a través de una simple configuración de RWA. Una vez creada esta estructura, su mantenimiento requeriría un mínimo de personal permanente, a excepción de las actualizaciones ocasionales o los cambios de parámetros en los almacenes, que podrían ser gestionados por consultores externos en lugar de un personal permanente a tiempo completo. Las infraestructuras críticas, como los oráculos, se subcontratarían a proveedores como Chainlink, con uno o más sistemas de seguridad redundantes. Sólo los comités de votantes y los delegados tendrían que supervisar continuamente el protocolo para descubrir los riesgos que hay que mitigar, lo que en su mayor parte sería una tarea muy sencilla y de mínimo consumo realizada a intervalos regulares. Todo el valor que se ahorra al no mantener una plantilla masiva y compleja y productos periféricos podría utilizarse entonces sólo para mejorar la eficiencia del sistema estableciendo una Tasa de Ahorro Dai muy alta, y es probable que este hipotético sistema tenga mucho éxito en el mercado debido a sus potentes características principales, su eficiencia, su simplicidad y su fiabilidad. Sin embargo, si ampliamos este diseño con una dimensión más de complejidad añadiendo también la función central de incubar MetaDAOs, la Comunidad Maker puede obtener todos los beneficios de este potente núcleo independiente, al tiempo que aprovecha las infinitas posibilidades de la innovación DeFi a largo plazo.  El primer paso para poner en marcha la primera MetaDAO es un proceso llamado clustering. Consiste en identificar a las personas, las relaciones, las oportunidades de negocio, las comunidades y las tecnologías que tienen una sinergia natural que puede beneficiarse de tener una estructura de gobierno y una comunidad distintas. Una vez que estos diferentes elementos se han agrupado, lo que en la práctica se hace a través de una propuesta de gobernanza de los creadores, la MetaDAO está lista para su lanzamiento.  A continuación, se lanza el primer MetaDAO. El primer MetaDAO tiene algunas consideraciones especiales que deben guiar su diseño, debido a su papel único de ser la primera vez que se prueba el concepto. Por esa razón, debe hacerse como un concepto de prueba de bajo riesgo que actúa esencialmente como una prueba de funcionamiento que tiene hitos de validación muy claros. Esto es muy adecuado para una CreatorDAO que debe probarse a sí misma creando un crecimiento viral y un aumento del ecosistema. En caso de que la primera MetaDAO no dé los resultados esperados, se puede reservar todo el proceso y abortar el plan. Esto lo convierte en una apuesta de bajo riesgo que puede hacerse paso a paso y retroceder fácilmente si las suposiciones resultan ser erróneas. En primer lugar, el primer MetaDAO será un reto importante para atraer a los trabajadores con talento que estén dispuestos a dar el salto a una nueva estructura desconocida. Por ello, Maker debe ofrecer beneficios muy atractivos a quienes sean pioneros en asumir el riesgo de esta transición. Esto puede hacerse tanto continuando los presupuestos existentes y las bonificaciones de MKR como comprometiéndolos con la nueva MetaDAO por una duración de largo plazo, y luego, además de estos beneficios existentes, la MetaDAO también puede proporcionar un presupuesto significativo de tokens de MetaDAO a los pioneros, creando una atractiva oportunidad de riesgo/recompensa.  Si el primer MetaDAO tiene éxito, entonces se pueden crear uno a uno MetaDAOs adicionales, y estos pueden ser ahora MetaDAOs estructuralmente importantes que ayudan a mejorar la Gobernanza de los Hacedores, incluyendo el lanzamiento de GovernorDAOs y CreatorDAOs que adoptan recursos y funciones críticas para desprotegerlos y mejorarlos.  Una vez que se hayan creado suficientes MetaDAOs, sólo quedarán el núcleo Maker y los MetaDAOs. Este nuevo paradigma de MetaDAO es muy poderoso y proporciona lo mejor de ambos mundos, donde el núcleo es inmutable y resistente, mientras que los MetaDAO se mueven rápidamente, son innovadores y contienen una complejidad altamente especializada. Los CreatorDAOs, en particular, también pueden empezar a innovar y experimentar en direcciones que están menos ligadas directamente al Maker Core, liberando el poder de las comunidades autónomas e innovadoras. Maker tampoco tendrá relaciones más allá de unas pocas relaciones DAO2DAO predecibles con las MetaDAOs y algunos protocolos clave como los socios D3M. Todas las Unidades Centrales y otras relaciones humanas son intermediadas por los MetaDAOs, asegurando que Maker no pueda caer en el problema de las relaciones de nuevo.  M0 es el concepto de la primera prueba de concepto de MetaDAO de bajo riesgo. Se trata de un CreatorDAO que se centra en la búsqueda de oportunidades de beneficio que son externas a Maker, o que adoptan la complejidad de la que Maker quiere deshacerse, como los pequeños tipos de bóveda. La unidad de núcleo Deco proporciona un valor fundamental bien adaptado de M0 Se pone en marcha con la transición de la Unidad Central Deco, recibiendo el presupuesto actualmente asignado a Deco, y agrupándose con los miembros de la Unidad Central. También puede incluir potencialmente recursos y miembros de otras Core Units que estén alineados con los objetivos de M0. Frontend con cuota de ingresos de la tasa de estabilidad La Unidad Central Deco ya proporciona un punto de partida perfecto para un modelo de negocio fuerte y significativo, ya que tanto tiene tecnología de frontend que el MetaDAO puede utilizar para proporcionar una plataforma de crecimiento que puede ganar participación en los ingresos de las tasas de estabilidad que canaliza a Maker - y esta participación en los ingresos se ve afectada por un bucle de retroalimentación muy potente, ya que las bóvedas tendrán MetaDAO yield farming de tokens M0, habrá un potencial significativo para ganar dinero en efectivo, que a su vez hará que los tokens M0 sean más valiosos, aumentando aún más el impacto del yield farming en un círculo virtuoso. Característica de bonificación de los tipos fijos Además de la propuesta de valor básica de proporcionar un nuevo frontend a Maker Vaults y obtener ingresos compartidos de los usuarios de yield farming, M0 puede ofrecer una funcionalidad única y avanzada aprovechando el producto principal de Deco Core Unit, que es un producto de tarifa fija tokenizada, y esto puede integrarse directamente en el frontend de M0 vault, creando oportunidades para las tarifas de servicio adicionales y aumentando aún más el potencial de obtener ingresos compartidos de la tarifa de estabilidad. Oportunidades de beneficio para Oracle Más allá de centrarse en un frontend de reparto de ingresos con un producto de tarifa fija integrado como propuesta de valor única, M0 se centrará en aprovechar la otra gran propuesta de valor oculta del ecosistema Maker, que es la red de oráculos Maker. El paso más básico será que M0 “adopte” algunos de los nodos oráculo Maker existentes. Adoptar los nodos oráculo significa garantizar y responsabilizarse del rendimiento de los nodos, a cambio de un importante flujo de pagos por parte de Maker. Este flujo de pagos cubre tanto el presupuesto que M0 puede proporcionar a los nodos oráculo para que actualicen sus procesos de seguridad y proporcionen la verificación de su seguridad, y también cubre una “prima de garantía” que va directamente a M0 como beneficios. A cambio de este flujo de pagos, Maker tendrá ahora una reclamación de resultados contra M0, y podrá extraer una garantía de M0 en caso de que se produzcan cortes, problemas de seguridad, fallos técnicos, ataques de oráculo, etc. causados por los nodos de oráculo adoptados por M0. Además, M0 podrá aprovechar un nuevo token para la red Maker Node, que es una evolución de la red Oracle. Este token está destinado a la agricultura de rendimiento a los titulares de tokens MetaDAO, y M0 será el primer MetaDAO que puede aprovechar esto. Los detalles completos de la Red Maker Node y el token $MANO se explican en el documento completo del Plan Endgame. Generación de valor D3M mediante bóvedas adoptadas Una propuesta de valor clave a largo plazo de todas las CreatorDAOs es que ejecutarán sus propias “mini-versiones” del motor Maker Vault que actuará como motor de préstamo para las MetaDAOs, y estará específicamente optimizado para que Maker lo aproveche a través de una construcción D3M. De esta manera, las CreatorDAOs pueden proporcionar una forma sencilla y potente para que Maker externalice la incorporación de garantías de larga cola que no son adecuadas para Maker Core, pero que siguen siendo una buena oportunidad de negocio. Tal motor de préstamos MetaDAO no estará disponible durante mucho tiempo, pero antes de que esté disponible todavía es posible simular la misma interacción a través de un sistema regulado por el PIM y la gobernanza por el que el MetaDAO adopta bóvedas en el motor principal de bóvedas Maker. El Gobierno Maker especificará todas las bóvedas de pequeña escala que estén por debajo de sus criterios mínimos para las bóvedas del núcleo Maker. El Gobierno M0 tendrá entonces la oportunidad de adoptar cualquiera de estas bóvedas que desee. Cuando M0 adopte una bóveda Maker, Maker sólo ganará una cuota de estabilidad baja en las bóvedas, mientras que el MetaDAO gana todas las cuotas de estabilidad por encima de esta línea de base (más cualquier ingreso de participación en los ingresos del frontend, si es aplicable). Sin embargo, a cambio, el MetaDAO garantizará el riesgo de estas bóvedas adoptadas, y el fabricante extraerá la garantía del MetaDAO para cubrir cualquier pérdida en la que incurra de las bóvedas adoptadas. M0 también será responsable de todos los costes de oráculo relacionados con las bóvedas adoptadas. M0 tendrá total libertad para ajustar los parámetros de riesgo (dentro de unos límites globales, incluyendo una línea de crédito máxima que sea equivalente a los parámetros de riesgo de un D3M). M0 también tendrá la libertad de migrar los almacenes a proveedores de oráculos de menor coste, como Chainlink, pero asume todo el riesgo de hacerlo y debe hacer todo el trabajo por sí mismo, a través de sus recursos internos y su proceso de gobernanza. Una vez que la tecnología del motor de préstamo de MetaDAO está lista, todos los almacenes adoptados pasan a ella. Desarrollar una identidad de metaverso única M0 será la primera oportunidad para que una nueva comunidad nacida de forma descentralizada desarrolle una identidad completamente única y descentralizada, que pueda crear potencialmente un valor intangible adicional para los miembros de su comunidad, y también sinergia con el producto frontend proporcionando una marca única que esté optimizada para atraer a los usuarios. Una vez que se hayan distribuido suficientes tokens y la comunidad haya empezado a cristalizar, la comunidad puede organizar internamente un proceso para elegir un nuevo nombre y un ticker de token. M0 no operará ninguna unidad central de Maker y Maker no dependerá de M0 Puesto que M0 es la primera MetaDAO, está diseñada de forma única para ser reversible, lo que significa que puede ser deshecha con relativa facilidad si el concepto resulta no ofrecer el tipo de crecimiento e impulso esperado. También es importante tener en cuenta que cualquier miembro de la Core Unit que se una a M0, incluidos los miembros de la Deco Core Unit, no serán “adoptados” por M0 (lo que significa que no seguirán trabajando como Maker Core Unit pero gestionados y con garantía de resultados por parte de M0, que es una funcionalidad que pueden tener otras MetaDAO). En su lugar, se unirán completamente a la MetaDAO y se convertirán en Unidades Centrales internas de la MetaDAO. Esto significa que asumen más riesgo, pero también obtienen mayores recompensas en forma de más tokens de MetaDAO y una exposición más directa al resultado de su propio trabajo. Además, como incentivo para que asuman el riesgo de ser pioneros, Maker proporcionará a M0 los recursos que de otro modo se habrían destinado a las unidades centrales que pasen a convertirse en unidades centrales internas de MetaDAO. Así que el MetaDAO tendrá mucho dinero en efectivo e incluso MKR para asegurarse de que cualquiera que haga el cambio obtendrá un aumento significativo como resultado del riesgo adicional y la responsabilidad de liderazgo que asumen.  El fruto más bajo del lanzamiento del Plan Endgame es la aceleración del hito de la hoja de ruta existente para lanzar rápidamente una versión simplificada de ETH sintética. Maker siempre ha planeado desarrollar eventualmente activos sintéticos para otros objetivos además de Dai, incluyendo tanto otras monedas como activos volátiles como ETH. El ETH sintético es un producto de gran potencia que se sinergiza especialmente bien con la próxima fusión, ya que el ETH sintético es un caso de uso intermedio entre el ETH nativo y los tokens de ETH estacionados, ya que ambos ofrecen una liquidez muy alta pero también exposición a las tasas de estacionamiento de ETH. Es posible crear muy rápidamente un ETH sintético completamente funcional simplemente creando una simple envoltura alrededor de un token de estacionamiento líquido, como Lido Staked ETH (o posiblemente un producto Staked ETH más pequeño si Lido comienza a estrangular su rendimiento, aunque eso es menos ideal) El Maker Governance conserva entonces toda la autoridad sobre esta simple envoltura de ETH apostada, y puede actualizarla posteriormente a un Activo Sintético de pleno derecho una vez que la tecnología esté disponible, los derechos de acuñación de la envoltura de ETH apostada al motor de la bóveda del Activo Sintético y la transferencia de todas las garantías de la envoltura a un PSM en el Activo Sintético. MATH puede ser el primer producto del juego final que debería ser lanzado, ya que puede ser un poderoso producto independiente incluso antes de que la agricultura de rendimiento de tokens M0 comience, ya que puede ser inicialmente hackeado por el crecimiento dándole una cuota de estabilidad del 0%, construyendo una base de usuarios antes de la agricultura M0.  Los tokens M0, inicialmente denotados como $MZR hasta que la comunidad elija un nuevo nombre, serán distribuidos a través de un cultivo de rendimiento de lanzamiento justo sin asignaciones internas, con el fin de maximizar el beneficio para el Ecosistema Maker más amplio y crear una comunidad que se descentralice desde cero. Esto incluye la granja MZR para los titulares de Dai, que proporciona a los titulares de Dai una alternativa para ganar DSR. Esta forma de distribuir los tokens MZR gratuitos sigue proporcionando a Maker un beneficio, ya que será más barato para Maker ofrecer un DSR alto ya que muchos usuarios no lo utilizarán, y en su lugar elegirán la granja MZR. El objetivo principal previsto de las recompensas de cultivo de rendimiento de MZR son las bóvedas de MATH, específicamente la deuda de las bóvedas de MATH. Esto ayuda a proporcionar un incentivo masivo para que los Dai estén respaldados por más ETH descentralizados como garantía, reduciendo la proporción de stablecoin y aumentando la descentralización del sistema. Maker también tiene la capacidad de ganar dinero a cambio de los tokens MZR gratuitos que se cultivan, porque Maker puede cobrar una tasa de estabilidad sobre la deuda de las bóvedas MATH. La tasa de estabilidad de las cámaras acorazadas utilizadas para el cultivo podría incrementarse dinámicamente para capturar parte del valor de los tokens MZR gratuitos, por ejemplo, fijándola en su tasa base + el 20% del APY proporcionado por la granja MZR. Esto crea una importante preservación del valor, ya que Maker es capaz de convertir los tokens en efectivo, y este flujo de caja impulsado permite a Maker financiar fácilmente muchos de los nuevos gastos introducidos por el Plan Endgame, como la cuota de ingresos de la tasa de estabilidad y las primas de garantía de adopción para los nodos de oráculo. Por último, una función importante del plan de cultivo de MZR es proporcionar un poderoso incentivo para que los titulares de MKR deleguen sus votos. En cuanto sea posible ganar tokens MZR gratis delegando MKR, se producirá una explosión de delegaciones activas. Muchos de estos votos serán votantes inteligentes y reflexivos, pero muchos de ellos también serán usuarios que simplemente eligen un delegado al azar para cultivar los tokens MZR. Por eso es muy importante consolidar primero la gobernanza de los creadores y establecer controles y equilibrios adecuados en torno a los delegados, para que sea seguro desatar los incentivos de la delegación en el lanzamiento de M0.  Cómo ayudan las MetaDAO a resolver los problemas difíciles       El Plan de Fin de Juego está diseñado para ser una bola de nieve que se lanza desde la cima de una colina. A medida que empieza a coger velocidad y se crean MetaDAOs, los incentivos que impulsan a los MetaDAOs les llevarán a construir el Estado Final predeterminado en el que el Núcleo Maker tiene características claramente definidas, potentes pero simples, y entonces tiene la capacidad de incubar MetaDAOs y dejar que sean responsables de cualquier innovación posterior.  Beneficios del plan Endgame El documento completo del Plan de Fin de Juego contiene todos los detalles de cómo es este estado final, y cómo los incentivos que impulsan la fuerza de trabajo, los MetaDAOs y el Gobierno de Maker de forma fiable hacia ese estado final. Esto incluye potentes diseños de productos para cosas como el motor de tokenómica y bóveda de Singularity Engine, la sinergia de tokenómica de Elixir wars, el token $MANO para el oráculo y la red de estacas de Maker, el rollup de MetaShard Maker, los activos sintéticos y otras potentes características. A continuación se enumeran algunos de los resultados en formato TL;DR para ayudar a resumir todos los beneficios que el Plan Endgame proporciona al proyecto El Plan Final completo se publicará esta semana.      Original  ",
                    "links": [
                        "https://forum.makerdao.com/t/endgame-index-list/16021",
                        "https://forum.makerdao.com/t/recognized-endgame-delegates-donde-esta-latam/15909",
                        "https://forum.makerdao.com/t/recopilacion-de-noticias-sobre-makerdao-dai-y-mkr/14694/67",
                        "https://forum.makerdao.com/t/recopilacion-de-noticias-sobre-makerdao-dai-y-mkr/14694/61"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0219017094017095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#2",
                    "likes": "4",
                    "time": "31/05/2022-15:37:39",
                    "content": "Tremendo aporte, se agradece! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#3",
                    "likes": "5",
                    "time": "01/06/2022-04:02:46",
                    "content": "Gracias @cryptenthusiastic por este gran aporte. Endgame se visualiza como un plan robusto que podría ayudar a MakerDAO a retomar el liderazgo de las stablecoins.     cryptenthusiastic:  El objetivo de los Comités de Electores Descentralizados es hacer que la gobernanza de Maker sea más naturalmente descentralizada, transparente y diversa. Al tener múltiples DVCs redundantes que se agrupan en base a valores comunes, denominados “Dirección”, los comités de votantes ayudan a fomentar la diversidad de opiniones y aseguran que haya una plataforma válida para todas las opiniones principales. Así se minimiza el riesgo de que algunas perspectivas puedan ser tachadas de “incorrectas”, aunque eso no interese a los titulares de las MKR, como ocurre actualmente, que es muy difícil debatir la reducción de los presupuestos.   Me parece muy útil este aspecto, y una visión muy constructiva el hecho de que los comités de votantes a través de su ente organizador puedan decidir que poseedores de MKR participan, fomentando un ambiente de colaboración en vez de obstrucción. En cuánto al ejemplo de lo difícil que es debatir la reducción de presupuestos, me hace recordar un principio básico de los gobiernos del mundo que es el de no preguntarle al ciudadano sobre un aumento de los impuestos ya que siempre dirá que no. La simplificación de los procesos y la reducción de la burocracia siempre hará que fluya mejor un ecosistema. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 0.9999999999999998
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#4",
                    "likes": "3",
                    "time": "12/06/2022-19:08:10",
                    "content": "Buen laburo!     cryptenthusiastic:  El ETH sintético es un producto de gran potencia que se sinergiza especialmente bien con la próxima fusión, ya que el ETH sintético es un caso de uso intermedio entre el ETH nativo y los tokens de ETH estacionados, ya que ambos ofrecen una liquidez muy alta pero también exposición a las tasas de estacionamiento de ETH. Es posible crear muy rápidamente un ETH sintético completamente funcional simplemente creando una simple envoltura alrededor de un token de estacionamiento líquido, como Lido Staked ETH (o posiblemente un producto Staked ETH más pequeño si Lido comienza a estrangular su rendimiento, aunque eso es menos ideal)   Me gustaría ver esto, me interesa saber cómo funcionaría realmente y cómo se desenvolvería ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                }
            ]
        }
    ],
    "group_index": "1164"
}