{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/cop26-a-technological-revolution-history-lens-and-some-food-for-thought/11832",
            "title": "COP26, a Technological Revolution History Lens, and some food for thought ",
            "index": 11832,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "clean-money",
                "longform"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#1",
                    "likes": "2",
                    "time": "25/11/2021-18:47:31",
                    "content": " COP26: Not Cool COP26 concluded a few weekends ago. It did not bring about a conclusive global turning point for climate action, as you may have read in the newspapers. This sign perhaps summarizes the COP26 agreement best:  1600×1066 180 KB  More scientifically, you can see a briefing from climateactiontracker.org from which I have copied the following picture:  1210×975 232 KB  Which shows both an action gap and a commitment gap. The positive view on the conference might be that globally the target of 1.5C by 2100, as the resulting requirements of global emissions halved by 2030 and Net Zero by 2050, are now just about generally accepted. But action and commitments are indeed quite far away from these targets. Which brings me to another sign:  1600×1066 201 KB  Good question! As this next sign sets out, the reason for changing should be quite clear to all…  1600×1066 145 KB  It all seems a bit grim.  But before we reach for the above pictured bestselling book, let’s just check our history books and think about how humankind has handled large challenges before. Perhaps ‘this time it’s different’ and reviewing history brings us neither comfort nor clarity on the situation we are in today - a climate disaster is pretty much a given - or perhaps, as Mark Twain said: ‘history doesn’t repeat itself, but rhymes’ and there are clues as to what might happen next and perhaps even some hope of us coming out on the right side of climate change. I’ll let you be the judge of that.  Technological Revolution Cycles The history book I am going to pull out from my bookshelf is “Technological Revolutions and Financial Capital: The dynamics of bubbles and Golden Ages” by Ms Carlota Perez from 2002.  Some of you might have read it or seen one of her presentations, and if not, then I can highly recommend this 1 hour presentation Ms Perez gave in 2020, sponsored by Baillie-Gifford. You can also check out carlotaperez.org for more of her excellent writings. The unfairly short summary of the book’s train of thought is that technological revolutions have shaped our progress and follow a fairly similar cyclical pattern (I will here use Ms Perez slides from her presentation to illustrate) - in the book she traces 4 and ~½ (the ½ is where we are now) such cycles.  1534×860 209 KB   1600×897 201 KB  In very brief the cycle phases work like this:   INSTALLATION PERIOD. At some point a technology is invented, which, in practical application, leads to ever increasing productivity in ever expanding areas - this the installation period of the technology. This is where the world experiments with the technology - large amounts of capital is invested into applying and designing the technology. As a consequence, wealth is generated to those who get the technology right. This period also sees the ‘old’ revolutionary technology coming to an end in terms of its ability to provide productive gains and usage. As a consequence, the tension between ‘old’ and ‘new’ grows in this phase. Simplistically speaking the tension grows between people invested in ‘the old ways and old technology’ who prefer this situation persists, and people who are enmeshed with the new technology, its general deployment and usage and promotes new life-styles and government structures/regulation etc. matching with the potential of this new technology.   TURNING POINT. The turning point is a period (sometimes several periods), where aforementioned tensions boil over and solutions are constructed and implemented around the ‘new’ technology, that work for, and benefit, everybody, as everybody settles into a new life-style and new government/regulatory frame. This ‘solution building’/turning point phase generally is a horrible time: income inequality, different lifestyle desires, job/industry losses etc. build-up social unrest and populism - there may even be wars in this period. Capital will overshoot the impact of technology and face capital destruction periods with potential material financial impact on the economy (recessions etc). Government and regulation struggles to figure out what to do: what to protect, what to promote, what (and how) to regulate in a new environment.   DEPLOYMENT PERIOD. But, at some point, things start coming together in a productive way forward - and the economy experiences “a golden age” - this is when the solutions built during the turning point period start taking hold broadly. Usually 3 items needs to be in place for a broad solution to be found for the society moving out of the turning point phase and into the deployment period (and golden age):   The installed base of the technology needs to be in place for productive growth across the board (lifting all boats and not just the few) - i.e. we need to know how to use the technology broadly for productivity gains, and have implemented a substantive amount of physical/logical infrastructure to support it and realise the productivity gains.   Government and regulation needs to have found their stride in terms of working with this technology and understanding how the society best benefits from it in a way that is consistent with a resulting new life-style driven by the technology’s advantages in productivity.   A new, generally accepted, life-style needs to have emerged that works with (rather than against) the technology     And then, of course, the cycle repeats.  Current Cycle & Smart Green Growth Future? Ms Perez believes that we are in a cycle originating fundamentally with Intel’s invention of the microprocessor in 1971 - and that we are deep into the turning point period, perhaps starting with the 2001 bubble, over the 2008 crisis and now into a CoVid and a clear climate crisis - we certainly have all the signs of inequality and populism - and the overshooting of effect - and a very large installed base of microprocessor infrastructure we know how to use to the benefit of all. A hesitant further prediction could be that a biotech-based cycle is slowly getting started. Ms Perez believes something like a Smart Green Growth Golden Age could be born from this turning point period. Of course, there are no good estimates for when such a golden age might start truly taking hold - nor any suggestion for what state the world might be in, climate-wise, when such a period might appear - or how spot on her characterization of such a golden age is. There is, however, a suggestion that because this next golden age is going to be more global in nature, than several of the historical technological revolutions, this cycle is going to probably have longer lasting phases. Ms Perez has authored a number of papers, you can find on her website, about this Smart Green Growth golden age. For instance this paper sets the vision out well. I won’t dig deep into this vision, but just provide you with 3 slides describing it - I think that is sufficient for you to get a glimpse of the overall pattern and thinking behind the vision:  1600×890 190 KB   1600×890 213 KB   1064×841 255 KB  Now, I would very much like Ms Perez to have gotten the theory and prediction right, because it tells a story of the world getting to a ‘better place’. That we’ve been here before, and generally the world seems to have the capacity to find a good way out - probably also on climate change. History rhymes. It opens up for the possibility of a brighter outcome than what might be predicted from the COP26 outcome.  1600×1163 221 KB  Irrespective of whether you agree with the model or the proposed potential future, I think it makes sense to spend some brain power on looking at Maker through this lens. There are always insights to be had from looking at what one is doing through different thoughtful lenses. To make sure one doesn’t get into the situation illustrated in this picture  1600×1067 377 KB  In particular I would suggest thinking about: 1. How could Maker have a positive role in getting the world out of the current suggested turning point? 2. How can Maker best fit into a potential Golden Age based upon a Smart Green Growth type of vision? Two very good questions to ponder for the Maker community.  A starting set of thoughts I had a go at thinking about them, and came up with the following thoughts:  1. Financing the Growth of the Green Economy & Finding Tipping Cascades? I think we have already established in the Maker community, under the “Clean Money” banner, that Maker can direct its ‘financing/collateralization power’ towards Green Growth assets. It will become a large asset class no doubt - and probably the mainstream in the future - particularly if you start considering the new credit risks and products that would result from products becoming services as a main societal norm. Deliberately building size and a frontrunner position in this sounds like a worthwhile endeavour. Maker would have the capacity to create a large supply of “Green” DAI. One exciting concept worth exploring in this context is the concept of tipping cascades. Complex systems have certain triggers which, when driven past a tipping point, result in rapid, non-linear, irreversible cascades of system changes, leading the overall complex system to an overall new state. A clear example would be the local, mortgage default shock in the US leading to a global financial crisis - very fast. In technology diffusion an example would be horse-drawn carriages replaced by cars and the large-scale complex system changes that occurred around it, all happened over only one decade. It happens, of course, also in nature, and unfortunately, we may be close to seeing such a tipping point being reached for several ecological systems (I am sure we will hear a lot more about these things over the coming years from the climate science community - pointing us towards which triggers we need to try and hold back faster than others).  818×493 92.9 KB  But, for Maker, right now, we can think of this concept as a way of ‘punching above our weight’: we can seek out these triggers and help push them past tipping points and accelerate large-scale positive changes with limited resources.  EXAMPLE: Norway is generally held up as an example, where a few key trigger changes (tax change, infrastructure setup motivation, consumer sentiments etc) led to rapid non-linear changes in uptake of electrical vehicles as they got pushed past the trigger-point: 72% of all new car sales in August this year were electrical in Norway. These two papers sets the case out very well. Note1 Note2. This picture illustrates the mechanism:  1500×815 144 KB    Another illustrative, but unfortunately unrealizable, idea, could be a Tesla-Maker cooperation, where Tesla allows certain countries populations to buy Tesla’s with DAI and Maker provides loans @ close to zero % to finance Tesla purchases (given certain underwriting criteria and Tesla providing certain financial guarantees) + special loan programs for infrastructure (charging stations etc). - for the purpose of helping trigger a “Norway effect” in a number countries (and btw in the process also increase both DAI Supply & Demand).  The fact that Maker can accept a, relatively speaking, low cost-of-capital, as long as the loan/security is rock solid, makes it possible for Maker to potentially “tip” these triggers. Well worth a consideration, I think, in identifying areas of lending focus.  2. Currency of choice for a Green-backed Global Economy? On the DAI demand side, surely there must be a symmetrical valuable position: it instinctively makes sense that the currency lubricant making a Green economy and life-style operational should be the currency backing it?  1600×1053 670 KB  One could think up the following inherent characteristics that would make DAI an ideal candidate for taking on this lubricant role for the world on a global scale as a transaction currency of choice:   Zero transaction cost and instant clearing: I expect this will be minimum requirements for transactions in a new green economy irrespective.   Programmatic: As products move to services, infrastructure gets installed and supply chains become even further integrated they will all be increasingly real-time monitored and one would expect integrated into a programmatic pay-for-performance system. Digital currency will be required to implement this sort of vision.   Global: That seems in line with the concept of the green economy being more global in scope than today’s economy.   Green Peg = stability (?): Today DAI is pegged to USD. In the future, should it make sense, it could be pegged to a basket of currencies that drives the green economy in the world. That might provide more stability than any individual currency can.   Green-backed = Stability (?): The currency’s stability is fundamentally backed by the growth and stable nature of a global greening process and asset build-up rather than the fate of an individual country.   Non-affiliated = Stability (?): Somewhat as last point. The currency is not backed by a specific country’s view on how the world should build a green economy - but based on a global DAO’s view.    3. Playing more of a Supranational Organisational role? Solution building to get out of the turning point and into a golden age seem to be predicated on some triangulation/negotiation/push and pull between private sector, public sector, government/regulations and the actual public to ultimately come to the right way forward. With the elements above I think Maker would be a positive enabler for both the private sector and the general public in finding a common green path forward. But how about the public sector, government and regulations? Of course Maker must adhere to regulations and national standards etc (and face all the challenges of doing so we are all aware of today) in the day-to-day in-country business and appropriately promote a green vision, but perhaps, interestingly, Maker, with the above sort of mission/setup, will probably have more in common with multiple supranational organizations, than with any national central banks or local banks. If the Maker’s ambition is to deliver the financial global “beating heart and cardiovascular system” for a Green Growth world, then surely Maker has more in common with certain financial parts of the UN and the IMF (and other similar organizations)? Obviously, today, with a lot less financial and governmental backing than above organizations. Interesting also to consider that both Ms Perez as well as, for instance, Mohamed El-Erian in “The Only Game in Town” seem to believe the ‘way out’ of where we are requires a global solution with much more global policy coordination than exists today - i.e. meaning, I suspect, more supranational organizations with larger global, practical, responsibilities and activism. And, actually, if you think about it, isn’t MakerDAO already sort of a supranational organization?  1600×892 246 KB  I wonder, if we look at the world with this sort of glasses on, does things change? I can think of a few items that might make sense to adopt from the world of the supranationals:   Seek broader representation and participation. MakerDAO is, by nature, a wonderfully open organization - anybody can participate in discussion, decision making and actual execution - in a more or less structured manner. But I wonder if there is mileage in deliberately inviting identified key stakeholders/representatives into the DAO discussions in a structured manner? One of the key strengths of most supranational organizations is indeed their broad representation such that broad validation can occur and broad actions can be accomplished by the organization in the wider world. I can easily think of several organizations and individuals in Economics, Finance and Sustainability I would think could add value to the conversations in MakerDAO (and I am sure the community have many other areas it would like to see more participants), but wouldn’t just naturally start interacting with MakerDAO - they would need invitation, motivation and structure to do so. I think MakerDAO could benefit tremendously from such an effort - not just in of course increasing the quality of ideas and discussion, but also to solidify and validate actions as, hopefully, MakerDAO will play a larger and larger role in the world economy.   Advance research and education. Often supranationals are also a place for progressing the world’s thinking and research on relevant subjects. To ensure, and grow, a science-based foundation for their actions - and of course affect the worldview of the relevant subject. On top of this there usually are educational efforts to help distill and diffuse the research - again to affect the direction of the world. I wonder if MakerDAO couldn’t gain from more effort in this area - clearly there is a lot of interest in exploring subjects around stablecoins, around DAO’s etc - and clearly it makes sense to participate in directing this research agenda and findings to have practical use for MakerDAO and ensure the world gets to hear more about it. If one wants to be the world’s no.1 stablecoin, I think one needs to participate in developing and setting both the academic and educational agenda on the subject.   Governance processes, policy making and devolution of authority. I have a sense that there might be useful organizational structures in these types of organizations that might help MakerDAO think about its own structures, but I have too little information right now to be specific.    Your Turn… I hope this, very brief, look at the world, COP26 and MakerDAO through a particular lens have sparked some new ideas in the community. I look very much forward to hear about them! I’ll end with one last sign - one where the protester got it wrong - because I don’t think it has to be a choice - with Maker I think we can see both types of Green at the same time. I hope you agree.  1600×1600 623 KB  ",
                    "links": [
                        "https://www.bailliegifford.com/en/uk/individual-investors/funds/scottish-mortgage-investment-trust/insights/ic-video/2020-q2-paradigm-shifts-with-carlota-perez-ind-we-1682?p=13758?utm_source=email&utm_medium=shortlink&utm_content=paradigm%20shifts%20with%20carlota%20perez&utm_campaign=paradigm%20shifts%20with%20carlota%20perez%20june%202020",
                        "http://carlotaperez.org",
                        "http://www.carlotaperez.org/pubs?s=dev&l=en&a=smartandgreen",
                        "https://www.exeter.ac.uk/media/universityofexeter/globalsystemsinstitute/documents/202001briefingnote.pdf",
                        "https://forum.makerdao.com/t/rocking-the-defi-chasm-4-the-real-competitive-moat-dai-network-effects/12458/10"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.459101973638715
                }
            ]
        }
    ]
}