{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/sourcecred-report/13277",
            "title": "SourceCred Report ",
            "index": 13277,
            "category": [
                "Discontinued Categories",
                "Misc Discontinued"
            ],
            "tags": [
                "sourcecred",
                "offch-govinc-set"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/TheExistence",
                    "index": "#1",
                    "likes": "15",
                    "time": "16/02/2022-21:37:12",
                    "content": " Context Hey everyone! We have finally finished with @hernandoagf a report on SourceCred’s performance to date. We hope that it contributes to the community for a better understanding of the results it has produced and helps to make better and more informed decisions regarding the steps to follow. Special thanks to @s_ben for their collaboration and to @prose11 and @LongForWisdom for their comments and support. Posts in the Off-Chain Governance Incentives Set  Off-Chain Governance Incentive Objectives SourceCred Report SourceCred and Coordinape Tool Comparison List of Options and Recommendations   SourceCred Report Intro It has been a year and a half since Maker began trialing SourceCred as an experiment in decentralizing rewards for governance work on its forum. Enhanced participation and discussion within communities organized around values, with a strong collaborative component, is extremely important, valuable, and necessary for a growing industry like DeFi. If we seek to transform the world, challenge the way things are done, and feel part of a community capable of achieving this, it is logical to look for new and different ways that help us structure how we relate to others, improving our interaction and clarifying in the most objective and possible way, who does what and who accomplishes what, in order to reward those actions accordingly. Within that framework, the Maker community saw the potential of the SourceCred algorithm and gradually adopted it as a tool to reward contributors to the DAO. The Algorithm SourceCred is a reputation protocol for open collaboration, to score contributions. A tool that allows communities to measure and reward value creation, a technology for making rewardable the labor of individuals in a project or community. Specifically, SourceCred’s technology determines how much value a user adds to a project or community by a metric that describes every contribution and contributor in a project. For SourceCred to be able to do that, it needs data: what the contributions were, how they relate to each other, and which ones were important. SourceCred first generates a graph from the input data. In this graph, a node is a contributor or contribution, and an edge represents some sort of connection between nodes. These connections are to express typically hidden dependencies, thanks, or flows of value embedded in activity on a platform. Examples would look like anything from a mention on a forum post to liking or merging a PR on GitHub. SourceCred has two main components: Cred and Grain. Cred is the metric that scores every contribution and contributor in a project, giving a sense of how important they were. Grain, on the other hand, can be considered an asset, which users need to opt in to receive and which is used to distribute DAI in the Maker community. By these mechanics, SourceCred has the potential of improving governance within communities by providing an effective, decentralized, and incentive-compatible way to value contributions. Motivation The implementation within our community began with the configuration of a SourceCred instance based on the Maker Discourse Forum, with a three-month trial in June 2020, distributing DAI to the governance participants based on their Cred scores. Later, the community decided to fund the program and to date it has been implemented in a sustained manner, gradually increasing disbursements, reaching the amount of 20,000 DAI per month. We started this journey under the hypothesis that if Cred scores can be used to pay contributors in a credibly neutral way, this would encourage participation in governance, through the incentives alignment between members of the Governance forum who do not hold MKR and MKR holders. In a broad and general sense, if our hypothesis turns out to be true, SourceCred should fulfill a triple function within the Maker community:  Establishing credibility as a constructive, cohesive, and legitimizing value of social status within the community Establishing itself as an inter-subjective rewarding tool for individuals who make contributions considered valuable in Maker Be the tool capable of scaling the contributor base, encouraging the arrival/participation of new individuals within the community  To date, 372.562 DAI have been invested in the program and its results have been favorably valued by the community in general, although some voices have been raised legitimately objecting to its results. Given this state of affairs, it is necessary to pause and evaluate the impact that this tool has had within our community. As a first step, some questions arise. Has the overall activity of our Governance Forum grown? Have we had more visits to our forum thanks to its implementation? Have more topics been created? More posts? Is it a specific small core group that benefits from SourceCred’s cash flow, or does it attract newcomers and outsiders? Has it led to new people taking an interest in governance? Furthermore, Can we prove it is actually creating more quality posts? Or can we quantify the benefits created from it and determine what the ROI of the budget is? This report will try to answer these questions. In doing so, we hope to provide the information that allows MKR holders and community members to evaluate the results SourceCred has produced to date. Our Strategy To address the impact that SourceCred has had on the Maker community, we will use different methodological strategies. First, we will carry out a general quantitative analysis of some of the engagement metrics available in the Discourse Admin Panel comparing the years 2021 and 2020. Our intention here is to see what has been, in general lines, the performance of these metrics and fundamentally to analyze, in a comparative key, if they have increased or decreased. We are aware that an increase or decrease of these metrics within our forum is a multicausal phenomenon and we do not intend to infer that it can only be due to the implementation of the SourceCred algorithm. However, we believe that this could be one of the multiple causes and its impact should not be underestimated beforehand. That is why we decided to carry out a second analysis more focused on contributors. Specifically, we decided to randomly select a sample of 20 collaborators, within the universe of users who have chosen to participate in the protocol, and we will try to track and measure their production, and the feedback they have generated from the community, before and after they have received their first payment as a reward for their contributions. We chose that first payment as a breaking point to evaluate if we can find changes in the behavior of the subjects of the sample after having been rewarded and, transitively, to observe if the appreciation that the community has, in terms of the quality of the discussion, changes or not after that tipping point. Finally, we are going to try to establish how to estimate the ROI of the budget of a project like SourceCred and carry out a brief analysis on the dispersion of Cred among contributors and the distribution strategy currently used, in order to shed some light on the performance that SourceCred has had in our community. Our Findings - Overall Activity The Governance Forum currently has 1,157 users who have generated at least 1 Cred and only 120 contributors have opted in and have been rewarded at some level by the algorithm. If we disaggregate those numbers, making a cut by taking the implementation of SourceCred as an initial milestone, we can see how 908 users have joined the Governance Forum since the algorithm is in operation. Of that number, 764 users have generated at least 1 Cred and 76 new users have opted in. This means that 23% of registered users in our forum did so after adopting the algorithm, and of the 120 current users who participate in the program, 63% were not part of the Maker community prior to the adoption of SourceCred. Taking into account the breakdown of these numbers, and as a first step, we decided to quantify seven engagement metrics in order to comprehend the overall activity of the Governance Forum in 2021 and compare them with the same metrics resulting from the activity in 2020. The metrics selected are engaged users, likes, new contributors, page views, forum visits, topics created, and posts created.     Metric 2020 2021 % Change     Topics Created 1,232 1,726 +40%   Posts Created 12,469 16,335 +31%   Visits 39,282 55,581 +41%   Page Views 4,379,277 11,008,501 +151%   New Contributors 663 635 -4%   Likes 27,084 48,602 +79%   Engaged Users 12,661 19,594 +55%     In addition to these metrics from our Governance Forum, the number of users receiving payouts over time can also serve as a proxy for overall activity.  In general, we can see an increase across all engagement metrics. Some of them had really considerable growth in the last year. We only find a slightly less increase in the number of new contributors in 2021. Our Findings - A Sampling Approach As a second strategy to evaluate the impact of SourceCred, we decided to randomly select a sample of 20 collaborators within the universe of users who have chosen to participate in the protocol, in order to measure their activity before and after having received their first payment as a reward for their contributions. First, we disaggregated the universe of 120 contributors into 5 quintiles, ordered by the amount of DAI received, and we selected the first two and the last two from each subset as a sample of 20 users for our research. Then, we measured their activity one month before receiving their first payment comparing it with the average of the three months after based on two different metrics to perform two different analyses. First, with a more quantitative approach, we quantified the number of posts and topics created by each contributor over that specific time period. Here, we wanted to find out if there was a correlation or not between the monetary incentive of having received the first SourceCred payment and the change of these metrics within each of the subsets stipulated for the sample.  As we can see in the table, there are 4 (20%) collaborators who have increased their activity, 5 (25%) who remained constant, and 11 (55%) who decreased in their production of posts and topics. The sampling shows a practically null correlation between the incentive of the first payment and an increase in productivity. Although it is observed that the first quintile concentrates 68% of the overall activity produced in the sample, and among the first 3 quintiles they add up to 98%, we can’t see a homogeneous trend in the user’s production after the first payment, nor can it be affirmed that the strata, defined by the different quintiles structure, show some pattern of behavior in relation to the SourceCred incomes. It seems to be more related to the general activity of those users before and after they got paid by the algorithm. An interesting fact may be that 5 of those 12 users (41%) receive payments by other means in the DAO. Finally, we observed that quintiles 4 and 5 show very little activity. We infer that it is due to the low participation of these users in the forum. Due to this, we made the decision not to include them in the next analysis since there wasn’t enough data to get reliable results for them. In the second analysis, we quantified the number of likes and replies received by the posts created by the sample contributors in the same specific time period. In this case, a significant change in these metrics would be interpreted as the impact SourceCred has had on the Maker community’s evaluation of the quality of the discussion generated by the contributors of each subset. To arrive at the values expressed in the table, we added the number of likes and replies received by users and then divided them by the number of posts made, e.g. If in the month before the first payment there were 5 posts, and they received 2, 1, 0, 4 and 5 likes, then the value for before would be: (2 + 1 + 0 + 4 + 5) / 5 = 2.4  The table shows that 7 (58%) of the 12 users received a greater number of likes and only half of the universe received a greater number of replies to their posts. Again, no clear correlation is observed between the monetary incentive and an increase in the quality of the discussion, expressed in the likes and broader participation of the rest of the community in the posts created by the contributors of the sample. Nor is a homogeneous trend seen during the 3 months after the first payment, nor can it be inferred that the level of income, expressed in the different quintiles, operates on the performance of the actors or structures their behavior in some way. ROI of the budget, incentives, and distribution strategy ROI (Return On Investment) is a value that measures the economic return obtained from making an investment. The ROI allows knowing how much money has been generated when business activity is carried out, allowing to assess whether it has been profitable or not. To calculate the ROI you must know the total income, from which you are going to subtract the costs and that result will be divided by the total costs. That is simplified into the following formula: ROI = (Profit - Investment) / Investment The SourceCred initiative spent 75000 DAI in 2020 and was projected with an estimated budget of 361,400 DAI for the year 2021. By the end of the year, 82% of the budget was executed for a total of 297,562 DAI. In the first 3 months of 2021, the program was financed by the foundation, but since March 2021 Gov-Alpha is in charge of its financing and implementation. The first problem that arises when trying to calculate the ROI of a project like SourceCred is how complex it is to monetize its returns. Indeed, a technological investment of this type allows us to budget the expenses and execute that budget more or less according to what was projected, but the most difficult thing is to estimate the financial benefits that we can obtain from it. Even more, if its implementation cannot automatically translate into improved revenue or cost reduction, nor does it result in a reduction in capital expenditures. So how do we calculate ROI when it comes to a technology investment with an apparently non-measurable return? Although financial data and metrics are at the core of value appraisal, they are not the only tools that allow us to assess the rate of return on a project. We need to get out of the box and ask new questions; How much are the contributions made worth? Are they an expense or an investment? If we couldn’t find a correlation between the monetary incentive and an increase in production or quality of discussion, is it because the incentives are misplaced or because they are insufficient? So what has been the average income of contributors? What is the cost of their contributions for MKR Holders compared to a Core Unit contributor? And finally, what opinion of SourceCred does the Maker community have? The last question is the most complex to answer and will require a series of surveys to be carried out that provide us with the subjective metrics that give us some indication of the community’s perception of the project’s value. To establish what has been the average cost per contributor during the last year., we take the budget execution destined for SourceCred in 2021 and subtract all the operation and maintenance expenses of the program, to arrive with the final number corresponding to the payments to the 120 contributors in 2021. The result shows that 260,000 DAI were distributed in payments, 87% of the executed annual budget. Then we divide that number by the number of users and divide it again by the 12 months of the year. The result shows an average monthly disbursement of 180 DAI per contributor. If we compare it with the salary of a Core Unit contributor, the investment seems to be substantially lower than the 30/40 DAI per hour that we charge. A first and possible solution could be to increase payouts. However, given that it is not a uniform payment, and that each contributor is rewarded according to their production, let’s make the equation a little more complex by analyzing what level of distribution exists among the SourCred contributors. The top 1 contributor has collected 19,372 DAI to date and the 120th has collected 21 DAI. The top 3 have received more than 15,000 DAI each, the top 8 have all received more than 10,000 DAI, and the top 15 have all received more than 5,000 DAI, while 55% (66 of the 120 users who have opted in) have received less than 1000 DAI. Here again, we find that 9 users of the top 15 (60%) receive payments by other means in the DAO. When we analyze the payout density function comparing its results on the top 50 and the top 120, we can clearly see how the current distribution strategy has led to the concentration of payouts in a few users while more than half of them participate marginally in the distribution. The algorithm technically allows us to separate the Cred from the payout formula, this data could lead us to think of different alternatives to improve the distribution strategy and reach more users by proposing changes through governance.  A possible solution could be to propose a percentage deduction from SourceCred payouts to users who already receive DAO payouts by other means. That would favor dispersion, spilling into more users, while most of the top contributors would not see their interests in participating in the discussion affected, since their main incentive to do that lies elsewhere. In sum, discussing returns is highly complex for investments like SourceCred, but it becomes a much more difficult task if we do not exhaust our efforts to put the incentives in the right place to make quality investments that deliver tangible results. We believe that the surveys planned for this year will give us a more complete vision of the results obtained to date, but this must go hand in hand with an inclusive distribution strategy that favors neutrality and decentralization, and that fundamentally underpins the growth of the DAO towards its new goals. Conclusions Initial hypothesis and sampling results We could not corroborate our initial hypothesis. The implementation of SourceCred has not yet proven to be the cohesive element capable of driving and qualifying the discussion or legitimizing its interlocutors within the community. Nor can we nominally prove that it has attracted new members to the forum, although more than half of the users who opted in were newcomers in 2021. The idea that it is a credible and neutral way to reward contributions has not been overthrown. It was not possible to establish a correlation between the monetary incentive proposed by the algorithm and a higher production or quality in the discussion by users. Nor was it possible to find a constant trend capable of standardizing or structuring user’s behavior. Overall activity and contributors base The overall activity of our Governance Forum was much higher in 2021 compared to 2020. Analysis of the engagement metrics shows that the discussion grew substantially, intensifying the governance process in the DAO. Only 3% (120) of the total users registered in the forum (3,971) participate in the SourceCred project and of that number, 63% (76) were not registered in the forum before 2021. Gaming In general lines, the algorithm has not been gamed. The greatest rewards have been for users recognized for their contributions to the community, many of them even fulfill other roles in the DAO for which they are also rewarded. At this point, the manual process has been crucial, to gradually add users to the protocol, as they have requested it. Only users with a consistent Cred flow have been added and previously reviewed what type of activity they develop in the discussion within the forum. This point will have to be carefully observed if we intend to scale and automate the arrival of newcomers. Payouts, incentives allocation, and level of dispersion Payouts made as a reward by SourceCred have been substantially lower than those paid out for collaborators of the Core Units. However, those payouts have proven to be highly centralized to a handful of users. The highest decile has received the same accumulated pay as the remaining 9, and of those top 12 users, 7 work directly or indirectly in the DAO. The current distribution strategy has been shown to favor concentration by mainly rewarding a small group of users, whose main incentive to participate in the discussion lies in other activities carried out in the DAO, either directly or indirectly. Potential next steps Given that we can’t prove that SourceCred is having a quantitative effect, governance may want to consider the wisdom of continuing with the project with the proposed next steps to improve algorithm performance. These are the community surveys, along with the Project X-Ray team, the new governance-focused instance to boost government actions, and the system automation to improve processes and UX with a new Discord bot. ",
                    "links": [
                        "https://forum.makerdao.com/t/off-chain-governance-incentive-objectives/13298",
                        "https://forum.makerdao.com/t/sourcecred-report/13277",
                        "https://forum.makerdao.com/t/sourcecred-and-coordinape-tool-comparison/13299",
                        "https://forum.makerdao.com/t/off-chain-governance-list-of-options-and-recommendations/13373",
                        "https://forum.makerdao.com/t/sourcecred-and-coordinape-tool-comparison/13299",
                        "https://forum.makerdao.com/t/off-chain-governance-incentive-objectives/13298",
                        "https://forum.makerdao.com/t/off-chain-governance-list-of-options-and-recommendations/13373",
                        "https://forum.makerdao.com/t/delegate-sourcecred/15365",
                        "https://forum.makerdao.com/t/sourcecred-de-delegados-traduccion/15479",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-10-17-2022/13292",
                        "https://forum.makerdao.com/t/delegate-sourcecred/15365/6",
                        "https://forum.makerdao.com/t/signal-request-sourcecred-stop-paying-people-who-are-already-paid-by-makerdao/12971/41",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-19-25-2022/15397",
                        "https://forum.makerdao.com/t/off-chain-governance-list-of-options-and-recommendations/13373/7"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.526708577370342
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "2",
                    "time": "17/02/2022-16:52:03",
                    "content": "It seems like this report shows that it is difficult to understand the effect of SourceCred by looking at the data. I wonder if we could get more insight by interviewing the beneficiaries? We already know that many of the top beneficiaries regard SourceCred as part of their regular MakerDAO compensation to the extent that we’d need to think about raising base comps if SourceCred was turned off. This report was promised to provide guidance about next steps. However, we mostly learned that the data is hard to analyze. I am still leaning in favor of the idea of adding another SourceCred instance that only pays people who are not already paid by Maker. How do others feel about next steps? ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-sourcecred-stop-paying-people-who-are-already-paid-by-makerdao/12971/17",
                        "https://forum.makerdao.com/t/signal-request-sourcecred-stop-paying-people-who-are-already-paid-by-makerdao/12971/19"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1856060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "19/05/2022-22:52:10",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}