{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/unified-auctions-ui-release-v1-2-1-may-13th-2022/15171",
            "title": "Unified Auctions UI Release v1.2.1 - May 13th 2022 ",
            "index": 15171,
            "category": [
                "Core Units",
                "Sidestream Auction Services"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "6",
                    "time": "13/05/2022-15:31:05",
                    "content": "Unified Auctions UI Release v1.2.1 - May 13th 2022 Version: v1.2.1 Name: Bukowskis Each sprint is special. The last one however, was very special as we saw a lot of liquidations due to the recent market crash. Some early numbers and insights:  257 auctions of 16 different ilk types 5 auctions with above 1mio Dai collected Over 30mio Dai collected in total First CRVV1ETHSTETH-A auction  For the Unified Auctions UI it was a stress test. It was performant and could handle the load even during the time of ~40 concurrent auctions without any downtimes. In order to get more insights on the actual usage of the UI & Keeper we fetched auction information based on the Take events. These are emitted by the Clipper contracts whenever an auction is taken. Based on this data we analyzed how many auctions were taken via one of the callee contracts. Callee contract usage was our proxy since the Unified Auctions UI, the Unified Auctions Keeper and the auction-demo-keeper make use of them. (Of course, it can’t be ruled that other actors or services make use of the publicly available callee contracts as well.) This investigation showed that 47 auctions (ie. 18% of the auctions during this week) relied on callee usage. The figure is a first approximation on the usage of existing backstop solutions, and we will analyze auction participation in more depth in the future.  v1.2.1 in a nutshell Although the markets provided enough stories and movement to follow them 24/7 we also focused our attention on building as we are used to. In this sprint’s release, we want to focus our update on the deprecation of the old liquidation portal and a new notification service that we have built. Since our update is mainly about replacing the old auction portal (you could almost call it an acquisition) and this week is all about auctions at Maker, this time the update is called Bukowskis. The Swedish auction house was acquired by Bonhams this year. Bukowskis was especially known for its online auctions. So if that’s not a proper fit, we don’t know what is.  Deprecation of old liquidation portal The Unified Auctions UI reached feature parity with the old liquidation portal. The latter is now deprecated and no longer accessible under its old domain, as it now redirects to the Unified Auctions UI. A big shout-out to @DUX who ensured to keep it alive until recently. As for a transition period, the old liquidation portal will still be available under a legacy domain to ensure redundancy. To get an overview on the feature set of the Unified Auction UI as of today, you can watch the following demo video:    VEED    VEED - Unified Auctions UI Demo (G&R call) Make stunning videos with a single click. Cut, trim, crop, add subtitles and more. Online, no account needed. Try it now, free. VEED      As always we encourage everyone to provide feedback. Especially those who might have even used the Unified Auctions UI during the recent market crash.  Notification Service It is important to have the right tools in place that help monitoring the overall state of the system. Our motivation for building a notification service was to ensure the fastest possible response time to events that might affect the state of the Unified Auctions UI. An example: During the recent offboarding of TUSD its abacus contract was updated in a way that it no longer provided the step and cut parameters that we make use of. We were able to quickly accommodate for the changes. However, the notification service will now automatically inform us about changes to the MCD system as it alerts about events that are emitted by the chainlog contract. In line with our guiding principle to build modular and re-usable services, the notification service is self-sufficient and can be forked and used by everyone. For more details, see: unified-auctions-ui/notification-service at main · sidestream-tech/unified-auctions-ui · GitHub ",
                    "links": [
                        "https://unified-auctions.makerdao.com/collateral",
                        "https://github.com/sidestream-tech/unified-auctions-ui/tree/main/bot",
                        "https://github.com/makerdao/auction-demo-keeper",
                        "https://legacyliquidations.vercel.app/",
                        "https://www.veed.io/view/9aac356e-4f0c-406e-8148-83758b3b05f1",
                        "https://www.veed.io/view/9aac356e-4f0c-406e-8148-83758b3b05f1",
                        "https://github.com/sidestream-tech/unified-auctions-ui/tree/main/notification-service",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-may-2022/15932",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-mayo-del-2022/16043",
                        "https://forum.makerdao.com/t/mip40c3-sp85-modify-sidestream-auction-services-core-unit-budget-sas-001/18253/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.826768357428734
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tobalgarcia",
                    "index": "#2",
                    "likes": "0",
                    "time": "14/05/2022-23:44:30",
                    "content": "Thank you for this insightful investigation and congrats on the new UI! Information about the auction system is very important!      danik:   257 auctions of 16 different ilk types 5 auctions with above 1mio Dai collected Over 30mio Dai collected in total First CRVV1ETHSTETH-A auction    Is there a website where we can consult this data from past liquidations? I was looking at this one: MakerDAO Risk Dashboard | Block Analitica but it says that from May 8th to May 12th the protocol experienced 90 auctions. Thank you in advance  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.012784090909092
                },
                {
                    "author_link": "https://forum.makerdao.com/u/commanderkeen",
                    "index": "#3",
                    "likes": "4",
                    "time": "15/05/2022-12:25:49",
                    "content": "that was our mistake, we had some data problem, should be fixed now MakerDAO Risk Dashboard | Block Analitica I will look into it why that happened so there won’t be issues next time ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-may-2022/15631"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "13/08/2022-12:25:57",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/unified-auctions-ui-release-v1-3-0-may-27th-2022/15407",
            "title": "Unified Auctions UI Release v1.3.0 - May 27th 2022 ",
            "index": 15407,
            "category": [
                "Core Units",
                "Sidestream Auction Services"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "3",
                    "time": "27/05/2022-13:01:40",
                    "content": " Unified Auctions UI Release v1.3.0 - May 27th 2022 Version: v1.3.0 Name: Paulus Swaen  v1.3.0 in a nutshell During the last sprint we had a team onsite to strategize together but also focused on building. Therefore, we are happy to announce the next release in the usual manner. This sprint we focused on keeper improvement and hardening the performance of the Unified Auctions UI. We also prioritized roadmap items and decided to tackle flap auctions as the next auction type to be included in the Unified Auction UI. Today’s update is called Paulus Swaen. The auction house specializes in maps, atlases, globes, travel posters. Since we focused on the roadmap and prioritized features in this sprint, the choice of the name fell on the former Dutch auction house.  A closer look at changes  Optimized auction fetching It is our goal to provide auction services that are performant and can handle the load in extreme market conditions. During the recent market crash, we experienced no outages or downtime of our UI. However, to further improve the performance, we optimized our approach to fetch active auctions. So far, we have fetched all auctions every 30 seconds, which can compromise the performance of our page given all the enrichment that we apply to an auction. In our new approach, we only fetch a single auction when it is opened and only fetch all auctions once the user needs a complete overview. So for example if a user enters the UI via a tweet on an active auction, only this auction is constantly fetched until the point where the user navigates to the auction overview which will lead to all auctions being fetched.  Pre-authorization of Keeper The keeper implementation now allows pre-authorizing Dai and collaterals. The default behavior of the keeper implementation is to wait until a specific auction is profitable and then execute authorizations only required for this particular auction. This, however, can lead to higher transaction fees since authorization transactions might be executed during times of high network congestion and increase overall execution time. In order to prevent this, the keeper can now be configured in a way to authorize Dai and whitelisted collateral types on startup once the respective environment variable is set. For more information on the keeper, see its readme. We encourage everyone to give feedback on future improvements. Outlook: The support of custom RPC endpoints is on its way.  Support WSTETH-B We ensured that WSTETH-B was immediately supported by the UI and Keeper implementation after its launch. Given the fact that no new callee contract needed to be supported for this collateral type it was a straightforward onboarding process. In general, we have outlined the procedure for collateral onboarding here.  Things to come  Flap auctions Since at least Flappy Friday at the beginning of this year, we saw the need to improve the current state of the flap auctions UI. Besides continuous improvement and onboarding of new collateral types for the collateral auctions, we will also start to incorporate the flap auction support in the Unified Auctions UI. Our plan is to integrate flap auctions in a seamless and accessible way. The user will be provided with a uniform experience, no matter what auction type, to participate in. We are aware that the flap auctions might be upgraded to liquidation 2.0 at some point in the future and will keep that in mind during conceptualization. We encourage everyone who has interacted with the existing UI for flap auctions in the past to share insights, pain points or wishes for the new revised version that will be integrated to the Unified Auctions UI. ",
                    "links": [
                        "https://github.com/sidestream-tech/unified-auctions-ui/tree/main/core#collateral-onboarding",
                        "https://auctions.makerdao.com/flap",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-mayo-del-2022/16043",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-may-2022/15932"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.378595185302503
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/05/2022-02:54:41",
                    "content": "Right, it is better to prevent by making the system robust for when a massive demand arrives, than to regret the delay or system crash, giving importance to the user experience is relatively vital, do you need developers or programmers, in what programming languages, and oriented to do what kind of things? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.485714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "0",
                    "time": "28/05/2022-04:14:31",
                    "content": "    danik:  Flap auctions   Are we going to have flap auctions again or are they replaced by DssKiln? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#4",
                    "likes": "1",
                    "time": "28/05/2022-10:59:36",
                    "content": "From my perspective this will still be unclear for quite a while. Therefore, we believe it makes sense to integrate some support for flap auctions into the unified auctions UI, to be safe and not rely on an outdated UI. We follow the current discussions around DssKiln and reflect them in the way how we will built related feature (as lean and as flexible as possible without sacrificing robustness). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "26/08/2022-11:00:32",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1096"
}