{
    "poll_list": [
        {
            "title": "Increase the Surplus Auction Buffer - October 19, 2020",
            "index": "4716",
            "option": "Yes",
            "supporting_mkr": "50,109",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-increase-the-auction-surplus-buffer-system-surplus-september-2020/4469",
            "title": "[Signal Request] Increase the Auction Surplus Buffer (System Surplus) - September, 2020 ",
            "index": 4469,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "system-surplus",
                "sig-status-rejected"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#1",
                    "likes": "9",
                    "time": "29/09/2020-22:32:18",
                    "content": "With fees finally accumulating, the auction surplus buffer (system surplus) is quickly (nice!) approaching the point where FLAP auctions will begin to occur. Therefore I would like to gather signal from the community as to whether they would like to increase the auction surplus buffer, hold off and allow FLAP auctions to occur, or a combination of both. Pros of increasing buffer  More resources to spend on domain teams, treasury, system insurance, and other expenses.  Pros of allowing FLAP auctions  MKR burn will increase MKR price Possibly boost morale for MKR holders having to endure since Black Thursday  If you have other pros please add in the discussion below. Should we increase the Auction Surplus Buffer?     Yes, before FLAP auctions occur Yes, after some FLAP auctions occur No Abstain     0 voters     If either \"Yes\" wins     Increase Surplus to 3 Million Increase Surplus to 4 Million Increase Surplus to 5 Million Abstain     0 voters     If \"Yes, after some FLAP auctions occur\"     After 1 week of FLAP auctions After 2 weeks of FLAP auctions After 3 weeks of FLAP auctions After 1 month of FLAP auctions After more than 1 month of FLAP auctions Abstain     0 voters     Polling will run until 2020-10-05T04:00:00Z or 40 participants have chosen a clear winner. If a “Yes” is chosen, a pull request will be created to be added to on chain governance on Monday, October 12, 2020 and if passed, will proceed to an executive on October 16th, 2020 to be implemented. If clear consensus is reached before Thursday, October 2nd, a pull request can be implemented to go on chain for Monday, October 5th instead. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-adjust-the-surplus-buffer/5767",
                        "https://forum.makerdao.com/t/week-18-dai-distributions-sourcecred-trial/4602",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-113-thursday-october-8-16-00-utc/4505/2",
                        "https://forum.makerdao.com/t/signal-request-increase-the-auction-surplus-buffer-by-2m-system-surplus-october-2020/4716",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-112-thursday-october-1-16-00-utc/4391/2"
                    ],
                    "GPT-summary": "The author of the post is seeking feedback from the community on whether to increase the auction surplus buffer or allow FLAP auctions to occur. The post also includes a poll for the community to vote on the options presented. The post does not include any advertising or collaboration requests, and there is no third-party feedback provided.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.386904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#2",
                    "likes": "7",
                    "time": "29/09/2020-22:53:12",
                    "content": "I like it.  I might offer a different approach to the “weeks of FLAP auctions” section.  We should think about the relationship of DAI to MKR market cap (since MKR speculation is supporting this whole operation here).  We could set a target ratio, eg 1:1 DAI minted to MKR market cap, and increase the buffer as soon as that cap is reached. MKR Market cap: ~520 million DAI minted: ~900 million Burn MKR until the ratio is 1:1? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#3",
                    "likes": "2",
                    "time": "29/09/2020-22:58:50",
                    "content": "I like it. If “delay surplus buffer increase” wins we can have a separate signal for that idea, or you can do it in parallel if you wish. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Voltaire",
                    "index": "#4",
                    "likes": "7",
                    "time": "29/09/2020-23:49:01",
                    "content": "Might be nice to get MKR supply back to 1 million to match initial distribution meme and break a psychological setback. Haven’t done the math on how long that would take. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.549999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#5",
                    "likes": "1",
                    "time": "29/09/2020-23:59:57",
                    "content": "Little over a month as per current rates ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.53125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#6",
                    "likes": "1",
                    "time": "30/09/2020-02:58:50",
                    "content": "The system accumulates more than 85,000 DAI per day, reaching 2 million by mid-October. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#7",
                    "likes": "2",
                    "time": "30/09/2020-03:08:56",
                    "content": "Your pros and cons here are completely misleading.   We do not need to increase the buffer to have more money to spend on domain teams, treasure, etc.  MKR holders can simply vote to fund these activities directly by minting new MKR while the burn of MKR from the protocol income continues as designed.   We don’t need to create a slush fund before we fund important priorities - all we need is for MKR to be valuable so that we can mint it and sell it for what the community decides is a priority. The hard part is getting consensus on exactly how to spend the money- I don’t think having a slush fund make this any easier. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.746685606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#8",
                    "likes": "2",
                    "time": "30/09/2020-03:21:28",
                    "content": "You assume MKR holders want to dilute themselves to fund projects. I agree that these things aren’t completely contingent on the surplus but instead active revenues. The surplus ensures we have funds available in case of a failure of the system and stores active revenues which can be decided on by the DAO on how to be used. Having a “slush fund” definitely makes this easier as its predictable and tangible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.654761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#9",
                    "likes": "1",
                    "time": "30/09/2020-04:41:25",
                    "content": "What am I missing here… We can easily mint new MKR and sell it for covering expenses while in parallel flap happily. Right? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.655411255411256
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#10",
                    "likes": "2",
                    "time": "30/09/2020-05:16:48",
                    "content": "One on the key issues on why we should at some point increase the SB instead of burning maker is because of the CR of the stablecoins at 1.01.Please someone correct me if I’m wrong on this since it was discussed in the rocket chat. At some point ( provided the peg does not drop below 1 so vault owners can liquidate and get the profit) we will stop making revenue on part of the stablecoin portfolio. Since liquidations aren’t enabled all vaults at 1.01 that have been for more than 3 months will be undercollateralized therefore if the revenue were to be burnt we would have to mint maker to back up the undercollateralized debt. That’s why it was also proposed to increase the SB because once we reach a certain threshold of CR of stablecoins any loss would be offset from the SB and we would still accrue income from new vaults. Another alternative was to keep the burning while later in time dropping the SF of stable coins to cero. That would imply burning but leaving money on the table for all stablecoin vaults that have room to grow on the interest. In summary my vote is more related to this point than domain teams or expenses (and also taking into account a month if not more of maker burning) those could be taken out of the SB and eventually if it were not enough increase it. If we are to use the funds from the SB we better make sure that they are not contigent and the best alternative I’ve heard so far is to increase the SB (once we stop burning maker if that is decided) keep the interest on stablecoins & keep track of underwater vaults since those funds on the SB are temporary pending write off of the vault. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.90021645021645
                },
                {
                    "author_link": "https://forum.makerdao.com/u/shane",
                    "index": "#11",
                    "likes": "3",
                    "time": "30/09/2020-05:26:09",
                    "content": "Correct me if I’m wrong, but I was under the impression that a larger surplus would have allowed us to avoid the minting of additional MKR after Black Thursday, as the surplus might not have run out during the auctions. If that is true, I would imagine the surplus should be some rough percentage of the total DAI supply. Maybe somewhere between 10-20% in order to account for black swan events. A Black Thursday with 50 billion DAI in circulation would be very different than the Black Thursday we experienced. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.946969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#12",
                    "likes": "1",
                    "time": "30/09/2020-05:38:55",
                    "content": "    latetot:  We do not need to increase the buffer to have more money to spend on domain teams, treasure, etc. MKR holders can simply vote to fund these activities directly by minting new MKR while the burn of MKR from the protocol income continues as designed.   I agree. Still, from marketing perspective, i think it would be good to burn some MKR. Since (crypto) market is very speculative at this point, this might even push MKR price higher. In the end, i think I’ve learned 2 lessons this year:  unexpected (rare?) events are probably much likely then we thought we need to go faster (even when things seem to calm down) -> we should not optimize (discuss) solutions too much to find perfect solutions, but focus on moving forward first  Anyway, efficient MKR burning is quite unimportant at this point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.087752525252526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#13",
                    "likes": "5",
                    "time": "30/09/2020-07:13:13",
                    "content": "I don’t think it’s a good idea to continue to increase the surplus buffer. As noted here, the surplus buffer belong to DAI holders in case of an ES. Assuming the farming stop and we go back to 400M DAI, a surplus buffer at 4M DAI would mean DAI = 1.01$. If DAI is below that, that incentivize triggering an ES (especially if a good amount of the collateral is stablecoins). Having more DAI aside is also not helping the peg. Each more DAI is basically a new USDC in a vault. But I don’t see a way to solve that. I’m not against the overall idea but I would put the surplus of the surplus buffer in a DAI holder remote wallet (like strategic reserves). I also like the idea to burn enough to go back to 1M MKR. Finally, most of the fees are from stablecoin vaults, so those will likely by cut down in 2 months. It’s not quite clear that this income is real (as we have no solution to liquidate yet). It could soon become an expense. We might want to avoid to burn virtual money. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaration-of-intent-strategic-reserves-fund-srf/3765"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.958846275252525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#14",
                    "likes": "1",
                    "time": "30/09/2020-11:40:20",
                    "content": "I voted to stop accumulating DAI. Unless we have a detailed plan about what to do with the surplus, who will do it and how much money is needed - I think its best to stick to the original plan and burn MKR. Straying from the original plan should at least require a separate (mid-week) executive vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.708333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#15",
                    "likes": "1",
                    "time": "30/09/2020-20:27:42",
                    "content": "    Aaron_Bartsch:  Having a “slush fund” definitely makes this easier as its predictable and tangible.   Not really.  Having a slush fund without a clear mandate from the community on who controls it and how to spend it can be a set up for recrimination and mistrust and breaking the social contract with MKR holders.  I would start with a mandate on what and how much we should spend money on to support the protocol and then consider how to fund it.   Its the same cost for MKR holders if you divert income into a slush fund or mint new MKR to pay for a cost but allow existing income to be used to burn MKR.  The main issue here is getting consensus on how to spend the money before diverting income from burning MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.186868686868687
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#16",
                    "likes": "1",
                    "time": "30/09/2020-20:32:07",
                    "content": "There is no income from the USDC vaults unless the peg returns to $1.00.  If they were liquidated today, all of the USDC would be used to buy back the outstanding Dai at $1.01 and there would be losses on the CDPs with an LR < 1.01 that would require minting MKR to pay off.  We should burn MKR with the surplus Dai, however, because we will need to mint MKR when we liquidate these CDPs unless the peg returns to $1.00 or below. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#17",
                    "likes": "6",
                    "time": "01/10/2020-13:54:37",
                    "content": "I also want to add that MKR price helps stir up excitement about the project, which can help bring attention and lure in new talent. I think it’ll be easier to get new domain teams onboard after a sustained MKR pump ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#18",
                    "likes": "0",
                    "time": "08/10/2020-12:29:33",
                    "content": "I’m closing these polls as it’s past the communicated closing date and I haven’t seen @Aaron_Bartsch in a few days. I don’t think there is a clear consensus here to make any changes based on these poll results. Note that @Risk-Core-Unit have posted a thread here which may have some impact on the surplus buffer. Thank you to all for voting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Blue_Pickle",
                    "index": "#19",
                    "likes": "0",
                    "time": "09/10/2020-21:49:23",
                    "content": "Anyone know the address that shows the surplus balance, I’d like to be able to track it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#20",
                    "likes": "0",
                    "time": "09/10/2020-23:39:38",
                    "content": "As I understand it’s not actually ERC20 DAI at this point. In fact I’m pretty sure it’s not even one field in the smart contract. I think it’s a aggregation of a couple of internal accounting values in the vat. Some of the smart contract guys may be able to confirm. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.198979591836736
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chonghe",
                    "index": "#21",
                    "likes": "0",
                    "time": "10/10/2020-14:20:07",
                    "content": "I see that the surplus is 2M now. Has it been auction for MKR? I see that MKR supply seem to change now, how to see the surplus action transaction? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#22",
                    "likes": "1",
                    "time": "10/10/2020-14:32:12",
                    "content": "   Dai Auctions | Flap    Dai Auctions | Flap The place to see all MakerDao Auctions. Welcome to the open blockchains.      ",
                    "links": [
                        "https://daiauctions.com/flap"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chonghe",
                    "index": "#23",
                    "likes": "0",
                    "time": "10/10/2020-14:56:21",
                    "content": "So… they have been auctioned and mkr is burned? So the increase surplus is not done in time to increase it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#24",
                    "likes": "4",
                    "time": "10/10/2020-15:04:29",
                    "content": "Take your time and read this: https://docs.makerdao.com/auctions/the-auctions-of-the-maker-protocol#surplus-auction Surplus buffer was 2m and lot size is 10k (dai). At this point, if we simplify, for every 10k of accrued stability fees, surplus auction is triggered. When it’s finished, mkr gets burned. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#25",
                    "likes": "0",
                    "time": "11/10/2020-19:51:23",
                    "content": "The issue by increasing the surplus buffer is that we remove dai from the supply. What if instead of increasing the buffer we recolateralleraze it with usdc from the fees. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#26",
                    "likes": "0",
                    "time": "26/10/2020-12:09:06",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-increase-the-auction-surplus-buffer-by-2m-system-surplus-october-2020/4716",
            "title": "[Signal Request] Increase the Auction Surplus Buffer by 2m (System Surplus) - October, 2020 ",
            "index": 4716,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "system-surplus",
                "sig-status-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "6",
                    "time": "13/10/2020-09:13:00",
                    "content": "Hey all, I have written here about reasons to increase Surplus Buffer due to potential inability to collect current and future accrued fees on debt from stablecoin collateral. I have tried to address some concerns that may have not been addressed before this poll where people voted in favour of not increasing Surplus Buffer. I am going to run another poll, by proposing a 2m increase of the Surplus Buffer. At current rates and potentially implementing this increase on next Friday’s executive vote, this buys us about 5 weeks time from now before we hit it again. Another reason for increasing Surplus Buffer that I haven’t addressed in my previous post but mentioned on the G&R call is that Maker currently has around 900m debt exposure, of which 420m is based on volatile collateral. Ideally Maker should be always aiming to have between 2% and 4% buffer available for loss coverage (these levels are based on risk premiums). In case Surplus Buffer is increased to 4m it would represent around 1% of debt from volatile collateral and is somewhat better than the current 0.5%. Although still not ideal in my mind, it is a step forward. Should we increase the Surplus Buffer by 2m?     Yes No Abstain     0 voters     Poll is open until this Friday and will proceed to Monday’s on-chain Poll. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-increase-the-auction-surplus-buffer-system-surplus-september-2020/4469",
                        "https://forum.makerdao.com/t/maker-relay-ep-17-en-espanol/4804",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-115-thursday-october-22-16-00-utc/4757/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-114-thursday-october-15-16-00-utc/4657/2",
                        "https://forum.makerdao.com/t/week-20-dai-distributions-sourcecred-trial/4817",
                        "https://forum.makerdao.com/t/maker-relay-ep-17-pt-br-portugues/4810",
                        "https://forum.makerdao.com/t/maker-relay-ep-17/4798",
                        "https://forum.makerdao.com/t/discussion-increasing-surplus-buffer/4644/20",
                        "https://forum.makerdao.com/t/should-actions-be-taken-to-reduce-var-for-yfi/5203/10",
                        "https://forum.makerdao.com/t/informal-discussion-automatic-surplus-buffer-increase-cadence/5431/4",
                        "https://forum.makerdao.com/t/maker-relay-ep-19/4975",
                        "https://forum.makerdao.com/t/maker-relay-ep-19-en-espanol/4981"
                    ],
                    "GPT-summary": "The author of the post is proposing to increase the Surplus Buffer by 2m and is explaining the reasons behind it. The proposal has already been voted on before, and the author is addressing concerns that may have not been addressed before. The author is also asking for feedback through a poll. The post does not contain any advertising or collaboration requests.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Token economics",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.096354166666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/10/2020-10:25:59",
                    "content": "just a side point on the cons as previously discussed : Increasing Surplus buffer removed supply and therefore will increase USDC exposure by the same amount. My understanding is that we can’t take the risk of having a usdc at 101% and increase buffer that removes the benefit of it. It is like taking two actions that goes on the opposite direction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.722222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "4",
                    "time": "13/10/2020-10:58:23",
                    "content": "    Primoz:  Another reason for increasing Surplus Buffer that I haven’t addressed in my previous post but mentioned on the G&R call is that Maker currently has around 900m debt exposure, of which 420m is based on volatile collateral. Ideally Maker should be always aiming to have between 2% and 4% buffer available for loss coverage (these levels are based on risk premiums).   Feels like this is a key point here. Even disregarding the stablecoin issue, the total debt has increased faster than the buffer. On a sidenote @Primoz can you add an abstain option  Edit: Have updated the poll at Primoz’s request. Please vote again if you had already voted. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.944444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#4",
                    "likes": "1",
                    "time": "13/10/2020-22:49:05",
                    "content": "Seems like we’re stuck between a rock and a hard place. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.541666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#5",
                    "likes": "1",
                    "time": "13/10/2020-23:27:18",
                    "content": "Added the active-signal tag. Seems like a good idea to raise the surplus buffer due to the volatile debt exposure. Are you still considering lowering stability fees on stablecoins? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#6",
                    "likes": "0",
                    "time": "13/10/2020-23:40:58",
                    "content": "I support increasing the surplus buffer, but I hope to increase the surplus buffer of 500,000 DAI every month until the stablecoin risk is eliminated. So I chose to abstain. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "1",
                    "time": "14/10/2020-08:42:56",
                    "content": "    Jiecut:  Added the active-signal tag.   I missed that, thanks. Though for future reference we’re using #sig-status-active now alongside the #governance:signal-requests category. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#8",
                    "likes": "0",
                    "time": "14/10/2020-09:37:43",
                    "content": "    Jiecut:  Are you still considering lowering stability fees on stablecoins?   There are some pros and cons to this. In case we believe DAI price can fall faster than the CR of these Vaults, they will self unwind. Speed of CR decrease is of course related to SF: lower SF leads to slower CR decrease. In that case it makes more sense to lower SF so that there is a higher chance of repayment and less reliance for liquidation. On the other hand this doesn’t necessarily maximize return for Maker. Because if CR is pushed all the way down to 100% before self unwinding occurs, there is still a chance to collect full 1%. But then we would need to be sure there is enough DAI supply below 1 to actually collect these fees. So to me it seems like some kind of tradeoff where one would need to have a really good estimation of speed of DAI price starting to trend lower so that collection of these fees is optimal. Plus governance needs to decide whether the goal is to get rid of stablecoins quicker rather than later, because unwinding will lead to another push on DAI price upward. So for instance if fees are disabled today, it will take more time to push DAI price down from 1.01, although stablecoin exposure will drop faster (in a scenario where DAI demand < DAI supply). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.721450617283951
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#9",
                    "likes": "1",
                    "time": "14/10/2020-11:07:34",
                    "content": "Why this wish to unwind stablecoin Vaults? As far as I see it, as long as the Collateralization Ratio is high enough we could in theory have a very high share of stablecoins? Is there something I am not seeing here? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.418000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#10",
                    "likes": "0",
                    "time": "14/10/2020-19:00:41",
                    "content": "I thought that too, but the main problem is that we don’t get pay for the collaterals we own. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.916666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#11",
                    "likes": "2",
                    "time": "16/10/2020-11:01:35",
                    "content": "Closing the poll now. As said, vote to increase Surplus Buffer by 2m goes into Monday’s on-chain poll. Thank you for participating. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#13",
                    "likes": "1",
                    "time": "30/10/2020-12:41:29",
                    "content": "This passed in the October 23rd executive. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "0",
                    "time": "06/11/2020-12:41:32",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2782"
}