{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-portal-release-v0-2-4-november-23rd/11789",
            "title": "Governance Portal Release v0.2.4 - November 23rd ",
            "index": 11789,
            "category": [
                "Governance"
            ],
            "tags": [
                "governance-portal",
                "voting-portal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/bainpm",
                    "index": "#1",
                    "likes": "6",
                    "time": "23/11/2021-19:54:00",
                    "content": " Governance Portal Release v0.2.4 - November 23rd    Release Name: Peanut Common Goldeneye — (Bucephala clangula)  Version: v0.2.4  Release Date: November 23rd 2021    v0.2.4: At A Glance DUX core unit is proud to ship yet another iteration of the Governance Portal! Although we had less capacity than usual*, we were able to deliver some minor features and improvements that contribute to our goals of bringing transparency, verifiability, neutrality, and security to Maker governance. This release makes it easier for users of the Governance Portal to find relevant information at a glance, whilst still having the option to dig in deep and find all the data they need. Examples would be ENS resolving throughout the application, an indicator for passive delegate contracts and an improved design for poll cards on their overview page. Many of these features evolved from talking to members of the community, or suggestions on our idea board, so please join the conversation on Discord, or provide feedback at https://makergovernance.canny.io/  *In parallel to our work on the Governance Portal we also worked on more critical updates to the Liquidations Portal UI and the Migrations Portal UI. These frontends are not necessarily within our CU mandate but have been temporarily orphaned and therefore required some work to keep them functional. In consultation with SES and PE CU we decided that we had to prioritize this over the Governance Portal backlog.  Featured Changes  Improved polling card design  Screenshot_2021-11-22_at_21.20.22976×391 61.7 KB  We have implemented an improved card design on the polling overview page. This new design incorporates more relevant data at a glance, such as a visual vote breakdown, an indication of the current winning vote option and the category tags. It will also indicate any special attributes of the poll, such as a 10k MKR threshold that applies to some poll types.  ENS resolving  Screenshot_2021-11-22_at_20.52.011452×932 115 KB  This one was in high-demand: Adding a full implementation of ENS resolving throughout the Governance Portal. ENS domains are great for making addresses human-readable and create long-term associations with a person or entity. In this release we’ll automatically resolve addresses to their respective ENS domains if they are set up. This also works with ENS subdomains (shoutout to ultraschuppi for using ENS subdomains for his delegate contract!)  ‘Last Voted’ badge for delegates  We wanted to make it easier for users to spot inactive (or abandoned) delegate addresses and we came up with an implementation that does not require a centralized list of some sorts. This new feature checks the latest poll that the delegate contract participated in and adds a simple indicator on the delegate overview page and profile pages. The colour of the indicator changes based on how long ago the last voting activity was recorded on the blockchain. This feature is enabled both for recognized and shadow delegates and hopefully leads to less MKR tokens being dormant in governance.  Ethers.js library upgrade to better handle EIP-1559 txs Last but not least, this release also contains some more boring but important improvements to how the Governance Portal works. Ethers.js is an important Javascript library that we use for interfacing with smart contracts, and we have upgraded it to its latest version—this also required some changes in how we use this package throughout the Governance Portal. Additionally, this update caused some issues with native hardware wallet support. The hardware wallet packages used by the Governance Portal rely on long-outdated libraries that aren’t compatible with this latest release. Native HW support will be re-enabled in a future release, but for now using Metamask to manage your Ledger or Trezor wallet continues to work as it has previously.  Full Release Notes  Add ENS support to paths and rendering through the portal. Link to PR on Github: Resolve ens addresses #241  Add last voted badge. Link to PR on Github: Fix/last voted #246  Add hardware wallet pagination. Link to PR on Github: add hw address pagination #243  Ensure we always remove older polls when deduping polls. Link to PR on Github: ensure we always remove older polls when deduping polls #242  Add text to show 0 supporters. Link to PR on Github: feat: Show 0 supporterts #238  Refactor Polling API, and adding swagger for documenting endpoints. Link to PR on Github: refactor: Document polling API with Swagger, include fetching tally in the API #214  Updated dai.js ethers dependency. Link to PR on Github: Daijs ethers update #245  Fix: Delegates metric titles include tooltip. Link to PR on Github: Fix/tooltip delegates #235  Update SWR. Link to PR on Github: Chore/sc 519/upgrade swr to 1 0 #244  Refactors/Cleanup. Link to PR on Github: Remove unused jsx imports #239   ",
                    "links": [
                        "https://makergovernance.canny.io/",
                        "https://github.com/makerdao/governance-portal-v2/pull/241",
                        "https://github.com/makerdao/governance-portal-v2/pull/246",
                        "https://github.com/makerdao/governance-portal-v2/pull/243",
                        "https://github.com/makerdao/governance-portal-v2/pull/242",
                        "https://github.com/makerdao/governance-portal-v2/pull/238",
                        "https://github.com/makerdao/governance-portal-v2/pull/214",
                        "https://github.com/makerdao/governance-portal-v2/pull/245",
                        "https://github.com/makerdao/governance-portal-v2/pull/235",
                        "https://github.com/makerdao/governance-portal-v2/pull/244",
                        "https://github.com/makerdao/governance-portal-v2/pull/239",
                        "https://forum.makerdao.com/t/maker-relay-ep-73/11882",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-18-25/11827",
                        "https://forum.makerdao.com/t/maker-relay-ep-73-en-espanol/11900"
                    ],
                    "GPT-summary": "The post is an announcement of the release of Governance Portal v0.2.4, which includes minor features and improvements to bring transparency, verifiability, neutrality, and security to Maker governance. The post explains the new features, such as improved polling card design, ENS resolving, and a 'Last Voted' badge for delegates. The author also mentions that they worked on critical updates to other portals in parallel. The post invites the community to join the conversation on Discord or provide feedback on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.89831445150594
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "1",
                    "time": "23/11/2021-20:25:00",
                    "content": "You all are killing it. Thank you for these updates!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "2",
                    "time": "23/11/2021-22:34:22",
                    "content": "Ah another upgrade to test.   I can’t wait to see new features. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "23/02/2022-04:35:09",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}