{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-quarterly-review-q4-2021/12972",
            "title": "GovAlpha Quarterly Review Q4 2021 ",
            "index": 12972,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "quarterly-review"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "7",
                    "time": "01/02/2022-17:04:25",
                    "content": "Google Docs Version Here  Executive Summary  Successes  Delegate compensation has been set up and we’ve managed to recruit a few more delegates. Launched Maker Operational Manual and several new resources which make informed governance more accessible. MIPs Coverage has improved. Migration to discord. Personnel development and recruitment.   Failures  There is still not a significant amount of MKR being delegated by many of the larger MKR whales. The game-theoretical audit of Maker’s governance system that we’d planned never took place. SourceCred continues to languish due to a lack of focused attention. We haven’t quite figured out the right level of moderation to keep the forum and community discourse in a good place.   Spending  Under budget generally. Spent 194,570 of 264,950 DAI. Over budget slightly on two line items (gas and Status UI development), no major concerns.   Focuses for Next Quarter  Participation - Encouraging more MKR participation in governance through delegation. Considering the role of financial incentives. Exploration - Trying out some systems that may help governance become more tractable and accessible.   Conclusions  We are making progress on some key items for the future of governance at MakerDAO. The GovAlpha team is only getting stronger and more effective. We need to be careful not to get too bogged down in the day-to-day lest we lose track of our longer-term initiatives.   Analysis  Last Quarter’s Focuses  Delegation  “With Delegation officially online, our focus has shifted toward improving the process for all parties involved.” - Last GovAlpha Budget Proposal  Evaluation: Qualified Success GovAlpha has continued to work on delegation over Q4 2021, with our main focus being placed on the following three elements:  A trial of delegate compensation. An effort to convince larger MKR Holders to commit to delegation. An effort to expand the number of delegates available to MKR Holders.  Delegate Compensation Trial We believe that the delegate compensation trial has proved a net positive and communicates that MakerDAO is committed to delegation as a part of maintaining effective governance of the protocol and the DAO. However, as expected, the trial has brought to light several issues concerning just how we manage the compensation of delegates. All of the issues we’ve encountered so far are easily solvable, but they have resulted in a less-than-satisfactory experience for some of our Recognized Delegates. To some extent, we believe this was inevitable (which is the reason we proposed a trial before attempting to pass a MIP through the monthly governance process.) But regardless, we could have handled the issues better, and we’ll be working to improve on that over the next quarter. Delegate Recruitment We’ve observed an increase in the number of Recognized Delegates over the past quarter, which we believe is a strong indicator that we’re on the right track with our efforts in this area. Further, the newer delegates have been good examples of how the structure can draw interest from diverse sources. We’ve seen:  Existing community members opt to become Recognized Delegates. Outside organizations opt to become Recognized Delegates. Outside individuals opt to become Recognized Delegates.  We don’t feel that we can take credit for this directly, as this speaks more to the attraction of Maker and the DAO itself than anything we’ve done. However, we’ve heard from a number of the new delegates that they’ve been impressed with the resources, professionalism, and support they’ve received from GovAlpha during the onboarding process. We intend to see that this trend continues as MakerDAO attracts more Recognized Delegates. MKR Holder Delegation We have also attempted to convince some of the large MKR Holders we are in contact with to delegate their MKR to one or (preferably) more of the available Recognized Delegates. We’ve seen mixed results in this initiative so far. Initially, we had to cross some technical hurdles that existed in third-party custody platforms. These technical hurdles have been overcome in one instance and we have had assurances that they are being actively considered in another instance. GovAlpha no longer views this as a major blocker for delegation. However, despite this resolution to the technical issues, the response from some of the larger MKR holders has been less rapid than we’d hoped. We understand that with the amounts of value involved it is often very difficult for these holders to act swiftly, so we are hopeful that we’ll eventually see more MKR become active in delegation. More positively, it does appear that some of the large holders we’ve been in contact with are enthusiastic about delegation in Maker and are actively wanting to make use of the systems we have set up. We plan to keep an eye on this going forward, but we are cautiously optimistic that we should see more MKR weight delegated in the near or medium-term future.  Robustness  “As the DAO grows and governance decisions become more meaningful and impactful, Governance must continue both smoothly and effectively.” - Last GovAlpha Budget Proposal  Evaluation: Qualified Success GovAlpha has focused on robustness over Q4 2021, though not in the ways that we originally anticipated in our most recent budget proposal. Our initial plans included:  Find new tools to help improve the community governance experience. Expanding our coverage of MIPs. Obtaining a game-theoretical audit on the governance mechanisms within the Maker Protocol.  While we do believe we’ve made progress in some of these directions, we ended up going off-script as well. New Tools We’d initially anticipated a focus on the governance forum, unfortunately, while we did experiment with a couple of plugins, we did not spend the time to finalize and present these to the community. There is still room for improvement here, and we hope to investigate these more thoroughly and come to some useful conclusions in future months. One innovation that was rather obviously valuable in retrospect was the production and publication of a Governance Tracker google sheet. This sheet is updated daily and includes a breakdown of the current and future governance actions taking place in MakerDAO. It describes the stage of the process each item is at and provides a link for further information. Simple though this is, we believe that it can meaningfully help give governance participants an overview of the state of governance. A further development (though I hesitate to call it ‘new’) is the publication (finally) of the Maker Operational Manual documentation. This set of documentation provides the following critical educational and reference materials:  Reference material for all of the meaningful parameters and modules that make up the Maker Protocol An overview of governance processes at MakerDAO. An overview of the delegation and Core Unit structures. A set of links to the most useful resources available to MKR Holders and the community.  This has taken us longer than we wanted to go live, but we’re thrilled that it’s finally accessible, and that we can start building upon it iteratively. MIPs Coverage We’ve also focused on improving the MIPs coverage and support that we can provide to authors over the last quarter. In response to several observed weaknesses, we believe we’ve brought more structure and reliability to the process in a variety of ways. Primarily:  Expanding the use of checklists to ensure that regular contact is maintained with MIPs authors. Increasing the hours and attention committed to managing the MIPs process. Taking note of issues with specific MIPs or subproposal templates and working to improve their clarity and effectiveness in the future.  We still believe there are improvements we can make in this area, and we wish to focus primarily on spreading knowledge and experience to other individuals over the next few months to ensure redundancy in the process. Game Theoretical Audit There’s not a huge amount to say about this one. We planned to do it and discussed it a few times internally, but ultimately did not end up proceeding with it. There are a few reasons for this:  Any audit from a game-theory-oriented professional or academic was likely to be quite expensive. We were concerned that the time taken to understand the complexity of the Maker Protocol would further impact the cost-efficiency of any output. We became less certain of the value, especially if the governance functionality was going to change as a result of the Clean Money Proposal. We were distracted by other initiatives over the quarter.  We never really explicitly decided not to do this, it just kept getting put off, and now it’s January. Honestly, this isn’t the most professional approach we could have taken, but it does happen. We may still commission something like this over the next quarter, we haven’t yet decided. Comparative Research into DAO Governance One initiative that did end up getting pushed forwards was an investigation into the methods used for governance within other DAOs. The hope here is to identify common trends that compare favorably to Maker such that we can consider adopting them into our own governance processes. This research is currently in progress and should come to completion at some point in the next few months. We are excited to share it with everyone when the time comes.  Other Points In addition to our stated focuses, there are a couple of other initiatives and activities we’d like to highlight. Moderation and Community Friction Over the past quarter, we’ve noted an increase in friction within the MakerDAO community. So far we’ve applied a light touch in terms of moderation of the community spaces out of a desire to encourage discussion and constructive criticism. However, on balance, it’s become clear that we need to be a little more aggressive moderating those that are not engaging constructively. As the community grows and the amount of discussion and content generated grows with it, we need to ensure that moderation remains consistent and unintrusive. We’ll be taking a deeper look into moderation and the community spaces in the coming quarter to achieve this. SourceCred Management of SourceCred continues to take a backseat to our other initiatives at GovAlpha. This continued neglect has put us in a position of maintenance without active consideration of whether SourceCred is achieving the goals we want it to achieve. We currently have a couple of contributors looking into this in more detail, and we hope to come to some sort of decision about the system in the next quarter, though it is unclear at this point what this will involve. Personnel Development and Recruitment One area that we feel has gone particularly well over the past quarter is that of recruitment and skills development of contributors at GovAlpha. In addition to our facilitators, we have eight contributors now regularly working under GovAlpha, and the skills and inclinations of our contributors cover a wide area of responsibilities. Further, we’re seeing several contributors grow in confidence and ability to the point where they are actively taking on additional responsibilities, proposing improvements to processes, and generally taking initiative to improve things for MakerDAO. This has been fantastic to see and has given us a huge amount of hope and excitement for the coming year. Migration to Discord During the last quarter, we also saw the migration of the community chat platform from Rocketchat to Discord. GovAlpha worked with Content Production, Governance Communications, and Tech Ops to manage this migration. Generally speaking, the community response has been positive and we feel that we can classify this as a success overall. On the other hand, Discord appears to impose a few unintuitive constraints on role and channel management. We’ve yet to resolve these fully to everyone’s satisfaction and will continue working on them over the next few months. Hopefully, we’ll have a resolution sooner rather than later.  Spending Sources GovAlpha CU 2021 Budget GOV-001 - Public Accounting (Note our budget spreadsheet is looking a little rough in terms of clarity/formatting. We’ll look to update this for 2022, hopefully in step with any standardization initiatives from other core units.)  Actuals versus Budget GovAlpha has come in under budget once again. The principal reason for this in Q3 was something of an abundance of optimism for what the GovAlpha facilitators would have time to manage and put into motion. This led to us budgeting for several initiatives that we did not have the time/attention to execute, including:  SourceCred payout increase. Exploration Programs Travel  We did go over budget on two items last quarter. The outsourced development work on a new ‘Status UI’ ended up being more complex than initially estimated by either GovAlpha or dSpot (the developer). Despite the extra cost, GovAlpha believes that the initiative is worth continuing due to the consistent quality of work and transparency provided by dSpot at every step of the development process. Secondly, we ended up under budgeting for gas. This was due to a slight increase in poll frequency, combined with the increasing demand for blockspace on the ethereum network. Our facilitator budget item came in under budget despite it being our most consistent ongoing cost This was a result of LongForWisdom taking December off as unpaid leave.  Chart1200×742 19.7 KB   Chart1600×906 88 KB   Spending Breakdown   Chart1230×742 57.2 KB   Spending Conclusions The GovAlpha facilitators are overall happy with the spending over the last quarter. While we have continued to come in under budget, we believe this is better than the alternative, and that as we gain more experience these margins will drop. We believe that it’s better not to execute on a planned item than to execute badly as a result of limited oversight and attention. We are actively spreading management responsibilities around the contributors at GovAlpha, and believe our capacity for oversight and attention will increase in the coming months, mitigating the issue.  Next Quarter’s Focuses  Participation Although delegation has been a huge help to the governance of the Maker Protocol, there is more work to be done to bring more MKR holders into governance (via delegation or directly.) We have four main initiatives under this heading, intended to both encourage delegation and investigate other options for incentivizing governance.  Producing documentation for the Recognized Delegates to help make them aware of their options and the resources available for gathering more delegated MKR. Reaching out to core unit members and ex-foundation individuals that may hold medium amounts of MKR and encouraging them to deploy that MKR in governance via the delegates. Continuing to encourage and support larger MKR holders in deploying their MKR to our Recognized Delegates, and working with them to integrate their chosen delegates into the Recognized Delegate structure. Analyzing the costs and benefits of the options for direct and indirect incentives for governance participation, and recommending actionable items for Maker Governance to consider.   Exploration Originally our plan for this focus relied on the game-theoretical audit that we never ended up pursuing. Given the change of direction, we’ve identified some exploratory options to improve the governance experience for the MakerDAO community. Once again, we ended up with four initiatives.  Assigning and maintaining ‘impact’ scores for governance items to aid delegates, the community, and the core units in prioritizing their attention. We are hopeful this will help to counteract the increased volume of discussion on the forum. Developing and maintaining a ‘Governance Process Flowchart’ that the community can use to help them determine which governance process they should be using for a given governance action, and how to go about operating that process. Investigating customization of open-source discourse plugins to provide improved search and exploration functionality on the official forum. Working with DUX and possibly Starknet to explore gasless and/or L2 voting options for Maker.   Conclusions and Final Words The past quarter has been busy, and we’ve achieved some notable successes. Looking back though, it feels like we became too reactive in response to our day-to-day responsibilities at the expense of some of our planned initiatives. We focused heavily on delegation, which we believe was the correct decision given its importance to the future of governance in MakerDAO but this did consume a large amount of the facilitators’ attention. We’re very proud of (finally) publishing the Maker Operational Manual, and we believe that the availability of this platform will make it much easier to produce and publish future documentation quickly, alongside its other benefits. All told, it could have been better, but we made tangible progress on some of the most important of our long-term work items and the GovAlpha team is consistently becoming more capable and effective in our work for MakerDAO. As always, we welcome comments, feedback, and discussion about this review, or any of our ongoing activities. We are looking forward to another quarter working with you all. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://docs.google.com/spreadsheets/d/1o_IiwcBtN50o4rFH6Wbhhj7RDCKCNjDCHYX3WG4NGFU/edit#gid=1620670023",
                        "https://docs.google.com/spreadsheets/d/1IhTFGRh3NGL3Kp6TXj035T-898zHBSc2epEZGOPAF2k/edit#gid=934247838",
                        "https://forum.makerdao.com/t/govalpha-gov-001-quarterly-review-q1-2022/15589",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-january-2022-updated/13094"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.652322536983797
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "02/05/2022-17:04:49",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}