{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/erasing-usdc-and-hodl-peg/17415",
            "title": "Erasing USDC and hodl peg ",
            "index": 17415,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "usdc"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/CF_001",
                    "index": "#1",
                    "likes": "0",
                    "time": "24/08/2022-09:04:11",
                    "content": "Hi guys I have an idea how to erase USDC and still stay in peg. Maybe can works. If I understand it correctly USDC is there because of scaling. What if some mechanism will print DAI when is big demand and peg is more than 1 and buy DAI and burn it when is bellow 1? I was bit studining OHM mechanism where smart contract is erasing trust to entity which is buying and selling, beacuase it is doing automatically with preprogrammed conditions. This can also works for DAI. If DAI > 1 than smart contract would prind DAI and sell it for ETH and hodl ETH. If DAI is < 1 than SC will sell ETH for DAI and hodl or burn. What do you think about this idea? ",
                    "links": [],
                    "GPT-summary": "The author proposes a mechanism to erase USDC and stay in peg by printing DAI when there is a high demand and burning it when the demand is low. The author mentions studying the OHM mechanism and suggests that a smart contract could be used to automatically buy and sell DAI based on preprogrammed conditions. The author asks for feedback on the idea.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.1607142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#2",
                    "likes": "1",
                    "time": "24/08/2022-15:25:08",
                    "content": "Would not work. Adds an absurd amount of risk due to (eth’s) volatility. See simplified example below  DAI demand is in excess of $600m $600m of DAI is minted and sold for $eth at $4k per $eth DAI demand shrinks by $800m, $200m more than the original excess amount $eth is now $1k and all of the $eth in the smart contract is worth $150m, $50m short. The peg is not kept and the protocol has effectively leaked $450m of value  This also does not consider where ETH would come from to source the smart contract if a depeg down  happened first. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.7604617604617605
                },
                {
                    "author_link": "https://forum.makerdao.com/u/WhatIsPrivate1",
                    "index": "#3",
                    "likes": "0",
                    "time": "24/08/2022-16:38:25",
                    "content": "There is potentially a solution here. Currently the PSM provides two key benefits - efficiency (1:1), and stability, particularly when DAI >$1. In theory, Maker could pass governance that only allows the PSM to issue new DAI to 3rd parties when the total amount of USDC is <x% of DAI outstanding (let’s say 10%, so ~$700m vs. ~$3.5bn today). This would turn the PSM into a one-way valve (only helping with stability when DAI <$1) until the reliance on USDC drops meaningfully. Simultaneously, if/when DAI >$1, Maker can self-arb, minting DAI and selling it for USDC (or perhaps 3-pool). The profits from this arb are then used to buy ETH. If ETH goes to $0, DAI is still fully collateralized and stability remains. The real benefit is what happens when ETH doesn’t go to $0, or even goes up? Maker can use it as collateral, minting DAI against it as another valve if DAI >$1, and buying back to repay DAI if DAI <$1. If ETH drops meaningfully, it will be liquidated just like any other vault. Maker’s ETH can have special liquidation terms (risk-averse?) and fees (0%). Over time, assuming Maker is never liquidated, the ETH reserve will continue to grow. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.698491612554113
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#4",
                    "likes": "0",
                    "time": "24/08/2022-16:44:37",
                    "content": "It it possible to create a stable coin whose underlying value is based on highly volatile crypto assets?  I dont see a solid path.  Remember that the stable coin can be cashed out at will… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.266666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#5",
                    "likes": "0",
                    "time": "24/08/2022-17:09:30",
                    "content": "    CF_001:  What if some mechanism will print DAI when is big demand and peg is more than 1 and buy DAI and burn it when is bellow 1?   The issue is if the market goes one way and stay there for a long time, the system won’t work. For example, let’s say we implement this and we start with Dai below $1. What are you buying Dai with to burn it? You don’t have ETH in this situation to buy it in the first place. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CF_001",
                    "index": "#6",
                    "likes": "0",
                    "time": "24/08/2022-21:08:45",
                    "content": "Although I agree with your answer I think it is quite binary, with no offense. I mean I am 99% sure that ETH will not drop from $4k to $1k in next 2 blocks which means we must calculate with much more options than 0 and 1. For example last 18% drop last 46 hours which is 13000+ Ethereum blocks, plenty space for some smart job. It is like with nuclear power plant. 0 = turn off, 1 = explosion but in reality we are working between 0 and 1. With good management and regulations etc I think there can be some chance to find reasonable solution. Also important is how scalability DAI needs? I think we dont need infinity scalability (this would be like perpetuum mobile). Now my theory: If Ethereum has blocks every millisecond, than smart contract can sell and buy ETH / DAI how is needed. If DAI for example = 1.02 than sc can print DAI buy ETH and immediately is in 2% profit. This profit can be used in future like buffer. If ETH price go down than sc can sell part of ETH for DAI and hold it like reserves. In millisecond block it would be still ~2% profit. If ETH goes up it can buy it back for that DAI. Also there are 13% liquidation penalties which can be in favor of sc. sc would be first who can take it. With these penalties we can make bigger buffer which can be useful because Ethereum blocks are not in milliseconds. I know this is not perfect concept with everything, but I think there is a way and we can find it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.641809964726631
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CF_001",
                    "index": "#7",
                    "likes": "0",
                    "time": "24/08/2022-21:10:15",
                    "content": "Check my answer to lyt. To your question. With erasing USDC, DAI will fundamentally go up above 1 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}