{
    "poll_list": [
        {
            "title": "Offboarding Parameters for renBTC-A - November 21, 2022",
            "index": "18864",
            "option": "Yes",
            "supporting_mkr": "74,974",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/renbtc-a-proposed-offboarding-parameters-context/18864",
            "title": "[renBTC-A] Proposed Offboarding Parameters & Context ",
            "index": 18864,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "renbtc",
                "collateral-offboard",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#1",
                    "likes": "12",
                    "time": "21/11/2022-14:28:03",
                    "content": "Hey everyone, Earlier this year, Alameda Research acquired the Ren project. Given the recent bankruptcy of Alameda Research, the uncertainty significantly increased for the Ren project, mainly due to funding concerns. They recently announced that Ren 1.0 (current network and service) will be shutdown and Ren 2.0 will be deployed in parallel. The Ren 1.0 network mints are already disabled, while burns will remain enabled for 30 days. The disabling of mints means that renBTC could potentially depeg upwards, while disabling burns means that MakerDAO has a limited time frame to offboard the collateral in order to minimize potential future complications. While the situation is not an emergency, we have to move fast, especially given that MIP62: Collateral Offboarding Process defines the minimum required duration of the offboarding process. Currently there are 14 open vaults with 851k dai debt, ranging from 180-400% in collateral ratio. Given that the debt ceiling was recently already set to 0, the dai debt and positions can only be repaid. The below proposed parameters only include needed changes, the debt ceiling was recently already lowered to 0. We decided to propose a flat increase to liquidation ratio instead of using dss-lerp to gradually increase it over time because of time constraint and the amount of debt being relatively small which will not produce significant slippage based on current liquidity. The liquidation ratio is set at such a high level in order to guarantee liquidations will be triggered, as mentioned before, due to mints being disabled, there is a small possibility renBTC could start to trade with a premium. In addition, we are proposing to reduce ilk.hole from 2m to 350k dai. Given the current debt level and possibility that liquidity will be significantly diminished by the time liquidations occur, it is safer to allow for three liquidation cycles instead of one, because the liquidators might want to withdraw the underlying bitcoin on the Bitcoin network and close the arbitrage with selling on a spot CEX market. This kind of arbitrage takes much longer compared to on-chain markets. Proposed Offboarding Parameters  Set liquidation penalty to 0% Set tip to 0 Set liquidation ratio to 5000% Set ilk.hole to 350k dai  Due to the mentioned time constraint, we would prefer to recommend that this proposal goes to the on-chain governance poll and subsequent executive vote as soon as possible within the limits of MIP62, with higher importance to other items on the executive vote agenda. ",
                    "links": [
                        "https://twitter.com/renprotocol/status/1594305211115663360?t=fDEmswnteWpeAsFZ74QA3w&s=19",
                        "https://medium.com/renproject/moving-on-from-alameda-da62a823ce93",
                        "https://mips.makerdao.com/mips/details/MIP62#MIP62c2",
                        "https://maker.blockanalitica.com/vault-types/RENBTC-A/vaults/",
                        "https://forum.makerdao.com/t/calblockchain-delegate-platform/18407/5",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/76",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/30",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/31",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191/33",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/29",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/111",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/39",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/23",
                        "https://forum.makerdao.com/t/attention-renbtc-a-users-collateral-offboarding/18923",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-november-2022/19046",
                        "https://forum.makerdao.com/t/pvl-delegate-platform/16022/42",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/8",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/137",
                        "https://forum.makerdao.com/t/the-risk-core-unit-2022-year-in-review/19372"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.136654135338345
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#2",
                    "likes": "6",
                    "time": "21/11/2022-14:35:04",
                    "content": "Given the time constraints to satisfy the offboarding requirements in MIP62 and the issues raised in the above post GovAlpha will be expediting this to an on-chain poll today on the advice of the Risk Core Unit. This should allows us to satisfy the offboarding requirements while moving to swiftly offboard this collateral type, if approved by MKR voters. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "20/02/2023-20:35:05",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1945"
}