{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-dais-core-contradiction/5849",
            "title": "Discussion: DAI's Core Contradiction ",
            "index": 5849,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/decentralion",
                    "index": "#1",
                    "likes": "8",
                    "time": "31/12/2020-21:08:31",
                    "content": "Recently, I read Debt: The First 5000 Years, and The Fraying of the Petrodollar System. This has led to me thinking a lot about the nature of currency, and the way that currency systems can embody core contradictions that lead to their downfall. I’m worried that DAI contains such a contradiction, and that it will create a long-term crisis if it’s not addressed. The contradiction exists between the following three statements:  DAI is a currency. Every DAI is backed by at least $1 worth of high-quality collateral The price of DAI is pegged to be equal to $1  (See past discussion: [Poll] Should MakerDAO print unbacked DAI to solve the peg issue?) I believe that these three statements form an economic trilemma. The issue is that the value of a currency is always higher than the objective value “backing” the currency. That’s because currencies become valuable by virtue of their being currencies. There is a self-sustaining positive feedback loop–a network effect–which makes the currency valuable. Consider the example of gold. Gold is objectively valuable: it’s soft, malleable, conductive, pretty, etc. However, that objective value is a tiny fraction of its economic value. Almost all of its economic value is derived from the reliable expectation, confirmed by centuries of history and precedent, that other humans will find gold valuable and will want to use it as a currency. Other currencies (like dollars or Bitcoin) have even less objective value, but still command large valuations, entirely because they are accepted as currencies. We can encode this observation into math as follows: (Value of an asset used as currency) = (Objective own-value of the asset) + (Network value due to its use as a currency) Applying it to DAI: (Value of one DAI) = (Value of collateral backing 1 DAI) + (Per-unit value from DAI’s use as a currency) From the examples of other currencies like gold, dollars, or bitcoin, we can expect that the “Value From Being A Currency” may become much larger than “Value of Collateral Backing”. However, if we try to hold the price of DAI to be equal to $1, then we are in trouble. The “objective” value of something backed by $1 of collateral should be close to $1. Then let’s imagine, very conservatively, that the “value from being a currency” is only 1x of the objective value (even though for gold, dollars, etc, the true ratio is enormously higher). Plugging this into our equation, we arrive at: (Price of DAI = $1) = (Value of collateral backing = $1) + (Value of DAI as currency = $1) Since 1+1 != 1, there’s a contradiction here. The problem will manifest as the price of DAI consistently creeping above its peg, as excess currency-driven demand pushes the price up. In response, Maker will be forced to add larger and larger amounts of riskier collateral, in order to ensure that the supply will keep up with demand. The only way to get the equation to truly work will be to erode the value of the collateral towards zero; at that point, the equation balances: (Price of DAI = $1) = (Value of collateral backing = $0) + (Value of DAI as a currency = $1) This would make DAI into just another fiat currency; one that is backed by nothing other than an expectation that it will be valuable. Also, the version of MakerDAO that maintains the peg by loading up on risk will be much more vulnerable to shocks that could destroy the system. Therefore, I think Maker should abandon the 1 DAI == $1 price peg, but hold onto the rule that 1 DAI is always backed by at least $1 of collateral. The price would start to float higher than $1 (perhaps materially higher over time, especially in a climate of dollar-devaluation), but users of DAI could always sleep easy knowing that the value of their DAI won’t go below $1. This would make holding DAI much more appealing. The holder of DAI would have upside in the case of a weakening dollar (DAI would become over-collateralized and the price would rise), but downside protection in the case of a strong dollar (DAI would never drop below $1). As someone who is long-term bearish on the dollar (see The Fraying of the Petrodollar System), I could really use an asset with these properties. This change would be inconvenient for a certain set of users: users who (for regulatory or tax reasons) need a perfect peg for the U.S. dollar, rather than a stable cryptocurrency in general. However, for those users, I believe DAI is already strictly inferior to USDC. If you’re looking for a perfect dollar peg, then USDC is that, and there’s no reason to take all the additional risk and complexity of MakerDAO. Also, as crypto matures, the U.S. government is nearly certain to apply regulatory pressure to push users towards stable currencies that are de-facto controlled by the U.S. government. Thus, all of the users who most care about the U.S. dollar peg (for regulatory or tax reasons) are users who are likely to be pushed out of the DAI ecosystem over time, anyway. Based on this thread I understand that there’s already regulatory pressure for MakerDAO to break the peg. If we decide to go down this road, we should put some thought into how to maintain price stability without a strict peg. I think doing some expectation-setting would help; e.g. we could target a price growth rate of 3%, and use the DSR as a mechanism to help meet the target. This might seem like it’s compromising on the goal of being a stable currency. However, a system with some short-term price variation will actually be more stable than something with no apparent price volatility, but that is built on a contradiction. If unaddressed, I think the contradiction will eventually trigger a debt crisis that undermines price stability, perhaps permanently. Thanks for reading this post! I know a lot of folks here have a much deeper understanding of DAI than I do, and I look forward to reading your thoughts.  ",
                    "links": [
                        "https://www.lynalden.com/fraying-petrodollar-system/",
                        "https://forum.makerdao.com/t/poll-should-makerdao-print-unbacked-dai-to-solve-the-peg-issue/3589",
                        "https://en.wikipedia.org/wiki/Trilemma#In_economics",
                        "https://www.lynalden.com/fraying-petrodollar-system/",
                        "https://forum.makerdao.com/t/brainstorm-2021-mission-and-objectives/5809",
                        "https://forum.makerdao.com/t/brainstorm-2021-mission-and-objectives/5809/26"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.00487812117559
                },
                {
                    "author_link": "https://forum.makerdao.com/u/decentralion",
                    "index": "#2",
                    "likes": "1",
                    "time": "31/12/2020-21:15:31",
                    "content": "Aside: In a previous post I asserted that it was vitally important that MakerDAO keep the $1 price peg:    [Poll] Should MakerDAO print unbacked DAI to solve the peg issue?   From my perspective as a user “DAI is exchangeable for 1 USD” is the core value prop of DAI, and thus an end-in-itself. “DAI is backed by 1 USD of collateral” is just a means to that end. So if they are in conflict, it seems clear that the DAI backing should be sacrificed, rather than the stable peg. For me, this is not just hypothetical–I run the SourceCred treasury and currently we pay all of our contributors in DAI, but Grain is pegged to USD, so I’ve started needing to do spot currency price conversions every time someone redeems their Grain. It’s a pain. For us to keep using DAI long term, it’s important that Maker finds a way to keep a stable peg.   Since I’ve totally reversed that position, I’ll add a quick explanation. I’ve realized that inasfar as I actually need a currency that is exactly pegged to $1, I should be using USDC, and there’s no practical / incentive compatible reason to use DAI in lieu of USDC as a dollar peg. However, I like MakerDAO and want to keep using and supporting it. But since we’re dealing with a financial asset, there needs to be a rational reason to hold it. Ensuring that DAI is always backed by strong collateral, but also allowing that it will float upwards over time, would make it an asset worth holding in its own right. ",
                    "links": [
                        "https://forum.makerdao.com/t/poll-should-makerdao-print-unbacked-dai-to-solve-the-peg-issue/3589/15"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.701680672268907
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#3",
                    "likes": "1",
                    "time": "31/12/2020-22:17:10",
                    "content": "I get the consumer appeal to have an asset that accrues value over time, but that’s half of the equation. How would you incentive vault owners to get a loan (and pay daily fees for it)on such an asset if it can’t be used to buy other crypto, invest in other ventures such as yield farming or other or use it in real world expenses? Ultimately dai is as worthy as the collateral backing it and that can be measured in other units of account, the issue is having it measured in a unit of account that is both convenient for the vault owner drawing debt as for the dai user consuming the end product. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9393939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/decentralion",
                    "index": "#4",
                    "likes": "0",
                    "time": "31/12/2020-22:41:55",
                    "content": "    mario:  How would you incentive vault owners to get a loan (and pay daily fees for it)on such an asset if it can’t be used to buy other crypto, invest in other ventures such as yield farming or other or use it in real world expenses?   This non-pegged DAI would still be a valuable asset, much like other cryptocurrencies like ETH, you would be able to use it to buy other crypto or invest in other ventures. However, we can anticipate that it would have much lower volatility than ETH. ETH is “backed by” the eventual value of the Ethereum network, and that perceived value fluctuates wildly based on the anticipated growth rate and future success of Ethereum. In contrast, DAI is backed by a diverse portfolio of crypto assets. That portfolio will experience lower volatility than Ethereum (since it will be a diversified portfolio including ETH among other things), which will translate to lower volatility for DAI. Thus, for people who want a low-volatility cryptonative asset, it will be more desirable than (say) ETH. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#5",
                    "likes": "0",
                    "time": "31/12/2020-23:38:13",
                    "content": "Would EURO-DAI or potentially XDR-DAI be a solution for this problem? If the issue is that we a simply bear-ish on USD in general then would a asset pegged to a different currency not suffice? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/decentralion",
                    "index": "#6",
                    "likes": "4",
                    "time": "01/01/2021-00:01:57",
                    "content": "No. The underlying issue applies for any system which is pegging the price of the currency to the value of the collateral backing the currency. I believe there’s at least a close metaphor here to the Impossibility Trilemma of international economics. Basically, it states that a monetary system cannot have the following three properties at the same time:  A fixed foreign exchange rate Free movement of capital Independent monetary policy  We can map this onto a similar trilemma in the Maker/DAI case:  A fixed token price Permissionless ability to open/close CDPs Independent policy on DAI issuance and risk tolerance  Right now Maker is succeeding at having a fixed token price, and entering/exiting the system is mostly permissionless (debt ceilings are kind of an exception). But the independence of Maker’s monetary policy is getting compromised by by maintaining the peg, see this thread of emergency peg management as an example. Basically, because the price was sliding up off peg, Maker was forced to take on more risk than would have otherwise been comfortable, i.e. it sacrificed its monetary authority to preserve the peg. If this contradiction is not fixed, Maker’s monetary autonomy will further erode. The simplest “errosive path” would be to allow ever-larger amounts of USD stablecoins into Maker, as that will be most effective at stabilizing the USD peg. However, this will make Maker directly vulnerable to coercion by US regulators, who will have the ability to threaten Maker by blacklisting Maker’s addresses in the USD stablecoin contracts. The alternate path would be to stay away from USD stablecoins, and instead risk-load on ever more exotic assets. This path could work for a long time (e.g. Tether is doing OK despite sketchy collateralization) but incurs significant long-term blowup risk. ",
                    "links": [
                        "https://forum.makerdao.com/t/emergency-peg-management-governance-and-risk-meeting-wednesday-july-29-6-00-pm-utc/3446/5"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.799261083743843
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#7",
                    "likes": "4",
                    "time": "01/01/2021-09:45:48",
                    "content": "I wouldn’t say that DAI is a currency. It’s a perpetual debt (until ES) debt that is pegged on the US dollar. A bank deposit, a bank note (during the gold standard), or a USDC stablecoin are exactly the same (backed by at least $1 of assets). None are trading above par (but are used because it’s more convenient than the underlying). All those instruments are just like the currency except when they don’t. The issue we face is that supply is disconnected from demand because we don’t offer arbitrage with the currency (you can’t deposit $ to get DAI or the opposite). Thanks to the PSM this is no longer the case (but we have to hoard USDC and not the currency which is not ideal). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.111111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#8",
                    "likes": "0",
                    "time": "01/01/2021-15:10:21",
                    "content": "I agree with you basic analysis that Dai will always tend to trade above its peg due to the fact that its backed by a full $1 in collateral.  We can use tools like the PSM to maintain the peg but this requires us to hoard large amounts of USDC, which creates its own risks.   My preferred solution to this problem is to issue unbacked dai (i.e. have ~1-2% of DAI be unbacked by collateral or therefore each Dai is backed by $0.98).  This would likely be enough to maintain the peg and we could use the proceeds from issuing unbacked dai to buy assets that are not under central control and countercyclical so that they would gain in value when the cryptomarkets were falling (probably inverse synthethics or maybe put options would be the best), which would be the main reason for Dai to fall below its peg, and then we could use the value of these to buy back Dai if the Dai price went below the peg. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.919146825396825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#9",
                    "likes": "2",
                    "time": "01/01/2021-18:21:49",
                    "content": "I second @latetot here.  MakerDao growing a reserve pool of put options or inversely correlated assets (compared to the largest asset pools being used as collateral in the CDPs) makes a lot of sense to me. A solution like this one would provide a stronger peg, greater confidence in the system as a whole, and most importantly protection from major crashes in the price of the main collateral assets.  Bottom line, it is safer and more resilient system wise for MakerDao to operate this way. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.68287037037037
                },
                {
                    "author_link": "https://forum.makerdao.com/u/decentralion",
                    "index": "#10",
                    "likes": "3",
                    "time": "01/01/2021-21:03:40",
                    "content": "    SebVentures:  I wouldn’t say that DAI is a currency.   Why would you say DAI isn’t a currency? It’s used as a store of value, a medium of exchange, and a unit of account. What property of currencies do you think DAI is missing?   It’s a perpetual debt (until ES) debt that is pegged on the US dollar.   One of the main theses of Debt: The First 5000 Years is that most currencies are perpetual debts. Consider that early banknotes were debt of the bank, which promised to redeem the note for gold upon receipt. Consider that almost all of the dollars you might have–in a bank account, in a money market fund, or held in t-bills–are also debts (of the bank, fund, or U.S. government).     SebVentures:  Thanks to the PSM this is no longer the case (but we have to hoard USDC and not the currency which is not ideal).   Being forced to hoard USDC is an example of Maker giving up its monetary autonomy so as to support the peg. It also makes Maker vulnerable to pressure from US regulators. The stablecoin act indicates clear interest by US lawmakers to assert control over any project issuing a dollar-pegged asset. While the threat of forcing every Ethereum node to censor transactions that are involved in stablecoin production is somewhat outlandish, what’s not outlandish at all is that the US could force USDC to blacklist Maker so as to prevent “illegal stablecoin issuance”. ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Banknote#Birth_of_European_banknotes",
                        "https://www.thebharatexpressnews.com/u-s-lawmakers-seek-to-make-stablecoins-illegal-without-federal-approval/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.712121212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#11",
                    "likes": "0",
                    "time": "01/01/2021-21:28:46",
                    "content": "The larger community might have an issue with unbacked DAI (I’m writing ‘might’ as there have been cases where unbacked stablecoins are still widely used.) It looks as if it is much easier to push the peg up than down, so we might have to explore different ideas. Implementation might be harder than expected. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.817460317460317
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#12",
                    "likes": "0",
                    "time": "01/01/2021-23:01:35",
                    "content": "    decentralion:  One of the main theses of Debt: The First 5000 Years is that most currencies are perpetual debts. Consider that early banknotes were debt of the bank, which promised to redeem the note for gold upon receipt. Consider that almost all of the dollars you might have–in a bank account, in a money market fund, or held in t-bills–are also debts (of the bank, fund, or U.S. government).   It depends on your perspective. As bankers, I think money is more precisely outside money, the rest being credit. Outside money is something that doesn’t have a net supply in the considered system. Gold and bitcoin are outside money. The US dollar in the form of FED liability (deposit or notes/coins) is outside money because it is outside of the competitive business. DAI is not a unit of account, $ is. Currently, most algorithmic stablecoins have a value above $1 even when they are backed by nothing. It’s not because of network’s effects. It’s just supply/demand imbalance and the lack of arbitrage. The space is young. I wouldn’t worry about that. I fully agree with your presentation of the impossible trinity. I also already wrote on the link between interest rates and exchange rates (which doesn’t find strong empirical evidence currently, but with all the farming …). ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Banknote#Birth_of_European_banknotes",
                        "http://www.minneapolisfed.org/research/sr/sr374.pdf",
                        "https://medium.com/financial-narratives/how-money-market-interest-rates-affect-stablecoins-f35867f55a98"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.550925925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#13",
                    "likes": "0",
                    "time": "02/01/2021-04:18:26",
                    "content": "I saw many mention Impossible Trinity but they forget that the Maker system doesn’t hit all three at the same time and thus doesn’t face the same issue.   a fixed foreign exchange rate - Yes   free capital movement (absence of capital controls) - No -Instruments such as debt ceiling -Friction between exchanging from fiat to Dai and vice versa.   an independent monetary policy - No -Maker system can’t print unlimited unbacked Dai for circulation   So instead of Impossible trinity, Maker system’s issue is more closely related to the Gold Standard’s issues, which is yes, Dai’s value is likely to be appreciated against USD. However, in reality, the natural appreciation won’t be big as if there’s inflation of USD, it should in theory also appreciate the value of collaterals, which allows users to mint more Dai and bringing back the peg. There are some lost Dai that also reduces the effective circulating supply but that also won’t be big enough to impact it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3106884057971016
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#14",
                    "likes": "2",
                    "time": "02/01/2021-04:31:03",
                    "content": "Also, Dai is not supposed to hedge against USD inflation or deflation. It’s soft pegged to USD. The Maker governance can vote to create different types of Dai such as EuroDai of course. Or even create a kind of Dai that’s not pegged to certain currencies. But changing the existing Dai system that’s soft pegged to USD midway and thus effectively breaking the peg can have far-reaching consequences. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.153061224489797
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#15",
                    "likes": "2",
                    "time": "02/01/2021-09:19:09",
                    "content": "    Doo:  free capital movement (absence of capital controls) - No   I wouldn’t say that. You can easily convert DAI to $ going to USDC then an exchange.     Doo:  Maker system can’t print unlimited unbacked Dai for circulation   It can as much as anyone else. I don’t know any serious country with a fiat currency issued by a central bank with an insolvent central bank. But I agree we don’t have control of our monetary policy if we want to keep the peg.     Doo:  Maker system’s issue is more closely related to the Gold Standard’s issues, which is yes, Dai’s value is likely to be appreciated against USD.   Do you have a reference highlighting how banknotes traded at a premium during the gold standard? Very good discussion to start the year by thinking deep  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.765833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#16",
                    "likes": "3",
                    "time": "02/01/2021-11:30:34",
                    "content": "“I wouldn’t say that. You can easily convert DAI to $ going to USDC then an exchange.” Maybe a few million sure, but I am not sure whether Dai can be easily converted at $ billion level right now. Of course, there are ways to use USDC vault or PSM but as they are capped right now, they are akin to capital controls. “It can as much as anyone else. I don’t know any serious country with a fiat currency issued by a central bank with an insolvent central bank.\" “But I agree we don’t have control of our monetary policy if we want to keep the peg.” In traditional fixed exchange currency, if their currency is appreciating due to a demand, then the central bank can simply print its currency to keep the peg. As Financial Times noted of Hong Kong Dollar “If there is demand for the Hong Kong dollar, the currency will test the strong boundary of its tradable range. If this happens, the Hong Kong Monetary Authority steps in and prints as many new Hong Kong dollars as it thinks necessary to depress the interest rate.” However, in the case of the Maker system, there’s no way to print unlimited Dai to buy up for example USDC to keep up the peg at least for now. However, this also shields the system from the opposite problem that many countries faced before, which was in cases when fixed currencies faced depreciations. If the currency is devalued, then the country with devalued currency must “sell” its foreign reserve and buy its own currency to bring back the peg. However, only few have foreign reserve that is bigger than its total money supply (as central banks can print its own currency without collaterals backing it). This is very different from the Maker system where every Dai is backed by collaterals. Therefore, at least for now, impossible Trinity doesn’t apply to the Maker system. “Do you have a reference highlighting how banknotes traded at a premium during the gold standard?” To clarify, banknotes were traded at a premium against goods and services. Similar to how appreciated Dai would be able to buy more goods and services. This is considered deflation. There are several researches including this one that might find interesting.   nber.org    c11482.pdf 422.68 KB      “As noted by Choudhri and Kochin (1980), Spain’s abstention from the gold standard insulated that country from the general deflation; New Zealand and Australia, presumably because they retained links to sterling despite early abandonment of the strict gold standard, did however experience some deflation. Among countries on the gold standard as of 1931, there is a rather uniform experience of about a 13% deflation in both 1930 and 1931. But after 1931 there is a sharp divergence between those countries on and those off the gold standard. Price levels in countries off the gold standard have stabilized by 1933 (with one or two exceptions), and these countries experience mild inflations in 1934-36. In contrast, the gold standard countries continue to deflate, although at a slower rate, until the gold standard’s dissolution in 1936” Here’s a chart that you can see the difference more clearly. You can see that starting in 1971 when President Nixon officially abandoned the gold standard, inflation increases rapidly (inflation was already happening before the official declaration as the government relaxed rules to expand monetary supply to deal with its overvalued dollar). 1044×732 71.4 KB ",
                    "links": [
                        "https://www.nber.org/system/files/chapters/c11482/c11482.pdf",
                        "https://www.nber.org/system/files/chapters/c11482/c11482.pdf"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.420227621840525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#17",
                    "likes": "1",
                    "time": "02/01/2021-12:25:12",
                    "content": "@Doo and the rest, What happened in 1971? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#18",
                    "likes": "1",
                    "time": "02/01/2021-12:38:37",
                    "content": "But to be honest, there are many factors beside President Nixon’s decision to give up the gold standard in 1971 that dramatically changed the US and global economy. For example, 1973 oil crisis that soon followed heavily impacted the US manufacturing industry which relied on large oil consumption such as its automobile industry. This was one of many catalysts that led many to move offshores especially Mexico and also as manufacturing industry was crucial to strong middle class in US, its decline also meant a decline in middle class size. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9098639455782305
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#19",
                    "likes": "1",
                    "time": "02/01/2021-17:09:12",
                    "content": "Dai is trading above the peg because its pool of available collateral is artificially constrained by being limited to blockchain-native, and specifically ethereum-compatible assets. Once the DAO gains the ability to onboard “real world assets” at scale, there will not be deflationary pressure until the world runs out of assets that have liquidity needs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.928571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#20",
                    "likes": "0",
                    "time": "02/01/2021-18:19:32",
                    "content": "    Doo:  In traditional fixed exchange currency, if their currency is appreciating due to a demand, then the central bank can simply print its currency to keep the peg.   Good point citing the Hong Kong Monetary Authority because they also try to keep the peg. You can find more information on their annual report but TL;DR they are still solvent (assets > liabilities). They don’t print unbacked HK$ but they invest in $-denominated instruments. It’s quite similar to the USDC PSM. The main difference is that USDC is adding a risk (Circle) and we don’t get the yield, we leave it to Circle. This gives us the illusion to have everything on-chain. image291×541 41.5 KB I don’t see any intrinsic reason for DAI to be valued over $1 on the medium term. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.74537037037037
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#21",
                    "likes": "0",
                    "time": "03/01/2021-02:49:37",
                    "content": "Letting the redeemable value of Dai below $1 should be a easy and reliable way to lower the price of Dai. When it is trading below, the redeemable value can be raised back to $1, then DSR/interest rate increases applied to restore demand. As I understand it, this was the original design of TRFM. It may be preferable to $500M of centralized stablecoins risk. In addition, the freed collateral value can be accounted in the surplus and spent. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.885416666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#22",
                    "likes": "0",
                    "time": "03/01/2021-04:13:57",
                    "content": "Please note that I mentioned “However, only few have foreign reserve that is bigger than its total money supply.”  Hong Kong is one of those examples. Also, Hong Kong’s example is a case for Maker not being bound by traditional Impossible Trinity that many mentioned. If you do have collateral for each that’s printed, then it no longer applies. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.692708333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#23",
                    "likes": "0",
                    "time": "03/01/2021-04:25:29",
                    "content": "But either way, Dai itself is slightly deflationary if nothing changes. For example, assume none mint additional Dai and they can only close their positions. There will be Dai that’s lost or left as dust. As there’s reduced circulating supply and yet demand might increase due to users that need to pay back Dai with stability fee, the price of Dai in this case will be higher. So going back to what @g_dip mentioned, RWA and large collaterals help to ease this deflationary nature. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.107886904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#24",
                    "likes": "1",
                    "time": "03/01/2021-04:41:41",
                    "content": "Stability fees are collected by the DAO in real time and are inflationary. For example, if the system was comprised of one vault that held 100 Dai in debt and had a stability fee of 2%, the outstanding supply of Dai at the end of one year would be 102. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#25",
                    "likes": "0",
                    "time": "03/01/2021-05:31:36",
                    "content": "But then that vault can not be fully closed as there’s only 100 Dai circulating in the system. It might be auction off but then there’s no extra Dai to auction with anyway. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#26",
                    "likes": "1",
                    "time": "03/01/2021-05:40:33",
                    "content": "Ah actually, @g_dip you are right. Surplus Dai is auctioned off with MKR. So then that extra Dai is in circulation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.476190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#27",
                    "likes": "0",
                    "time": "03/01/2021-09:40:55",
                    "content": "    Doo:  But either way, Dai itself is slightly deflationary if nothing changes. For example, assume none mint additional Dai and they can only close their positions. There will be Dai that’s lost or left as dust. As there’s reduced circulating supply and yet demand might increase due to users that need to pay back Dai with stability fee, the price of Dai in this case will be higher.   This is a limitation we impose on ourselves (and because the space is too young). We can always buy $-denominated assets (safe and liquid assets) to generate DAI to keep the peg. Internally 1 DAI = $1. Interest rates are positive in dollars so it’s easy. What is missing to have something less dependant on the US regulated market is a DAI-yield curve and a liquid DAI-bond market. But what that means in DeFi is an open question. In my view:  We either accept regulation and keeping DAI <= $1 is easy. We want to stay crypto pure and we have to invent the yield curve and the bond market which is hard  But by no means there is a convincing theory that DAI should be worth more than $1. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.627056277056277
                }
            ]
        }
    ]
}